[
  {
    "score": 10482,
    "title": "Client is mad about my watch.",
    "selftext": "So last week were at client for an audit and I met the CEO and CFO and were talking. The CEO made a comment saying, \"That's a nice watch for just a staff.\" Today I come into the office with an email from the partner asking me to not wear my grandfathers watch at clients. Apparently I disrespected the clients employees by \"flaunting my wealth\" while we were there. I guess my negative net worth hit an integer overflow and now I am intimidatingly wealthy.\n\nHow would you all respond to this? I have to go back next for their single audit.\n\n  \n[The Watch in question](http://imgur.com/a/nzcX1p0)",
    "subreddit": "Accounting",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 10482,
    "downs": 0,
    "created_utc": 1707748653.0,
    "media": null,
    "is_video": false,
    "num_comments": 2496,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional vent about client disrespect and potential confrontation with little actionable content.",
    "composite_score": 6.409194856972226
  },
  {
    "score": 5384,
    "title": "Mackenzie Consulting just changed the game, guys",
    "selftext": "So our company decided to invest in some high-level consulting, and we brought in the legends over at Mackenzie (not to be confused with that other overpriced think tank or maybe yes, I won't tell). And let me tell you… these guys DELIVERED.\n\nTheir first big insight? ”You should cut costs and increase revenue.” Absolutely revolutionary. I’m honestly embarrassed we didn’t think of this sooner. Like, why are we even wasting time with GAAP and internal controls when we could just… make more money?\n\nThen, for maximum efficiency, they suggested we streamline operations, which—if you don’t speak consultant—means firing half the accounting team and forcing the survivors to “embrace agility”. But don’t worry, they left us with a comprehensive strategy deck (a PPT that probably cost $500K to make) explaining how we can “leverage collaboration” using… a Google Sheet.\n\nAnd the best part? Their digital transformation roadmap involved renaming our existing Excel file to ERP_System_v1_FINAL(FINAL)_USE_THIS_ONE.xlsx and calling it a day. Absolute visionaries.\n\nAnyway, if anyone needs me, I’ll be in the break room staring into the abyss while Mackenzie strategizes how to replace me with ChatGPT and a VLOOKUP.",
    "subreddit": "Accounting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 5384,
    "downs": 0,
    "created_utc": 1741513636.0,
    "media": null,
    "is_video": false,
    "num_comments": 235,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Sardonic critique of consultants with an emotional tone rather than steps or insights.",
    "composite_score": 5.652641709119054
  },
  {
    "score": 4521,
    "title": "Working with trust funds babies made me depressed about my life.",
    "selftext": "I cannot think of any other career that makes you question your life than accounting. \n\nDoctors get sick patients and are grateful they don’t have the health issues that the patient generally has. \n\nLawyers get client with messy legal issues and are thankful they aren’t the ones with these issues. \n\nAccountants: we get trust fund babies getting millions of dollars when they reach a certain age and you sit there and know that no matter how hard you work you wouldn’t be able to attain such wealth in a 100 years. \n\nI’m so spiteful, I know. This is depressing.",
    "subreddit": "Accounting",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 4521,
    "downs": 0,
    "created_utc": 1679925538.0,
    "media": null,
    "is_video": false,
    "num_comments": 780,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Personal, emotional grievance about wealth disparity and life prospects; expresses depression.",
    "composite_score": 5.8141560749479915
  },
  {
    "score": 4061,
    "title": "My life changed this week",
    "selftext": "I’m a CPA I’m 31 I’ve had a decent career. I just got diagnosed with leukemia and none of it seems worth it looking back on it. Of course, I’ve earned myself a decent salary and decent insurance and nice remote role which probably is all privilege a lot of others are not offered. \n\nI just always felt I had a lot more road left to run on my career and now that face a real life risk of losing my life, it just seems so meaningless. \n\nI have a wife, a toddler, and now that I’m hospital-bed ridden I just see things so much differently. I really worry I will not have left enough behind for them to thrive. Just needed a place to vent I guess. My mind is generally a dark place and a diagnosis like this does not help.\n",
    "subreddit": "Accounting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 4061,
    "downs": 0,
    "created_utc": 1740619628.0,
    "media": null,
    "is_video": false,
    "num_comments": 231,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Personal health crisis and existential angst expressed; emotional vent.",
    "composite_score": 5.518983911514238
  },
  {
    "score": 3645,
    "title": "Hilarious how far knowing Excel can make you go",
    "selftext": "Partners suddenly have a profound respect for me after presenting on Excel efficiency. Functions such as VLOOKUP and XLOOKUP really got them going. When I brought out the SUMIF, it was pandemonium.\n\nThis isn’t a shitpost either, there has been a sensible change in their attitude towards me ever since the presentation.\n\nI gave them this one on a particularly complicated sheet and it literally blew their minds. \n\n=XLOOKUP(IFERROR(IF(AND(ISNUMBER(SEARCH(\"A\", A2)), LEN(A2)&gt;5), \"FoundA\", \"NotFoundA\"),”DefaultA\"),FILTER(IF(AND(B2:B100&gt;10, C2:C100=\"Yes\"),D2:D100,\"\"),D2:D100&lt;&gt;\"\"),E2:E100,IFERROR(XLOOKUP(IF(OR(ISNUMBER(SEARCH(\"B\", F2)), G2=\"Active\")”FoundB\", \"NotFoundB\"),H2:H100,I2:I100,”Not Found\"),”Fallback\"),0,1)",
    "subreddit": "Accounting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 3645,
    "downs": 0,
    "created_utc": 1739665567.0,
    "media": null,
    "is_video": false,
    "num_comments": 385,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Shares a mental model about Excel skills boosting professional respect with concrete examples.",
    "composite_score": 5.590110316654836
  },
  {
    "score": 3634,
    "title": "Toxic Culture working with Indians",
    "selftext": "Currently working in one of the Big4 firm where we work with different nationalities. I’ve work with Indians and they are really good at micromanaging which is really frustrating and draining. \n\nThey don’t have any empathy with their co-employees and all they do is complain about our finished task as if we didn’t do anything right. \n\nThey always wanted updates every now and then. Which I have an ADHD where I hyperfocus on a task. They don’t know how to work with other nationalities and all I feel is I need to adjust with them. \n\nIts been 7 months since I am with the firm and everything is draining because of my indian colleagues. ",
    "subreddit": "Accounting",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 3634,
    "downs": 0,
    "created_utc": 1753269629.0,
    "media": null,
    "is_video": false,
    "num_comments": 986,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Explicit vent about coworkers by nationality with negative stereotypes; emotional judgment.",
    "composite_score": 5.725162991529874
  },
  {
    "score": 3621,
    "title": "I got laid off a month ago from Big 4 and just got a job offer for $105k today. A 60% increase in salary. I’m 24 years old and it feels insane",
    "selftext": "It’s actually crazy that people were right in saying it will be okay. I thought I was screwed entirely, and didn’t apply for 2 weeks.\n\nI finally just started going for positions that I didn’t even think I was qualified for, but had 10 interviews lined up in 2 days.\n\nI had my first second round with my dream company, and somehow the hiring manager and CFO came back in that interview room and said “let’s talk salary”.\n\nHad a major poker face during negotiations, and even got an email after I got home saying they bumped up compensation $5k as incentive to join.\n\nSometimes getting canned really does work out.",
    "subreddit": "Accounting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 3621,
    "downs": 0,
    "created_utc": 1685575706.0,
    "media": null,
    "is_video": false,
    "num_comments": 416,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal career update with no substantive content to classify as a guide or list.",
    "composite_score": 5.566516473464918
  }
]