[
  {
    "score": 611,
    "title": "YouTube has been insane. Really wish I started earlier",
    "selftext": "I run an SEO consultancy and for years i only touched Youtube for parasite stuff (ranking vids to hijack traffic). never really bothered building proper channels.\n\nabout 2 months back i decided to test it for real. started 2 niche channels - auto (around 6k subs now) and real estate (about 3k). both already monetized and the growth is way better than i expected.\n\nwhat blows my mind is how content keeps working for you. vids i dropped weeks ago are still pulling views daily. even small sub bases convert well. feels nothing like insta/tiktok where stuff just dies in 24hrs.\n\nlowkey annoyed i didn’t do this earlier. could’ve been such a good client service but i brushed it off thinking it’s too much work.\n\nWhat I have learned is CTR + watchtime is the code for any video's high visibility. \n\nanyone else here running an agency + playing with Youtube? how’s it going for you?",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 611,
    "downs": 0,
    "created_utc": 1758560524.0,
    "media": null,
    "is_video": false,
    "num_comments": 192,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.664530076649449
  },
  {
    "score": 366,
    "title": "Doing 60-100k a month in revenue. Going crazy",
    "selftext": "My average ticket is 500-750 a month. I bring in 30-60 clients a month. I have completely mastered bringing in new clients. But they’re  mostly garbage. Im stuck in this horrible cycle of being so busy that it’s hard to properly serve clients causing attrition, but I can’t pull back because I now have additional expenses and I need to keep the lights on. I have minimal staff. I so badly want to hit the reset button but I know that’s simply not possible. Has anyone else been In This situation? Essentially my service and product cannot keep up with our marketing. Im actually paying myself LESS than when I had 75-100 clients now that I have 200+. Also with the rapidly changing economy, clients have never been more demanding and quick to issue chargebacks.  I want to sell but we all know agency’s are inherently worthless without a saas angle or tangible assets. I need a vacation ",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 366,
    "downs": 0,
    "created_utc": 1709869352.0,
    "media": null,
    "is_video": false,
    "num_comments": 248,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.482765737799958
  },
  {
    "score": 344,
    "title": "The Strategy of Iman Gadzhi, the $30M Scammer",
    "selftext": "I’m revealing Iman’s strategy. How he fools a nation of naive youngsters.\n\nI couldn’t believe how simple it was. \n\nThis took me hours of research. I’ll tell you the main tricks here so you don’t waste your days consuming his content.\n\nMarket:\n- Youngsters.\n- Age: 15-19.\n- They make most of his market.\n\nThey were intentionally chosen for his “educateio” platform. Their brains have not developed extreme abstract thinking yet. This makes them naive. And a great target.\n\n\nSell the dream\n\n- He is selling the dream. The dream of becoming rich like him.\n\nAnd of course, the ideal way, is through an agency. Which one? SMMA, of course.\n\nThe dream of retiring your parents. The dream of the rolls royce’s and private jets. Does andrew tate ring a bell?\n\n\nThe formula\nSo far, I’ve noticed this pattern across multiple gurus.\n\nMake $1000/m with any business model.\n\nSell a course.\n\nProfit.\n\n\n\nCredibility\n\nWhat better way to establish credibility than followers and yachts?\n\nThe guy bought instagram followers for the last 12 months.\n\nThis helps him look more “LEGIT”, to fool more people.\n\nImagine this: You are new to the space. You see someone in rolls royces, talking about how you can succeed, just like him. With millions of followers, everywhere. It’s pretty hard to not believe.\n\n\nHis “Cash-Cow” agency\nThe guy had £200,000 in liabilities on his agency. \n\nHe was barely making any money.\n\n\nTo the people that bought his products:\nRefund if you can. \nMoney is better spent on books and practice. \nYou must be failing fast. That’s how you learn. Buying someone else’s courses will make him rich, not YOU.\n\n\nNote: if you have any insights on him, drop them in the comments. I’ll add them in the post.",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 344,
    "downs": 0,
    "created_utc": 1694272019.0,
    "media": null,
    "is_video": false,
    "num_comments": 180,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.401658382507867
  },
  {
    "score": 309,
    "title": "Three digital marketing agencies, 181 clients, $6M+/yr, 49 employees - AMA",
    "selftext": "I started an agency over a decade ago with no clients, no team, and no clue. Just me, a laptop, a cell phone, and my dining room table.\n\nToday, I own three niche digital marketing agencies, generate over $6 million a year, lead a team of 49 employees, and I'm now rolling out a brand for the portfolio. \n\nThe journey has been sometimes smooth, often bumpy, and I’ve had to learn a lot along the way...sales, systems, hiring, delegation, client churn, you name it.\n\nI don't have a creative background. I was a software developer with an MBA who saw a need and jumped in. I made all the rookie mistakes—saying yes to bad-fit clients, undercharging, hiring &amp; firing too fast (and too slow), and not understanding how to manage the chaos that comes with agency life. It wasn’t until I started building processes and focusing on specific niches that things started to click.\n\nOne of my biggest turning points was getting clear on who we serve and what problems we solve. That’s when sales got easier, marketing made more sense, and we could finally build recurring revenue. With MRR, I could start to envision a future for the agency. That's when the vision expanded into multiple niche agencies.\n\nI also had to level up personally—reading, writing, getting coached, having difficult conversations, setting boundaries, mediation, counseling, and becoming self-aware. The unglamorous hard work that actually makes you a better person.\n\nI just figured I’d open the door and share what I’ve learned with anyone who’s in the trenches right now or trying to scale without burning out along the way.\n\nCommon questions I get often:\n\n* How do you get clients?\n* What roles did you hire first?\n* What would you do differently?\n* How do you deal with bad clients or scope creep?\n* How do you balance growth with profitability?\n\nAsk me anything. The more details you provide, the better I can answer your question. I’ll share with you what worked for me and, as importantly, what didn’t.\n\n\\~ Erik",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 309,
    "downs": 0,
    "created_utc": 1743556830.0,
    "media": null,
    "is_video": false,
    "num_comments": 467,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.561484620371335
  },
  {
    "score": 261,
    "title": "0-30k a Month - What I learnt running a marketing agency for 5 years",
    "selftext": "I’ve been meaning to make this post for a while because a lot of my agency success has actually come from Reddit. I personally started to see the most success in my life when I realized there was no point in trying to gatekeep information. So I guess you could say this post is me doubling down on that.\n\nI think this post will be useful to agency owners at all sizes. I’ll walk you through how I got my first few clients, how I scaled to my first 30k month, and I’ll touch on a couple of life lessons I picked up along the way. So let’s get into my agency story time.\n\n**Quick Backstory**  \nMy agency journey started in 2020, but my ecom journey probably started in middle school about 15 years ago. My first business started off with $100 I got for Christmas and me just recognizing the demand for cheap clothing and knock-offs. From ages 12 to 16 I sold everything that was trending. If you’re my around age, think silly bandz, G-Shocks, crewnecks, snapbacks, OBEY etc.\n\nBy 16, I expanded past selling locally. I dabbled in affiliate marketing, eBay dropshipping, and eventually got into Shopify. 20+ underwhelming brands later, I finished high school and started my Digital Business Marketing degree in college. Between tuition and getting wrecked in the crypto market, the 40k I had saved vanished in less than 18 months.\n\nThat’s when the agency was born. I got a minimum wage job at a grocery store and met my current business partner. We were both entrepreneurial hustler types. He had a friend who ran a successful agency and gave us free access to his course. We learned a lot from him because he was already a top 2% earner at 18. The agency path just made sense. I had ecom experience, and my FB account had just gotten banned for copyright on the brand I was running.\n\n**How I got my first 3 clients**  \nThe story behind my first 3 clients is kinda silly. I had a mentor tell me recently, “you need to go back to being r\\*tarded,” because my blind optimism and quirky personality were my competitive advantage.\n\nMy first client DMed me saying “whatsup.” Let’s call him Jeff. At the time, I had post notifications on for Shopify’s Twitter account and would reply to every tweet just saying dumb shit. The reply that got Jeff to DM me was a pic of my friend’s puppy with the caption: “My friend says you should get your email marketing setup ASAP.” Jeff was 16, from my area, and doing 80k/month selling giant plushie d\\*cks. He thought my post was funny and hit me up. We talked for a few days, and boom. First client. To this day, he’s still one of the most valuable people in my network. Sends me referrals all the time. His network blows my mind. Major lesson here, *he just messages anyone who seems cool and is into ecommerce.*\n\nClient 2 came from cold DM. COVID had just hit, and our whole pitch was aimed at brick-and-mortar stores that were forced to close temporarily. We’d ask: “Are you selling online? What are you doing with your emails?” and pitch something like: “Let us run your emails free for 30 days. If you like it, keep going. Only pay a commission on the extra money we bring in.”\n\nClient 3 was a dropshipper who started seeing my tweets because Jeff followed me and would reply tomy tweets all the time. By the time my partner DMed him, he was already a warm lead. Closed easily. He said, “I’ve been seeing you guys online for a while.” Remember that quote. It became a recurring theme once we started scaling.\n\n**First 30k Month**  \nWe hit 30k/month in our first year. Started Q1, and by Q4 we had a solid roster and some decent employees. First half of the year was cold DMs and referrals. Second half, we landed a couple more big clients through referrals. Rev share plus the Q4 boost made it feel like we were printing money.\n\n**Starting back from zero**  \nThis was a huge learning experience. I didn’t realize how inflated Q4 sales really are. At that point, all our clients were young dropshippers, and they started dropping like flies in Q1. Ad bans, payment processor issues, low product demand. The entire roster fizzled out. We thought we were about to hit 50k/month. In reality, we were further from it than ever.\n\nI had to rebuild from Reddit and Facebook. Started posting value posts every week. At first, it was general stuff, but I quickly realized no one cares unless you give up real info. I became an open book. Some posts were so detailed that other agency owners would DM me saying I was “ruining the market.” But I didn’t care. If I could genuinely help people, I knew I’d start building trust and a name for myself.\n\nSales calls got simple. People would say things like:\n\n* “I’ve been sending your posts to my marketing team and they still won’t do it.”\n* “I’ve been seeing your posts for months.”\n* “I already know you know what you’re doing. What’s the price? Send the invoice.”\n\nThat shift got us away from dropshippers and into more legit brands.\n\nWe got back to 30k/month. Then had our worst year ever trying to hit 50k/month.\n\n**Worst year ever**  \n*This was the year everything looked like it was clicking. But we got humbled fast.*\n\nOur “best” employee started stealing time. He billed us for freelance work that he did on the side. We caught him with a time tracking software. Fired him. He instantly DMed all our clients and actually landed one by offering a dirt-cheap rate. He’d already been managing the account for months, so it was an easy switch for them.\n\nThen we lost our biggest long-term client. He got angel investor for a new production facility and the investor brought his own team. One of their rules to get the investment was to use their in-house marketers. That client was almost a third of our revenue. We’d scaled him from 80k/month to almost 300k/month. That one hurt. Lesson learned. No client is guaranteed. Sometimes good work gets you fired.\n\nSame month, we lost a few more clients for dumb reasons. One guy dropped us because we took a call with his biggest competitor. We had no idea how small the niche was. He saw it as a conflict of interest. Looking back, I get it. But still an L.\n\nOur outreach system fell apart. Mods banned me from the best subs. We tried cold email. First guy we hired had a “guarantee.” Never booked a single call. We got a refund, but wasted six months. Hired another guy. Still nothing. Wasted thousands.\n\nPersonal shit started piling on too. Felt like a movie. Partner diagnosed with cancer. Ex faked a pregnancy. Grandparents passed. That stretch was brutal and probably affected the quality of our work too.\n\n**Scaling to 50k/month**  \nThis is where I’m at now. After the bad year, I went back to what worked. Posting and building connections. Filming content even though I hate being on camera. Running ads to boost reach. Doing cold email myself. Getting some traction again.\n\nSome of our the biggest wins have come from the people I’ve met on Reddit. Some white-label our services. Some send us leads. Some Redditors are literally just good friends that I met online. \n\n**Biggest takeaways**\n\n* Focus on building relationships in the right places instead of chasing quick cash\n* Don’t gatekeep. Generic value posts suck. Show you actually know what you’re doing\n* Lead magnets beat cold outreach. Better sales positioning\n* Be picky with clients. Cheap ones are usually the biggest headaches\n* Never rely on one client. Even if you’re crushing it, you can still get dropped\n\n**Conclusion**  \nThis post got longer than I expected. There’s more I could say but I tried to keep it tight without skipping parts of the story.\n\nIf you’re just starting out, I hope this helped. Build a good offer, get experience, and leverage your first real case study.\n\nIf you’re running a bigger agency, I’d love to learn from you. I’ve never managed more than 13 clients at once. Can’t imagine the logistics of doing 30+.\n\nFinal note. Reddit is underrated. Don’t be afraid to leave comment on a hot post or respond to someone with something valuable. You never know who’s lurking. And you never know who’s got clients to send your way. Just remember, social media only changes your life if you’re willing to give more than you take. You’re either a creator or a consumer.\n\nP.S: This is my personal account not my agency account. I wanted to keep this post separate from that account because I'd consider this personal.",
    "subreddit": "agency",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 261,
    "downs": 0,
    "created_utc": 1758001067.0,
    "media": null,
    "is_video": false,
    "num_comments": 113,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.174253716987982
  },
  {
    "score": 203,
    "title": "300k MRR Ask Me anything",
    "selftext": "Hey everyone. I'm putting an AMA up because I get lots of people asking me what I did/how I got started so I'm going to just link them here whenever I get those dms. The reason I'm putting this up is I'm pretty open to helping people because I wish back when I started I could've gotten help. I'm a huge believer in karma and you get what you put out there. So I'm hoping this helps those of you who are struggling and trying to figure out if this will work for you. It absolutely can but you have to put in the time and effort just like everyoen else.   \n  \nThe only thing that annoys me is don't waste my time. If you're brand new and trying to get started, don't ask me to be a mentor lol. It's very aggravating for people who just start and rather asking productive questions on how to get xyz they go straight and ask if someone can help them when they don't even know what to do lol. You can learn so much in this reddit, youtube etc etc. Just ask questions, try to implement, and learn to fail. I failed really hard over the years. Just about anyone who is successful has failed a lot. I legit lost so many times but all it took was 1 win. So just keep going at it, learn from your errors, and don't make the same mistakes twice.   \n\nI am open to getting DM's from people if you're genuinly stuck with a problem and you can't figure it out. But give me a question that has a specific outcome. If you have a problem getting clients and you've tried xyz tell me what you've done vs asking me like \"hey bro can you help me get a client\" or \"can you help me please I'm starting out.\" I'd rather get people asking me like \"Hey, so I'm currently doing xyz for outreach and I've gotten x response but it's not converting into sales calls. I'm not sure what I'm doing wrong.\" etc etc. Something specific if that makes sense? \n  \n**How I Got Started**\n\nI got into publishing very early on. Before I started an agency, back in 2015 when I was 18 I launched my first book on Amazon. Made a few hundred bucks but I needed to learn more about the industry. I spent the next 2 years ghostwriting for authors and learned from authors pulling in 6-7 figures/year. When I was 20 in 2017, I launched a publishing house with 2 business partners at the time. Both of them had books and one of them was an editor and needed marketing help. I put in a few thousand dollars at the time and got it going. Eventually we signed on an author who had 0 marketing experience and didn't know how to sell her books but she wrote good books. I scaled her up in the publishing house and business took off. I scaled it to 100k/month 6 months later but as I was scaling up, lots of authors reached out asking me to help them.\n\nI started up a Facebook group in 2018 and authors started joining. I sold a course and I started it off at $200 at the time and slowly raised the price all the way up to $1,000 but part of the price was I would work with them 1:1 on launching a book. I pulled in around 250k from the course sales which helped supply ad money for the publishing house. Problem at this point was publishing house wasn't making as much profit because of the 80/20 principle. We had a dozen authors and only a handful was bringing in the cash. The rest wern't profitable and after a bunch of failed releases, it wasn't doing as well. We were doing 100k/month but made virtually minimal profits.\n\n**BTW on a side note, this is basically like if I did dropshipping, got it to 100k/month, kept launching stores and eventually switched to ecom (kinda like what Sebastian Ghiorgio did with) except I'm in the publishing space.**\n\nI shut the business down towards end of the year taking a -200k loss from the publishing house personally because I had put all the money I made from the courses into it for ad money. But surprisingly lots of people wanted me to work with them and run their ads. I pivoted over to an agency and pulled 10k in my first month of offering my services. I realized with an agency that the profit margin was crazy high esp if I was fulfilling it myself. I wasn't really an agency just a freelancer at this point but I was pulling in 10-20k/month and on average was pulling in 200-300k/year as a solo player agency owner. But I knew I wasn't really an agency because I couldn't build a team.\n\nFast forward to 2021, I decide to cut back and got into crypto. Lost a lot of money. During this time I stopped taking on clients and my agency dipped to just over 10k/month. I also took my profits and tried other businesses between 2018-2021 and most of them didn't really pan out. I lost hundreds of thousands of dollars trying dropshipping, dropservicing, tried to start a publishing house again but it failed because of the books, tried outsourcing books, outsourced automation stores etc etc. You get the idea.\n\nI got back into my roots in 2022 and went monk mode for the next year. My lowest low in 2022 was I got to 5-7k/month and at one point had to ask my wife for money. I remember waking up to only having 10k cash in the bank but I was in debt 80k because of stupid business decisions I had made earlier in 2021 and in 2022.\n\nBut later on what happened was I noticed organic marketing was taking off. I spent the next couple months figuring tiktok out and in between signed on a few clients for ads while I was figuring it out. Took me a few months and got it dialed in. I decided to build a team this time so hit up a friend of mine where we've done business before so he could handle my backend. I launched my new offer in 2022, and things just took off. It took 18 or so months to really dial it in and it wasn't until just in the last 3 quarters where we've been keeping things really steady. Our agency does SFC, Paid Traffic, and focus on holistic marketing efforts where we can become the infastructure for clients who want to really scale up.\n\nCrazy part? I have no website. I just have people dm me on FB or they schedule a call with me through scheduleonce.\n\nFor my inbound set up, I run a fb group with over 4,000 members. I vet each member thoroughly that wants to join. My email list is over 3k. I basically made courses and videos for free that are top tier that gets people results. I realize in 2023 that selling info is dead and what you want to really sell is implementation. I show people what I'm doing. All the sauce and I don't gatekeep and I just provide as much help as I can to help incubate potential clients.\n\nBut because of all the results I've gotten for people in the industry, a lot of people in the publishing space continue to watch what I do and hit me up. About 50% of my current clients are incubated meaning I helped them for free to go from 0 -&gt; 10-20k/month before taking them on. 30% are people that hit me up after seeing results from other people. And 20% are refferals. I don't do any outreach.\n\nFor me to make my first million with my agency it took me about 5 years between 2018 -&gt; 2022.  \nIt took me 8 months to make my next million.  \nIt took me 4 months to make my next million.  \nIn 2023 we ended at 2.1m.  \nIn 2024 we ended the year at 2.3m  \nCurrently in 2025 our MRR is over 300k/month and pushing for 400k/month soon.  \nIn 2025 by end of February looking to be around 750k.  \nGoal for 2025 is to get to 4-5m.\n\nCurrent profit margin with the agency month to month as of 2025 is floating between 42-46% and that’s after payroll and expenses. Some months are 50% or higher like for February as we’ve gotten a lot of upfront retainers for new clients. \n\nLife to date I've done over 6.4m with my agency since 2018 with the last 5m coming in between Jan 2023 -&gt; Today\n\nI have 0 debt except a mortgage I still have but it's 50% paid off and at 2.75% interest rate. I bought a c8 end of 2023 as sort of a trophy and I'm pretty chill. This year hoping to enjoy life a bit more. \n\nHope this helps inspire everyone to keep at it. If you have any questions let me know below",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 203,
    "downs": 0,
    "created_utc": 1740363885.0,
    "media": null,
    "is_video": false,
    "num_comments": 230,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.2114361573719705
  },
  {
    "score": 195,
    "title": "Took an agency from $500k to $6.5M, broke it a few times, rebuilt it. AMA",
    "selftext": "I run a B2B agency.\n\nIn under 5 years we went from about $500k to just under $6.5M in revenue. Headcount went from 4 people up to roughly 36, then back down to about 28 right now. We’ve rebuilt our offering and internal processes four separate times. Moved from line-item services to retainers. Worked with everyone from small businesses to billion-dollar companies.\n\nWe’ve made good calls, bad calls, expensive calls, and calls that looked right at the time and weren’t.\n\nHappy to answer questions about:\n-scaling an agency without breaking it, and how to fix it if you do.\n-hiring too fast (and fixing it)\n-pricing and retainers\n-process vs flexibility\n-what actually changes when clients get bigger\n-things we’d absolutely do differently\n\nI’m going to avoid naming the agency or dropping the link, but other than that Ask Me Anything!\n\n\n&gt;Going to shut it down and head to bed. I know the timing was a bit weird for many, being a late start, but please feel free to keep adding questions and I will answer them as I see them! I think I may have accidentally ignored a couple DM's in here as it was coming fast and furious, if you sent one and didn't get a response post a message here and I'll see if I can send you one instead. ",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 195,
    "downs": 0,
    "created_utc": 1766455458.0,
    "media": null,
    "is_video": false,
    "num_comments": 324,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.260697751845913
  },
  {
    "score": 170,
    "title": "Ways to find new clients (tactics list)",
    "selftext": "For 6 years, I was an Agency Partner Manager helping ad agencies scale. The majority saw existing client referrals and word of mouth as their best way to get new clients.\n\nThe challenge: it wasn't always predictable, it was outside of their control, and it isn't something that can be relied upon in the earliest days for an agency. (Of course there are some outliers to this, but generally true.)\n\nSo, a lot of time was spent thinking through and finding different ways to drum up business. \n\nSharing a list of tactics that agencies (and really any B2B company) could consider for generating new client interest. \n\nI don't think anything I'll share is groundbreaking and some people in this sub-specialize in each of these, but the question get posted frequently.\n\nThere's a matrix to be mindful of for each:\n\n* Amount of $ it takes to start\n* Amount of time it takes to see success\n* Amount of technical learning to get started\n* Amount of reputation risk\n\nTactics:\n\n* Asking existing clients, past clients, &amp; past colleagues for introductions.\n* Affiliate, partnerships, or referral programs.\n* Organic video content on Instagram, TikTok, YouTube.\n* Organic written content on X, LinkedIn, Reddit.\n* Cold email, LinkedIn, or phone outreach.\n* Hosting a podcast/vlog.\n* Joining podcasts/vlogs as a guest.\n* Sponsoring podcasts/vlogs.\n* Publishing a newsletter.\n* Sponsoring a newsletter section.\n* Hosting webinars.\n* Joining webinars as a guest.\n* Participating in relevant competitions or awards.\n* Getting listed in directories + participating in platform programs.\n* Attending or sponsoring conferences.\n* Hosting or attending networking events.\n* SEO/blog content/backlinks.\n* Paid ads on platforms where your customers hangout.\n\nMy recommendations:\n\n* Pick 2 to test for 90 days.\n* Learn from different sources.\n* Implement a lightweight version.\n* Get feedback/input from others who specialize. \n* After learning, use systems to reduce the amount of time it takes\n* Move on to the next 2 for the next 90 days. \n* Rinse &amp; repeat.\n* Have ways to track success (i.e. UTMs for web traffic or just asking 'how did you hear about us'.)\n* After a year, think through which generated the greatest results (or you enjoyed the most) vs the least.\n* Increase effort in those areas. \n\nPoints to remember:\n\n* Just because something worked for someone else, doesn't mean it will work for you.\n* Vice versa... just because something didn't work for someone else, doesn't mean it won't for you.\n* Success often fluctuates.\n* You can't control the market.\n* High quality &gt; high volume.\n* Some of these work better depending on the buyer, vertical, or geography.\n* Always be experimenting. But once you find success, make small incremental changes. ",
    "subreddit": "agency",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 170,
    "downs": 0,
    "created_utc": 1723085565.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6506017312479564
  },
  {
    "score": 151,
    "title": "Why I’m Closing My Agency – Lessons Learned",
    "selftext": "I started my agency full-time last year, focusing on lead generation, particularly through Meta marketing. My offer was simple—no binding contracts, just results. It worked well in the beginning, but I couldn’t sustain it. The main reason? I was great at delivering results but bad at sales.\n\nA common question I hear is: “If you can generate leads, why can’t you do it for your own agency?” The answer is that running an agency has two distinct parts:\n\n1. Sales &amp; Client Acquisition – Getting clients through outreach, networking, and sales efforts.\n\n\n2. Service Delivery – Running lead generation campaigns and delivering results.\n\n\n\nEven though I could generate leads for my clients, doing the same for my agency was different. The biggest challenge? Capital. Running paid ads for client acquisition is expensive, and I didn’t have the budget for it.\n\nWhy My Agency Didn’t Work Long-Term\n\nI started this business because I landed a good client while freelancing, and it was exciting to build something of my own. But over time, I faced issues that made it unsustainable:\n\n1. Click Fraud – Some campaigns suffered from high click fraud, which impacted results.\n\n\n2. Low Client Budgets – Many clients, especially in roofing and solar, had marketing budgets of just $500–$700 per month. In these niches, an appointment alone can cost $250+, making it difficult to deliver ROI.\n\n\n3. Client Retention Issues – Some clients signed up but later decided to work with someone else. Being based in India while working with U.S. clients also posed challenges.\n\n\n\nThe Biggest Lesson: Sales First, Service Second\n\nOne key takeaway from this experience is that sales skills matter more than service delivery in the agency business. I’ve seen people who are mediocre at running campaigns but excel in sales—and they thrive. Why? Because they can always outsource the work.\n\nIf you’re starting or running an agency, prioritize sales. Get good at cold calling, SMS outreach, networking—whatever works. Once you secure clients, you can hire specialists to handle fulfillment.\n\nMoving Forward\n\nAfter a tough year, I’ve decided to close my agency. I’ve accepted a job starting next week, and while this chapter is closing, the lessons will stay with me.\n\nFor anyone in the agency business: Don’t just focus on delivering results—focus on getting clients first. If you master sales, the rest can be delegated.\n\nWould love to hear your thoughts—has anyone else faced similar struggles?",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 151,
    "downs": 0,
    "created_utc": 1740125761.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.866553050801919
  },
  {
    "score": 146,
    "title": "Agency Confessions…",
    "selftext": "It’s been 4 years since I started this officially, so here are all my confessions to the Internet. \n\n- I refer to myself as an agency owner, although I’m mostly myself and a few VAs at most. Glorified freelancer.\n\n- After 4 years, I still have not specified my exact offer or niche. I still take in everyone I can help.\n\n- I still don’t have a stable pipeline or consistent way of getting clients.\n\n- No, I don’t give a ROAS 9999999x guarantee, and our average roas is probably like 4 or 5 across the board.\n\n- I’ve spent A LOT on mentors and coaches.. most of the time I could have just followed my intuition but didn’t trust it before someone else told me what I felt was “correct” or “acceptable”\n\n- I make about what I would at a full time job, and that feels unsafe.\n\n- I can work from “anywhere” but mostly sit in my home.\n\nWhat are yours?",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 146,
    "downs": 0,
    "created_utc": 1706534266.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8592242609400342
  },
  {
    "score": 136,
    "title": "Best cold email platform for agencies? Not happy with Apollo",
    "selftext": "i'm founder at a small-ish marketing agency and I need honest recommendations for cold email soft⁤ware. currently bleeding money on email infrastructure issues\n\nusing Apol⁤lo right now but the per-seat pricing is killing us ($99/user/month) and domains keep getting flagged. we're only sending \\~200 emails/day across 6 domains but still hitting roadblocks every month.\n\nTried Lemlist before Apol⁤lo - decent features but same deliverability problems.\n\nRequirements:\n\n* Better pricing than apoll⁤o\n* ANYTHING that can help with cold email deliverability\n* bonus: AI features for personalization\n\nwhat's everyone using successfully? seen Smartl⁤ead, Instantly, Saleshandy mentioned here. need something that handles the full stack - not just sending",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 136,
    "downs": 0,
    "created_utc": 1764105256.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.781492534927341
  },
  {
    "score": 126,
    "title": "My first ever 5 digit project for my agency ($11k)",
    "selftext": "Secured my first ever 5 digit deal through a freelancing platform (Upwork), which is absolutely crazy to me! \n\nI’ve posted on here before sharing that I often resort to freelancing platforms like Upwork when my other client acquisition channels are not going well. And I got some hate for it haha. But I’m glad I kept being periodically active on the platform. I would not have gotten this opportunity otherwise. \n\nUse whatever channels you must to secure clients, not everyone has the marketing skills necessary to position their agency in a way, that they can consistently attract high ticket clients, so it’s okay to resort to other avenues like freelancing platforms which make the process easier. \n\nPS. I know that fee is absolutely crazy but I kinda factor that in when I give the client a price quote. Still a tough pill to swallow. I’ve worked on whole projects that have been equivalent to that fee. ",
    "subreddit": "agency",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 126,
    "downs": 0,
    "created_utc": 1736766118.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.653901760970214
  },
  {
    "score": 121,
    "title": "4 months with Instantly for cold email: 0.8% to 5.1% reply rate",
    "selftext": "Been putting this off but figured I should document what actually happened when we switched our entire cold email infrastructure. context: 15-person performance marketing agency, running \\~50k cold emails/month (i think we could be sending MUCH more)\n\nBefore we switched:\n\n\\- reply rates stuck at 0.8% across all campaigns (even our best copywriter couldn't break 2%)\n\n\\- burning through domains faster than we could warm new ones, maybe buying new ones every 20d?\n\n\\- using Lem⁤list for sending (bleeding roughly $700/month for the team) and Ap⁤ollo for leads (30% bounce rate even with their verified data)\n\nMoved everything to Inst⁤antly in july - mainly for the unlimited email accounts (our subscription costs were unsustainable).\n\nkey changes:\n\n\\- consolidated out \\~70 inboxes\n\n\\- used their lead database to compare against Ap⁤ollo. I like the waterfall + verification features which we didnt get with Ap⁤ollo and was causing extra steps\n\n\\- used a bunch of the deliverability features: AI spintax, ESP matching, warmup, etc.\n\nWe were able to get to a 5.1% reply rate at peak (n = 130k emails).\n\nOver the next couple of months we're going to test the AI inbox manager to bring down our reply time which is currently causing some issues. I want to get this sorted before we push for 75k emails/m.\n\nStill trying to figure out if we should use a different lead source or keep it with ins⁤tantly.",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 121,
    "downs": 0,
    "created_utc": 1761302132.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.651457870689005
  },
  {
    "score": 120,
    "title": "Best white label reputation management software?",
    "selftext": "I run a marketing agency that offers local SEO and reputation management, and I’m looking to switch to a new white label provider for reputation management (we’re currently with a big name in the space) I’ve been exploring multiple white label reputation management tools, filtered down to Synup (good for agencies, solid white labeling down to client level) and Vendasta (good marketplace offerings).\nWhat are you guys using? Can you share why you picked it and how it’s working?",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1758796047.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.706860995508272
  },
  {
    "score": 121,
    "title": "Closed 5 new clients this month after raising prices — some observations",
    "selftext": "I run a small boutique marketing agency ( i literally just switched to this style lol) focused on local service businesses.\n\nFor a long time, our pricing was around $500/month. It worked, but it also meant a lot of clients, a lot of context switching, and honestly a lot of unnecessary hiring due to having too much chaos with so many clients\n\nRecently, we restructured our offers and raised prices pretty significantly:\n\n* $1,000/month for **one channel** (paid ads *or* SEO) - this is up from 500/month\n* $1,750/month for **both** (integrated ads + SEO, 3-month minimum) - this is up from 1k a month, although in hindsight I think it should be around $2,250. Just realized how much more complicated it gets when needing to coordinate multiple channels vs just 1\n\nThis month alone, we closed:\n\n* 3 clients at $1k/month\n* 2 clients at $1.75k/month\n* And we have 4 verbal agreements ready for January - I can only imagine that this trend will continue to grow as the \"busy\" season comes into play\n\nSo \\~$6,500 in new monthly recurring revenue from 5 clients.\n\nAt the old pricing, that would’ve required \\~13 clients to hit the same number. And previous to that we were charging about $250 per client so that would have been 26 clients! Imagine the chaos\n\nA few things I didn’t expect (but probably should have):\n\n1. **The $1k package sells much faster than the higher tier** At first I thought there was going to be more resistance, there really hasn't - I also think the higher package requires more trust and a longer decision cycle. Makes sense\n2. **Fewer clients feels… way calmer** Same revenue, fewer onboardings, fewer personalities, fewer fires. Much more manageable.\n3. **Higher-priced clients are easier per dollar** They’re clearer on expectations, more respectful of process, and less reactive. Plus, higher prriced typically has meant bigger marketing budgets - and it's so much easier to make something work when there is more ammunition to use\n4. **Raising prices didn’t kill demand — it filtered it** I didn’t lose “good” prospects. I lost people who weren’t a fit anyway without having to have a conversation about it. Which is great, bc I'm terrible at saying no, so I let the pricing do it for me\n\nThat's it, that's my observations\n\nEdit: We have closed an additional paid ads client - bringing us to 6 total at $7,500 new MRR\n\nEdi 2: We have closed another, 7 clients for total of $8,500 new MRR in December. yikes lol",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 121,
    "downs": 0,
    "created_utc": 1766843009.0,
    "media": null,
    "is_video": false,
    "num_comments": 141,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.897504002866276
  },
  {
    "score": 120,
    "title": "20 Years In, Still Stuck. Maxed at $120k/yr. Avg $30k/yr. Want to get to $400k/yr. What's wrong?",
    "selftext": "I've been working as a freelancer turned agency since 2004. Been through two different collective agencies with business partners, worked for myself, hired people, etc. I'm a design engineer, so I design and code at the same time for most my projects. Sometimes, I'll just do one while someone else does the other job.\n\nBased on these stats, what do you think I should do (I know its obvious, but I want to hear from others)?\n\n1. Where should I improve?\n2. What type of projects should I take on more?\n3. Is it time for a pivot to Productize Services, Info Products or B2B SaaS?\n\nOther notes:\n\n1. INTJ brain\n2. High Functioning Autistic\n3. Digital Nomad\n\n**---------Here's the Key---------**\n\nI use a Notion DB to track all my projects and give them grades based\n\n* Project Result (1-fired to 5-success/live/high performing)\n* Problem Solving (1-analogy reasoning to 5 - first principles reasoning)\n* Yr Revenue (1-under $1.5k to 5-over $50k)\n* Client Relationship (1-bad to 5-excellent)\n\nI then average these four scores together to get my final score. Then there's meta data tied to each project, such as:\n\n* Team type (solo, duo, team aka more than 3)\n* Stack (Figma, Nuxt, Wordpress, Webflow, etc)\n* Year\n* Stakeholders (1, 2-4 ,5-7)\n* Industry\n* Client type (small, medium, startup, non-profit, enterprise, personal brand)\n* Job type (LLC, employee, 1099 subcontractor)\n* Service (website new, website redesign, app new, app redesign, etc)\n* Placement (referral, past client, job board, agency partner, cold email, social, friend, rfp, etc)\n* Referral source (by person's name)\n\n**---------Here's the Stats---------**\n\nHere's some of my results based on my 20 year career:\n\nProject Results:\n\n* 5.0 - Success - Live - High Performing: 4.0 (6 projects)\n* 4.5 - Success - Live - Low Performing: 3.3 (20 projects)\n* 4.0 - Success - Archived: 3.0 (3 projects)\n* 3.5 - Success - Delivered: 3.1 (5 projects)\n* 3.0 - In Progress: 3.7 (1 project)\n* 2.5 - Fail - Resigned (bridge not burned): 2.0 (4 projects)\n* 2.0 - Fail - Ran Out of Money: 3.0 (3 projects)\n* 1.5 - Fail - Fired Client: 1.9 (9 projects)\n* 1.0 - Fail - Fired by client - 1.7 (6 projects)\n\nJob Type:\n\n* 1099 - Subcontractor, 41 projects: 2.5Me acting as a freelancing designer or developer, no strategy\n   * 30 Success projects\n   * 11 Failed projects\n* LLC - Business, 38 projects: 3.3Me acting as a consultant, providing strategy, design and code\n   * 30 Success projects\n   * 7 failed projects\n   * 1 in proress\n* W2 - Fulltime, 5 jobs: 2.7\n   * 1 Resigned (mental health)\n   * 2 Ran out of money\n   * 2 Fired\n\nTeam Type:\n\n* Solo: 2.8\n* Duo: 3.7\n* Team: 3.7\n\nRevenue:\n\n* More than 50k: 4.1\n* 10k-50k: 3.2\n* $5k-10k: 3.3\n* $1.5k-$5k: 2.7\n* Under $1.5: 2.6\n\nLast 5 years:\n\n* 2023: 4.0\n* 2022: 3.5\n* 2021: 3.6\n* 2020: 2.7\n* 2019: 2.9\n\nProblem Solving Style:\n\n* 90%&gt; First Principles (mostly from scratch): 3.7\n* 75% First Principles/25% Analogy: 3.5\n* 50% First Principles/50% Analogy: 2.8\n* 75% Analogy/25% First Principles: 2.4\n* 90%&gt; Analogy (Mostly templates/copying others): 2.1\n\nServices:\n\n* Websites - New: 2.7\n* Websites - Redesign: 3.0\n* Websites - Support: 4.3\n* Apps - New: 3.6\n* Apps - Redesign: 2.6\n* Apps - Support: 2.4\n\nPlacements:\n\n* Friends: 3.0\n* Agencies: 3.4\n* Cold Email: 3.5\n* Current/Past Clients: 3.3\n* Job Boards: 2.2\n* RFP: 2.4\n* Recruiters: 2.2\n* Referred: 2.6\n* Social: 3.5\n\nClient Type:\n\n* Enterprise: 3.0\n* Non-Biz (regular folks): 3.2\n* Non-Profit: 2.7\n* Small/Med: 2.9\n* Personal Brands: 2.8\n* Startups: 2.9\n\nIndustries (with many clients):\n\n* Arts/Entertainment: 3.0\n* eComm: 2.7\n* Food: 2.5\n* Pro services: 1.9\n* Tech: 2.9\n* Productivity: 2.8\n* Non-Profit: 3.0\n* Music: 2.9\n* Health &amp; Fitness: 2.8\n* Fashion: 3.0\n* Beauty: 2.2\n* Agency/Portfolio/Consulting: 2.8  \n\n\nIf you need more stats, please let me know. Didn't want to overload you all.",
    "subreddit": "agency",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1708015434.0,
    "media": null,
    "is_video": false,
    "num_comments": 178,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9067118858063967
  },
  {
    "score": 116,
    "title": "My startup life year 1 ",
    "selftext": "It’s been a year since I left my 142K/yr 9-5 job, packed my bags to travel the world, and launched my online consulting firm. This leap of faith has been life-changing, and i’ve learned SO much about business.  \n\nThe numbers are pretty small, but honestly im happy and don’t regret anything.  The skills and experience will have a compounding effect\n\nYTD stats:\n\nTotal Revenue: $25K, with $3.7K in Monthly Recurring Revenue (MRR)\nClients Served: 23, with 6 active clients and a retention rate of 85%.\n\nClient Results:\n\t•Generated 1,000+ appointments and $150K+ in pipeline on average for clients.\n\t•Helped one client land a potential $50M deal\n\t•Delivered an average 3x ROI on their investments.\n\nFuture Outlook: A $20K pipeline for Q1 2025 is already in motion.\n\nThis year has been about building, learning skills, and delivering results.  \n\nI’ve cracked consistent customer acquisition with sales and marketing.  \n\nNow with the value and track record we’re bringing to our clients, I think it’s time to raise my prices. \n\nI’ll be focusing on building out a team next.  \n\nAny advice from senior founders would be appreciated! \n\nAnd to all others starting out, keep going!  It’s a marathon not a race.  ",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 116,
    "downs": 0,
    "created_utc": 1735286090.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6661118675672335
  },
  {
    "score": 121,
    "title": "Is Iman Gadzhi Legit? Grow Your Agency, IAG Media Facts &amp; What we can learn",
    "selftext": "Iman Gadzhi has been completely blowing up, you can't avoid the guy.\n\nI’m in the digital marketing space and word kind of gets around. The question that always comes up is \"is / was this guy legit?\"\n\nAfter all he has, what I would say is BY FAR the most massive course on not just ads, but creating an agency with \"no experience\"\n\nThat has made me feel an obligation to share some of the facts I've accumulated from others in the industry, and also empirically, to restore some balance as most of his course marketing seems targeted heavily towards not just beginners, but to un-informed minors and teenagers\n\nI'm not here to moralize about those points. I saw another post on Iman, but thought it had a lot of opinions in it. So my hope is to simply put this information out there and help people parse what’s true, by sharing what I've heard, sticking close to as facts as possible.\n\nLastly, I could still be off about certain things, so forgive for for that -- and feel free to add below -- but anyway let's get into it!\n\n**1. Iman's Agency IAG Media**\n\nControversially, Iman shut down his own agency I believe last year. Or rather, \"gave it to his CMO to run\"\n\nWhat happened in reality, is just a few days after this announcement, the calendar was offline on his website. In other words, they immediately shut down for new business.\n\nWhere it gets interesting. My friend's agency actually had worked with IAG Media in the past and had the following to say (and this is 100% verified). I have not seen this info anywhere publicly...\n\nAnd it's interesting because it's like, \"does this guy teaching in a course know what he's doing?\"\n\n**“Is his agency legit? Here’s the story”:**\n\na. When this client was onboarded, IAG media promised to re-build the client's entire website and funnel, but they literally never did it.\n\nb. They also promised to do some specific training, but it never happened either.\n\nc. IAG created just one batch of ad creatives at the very beginning of the deal, these creatives did not perform, and they were never replaced.\n\nd. The \"new targeting\" with the client's existing creatives also failed completely.\n\ne. When these issues were brought up, IAG's \"CMO\" doubled down and said actually overall sales were up\n\nf. When they canceled the contract after 3 months (spending $15k and making negative ROI on ad spend) Iman said on the call \"this is such a small contract for us, we actually don't even need your business\"\n\n**2. Iman Gadzhi's YouTube**\n\nIman knows how to juice the algorithm on YouTube and had pretty unparalleled growth.\n\nHis comment section may seem like bots, but the truth seems to be that Iman pays for these comments by posting an instagram story saying he will give a random comment $x.\n\nThis is not to my knowledge against any terms of service, however it does obscure any negative comments.\n\nHis biggest scandal has generally been around his two big video series, \"Digital Renaissance\" and \"The Great Reset\"\n\nGenerally, these were just huge marketing funnels for his course. Even if he wasn't pitching it directly in every video, you are now on his marketing email list, getting retargeted, and in his funnel.\n\nThere was a controversy around his action of taking down the \"Digital Renaissance\" video series. While he claimed these videos were removed by YouTube, he got caught red handed and had to make a (since deleted) apology video.\n\nWorth noting, there were some large claims made in these videos about history and current events, though no direct citations or sources on any of the claims.\n\n**3. Gents Croquet Club NFT**\n\nNot that we care about NFTs here, or are they related to agencies or ads, but many people who start in Imans funnel end up becoming interested in his other \"items\" so it's worth a mention.\n\nAt the peak of the NFT bubble, Iman started marketing for \"Gents Croquet Club\", a membership club like Andrew Tate's War room, except membership was bought and sold as an NFT.\n\nThere was a fixed number of issued, and a 1:1 call to \"vet for quality\" but by all intents and purposes this was a sales call with commission being paid per signup.\n\nThis capitalized simultaneously the NFT hype because it was explicitly sold as not just an extremely expensive mastermind group, but an \"investment\" that would retain its value.\n\nAnd for a while, it did, shooting up from its original purchase price of $4,000 and hanging out at around $10,000 for quite some time.\n\nBut since, it's crashed down to $3,300 -- 70% from all time high -- and it was crashed by Iman himself.\n\nSince the NFT platform OpenSea changed their terms of service Iman to pay less royalties on every NFT sale, GCC was changed to be open to the general public as a yearly subscription.\n\nMeaning no more vetting, no more scarce supply, now anyone could join for a fee.\n\nUpon this news, the price crashed, meaning every holder lost around $7000.\n\nPerhaps people got enough value to justify, even losing a bit of money on this investment.\n\nHowever, in a since deleted video, one member complained they were not delivering on their promised features either.\n\nFirst that the concierge feature was just a highly marked up version of another service which already exists.\n\nAnd second, that the only real event in the lifetime of GCC was a meetup in Cape Town.\n\nIman himself was only at this meetup for about an hour or less, then left to go to a safari on a private jet with some friends.\n\n**4. Lifestyle**\n\nJust a few additional bullet points on Iman's lifestyle claims. Not trying to ad hominem attack the guy, but since its in all of his marketing, it feels like fair game.\n\n**-- He grew up with \"nothing\"**\n\nSelf-admittedly, he grew up in the Knightsbridge neighborhood of London, in the UK it's known as \"posh\" basically fancy, but not just that, arguably the most fancy district in the whole country.  He also went to a high school that was $50,000 per year.\n\nFrom a 50/50 source he had a personal driver, some sources say a Rolls Royce to go to school.\n\nHis parents went through a divorce, however regardless of how things went down financially (he often claims his step dad stopped paying his internet bills), the fact is, both Iman and his mom were both well-off enough to continue living in Knightsbridge, and going to this expensive school school (until he dropped out)\n\n**So draw your own conclusions from this. That’s all I’ve got. Hope it didn’t come across as a personal vendetta, however I feel some obligation to share.**\n\nWhat I will say in summary, is you may be in the course, or close to buying it. You might be annoying with Iman saying \"SMMA is the easiest business model for teenagers\" but this this is a hard, ever changing game to get into. 99% of these students will fail over a 5 year period when they realize, oh, It's not that hard to close a sales call eventually, the hard part is retention.\n\nThat's it!",
    "subreddit": "agency",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 121,
    "downs": 0,
    "created_utc": 1686257633.0,
    "media": null,
    "is_video": false,
    "num_comments": 176,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9528464638556517
  },
  {
    "score": 111,
    "title": "From $0 to $13,500 on my first month of running my MVP agency",
    "selftext": "This feels surreal. It has completely changed my life. Maybe this is beginners luck, and maybe I won’t be able to sustain this next month, but I’m still proud of this progress. \n\nMy biggest factors for succeeding were:\n- building great quality MVPs for clients QUICK with 0 friction for clients\n- using the correct outreach channels for my service \n- sharing my journey on X\n- putting myself on other platforms like Upwork as well\n\nI hope I can keep this momentum going. If you’re in the process of trying to land your first client, and you’re struggling, DON’T give up.\n\nAll it takes is one tweet and that one person to come across it at the right time. Once the ball gets rolling, no one can stop you. \n\nGood luck!",
    "subreddit": "agency",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1732992053.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7280798253146052
  },
  {
    "score": 111,
    "title": "Thinking of going back to a 9-to-5, agency life just isn't it for me anymore",
    "selftext": "Yeah, I think it's time for me to pivot back into a nice little 9-to-5. It’s been a ride and I’ve learnt a lot running my own thing, but I can’t lie. The last couple of months trying to get new clients on board have been an absolute nightmare. It’s exhausting, and truth be told, I’m not happy doing it long-term.\n\nDon’t get me wrong, I still like having a few clients here and there. If it brings in an extra £2-3k a month, that’s a solid side hustle. But building this into a full-time income, and trying to scale to £10k per month? The amount of stress, time, and energy that would take just doesn’t feel worth it anymore.\n\nThe 12 to 15-hour workdays, the constant pressure, the mental burnout... it’s just not sustainable. Sure, there are upsides like not having a boss breathing down your neck, no office politics, and no pointless meetings. But in exchange, you get clients ghosting, campaigns flopping, and lead gen strategies falling flat. At some point, you’ve got to ask yourself if it’s really worth it.\n\nI think I’d be at peace just doing a remote marketing role somewhere. Something steady, decent pay, no crazy expectations, just good work, good people, and a bit of breathing room to enjoy life again.\n\nAnyone else made the switch back? Would love to hear your stories.",
    "subreddit": "agency",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1750251463.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.808429900413656
  },
  {
    "score": 107,
    "title": "Breakdown of my last 20 clients: Where they came from, churn, quality and timelines",
    "selftext": "Inspired by a post from u/czerrr\n\n**For context:** We're located near Houston, TX. I deal primarily with local service businesses (local SEO &amp; PPC) and rely heavily on outbound (started by cold calling only.) We have a small team and lots of things we do are automated through an internal app I built over the past year. Prices range from $350 to $1k+ per mo.\n\nThought it would be helpful to share how/where our last 20 clients came from, the effort required, how long each took to become a client from initial contact, and the quality/churn.\n\n# Client Breakdown (Starting From Yesterday To September)\n\n**1. Referral:** First contact was about 3 months ago. Had an initial call to discuss. She said she wanted to get started - but then decided she wanted to meet first. We met a month later and after sending the contract out, again, she pushed it back ANOTHER month. Finally signed on this month.\n\n**2. Cold Call:** Initially contacted 6 months ago. Had about 3-4 phone calls within the first month. After telling me he wanted to get started - he decided he wasn't ready. Moved him to the 'lost' opportunity column on my CRM. He emailed me out of nowhere a few nights ago saying he was ready to get started. Called yesterday, he signed the contract &amp; paid an hour after our call.\n\n**3. Referral From Cold Email Lead:** Initially spoke to a cold email lead who had issues w/ something we don’t typically handle. So instead of trying to take him on as a client, I just spent my time offering advice at no cost. He called me a few weeks after that to refer a client to me. Ended up meeting the original lead afterward (he’s local to me) and we most likely will be doing something pretty soon.\n\n**4. Cold Call:** Signed up 1 month after initial call (from my sales rep.) Sales rep never followed up, so I called and closed the deal a few days later. (more on hiring sales reps at the bottom of this)\n\n**5. Craigslist:** Believe it or not, have a couple clients from Craigslist. Look for businesses who are actively searching for marketing help. Could be Indeed, job boards, wherever. This one was from Craigslist.\n\n**6. Cold Email:** He looked me up and called me 2 months after receiving my cold email. Signed up after a few convos. \n\n**7. Cold Email:** Signed up 2 weeks after initial cold email\n\n**8. Referral:** Churned after 1 month (new website never even went live.) Personal issues on their end, supposedly.\n\n**9. Cold Email:** Signed up a few days after the first email.\n\n**10. Cold Email:** Same story as above, signed up a few days after the first email.\n\n**11. Cold Call:** Signed up a month and a half after the initial call.\n\n**12. Cold Call.** Signed up 1 week after our initial call.\n\n**13. Cold Email:** Signed up 2 months after the initial email/call and several follow-ups later. 3 months in - he decided he wasn’t going to run his business anymore. He ended up paying me an invoice 4x our monthly retainer (his request) and gave me a referral when he quit.\n\n**14. Local SEO:** Found us from our Google Business Profile. We met at a Starbucks the same day, and she signed up the same day.\n\n**15. Facebook Ad:** Finally got on the phone 1 month after submitting a website form. Quit after 1 month.\n\n**16. Craigslist:** Another Craigslist client. He was looking for door to door salespeople. I introduced myself, explained what we did, and he signed up a few weeks afterward.\n\n**17. Cold Call:** Signed up 1 week after our initial call.\n\n**18. Cold Email:** Responded to email immediately asking for a calendar invite. Sent an Calendly invite (only time I’ve used it), got on a call the next day, signed up a few days later.\n\n**19. Facebook Ad:** Quit after 1 month.\n\n**20. Facebook Ad:** Payment declined by month 3. I didn’t bother chasing, just decided to let it go.\n\n**Takeaways**\n\n1. I never did cold email until a few months ago. It has been amazing for us.\n2. Cold calling has worked well for me. But then again, I’ve cold called in another industry for over a decade, so I have experience. When I cold call, I don’t try to sell on the first phone call. First call is to introduce myself, qualify/disqualify as a lead, and schedule another call/appointment.\n3. Facebook ads were terrible for us. I was at a breakeven - so it wasn’t all bad, I guess. There are lots of factors, though. It could have been my targeting/landing page, etc. I ran FB ads at the same time I started cold email - decided to focus on cold email since it worked so much better right off the bat. Now, don’t get me wrong, I’m pretty sure FB ads can be a great source in the future. I’ve spent millions on FB ads between my other companies, and I know it works. I just didn’t want to spend the time or money figuring it out for this business, when I already had something that was working much better.\n4. About Sales reps. Had two former colleagues at previous companies work with me on a commission basis. One of them still does - but I wouldn’t recommend it for a few reasons:\n   1. Training is a full time job. Even though I knew them personally AND knew they were good salespeople - I still had to spend TONS of time explaining everything to them. How to use our CRM, explaining SEO, PPC, marketing in general. The right things to say, the wrong things to say, etc.\n   2. You have to monitor them. They might end up saying wild shit. If they say something (whether it was an accident or not,) you, as the owner, are the one who has to bear responsibility for it.\n   3. If you’re thinking about building a sales team or even hiring a single commission salesperson when you are new, just learn sales yourself. It’s a much, much bigger investment of your time, money and energy than you probably are anticipating.\n5. Don’t burn bridges. If a client doesn’t sign on right away, don’t pressure them and don’t think deals are lost. Don’t try to sell something you can’t deliver, either. I’ve gotten referrals from people who never even signed up with us, and I’ve had leads come back months after our initial call. Be respectful, give value where you can, and just move on. Keep speaking to new people and you’ll never have to make rash decisions that will hurt you or your business in the long-term.\n6. Things take longer to materialize than you expect. When I first started, I assumed that because my prices were pretty low, people would be signing up on the spot. That didn't happen. I'd say about 15-20% of clients signed up within a week of us first speaking. It could be the way I sell, or maybe it's just how it is. Clients also churn - payments fail, they ghost you, people stop running their business, etc. Either way, if you're going into this thinking you'll make lots of money fast and maintain a high level of income/revenue with no experience, it probably won't happen.",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1736631124.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.615561690287344
  },
  {
    "score": 105,
    "title": "Just closed my first client for my agency",
    "selftext": "It's not my first time getting a client, I have been working with different clients as a freelancer (working for agencies) for the past 2 years.\n\nBut back in September, I decided to start my own agency, particularly in the creative + education space. I offered a prospect a 1-month free trial for my service, he loved it, and just today closed a $1,000/mo for 3 months deal with him.\n\nHow significant is this? And how do I milk this first win as much as possible to build up my agency's reputation?",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 105,
    "downs": 0,
    "created_utc": 1734805048.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5766847811055573
  },
  {
    "score": 101,
    "title": "How hard is it to fuck up now?",
    "selftext": "Hey guys, this question is for the ones which agencies make around 50k per month.\n\nI have an agency together with my brother and we are hitting the 20k per month probably in the next 2 months. After 2 years of earning just enough to survive (between 2 and 3k), last September was the turning point and since then every month is a new record in terms of income.\n\nI am very positive that this isnt happening but how hard is it to fuck up the agency now? We have a steady stream of new clients without doing any outreach. For me it feels like it isnt possible to \"destroy\" the agency at this point but on the other side Im very afraid of it happening.\n\nWere there moments for you after hitting 20/30k where you nearly lost everything again? If yes please tell me so I can make sure its not happening for us.\n\nEDIT: Thanks for all the comments and questions, made a new post where I try to answer them",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 101,
    "downs": 0,
    "created_utc": 1749518745.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7158415078370015
  },
  {
    "score": 99,
    "title": "From broke VP to $1M+ agency in 3 years, AMA",
    "selftext": "I'll trickle in and answer questions over the next few days, but officially I'll schedule it for Tuesday evening next week so y'all can get your questions in.\n\n\\---\n\nTLDR:\n\nIn Aug 2021, I was a broke nonprofit VP with over $30k in credit card debt.\n\nToday I run a 7-figure agency with 15 team members helping founders build their personal brands.\n\nI'm not as big as the other AMA here but I also haven't been it that long compare to others, so things are still fresh in my mind.\n\nHere's my backstory\n\n\\---\n\nIt all started one night in August 2021.\n\nI was doom scrolling Twitter on my couch, drowning in credit card debt, when I saw someone tweet \"I make $1000/week online.\"\n\n“Yeah, right.” I thought.\n\nAt the time, I was a VP of Development at a nonprofit in Birmingham, making decent money on paper but struggling hard financially.\n\nAll I wanted was an extra $500/month to help with bills.\n\nI started looking deeper into this online money Twitter thing..\n\n# The Early Days (aka The 7 Rings of Hell)\n\nI learned what the guy was doing, growing a faceless twitter account and then offering retweets and engagement to other accounts.\n\nI thought it was interesting… “How hard could it be?”\n\nThat night around 10:00pm, still sitting there on the couch, I started my Twitter account with the bare minimum of what you could call a plan.\n\nAfter that, I went down nearly every “online money” rabbit hole you could think of and tried them all:\n\n* Amazon dropshipping\n* eBay reselling\n* Ecommerce\n* Affiliate marketing\n\nStill have random inventory in my garage from this phase lol.\n\nBy early 2022, after sticking with Twitter and posting content regularly to a faceless theme account, I had about 8k followers but no real way to monetize.\n\nAfter failing miserably at everything else, I decided to double down on my Twitter account.\n\nAnd that's when everything changed…\n\n# The Turning Point\n\nI became obsessed with understanding social media algorithms and writing content (mostly threads because they were cheat codes for getting followers back then).\n\nMarch 2022, I decided to do a 30 day challenge where I wrote a thread every day for 30 days straight.\n\nI gained 40k followers in ONE month. (I even got kicked out of a community I had joined because they thought I was cheating or buying my followers, I still to this day have no idea how to do that LOL).\n\nShortly after, people started to take notice. “How’d you grow so fast?” And I’d share with them the process of writing and remaining consistent.\n\nThen I got my first big break when someone asked me to do the writing for them…\n\nStarted making some extra money working as a writer for a ghostwriting agency, cranking out 100-200 pieces of content monthly.\n\nAnd that only continued to grow, getting client after client. (it’s still a version of what we do for clients today).\n\n# The Plot Twist\n\nHere's the crazy part, I kept my full-time nonprofit job until April 2023.\n\nAt that point, our agency was making $50k/month but I was still terrified to let go of the guaranteed income from my 9-5.\n\nFinally quit once I had 6 months of runway saved. Business tripled that year.\n\n# Where We Are Now\n\n* 357k followers on Twitter\n* 43k on LinkedIn\n* 15 person team\n* 80% YoY growth in 2023\n* 95% YoY growth so far in 2024\n* Work with some of the top founders/CEOs\n\n# Key Lessons Learned:\n\n1. Time horizon matters more than anything. I didn’t give myself a deadline to make it work. I just kept trying until something clicked. The people who fail on social media are the ones who expect results in 90 days.\n2. Out of 970 days doing this, maybe 30 truly \"made\" me. But those 30 days don't happen without showing up for the other 940.\n3. Stubbornness &gt; Strategy. Everyone's looking for the perfect playbook, but persistence beats perfect execution.\n4. Get help early. I hired coaches/joined communities way before I could \"afford\" to. Shortened my learning curve dramatically. Probably have easily spent over $50k on coaching and mentorship over the past few years.\n5. Focus on solving real problems. I wasted months chasing engagement before I developed an actual monetizable skill (content creation).\n\nSo, now that you know a bit about myself. Ask me anything and how can I help you get ahead to where you want to go?\n\nEDIT: alright everyne. This was fun. Thanks for all the questions. If you're on X or Linkedin, come find me and give me a follow - just search up my name \"Clifton Sellers\".\n\n",
    "subreddit": "agency",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1743722768.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.702652932632385
  },
  {
    "score": 101,
    "title": "How are you finding clients right now?",
    "selftext": "I run a small agency focusing on lead gen for local businesses. We've lost a few clients over the past couple months for several reasons. I don't have anything in the pipeline right now and would love to find another 2-3 clients. I am wondering what seems to be working for you all right now. I have survived basically 100% off referrals for the past several years and have really not done much of anything in terms of marketing my own business in a long time. ",
    "subreddit": "agency",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 101,
    "downs": 0,
    "created_utc": 1760987873.0,
    "media": null,
    "is_video": false,
    "num_comments": 121,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.794280087099292
  },
  {
    "score": 94,
    "title": "Why is running an agency so tough?",
    "selftext": "My agency is running, I make ~40K - 60K (once I even crossed 70K) every month with two employees.\n\nBut I somehow can't figure out why this is so darn hard...\n\nI mean I ran 2-3 different business models a few years ago, they did not make so much money in such a consistent manner, but they for some reason felt \"lighter\" or \"easier\".\n\nWhat is it that makes that agency life so hard?\n\nWhat exactly are you experiencing on a daily basis?\n\nWhat are the hardships that you already went trough?\n\nMaybe I'm just too spoiled or take things for granted😂😭\n\nI can't put a finger on the specific pain and cause for some reason.\n\n\nIMPORTANT: Guys, I don't want to buy your fucking course or agency consultation, shut the fuck up with your shills and messages! Can smell that shit from miles away. Don't even start to type your obnoxious S.P.I.N questions here.",
    "subreddit": "agency",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1704367941.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.710787623127967
  },
  {
    "score": 95,
    "title": "Why is this sub like this ",
    "selftext": "I’ve noticed a few questions that keep repeating, but one topic really stands out: \n\n“I started an agency but I can’t get any clients and have never worked in marketing before. Help me.”\n\nNot only have you never worked in marketing, you’ve probably never worked in B2B sales, and your lack of marketing knowledge means you are just going to be giving canned info you saw in the HighLevel group or some shitty course. This doesn’t work because the people you are selling to are not morons, so they see right through you. \n\n“So, Bromar, what are you supposed to do? I bought these courses and financed a $15K coaching program so I feel lost!” \n\nGO GET A JOB IN THE INDUSTRY. \n\nI swear this is the only industry where people with no experience routinely start businesses and then are surprised they can’t make it work. It’s unbelievable. \n\nI sold gym franchises for years. A requirement to buy one was experience in the industry. Restaurants typically have the same requirement. \n\nMarketing agencies are highly technical endeavors, you are borderline delusional if you think you can just make it up as you go along and attain any real measure of success. Go get a job, work your way to an account manager role, or go client side and work your way up to a Marketing Director or CMO role and THEN start your agency. ",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1732330767.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5913468582313905
  },
  {
    "score": 93,
    "title": "Hiring friends is a fast track to ruining both your business and friendships",
    "selftext": "I learned this lesson the hard way last year.  \n  \nHired my best friend to help scale Contntr's content operations. Seemed like a no-brainer at the time.  \n  \nThree months later, we weren't speaking to each other.  \n  \nThe problem? When performance issues came up, our friendship made it impossible to have those tough conversations. Every feedback session felt like a personal attack.  \n  \nBusiness decisions became emotional decisions. And that's a recipe for disaster.  \n  \nNow I have a strict \"no hiring friends\" policy. It's saved me countless headaches and preserved relationships that matter more than any business opportunity.  \n  \nWant to maintain both successful relationships and a thriving business? Keep them separate.  \n  \nYour business deserves professional relationships built on clear expectations. Your friendships deserve to exist without the pressure of performance metrics.  \n  \nLooking to scale your team? Start with this: Write down your non-negotiable hiring criteria before even looking at candidates. It helps remove emotion from the equation.",
    "subreddit": "agency",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1737941485.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.401826852549177
  },
  {
    "score": 91,
    "title": "One year of freelancing",
    "selftext": "decision is taught me one thing clearly:  \nmoney is not about skill. It’s about leverage.\n\nIn 12 months, freelancing paid me more than I ever expected this early.  \nEnough to buy a $23k car with no loan.  \nEnough to clear all pending debts.  \nEnough to upgrade my entire setup using my own money.\n\nWhat changed was not my design quality overnight.  \nIt was how I priced, positioned, and protected my time.\n\nI learned that underpricing costs more than overpricing.  \nThat the wrong client drains money even if they pay.  \nThat one $6k project is worth more than three $2k ones.\n\nI also learned something uncomfortable.  \nSome people work full time and still stay stuck.  \nNot because they aren’t smart, but because their income is capped.\n\nFreelancing removed that cap.  \nEvery better decision directly reflected in money.\n\nTalk about pricing early.  \nSay 'no' more often.  \nOptimize for value, not hours.\n\nMoney follows clarity.",
    "subreddit": "agency",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 91,
    "downs": 0,
    "created_utc": 1766310830.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6091946234859513
  },
  {
    "score": 87,
    "title": "How do you actually deal with clients who just stop paying?",
    "selftext": "whats the method here when a client signs on, work gets done, maybe they pay part of it, then invoices start getting ignored. You send a couple emails, don’t want to be annoying, and eventually it just turns into “guess we’re not getting that money.”\n\nThat’s usually what I do, but I’m starting to think that’s the wrong move ... like im joke are something\n\nI have never sued someone from what I see, most people seem to respond once there’s an actual process behind it but if they didnt answer me for weeks how will it change if I sue them? lol\n\nI’m curious what other agencies do:\n\n● Do you ever actually push unpaid invoices?\n\n● Is there a dollar amount where you stop letting it slide?\n\n● Has anyone used small claims for this or is it not worth the time?\n\nI saw the recommendations for tools pettylawsuit.​c⁤om and rocket law⁤syer but I’m more interested in how people handle this now ...\n\nWould love to hear what’s worked or hasn’t.",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 87,
    "downs": 0,
    "created_utc": 1766982437.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5456795520616526
  },
  {
    "score": 83,
    "title": "Biggest Mistake When Starting My Agency? What was your?",
    "selftext": "When I started my agency, I made one HUGE mistake. I thought great work alone would bring in clients.\n\n**I spent way too much time perfecting my services**, tweaking my website, and building a nice portfolio… but none of it mattered because I wasn’t actively selling. I just sat there, waiting for clients to show up. Spoiler: They didn’t.\n\nIt took me way too long to realize that running an agency isn’t just about doing great work-it’s about getting clients. **The moment I focused on outreach, networking, and actually selling, everything changed.**\n\nSo, for those of you who have started (or are thinking about starting) an agency… **what was YOUR biggest mistake?** Let’s help each other out. ",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 83,
    "downs": 0,
    "created_utc": 1739479384.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5729455342775154
  },
  {
    "score": 84,
    "title": "Agency Owners Around 100k MRR - How's Life?",
    "selftext": "Honestly for me $0 to 30k MRR was pretty easy, was doing most of the work, with some contractors filling the gaps. $30k - 50k MRR, sorta sucks to be honest, in that weird place when you need more full-time specialist hires, but you gotta balance the books. $50k-100k MRR this has probably been most stressful, literally spend most my day training people and making systems better, dealing with clients and constantly training and trying to hire a-players, not to mention still doing all sales meetings. I'd like to know how it's been for others so far on the journey? Anyone else as mentally drained feeling as me.",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1739436832.0,
    "media": null,
    "is_video": false,
    "num_comments": 142,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7270869444468238
  },
  {
    "score": 84,
    "title": "How we got our last 10 Clients in January 2025",
    "selftext": "Inspired by the inspired [https://www.reddit.com/user/dave\\_ggm/](https://www.reddit.com/user/dave_ggm/) \\- was super surpised as to how many cold emails/cold calls resulted in new clients!\n\n  \nWe are almost 5 years in business - we primarily get new customers from word of mouth and social media. The break down are as follows, as well as the pricing, bc why not \n\nFor more context: We specialize in Web Design, Google Ads, Local SEO, and social media management for local service-based businesses.\n\n1. Roofing Company- prelude package $750/month - Instagram - reached out in like november, reached out again in january to move forward. This client has been a little rough to work with here in the beginning month\n2. Generator Services Company - Sonata Package- $1500/month - Found us on tiktok. Submited a lead form through tiktok - i replied instantly and scheduled a call same day, the paid the next day. good client\n3. Electrician Company - Prelude $750/month - TikTok \\^ same business owner as above ( he has 2 businesses, called in 2 weeks after the first business to add this one in) good client\n4. Engineering Consultant Company - Prelude $500 - Employee Referral. Employee has a contact that was interested in services. I think they met at a party lol. They found out about us several months ago but moved forward in January. i have yet to meet them lol\n5. Detailing Company - prelude 500 - Found us on TikTok. good client\n6. Detailing Copmany - prelude 500 - Existing client referral. good client\n7. Roofing Company - prelude 500 - Found us on tiktok. good client\n8. Detailing Company - 750 google ads only - Found our google profile page. They are located in dallas but somehow found our stuff in Houston. high maintenance client but so far very understanding, just has a lot of questions\n9. Detailing Company - 350 google ads only - Existing client refferal. I also credited the client that referred this business bc they asked for it . good client but new to business, lots of questions\n\nThere's technically not a 10th yet, will upate once it comes through lol\n\nSurprisingly, tiktok has been a good source for lead gen. I also go live a couple hhours a week which has resulted in some new sales as well, just not this month. But leads for sure\n\nI also think we do a crazy good job at reaching out to clients as soon as they reach out to us. I'd have to say, no more than 12 hours pass between when someone reaches out and we send them back a personziled loom video. For the most part, we respond in hours\n\nI am also working more on increasing the value on a per client basis. So we aren't accepting as many clients as we use to. We are quicker to turn clients away/refer them out if it is not a good fit",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1738097325.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.635982852514142
  },
  {
    "score": 86,
    "title": "Starting from scratch.",
    "selftext": "Man this is a painful one to write.. Back in 2022 I started my first ever business a video editing agency. In 60 days I made my first $500. By 4 months I hit my first 6 figures. I was on top of the world. \n\n2023 was a blast. My parents were proud of me, I was in the best shape of my life, I could get and buy everything I wanted and I felt like I was untouchable. \n\nBy early 2024 video editing AI softwares like submagic and veed.io gained traction and 90% of my clients dropped like flies. \n\nBy June of 2024 I tried doing different offers to get it back up again: Podcast editing, Social Media Management, etc. \n\nNothing. By October of 2024 I tried a lead Generation offer, I got a mentor, But still: No results. \n\nIt’s been a full year now and I have made 0 progress. 0 dollars and 0 clients. \n\nI have been trying to revert back to the video editing offer and system that I did back in 2022 that got me success. Been doing it for 2 months now so far progress is little to none and I’m starting to lose hope. \n\nJust a little quick story/rant… I don’t know if I should keep pushing or just take a breather and think what I should do next (Idk what to do next) \n\n(Side note*: I’m 21 and still in college, I’m about to graduate in 2 years and I’m seriously considering if I should just get a job. Lol)",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 86,
    "downs": 0,
    "created_utc": 1752517656.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5952646152048593
  },
  {
    "score": 84,
    "title": "We’re entering a reckoning period where agencies (and consultants/freelancers) will get filtered out",
    "selftext": "I don’t often post (mostly just comment/lurk/mod) but thought that it’s high time for a post about where the digital marketing agency world is at. \n\nHere’s some thoughts which at first glance will be controversial, but I’ll explain.\n\n**Revenue isn’t important**\n\nI have talked with dozens if not hundreds of agency operators who like to mention their top-line revenue. It sounds nice to reference your top line revenue numbers (phrases like “7 figure agency” or “100k/mo in billings” etc) but that number is absolutely irrelevant to actual sustainable, profitable, long term success. \n\nIt’s all about take-home profit. Not how much client ad spend you funnel through your account, not how many developers you have on staff, not how many clients you have. It’s about how much the owners make at the end of the day. I have seen so many $2, 3, 5 million agencies where the owners don’t even take home $250k. \n\nMuch less common to see (but the ones you shouled be emulating!) are the real success stories, where a small agency with 3-4 staff can profit $500k to $1 million. \n\n**Glamorous clients or niches are the worst**\n\nIt doesn’t matter if you have a recognizable name in your portfolio, or that you work in \\_\\_\\_ cool niche. Selling yachts, gyms, luxury watches etc. Or even worse, trendy niches like gyms, med spas, cannabis, etc which are notoriously fickle. It would be far better if you have a roster of clients who sell insurance, shampoo, recruiting, diapers, boring stuff that makes money. \n\n**AI is eradicating many agencies**\n\nIt’s a scary thought and because of this, lots of folks don’t want to admit it. But the reality is that if your agency does process-oriented, mid-level or low-level tasks, there is likely already an automated solution that will erase your value-add. \n\nAnd you have to be very honest about your agency’s value-add. It’s easy to say you offer strategy, but make sure that’s not BS.\n\nThe outsourced/offshore “cheap labor” agencies aren’t just possibly going to be wiped out…they ARE being wiped out.\n\nThe expensive full-service traditional big agencies aren’t just possibly going to be wiped out…they ARE losing their contracts.\n\n**Agencies are being acquired, closing their doors, merging, or scaling back like I’ve never seen before**\n\nIn the next couple years, you can expect this trend to continue. I am seeing lots of agencies get a bit desperate, lowering prices, trying to keep cash flow going, laying off folks, etc. \n\nThis will be a reckoning where acquiring agencies will have the upper hand, and come out the “other side” very strong. \n\nI’m not a big agency person. I’m a micro-agency person. But I’ve been in this world long enough, and have enough friends doing things right, to identify who and what are going to crush it.\n\nHere’s what you have to do:\n\n\\- Fire your extraneous project managers. They’re not a value-add. There’s no added skill.\n\n\\- Fire your low level staff, especially if they can’t do anything that beats AI.\n\n\\- Consolidate your staff into more expensive, highly skilled folks who can handle a few different areas of responsibility. Reward them for it. \n\n\\- Increase your profit margins as much as humanly possible. 50% or more. Ideally 60-70%.\n\n\\- Be able to lose 50% of your business and still be in the black every month.\n\n\\- Stop going for clout and find your niche which helps your clients make more money. If you’re not making your clients more money than they’re paying you, you’re going to lose them.\n\n**The economy is bad.** \n\nNothing you can do about it. It’s especially bad in the EU right now. Make sure you have the runway to make payroll for 6-12 months in the case of a really bad few quarters.\n\n\n\n  \n",
    "subreddit": "agency",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1729783479.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4186452639573863
  },
  {
    "score": 78,
    "title": "100+ Local SEO clients and 39 employees across 3 countries — AMA",
    "selftext": "Fun fact - I never wanted to start an agency, and probably would never have started one if things had worked out better at the agency I worked at previously.\n\nI started Sterling Sky as a [local SEO agency](https://www.sterlingsky.ca/local-seo/) back in 2017 and thought it would just be myself and a few others freelancing and doing what we love. Fast-forward 8 years and I now run a fully remote agency with employees in the USA, Canada, and one VA in Panama.\n\nIt's been quite the journey and was not at all what I expected. What questions do you have for me?",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1743000989.0,
    "media": null,
    "is_video": false,
    "num_comments": 171,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7278913147442156
  },
  {
    "score": 83,
    "title": "I made it to $10k MRR",
    "selftext": "I am 23 y/o from Pakistan and in dec 2024 I hit my target of $10k/mo but almost all of the clients I have are from Upwork or referrals. Its been driving me mad that my outreach is not working. \n\nI am sending 500 cold emails daily, pitching the business owners a free SEO optimized article (btw I do ppc and seo) but all I get are nos and a bunch of low value prospects.\n\nHow can I get a consistent pipeline of prospects and sales calls? Is there anything I am missing out on cold email side, I am not sure, a little help on how to scale beyond this point would be helpful.",
    "subreddit": "agency",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 83,
    "downs": 0,
    "created_utc": 1736306198.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6076651531950037
  },
  {
    "score": 77,
    "title": "I have declined my first client",
    "selftext": "I have been doing software/web development as a freelancer for more than a decade, and last couple of month, I decided it's time to start my agency.\n\nI spent months trying to get my first client and I successfully landed my first contract, but unfortunately I declined it just a week after, why?\n\nThere are my reasons why I decided to decline the contract and lose some working hours.\n\n**Client Uncertainty:**\n\nThe client has no programming experience, he was reading some articles, asking ChatGPT about the best and **MOST SECURE** technology, sometimes he came and tell me, I want you to use Django, after a couple of hours he switches to NextJS, the day after he tells me use the best tech you think it's good.\n\n**Long Useless Meetings:**\n\nAfter having a 2 long of meetings to discuss the project, budget, and the best way to do it, the client kept asking for more meetings for nothing except talking about the same thing and asking questions about tech again and how he will scale it to handle millions of users. When I asked him to charge him for the meetings hours, he refused.\n\nI might be wrong declining the contract, but I feel mentally better and not regretting it.",
    "subreddit": "agency",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1735158581.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5257608509061145
  },
  {
    "score": 74,
    "title": "Cold Emailing – Too Much Hype. Manual Outreach Got Much Better Results.",
    "selftext": "I wanted to share my recent experience with manual cold email outreach.\n\nPreviously, I tried bulk cold emailing using this setup:\n\n* **PhantomBuster** (to extract LinkedIn accounts)\n* **Enrow** (to enrich the emails)\n* **Reoon Email Verifier** (to verify emails)\n* **Instantly** (to send emails)\n\nThis cost me around $2K to run over a couple of months. I closed 2 clients with this method, but the results weren’t encouraging.\n\nThis time, we tried a different approach. Instead of blasting out 10,000 emails, we focused on just 1,000, divided into 4 categories, and reached out manually.\n\nInstead of templated emails, I trained my team to spend time reviewing each prospect’s website and drafting personalized messages. We included an “invisible offer”- telling them we had already designed a wireframe + optimized content for one of their target pages (Product/Service/Homepage) and would be happy to share it. We mentioned that this could potentially increase their page engagement and performance by 25–30%, based on our past results.\n\nThis claim was backed by our experience optimizing 100+ legal and eCommerce landing pages with similar improvements.\n\n**Results:**\n\n* Out of 120 emails sent over a month, we received about 25 replies.\n* 10 requested to see the wireframe.\n* We created wireframes once we got a positive response and sent them over.\n* Out of those 10, five agreed to a call.\n* We closed 3 clients.\n\n**Our offer was wireframe + content + page design.**\n\nWe spent much less on this method. While it required more initial work (creating the wireframe), the leads were much warmer and easier to close because we could show them around 10 examples of our previous work.\n\nCurrently, 2 agencies are interested in white-label collaborations. We offered them 1 fully designed and optimized page (not just a wireframe) to build trust.\n\nThe takeaway?  \nIn the current cold emailing landscape, going hyper-focused and slower can produce significantly better results. Plus, this approach comes with far less headache.\n\nWould like to know your experiences with cold emailing. \n\n",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1754982856.0,
    "media": null,
    "is_video": false,
    "num_comments": 129,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6670329395451184
  },
  {
    "score": 78,
    "title": "70% of agencies struggle with client acquisition in the first 3 years — and 50% don’t make it past year 5.",
    "selftext": "I came across this stat recently and it kinda shook me.\n\n7 out of 10 agencies fail to get clients consistently in their first 3 years. And half of those don't even survive past 5.\n\nAlthough I rarely see anyone on here openly talking about that phase — the early-stage grind.\nMost posts are from seasoned agency owners scaling up, building internal tools, or solving team ops issues.\n\nAnd sometimes… it just feels like I’m playing a completely different game.\nIt’s not jealousy. It’s more like — “Damn, how far behind am I really?”\n\nI'm not sure if there are any active redditors out here in their initial 5 year phase of their agency, struggling to get clients. \n\nIf there are, I’d love to connect with a few, \nBrainstorm a couple ideas on how to get clients, possibly even get a group going.",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1751437838.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.693785758664529
  },
  {
    "score": 76,
    "title": "Why do people fall prey so easily to scammers like Imann Gadzhii ?",
    "selftext": "I was watching his latest scam videos and i just coudnt believe how much of a fanbase he has . The saddest thing is that a major part is from 3rd world countries where  people barely have enough money to go by and i  was seeing kids and teenagers saying they were begging their parents to give them their life savings so the can  send it to Iman Scammer Courses . \n\n&amp;#x200B;\n\nI feel so sad for those people and at the same time i cant believe how ridiculously stupid the majority of population is when it comes to money and how it works in the real world . ",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1705986622.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.679554743011601
  },
  {
    "score": 78,
    "title": "Is anybody actually getting clients from social media posts?",
    "selftext": "I’m a solo digital marketing freelancer and I’ve been posting on LinkedIn and making short-form videos on various platforms for a few months now. It seems like my posts only get in front of other agencies/digital marketing pros, or people looking for free work. I’m wondering whether I should change my approach, or if I should even bother with social media content. It seems like most other agencies are just recycling content using AI tools or posting slop to make their feeds look active.\n\nHas anyone here had success getting new clients via social media posting? If so, what was your approach?",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1756391596.0,
    "media": null,
    "is_video": false,
    "num_comments": 163,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7175490153142903
  },
  {
    "score": 74,
    "title": "3m last 12 months (Follow Up)",
    "selftext": "Hey everyone,\n\nIt’s been about six months since I did my AMA earlier in the year and I wanted to share progress on how things have been as well as growth and operational changes. We’ve had to adjust and learn quite a bit after Q1. \n\nOriginally our goal was to get to 5m this year, but we took a small hit towards end of March where we had to level up our operations, systems, workflow; basically there were a lot of things that broke down. \n\nCurrently on track to do 3.5m to 4m this year. I wanted to share how we did 3m in the last 12 months and basically over 5m since Jan 2024. \n\nSome of the challenges we’ve had was leadership as well as training and increasing the skill level of our middle management team. We spent the last couple months training the team up to handle more responsibilities as well as being able to tend to situation as they rise up.\n\nWe’ve also changed how we onboard talent. \n\nPreviously, we had referrals, but we realize having referrals from talent that aren’t performing as well dilute the talent pool severely so we started running ads locally to bring talent on and it blew our mind. We’re getting on average anywhere from 1200 to 1500 a month. We’ve greatly expanded our talent pool and we put an HR team together to review the resumes as well as tweak our onboard training.\n\nOur main offer is TikTok posting for authors. We also have an Amazon advertising team that’s been growing bit by bit and I believe that will probably be the next big push we do. I think with our TikTok offer we’re realistically going to be capped at 4-5m a year just due to office space as well as efficiency. \n\nWith the Amazon advertising offer, the goal is to get it to 1-2m a year over the next few years. I have almost 4000 inbound leads that I could push this offer to and I’m fairly certain that I’m going to be able to fill up my pipeline as quickly as possible. The only challenge and bottleneck really now is talent development. Because we train people internally it may take a couple months before they’re capable of delivering solid results.\n\nThere’s a couple other offers that are in the works, but I think in the future the way we’re gonna be growing. The agency further is by operating different divisions/offers basically. \n\nSurprisingly, it really isn’t our execution ability and fulfillment where we have the bottleneck. The stage we are at, it really just comes down to talent development to handle our SOP’s.\n\nMy C suite has been reading up on John Maxwell regarding leadership and how to develop a team because that really is the biggest challenge now. I don’t think our offer and results really is where we’re struggling. It just comes down to talent development, team culture, as well as establishing what our core roots and mission is so there’s a sense of purpose now.\n\nAlso my role has been more focused on figuring out what gaps there are in the market I am in and develop offers and simulate what results would look like and run it by the team to see how we can pull it off. Sometimes I have ideas I want to follow through on and I’m fortunate I have so many clients open to trying them out 😂. \n\nIn addition, one of the biggest changes was we finally developed better communication set up with clients and how we deliver reports. I used to be bombarded every Monday on updates so we developed responsibilities with middle management to deliver reports every Friday and also handle any problems that rise up. I am now removed from 95% of day to day client communication and I only pop in for anything that my team can’t handle with questions regarding strategy or something specific. All the questions are now directed to our Client success manager (we call them business analyst) and they’ve been handling it amazingly. \n\nOur tech stack is\nSlack for team communication and client communication\n\nAirtable for our tables and crm and building stuff we need\n\nOneDrive for excels and reporting to clients and storing our creatives \n\nReact to build custom tools we need that we can’t build on airtable \n\nIt’s super simple 😂\n\nIf you’re new and want to catch up, here is the link to the first AMA: https://www.reddit.com/r/agency/comments/1iwrcxb/300k_mrr_ask_me_anything/?share_id=OAcIu_o7nrMfN-LhkpS-B&amp;utm_content=2&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_source=share&amp;utm_term=1\n\nI will for sure have an end of year update to share to go over anything that changed from this update.\n\nAs always, if you have any questions, drop them in the comments below. \n",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1753538145.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.365712513775344
  },
  {
    "score": 75,
    "title": "I spent 9+ hours on a proposal only to get ghosted ",
    "selftext": "A popular YouTuber approached us to help them scale their merch brand - currently stuck on around £360k p/ year revenue\n\nWe showed them how we could scale them to £1.2m by the end of month 12, all whilst saving them £150k + in product cost based on what they were currently paying\n\nThe initial discovery phase went well - they were an inbound referral, they needed our help and we could solve their problems\n\nI spent 5 hours on a hyper personalised proposal (re designed their landing page, created some custom designs for their products), drove down to the client (2 + hours each way) to show them it and deliver custom samples we made for them.. for free\n\nIt looked promising - they loved it, communicated well and it looked like it was going over the line\n\nThen.. like Houdini they just vanished \n\nI went through the process, seeing if we could change anything to prevent this from happening again.. and lot's of people would say don't spend so long on a proposal\n\nBut I believe how you do one thing is how you do everything \n\nWe didn't win this one, but this approach will win us one in the future \n\nHope this helps anyone who’s experienced something similar - don’t let it deter you from providing an amazing service, upfront \n\nWould you do anything differently? \n\n",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 75,
    "downs": 0,
    "created_utc": 1719430795.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.544858585776763
  },
  {
    "score": 75,
    "title": "What your agency finances should look like at different stages",
    "selftext": "Following up on my [post from last week](https://www.reddit.com/r/agency/comments/1gb59ll/were_entering_a_reckoning_period_where_agencies/), here’s my thoughts on the micro-agency model and finances.\n\nMost posts don’t really get into the actual dollar amounts, and this is likely because it’s a very nuanced conversation. There are so many variables in the digital agency world that it’s hard to give concrete numbers. However, I think some real numbers are very valuable to talk about. Just keep in mind that all situations are different. If you’re in the US, your numbers probably look a little different than if you’re in Bangladesh or Germany.\n\nThe first phase is the **$0-250k revenue stage**. My opinion is that anything under $250k doesn’t really look much different than just being a consultant or freelancer. If your agency is making under $250k, you really shouldn’t have any expenses at all. Your margins should be **close to 100%**. The only expenses are literally domain name, bookkeeping, etc. You shouldn’t have to have major payroll or advertising expenses. At this stage, the agency should be owner-led and owner-fulfilled. You can do this with \\~10-15 clients on a monthly retainer basis.\n\nOnce you get to the **$250-500k stage**, you probably need to start hiring. It’s always better to hire in-house, full-time at this stage, and your first hire should be fulfillment (basically a specialist). Your margins need to be **70% or more**. As a rule, I think it’s smart to keep your cash flow so high that you can be ok losing half of your revenue in any given month, and still be profitable. You want to have enough of a company nest egg that you can make payroll for six months or so. You can also reach this stage with 10-20 clients.\n\nPast this stage is the **$500k-1m stage**. At this stage, you really need to have spent a few years going upmarket and having some bigger clients. But not necessarily more clients. You will almost certainly need more full-time staff to serve these clients, but you really only need 2-3 great people at the most, and maintain profit margins of **60% or more**. At this level you probably have a little more freedom to spend on things like conferences, top-tier talent, advertising, bigger projects etc. But you still have to be very cognizant of your budget.\n\n**Past $1m**, and honestly up until the $5m mark, your margins will out of necessity decline logarithmically. It gets slightly more inefficient the further you go. I still think you can maintain profitability of **at least 50%** but you can (and people definitely do) still maintain 60-70% levels. There really isn’t a reason to dip under this unless you’re doing something wrong.\n\nAt some point you grow out of the micro-agency model altogether and that’s another discussion altogether. I’ve consulted with a lot of bigger agency owners and looking at their P&amp;Ls really hammers home the point that there’s a sweet spot. Unless you’re getting major investment or landing some super large enterprise contracts, growing an agency for top-line revenue and headcount rarely means you will grow your take-home.\n\n*Wouldn’t you much rather have revenue of $500k with 80% profit margins, than make $3m with 10% profit margins?*\n\nA few years ago I was working with an agency that had top line revenue of $6m, but they literally only had a profit of around $360k. It blew my mind that our own agency was making far less revenue, but far more profit, and this realization really made me double down on our model (that’s when I started writing *Building A Successful Micro-Agency*).\n\nThere are some hard lessons and trade-offs, to be sure. If you want to actually make a lot of money as an agency owner, here are some of the bitter pills to swallow:\n\n* You will always be in the weeds. There is no such thing as outsourcing all the work, if you actually want to make half a million or a million or so. The reality is you will always be working, every day, and if you’re not, you simply have to accept taking less home at the end of the year.\n* You cannot settle for being mediocre, or even slightly above average. You really do have to find technical excellence in some manner, and be the best in your craft. It’s simple supply and demand: there are a lot of average agencies, and if you’re doing things averagely you will make average money.\n* You must be very patient. You simply will not make insane money within a few months, or even a few years. It takes a few years.\n* You have to find a way to break out of the midwit curve. This was the whole impetus behind my *Unorthodoxy* book. Going just a little farther and doubling down - on almost any aspect of your business - breaks you out of the bottom 80%, the bottom 90%, the bottom 95% etc. You can niche, you can become technically excellent, you can sell like no one else, you can build a truly unique personal brand, etc. It is not easy but it is possible.\n\nIt is very difficult for folks to reach these levels of profitability. It’s a lot of self-control, patience, delayed gratification, and a big grind in general. Half of the process is simply saying “no” to things you want to say yes to. But it *is* possible.\n\nAnd lastly, and maybe harshly, there is a definite pattern to those who are “ngmi”. Elements of this pattern are folks who: outsource everything, don’t take personal initiative, try to pay for everything instead of doing it themselves, try to remove risk from the equation entirely, get caught up in flashy business models or niches, who want to get rich quick, who view business as merely transactional rather than relational, etc.\n\nIt is very much about a long-term, personal, patient, diligent approach to giving yourself an amazingly paying job.\n\nThere is no secret sauce, and that’s something a lot of people don’t want to hear. You just got to do it.\n\n(I cover a lot more of this stuff in my new book. I'm gonna just go ahead and promote [*Unorthodoxy*](https://www.amazon.com/Unorthodoxy-contrarian-marketers-philosophy-surviving/dp/1733794867/) here).",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 75,
    "downs": 0,
    "created_utc": 1730126153.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.445911632295048
  },
  {
    "score": 74,
    "title": "Walked out of a in-person sales meeting after 3 minutes",
    "selftext": "I've had a gut feeling about this lead I got. I could tell it was going to be a waste of time just based off the interactions I had with them so far. But I was like screw it, I'll check it out. It was also a very small deal.\n\nIt was in a cold lead that another agency sent me. \n\nI've already sent a formal email proposal, had phone calls, and sent an entire (short) loom video of the process and pricing. \n\nThe owner finally \"agrees\" to meet with me and he wants to meet in person. When I show up to chat. He says \"what do you have to offer me, what are your referrals, what other companies have you worked for\". That's his opening line\n\nI had already sent all this info, and had clear examples on the phone call, email and loom video. It felt like the guy wanted me to \"sell\" him on our services, and I wasn't going to do that lol. In the last couple of years, because people know us, it's more like \"hey - we like what you do for them, can you do it for us?\" or \"hey - x company said you guys could help us, could you let us know how\"?\n\nSo that's what I learned in that moment. For my business, I prefer and have noticed that it's better to work with businesses that come to you vs you got to them (aka having a reputation/brand/referral with that lead already)\n\nSo I told the owner of that business \"It doesn't seem like we are a good fit, there are plenty of other agencies out there, best of luck\"\n\nFelt kind of weird, but it would have been a complete waste of time. Or even worse, they agree to pay for the services and then we have a \"bad\" client on our roster. \n\nI'm actually kind of happy with the scenario. A couple years ago I would have tried and \"satisfied\" the customer. Now I'm like naaaah lol. What I need to get better at is not taking leads that are obviously not going to be a good fit. \n\n&amp;#x200B;",
    "subreddit": "agency",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1712861819.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.397095285566838
  },
  {
    "score": 72,
    "title": "Anyone else burning through cold email domains faster than they can warm them? Getting desperate here",
    "selftext": "Been running a 12-person marketing agency and I swear cold email is going to be the death of me... like we're literally spending more time fixing email problems than actually sending campaigns.\n\nJust last month alone we had 3 google workspace accounts disconnect and noticed one of our domains ended up on a blacklist.\n\nAs I write this I'm noticing that I sound like a spammer. Just to be clear: we're only sending 100 cold emails per day total across 4 domains. When I speak with some friends they're doing 10x, 20x this volume which suggests that's not the issue.\n\nwe were using Woodpecker initially, thought switching to Lemlist would help with deliverability but nope...same problems. If I were to guess we're probably wasting 10+ hrs a month just email infrastructure tasks, it's insane\n\nSo my ask: we need something that handles most of the infrastructure side so we can focus that energy into messaging, improving reply times, etc.\n\nAny platform suggestions or is this something we just have to put up with?",
    "subreddit": "agency",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1760451211.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5328435562810028
  },
  {
    "score": 71,
    "title": "Adding Clarity to the Roles in Your Agency",
    "selftext": "For every role, map out:\n\nResponsibilities: What each role owns and what's expected of them.\n\nGoals: The desired outcomes (these are your trailing indicators).\n\nKPIs: The actions that drive those outcomes (your leading indicators).\n\n\n\nAttached is an example for Account Management\n\n\n\nDo this and your team will have crystal clear understanding of what’s expected of them. You’ll now have the first half the puzzle of accountability setup.\n\nNew Hires will love knowing exactly what they’re expected to do and will have a better experience.\n\nThere will be no blurred lines between roles.\n\nTeam Performance will be improved organically.",
    "subreddit": "agency",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1736945829.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1055288390103812
  },
  {
    "score": 71,
    "title": "Landed my first $10k client, looking for advice on keeping the momentum going",
    "selftext": "Hey everyone,\n\nLast week, I signed my first client for a $10k SaaS project, my first big win since launching my agency. They paid $3k upfront, with the rest due at the end, so I’ve got around 10 weeks to deliver by mid-January. The client hinted there might be more work down the line if this goes well, but I don’t want to rely on that. I’m looking to keep the momentum going so I’m not left scrambling for clients once this wraps up.\n\nI actually found this client through Fiverr, but we closed the deal outside the platform. Fiverr worked this time, but it’s not where I want to rely on long-term. Most leads there are looking for bargain services, and this client was more of an exception.\n\nI’ll be handling most of the work myself to keep costs low, though I’m bringing on a freelancer for a few areas. My goal is to balance things out, delivering quality here while building a steady pipeline of new clients. If anyone has been in a similar position or has advice on building sustainable lead-gen channels beyond Fiverr, I’d really appreciate it.\n\nThanks!",
    "subreddit": "agency",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1730269240.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.469470431231663
  },
  {
    "score": 70,
    "title": "How to get clients for your agency",
    "selftext": "I know this is a popular conversation on this sub but I wanted to give some guidance in a dedicated post since I run a sales agency \n\nFeel free to also post your tips in the comment section\n\n1. Events\nI go to trade shows and conferences. SaaS companies are usually the best niche for me. I find that tech companies need help on marketing and advertising stuff more than a generalist like of company needs it. CES is a gold pot and almost 30% of my new clients are from there. Yes I bring a lot of business cards and I hand them out. Make a good offer. I won’t get into the technique in this post.\n\nAnother great one is SXSW.\n\nDon’t forget local ones. Go to them.\n\n2. Directories\n10% of my new clients come from online directories. Clutch and 50Pros are really the only ones that have worked for me. Clutch provides more volume than anyone else even though a lot of it is spam (by the way: never pay for a top spot. Most clients message the first ten companies as part of their due diligence so it’s ok to rank 5-10). 50Pros has been exceptional with proactively getting our services in front of clients, especially as of recently it seems to be doing great.\n\nUse them and others but don’t pay $10,000/month on them like I hear some agencies do that’s crazy. $200-500 per month is good.\n\n3. Chamber of commerce and local organizations \nThe competition is much lower when you’re focused in a local market. Plus it’s great for relationship building. Their budgets aren’t as low as you think. Construction companies, asphalt, and other similar have been surprising me with their budgets. Real estate is nice too.\nMaybe 10% of new clients come from local organizations, rotary, and more.\n\n4. LinkedIn\nYes it’s cringe but it works. It’s a numbers game. What more can I say?\n\n5. Sales Campaigns\nPretty much a lot of inbound and outbound. Paid ads, content marketing, and good old fashioned cold calling.\n\nI say a post earlier today in this sub asking if content marketing still works and if articles are dead. Yes they work. Most flop but keep it going.\n\nThe most important thing for outbound is having a sequence that follows up on all leads multiple times in a year long period. They may not sign up this month but make sure they hear from you in 10 months or later\n\n6. Relationships \nThe longer you do what you do, then the more people will gravitate to you and trust you. Keep building. Keep posting about your success. Keep on keeping on.\n\n\nCurios to hear from everyone else ",
    "subreddit": "agency",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1736904451.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3328592107525727
  },
  {
    "score": 69,
    "title": "How I Saved a Lawn Care Business From Bankruptcy",
    "selftext": "Back in March, I was in a bar. Sitting next to me was a guy talking on the phone with one hand and holding a drink in the other. I overheard him explaining to an employee how he had recommended him to a buddy for a job. He also mentioned that he had just left the bank after securing a loan big enough to cover payroll for the next few months, advising the employee to use that time to find other work.\n\nOnce he got off the phone I started talking to the guy and explained to him that his issue wasn’t a payroll issue it was a sales issue. He explained to me that most of the jobs he had were from referrals and long term clients. He also shared that he was just a few months away from considering bankruptcy if business didn’t pick up. After explaining his loan situation, he mentioned that he now had a little extra money for marketing. And that’s where the relationship began.\n\nThis guy had equipment, vehicles, rent, payroll, insurance, and more that needed to be paid every month. Yet, not a single one of his obligations was for marketing or sales. He didn’t have anyone on his payroll dedicated to sales or marketing, no marketing strategy, and no sales system. He used his personal cell phone for inbound leads, which were few. His client data was kept on an outdated excel spreadsheet with minimal information, and he rarely updated it. He had no website, no logo, no social media presence, no hope.\n\nHe even had an employee with an office at his warehouse that dealt with invoicing which was strange to me because the majority of his business paid in cash. It seemed to me that this guy was all about his employees and treated them like family but failed to give that same energy to the actual business side of things.\n\nNow this was a risky project. It could go one of two ways. I could get this guy so much business that he’d be a client for life or I could fail and blow through his payroll loan and he’d then have someone to blame for him going into bankruptcy. Failing wasn’t an option and I didn’t want to deplete his payroll funds on marketing when he promised his employees three months of pay. \n\nHere was the strategy… I needed to generate enough business in the first month to create a budget for the second month without touching payroll. This would allow us to launch stronger marketing campaigns in month two. A proper sales system had to be implemented, along with a complete rebrand, so his business could finally have an online presence. He needed a logo, a website, social media profiles, and a Google My Business listing. In month two, I wanted to establish a few inbound lead strategies to ensure a steady flow of potential customers. Month three would be about scaling and improving the operations I had implemented, and by month four, I wanted to shift into full growth mode.\n\nSo let’s get into it.\n\n**Month One**\n\nI convinced the owner to bring a couple of canvassers that got paid by the estimate. I created a script for them to say and designed some door hangers to leave. Their job was to stop into specific neighborhoods and door knock with the script I gave them. They would park at the end of the street. One guy would hit one side of the street and the other guy would hit the other. They door knocked 3 hours a day getting roughly 7 estimates daily between the both of them. \n\nAll of the data such as the houses they hit, the estimates that were needed, the details of what happened during each interaction was entered into Podio. I had created a Podio account for the owner in order to keep track of all employees, their roles, and tasks. There was a special workspace in there I created just for the canvassers. While all that was going on, I designed the owner a logo, a website, and created social media profiles for the business. \n\nSince the business was like a tight-knit family, the social media strategy was to post about random funny things that happened during the day between the employees.\n\nThree weeks in, I noticed that the estimates that were being given were for smaller jobs. A simple mow that was $55. The owner was the guy that went out and gave the estimates, but he was terrible at sales. I told the owner that he needed to hire a dedicated salesperson. Someone whose sole job is to go out, give estimates, and close the deal. \n\nWhile job applicants were being interviewed, I had the owner come up with seasonal packages for lawn care. One package included spring cleaning, mows in the summer, fall clean-up, snow plowing, and 2 junk pickups per year. This was the most expensive package and the most anyone could pay for basic lawn care during the year.\n\nThe salesperson’s job was to be to sell as many of these packages as he could. I signed up for a Jobber account so when the salesperson was hired, he’d have a way to keep track of leads, estimates, follow-ups, expiring contracts, etc. I also set up a schedule for the salesperson. He was to report in the warehouse at 7 a.m. From 7:15 a.m. - 9:30am he would do some early morning sales training with me and the owner. This was required every day. He received $15/hr plus 10% commission on the sales he closed. The owner, at first, was against the commission but I explained to him that the salesman getting a 10% commission on all sales he closes will give him the motivation to be a sales machine and he’s the main guy that’s going to be bringing in the jobs to get this business out of the position it’s in. He agreed. \n\n**Month one total revenue / $9,722**\n\n**Month Two**\n\nWith the canvassers finally getting comfortable, they were bringing in around 15 estimates between the two of them at the start of month two. I gave them the option to join the dedicated salesperson in on sales training in the mornings. One of the canvassers joined the sales training and became an absolute door-knocking machine. He was averaging 7-9 estimates daily, and that number soon jumped to 15-20 daily.\n\nFor inbound leads, I designed two different postcards. One for the everyday homeowner and one for landlords. We pulled a list from the city that had data of every landlord in the city. Postcard campaigns were sent out with different numbers on each postcard. We used Callrail to do this so we could track which postcard the call came from. Lead would come in &gt; Get put into jobber &gt; Salesperson would make initial contact &gt; Follow Up &gt; Estimate &gt; Close. This was the sales process. \n\nMid-month two, I set up Meta and Google ads to bring leads in online. The ad was a simple ad that said “Love Your Lawn Again.” For the first ad on Meta, we got the data from the list of customers the owner already had and created a lookalike audience on FB. The goal of this ad was to get people to the website so we could retarget them on Meta with another ad. Same with Google. The ads ran on Google were solely to get people to the website in order to retarget them on Meta with another ad.\n\n**Month two total revenue: $18,412**\n\n**Month Three**\n\nIn month three, we gave the initial canvassers a $1,000 bonus each and an ultimatum. They could continue getting paid per estimate or they could come on as an employee and get paid by the hour because we were going to expect more from them and they were going to be given more responsibility. They both made the decision to stay on per estimate. Since they both were exceeding expectations, we decided to bring on 4 more canvassers with the initial two canvassers training them. After a couple of weeks of that, the canvasser that was a door-knocking machine became our second in-house salesperson. Now we had two salespersons that were absolute monsters. We also continued to send out postcards and continued to optimize and perfect the meta and Google ads.\n\n**Month three total revenue: $29,197**\n\n**Month Four**\n\nIn month four, we spent a pretty penny on a Fourth of July party for everyone’s hard work and for the simple fact that everyone still had a job. I could tell that even though the owner had lacked on the business and marketing side of things, the one thing he got right was creating a workplace that everyone enjoyed. The woman whose job it was to invoice was no longer needed since the salespeople could invoice through Jobber. The owner refused to let her go, no matter how much I pushed for it, so her new job was to plan different parties and events for the employees and customers while also running tasks for everyone. \n\nWe continued to scale the marketing campaigns and we also implemented a “mow it forward” referral program. For every referral a customer gave us, they’d be entered into a contest. At the end of the quarter, the top referrer would receive a $500 gift card. The second referrer would receive a $250 gift card, and the third top referrer would receive a $100 gift card. Everyone else received a $10 Amazon gift card. I created a page on the website that had a leaderboard where customers could see who was winning. I figured this would get people to refer as many people as possible so they would climb up the list, and it worked. At the end of each week, an email would also be sent of the top 5 people on the leaderboard, and let me tell you, the top 5 people were always neck and neck.\n\n**Month four total revenue: $41,241**\n\nWhat started as a business on the brink of collapse turned into a thriving operation with consistent work, motivated employees, and a clear path to success.\n\nThe owner went from feeling hopeless, getting drunk in a bar, dealing with going bankrupt, to having a business that not only paid the bills but had systems, a growing client base, and a dedicated team that now believed in him. The employees were happy knowing they were part of a workplace that valued them, celebrated their efforts, and provided opportunities for growth. \n\nLooking back, the risk was worth it. Today, the owner and I are very good friends and still a client of mine. Today, he isn’t just surviving, he’s thriving in every aspect of this life. And that’s why we do what we do.",
    "subreddit": "agency",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1734550315.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.142822500703394
  },
  {
    "score": 70,
    "title": "6 or 7 Figure Agency Owners – How Did You REALLY Start?",
    "selftext": "I want to know...\n\nEven though you’re successful now, how did you truly get started? I mean, from the very beginning before earning a single dime online.\n\nDid you kick things off by freelancing, learning high-income skills like copywriting or sales? Trading time for money before leveling up your skills to the point where you could hire a team and build a business?\n\nOr was there another approach that worked for you?\n\nReally curious to hear from you guys.",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1729559072.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4709286234458663
  },
  {
    "score": 67,
    "title": "AI tools I use to run two 6-figures agency",
    "selftext": "I run a dev agency AND a marketing agency. my biggest problem is context switching and just the constant barrage of information and messages coming my way.\n\nI’ve tested a ton of AI assistants and productivity apps. These are the ones I now use almost every day. They've helped me save a lot of time and hopefully they'll help you too:\n\n1.  ChatGPT / Claude / Gemini\n\nI use Chatgpt for writing, brainstorming, summarizing articles, rewriting emails. Claude for project planning and the very occassional coding. Neither are perfect, but nails my use case as a founder. I also use Claude desktop + MCP for all reporting, I've got it plugged into postgres, elasticsearch and notion. Gemini is surprisingly good at creating text based content, i use it to write blogs, tweets and linkedin.\n\nMy marketing agency doesn't do much visual content generation so my use cases aren’t creative specific (no image or video generation), but i heard good things about VEO.\n\n2.  Grok\n\nThis beats Perplexity and Google IMO. It’s like search + research assistant. Gives clean answers + links. I use it for quick research or when I need sources to back up stuff for my agency. Especially good if you want to source Twitter.\n\n3.  AI Meeting notetakers\n\nMy biggest problem with notetakers is no one actually looks at the notes after the call AND i still need to have an EA to organize the notes and send me a summary. I switched to Rumi earlier this year, their USP for me is to get information out into the hands of decision makers after the meeting.. which translates into me getting cliffnotes on what happened across sales and devs every morning automatically. Much good for my sanity.\n\n4.  Raycast\n\nI’ve got macros for my macros and I’ve got AI extended through all my apps. I ask it to summarize notes on all the DMs i’ve received over Slack, caffeinate my mac when I run local report and while I'm away at lunch, ask it to pull/summarize linear tickets I’ve received for the day, calendar meetings booked for rest of the week. It’s super powerful.\n\n5.  n8n\n\nI’m obsessed with workflows and agents. I’ve “outsourced” a bunch of tasks to it that I’d normally had to hire an assistant for. It’s also doing “vibe marketing” for me by repurposing content such as podcast episodes, mixing it with on the go opinions I type up on twitter and repurpose them into newsletters, cold out reach emails, linkedin post and even tiktok videos.\n\n6. Cursor\n\nBackground agent now integrates with Slack. I’ve not fully given it a spin yet but so far we’ve added it to internal alerts channel where we dump stack traces. if we can just point cursor at stack traces and it’ll just fix the code.. that’s going to be insane.\n\n\nanything i'm missing for agency owners?",
    "subreddit": "agency",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1750689440.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.334493914874246
  },
  {
    "score": 70,
    "title": "Just fired a client for the first time &amp; I feel amazing",
    "selftext": "2 weeks ago I made a post about annoying clients who are constantly trying to micromanage my work. I was close to firing them but decided to stick through as the work in itself was rather small, but now I regret it. They extended a 2 week project into a month long project by trying to constantly nit pick on small details. \n\nToday I fired them. It wasn't easy as it was my first time ever firing a client, and I felt guilty as one of the co-owners was really nice to me (the other was an asshole and the reason why i fired them). The relied I feel is so great. No more concerns, doing work for them irritated me so much knowing well enough they will try to nitpick on small details of the work for the sake of it.",
    "subreddit": "agency",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1728727199.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3099573476685533
  },
  {
    "score": 68,
    "title": "The Value vs. Complexity Matrix and why it's so difficult to build a profitable agency",
    "selftext": "Hey friends,\n\nI just published a new post covering some new challenges I've run into in my agency. \n\nI came up with a name, the value vs. complexity conundrum to help explain this challenge.\n\nThe matrix shown in the screenshot above shows the two dimensions, level of complexity of the work, and perceived value of the work.\n\nYou can read more about this concept in my post which I'm going to link to in the first comment. Let me know your thoughts.",
    "subreddit": "agency",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1763147777.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4219697094250483
  },
  {
    "score": 66,
    "title": "Signed my first client the other day",
    "selftext": "So I started an agency about a month ago, because I was sick of the crap at the agency I current work at and was worried about my job after a merge.\n\nAfter lots of work building my website and working my network, I finally landed my first client and had the contract signed on Monday.\n\nI'm stoked to say the least, now I just need to deliver exceptional work and hopefully a few more will come. It's only a small contract on retainer but I wanted to start small so I don't fumble.\n\nI was a little discouraged after getting so many no's and lots of 'maybe in the future' from my network. \n\nHave been following along on here for a while and reading so much about running an agency so thanks to everyone for sharing their journey and insights. I just wanted to share this with the community.",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1724247542.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.500317312140151
  },
  {
    "score": 66,
    "title": "I’m feeling incredibly grateful right now. I’ve made $2.4K in revenue running my MVP agency",
    "selftext": "I've had two (and a half?) clients so far, and hopefully more to come!\n\nSome things that helped me out:\n\n* Learning on the fly: Every project has taught me something new, whether it's about development or managing client expectations.\n* Delivering quality: Focusing on delivering high-quality work and making sure clients feel supported, which will hopefully lead to repeat business and referrals.\n* Small Wins: Celebrating each milestone, like landing my first client, to stay motivated and keep pushing forward\n\n  \nIf you need help with your agency, or even development 😉 ask me, I'd be happy to help!",
    "subreddit": "agency",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1735470482.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2686497918607795
  },
  {
    "score": 68,
    "title": "Here's what a revenue breakdown looks like for a one-person digital marketing consulting firm in 2025.",
    "selftext": "Now that I'm coming up on the end of my first full year as an independent digital marketing consultant, I decided to take stock on where my revenue was coming from. I looked at all of my revenue for 2025, then broke it down by the initial lead source. Here are my thoughts on each channel:\n\n**Personal Network:** Far and away my biggest source of gigs. Over 70% of my revenue came from people I know personally and professionally. You could argue that LinkedIn was a part of this, since I'm constantly reminding people in my network that I am alive and doing digital marketing consulting by posting in this channel. I got some decent work from unlikely sources in my network: co-workers from years ago, a guy who was on my pub trivia team a decade ago, and vendors at the art markets my wife works at. Personal networking is great because it leads to pre-vetted clients who tend to be high quality. But the downside is that these referrals come in randomly, so they're hard to predict.\n\n**Reddit:** When I started my business, I rejoined Reddit and started using it as a professional account instead of a personal one. I became active on relevant subreddits and jumped in to threads where I could be helpful. This became a decent source of gigs for me - I had several clients, consultation calls, and an extremely valuable partnership come out of this. However, most of the individual clients I got from Reddit tended to be low-spending accounts. Some were good clients even though the spend was low, and some required a high amount of work at a low retainer fee. The best outcome from Reddit was building a partnership with another agency - that's actually where most of the Reddit income came from.\n\n**Local Networking:** I became much more involved in my local business community, joining a Chamber of Commerce and taking business classes through a local organization. Both of these proved to be really valuable, leading to some high-quality gigs. I even became a part-time business advisor with that local organization, which has been a real delight. Local networking seems to drive the most high-quality gigs of all, but it can be time consuming. Not every local event I attend leads to a prospect or paying gig. It's a long game.\n\n**Inbound Organic:** I'm not really doing a major SEO push, but I'm still getting found by putting myself out there. I got a few great gigs out of this. If I put more effort into organic, this might be a bigger piece of my revenue. But networking and Reddit are far less time consuming than that kind of effort, so I focused on those channels instead.\n\n**Advertising:** 0% of my 2025 revenue, but that's because I didn't run any ads. There were a few slow times during the year that I did consider it, but whenever I started planning something out a referral would magically appear on my plate. I've been very lucky to keep myself busy enough to not need to advertise. Maybe in 2026.\n\nI see a lot of posts on here about how to get clients, so I thought it would be useful for some people to see how I did it. The main takeaway is that personal relationships matter more than anything in this space. Almost all of my revenue came from a personal relationship I built during my career, through networking, or by participating in an online community.",
    "subreddit": "agency",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1766846411.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.304529937654391
  },
  {
    "score": 65,
    "title": "How to start a new agency? For new agency owners",
    "selftext": "This is a guide purely for new agency owners who want to build something solid. I am an agency owner with experience in the industry for nearly a decade. I did not start the agency after working in an agency. I got frustrated of my corporate life and decided to start my own agency with $500. \n\n**Be clear about your Niche:** I have came across multiple agency owners who is pretty confused regarding their core service offerings and the industries which you want to focus on. So if you want to offer Performance Marketing for RealEstate, Position your agency like that. Create your strategy around that, and target be the expert in that and spread your wings.\n\n**Start with existing clients:** Again seen lots of agency owners saying I started but I am not getting clients. To resolve that issue, before you start your agency Be a freelance consultant and offer services once you have solid amount of repeat clients, Announce your agency launch to them and slowly increase their price. (I have done this mistake I jumped in and took me 7 months to land my first client)\n\n**The Agency:** When you start out you aren't an agency owner, you are just a freelancer or solo entrepreneur, you become an agency owner when you have atleast 20 clients in your portfolio and 10 current accounts and with atleast 5 full time employees working for you. And there is no shame in telling you work alone. For clients what matters is WILL YOU BE ABLE TO GIVE THE RESULTS WHICH IS PROMISED.\n\n**Hire Smarter: I** understand the excitement of Hiring and keeping employees, we feel really proud especially when you run a business for the first time. But the idea here is to reduce your cost as much as you can. So outsource to freelancers as much as you can, Just make sure that they are providing good quality work. Do not change the freelancers often If someone is giving you good results and you found someone way cheaper do not abandon your existing freelancer, Because quality of results matters in our space. Hire wisely on very important roles, those who bring in revenue to the agency, and you grow you can hire more and create a strong team. But again define who should be hired on  full time, contractual and part-time basis.\n\n**Packages &amp; Pricing:** Create a document which would contain all the information regarding your services, the detailed deliverables, starting prices or package pricing. Yes i understand that pricing changes according to clients but now you will get a base idea regarding what's your base pricing and whats the basic deliverables for that. So you will not go below that pricing at all. You create a Standard there for your agency. If you do not know how to calculate pricing, feel free to drop me a message.\n\n**SOP:** Another important challenge for agency owners is creating SOPs for the agency, Yes it is very important to make sure the agency is working in a disciplined manner, its not just about doing the work its about doing the work in a specific manner. SOPs are a Live Documents which you can keep updating upon specific intervals. There are lot of agencies out there who have not defined their SOPs, they need to start defining their SOPs mainly the Client Acquisition, Client Onboarding &amp; Operations SOPs.\n\n**Deck, Portfolio &amp; Proposals:** Its very crucial to create an agency deck, portfolio and proposal templates and keep it handy. Never waste much time especially in creating a proposal from scratch every time you get a client. Keep a standard branded proposal template. \n\n**Social Media &amp; Website:** Creating a website and social media handles are important but be clear about how you going to utilize them. For example. My website gives a complete picture of my agency, agency personality and our branded process and methodologies. We use Instagram to showcase company culture or sharing work etc. and LinkedIn is purely for client acquisitions. So the content will be created accordingly. Create a blog, create a post for that LinkedIn &amp; Create a reel/post/story on Instagram. Make sure your website and social media communicates better. and SEO should be optimized to create a better visibility. Also add your agency on all B2B, B2C and Agency Listing Directories for better reach. \n\n**No Paid Ads:** It might be surprising to here Yes i do not believe in running Paid Ads especially during the initial stages of agency growth. Use that budget to purchase a specialized tool or market research reports which can used for client projects etc. Run Ads when you have strong portfolio and you want to expand your service umbrella or target other countries. \n\n**Lead Generation:** The best way for Lead Generation during the initial stages are referral from your existing clients, Linkedin, It plays an important role with lead generation No you do not need Sales Navigator you can find hot leads with the right keyword searches, A well optimized website can give you good leads but not much but decent amount, Lastly partnering with other agencies and referring clients to each other. This can create a strong revenue stream for your agency. Never rely on one source of Lead Generation technique, keep multiple sources for leads. You can read more about our lead generation technique here: [https://www.reddit.com/r/agency/comments/1gru8wg/comment/lx9gzed/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/agency/comments/1gru8wg/comment/lx9gzed/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\n**Scaling:** An agency can be scaled when there is always strong revenue incoming from multiple sources. Scale understanding the market and demand. If you are not comfortable scaling your agency Do not do. Believe in your Gut Feeling.\n\n  \nThis is a just an outline on How to start an agency, I know i have not covered few topics here Feel free to reach out to me. If you have questions. \n\n",
    "subreddit": "agency",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1732279687.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1706535829088285
  },
  {
    "score": 62,
    "title": "How Did You Scale Your Agency to $50K, Then $100K Without Raising Funds?",
    "selftext": "Yo everyone!\n\nFor those of you who have grown your agency past $50K per month and then $100K per month, how did you make it happen? I’m especially interested in hearing from those who bootstrapped the whole way and figured it out without outside funding.\n\nWhat shifts did you have to make to hit $50K? Was it a matter of better positioning, niching down, improving your sales process, or something else entirely? And once you got there, what did it take to go from $50K to $100K? Did you focus on hiring, raising prices, improving operations, or doubling down on a specific offer?\n\nI know there’s no single right way to do it, but I’d love to hear what worked for you.\n\nI’m in the process of refining my approach and trying to be intentional about how I grow.",
    "subreddit": "agency",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 62,
    "downs": 0,
    "created_utc": 1739809691.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.451480192484522
  },
  {
    "score": 63,
    "title": "$700k in revenue as an Upwork Agency, trying to scale and partner up",
    "selftext": "I started my Upwork agency in July 2021, and we have done $700k in revenue so far.   \n\n\nOur expertise is building SaaS products for clients, and we've been doing decently well on that part.  \n\n\nNow I am looking into partnering up with some US, Australian or maybe European agency, so they can leverage the good reputation we have on upwork, and we can leverage their network of local clients.   \n\n\nBeen struggling with the partnership part, so would love to see how everyone here handled that situation, where to look for, and how to find reliable partners.   \n\n\nThanks guys!  \n\n\nP.s. I hope I am not violating any rules of the subreddit. If I am, just don't block me, delete the post and let me know. Thank You",
    "subreddit": "agency",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1703762568.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4017173753343
  },
  {
    "score": 63,
    "title": "Pivoted from a dev agency to Marketing after 15 years.",
    "selftext": "It's been a wild pivot. My dev agency primarily built MVPs for new founders and early stage startups (think green field and one off projects, or new startup proof of concepts), AI / vibe coding pretty much completely decimated this work.\n\nNo one wants to pay 6 figure or even anywhere near 5 figure for a MVP anymore, I would be fine with it if the clients suddenly also learned how to MANAGE SCOPE CREEP, but reality is they want cheap build for the same amount of scope creep.. even when they themselves subcontract us out for the same price (enterprises are slow to react). I still do some fCTO work on the side, but mostly research, I don't own any of the delivery.\n\nI wanted to try marketing because while I found nearly all my clients via direct sales and referrals, I was never good at marketing.. think social media. I started typing words on Reddit last year to communicate better, then grew on X.\n\nI'm now four month in, have been doing a combination of ghost writing, market / ICP research, SEO and the new hot \"AIO\" (think chatgpt seo). First month (feb) was at $1500, grew to $3k in march, and this month we got to 6K. About hit $10K+/mrr come May 1st. (happy to provide proof to mods).\n\nFirst 3 customer came to me via a business peer group and Reddit. Best paying customer came via Linkedin, and rest have been referrals. Started charging $500/month to basically do whatever they want me to do, and now starteds to automate a ton of the process like providing customers with weekly summary of the content I wrote and repurposing longer form content (podcast/youtube) into shorter posts for X/Linkedin and even Reddit\n\nAIO is the hot topic right now. Everyone wants in but no one knows how to do it. I've been working on an offer for my clients and it's been blowing up (closed 6 clients on friday to start May 1st).\n\nNo idea where this goes, if yall are interested I'll post again in a couple of weeks.",
    "subreddit": "agency",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1745802050.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.419105979804959
  },
  {
    "score": 61,
    "title": "How did you get your first client?",
    "selftext": "I think we all have a wild story about how we potentially got our first client but I am curious how did you get your first client and what worked well for you when you were just starting out? For me besides my dad‘s Painting business which really doesn’t count was a restaurant that was paying me $200 per month, but I was spending $500 per month on ads so I was literally losing money to get my first good case study. You? ",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1756903747.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5314309112399633
  },
  {
    "score": 60,
    "title": "Lost a pretty big client this year.",
    "selftext": "We had this client for 5 years. We represent clothing brands to boutiques and major retailers like Bloomingdale, Nordstrom, etc. \n\nThe brand left on good terms. There were no complaints. A solid relationship wouldn't sling any mud on them. \n\nAs always, we saw it coming. It's a pretty routine thing in our business, so it wasn't a surprise. This happens when brands go from 6/7 to 8 figures. Its just the way it is. \n\nWhen they came to us, they were doing seven figures in annual revenue. They were new and exciting to work with, and we had some great results. \n\n2024 was the most significant income we made from them—just over 500k for 9/12 months. We can't see anything we could have done differently because economic conditions mean they can afford to hire two full time employees to cover our geo once they pay us that money. \n\nWe could have offered a lower retainer before they jumped ship, but we aren't going to do that because it would get out in the industry. \n\nWe aren't going out of business, but it will be a big hit. Working on replacing that income. \nWe plan to expand our inbounds through content creation and start some cold outbound. \n\nWe have never had to do either. So it should be interesting \n\nEdit: The client is now doing 8 figures for annual sales. ",
    "subreddit": "agency",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1741646531.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4745713092877346
  },
  {
    "score": 60,
    "title": "My mentor said this and everything changed – I'm finally niching down to scale ",
    "selftext": "I'm based out of Bengaluru and run an SEO agency for SaaS.\n\nThings have been (and still are) pretty good. I've got clients on retainer, getting work through reference, and have a steady cash flow, and I can see this becoming even better with time.\n\nBut then, something happened a few days back which f\\*c\\*ed my mind. Not in the negative sense but as to what the hell am I doing! \n\nThe thing is I've been working with mostly early age startups who can't invest much in SEO, so I'm getting anywhere bw $800-$2000 per client per month. \n\nI met my mentor after ages last week and spoke with him about this and then he mentioned that my work, my zeal, and everything else must be great but it will all lead to nothing if the direction is wrong. \n\nBtw, he had run his own agency and sold it years back, so he really knows what he's saying.\n\nHe said, \"*Working at this range is only going to keep you busy at work but not make you wealthy. To get there, to become big, target big. Tell me one simple thing: Why the hell would you charge $1000 for a thing, for which you can charge $10k? And I can give you in writing that folks who are shittier at this are charging this much and more already. The best part is people are paying them as well. So, what's stopping you? You've got good results and testimonials - why still think small? Look at your clients, find a pattern, niche down, and be a specialist SEO agency of that niche and then, charge like a specialist.*\"\n\nIt made so much sense to me. \n\nThen, I analyzed all my clients and realized that unknowingly, more than 80% of my clients are of the same sub-niche. Did some research as well this weekend and finalized it.\n\nChanging everything now and just aiming big! \n\nP.S. this is not to disparage any company, client, freelancer or agency but an honest share of thoughts and experience\n\n",
    "subreddit": "agency",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1732602506.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3465842913638855
  },
  {
    "score": 60,
    "title": "How we doubled our business in 2.5 years: from $71k to $166k MRR",
    "selftext": "Hey everyone,  \nWe started as a Polish SEO/SEM agency. Over time, we built a tool for ourselves that ended up changing our entire business. Since I keep getting asked *“Is growAp a SaaS? Is it still an agency? Can it work for others?”*, I thought I’d share the full story here.\n\n# Background\n\nWe built growAp as an internal tool. We were running an SEO/SEM agency, serving clients with dozens of locations (retail, clinics, finance, insurance, etc.). Managing Google Business Profiles and other local listings was a nightmare: manual updates, mistakes, lack of consistency, hundreds of wasted hours.\n\nIn 2022, we wrote the first version of the app (originally just a simple review management script), which:\n\n* centralizes Google Business Profile management,\n* automatically overwrites data,\n* integrates alerts, handles reviews, manages reputation,\n* works as a B2B white-label platform for agencies.\n\n# Team – 7 years of single listings before building real structure\n\nBefore growAp, we spent 7 years as an agency manually handling single listings. Literally: opening Google, changing hours, updating photos, replying to reviews, fixing map issues, removing duplicates. All by hand, client by client.\n\nThe one thing we knew: if we ever automate this, we need to know every dirty detail of the process.\n\nBuilding a team that can handle this at scale took us… years. Today, we have around 10 people working full-time verifying local data, monitoring errors, reporting issues, analyzing duplicates and reviews. Some of them came from the original agency team, others joined later as “growAp support.”\n\nWe didn’t build a team overnight-because you can’t design a process you haven’t gone through yourself. But once you know it inside out, you can hire people and teach them not only *how* to click, but *why*.\n\n# How we got clients\n\nThere was no single magic channel. Over the years we tested different approaches, and only later it started becoming predictable. Some worked great, others looked good only on paper. Here’s what actually brought clients:\n\n* **SEO** – classic. As an agency we had processes and know-how, so we started generating leads organically for terms like “Google Business Profile management” or “Google Profile for multi-location networks.” Many companies came in already educated.\n* **Referrals** – nothing for a while, then everything at once. Happy clients brought in their colleagues, managers, PMs, or someone who “saw a presentation at a partner company and wanted the same.”\n* **Trade shows &amp; conferences** – especially retail and franchising events. Sometimes a 7-minute coffee chat turned into a rollout for 300+ locations.\n* **LinkedIn… spam** – yes, we did cold outreach on LinkedIn. And… it worked. But honestly, I don’t recommend it. After 1,000 messages with personalization and automation, maybe you land one decent client-but the effort is massive. Sometimes posting once a week would’ve been easier.\n* **Cold email** – same story. We ran campaigns to specific networks, pointing out real Google Maps errors with suggestions and solutions. CTRs were good, conversions acceptable. But it’s a starting tool, not a scaling tool. Easy to burn through your database. We also learned that marketing managers aren’t always the best target.\n* **Partnerships with other agencies** – the real gamechanger. SEO and marketing agencies started offering growAp as their own (white-label), while we focused on support and training. This generates the most new clients today and the highest value per account.\n\n# The numbers – 3 years of data (2023–2025)\n\n|Year / Month|🟩 CPC (USD)|🟪 SEO (USD)|🟨 growAp (USD)|\n|:-|:-|:-|:-|\n|2023||||\n|Jan|9,000|42,000|20,250|\n|Jun|13,750|40,750|21,500|\n|Dec|12,000|42,750|31,500|\n|2024||||\n|Jan|17,000|62,250|48,500|\n|May|23,000|92,500|55,500|\n|Oct|24,500|90,250|57,750|\n|Dec|24,250|91,500|55,000|\n|2025||||\n|Jan|20,750|72,500|59,500|\n|Mar|24,250|90,250|62,000|\n|Jun|28,250|83,000|55,250|\n\n# What changed in our company\n\n* We hired a dedicated product team for app development\n* We separated agency operations from tech operations\n* We started onboarding other agencies to growAp (white-label)\n* We introduced revenue-share structures with partners\n* We stopped outbound entirely – 100% of clients now come from inbound and referrals\n\n# If I had to give advice…\n\n1. Build a tool for yourself first. If it works, then think who else it might help.\n2. Measure everything. That’s how we knew growAp was making a difference-before clients even realized.\n3. Don’t try to be “SaaS.” Solve a specific problem. In our case: chaos with 100+ listings.\n4. Your ops team must be able to handle it. Without processes and training, it’s just another dashboard.\n\n# We have the processes. And we’re ready to share them.\n\nAfter all the tests, mistakes, and iterations, we now have fully developed and proven processes for:\n\n* onboarding clients with 10, 50, or 300+ locations,\n* structuring a team so you don’t drown in support tickets,\n* creating an offer that doesn’t need 3 slides of explanation,\n* ensuring scalability and quality- even with 1,000 listings in the system.\n\nIf you’re building something similar - an agency, a B2B product, or a local SaaS-feel free to reach out.  \nIf you have questions-technical, operational, pricing, or about the team-ask away.\n\nRunning an agency with local clients? Maybe you’re two years behind where we are now-I’d be happy to talk if you’ve got a concrete challenge to solve.\n\nHere is our financial report: [https://www.bizraport.pl/krs/0000994905/greenfields-sienkiewicz-spolka-komandytowa](https://www.bizraport.pl/krs/0000994905/greenfields-sienkiewicz-spolka-komandytowa)",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1755517384.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.269863857185905
  },
  {
    "score": 60,
    "title": "My first client/win for a new brand",
    "selftext": "Today, I got my first client paid 3 months in advance.\n\nBackground: Started SEO Agency, which failed. Lot of competition from cheap agencies so we pivoted and launched a super niched down agency.\n\nAd Spend: A$600+\n\nTotal leads: 52\n\nCalls booked: 12 (Made a huge mistake of not following up to leads, not making the mistake again,  called 6 leads and booked 3 meetings on the call).\n\nPotential client: 1 (Wants to start from 31st)\n\nRescheduled call: 1 (Asked me to call back in 3 weeks, as he is busy moving in)\n\n1 Paid today.\n\n**EDIT 1:**\n\nPlatform: Meta Ads\n\nAd Type: Simply recorded video on my phone.\n\nCopywriting: I took a course form random YT dude and it helped a lot. Spent entire day writing 30 second script. Spent 70% of the time on hook only. I changed hook once and dropped performance. Went back to old video and boom leads started coming in.\n\n**EDIT 2:**\n\nPlease do not use this post as an excuse to try and sell me lead gen services. You can share your website, I would check that out and save for future references but I will not read a few Google docs and sign up with your services. **Bonus:** Do not try to sell me dream of 60+ booked meetings. Our meetings are packed with value and going through 2 meetings in a day is already exhausting enough. Thank you.",
    "subreddit": "agency",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1753247638.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.535329835010767
  },
  {
    "score": 59,
    "title": "Starting a web agency in 2024 is not worth it",
    "selftext": "Let me say this is my experience/opinion so take it with a grain of salt.\n\n99% of people are better off with a regular job vs starting a web design company.\n\nThe amount of time wasters, scammers, and idiots I run into on a weekly basis is astronomical. The time wasters are the real business killers. They act all interested and then when you spend a significant amount of time talking to them on the phone and sending them a custom quote and some details they ghost you for someone who will do it cheaper.\n\nThe cold hard truth is that there is too much competition in this space. \n\nThe reddit user citrous_oyster will claim you can just cold call businesses to sell websites. Yeah possibly if you are a charismatic salesman that doesn't mind doing 200 cold calls a day. There is a reason you don't hear repeat stories of cold calling success in this field like citrous oyster, it's because it's fucking stressful and soul crushing. Try it yourself, it's a lot more mentally draining than you would think. No hate towards citrous oyster, he has contributed a lot to the web community but his posts do make it sound a lot easier than it really is. I'm sure it's easy for him because his personality type is a great fit for this type of sales, whether he wants to admit it or not.\n\nIf I wanted to be a talented and charismatic full-time salesman I would just get a job as a full-time salesman and make waaaaaay more money working 40 hours a week.\n\nOk so let's look at this from a different angle. I made $10,000 last year by charging $70/hr. Even if I did 4 times more business this year I would still be making only 50% of a regular mid tier web dev job without any health insurance or other benefits. I also have zero security or guarantee for next week's paycheck while running my own business. Yes that's obvious but it's just another con to add to the list. \n\nIf you aren't making at least the same amount for the amount of work you do at a regular job, running this type of business probably isn't worth the extra stress and headaches.\n\nI've tried almost every sales source under the sun, LinkedIn, cold emailing etc\n\nMy experience with partnerships is they will act interested and waste a shitton of your time and then never send you any work. I've only gotten one halfway decent partnership. Half of them turned out to be scam artists. The other half were insufferable time wasters.\n\nWhen I get in front of people it's clear that they are in a cheapo mindset. I recently built a 13-page website for a company that makes $40 million a year in revenue. They bitched about having to pay $6,000 to have it built and tried to nickle and dime me every step of the way.\n\nThe golden age is over. The well has run dry. \n\nIn conclusion, only start a web design company if you are a charismatic salesman that doesn't mind getting told no 199 times every single week of the year or you already have a ton of business connections. The average person will get financially murdered in this market. 99% of people will be much happier with a regular job.",
    "subreddit": "agency",
    "upvote_ratio": 0.75,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1723996440.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4243099177577316
  },
  {
    "score": 59,
    "title": "Made 30k selling Low Ticket Products then Calling Prospect to Close High Ticket",
    "selftext": "Last month was my first month running this new offer for my agency. In which I ran ads for a Low Ticket Digital Product with a few upsells to make a profit after my CPA, on the backend of the funnel I offered to run their ads, build their funnels &amp; to book a call with me. This is very exciting for me after switching back to my agency from doing ecom for a while. I believe my model is a hybrid between the two, I used my knowledge from both industries to create this offer. Without Cold Calling, Sending 100s of emails or DMs. Will continue to scale this offer and update. I’ll leave my statistics below 👇",
    "subreddit": "agency",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1709992842.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4598937598229687
  },
  {
    "score": 57,
    "title": "What do you think of Iman Gadzhi?",
    "selftext": "** Thinking about buying Iman Gadzhi’s course, this is why I’m asking\n\nWhat I know: Iman “supposedly” owns a social media marketing agency (SMMA), where he claims to have made all of his money from. I also know that he promotes his lavish lifestyle on his social media and sells a course. \n\nThe question: Do you think he actually owns a social media marketing company, or do you think he promotes a made-up lifestyle and uses that to sell his course? \n\nAlso, do you think he’s made more money through his agency or by selling courses?\n\nAny input is appreciated!",
    "subreddit": "agency",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1688378198.0,
    "media": null,
    "is_video": false,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5368497875353238
  },
  {
    "score": 58,
    "title": "Millionaire Agency Owners, How Would You Start Today?",
    "selftext": "Millionaire agency owners who own $1M+ ARR agencies, how would you start today if you didn’t had the resources you have now?\n\nHow would you go finding clients without having a good network, how would you hire employees without offering competitive benefits and comp?\n\nAs a professional web developer who is building an MVP/Web dev agency, I would love to pick your brains and try to scale my service business to at least $10k+ per month which is doing $4k/month right now",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1716833108.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3495488915536282
  },
  {
    "score": 56,
    "title": "I'm 17, sent a 100 personalized cold emails as a video editing agency, and got 0 responses. Please help\n",
    "selftext": "I run a video editing agency and have sent about 100 personalized emails to YouTubers with 100-300k subscribers in a specific niche. Despite having a good website and portfolio, I’ve seen better results with Twitter cold messaging. Here's an example of one email I sent, can I get any advice?\n\n**Subject: We Found Issues Affecting Your Channel's Engagement | NAME OF AGENCY**\n\n**Hey NAME,**\n\n**I've seen your channel 'Channel Name' and loved your recent video \\[Title of video\\].**\n\n**I noticed some issues with pacing and other minor problems in your videos. Slow or uneven pacing can make the video feel dull and lose viewer interest. We also saw that your shorts have some issues hindering their growth.**\n\n**Would you like to see some examples of how we can improve your content?**\n\n**Check out our previous clients here -&gt; OUR WEBSITE**\n\n**Best regards,**\n\n**MY NAME AND POSITION**  \n**TWITTER HANDLE**\n\nIn the second paragraph, I highlight the problem and how we could help. This is the structure of all my emails. What can I do to improve?",
    "subreddit": "agency",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1721569446.0,
    "media": null,
    "is_video": false,
    "num_comments": 161,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.505632362943807
  },
  {
    "score": 59,
    "title": "Has hyper-niching your agency actually paid off?",
    "selftext": "We’ve been a soup-to-nuts digital shop for years: PPC, technical SEO, UX audits, email flows, the whole circus. It pays the bills, but every quarter feels like juggling a dozen totally different buyer personas.\n\nScrolling LinkedIn the other night I noticed Kaizen SEO: they only do SEO for recruitment firms and apparently have a wait-list. Same playbook we run, just laser-focused on one industry, and it seems to be working for them. That got me thinking: maybe depth really does beat breadth.\n\nIf you’ve pivoted from generalist to niche, whether by industry or by single service, how did it shake out? Worth the trade-offs? Drop your lessons learned, good or bad.",
    "subreddit": "agency",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1762908067.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3595301662244306
  },
  {
    "score": 55,
    "title": "10 practical tips for running a fully remote 6-figure online agency",
    "selftext": "Hey friends,\n\nI’ve been providing consulting services as a freelancer and agency owner since October 2017. Since then I’ve worked with over 40 clients in a number of industries (mostly SaaS and DTC eCom) and generated a little over $1M in revenue. In 2021 I launched projectBI, my first agency.\n\nI mention this not to brag but to assure you that the tips I share in the rest of this post come from years fighting in the trenches.\n\nIf you’re just getting started on your journey as an entrepreneur, the advice I share in this post will save you years of frustration and a LOT of money.\n\nThis is a long post so feel free to jump to the tips which resonate the most with you and skip the rest.\n\n# The tips\n\n* Stick to hourly-based “salaries” for as long as possible\n* Hire sooner\n* Don’t sweat the small expenses\n* Leverage cash on hand\n* Over communicate\n* Most partnerships are a waste of time\n* Raise your prices\n* Reduce banking fees by using Wise\n* Use Upwork to find new team members quickly\n* Marketplaces are winner takes most\n\n# Tip #1 - Stick to hourly-based “salaries” for as long as possible\n\nOne of the most expensive mistakes I made when I first transitioned from freelancer to agency owner is paying team members a fixed salary.\n\nI had a belief that if I find someone that is good enough for the business that I need to “lock them down” with a fixed salary.\n\nI think this is a trap, especially when you are first getting started.\n\nThere is entire market of freelancers out there that are used to being paid on an hourly basis. Take advantage of this to keep your costs variable in nature instead of fixed. Fixed costs add massive pressure to a business, especially a business with irregular cash flows.\n\nMy advice is to find your initial team members via Upwork or an equivalent marketplace and only switch over to paying a fixed salary once your business can afford it.\n\nYou’ll know you’re at that point once you are drowning in work and have checked the following boxes:\n\n* You’re getting enough leads on a consistent, semi-predictable basis\n* Clear service-market-fit\n* You personally are drowning in work and the only clear way forward is for you to delegate account management / service delivery.\n\nOnly once the three checkboxes above are checked should you even consider paying a team member a fixed salary.\n\nI think the exception to this rule would be if you are an experienced entrepreneur re-entering a market you are familiar with and want to move quickly.\n\nAs long as there is some cash in the bank and a high belief that the business will quickly scale, then I think its fine to hire full-time team members and pay them fixed salaries.\n\n# Tip #2 - Hire sooner\n\nI worked as a solopreneur (AKA freelancer) for 4 years before transitioning to the agency model. Only at that point did I start hiring individuals to help me grow the business.\n\nLooking back I should have transitioned much sooner to the agency model and start building a team.\n\nThe difference between doing everything yourself and being able to delegate tasks to others is day and night.\n\nA business can’t scale without adding leverage. A freelancer has very little leverage.\n\nBy hiring a team, you’re adding the first major type of leverage, labor.\n\n[](https://substackcdn.com/image/fetch/$s_!hBBD!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc4c7d19f-911f-46d6-8381-60c7a7d2264f_960x540.png)\n\nEven though labor is at the bottom of the pyramid, it’s still substantial.\n\nNow of course not every freelancer should transition to the agency model and start hiring a team. It’s very individualistic and it comes down to what you want.\n\nNot everyone can manage people and has the interest to scale. That’s completely fine but if you want more and feel stuck as a freelancer, you’ll need to take the step and start building a team.\n\nMy advice: Hire quickly and fire even quicker.\n\nI could write a thousand words on this topic alone but let me try and summarize it for you.\n\nYou want to hire quickly. There is no need for hours and hours of interviews, tests and process around finding your initial team members.\n\nYour first hires should be directly involved with service delivery. This means you’re hiring specialists (designers, coders, copy writers, etc). Since you were doing this work up until now you should be able to quickly determine if the individuals you are interviewing have the skills to do the job.\n\nA short 30 minute intro interview to get a feel for the person and share the responsibilities of the role, and another 30 minutes for a test should be enough. Don’t waste your time with references, take home tests, etc. Do everything on the initial call.\n\nGive the person a clear answer within 24 hours.\n\nOnce someone has been hired (remember, on an hourly basis first. See tip #1), you want to give them no more than 2-3 weeks to prove themself. Make sure you offer as much support as needed, ask for feedback on process and do your best to help the new hire succeed BUT if things aren’t working out after 2-3 weeks, you need to pull the plug.\n\nI’ve found that the difference between an A player and B and C players is attitude and intelligence. These are two things you can’t affect as a manager. A hire with a good attitude will take advantage of the opportunities you present, go out of their way, take on more responsibility and genuinely try and help push the business forward.\n\nI’ve yet to hire a B or C player that becomes an A player, no matter how much feedback, support and patience I show them. It’s a sad truth but most people never change.\n\nThis is why you need to be quick to let people that aren’t meeting your standards go so they can find a job that’s a better fit for them.\n\nYou can find the rest of the tips in my latest post here - [https://open.substack.com/pub/justinbutlion/p/10-practical-tips-for-running-a-fully?r=3xv01&amp;utm\\_campaign=post&amp;utm\\_medium=web&amp;showWelcomeOnShare=true](https://open.substack.com/pub/justinbutlion/p/10-practical-tips-for-running-a-fully?r=3xv01&amp;utm_campaign=post&amp;utm_medium=web&amp;showWelcomeOnShare=true)",
    "subreddit": "agency",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1759959033.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.350112572374828
  },
  {
    "score": 54,
    "title": "I'm burnt out.",
    "selftext": "I'm owning a Performance marketing agency - focusing on paid ads and email automations. I have one employee and a business partner. My business partner is mostly leading the sales &amp; creative and me and my employee run the campaigns and client's communications. \n\nI feel like we're failing on every front. Most customers are not scaling the way we wanted to, i feel overwhelmed with everything, and in general it feels like I'm battling in a type of business that is just struggling.\n\n  \nI have a lot of experience and i understand marketing and business, and yet - it feels like everyday my job is to explain why we don't bring more sales. \n\nAnyone can give a tip on how to continue from here? I'm considering to shut the business, fire all of the clients and look for other directions.\n\n",
    "subreddit": "agency",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1747924840.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.404028937709878
  },
  {
    "score": 52,
    "title": "I tried cold email for my ai agency - here is what happened (few leads + scale up plans)",
    "selftext": "I tried cold emailing PPC &amp; SEO agencies.\n\nI didn't want to be the \"spray and pray\" guy so I made a few tests on the US market segmented by:\n\n* Keyword: \"SEO\" or \"PPC\"\n* Industry: Marketing &amp; Advertising\n* Company size: 1-10, 11-20\n* Owners / Founders\n\nI made 4 lists in the 300-600 mark.\n\nI cleaned automatically and manually the list. Often there are contacts that have nothing to do with the keyword. So I looked the keyword if exists in the company description and cleaned it with Claude Code (or manually).\n\nRemoved all agencies without sites.\n\nGot infrastructure of Google workspaces from a provider - 4 domains &amp; 3 email boxes - total of 12 email boxes.\n\nWarmed up in Instantly.\n\nI used AI to create this deep personalization - crawled their site, summarized pages, wrote 3 points.\n\nI added my top case studies (made X revenue for this company; incrased sales by Y%).\n\nI added an offer with guarantee and soft call 2 action.\n\nThen I sent the campaigns.\n\nI got few positive replies and booked few meetings (stlil in negotiation with some of them).\n\n[Instantly campaign](https://preview.redd.it/cgx87ku6cb7g1.jpg?width=1683&amp;format=pjpg&amp;auto=webp&amp;s=846de778befd6b7280ab8d8642cd051622884fc0)\n\nI made a [Notion doc](https://distinct-wave-2c5.notion.site/The-Cold-Email-Resurrection-How-to-Bypass-Spam-Filters-and-Spark-Real-Conversations-at-Scale-2c41d5e95bf5808784bcdf6cd67ea26f) explaining the whole process from the lead sourcing, enriching and softwares, copywriting strategy etc that worked for me.\n\nI didn't want to over complicate. I wanted just to start.\n\nNext steps are: scaling what works; sourcing signals like scraping competitors in Linkedin &gt; scraping their followers' comments; reaching them out;\n\nHave you succeeded with your cold email campaigns?\n\n[](https://www.reddit.com/submit/?source_id=t3_1pmib1p)",
    "subreddit": "agency",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1765780580.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2764461443275796
  },
  {
    "score": 52,
    "title": "I have let go of 5 agencies last 6 weeks.",
    "selftext": "I’ve let go of 5 agencies in the last 6 weeks.\n\nI work at Delfina Marketing, a boutique digital marketing agency in New York City. Until last year, we primarily worked with women’s apparel brands, generating seven and eight figures, but we didn’t actually handle their digital marketing. Our core skill is serving as a sales agency to department stores and boutiques. \n\nWe now utilize Facebook ads, email marketing, and a few other strategies, primarily for Shopify brands.\n\nWhy: I got into digital marketing in 2020 because my wife and her partner launched a T-shirt brand and couldn’t find anyone reliable to run the marketing side. I stepped in to help for a bit.\n\nFive years later, here we are. I run a Shopify brand that generates eight figures annually, and I also manage the marketing side of an agency. Now, I hire agencies as the client and have them serve as clients of the agency. (My wife's brand is much bigger than my clients)\n\nHere’s what I’ve learned, and why I’ve had to part ways with a few agencies. This isn’t meant to call anyone out, just an honest look at what it’s like from the inside.\n\nThe first was on a five-figure retainer. They were supposed to handle top-of-funnel traffic. Before hiring them, I told them I’m active on the platforms and would defer to them on strategy. I figured they’d be stronger there. However, they kept focusing on the bottom of the funnel, even after I brought it up several times. At one point, they said, “We’ll have to address this later because you’re making us miss our goals.” I set the goals and channels. Missing goals happens, I can't change the channels to suit a numbers issue. \n\nThe second was a performance creative agency. They started great, with good ads and solid results. Then it turned into making ads to make ads, even retesting things that had already failed. I mentioned it a few times, but it didn’t change. I think they were just stretched thin with new clients. We ended on good terms, and I’d probably work with them again once they get their feet back under them.\n\nThe third was another five-figure retainer, a creative agency that booked models, shot videos, and produced static work. They did solid work, but when I compared their output to what we were doing in-house, ours performed better. It wasn't easy to justify continuing the retainer.\n\nThe last two were both performance creative agencies. Neither made it past 45 days. They became frustrated with how quickly or slowly we moved and expressed their sarcasm about it. My take is that if you’re on a performance creative and we’re behind on feeding assets, the move is to wait, not push back with attitude. At the time, we were spending around $ 600,000 a month on Facebook and $ 50,000–$ 60,000 a month on creative. It just wasn’t a good fit.\n\nI’m sure I wasn’t perfect in any of these relationships either. I know the pressure on both sides. I’ve probably been tough to work with at times, too.\n\nBut most of the time, when agencies get let go, it’s not just about results. It’s misalignment, lack of communication, or bad chemistry.\n\nWe still work with seven other agencies. The business is up 125 percent year over year. This isn’t a complaint post; it’s just a note from the field.\n\nEvery one of these relationships ended fine. Everyone got paid. Every retainer was honored. In one case, I even offered to pay out the rest of the contract to close things cleanly.\n\nThat’s how I try to operate. Keep it professional, keep it fair, and keep moving forward.\n\n\nEdited for clarity and context. ",
    "subreddit": "agency",
    "upvote_ratio": 0.68,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1759362191.0,
    "media": null,
    "is_video": false,
    "num_comments": 208,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.394349012656316
  },
  {
    "score": 54,
    "title": "What’s working? Small Agency Lead Gen",
    "selftext": "I have run my small web design &amp; digital marketing agency for years. From freelance to small team. We do ok. But, I am genuinely perplexed with attracting the right clients to keep our pipeline full. \n\nThere is too much noise on meta. I do not touch tik tok out of principle. \n\nI am a middle aged, somewhat fried, career marketer.\n\nI get no joy talking to local micro start ups. I do have a local program, but it is low ticket. \n\nOur “ideal” clients seem to be established older businesses that lack digital infrastructure. We can create a professional website, solidify all their other loose ends and set them up for success. \n\nWe are not a “lead gen agency”. We are very realistic, and rarely promise an exact result. A by product of my 20 years marketing both corporate and agency.\n\nWe have steady mrr and projects, but my biggest focus is quality lead gen for the agency. \n\nWith adequate budgets, we can return results for customers. But to be transparent, I can’t stand wasting my own $ “testing.”\n\nI know the boardroom version of what to do, but what is breaking through the noise. \n\nIf you make multiple 6 figures and would be willing to let me in on what’s working, I’d be very appreciative. Also, if running ads, how much are you spending?\n\nI do not have a dedicated sales team or process I am happy with yet.\n\nThanks for the help in advance.",
    "subreddit": "agency",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1756497702.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4735590320733563
  },
  {
    "score": 55,
    "title": "Am I charging too much for my websites?",
    "selftext": "I used to charge $1500 per website and $125/month for maintenance and hosting. but made so many cold calls and people saying it’s too expensive. now I have reduce it just $249/ month which includes the website, hosting, maintenance, and support. I design and make my website from scratch with Figma, adobe illustrator/photoshop, and Next.js. Because of that, all the websites I make have all 100 on google lighthouse test. So am I charging an appropriate price. Should I increase it to $349? I live in MN if that makes any difference.",
    "subreddit": "agency",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1751309973.0,
    "media": null,
    "is_video": false,
    "num_comments": 129,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.427659703159619
  },
  {
    "score": 54,
    "title": "Signed our first creator client - estimated to be worth $150k a year to us in fees",
    "selftext": "Wanted to share a little win - since a pivot in business, we've signed our first large client.\n\nI've been running a fashion design and manufacturing agency for 7 years, focusing mostly on corporate clients and SMEs, which went well (scaled to $40k per month, team of 5 and growing YOY) but we recently decided to pivot into the creator economy \n\nOur offer - we strategise, build and manage merch and clothing brands for creators with pre-existing audiences (1m + subscribers / followers per platform)\n\nWe manage;\n\n1. Product manufacturing\n2. Building your website\n3. Distribution\n4. Customer support - 24/7\n5. Brand marketing\n\nAnd we work on a revenue share model. The creator fronts the cash to build out an MVP and we use our network to access factory prices on product and build what we can in-house to keep initial costs low.\n\nWe recently signed our first client who actually already has a merch brand setup but is struggling on managing workload / time. Running the numbers, based on experience + their data (AOVs, LTVs, conversion rates) and taking into account improvements we'll implement, we foresee $150k in fees this fiscal year from this one client.\n\nJust thought I'd share the win for anyone needing the motivation.\n\nFor those wondering, we got this client through cold outreach (email) on a hyper personalised, 4 step email campaign process with a cadence of 1-2-5-10 (days) and they showed interest on day 5. We then hopped on a discovery call, put together a proposal which took 7 hours, drove down and pitched the client in person with custom samples we'd developed, alongside a re-design of their landing page.\n\nSo in short, we led with immense value upfront and it paid off.\n\nHappy Tuesday!",
    "subreddit": "agency",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1715688657.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2271196594331877
  },
  {
    "score": 33,
    "title": "How to get clients",
    "selftext": "I’m struggling with cold outreach and getting clients to a meeting, I’ve cold called and cold messaged maybe over 500 people at this point, they just leave me on read or the people who I’ve called they don’t get back to me when they do sound interested. \n\nNeed some advice or if you have a script that helps you and I could try out, would be great. \n\nI already had a free trial client and got a video testimonial from him but went no further than that. I’ve started to post on an Instagram account for the business. To build a personal brand. But it’s kinda hard when I feel like people are uncomfortable with some random person reaching out to them.\n\nAny piece of advice would be much appreciated.\n\n(Also, my service is lead generation and automations. I’ve been doing marketing for over a year now, certified in Google SEO, Google Ads, Facebook ads, and Google analytics.) \n",
    "subreddit": "agency",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1709235338.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1651921660125675
  }
]