[
  {
    "score": 185,
    "title": "Knockoffs are ruining me!",
    "selftext": "My product has been on the market for just over a month. In that time I have completely sold out of my inventory, but there are Chinese knockoffs showing up on Amazon every day! So they are getting the sales, not me.\n\nI am reporting them for copyright infringement since they are using my photos, and getting some taken down, but its like playing whack a mole. My trademark and Patents have not gone through yet so I feel I have no real recourse.\n\nThis is a product I invented, had injection mold tools made (in China) and imported/listed myself. The product is complicated enough that I have a hard time believing that a scammer could have created injection molds and gone to production in less than a month, but I suppose its possible.\n\nThe knockoffs are listed way below my price point so it also doesnt seem like they are just buying from me and reselling. \n\nI purchased one from them and have not received it yet to be able to inspect what I get.\n\nHas anyone dealt with this or found a good way to combat?\n\nThanks!",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 185,
    "downs": 0,
    "created_utc": 1741975658.0,
    "media": null,
    "is_video": false,
    "num_comments": 104,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.0151075937528855
  },
  {
    "score": 170,
    "title": "I Hate Amazon &amp; Why You Will Too",
    "selftext": "Rant - amazon is a disgusting company for sellers. We have lost thousands of dollars due to damaged items, returns, fraud, and other forms of manipulation. In 98% of cases we filed for those issues only 2% of the time amazon responded on our side.\n\n&amp;#x200B;\n\nWe have seen customers order items use them and then return them within 30 days for a year straight with amazon doing nothing about it. To solve this situation we just started cancelling the order for that specific buyer. But they can move addresses and screw you many times before they run out of places to ship to.\n\nWe have seen customers order our items and then claim they were never received even when a signature is required and pictures of the item delivered that could be confirmed with Google Earth. With amazon again taking the side of the customer. Though legally this would be classified as fraud.\n\nWe had a new experience today when a customer requested a refund because the item was marked delivered when they had not received it. Naturally a refund was processed but then the customer reached out a day later to let us know that the item actually showed up. When we tried to retrieve our funds that were refunded at the demand of the customer we were surprised once again at the protocol amazon has for their sellers. When we tried to submit a safe t claim it did not allow us. When we reached out to customer service they told us that the customer has to contact them and request to be charged for the item. The customer of course did not do this. When reaching out to amazon again about this issue they said this was the only option to retrieve our funds. As usual with amazon and their support team. A complete dead end, waste of time, and a lot of frustration.\n\n&amp;#x200B;\n\nMy tip if you are new to amazon and excited about the TikTocs you hear about getting rich easily.... is to price your product accordingly. Amazon takes steep fees every step of the way. Their return policy is constantly manipulated, making the sellers be responsible not just for the shipping cost there but the shipping cost back. The more you spend on ads, the more of these types of issues will occur. Most important tip is to check out every other platform and list your products on there. Majority of the time they are a million times better than amazon. Try Walmart, eBay, and even Etsy to push your products through because they will take care of you a million times better than amazon ever will.\n\n&amp;#x200B;\n\nMost importantly remember... aMAZON MAKE ITS MONEY ON YOU THE SELLER, not the buyers. The contract you sign to work with them is as good as the one you will sign with the devil as they will take your money and allow fraud, manipulation, and other losses to you and that contract prevents you from suing them. I am hoping some attorneys find the right wording to do a class action soon.\n\nFUCK aMAZON &amp; FUCK THEIR ILL TRAINED CARELESS SUPPORT TEAM.\n\nThat concludes my tantrum.  I sincerely hope that the majority of seller's experiences are better than mine.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 170,
    "downs": 0,
    "created_utc": 1704410985.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8922386198314785
  },
  {
    "score": 124,
    "title": "Amazon is getting ridiculous and rewarding petty thieves with both product and their money back.",
    "selftext": "So here’s what happened.\n\nI sold a handmade sculpture on Amazon, something I put a lot of time and care into. The buyer, a woman named Emily, got it just fine. Then out of nowhere, she messages me saying she wants to return it because it “looks better at a lower level.” Her exact words were basically that the eyes looked off when she put it higher up.\n\nI told her nicely that I can’t take it back for that reason. The piece looks exactly like the photos, and I’m not a big company that can just eat losses because someone didn’t like how it looked on a shelf. I’m one person making and shipping these myself.\n\nShe didn’t like that. She got defensive, saying my question “didn’t make sense” and that the “advertising didn’t match her hopes.” Whatever that means.\n\nThen she started opening return cases. Three of them. Each time she gave a new reason. The last one? She claimed the item was “defective.” Totally false. Nothing wrong with it, she just didn’t like how it looked where she put it.\n\nAnd guess what? Amazon **refunded her in full** without even checking if she returned it. She didn’t. She still has the piece and the money.\n\nSo now I’m out the cost, the time, and the product, all because someone abused the return system and Amazon just automatically sided with her. No evidence, no verification, nothing.\n\nI reported everything to Amazon and posted about it on the forums because this is getting ridiculous. I followed every rule. The listing was accurate. The photos were clear. And yet somehow, a customer can just say “defective” and walk away with both the product and a full refund.\n\nI’m honestly just fed up. This kind of thing might be nothing to a big company, but for a small artist, it hurts.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 124,
    "downs": 0,
    "created_utc": 1762573906.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.657347440844302
  },
  {
    "score": 94,
    "title": "Does anyone else think the Amazon selling side is trash?",
    "selftext": "The more I use the platform the more annoyed I get. The seller side is drastically different than the buying side. The customer service is awful. It’s impossible to talk to a human. If you email or chat with them they have zero critical thinking skills and just regurgitate an article without reading anything you said or looking into the situation. It’s infuriating. When I talk to someone on the phone they never have the ability to help. It’s always we don’t have access to do that or it’s out of our hands. The user experience sucks. The user interface sucks. Everything is made more difficult than it should be. \n\nOn top of all this stuff, I don’t know what the selling subscription even goes to because the entire experience is awful ",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1713229735.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.570725277106247
  },
  {
    "score": 85,
    "title": "What is going on with Amazon?",
    "selftext": "I bought 36 units of an eye care product.  Sent it off to Amazon and they sold in less than a week.  Quick and easy. \n\nSo I make a deal with my supplier.  Bought 320 units, around 8000 dollars. Send it off to Amazon...\n\nBut i can't make a single sale now.  The item sells 500 plus units a month.  I lowered my price and  have the buy box. But even after a week I can't get a sale.\n\nI am not sure what to do. But recently i had had some items that not selling well after i restock them ..  but never this bad ",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1758996446.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.543574076435389
  },
  {
    "score": 64,
    "title": "Amazon will be removing all of my listings in a month so they can sell it themselves",
    "selftext": "As the title says…\n\nI have been selling many varieties of one product (but not my own brand) for 2.5 years now, and 1 year through FBA.  I got an email a few days ago that starting in mid-May, they will be removing all of my listings as they have decided to “source directly from the brand owner”.  Is there anything I can do about this or am I SOL? \n\nOf course I had just started scaling up my business and now I have to liquidate everything.  I’m so annoyed.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1742331806.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.336033975330649
  },
  {
    "score": 65,
    "title": "Trademark Infringement 300K a month acc suspended ",
    "selftext": "I received an erroneous trademark infringement ip violation and Amazon removed 22 of my ASINs that do 300K a month. \n\nMight go bankrupt, kinda tweaking. Dealing with seller support is the worse experience ever. \n\nThe funniest thing is the complaint i received would never survive in court. It’s literally a competitor just trying to tortiously interfere with my business. \n\nGentle reminder, not sure who needs to hear it, but just realize that Amazon can take everything and anything you have with the snap of their fingers. \n\nEven if you’re trademarked or brand registered…. Try and cultivate other sales channels for yourself. 98% of my sales are on Amazon and not I’m basically just shit out of luck until I can bulldoze through seller support and get my issue remedied. \n\nUpdate: hired amazon SAS support and got it reinstated… took about 2 weeks",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1718572906.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.54920462243319
  },
  {
    "score": 64,
    "title": "It's Criminal Allowing these Scammers",
    "selftext": "I have been selling my product on amazon for a little over a month. This was a product I designed myself in CAD, manufactured, shipped myself, the whole deal.\n\nIt got a lot of popularity really fast and I was sold out in a few weeks. While I am working to restock, no less than 20 Chinese copycats have stolen my images and are listing my product for sale. I know with 100% certainty that they do not have my product, or even a cheap knockoff. I performed test purchases.\n\nThese scammers send fake tracking numbers, claim the product got lost, and will delay until amazon pays them for the fake product sales. Then inevitably customers will complain, it will take 2 more weeks for amazon to process your evidence, they will be shut down, then rinse and repeat.\n\nClaiming they stole my pictures is effective for all of 5 minutes until they repost cropped versions and start the process over. \n\nIt is absolutely criminal that honest sellers on Amazon are being driven out by scammers OF THEIR OWN PRODUCT. It makes me sick seeing my years of hard work and effort profiting scammers. Something needs to be done.\n\n/rant. Thanks for listening. ",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1742228215.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.213777274651652
  },
  {
    "score": 63,
    "title": "Return fraud is getting worse by the day",
    "selftext": "I am a long time FBM seller, I sell electronics of all different varieties, I understand this is a high fraud category, but it's starting to get **out of hand**.\n\nMy return rate is about 10% (extremely high) of those returns over half of them are fraud of some kind. Either buyers send back broken items with different serial numbers, remove parts/accesories from the original shipment before returning, lie about the item being defective, or simply try to get a refund without returning.\n\n  \nMy margins make this worth it for me, or that's how I used to feel at least. However I am seeing a further uptick in fraud over the past 8 months. I charge restocking fees when fraudsters return things and will continue to do so, my seller feedback rating is still 97%! \n\nAnyone else noticing fraud trending upward?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1738251276.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.534565841117009
  },
  {
    "score": 50,
    "title": "Life after Amazon",
    "selftext": "I can feel the end coming. Margins are getting smaller, debt is going up trying to remain afloat and my vision towards people is turning toxic. It's time to move on.\n\nBut I've been at this over 15 years, and the last 5 years this has been my only job so now what? I've been doing RA as a solo act for everything and at the height of it all I was averaging between $250k to $300k a year, out of my garage with after tax being around $130k take home. \n\nI have a history in IT doing system administration type work with a lot of break/fix and new hardware installations but no certifications to prove anything and I've been fully out of it for the last 5 years and mostly out for the 5 prior to that. In the IT world I feel like I'm basically starting over. I was an inventory manager for a large grocery company for five years, but that experience feels outdated too. Besides all of that, I feel so defeated that I have no desire really for anything.\n\nAnyway, I'm rambling. My question for ya'll is what kind of skills does RA on Amazon translate to on a resume? How can I market what I've done the last 15 years into a skill that I can move forward with to try and dig myself out of this hole?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1708533911.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.37370579261772
  },
  {
    "score": 48,
    "title": "Order auto-cancelled by Amazon after direct truck delivery - $41,998.80 balance unpaid despite confirmed receipt",
    "selftext": "Hey everyone,\nI’m hoping someone here has dealt with something similar or can point me in the right direction.\n\nWe recently fulfilled a large order that shipped via direct truck delivery - no parcel carrier, no standard tracking number. \nUnfortunately, Amazon auto-cancelled the order because a tracking number wasn’t uploaded, even though the shipment was delivered, received and signed for (we have the Bill of Lading and all documentation).\n\nThe kicker is, it all shipped to a new Amazon AWS warehouse for use. \n\nHere’s the situation in short:\n\n\t-The shipment was delayed while confirming the correct delivery address and phone number.\n\n\t-Once verified, our warehouse shipped the units directly via truck.\n\n\t-Since it was a direct freight shipment, no tracking number was generated or uploaded.\n\n\t-Amazon’s system automatically cancelled the order for “missing tracking.”\n\n\t-The delivery was completed and confirmed by the receiver (we have a signed BOL).\n\n\t-The order cancellation left an unpaid balance of $41,998.80 for goods already delivered.\n\nWe’ve reached out to contacts at Amazon and SellerCentral support to try to escalate, but so far, there’s no clear path for payment resolution since the order is marked “cancelled.”\n\nHas anyone here experienced a similar situation where Amazon auto-cancelled a freight order post-delivery?\n\n\t-How did you get Amazon to recognize the shipment and release payment?\n\n\t-Is there a specific internal team or escalation route (Payments / Vendor Operations / Freight) that can handle this?\n\nWe’re a small business, and this kind of issue - almost $42K in delivered goods - is a huge hit for us. \n\nAny insight, escalation contact or next-step advice would be hugely appreciated.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1761094001.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.012256071356476
  },
  {
    "score": 44,
    "title": "Amazon Seller Loses Again",
    "selftext": "I had a customer return an item.  Amazon auto-authorized the return.  The original sale was a seller fulfilled item.  The customer returned a different, less expensive item.  The item they originally purchased was $49.95.  The item they returned was a used item that originally cost $26.50.  I tried to file a safe-T claim but it was denied because it was a seller fulfilled item.  So, it appears I have no way to recover my loses by this theft.  Amazon has set up a process for theft by customers where the sellers lose again.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1715688188.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1998371589742938
  },
  {
    "score": 39,
    "title": "My FBA business is on the brink of possibly failing.",
    "selftext": "Got into FBA this year and I had such high hopes that this would help me generate some extra income on the side. \n\nI am completely devestated as I am beginning to realize that it is far more competitive than I thought. I do know that there was a time when the Chinese manufacturers weren’t on Amazon. Those must have been the good days where FBA fees were also much lower. \n\nI can’t help but feel bad I didn’t get involved with this business model in 2017. Does anyone else feel this way?\n\nI don’t know if I should keep pushing or let it go. It’s been 2 months since I’ve been selling and all the money I make from my sales goes straight to Amazon Ad spend and I am always left with a negative balance every two weeks. \n\n1st “payment”  - $1000 that’s right I paid them 1000.\n2nd “payment”. -$500, again I paid 500\n3rd “payment”  -$100. Losing money again. \n\n\nIs anyone else about to give up on this business model? I just feel like there is no hope for new sellers to thrive in this space anymore, not because it is saturated but because of the competition with the suppliers themselves.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1698984245.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2793013274030467
  },
  {
    "score": 35,
    "title": "Is Amazon FBA really not worth it anymore in 2025? Or are these Reddit posts just overly negative?",
    "selftext": "Hey everyone\n\nI’m about to start Amazon FBA in a few weeks once I get back from a trip, and I’ve been doing a ton of research and prep in the meantime. I’ve already set up an LLC, opened a business bank account, and got through Amazon’s insane verification process. I’ve got some capital I’m ready to invest and I’m trying to take this seriously from day one.\n\nThat said, the more I read through Reddit, the more discouraged I feel. A huge portion of the posts here are people saying FBA is “dead” in 2025, that the fees are way too high, Amazon support is useless (which I’ve already seen firsthand), they lose your products, your margins get eaten, and there’s just too much competition now to make it worth it.\n\nI guess I’m wondering: how much of this is real, and how much is just coming from people who burned out, didn’t adapt, had unrealistic expectations, or maybe just gave up?\n\nI’m not expecting to get rich quick. I’ve watched a ton of tutorials, and I plan on starting with retail arbitrage, then scaling into online arbitrage, and eventually using prep centers with bulk buying. I’ll also be using tools like Keepa and SellerAmp from the start, and I’m about to invest in materials like a printer, labels, boxes, tape, and bubble wrap — so I can hit the ground running as soon as I’m home.\n\nI’ve come this far already, but I’d be lying if I said all this doom and gloom isn’t getting in my head. Is this business model actually still viable for someone serious, or has the window really closed?\n\nAny honest feedback or advice would be appreciated. Thanks.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1745092532.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.163442143798228
  },
  {
    "score": 35,
    "title": "Amazon Lost Inventory Reimbursement Fees- Warning\n",
    "selftext": "Hi Everyone,\n\nI wanted to make this post as a warning to new sellers as well as those selling the past few years. I know there has been talk about return fees but I don't believe many realize how bad they truly have gotten. For a small business, these fees run the risk of putting someone completely out of business.\n\nAs a bit of background, my company has been selling on Amazon for 7 years. We own a brand and were recruited directly by Amazon.\n\nIn the first 3 years of selling: Amazon lost 0% of our inventory\n\nYear 4 of selling: Amazon lost 1.5% of our inventory\n\nYear 5 of selling: Amazon lost 2.8% of our inventory\n\nYear 6 going into year 7 of selling: Amazon lost 8.2% of our inventory.\n\nFor the most part prior to this year, they refunded on cost more or less. When going into the sixth year we did notice it took months to sometimes get the money back though. This caused us to have to hire another employee just to follow-up on Amazon cases.\n\nRecently(last six weeks) they lost another shipment.\n\nThis particular lost item retails for $120. The cost to bring this item into the USA is $68, as shown by my invoice provided to amazon. On top of this, we pay clsoe to an additional $20 in shipping and customs clearance, also shown by Department of homeland seurity invocies and paperwork.\n\nGuess how much amazon reimbursed us for the items lost? $21/pc. Be vigilant everyone.\n\n",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1736195638.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.055836522942425
  },
  {
    "score": 33,
    "title": "Amazon reopened my seller account without telling me and sold an item that no longer exists. What do?",
    "selftext": "Amazon closed my account like 4 or 5 years ago after I deactivated all the listing's and quit selling. After they shut it down, I have not been able to log into the seller marketplace site. If I tried, it'd tell me I need to create and entirely new account with a different email.\n\nWell today I just got an email that an item that I had listed previously has sold and I need to ship it. It also let's me back into the site but won't do anything until I update my credit card number as that has expired. \n\nHow did this happen? Can I cancel this order without updating the credit card? How can re-close my account? \n\nOr should I just say fuck it and ignore everything? ",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1748296975.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9825579327133647
  },
  {
    "score": 31,
    "title": "FBA lost shipment reimbursement changes in March 2025",
    "selftext": "As if it couldn’t get any worse, Amazon already loses a percentage of inbound shipments, takes forever to reimburse us, and sometimes denies reimbursement altogether. Now, starting in May, instead of reimbursing sellers the amount they would have got had the lost items been sold on Amazon, they are only going to reimburse us for the wholesale cost. So, the money you spend getting the items shipped to your warehouse, or Amazon‘s warehouse, labeled, packaged, etc. will all be at your expense every time Amazon loses a shipment. This is borderline ridiculous, but so is the low inventory fee. When will they stop?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1734566104.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9135138963287024
  },
  {
    "score": 30,
    "title": "How do you manage your mental health when communicating with Seller Support?",
    "selftext": "Lots of thing happened in my life, as with most of us. But nothing can be compared to Seller Support.\n\nI am now stuck at trying to prove, that my bathroom tile, is not the same as \"cabinet\". and they need to change product\\_type so I can manage my variations. Only parent has \"cabinet\" as product type, while variation childs has the correct product types.\n\nEven made an image where I compare cabinet with bathroom tiles so they see the difference.\n\nSo I am so frustrated, that I cant even pull myself to gether to reply to them At typing 2nd sentece my hands are already shaking from anger and I cant even get to finish the message... I dont even want to know what my office collegues are thinking about me...",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1716823515.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.000618663773216
  },
  {
    "score": 28,
    "title": "Seller support is a joke",
    "selftext": "I have brand catalog authorization for my own brand and GTIN exemption (which I had to do twice for no reason). I still am getting \"You may not create new ASINs for the brand XXX. If you believe the product you want to sell is not currently in the Amazon catalog and should be added as a new ASIN, please copy and paste the following URL in a separate window and complete the form:\"\n\nI go to support, they transfer me around and ask me for the same screenshot 4 times before saying \"We didn't find any resolution for this\"\n\nI asked for an explanation on why I was denied seller approval on another brand. We *already* have approval on the same brand but spelled without an apostrophe. They just send the same message back over and over again the provides zero answer.\n\nI don't understand how anyone sells on Amazon. They make every step as hard as possible, randomly undo approvals and provide ZERO support. I hate these people and this company with every fiber of my being. ",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1744384792.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8557619159077525
  },
  {
    "score": 28,
    "title": "I’ve been selling on FBA for 10 years, this is the first time Amazon actually stole from me",
    "selftext": "I send in hundreds of shipments per year, most get to FBA with no issues (some small adjustments, but I let those go). Today, I feel cheated. I sent in 45 items and they arrived, got checked in and sat for almost 2 months. The shipment was then closed showing zero items received. Usually this is no big deal, I submit a request for investigation, they ask for invoices, I send them, they reimburse me. \n\n10 days after starting their investigation they finally asked for invoices, which I sent in (I am the authorized distributor for this food product). A few days later, I received notification asking me for invoices for my last 40 shipments. This seemed really weird but I submitted the maximum number of invoices (6 total, direct manufacture invoices as always). Within 2 hours the investigation was closed saying my invoices did not meet one or more of the requirements, no other explanation. I attempted to request an appeal and the same associate responded saying the case was closed and there is no recourse. Amazon just stole my products and there is nothing I can do.\n\nHas anyone else had this happen? Any way to appeal or at least get an honest human to research?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1732328397.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.964789796207361
  },
  {
    "score": 27,
    "title": "Amazon making it harder and harder for sellers to make money with new or increased fees.",
    "selftext": "All these new fees and increased fees making it very hard to be profitable on Amazon. Just this year alone the new FBA inventory placement fee which can add about $50 for every 100 units you ship is just ridiculous. Also the low inventory fee is insane too. Just feels like Amazon is forcing out sellers and making it so hard to make money now.\n\nLink to new FBA inventory placement fees starting march 1st: https://sellercentral.amazon.com/help/hub/reference/GC3Q44PBK8BXQW3Z",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1707880258.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.996384369585313
  },
  {
    "score": 26,
    "title": "Sales have dropped significantly in the last month? Today is horrible.",
    "selftext": "We typically sell between 120 to 160 units per day. Not big ticket items but they are seasonal to a degree. Has anyone seen this last month drop significantly? Like middle of September and we can’t break 100 units. Every single day stays roughly the same and can’t get higher no matter what we try or throw $ at. Seems like something is off on Amazon the last month. Down 28% from last month and 36% from last year.\n\nLike it leveled out and is getting lower… 90, 80… today we have 33 orders at 3:50pm. We usually have that by 9 or 10am. Grateful to have sales but something is off since it’s not a gradual drop. It happened all at once and has remained the same since.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1729810571.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.975148852207955
  },
  {
    "score": 26,
    "title": "Switcharoo Return Fraud - It's Out of Hand ",
    "selftext": "As the title states I am an FBM seller - I sell a lot of new-old stock inventory and recently have seen a large uptick in fraudulent returns, specifically switcharoo returns or in other words, buyers swapping my brand new items out of the original packaging and returning their broken used items in attempt to get a refund. It's disgusting and today I received one I thought I would share here.\n\nThe buyer has a commercial address, I looked it up while filing an IC3 report. They are a business owner in Arizona running a physical therapy clinic, name of the owner matches the name on the order. I am getting pretty tired of these scammers and am considering going after them for fraud damages to teach them a lesson.\n\n I got my first neg seller feedback in years due to another switcharoo returner in retaliation for me giving them their medicine in the form of no refund, denied chargeback, and a denied A to Z about a month ago, at this point I'm not backing down from them ever again.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1730158951.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9874126931268457
  },
  {
    "score": 26,
    "title": "DO WE NOT UNDERSTAND PRICE MATCHING?!",
    "selftext": "Its so frustrating that sellers on amazon can’t understand that amazon divides sales on a product when multiple sellers sell the same product at the same price. Instead there’s constant pressure to be the lowest and a lot of that is fueled by greed and wanting to get ALL the sales when u know there are competing sellers. But we all lose money this way! \nI bought 250 units of steel wool and at the time the price on amazon was 18.99 and had been that way for a year before. By the time it was ready for FBA (approximately 2 weeks) price had dropped to 7.00. I got it for $6.50. ONLY because other sellers keep trying to be the lowest.\nDo they not see that their attempted monopoly on low prices only lessens their profit on each unit &amp; feeds Amazons profit margin and not theirs??? \nSell all ur units at 65% below market value and see how rich u get … sigh \n\nPRICE MATCH PEOPLE NOT PRICE CUT!",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1699213658.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8439387533189406
  },
  {
    "score": 25,
    "title": "Can you actually make money on Amazon?",
    "selftext": "I know the question is dumb \n\nBut I’ve been selling on Amazon for about 10 months now and I barely make any profit or sometimes only break even \n\nNot making crazy 10k$ a month like YouTubers and other fake gurus claim\n\nNow I know that I should keep my expectations realistic but I just wanna know from fellow experienced sellers\n\nHow much per month do you make and do you have to move a lot of units to get that profit? Or is it better to sell a few high priced items ?\n\nAnd how many items do you focus on etc \n\n\nI’d appreciate any insight",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1689781502.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.033835150615242
  },
  {
    "score": 23,
    "title": "Q4 peak fees — what should I add to CM so I don’t get blindsided?",
    "selftext": "FBA, small standard-size (Toys/Home), ASP \\~$22, CM \\~28%.   \n  \nFor Q4 I’m baking in: per-unit peak fulfillment surcharge, higher Oct–Dec storage (0.11 cu ft/unit, \\~40 DOH), low-inventory-level fee risk, inbound placement, higher returns/removals, PPC CPC bump, and coupons/deals clip fees.\n\nWhat else should I include? Do you raise price/ROI to offset, and is there a simple per-unit “Q4 pad” or template you recommend?\n\nStressed about peak this year, and appreciate any advice",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1759994851.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.4571962438796153
  },
  {
    "score": 24,
    "title": "How do you defeat this type of return?",
    "selftext": "All my sales are merchant fulfillment. Buyers keep returning item claiming inaccurate website description forcing me to pay return shipping when the item sent and returned is an exact match to the listing. I open a safe-t-claim because the buyer used wrong return reason code since they really just changed their mind and they should have paid return shipping. Amazon asks me then to provide proof that the item returned was different than the item sent. This makes no sense. I feel like when a customer lies the only way I can win is by lying too, and saying they returned a different item, but my parents did me right (wrong?) So I can't do that.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1758891024.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8380456295278407
  },
  {
    "score": 24,
    "title": "Another FBA seller copied all my custom products and listings",
    "selftext": "Not really here for advice. Just here to vent.  \n\n\n Just extremely frustrated that I put in all that time for researching keywords, finding a niche and building a brand over 8 years, only to have some random guy on the internet copy my entire catalog and compete with me on price. Dude went as far as competing with me on other ecom platforms I'm on as well using identical keywords in his titles for his products.  \n\n\nHe's using different photos and his descriptions are worded differently, but it's pretty clear he knocked off my entire brand over the last year or so. I've lowered my prices to match because I've noticed the dip in sales. But it looks like going forward it may be a race to the bottom.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1700613527.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9378318069804426
  },
  {
    "score": 23,
    "title": "Heads up: Major tax compliance shift for China-based sellers is happening now (Amazon reporting data to CCP)",
    "selftext": "Not sure if this has been discussed here yet, but I’ve been tracking a huge development this week that impacts the whole Amazon ecosystem.\n\nAs of Oct 31, Amazon is officially required to start reporting detailed seller data (revenue, identity, etc.) for all China-based sellers directly to the Chinese tax authorities. This is based on new regulations from the Chinese government that went into effect this month.\n\nI was reading a breakdown on China Briefing and a few other sources, and it seems this is the end of a long era where many sellers could operate in a tax gray area. The first report covers Q3 2025, and apparently, audit notices are already going out.\n\nSeems like this could have some significant ripple effects on competition, ad costs, and pricing across the platform. It’s not a simple “US vs. China” thing, as many of the big, compliant Chinese brands will be fine, but the smaller, non-compliant sellers who relied on this to keep prices artificially low are likely in for a rough time.\n\nJust wanted to put this on everyone’s radar as it seems like a pretty fundamental market shift.\n\nWhat are your thoughts? Anyone seeing any immediate effects on their ad campaigns or categories?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1761927318.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.873243545224855
  },
  {
    "score": 21,
    "title": "If you had to start over without Amazon in 2025… how would you do it?",
    "selftext": "Alright, I need some honest advice from people who’ve been through it.\n\nAmazon shut my account down a while ago — some Section 3 violation stuff. I tried appeals, sent invoices, the usual. Still no response. Now I’m just waiting for the 90-day holding period to end so I can (hopefully) get my money. But I’m burnt out, man. Mentally drained. I gave it my all, but Amazon feels like a trap now. One mistake and everything you built is just gone.\n\nSo here’s my question to the people who’ve either quit Amazon or are thinking about skipping it altogether:\n\nIf you had to start over TODAY in 2025 — no Amazon, no safety net — what would you do to still build a successful online business?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1747721371.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7699976699821596
  },
  {
    "score": 21,
    "title": "Chinese seller stole my product",
    "selftext": "I have a unique product that I created.  I have a copyright in process but it has not been granted yet.  A Chinese seller copied my design to a tee and is selling it as their own.  I bought a copy of their item and it’s my product exactly.  I had Amazon pull the listing, but they filed a counter claim to reinstate it.  I have to file a lawsuit in the next 10 biz days or their listing will come back.  I obviously should speak to a lawyer, but wanting to know if others have been down this path?  Are there any lawyers that specialize in Amazon infringement issues?  I know Amazon has some recommended lawyers.  Is it worth it to file a suit or will the seller just pop up again with another account?  Don’t want to be spending tons of money chasing them like Whack-A-Me.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1723349422.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.835662139343334
  },
  {
    "score": 21,
    "title": "How do you guys stay calm with seller support? ",
    "selftext": "After 2 months of my listing being down due to it being marked as a medical device, and spending 3-5 hours each day talking to support, escalating cases, writing POAs, but mostly fighting extremely unintelligent robots, I told this offshore Account Health specialist today: \"you guys are fucking with me\" and \"your procedure is fucked\".\n\nHe didn't like it very much and asked me to remain professional so he can keep helping me by repeating the same sentences unrelated to any of my questions.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1720747348.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7559833081820377
  },
  {
    "score": 21,
    "title": "Tell me about your 1st year as an Amazon Seller",
    "selftext": "What are some of the unique experiences, challenges you overcame, and biggest lessons learned within your 1st year? For me - it has challenged me mentally. I’m private label. Customers are ruthless. When things are good, you never hear about it. But when things are bad, you get nasty feedback. It’s hard to deal with negativity and how ruthless the general public can be. We have a low defect rate and it still hurts sometimes. Looking to relate with other Sellers in my shoes. ",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1710783138.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8841490190652994
  },
  {
    "score": 20,
    "title": "What Happens When You Stop Advertising on Amazon",
    "selftext": "I've got a food product on Amazon that I manufacture and am the only seller of. There are similar products in my category, but nothing quite the same. I've been selling on Amazon for about 5 years, 3 of which I've used an agency to manage content and advertising. The agency costs $12k a year, and the ads were about $35k this year. I'm debating dropping both completely. I know the sales volume will go down, but my bottom line will increase. \n\nHas anybody dropped all advertising, and if so, what effect has it had? How much did sales drop off? Did you become invisible? Did Amazon punish you for not forking over piles of ad money?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1702414669.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7582799220937506
  },
  {
    "score": 21,
    "title": "I am being charged $40 every month and I haven’t made a sale yet. ",
    "selftext": "Hello. I sell on Etsy and I am trying to start my business on Amazon. I have a sole proprietorship and I have given every necessary information to them. I didn’t know they were gonna charge me $40 every month. I cannot obtain the buybox as I understand that it’s not something I have a say in, even though I am the only seller of my products. I requested a refund because and I need advice about what to do now. \n\nThank you for reading. ",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1733332568.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.756001696493316
  },
  {
    "score": 21,
    "title": "There are no words for this support interaction. How can any seller succeed like this?",
    "selftext": "Another seller is abusing Amazon's systems and policies for their benefit and to the detriment of other sellers like myself. I just had this conversation with a seller support rep on the phone:\n\n&amp;#x200B;\n\n&gt;ME: So, what you are telling me is that, hypothetically, a buyer can request a return; that request will be auto-authorized and they will get a return label; they can slap that label on an empty box and send it to the seller; once tracking for that label shows it was delivered to the seller the buyer will automatically get a full refund, and there isn't a single thing the seller can do about any of it until 60 days later when they can file a claim and MAYBE get some help. Do I have that right?  \n&gt;  \n&gt;  \n&gt;  \n&gt;AZ REP: Yes.\n\n&amp;#x200B;\n\nReally? My margins are too small for FBA to be viable, but with support like this how is anyone supposed to survive doing FBS? Luckily the percentage of problem orders is small enough that I can still turn a profit, but this is just beyond frustrating.",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1700197491.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7076471415113432
  },
  {
    "score": 19,
    "title": "Why does Amazon reduce their price daily when I'm not even competing on price?",
    "selftext": "This has got me so frustrated. There's no point competing with Amazon on price. I'm sure we all understand this by now.\n\nI am selling a branded product, it's just me and Amazon. Their price was £20, so I listed for £19.99 (FBA). Daily before they even received my shipment, they have been reducing their price. If they listed it just below mine, I could understand. But they have been reducing their price DAILY and they are now at £16.90. I'm expecting to wake up tomorrow to another reduction.\n\nWhy does this happen? I haven't budged from £19.99 and so far I've had no sales. I fear I'm going to have to now reduce below Amazon, and they are just going to reduce it even further! It's barely worth selling at £20, and they're selling it at almost £15 now. Why does this happen!?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1673569204.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6922413360750843
  },
  {
    "score": 19,
    "title": "Quick question, why is amazon seller support non existent?",
    "selftext": "So Ive been locked out of my FBA account since November because I no longer have access to the phone number used for 2FA. I’ve gone through the recovery steps including uploading my ID SEVERAL times (must have done it 8 times or so) and have had not a single soul reach out to me. I’ve called customer service, submitted countless tickets, and haven’t had a single person ACTUALLY unlock my account. They all say I should hear back from them in 24-48 business hours but here I am in February with a locked account still.\n\nHas anyone gone through this, and if so, can you help me resolve this issue? They’ve been of no use and have even directed me to scammers in india…\n\nHow is this circus of a company still afloat?",
    "subreddit": "AmazonSeller",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1739635479.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6530899869919438
  }
]