[
  {
    "score": 861,
    "title": "174% tariff applied on a $47,000 shipment",
    "selftext": "So, I went to Hong Kong a few weeks ago to check on my production and see how things are going with import/export. My freight forwarder confirmed the same info many of you already know, there’s no “magical solution” at the moment. The only thing we can do is wait and see what happens next.\n\nI want to share a PDF invoice for one container shipped from HK to the US. The invoiced price was $47,000 USD. On that amount, the confirmed 174% Trump Tariffs were applied, you can see how that looks on paper.\n\nRight now, I have around 4–5 months worth of stock sitting in warehouses, so I just topped it up slightly with this shipment. I don’t plan to ship anything else for the next few months until the situation clears up a bit, since the impact of these taxes is massive. All the prepared goods will stay in my HK warehouse until we get some clarity on where things are heading.\n\nSo for anyone sending me DMs, please don’t. I know just as much as you do. Everything is on hold with the Chinese freight forwarders as well, and most of them are convinced this won’t last long (at least not this ridiculous 174% tariff). There are some workaround routes via Vietnam that people have started using, but they’re very costly and, to be honest, not 100% legit. So if you’re a brand or company owner (not a small individual Amazon seller), I’d avoid that route.\n\nThat’s it for now, guys, now we just wait :(",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 861,
    "downs": 0,
    "created_utc": 1746280043.0,
    "media": null,
    "is_video": false,
    "num_comments": 408,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Explains tariffs impact and potential workarounds with reasoning.",
    "composite_score": 4.968868919828384
  },
  {
    "score": 529,
    "title": "Road to 1M a month Update. Tapped 500K this month",
    "selftext": "For those who have been following…. Been some great growth lately. Ran into some inventory issues in early March…. Pretty sure i can do 600K easily in April. \n\nAdditionally have 3 new products simultaneously launching next week. Hoping by May/June to be doing at least 850k/mo. \n\n1M/mo by the end of the year. \n\nIf ya’ll have any questions feel free to drop them. \n\nFBA seller, I create my own products and private label, please don’t ask easily googleable questions lol.\n\nNo i don’t offer coaching. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 529,
    "downs": 0,
    "created_utc": 1743270605.0,
    "media": null,
    "is_video": false,
    "num_comments": 284,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Update with growth numbers and plans, offering insights rather than a step-by-step.",
    "composite_score": 4.679198299605044
  },
  {
    "score": 386,
    "title": "I’ve seen too many idiots sign warehouse leases too early…This is what you should do instead. Free game, nothing to sell you.",
    "selftext": "This isn’t advice from YouTube or some guru trying to sell you a course.\nThis is literally what I did to go from my bedroom to a warehouse.\nNothing to sell. Just what actually worked for me to scale from $0 to $20,000 monthly net profit.\n\nThe reason I’m sharing this is because I’ve seen way too many people rush into signing long-term warehouse leases — spaces that are either way too big or way too small.\nI’m trying to save you the trouble before you make the same mistake.\n\nIf you’re starting Amazon or other e-commerce, start at home.\nBedroom first. Then move into your living room. Then your kitchen.\nSqueeze every inch of your space. Don’t spend money on a warehouse when you don’t even know how much space you actually need yet.\n\nOnce you’re making around 2–3k net profit for at least 3 months, that’s when you can start thinking about moving out.\n\nWhen your whole house turns into chaos and you’re tripping over boxes just to get to your bed — that’s the sign.\n\nHere’s what I did next:\n\nI didn’t get a warehouse.\nI rented a storage unit.\nCubeSmart, Extra Space, whatever’s near you. You can get a 10x20 for around $400–$500/month.\n\nNo Wi-Fi? Use your hotspot.\nNo outlets? Buy a portable power station (around $500-800on Amazon).\nThat’ll power your printer, desktop, fan, and a few lights.\n\nI worked like that for months until I was making 4–5k net.\nReinvested every single dollar back into inventory.\nAmazon is a cash-hungry business. The more you put back in, the faster you grow.\n\nEven then, I didn’t think I “had a business” yet. I was just surviving.\n\nWhen I started doing 10k net for a few months, I moved into a short-term warehouse.\nI used ReadySpaces — month-to-month leases, forklifts, Wi-Fi, hand trucks, etc included.\nMy first space was 250 sq ft for about $680/month all in.\n\nOnce I passed 20k monthly net, I thought about signing a 2–3 year lease.\nGlad I didn’t.\nYou think you’re ready, but e-commerce changes fast.\nYou don’t want to be stuck in a lease that doesn’t fit your next stage — whether you need more room or less.\n\nShort-term leases are the move.\nYou can upsize or downsize anytime without penalty.\nThat flexibility saved me more than once.\n\nEven now, I still prefer flexible spaces.\nNo long contracts is the way. At least for the first two years.. \n\nHopefully, this post saves someone else from learning the hard way. \n\nCheers MF. Enjoy Q4. \n\nP.S. - this image was 18 months ago at a storage unit.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 386,
    "downs": 0,
    "created_utc": 1760354598.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Explicit step-by-step plan to avoid early warehouse leases and scale.",
    "composite_score": 4.232482932789846
  },
  {
    "score": 229,
    "title": "Update Road to 10M",
    "selftext": "Up quite a bit from last month. \n\nLaunched a new product this month already up to 100-125 units a day on it. \n\nOne more launching this week, another May 15.\n\nPretty confident I can push this to 1M a month by June/July. \n\nHappy to answer questions. Please note if you ask questions that have already been asked on prior posts, i will not answer them. \n\nIf anyone is doing similar numbers and wants to connect, please reach out.\n\nAnd as always, no I do not offer coaching lol. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 229,
    "downs": 0,
    "created_utc": 1746023880.0,
    "media": null,
    "is_video": false,
    "num_comments": 164,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Progress update with launches and goals, primarily informational.",
    "composite_score": 4.182969808124547
  },
  {
    "score": 229,
    "title": "My 24 months sales chart / Amazon US - Just over $50mil!",
    "selftext": "In 2019 I started this business from my bedroom with no money, no connections in the industry, and no clue really.  Next month I am about to cross into the 9-figure seller territory with $100 million in sales (Amazon US) \n\nI have transitioned away from most arbitrage and seasonal products, (obviously) and am now focusing on wholesale.  95% brand direct, rarely we will work with a distributor.  We average around $100k per day in sales.  and $240k was my highest sales day.  I have been in business 6 years now and I did it alone for the first 3 years. I then started hiring staff and got a 10,000 sq ft warehouse.   Today I have 10 full time employees and 5 part timers as well.   (4 front office &amp; 6 warehouse) We are running a net 12% margin.  \n  \nFeel free to ask me any questions about my amazon journey.  ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 229,
    "downs": 0,
    "created_utc": 1765511230.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Personal milestone narrative with sales data and experience.",
    "composite_score": 4.088146448370179
  },
  {
    "score": 205,
    "title": "Launched from scratch, $847K in 8 months ,and we didn’t burn money on hype | Sports &amp; Outdoors | 2 ASINs | $150K/month | 26% Net Margins , breakdown inside.",
    "selftext": "Launched a Private Label brand in Sports &amp; Outdoors , 2 ASINs only.\nTimeline: Nov 2024 to Jul 2025\nMarketplace: Amazon USA\nRevenue so far: $847K\nNet Margins: 26%\n(No, not dropshipping. And yes, margins are real.)\n\nHow we pulled it off , in plain words:\n\nProduct Research &amp; Selection:\nFound a niche that doesn’t spike and crash every 3 months\n\nPicked products where search volume made sense and reviews weren’t insane\n\nActually improved the product (yeah, that still works in 2025)\n\nOur sourcing guy in China made sure supplier wasn’t a part-time magician\n\nLaunch Execution:\nDidn’t over-order , started lean to see if people even cared\n\nMade sure listings didn’t look like a PowerPoint from 2012\n\nGot early reviews via Vine and some micro-influencer hustle\n\nDidn’t touch giveaways ,focused on real momentum\n\nPPC Strategy:\nStarted super narrow , exact match, single keyword stuff\n\nUsed top-of-search only for stuff that was already converting\n\nASIN targeting &gt; category targeting , more efficient\n\nWeekly PPC cleanups… not sexy, but they save $$$\n\nScaling &amp; Profit Growth:\nReinvested smart, not fast , we only scaled what worked\n\nBundled the product in a way that buyers actually wanted\n\nKilled off keywords that were just wasting budget\n\nMargins held steady because we kept an eye on size tiers and packaging\n\n\nYou really don’t need 10 products and a $50K burn rate.\n\nYou need 1–2 solid products, actual systems, and the patience to not panic in week 3.\n\nAsk away , not selling a course. Just figured this might help someone avoid the usual landmines.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 205,
    "downs": 0,
    "created_utc": 1753472337.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.84,
    "category_rationale": "Structured breakdown of actions to launch and scale a Private Label brand.",
    "composite_score": 4.030761134041931
  },
  {
    "score": 198,
    "title": "How I went from 0 to $100k a month in 10 months (UK to Global)",
    "selftext": "Hey everyone,\n\nI thought I’d share my experience in case it helps others who are starting out.\n\nI run a white label store in the travel / apparel niche industry. When I launched less than a year ago, I knew nothing about Amazon beyond being a Prime customer. Now I’ve just hit $100k+ in monthly sales. I started out in the UK and expanded globally.\n\nA few things that worked for me:\n\n1. Pick a niche you understand. I created and tweaked existing products that I wished already existed. That made keyword research and product design much easier.\n\n2. Don’t cheap out on branding, packaging etc. I invested in packaging and clear positioning from day one. It made reviews and conversion rates much stronger.\n\n3. Ads = growth lever. I tested dayparting, exact match bidding, and validated conversion rates before scaling. At first I wasted money, but once I tightened it up ACoS dropped massively. AI is your friend here. Lots of free or really cheap options to tidy up your ads\n\n4. Know your numbers. Sales tax, VAT, import duties, and landed costs make or break margin. I learned this the hard way early on. Make sure you understand trade terms, DDP, DAP. Price compare and haggle haggle haggle!\n\n5. Customer feedback &gt; guesswork. Our best product idea came from someone emailing us on Amazon asking for a variation.\n\n6. Global expansion is so easy on Amazon. Make the most of it.\n\nI’m not saying this is “easy”… I’ve had plenty of sleepless nights with stockouts, accounting headaches, and ad spend black holes. But it is possible to scale quickly if you treat it like a real business, not a side hustle lottery ticket.\n\nIf anyone’s at the early stages and wants me to expand on something specific (ads, sourcing, listings, etc.), happy to share what worked for me!",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 198,
    "downs": 0,
    "created_utc": 1755898041.0,
    "media": null,
    "is_video": false,
    "num_comments": 111,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.79,
    "category_rationale": "Enumerated actionable tips and steps to go from 0 to $100k/mo.",
    "composite_score": 4.058462087744798
  },
  {
    "score": 189,
    "title": "4 lessons from my journey to escape the 9–5",
    "selftext": "A friend of mine invited me into this community, and I’ve really enjoyed reading both the wins and the struggles that everyone shares here. It reminded me of my own journey, and I’d like to share my story in the hope that it might inspire and support some of you on your path as well.\n\nA little bit about myself: I failed at multiple businesses, and even my first FBA attempt completely flopped. I made countless mistakes. But I’m grateful I didn’t give up because those failures became the foundation that eventually allowed me to build the life I want.\n\nHere are the 4 biggest lessons that helped me turn things around. This isn’t meant as a brag; I just want to share what I wish I knew earlier, in case it helps someone out there.\n\n**1. Don’t chase “new inventions.”** Early on, I thought I had to find the next big idea. But instead, I learned to use Helium 10 to spot boring SKUs with steady demand, usually sold by competitors who don’t optimize their listings (bad images, weak copy, fewer than 50 reviews). Those became my easiest wins. I also stick to products where the landed cost (product + shipping) is around $8–12, and I sell them for $35–45. In that range, I’ve consistently cleared 25–30% net margins even after PPC. Lower-ticket products rarely justify ad spend at scale.\n\n**2. Build strong supplier relationships.** I started sourcing on Alibaba like most beginners. But I quickly learned that the prices there aren’t always the best. Many “suppliers” are actually middlemen, and they can easily spot a newbie. They’ll often charge higher compared to going directly through someone with real relationships. After learning from a couple of mentors, I switched to working with a sourcing agent they recommended. That was a game changer. A good agent speaks the language, knows the culture, and has the relationships to negotiate better pricing and faster lead times. Sometimes the difference is night and day.\n\n**3. Treat your listing like your best salesman.** One of my early mistakes was underinvesting in my listings. At first, I hired cheap Fiverr gigs and even tried to take photos of myself on my phone. The result? People would click my ads, but bounce immediately. It’s kind of like dating, you can have the best personality, but if you don’t look presentable, you don’t even get a chance to connect. Your listing is exactly the same: it’s the only “salesperson” working for you online. Don’t cut corners here, invest in good copywriting, images, and videos. That’s where your ROI really starts.\n\n**4. Launch small and scale smart.** Another mistake I made was going too deep too fast. I once ordered 500–1,000 units upfront, only to find out the market didn’t want what I was selling. Liquidating that much stock almost killed my cash flow. Now, I start with 100–200 units, ease into PPC, and focus on getting 20–30 reviews before scaling. Yes, the unit cost might be slightly higher, but it’s a calculated risk. It keeps me flexible, protects my capital, and avoids the “all eggs in one basket” problem.\n\nAt the end of the day, these lessons helped me build and even sell one of my brands. I’m not saying I’m the best, I’ve made more mistakes than I can count. But these are a few that shaped me. I hope they help you avoid some of the same pitfalls. And if you’ve got your own lessons learned, drop them in the comments. I'd love to hear them, let’s share, fail, and grow together.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 189,
    "downs": 0,
    "created_utc": 1758340515.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.77,
    "category_rationale": "Contains a numbered list of four actionable lessons.",
    "composite_score": 3.8635255687237633
  },
  {
    "score": 135,
    "title": "$80k to $1.3mil in 12 Months ! B2B going crazy",
    "selftext": "A brand in the baby products niche just crossed 1.34M in year to date sales with a YOY growth rate of 75155 percent yes they started amping it this year. They operate in the United States and currently have eight SKUs with a net EBITDA of about 22 percent.\n\nWhen they first came to me, their growth had stalled even though they had traffic, a healthy ad budget, and a product customers clearly wanted. They originally tried me out for a month because I don’t charge for the first month of PPC management. They liked what they saw, and the real work began.\n\nThe first step was fixing the foundation. Before spending a single extra dollar on ads, I audited the entire listing structure. The issues were obvious. Inconsistent content. No clear articulation of the product’s unique strengths. No system for building reviews. Keyword placement that didn’t align with the way customers searched. Many sellers assume PPC is the cause of low conversion, but more than half of conversion issues come from the listing itself.\n\nOnce the listing was fully retail-ready, I rebuilt the entire advertising structure from scratch. Every campaign was assigned a clean purpose. Discovery for new search terms. Exact match for scaling profitable winners. Mid-funnel campaigns for retention. Auto campaigns cleaned and refined weekly. Strong negative keyword filtering to maintain efficiency.\n\nAlongside that, we ran continuous A/B tests. Not just the obvious ones like main image variations but also title formats, image sequencing, pricing tests, placement adjustments, bid rule refinements, and even the timing of budget distribution. None of these changes alone created a massive spike, but together they compounded month after month.\n\nThis brand didn’t have a demand problem. They had a scalability problem. Once the foundation was right and the advertising was structured with intention, the growth curve changed completely.\n\nEverything mentioned here is learnable and repeatable. A structured audit. Clear USP definition. Review system. Keyword alignment. Purpose-driven campaigns. Weekly refinement and testing. That is what moved the needle, not random bid increases or higher budgets.\n\nIf you fix the fundamentals first and build a system instead of reacting to problems, the results usually follow.\n\nA big amount of our sales have been coming from b2b campaigns, try them out, they’re really really useful (and ynderrated ) see you guys in FAT FIRE",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 135,
    "downs": 0,
    "created_utc": 1765060838.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.78,
    "category_rationale": "Describes auditing listings and rebuilding ads as a repeatable process.",
    "composite_score": 3.545008912706236
  },
  {
    "score": 132,
    "title": "Road to 1M a Month Update",
    "selftext": "Took a few months and some time to get from 800k to over 900k. After prime day my sales went down for a few weeks which is to be expected. Things have rebounded nicely. Cautiously optimistic that over the next week I hit 1M a month over last 30 days. \n\nNext steps / goals become how do I go from 1M to 2M which i believe will require different analysis/strategies/and likely pushing Ads to Meta/Tik Tok/ Google. \n\nCapital is become a real constraint for the first time. I’m having to withdraw payments form Amazon daily just to keep up with PPC and Inventory. \n\nHad multiple banks deny me lines of credit lol. Shit sucks. But it is a bad problem to have. \n\nAs always, happy to answer questions. If a question has been asked on a prior thread, I will not reanswer it. \n\nCheers and good luck to those who have taken an interest to this journey. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 132,
    "downs": 0,
    "created_utc": 1755176115.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Progress update with goals; discusses strategies but not a how-to.",
    "composite_score": 3.8385123278584072
  },
  {
    "score": 120,
    "title": "Fourth month completed - road to 100k/month - Ask me anything",
    "selftext": "The journey has been unreal and now my biggest source of income per month! In just four short months. \n\nI got lots of help from folks here and would be very happy to answer any questions for anyone starting out. \n\nAdding screenshots of ad spend and summary and Sellerboard showing net profit. \n\n\nSales were up over 100% this month, profits grew slightly slower due to new competition forcing me to reduce prices. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1762015103.0,
    "media": null,
    "is_video": false,
    "num_comments": 160,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Shares a personal success update with metrics and an AMA invitation rather than a structured how-to.",
    "composite_score": 3.9286983083323745
  },
  {
    "score": 109,
    "title": "$10M in Amazon sales — still feels surreal",
    "selftext": "\nOver the past year, my Amazon account crossed $10,000,000 in sales.\nWhen I first started, I had no idea it could get to this level — it’s been a mix of wins, mistakes, sleepless nights, and a lot of learning along the way.\n\nI’m still figuring things out and improving every day, but thought it might be worth sharing for anyone out there grinding away and wondering if scaling big is possible.\n\nPlenty of scars, plenty of wins — both have stories.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 109,
    "downs": 0,
    "created_utc": 1755110827.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/2ek7zlyk1uif1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/2ek7zlyk1uif1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/2ek7zlyk1uif1/DASHPlaylist.mpd?a=1770354673%2CZjVlZWNjMmJlYzQ3N2Q0ZGNmYWQ4NDQxOTYwY2QyNzVlZTA0NDM3ZjUzNWQ4ODM5NGNkMzYxNzc1Y2RiYzQ2Yw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 22,
        "hls_url": "https://v.redd.it/2ek7zlyk1uif1/HLSPlaylist.m3u8?a=1770354673%2CNjg5NWU2MGYxNjQ1NGE2ZjNmYmExMDU2N2E3YjVhMzM0ZWJjYWIyODFiMzhhZjFkMTgwYWY4M2NiZDMwNDU0Mw%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Narrates a milestone with lessons learned, providing insights rather than a step-by-step guide.",
    "composite_score": 3.765105934128537
  },
  {
    "score": 105,
    "title": "FBA isn’t just “buy from Alibaba, slap a logo, and make money” — this is a national-level war and no one talks about it",
    "selftext": "\nJust wanted to get this off my chest after spending the last month launching my first product on Amazon FBA.\n\nEveryone online made it sound simple:\n“Find a supplier on Alibaba, private label it, send to FBA, run some ads, and boom — you’re making $10K/month.”\nNah. That’s not even close.\n\nWhat they don’t tell you is: you’re not competing with a few random sellers. You’re competing on a national level — against brands with teams, massive budgets, and years of experience.\n\nI’m over here obsessing over one image or one keyword while these guys have A+ content, brand stores, influencer videos, and PPC budgets bigger than my entire inventory investment.\n\nThe FBA gurus don’t prepare you for:\n\t•\tConstant listing bugs and delays\n\t•\tAds eating your budget in a day with zero sales\n\t•\tAmazon randomly going out of stock even when inventory is there\n\t•\tCompeting with people who have actual marketing departments\n\nAnd yet… I still believe it’s worth it.\nBut let’s stop pretending this is passive income.\nThis is a real business — and unless you treat it like one, you’re gonna burn out or get crushed.\n\nI’ve put in the work. Designed everything myself. Learned the backend. Trademarked my brand. I’m in it long-term. But damn — respect to anyone who’s done this from scratch.\n\nJust saying this for the people who are considering starting:\nFBA can work. But it’s not easy. It’s not quick.\nAnd it’s definitely not passive (at least not in the beginning).\n\nAnyway… if anyone’s in the same boat, would love to connect or share tips. We’re all figuring it out.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 105,
    "downs": 0,
    "created_utc": 1748958891.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Offers an explanation and mental model about why FBA isn’t passive, with supporting observations.",
    "composite_score": 3.5990909533137385
  },
  {
    "score": 102,
    "title": "Journey to replace 9-5",
    "selftext": "Compared to the other sellers on this community I am just a ant. I started selling in March 2025 and have struggled to scale the amazon wholesale model however I am as motivated as ever and will keeping working on this 5-9 until it replaces my 9-5. I plan to post updates on my growth on a monthly basis. Plan of attack for this month. \n1. Sign up of no interest credit card and max it out on inventory.\n2. Look for additional wholesale products to sell and put in PO.\n\nSales goal for this month 4k. \nSales goal for next month 7k. \n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 102,
    "downs": 0,
    "created_utc": 1757529603.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Provides an explicit plan with a sequence of actions aimed at achieving a goal.",
    "composite_score": 3.598886153673031
  },
  {
    "score": 97,
    "title": "I’m an 8-figure private label seller. Ask me anything.",
    "selftext": "Hey everyone, I’m a private label seller doing 8 figures on Amazon, and I know how challenging (and rewarding) this journey can be. I’d love to help fellow sellers who are looking to take their business to the next level.\n\nFeel free to ask me anything—whether it’s scaling, branding, listing review, PPC, or anything else. Happy to share what I’ve learned!\n\nLooking forward to the conversation.\n\nPS. Lot of people asking how do I find products to sell. I’ll share my detailed process next week.\n\n(The screenshot is 7 fig. but it’s from just one of our stores. For better organizing our catalog and mitigate risks we have multiple stores.)\n\n[One of our stores](https://preview.redd.it/be7ajlo34cpe1.png?width=1656&amp;format=png&amp;auto=webp&amp;s=be089fa932689dbc499479cf00077fe28d4385f1)\n\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 97,
    "downs": 0,
    "created_utc": 1742199322.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "AMA-style post sharing expertise and inviting questions, without a formal step-by-step process.",
    "composite_score": 3.779884743066583
  },
  {
    "score": 93,
    "title": "Customer is doing Return Abuse Effecting a 3 party seller",
    "selftext": "I just wanted to share something that really bothered me. There’s this guy on Instagram (username: @stocklett) who’s been posting videos of himself buying and returning heavy items like anvils, over and over again. He’s doing it to mess with Amazon, but the problem is, it looks like he’s buying from a third-party seller, not Amazon directly.\n\nThat means a small business is probably getting hit with the return costs. We’re talking shipping, fees, and restocking charges on really heavy items. I don’t have Keepa anymore, so I can’t check the sales data, but I’m 100% sure the seller being affected is named Supdear.\n\nHere are a couple of the videos he posted:\n\nhttps://www.instagram.com/reel/DMfoseKuZX2/\n\nhttps://www.instagram.com/reel/DLF-IT9ukm6/\n\n\nI already reported it to Amazon (reportascam@amazon.com), but I’m hoping others can help report this too. This kind of abuse needs to be shut down, and the seller deserves to be reimbursed. No small business should have to deal with something like this.\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1753557349.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/exb16csaq9ff1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1920,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/exb16csaq9ff1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/exb16csaq9ff1/DASHPlaylist.mpd?a=1770354674%2CYzZmMDQyNzgyZGFkOTBmYjFiZDE2MWZkNmU3YzgyYWYzN2Y4YzdkZDkzNmQ3YmY1NzFmOGYyNTUzM2ViZDQyNw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 57,
        "hls_url": "https://v.redd.it/exb16csaq9ff1/HLSPlaylist.m3u8?a=1770354674%2CZjc0OTdmZWJkYzZlOGU4YjU3MGIzODQwNjYwZTk0OTI2NDUzOWViY2Q5OWI5NDMzYmVlYmQ1ZTQwZmJkNzlkMg%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Informational post about a problem; lacks actionable steps or a reasoning framework.",
    "composite_score": 3.451160157112948
  },
  {
    "score": 89,
    "title": "First full year doing wholesale, on track to do $2MM  — ask me anything.",
    "selftext": "Earlier this year I quit my 9–5, went all-in on Amazon wholesale (not PL). First *full* year in, I’m pacing \\~$2M revenue with \\~13–15% net. \n\n\n\nHappy to answer anything (sourcing, capital, suppliers, tools, cash flow, prep, the ugly parts).\n\n  \nCurrent numbers (YTD pace)\n\n* Run rate: \\~$180–220k/mo revenue (seasonality swings).\n* SKUs: \\~350 active, top 40 drive \\~75% of revenue (concentration is real).\n* PO cadence: Weekly. Average PO $8–25k.\n* Margins: Blended gross \\~22–27% (after buy cost but before Amazon fees); net \\~13–15% after everything (fees, ship, prep, software, payroll).\n* Terms: Mix of prepaid + Net 30/45 with \\~15 suppliers.\n* Team: Me + a part-time bookkeeper + 2 VAs (sourcing/admin) + a prep center.\n\n# Startup capital &amp; cash flow\n\n* Began with a modest cash pile for test buys + conservative use of 0% APR lines.\n* Rolled profits into bigger POs.\n* Most important lesson: **inventory turns &gt; margin percent**. A 16% item that turns 12x/year beats a 28% item that turns 3x.\n\n# Biggest mistakes (learn from mine)\n\n* Chasing margin % instead of turns.\n* Buying too deep\n* No SKU kill rules. Now I sunset anything that misses target velocity for 30–45 days.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1760677153.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "AMA-style post with data and willingness to share knowledge; primarily informative.",
    "composite_score": 3.648991735061109
  },
  {
    "score": 85,
    "title": "$200k sales in 12mon!",
    "selftext": "I posted a similar screenshot when I reached $100k 4 months ago and had a few good discussions. Feel free to ask any questions.\n\nFirst of all, this is my own brand/business and I’m not a freelancer looking to spam your DMs. Brand is a dietary supplement in the US, started selling Apr 2024. 95% of sales is Amazon. ROAS 2.5, tACOS 15%, AOV $30. Of course I did brand registry, Vine and Premium A+ at the beginning. Youtube/Helium 10’s “Freedom Ticket” were my education.\n\nAlso, I didn’t use ChatGPT, so apologize the lack of organization in my thoughts.\n\nFor the first 18 months or so, while I had growth in terms of sales and always had gross profits, I haven’t had any net profits. So what changed in the last few weeks? Here are a few things that worked for me:\n\n1. I updated all my listings. Heavily used Nano Banana Pro, which I like to use in FloraFauna.ai so that I can generate several images at once. The earlier in your funnel, the bigger the impact. So optimize your main image first. Premium A+ last.\n\n2. I merged different children ASINs. My number of reviews jumped from 80 to 200. I felt confident switching because since recently several children ASINs can show up on the same SERP\n\n3. I haven’t really touched my ad account in weeks. I had talked with a few agencies, but I am still not seeing the need to pay $2k/mon if my ROAS is 2.5 and I’m growing faster than I can buy inventory. My ad budget is never exceeded and I don’t make any adjustments over holidays - it just ends up spending less on more quiet days.\n\n4. I onboarded to an accounting software called Finaloop. Not an endorsement, just a happy paying customer (happy to referr as it saves me money!). This tool helped me see the real net profits (after ALL cost), which is a drastically different number than what Amazon-focused tools like Sellerboard will tell you. This motivated me saving even more, and now I’m finally in a position where the company shows consistent net profits and is paying off credit cards and repaying my investment. It also gave me confidence investing even more, now that I have a ‘proof of concept’\n\n5. I changed remarkably little about my SKUs. They are still the same as 10 months ago. I knew I was going to run low on my hero SKU, so I shifted ad spending to another one - so now that one is my new hero SKU. Since this is a replenishable product, I feel a lot of the growth is coming from repeat purchases. I know that the average customer buys a second time. For this reason, I’m confident that my business will continue to grow, as my brand is still a tiny player.\n\n6. Moved out of a nearby storage unit. My goal is to remove the need for me to be physically present and becoming a bottleneck.\n\nOn my roadmap:\n\n1. I start getting more concerned about taxation. Since I’m now crossing $10k/mon in net profits I’m considering switching from single member llc to s corp. I haven’t figured out what tool to use or how to determine a fair salary or when to do this switch.\n\n2. Reordering larger inventory &amp; new SKUs. Found a manufacturer with better payment terms &amp; faster lead times. I am about to invest $200k, which should allow the brand to grow into $1M in 2026. As always, nr 1 rule is to avoid OOS\n\n3. I am still looking at onboarding to a 3PL (not an invitation to spam my DMs!) for storage and DTC fulfillment, but for now I can simply LTL directly from manufacturer to Amazon AWD/FBA\n\n4. I am looking to get into more sales channels. Already onboarded to Walmart (support is a pain!!!), which already provides more sales than my Shopify. My goal is to rely less on Amazon than currently (95% of sales). Maybe &lt;75%?\n\n5. Down the line I’ll be looking for a Line of Credit. I opened bank accounts with all the major banks to establish a 2yr bank history. I had inquired with lenders like 8Fig etc, but their APR is just predatory. I’m lucky I don’t need it.\n\n6. In 2026 I will also want to delegate PPC to a partner. Again, not an invitation to jump into my DMs. Just a reminder for myself when I look back at this post in a year.\n\n7. I keep wanting to fix my social media (organic/paid), Shopify, and emails. I hope that with more time I’ll finally get to that.\n\nAm I “rich” with $40k/mon in sales? Nope. I am able to pay off all 0% APR credit card debt, and my inventory is now worth more than my investment, but any growth in sales means my inventory needs to grow as well. Wifey’s W-2 is still paying the bills, but at least I’m able to make payments towards our investment, and my AMEX points pay the vacation. I have completed online calculators that promise me a great return in case I decided to sell the business - but I don’t want to do that anytime soon. I do expect to be able to draw a 6-figure salary once the business grown to 7-figures and growth has slowed down to not more than 3x/yr. I do feel this is the moment when a dream/hobby is turning into an actual business.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1766946183.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Contains multiple concrete steps to reach a sales milestone, i.e., a how-to sequence.",
    "composite_score": 3.420237909764695
  },
  {
    "score": 82,
    "title": "How to Start Wholesale on Amazon (Without Wasting Time or Money)",
    "selftext": "When I first dipped my toes into wholesale, I had no clue what I was doing. No fancy courses, no expensive coaches — just me, Google, and a whole lot of trial and error.\n\nThis post is for the people who are in the same spot I was in: ready to get into wholesale, but overwhelmed by all the noise. **My goal is to lay out the process in a way that’s practical, honest, and beginner-friendly** — without all the fluff. Think of this as your startup checklist, strategy guide, and reality check all rolled into one.\n\n# Step 1: Choose a Niche You Actually Understand\n\nStart by picking a category you're at least somewhat familiar with. Why? Because in wholesale, y**ou’re not inventing a product — you're reselling existing ones**. And if you don’t know the difference between two similar-looking items (e.g., synthetic vs. conventional motor oil), you could end up selling the wrong thing and having your listing shut down by Amazon after a return or complaint.\n\nStick with what you know, or at least what you're curious enough to learn.\n\n# Step 2: Analyze the Market (the DIY Way)\n\nOpen up Amazon in a browser (Chrome is fine), and start looking at listings in your niche. Don’t just chase best sellers — look for **brands that are doing okay** (middle-of-the-pack BSRs), and sellers that aren't Amazon or massive resellers with 10,000 reviews.\n\nFocus on:\n\n* Smaller 3P sellers\n* FBA sellers with &gt;95% feedback\n* Listings with solid but not insane rankings\n\nMake a list of the brands that pop up more than once. Patterns will emerge. That’s your first batch of potential targets.\n\n# Step 3: Reach Out to Brands Like a Pro (Not a Random Gmailer)\n\nOnce you’ve got a shortlist of brands, go to their official websites. You’re looking for either a wholesale application or a way to contact them directly.\n\nWhen you email, **don't use something like** [**flipflopseller99@gmail.com**](mailto:flipflopseller99@gmail.com). Spend a few bucks and get a real domain name and email — something like `wholesale@yourbrand.com`. You can set this up for under $20 using GoDaddy or Namecheap.\n\nYour email should be short and direct\n\nDon’t get discouraged if only a few reply. Wholesale is a numbers game — and following up is half the battle.\n\n**If you are stuggling finds suppliers you can always buy a lead list. When doing this it's best to use one that has a members limit like:** [**oasource.com**](http://oasource.com)\n\n# Step 4: Expect Pushback — and Be Ready to Pivot\n\nMany brands will say things like:\n\n* “We don’t allow Amazon sellers”\n* “You need a physical storefront”\n* “We only work with established accounts”\n\nThat’s normal. Some sellers go as far as renting space or partnering with a local store just to get in the door. But honestly? If you're just starting out and don’t have a retail location, it's okay to walk away. Move on to the next lead — there are thousands of brands out there.\n\n# Step 5: Score a Distributor List — Then Go to Work\n\nIf a brand shares [**a list of authorized distributors**](https://garlicpressseller.com/amazon-wholesale-distributors-supplier-lists/) (or just one), that's gold. Now your job is to:\n\n1. Research each distributor\n2. Reach out with your reseller cert and professional contact info\n3. Start applying for accounts\n\n**Pro tip**: Keep track of everything in a spreadsheet — who you contacted, what they said, and whether they offer price tiers, MOQ, and shipping to FBA.\n\nAsk questions like:\n\n* “Do you have a minimum order quantity?”\n* “Are Amazon sellers allowed?”\n* “Can you ship directly to an FBA warehouse?”\n\nThis shows you’re serious and saves time down the road.\n\n# Step 6: Product Research (Now the Real Work Begins)\n\nOnce you’re approved, **request their product list** — preferably as a flat file, CSV, or Excel sheet. Many will send you a massive spreadsheet with thousands of SKUs.\n\nNow comes the grind. You’ll need to match UPCs to ASINs (you can use software or tools like , Tactical Arbitrage, etc.). Most products won’t be profitable — that's totally normal.\n\nYou're not looking for thousands of winners — just a few solid ones to start.\n\n# Bonus: Brand Analysis Tactics\n\nHere are a few extra strategies to help you dig deeper:\n\n* **Brand Saturation Check**: Look up the brand on Amazon. If you only see one seller or just Amazon itself — skip it. But if there are a mix of 3P sellers and FBA listings, it’s probably a green light.\n* **UPC Anomalies**: Sometimes your distributor’s photo matches the Amazon listing but the UPC doesn’t. That might mean the listing was created manually — and it could be a niche opportunity other sellers missed.\n* **Focus on Brands, Not Just Products**: Look at which brands appear most often in your distributor’s catalog and prioritize those for analysis.\n\n# What About Ungating?\n\nHere’s the good news: if a brand or distributor sends you a proper invoice (with your business name, item details, and quantities), you can use it to[ **request ungating**](https://garlicpressseller.com/how-i-got-ungated-on-amazon/) in certain Amazon categories or brands. Just make sure you order 10+ units and that the invoice matches Amazon’s format. That one order could open up an entire category for you.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 82,
    "downs": 0,
    "created_utc": 1741699556.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Step-by-step guide outlining niche selection, market analysis, and outreach.",
    "composite_score": 3.447608088040055
  },
  {
    "score": 78,
    "title": "952K in 13 Days with 2.5x Revenue Boost During Prime Days-Snapshot &amp; Learnings",
    "selftext": "Last time I shared a breakdown of one of our campaigns, the post got all sorts of reactions,some strange comments, some genuine appreciation, and quite a few brands reached out privately. The ones who ended up on a call know the specifics of how we planned and executed this. But I’m sharing another example here openly because I think it can inspire and help some of you testing different scaling approaches.\n\nQuick Context:\n\nMarketplace: US\nNiche: Women’s Wellness Supplements\n150+ ASINs\nTACoS: 5.21%\nNet EBITDA: 29%\nSubscription Revenues: 41%\nStocking Capacity: 16 Months\n\nA Few Key Moves That Made the Difference:\n\nPrime Day Momentum:\n\nWarmed up Sponsored Products &amp; Sponsored Brands campaigns 3 weeks early to lock in relevancy and lower CPCs.\n\nPushed inventory to 4x daily run rate, avoiding the stockouts that killed a lot of competitors mid-event.\n\nUsed 150% bid multipliers on proven ASINs to dominate high-traffic placements.\n\nStacked coupons with Subscribe &amp; Save to drive both urgency and recurring orders.\n\nPPC Segmentation:\n\nSplit campaigns between new customer acquisition and repeat buyers.\n\nClustered keywords by purchase intent to balance volume and profitability.\n\nAggressively harvested negatives daily to keep TACoS close to 5% even with spend doubling.\n\nWatched placement-level ROAS to reallocate budget in real time.\n\nPost-Event Retention:\n\nRetargeted Prime Day shoppers through Sponsored Display to keep momentum going.\n\nPhased pricing back gradually to avoid conversion drop-offs.\n\nFocused heavily on review requests and email flows to build long-term trust.\n\nInventory &amp; Profit Discipline:\n\nKept 16 months of stock ready so scaling wouldn’t hit a wall.\n\nModeled LTV and contribution margin scenarios before any big moves.\n\nSimulated 3x demand to stress-test operations.\n\n\nThis wasn’t about chasing a short-term spike. It was about layering systems,PPC discipline, inventory readiness, and clear retention hooks,to grow sustainably.\n\nI’ll keep sharing these examples because I know some of you are in the trenches trying to figure out what actually works.\n\nHappy to answer any questions.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1752527622.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.8,
    "category_rationale": "Lays out a set of scalable moves and operational practices for Prime Day success.",
    "composite_score": 3.4442517364893916
  },
  {
    "score": 79,
    "title": "Update on last post on pace for 7M in 2025",
    "selftext": "Literally had my best day ever yesterday and it was a random Tuesday lol. I am trying to hit scale on a new launch but the product is super capital intensive. If i can sustain this momentum - it’ll be such a blessing lmao. In my last post I mentioned 6M was my goal. And I’m definitely on pace to crack that. \n\nAgain if there are any other 7 fig sellers that want to connect, please reach out. Love learning through osmosis. \n\nSimilarly, if there are any new sellers out there that have questions - please reach out or drop a comment. (Please do not ask stuff you can google lol) I’m talking high level stuff that’s worth my time but also helpful to you! ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1739377919.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal update with no clear instructional or explanatory payload.",
    "composite_score": 3.638363467688209
  },
  {
    "score": 78,
    "title": "My first month in wholesale.",
    "selftext": "I didn’t realise how fast stuff sells. \nI initially loaded up my inventory with 70 skus about 1,000 units. \n\nAs soon as I started using a repricer, my sales took off. I was doing around 100 sales per day. \n\nMy cost price is around £4 a unit and I’m selling between £8.50 and £9.99\n\nROI averaging 25%. \n\nNow that most of my items are selling out, I’ve just sent off 385 units today and have ordered 600 more for delivery to my house. \n\nAny tips on how to keep a constant flow of sales rather than waves? \n\nPrice higher? \n\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1758479902.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Shares insight into repricer impact and ROI with brief reasoning.",
    "composite_score": 3.544551636659069
  },
  {
    "score": 79,
    "title": "From Zero to $20M/Year - What We Learned Scaling a Health Supplement Brand",
    "selftext": "When we launched our first supplement SKU back in March 2021, we didn’t expect it to turn into one of our biggest growth projects. Fast forward 3.5 years later:\n\n30+ SKUs live\n5.5% TACOS maintained consistently\n29% net profitability\n$20M+ in sales over the last 12 months (35% YoY growth)\n\nAnd here’s the surprising part:\n\nMost people assume scaling in supplements is all about “spending more on ads.” But what actually worked for us was the opposite:\n\nRelentless focus on TACOS : We stopped obsessing over ACOS and only cared about blended efficiency. This shift alone saved us thousands per month.\n\nSKU Discipline : Not every product idea deserves a launch. We killed 7 products early that would have drained margin, which allowed the winners to scale faster.\n\nOperational Margins First : From day one, we tracked landed cost + fulfillment + returns at SKU level. If an SKU didn’t hit our 25%+ net margin target, it didn’t stay in the catalog.\n\nContent Before Spend : We realized listing quality (titles, bullets, images, A+ content) drove more long-term sales growth than just pumping ad spend.\n\nDeep Product Research :Before launching, we didn’t just look at BSR or revenue screenshots. We dug into:\nSeasonality trends over 2+ years\nReview gaps (what customers hated in top listings)\nCompetitor keyword depth (were they ranking only on 2-3 hero keywords or spread out across long-tail terms?)\nPrice elasticity (what happens if we price at +15% or -15% of market average?)\n\nOnly when the data + margins + differentiation opportunity aligned did we greenlight a product.\n\nPackaging &amp; Positioning : Supplements is a sea of sameness. We spent real time on packaging that actually stood out on the search page. Clear labeling, premium feel, and benefits highlighted front and center increased click-through and repeat purchase rate.\n\nThe result? Today our supplement brand is doing 7-figures a month while still staying profitable and cash flow positive.\n\nI’m sharing this because every week I see posts here of sellers frustrated with high ad spend, low margin, or stuck at $50k-$100k/mo. Been there. It sucks.\n\nIf anyone here is in that phase and wants to see what an actual breakdown of TACOS, profitability, SKU strategy, and product research looks like, I can share our exact framework (no pitch, just the numbers and what worked for us).\n\nScaling is possible -  but only if you learn to say “no” to bad SKUs and “yes” to profitability over vanity revenue.\n\nHappy to answer questions if anyone wants me to go deeper into:\n\nHow we maintain 5.5% TACOS in such a competitive niche\n\nHow we filter product ideas before launch\n\nWhat levers actually improved net margins\n\nHow packaging &amp; positioning helped us win clicks in a crowded market\n\nHope this breakdown helps someone here learn a thing or two they can apply to their own journey \n\nOpen to your questions",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1755610942.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Contains a structured list of strategic items/tools for scaling the brand.",
    "composite_score": 3.495361954762878
  },
  {
    "score": 77,
    "title": "The harsh truth about starting an Amazon business (99.9% of you will fail)",
    "selftext": "To anyone thinking about starting an Amazon business — let me talk you out of it before you waste your money.\n\nCold truth: 99.9% of you will fail trying to make Amazon your main income.\n\nWhy? Because most people are naive, lazy, and think a few YouTube videos or a $500 course makes them an entrepreneur. Everyone wants “passive income” without putting in the years of grind it actually takes to build something real.\n\nFor every 100 people who buy a course, maybe one actually makes it. That’s why the “gurus” flex Lambos and screenshots — they’ve got thousands of students and barely any real success stories.\n\nAnd listen — Amazon isn’t what it used to be.\nOA and RA sellers are getting Section 3’d daily, brands are gating harder than ever, and seller support is absolute trash. Until your account health score is elite, Amazon will treat you like a cockroach waiting to get squished.\n\nBut if you still want to do it — go for it.\nJust go in with realistic expectations.\nYou won’t get rich quick. You won’t replace your 9–5 in three months.\n\nIt takes years to build a real seven-figure business.\n\nAmazon’s brutal. But if you’ve got grit, patience, and zero quit — it might just work..",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1760074551.0,
    "media": null,
    "is_video": false,
    "num_comments": 110,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.77,
    "category_rationale": "Emotional critique of Amazon business landscape and gurus with warnings.",
    "composite_score": 3.559756092083809
  },
  {
    "score": 77,
    "title": "4 years later…",
    "selftext": "4 years after we started doing Amazon FBA. Just to show you guys how plausible this business model is. Selling in Europe. Reinvested everything the first 2 years.\n\nFor those who want a quick buck overnight, quit. Impatient ones, quit. Lazy ones, quit. This is a serious business, with no ceiling. The success depends entirely on your willingness to innovate, adapt to the constant Amazon changes and the will to be the best in your niche.\n\nNever did any course, never paid absurd quantities of money to anyone to teach us. If they focus too much on selling you a course, that’s their business, not Amazon FBA.\n\nThat’s why I don’t teach/sell courses.\n\nYou can do it guys! Takes time for the rewards, the pain is worth it. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1727937035.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Offers encouragement and lessons from long-running business, with guidance.",
    "composite_score": 3.5238085994719492
  },
  {
    "score": 78,
    "title": "Woohoo made it to Amazon choice again",
    "selftext": "I engineered this product a couple of years ago. And took a few tries to get it to where it’s at. At first there was a threading issue because of tolerance variations from extension pole to extension pole. After that we upgraded the packaging from the cardboard with a zip tie to a clamshell. I guess the clients really appreciated the quality and care we put in. I think overall that’s the secret, keeping your clients as happy as possible. Keeping that return rate low. Engineering and, packaging and quality manufacturing are the only ways to really do it in my opinion. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1743917356.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Gives practical insights on product quality and packaging as success factors.",
    "composite_score": 3.4653084360375637
  },
  {
    "score": 74,
    "title": "Lessons from Growing an Amazon Business",
    "selftext": "When I first started this brand, the vision was simple — create a product line that truly solved a problem and delivered value to customers while maintaining exceptional quality and trust. The journey, however, was far from simple. It began with countless hours of research, testing, and learning how to navigate the complexities of the Amazon marketplace. From identifying the right niche to optimizing listings for search, every decision required precision and patience.\n\nIn the early months, sales were modest. I focused on building a solid foundation instead of chasing quick wins. I spent time refining product images, enhancing descriptions, and understanding customer behavior. Gradually, organic traction began to build. Customer feedback became my compass, helping me improve packaging, product quality, and post-purchase experience. The goal was always to make sure every buyer felt that they were purchasing from a brand that cared.\n\nBy the end of the first year, consistent optimization and reinvestment began to pay off. Through strategic use of Amazon advertising and coupons, combined with targeted promotions and influencer collaborations, visibility increased significantly. Instead of relying solely on ads, I emphasized long-term brand building — encouraging repeat purchases and cultivating loyalty through trust. Each satisfied customer became a silent ambassador, and word-of-mouth started to drive momentum.\n\nFast forward to today, the brand has surpassed $1,161,000 in product sales with a remarkable 959% growth compared to the previous period. What started as a small operation has grown into a healthy, thriving Amazon store with a strong reputation and five-star seller feedback. This growth didn’t come from luck but from consistency, adaptability, and the relentless pursuit of excellence.\n\nManaging 25 active orders at any given time and maintaining a perfect seller rating is not just a metric of performance but a reflection of the brand’s core values — reliability, authenticity, and quality. The lessons learned through this journey go beyond sales numbers. Building a brand on Amazon requires balancing analytics with empathy, data with creativity, and persistence with patience.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1761595491.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Narrative with lessons and strategic takeaways for building an Amazon business.",
    "composite_score": 3.4230629352090998
  },
  {
    "score": 74,
    "title": "Fifth month completed - Road to 100k/month. Ask me anything",
    "selftext": "Sales grew slightly slower than expected, had some stock issues for my best seller. Should be good going into December. \n\nProf ability took a hit due to sales and increased ad spend, which was lots of experimenting and helping new variants grow. \n\nNote: Please no DMs. Will try to answer everything reasonable here. Preview posts: \n\n\nFourth month: https://www.reddit.com/r/AmazonFBA/comments/1olsep2/fourth_month_completed_road_to_100kmonth_ask_me/?captcha=1\n\n\nThird: https://www.reddit.com/r/AmazonFBA/comments/1nwjy9x/third_month_update_50_growth_rate_continues/",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1764653204.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Updates with limited actionable content; lacks substantive insight.",
    "composite_score": 3.5462275116073343
  },
  {
    "score": 70,
    "title": "FBA Update Road to 6M",
    "selftext": "After my last post, I got a lot of questions I think for the most part I’ve responded to them all again. I’m happy to be a resource. I don’t offer coaching at this time so please don’t ask. \n\nMy main goal on doing these posts just to hold myself accountable and also look for other sellers who are doing similar numbers or who are further ahead of me and willing to invest in me the same way I’m willing to invest in those who are behind me. \n\nLast month I did about 350,000 February. I got that up to 460,000. I’m still a little bit away from hitting 6 million this year again my goal is just to launch products every 4 to 6 weeks.  \n\nFor the first time, I’ve started incorporating outside capital to scale faster. \n\nAnd it’s actually working. \n\nAgain, I’ll reiterate this post. I only do private label for the most part. I create my own products whether that be through providing my ideas to a manufacturer to make them custom or modifying existing products to make them better. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1741117166.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Shares goals and strategy (launch cadence, capital) as guidance for others.",
    "composite_score": 3.434378967406869
  },
  {
    "score": 68,
    "title": "$2 million dollars in sales later, here is what I’ve learned: don’t buy in bulk and resell, you’ll just end up losing money because it’s saturated. Don’t dropship because you’re just advertising someone else’s product. Find something that works and improve it, that’s the secret. I did it.",
    "selftext": "Yes, it’s easier for me because I’m an engineer but it’s still valid for everyone. The beauty about Amazon is the demand. People are searching for these specific keywords, and all you need it to do is position yourself in the right place with a high quality product. Gone are the days of cheap Chinese stuff, you gotta control the quality. Good quality equals to low returns which keeps Amazon happy and you on the top of the page. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1738457030.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.79,
    "category_rationale": "Presents a clear, generalizable learning about e-commerce strategy.",
    "composite_score": 3.382634178786223
  },
  {
    "score": 68,
    "title": "First year in and I’m loving it",
    "selftext": "To summarize I’ve been documenting my whole journey with Amazon, to answer some questions I private label (buy from china sell here) and I pick pack and ship myself. I have a single high ticket product, and the only obstacle I’m having is scaling over 10-15k a month. I’ve tried to raise ad spend to no avail, seems like this product is just stuck at 10-15k a month. Would love some Amazon vets opinion on what I should do ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1763406508.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal scaling/advice-seeking post without a clear list, model, or steps.",
    "composite_score": 3.3045309728167487
  },
  {
    "score": 69,
    "title": "Reactivated after 5 months!!",
    "selftext": "\nWhat a great email to wake up to!\n\nSeller support gave up on me and I had to go to amazons legal team. Amazon removed my ability to contact their support people and any emails were ignored.\n\nI also hired Mari-marketing and he helped navigate and create the plan of action.\n\n\nAmazon also required that I admit my faults. Basically I failed to verify my supplier.  They also required I buy new inventory. \n\nI gave up and was able to get all my inventory ($20k worth) out but looks like we are back!! ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1745501451.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Narrative about Amazon seller issues with no actionable framework.",
    "composite_score": 3.3617226852132074
  },
  {
    "score": 63,
    "title": "I wish more people could know abt these advice when sourcing in China!",
    "selftext": "Over the past few years, I’ve been running a small business based in China helping international clients source and negotiate low-MOQ products from China — toys, accessories, custom merch.\n\nAgain and again, people come to me after being burned, ghosted, overcharged, or simply overwhelmed by the sourcing process. The ecosystem is complex, opaque, and culturally very different. I wish more people knew how this really works before making their first deposit, so here are the hard truths (and survival tips) I’ve learned from the front lines and want to share with any entrepreneurs who want to do business in or from China:\n\n**1. “MOQ is negotiable”—if” you know when and how to ask.**\n\nThe MOQ listed on Alibaba or 1688 is rarely set in stone. But most buyers get rejected because they negotiate too fast, too aggressively, or without understanding local business culture. Here’s what actually works:\n\n* **Time your approach:** Reach out at the end of the Chinese workday (around 5–7pm local time). They’re more open to flexibility once the pressure of the day winds down.\n* **Frame it as a trial, not a low-volume order:** Say something like, “I’d like to test 50–100 units to check quality and feedback before placing a 500+ unit order next month. And here is my order volumes for the past few months... (show them your potentials would be more credible!) ”\n* **Be specific; show a roadmap.** Give them a reason to believe you’re scaling. Try to be as specific as possible here because vague language like “maybe more in the future” doesn’t work and may influence the BD specialist's ROI (they prefer not to waste too much time on you then).\n\nFrom experience: I’ve helped clients reduce their MOQ by **up to 80%**, even when dealing with larger factories. In some cases, I negotiated 50-piece trial orders with top-tier manufacturers — by emphasizing the client’s branding potential and future growth. This works because smart suppliers sometimes take **a short-term loss to secure long-term customers** — *if* you seem credible. On other occasions, Having a clear logo, real website, or even basic brand deck helps tremendously. Also, don’t underestimate the power of 拼单 (sharing the large quantity with another buyer; some factories may be willing to do this, but it also depend on the negotiation)—combining small orders across similar clients into one batch. This works especially well for standardized SKUs or seasonal products.\n\nRecently, I’ve also started asking my trusted factory partners to introduce me within their networks — and it’s worked surprisingly well for clients with small MOQs. When trust is already established, especially in a culture where *guanxi* plays a key role, things move faster and negotiations become much smoother.\n\nThe key is relationship &amp; negotiation, not pressure. Lead with long-term intent, and speak our language (both literally and culturally).\n\n**2. Always ask: “Are you a factory or trading company?” — sometimes you can tell from their language &amp; speed of reply sometimes you need to verify.**\n\nJust asking is not enough. Here’s how to check:\n\n* Search their name + 工厂 (“factory”) on Baidu/1688.\n* Ask for factory videos (look for machines, not office desks).\n* Look up their business license or ask for one. Check 工商系统 (Chinese business registry).\n* ⚠️ Trading companies aren’t always bad — but they should tell you upfront.\n\n**3. A cheap price today = an expensive mistake later.**\n\nDon’t skip the basics:\n\n* Always start with a **paid sample** or free -  depending on negotiation.\n* If scaling, do **on-site quality control** before final payment — ideally by someone who speaks the language, can do video/ picture verification &amp; even do commission-based QC\n\n**4. Know the culture of collaboration**\n\nMost first-time importers rely entirely on Alibaba, emails, or Google Translate. That’s exactly how you end up overpaying, getting ghosted, or receiving the wrong product. Here’s why email alone fails:\n\n* \\*\\*Suppliers prioritize WeChat relationships.\\*\\* In China, serious business conversations happen on WeChat or face-to-face communication. It’s faster, more personal, and gives you access to supplier updates, real-time photos, and actual decision-makers — not just junior sales staff handling generic email accounts.\n* \\*\\*You’re often not talking to the actual factory.\\*\\* Without local knowledge, it’s hard to know whether you’re dealing with a real manufacturer or just a middleman. A simple trick? Ask for their business license, factory photos, or video calls  and know what to look for.\n* **You need to speak the sourcing language.** Common terms like:\n   * 出厂价 (chūchǎng jià): factory gate price, excluding tax or shipping\n   * 含税 (hánshuì): tax-included\n   * 含运 (hányùn): includes shipping can affect your margin by 10–30%. Misunderstand one term, and your “cheap supplier” suddenly isn’t so cheap.\n* **Disputes are sometimes hard to resolve from abroad (sorry).** If a shipment goes wrong, having someone local — who speaks the language, knows the norms, and can visit the supplier if needed — often makes the difference between fixing the issue and losing thousands.\n\nIf you’re serious about long-term sourcing—especially with low MOQs, multi-SKU orders, or branded packaging — **you need someone local in your corner**.\n\n**wow more DMs than I expected, FYI:** As someone who went abroad to study in Canada and then returned to China as a first-generation e-commerce entrepreneur, I personally also help small brands, solo founders, and first-time importers cut through the confusion, verify suppliers, and negotiate smarter deals — avoid traps you could image with a very fair price. \n\n\\------------------------------------------------------------------------------------------------------  \n**Nov 5th updates:** Hey everyone, I honestly didn’t expect this post to bring so many messages and business requests. I’m currently fully booked with sourcing projects until the end of this year.\n\nBut I’ve packed my years of China sourcing experience for my foreign clients into a short, no-fluff guide — things like finding honest agents, QC traps, realistic MOQ, and real negotiation tactics...\n\nDM if you want it. It costs about a coffee ☕. Thanks everyone! I’ll try to answer as many questions as I can but time’s a bit tight, but I’ll do my best to get back to everyone to help with strategic sourcing.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1747885628.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Contains a numbered set of negotiation tips for MOQs, i.e., a curated list of items.",
    "composite_score": 3.2197406013437186
  },
  {
    "score": 63,
    "title": "From 450k a month to 50k a month",
    "selftext": "Hi all,\n\nI’ve been selling on Amazon in Europe for a couple years, i had my peak in december where i reached 450k a month (mostly through seasonal products) and now i’ve been down to 50k a month and i’m struggling to be honest.\n\nBecause i don’t know how to differentiate myself from the Chinese resellers, because once is a product is going well they will undercut me and i have don’t have any margin left. I have brand registration and trademark.\n\nBut how to deal with competitors who undercut your price? Because everybody can source the same products from China so how to stand out? Is it only through the listing?",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1755606785.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Discusses differentiation and asks for advice; not a step-by-step or model.",
    "composite_score": 3.3531649761518967
  },
  {
    "score": 58,
    "title": "Wrapping up first month, thank you everyone here",
    "selftext": "Just wanted to celebrate with folks here as no one really knows IRL, and thank everyone here for all the help I had especially when setting up. \n\nMy first month had been Amazing and had to really raise price as I couldn’t keep enough stock in time. \n\nIf anyone is thinking of stating I highly recommend it! But keep in mind numbers numbers numbers! That’s the only that matters. \n\nCurrent net margins are about 50% not including all the one time costs (registrations, trademark, GS1) etc. \n\nAlways happy to answer any questions folks have in the comments, especially those trying to start out. ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1753899138.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Celebratory update with no actionable guidance.",
    "composite_score": 3.487745925314922
  },
  {
    "score": 54,
    "title": "For the Newbies and Future Amazon Sellers Please Read This Before You Jump In!",
    "selftext": "Let’s be real for a second. You need money.\nAnd not just a little. You need a lot of it.\nYou’ll be paying for packaging materials, barcodes, labels, ads, inventory, and high MOQs (minimum order quantities). You think you’re getting the same deal buying 10 units as the guy ordering a whole pallet? Be serious.\nThen you finally make a few sales, and guess what? Amazon doesn’t pay you right away. You either wait for the next payout cycle or get charged a fee just to access your own money early. And if you buy shipping labels or build up fees, Amazon will happily charge your card the next day. They don’t deduct it from your sales like eBay. They want their cut instantly.\n\nOh, and mistakes? Amazon loves those because you’ll be paying for them.\nWrong packaging? Fee. Wrong prep? Fee. Wrong FNSKU label? Fee.\nLose a shipment or get hit with customer returns? You’ll be fighting support for weeks to maybe get reimbursed. You’ll spend hours watching YouTube gurus telling you “just find a winning product,” like it’s that simple. But they don’t tell you about storage fees, returns eating your profit, or competitors tanking your price overnight. You could spend months researching, testing samples, building listings, and then someone comes in, drops their price $2 below yours, and your profit is gone.\n\nAnd don’t forget:\n• Amazon takes around 15% of every sale just for the referral fee.\n• Then you have FBA fees, storage fees, advertising fees, and return deductions.\n• If your product doesn’t sell fast enough, you’ll pay long-term storage fees too. \n\nMeanwhile, customer returns will come back opened, used, or missing pieces, and you still might not get reimbursed.\nAmazon also tracks your performance metrics like a hawk. One bad batch, a few late shipments, or a spike in returns and you’re suspended. Sometimes for weeks. Sometimes for good.\nSo please, don’t come into this thinking it’s easy money.\nThis is not eBay. It’s not Etsy. It’s not Shopify.\nIt’s a massive, expensive machine, and if you’re not careful, it’ll eat you alive before you even start making profit.\n\nDo your homework. Stack your money.\nHave backup funds for mistakes, delays, and inventory that doesn’t move.\n\nBecause if you’re trying to cut corners or do it the cheap way, Amazon will humble you quick. Maybe that’s why Bezos is so rich from all the sellers who jumped in unprepared.\n\nGood luck to everyone!",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1762712470.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Educational warning with explanations of costs and pitfalls for new sellers.",
    "composite_score": 3.157968310350047
  },
  {
    "score": 55,
    "title": "How to start an FBA business.",
    "selftext": "I made this for someone and thought it would be nice on here\n\nHow to start an Amazon FBA business.\n\nThere are a lot of YouTube videos available online and courses that explain how to start up an Amazon business. These videos often say that you need a lot of money to start up a company, a lot of experience and a lot of luck. This is simply not true. I’m going to explain how I make around £100 profit per day through FBA as a 15 year old with a £50 investment.\n\nHow do you set up an FBA account?\nGo to sellercentral.amazon.com and select sign up. There are two different plans for Amazon. One is professional and one is individual. I would suggest starting off with individual, as it is free, but you must pay an additional £0.75 selling fee on top of the FBA fees when you sell a product, whereas with the other plan, you pay £25 a month and do not pay the 75p selling fee. Then, enter your information and they will ask for a bank statement and a form of identification such as a passport, to confirm that you are who you say you are and that the address is correct. If you intend to sell for commercial gain (I.e. profit) and not just to sell old stuff, you will need to add you UK UTR (Unique Tax Reference) which is available in Government Gateway/Self Assessment, for which you will need to upload a copy of a self assessment. Sometimes they will ask for a video verification also. Ensure that all of the information matches up, otherwise your account will be closed and you will be blacklisted.\n\nHow do you find a product?\nThis is the hardest stage of creating a successful business. To find a product, go onto the general Amazon customer website/app. Then, if you have a product is mind, try and find that product on there, but if not, look around in a category that you may want to sell in. Now that you are here, take your time and have a scroll through. Look out for products that have sold a lot in the last month (e.g., it may say 1K+ sold in the last month [see image 1]). You could use Helium 10 or Jungle Scout for more accurate sales information, however, I did not as they are extremely expensive. Now that you have found this product, go to your Amazon Seller Central, and go to the Add a Product page. Copy and paste the ASIN from the listing into this page. It will take you to one of three routes. The first route and best route is that it will automatically let you sell this product. This is good, as you can instantly start, but there will be a lot of competition, possibly making it harder to sell and make a lot of money, due to competitive pricing. The second option is that you will have to ask for approval. This is where you have to submit an invoice, showing that you have purchased the exact same product within 180 days from the exact same supplier. (See image 2). From my experience, this is extremely hard to get approval for , but can pay off due to the limited competition. The third and most annoying route is that it will ask for a Transparency code. This is extremely annoying as no suppliers will like to give this unique product identifier code away, making it a completely monopolistic market. However, if you cannot find a product you would like to sell, you can create your own Amazon listing, however this is more risky as there are less reviews, for example.\nNow that you have found the product, head over to Alibaba.com and try to find the exact same product there. Once you have found it, I would suggest talking to the supplier to try and get a lower price, and then purchase a small quantity to test it out - remember that you must pay a 20% import tax if you are importing to the UK. Before purchasing, ensure that you can make a profit of around 100%.\nIf you can’t find the product on there, look for a different product to sell on Amazon.\n\nOnce you have the product.\nWhen the product arrives, you have two choices. You can either go FBA or FBM. FBA is more common, where you shop the product to Amazon and they sell it as Prime Delivery and they provide customer service. Or there is FBM, where you dispatch the product when it sells. With FBM, you simply keep the stock and then buy postage when it sells, and keep updating the customer, although you are less likely to gain the buy box, and you must provide assistance. FBA is much better. Once you know your listing, go to seller central and select Replenish Inventory. Then, you select how many units you would like to send. Amazon will then get you to print some labels on 9 x 3 sticker paper. These need to be fixed to each unit, as it allows Amazon to track them. Once this has been done, you select how many boxes you will be shipping in (although I use the box that the units were shipped in from China) and the dimensions / weight of them. Then, you must purchase delivery. You should always use the Amazon partnered carrier, which in the UK is UPS as they cost just around £2.50 per box, no matter the size. Then, you print the labels, and drop it off at the drop off point, where it will be transferred to a Fulfillment Centre (FC). The package will generally be held until there are enough to fill up a truck to Amazon. Once at the FC, Amazon will open the package, and distribute the units to other FC’s around the country, to allow for Prime delivery. Once they have been received at each FC, they will be eligible for Prime Next-Day delivery.\n\nSales.\nOnce a unit has been sold with FBA, Amazon will ship it and they will take a cut of the price.\n\nThe Buy Box\nWhen you go onto Amazon, the box that says buy now is called the buy box. On one particular listing, there may be 7 sellers, for example, and so competition for the box is very fierce, and if an FBA seller is available, they will always get it. However, if there are more than one seller, it depends on price, customer reviews etc. Therefore, there can be significant price conpetition, but there is no point in reducing your price too much, where you won’t make a profit.\n\nReturns\nWhen a product is returned, a refund will be taken from your account level reserve (see below) and given to the buyer. When it is returned, you have the option for it to be returned back to you. From here, if the condition is ok, I always sell it again, but as FBM at a lower price, just to get rid of it, but still make a profit. Returns can sometimes be avoided, by talking to customers and offering partial refunds for example.\n\nMoney\nOnce you sell an item, and it has been dispatched, Amazon will add the money (minus all of the costs such as per item selling fee, FBA fees and storage fees (which are negligible)) to your balance. This is generally held for a few days in the Account Level Rseserve, which is where money for refunds comes from. After a few days, the money will be released into the actual balance. Amazon then initiate a transfer of the money once every 7 days, whether it is positive or negative. Every seven days, only my a percentage of the total sales money will be given to you, to allow for refunds. Although it is every seven days, every day, a small amount will be made available to transfer, but it is best to wait for the 7 days, as otherwise it takes longer, as a transfer, whether it is for £0.01 or £1,000,000 can only be made once every 24 hours. Once the transfer has been initiated, it will take 3-5 working days to end up in your account.\n\nPlease remember that you should be paying tax on this, although I believe that from today (1st August 2024) Amazon automatically collect tax on sales to give to HMRC.\n\nI hope this has helped you a lot, and I wish you all of the best, as I have spent 40 minutes writing this!\n\nI would like to remind you that anything is possible with FBA, as I started with 15 units and £50, sold these, to give me £150, brought 45 units to bring in £450, and the cycle continues.\n\nIt is a great way to bring in a lot of money simply. I am calling it the Financial Revolution!!!\n\nI wish you all the best, and hope to see you succeed.\n\nJoe \n\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1722464036.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Explicit step-by-step guide titled to start an FBA business with actionable steps.",
    "composite_score": 3.1618993674173037
  },
  {
    "score": 55,
    "title": "3 months FBA experience as new seller",
    "selftext": "My first 3 months as a new Amazon FBA private-label seller – progress, lessons, and growing pains\n\nJust wanted to share a quick update on my journey so far. I started my private-label brand about 3 months ago, and here’s my year-to-date product sales from Amazon (screenshot attached).\n\nA few takeaways and pain points that might help other new sellers:\n\n1. FC Transfer is brutal.\nRight now ~60% of my inventory is stuck in FC transfer. It has slowed down momentum and limited how much I can scale. I didn’t expect it to drag on this long, so this has been a big operational bottleneck.\n\n2. Cash flow is everything.\nI underestimated how much capital this business needs—especially when you’re reinvesting aggressively to build a brand. I’m still negative overall because every dollar is going back into inventory, packaging, PPC testing, and product expansion.\n\n3. Don’t let yourself go out of stock.\nI learned quickly that keeping inventory in stock is not optional. Once you lose ranking, you spend even more on PPC to regain it. Now I plan reorders much earlier.\n\n4. Brand building takes more preparation than most realize.\nCreating packaging, photography, inserts, A+ content, and consistent branding takes time and money. But it’s also what separates you from generic listings.\n\nDespite all this, I’m hopeful for December. If the remaining units get checked in, I think I’ll finish the year strong and start 2026 with stable momentum.\n\nPosting this for accountability and to share the reality of what the early stages look like. Open to any advice from experienced sellers—especially around managing cash flow and handling FC transfer delays.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1765028593.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Shares lessons learned and actionable takeaways from 3 months’ experience.",
    "composite_score": 3.2143870259556784
  },
  {
    "score": 52,
    "title": "What changed for you when you crossed $10K a month on Amazon?",
    "selftext": "I remember hitting that 10K a month mark and expecting to feel some sort of relief but honestly it came with a whole new set of problems. Suddenly there were more returns to manage, inventory gaps started showing more often and small inefficiencies I used to ignore started costing way more than I realized.\n\nI had to rethink how I was managing cash flow and payouts set up a proper structure to keep ad spend, software tools and supplier payments from bleeding into each other. Switched to a business banking setup by Adro banking and opened sub accounts and issue team cards which helped a lot with organizing expenses. Not glamorous stuff, but it made a difference. The biggest shift wasn’t even financial it was mindset. You go from hustling to maintain sales to trying to protect and systemize everything.\n\nWhat changed for others at that point. Was it your team, your tooling, your pricing? Or did you hit that number and realize you needed to slow down and clean house first?",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1754042046.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Reflective question after reaching $10k/month; no concrete guide or model.",
    "composite_score": 3.2508767316342864
  },
  {
    "score": 52,
    "title": "I lost my job during the pandemic and ended up selling on Amazon",
    "selftext": "In 2020, in the middle of the pandemic, life dealt me ​​some knocks. I lost my dad, I neglected work and they fired me. With the liquidation I did the worst: I spent the money on inappropriate things. I moved, returned to my hometown and was aimless.\n\nMy wife worked in an Amazon call center. One day he said to me: “What if we try to sell on Amazon?”\n\nI had no idea about anything, but we said okay. I hired Jungle Scout, found a product that sold 150-200 pieces a month and ordered 50 pieces on Alibaba to test.\n\nAt first it seemed good, until the competitor began to lower the price to the floor. My margin became a dollar a piece. It wasn't worth continuing like this.\n\nThen my wife told me: “put a nice package on it.” We had the pieces brought from Amazon FBA, we made boxes, photos (bad, because I didn't even know how to order what I wanted), and we relaunched on Amazon.\n\nThe first sale was on my birthday 🎂. That day I sold 4 units. That feeling is never forgotten.\n\nFrom then on, sales began to climb. The funny thing is that while the other one kept lowering prices, I raised mine... and they continued to sell. I sold 300 units a month. All for packaging and a little bit of differentiation.\n\nI started without courses and without experience. I hit the ground running, learning as I went.\n\n👉 My question: Who else here started on Amazon(Or business) without knowing anything, just trying and what was their experience?",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1756702250.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal origin story; ends with a question to others; not a how-to.",
    "composite_score": 3.2208767316342866
  },
  {
    "score": 53,
    "title": "Got a brand to $85k it got shutdown, relaunched and got it back to $60k/mo",
    "selftext": "\nI know this sounds something straight out of a movie but as crazy as it sounds, this is the pathetic and painfully honest truth, was waiting for the brand to touch 60k to share this loool\n\nThis brand in the home products niche went from 30k in June to an 85k run rate by early August, got shut down for almost a month, and is now sitting at a stable 60k per month after relaunching from zero.\n\n\nThe niche was untapped at the start, we were doing 20-30k without any noticeable ad spend, we then started scaling our ads, fixed the leaks in our customer journey, and immediately saw a 64% increase in daily velocity, tbf this niche was a bit cracked but regardless, we got deactivated because the owner had his brother drop 2 star and 1 star reviews on his competitors, amazon caught on when the ip got linked and within a day our accounts status moves to pending deactivation and 9 days later got deactivated  \n\n30 rough very dark days later ( and tons of appeals too ) \n\nThe account was reactivated, the first goal wasn’t scaling. It was rebuilding the foundation the deactivation had harmed. The relaunch started with a staircase pricing strategy, a simple but effective approach popularized by Steve Pope. Instead of trying to return to the previous price point immediately, we dropped the price intentionally low to restore order velocity and conversion. Once the listing regained momentum, we raised the price gradually in small steps. This helped bring back previous customers, win new ones, and get customers to trust the listing again after a month of inactivity, dropping the ncx ( negative customer experience rate ) down.\n\nThe ads needed a reset too. The old campaigns were still there, but the data wasn’t relevant after such a long downtime, so we restructured the spend with a focus on Sponsored Brands. SB gave us stronger top of search visibility and rebuilt brand recognition faster than SP alone. At the same time, B2B campaigns quietly started carrying more weight than expected. They brought predictable, repeatable orders with stronger unit economics and helped balance revenue during the first few weeks of relaunch.\n\nBrand tailored promotions were added early. Not for discounting, but for increasing session value and giving returning customers a reason to choose us again. These promotions helped rebuild keyword relevance far faster than expected. Right now the brand is back in the top 15 organic positions for most of our main keywords, which is the real engine behind the 60k.\n\nOne interesting finding was that a Broad Match Modifier campaign ended up outperforming the legacy campaigns. Most competitors in this sub niche don’t use BMM at all, so the clicks were cheaper and the search term quality was better than traditional broad. It became an imp  discovery source during the rebuild.\n\nAnd as usual, a good percentage of sales right now are coming from B2B. Still one of the most underused levers, and still worth testing if you’re ignoring it. I don’t get paid to prmote B2B y’all are really sleeping on it.\n\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1765237300.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.62,
    "category_rationale": "Narrative of relaunch steps and actionable sequence to recover a brand after suspension.",
    "composite_score": 3.204968748982922
  },
  {
    "score": 50,
    "title": "So apparently Christmas is a big day…",
    "selftext": "This is my first year owning an Amazon business that has been around since 2007. When I bought the business I saw the monthly financials but never really had a reason to dig into the daily sales. For some reason I expected Christmas Day to be dead, but I was clearly wrong.  It was my biggest single day since buying the business in May. Ended at $5800, profit around $1700 per SellerBoard.\n\nMy niche is sort of “technical hobby” and definitely discretionary, so this shouldn’t be a surprise- my sales are probably from people getting gift cards and buying for themselves. It would be difficult to buy my product as a gift for a loved one unless they’re both in the hobby.\n\nLuckily I overshot my inventory for BFCM so I had plenty left in the Amazon fulfillment centers for this spike.\n\nBut, wow!",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1766757435.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Anecdotal sales spike report without broader insights or steps.",
    "composite_score": 3.1176757969537388
  },
  {
    "score": 46,
    "title": "You can do it.",
    "selftext": "Having limited background in Amazon FBA, I was committed to learn everything I could and launch an Amazon brand. One thing I’ll tell you for anyone on the fence is that you WILL make mistakes, you will be humbled and you will be astounded by how much Amazon makes on all aspects of your product lol I launched in Mid-November. I am still in the RED when you factor in all my other costs unrelated to the actual product (my subscriptions, ad pay, fiverr services, trademark legal work) I paid for — but that’s part of the journey. On my path to green and lots of it. Wishing you all the best of luck, you got this! ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1764683018.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Motivational post with personal experience; lacks a clear model or steps.",
    "composite_score": 3.0148223186248546
  },
  {
    "score": 48,
    "title": "Please Don’t Fall for 'I Did This for My Client' Posts Most Are Fake",
    "selftext": "There are too many posts these days saying things like “I did this for my client” or “scaled this account to X figures.” Please be cautious many of these screenshots are fake and the intention behind these posts is often just to attract more clients.\n\nI strongly advise new sellers not to approach or respond to such posts without doing proper research. If you're considering hiring someone first check their past Reddit activity read their comments, posts and get a sense of their actual knowledge. Then have a live call and ask to see real account performance, not just screenshots.\n\nTo the subreddit moderators: I respectfully request that posts promoting unverifiable claims be reviewed more strictly. These posts can mislead genuine beginners looking for help.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1756383626.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Advice-based critique with practical verification steps to avoid scams.",
    "composite_score": 3.0757110778605043
  },
  {
    "score": 48,
    "title": "Complete List of Amazon Seller Tools 2025",
    "selftext": "# Product Research\n\n[**Helium 10**](https://garlicpressseller.com/product/helium-10/)  \n$39  \nAll-in-one tool for product research, keywords, and listing optimization.\n\n[**SellerAMP**](https://garlicpressseller.com/product/selleramp/)  \n$19  \nQuickly check if a product is worth selling. Arbitrage / wholesale only.\n\n[**Smart Scout**](https://garlicpressseller.com/product/smart-scout/)  \n$29  \nHelps you find brands and products to target for wholesale and arbitrage.\n\n[**Jungle Scout**](https://garlicpressseller.com/product/jungle-scout-chrome-extension/)  \n$49  \nAll-in-one tool for product research, keywords, and listing optimization.\n\n[**AMZScout**](https://garlicpressseller.com/product/amzscout-tool/)  \n$59  \nSimple research tool to check sales estimates and competition.\n\n[**Viral Launch**](https://garlicpressseller.com/product/viral-launch-chrome-extension/)  \n$69  \nProduct research, keyword tracking, and market insights.\n\n[**Keepa**](https://garlicpressseller.com/product/keepa/)  \nFree/Paid  \nTracks price history and sales rank over time.\n\n[**Data Dive**](https://datadive.tools/)  \n$39  \nBreaks down markets and competitors.\n\n[**ZonGuru**](https://www.zonguru.com/)  \n$49  \nProduct research and keyword tracking with extra customer review insights.\n\n[**MerchantWords**](https://www.merchantwords.com/)  \n$35  \nFinds what people are actually searching for on Amazon.\n\n[**Algopix**](https://algopix.com/)  \n$29  \nShows demand, competition, and profit potential across marketplaces.\n\n[**Google Trends**](https://trends.google.com/trends/)  \nFree  \nSee what’s trending right now.\n\n[**CamelCamelCamel**](https://camelcamelcamel.com/)  \nFree  \nChecks Amazon price history.\n\n# Sourcing\n\n[**OA Source**](https://oasource.com/)  \n$99 per month  \nLeads for Online Arbitrage.\n\n[**Jungle Scout**](https://garlicpressseller.com/product/jungle-scout-chrome-extension/)  \n$49  \nJungle Scout has a suppliers database.\n\n# PPC\n\n[**Advigator**](https://www.advigator.com/)  \n5%  \nAutomates and optimizes your Amazon ads based on performance data.\n\n[**M19**](https://www.m19.com/)  \n$49  \nAI-driven PPC tool that manages bids, budgets, and keyword targeting.\n\n[**Adbrew**](https://adbrew.io/)  \n$499  \nAdvanced PPC automation and analytics for scaling large Amazon ad accounts.\n\n[**Perpetua**](https://perpetua.io/)  \n$695  \nAI-powered bid optimization &amp; automated keyword harvesting.\n\n# Dashboard &amp; Analytics\n\n[**SellerApp**](https://www.sellerapp.com/)  \nFree  \nResearch, PPC, and listing optimization in one dashboard.\n\n[**SellerBoard**](https://sellerboard.com/)  \n$19 per month  \nShows your true profits and helps forecast stock.\n\n[**ManageByStats**](https://www.carbon6.io/managebystats/)  \nFree  \nGives you a clear view of your sales, ads, and customers.\n\n[**Shopkeeper**](https://shopkeeper.com/)  \n$20 per month  \nTracks your profits and sales in real time.\n\n# Inventory Tracking\n\n[**InventoryLab**](https://inventorylab.com/)  \n$49 per month  \nManages inventory, scouting, and accounting.\n\n[**SoStocked**](https://www.sostocked.com/)  \n$79 per month  \nForecasts stock so you don’t run out or over-order.\n\n[**RestockPro**](https://www.ecomengine.com/restockpro)  \n$49 per month  \nKeeps track of stock levels and automates restock planning.\n\n# Shipping &amp; Logistics\n\n[**Freightos**](https://garlicpressseller.com/product/freightos/)  \nCompare freight forwarders for the best rates.\n\n[**Flexport**](https://www.flexport.com/)  \nFull freight forwarding and customs help for Amazon sellers.\n\n[**ShipBob**](https://www.shipbob.com/)  \nHandles eCommerce fulfillment, including FBA prep.\n\n# Freelancing &amp; Outsourcing\n\n[**Fiverr**](https://www.fiverr.com/)  \nFind freelancers for listings, design, and marketing.\n\n[**Upwork**](https://www.upwork.com/)  \nHire pros for PPC, research, and other Amazon tasks.\n\n[**FreeUp**](https://freeup.net/)  \nMarketplace of pre-vetted freelancers for Amazon work.",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1754911873.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Comprehensive list of tools and resources for Amazon selling.",
    "composite_score": 3.2992717052203355
  },
  {
    "score": 49,
    "title": "First month on Amazon!",
    "selftext": "Hello everyone. New Amazon seller here working with the FBA model selling a generic white label product. Just wanted to share my 1st month results. It has been a shifty road but I am here and doing it. This isn’t much but I’m glad to have made sales last month. I’ve sold 13 units since launching on July 7th! I’m making about 1 sale every other day right now. Working to increase to more sales per day on a consistent basis. Ad costs are killing me right now but I hope it gets better soon with optimization and organic ranking. Praying for more growth and success for myself and other Amazon Sellers out there! 🙌🏽",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1754217614.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal update with month-one results and challenges; no structured guidance.",
    "composite_score": 3.0950796517029784
  },
  {
    "score": 46,
    "title": "My 6-Year Experience Selling on Amazon as a Wholesale Seller",
    "selftext": "Hey everyone, I've been lurking around here for a while and figured it's time to share a bit of my journey. The one that helped me reach these monthly numbers.\n\nI'm based in Barcelona and I did this in Spanish and European Marketplaces\n\nI started back in mid-2019 doing Amazon Arbitrage. Things went pretty well at the beginning. I used all the classic tools like Keepa, SellerAMP, SellerBoard… I was doing 100% FBA, running around all retailers  — scanning products and buying everything I could flip.\n\n2020 was insane. Sales skyrocketed and my growth was exponential. I was pulling in around €20–30k/month, and during Christmas it went up to €50–60k/month.\n\nI started with about €5,000 in capital.\n\nOver time, I transitioned into wholesale, meaning I now buy directly from brands or manufacturers.  \nSounds easy when you say it like that… but trust me, it takes a ton of hours searching for products, cold calling, visiting companies, building relationships, and going through lots of bad experiences to get to where I am now.\n\nFast forward to today I’ve got a business that works. I found a niche that I know well, my purchase prices are decent (not the cheapest, but good enough), and I’m making a comfortable living.\n\nRight now, I have 2 full-time employees:\n\n* One handles prepping and shipping to FBA\n* The other takes care of admin stuff\n\nSometimes I even help with packing myself when I’m at the warehouse (yep, I have a warehouse — there’s no way to handle all the stock without one).\n\nI'm considering hiring a third person just for the warehouse side. I’m kind of a \"cost-saving\" freak, so if I have a free weekend I’ll go pack boxes myself — I actually enjoy it, it relaxes me, and it saves money too.lso, I occasionally do some consulting for businesses or friends who want to start selling on Amazon it's a nice little extra income, but I mostly like focusing on my own thing.\n\nJust wanted to share my story in case it helps anyone starting out or even someone looking to scale up. Happy to answer questions if anyone’s curious.\n\nhttps://preview.redd.it/zlokntaeuguf1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=b72ee098a39905851aff6f6d2d3252c9cbb42bfc\n\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1760181129.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Long experience narrative with lessons learned from wholesale journey.",
    "composite_score": 3.2313320857255103
  },
  {
    "score": 43,
    "title": "“Your product is too expensive” – the comment we got 47 times before we passed $69k for the first time.",
    "selftext": "Launched a new brand in a category where every top-10 listing sells for $12–$18 and gives you 30–60 counts.\n\nWe launched the 15 per count pack size at $25.99… almost 5x the price of per count.\n\nReal cost-per-count for the customer were 6–8× higher than the cheapest listings.\n\nEvery FB group roasted us: “Dead in 30 days.” “Nobody pays that much here.”6 months in:\n\n* Total sales just crossed $69k\n* Current average: $15k/mo and growing 30–40% month-over-month\n* Page 1 for our three main keywords\n* TACoS at 34% and still dropping\n\nZero big coupon blasts, zero Vine abuse, zero launch gimmicks.\n\nOnly thing we did differently:Built the listing like a real 2025 premium brand instead of another 2019 me-too copy.\n\n* 7-image stack that justifies the price in the first 3 swipes\n* A+ Content designed like a high-converting landing page (comparison charts, real user shots, no fluff)\n* Fresh UGC + lifestyle videos every month – turned a handful of micro-influencers into long-term paid ambassadors so content never stops\n* Infographics that destroy the “too expensive” objection before it’s even typed\n\n2025 Amazon doesn’t reward the highest bidder anymore.\n\nIt rewards the listing that stays fresh and converts cold traffic at 25–35% on the PDP.\n\nStill early, but the trajectory is wild. Happy to answer any questions",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1763970420.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Enumerated tactics for premium pricing and conversion success.",
    "composite_score": 2.830424352639606
  },
  {
    "score": 45,
    "title": "Bought a Private Label Company in May, Doing OK",
    "selftext": "I paid $450k for a private label producer about 6 months ago (financed with 100% debt), plus another $150k or so for inventory on hand. The company was doing about 80% of its sales on Amazon, the other 20% mostly Woocommerce. I have around 80 SKUs but it’s realistically 8-10 products that come in many different colors. \n\nI have one hero product that comes in 8 colors, with one particular color being responsible for approximately 15% of my revenue for the year. With the other 7 colors that family is worth about 30% of my revenue (and even more so my profit).\n\nOne other product sells really well, but it is in a family of other colors that sell quite poorly.\n\nAll other products just trudge along, slowly marching towards death. I also have a storage unit of dead inventory that I may just stop paying soon (ie let them sell the storage unit).\n\nWhat I’ve done since I bought the company:\n1. Combined variations. It’s madness- when I bought the company, every Amazon listing was its own ASIN with no parent/child relationships. Zero cross selling. The old owner had to pay for PPC for every single item.  I combined listings in June and started seeing the YOY benefit late July and they’ve been comparatively on fire ever since.\n\n2. Product images. My A+ content still isn’t great but I got a light box, a Canva Pro subscription, and some help on Upwork and shot 2-3 great photos for each listing. The old owner mostly had iPhone pics. Still have more to do in the A+ space.\n\n3. FBA stock. The old owner had constant FBA stockouts and frequently had FBM stockouts too. I bought the company right around when “liberation day” tariffs were coming in so I went nuts and doubled the inventory. I regret it a little bit- if not for the impending tariffs I wouldn’t have gone so overboard and now I’m holding far too much of some SKUs (but never enough of the heroes).\n\n4. New products. I added a bunch of new colors quickly- I applied all the best selling colors from the hero to the other SKUs. Some did well, most just did ok. But I’ve also been working with the product design team to develop new products and have received prototypes. Can wait for them to go live.\n\n5. Traditional advertising. I signed an agreement with an old fashioned print magazine in hopes of building my brand cache among dealers in my space, but also with customers. Goal is to get more pricing power so that I have enough margin to bring on dealers. My product is one that still sells well in brick and mortar, but I’m a nobody compared to the big players so just trying to nip at their heels. I also signed up for a big industry trade show in January. Between the print ads and the trade show it’s a $70k investment.  Nothing has gone live yet but will be coming out in December (I know, I know… wish I started earlier but it took me a while to get my feet under me).\n\n6. Added a 3PL for FBM and website orders. Packing and shipping is a waste of time and 3PLs are comparatively cheap.\n\n7. Social media and email marketing. I brought the social accounts back to life though I’m a total noob at it, and started email marketing (for my off-Amazon sales) which was never done before, but I’m also a noob here too so it’s a slow start.\n\nPerformance:\nWhen I bought the company, trailing twelve months revenue on Amazon was at $440k and it was down 8% YoY. The peak for this business in 2020 was $1.4m. So I knew I was buying a fixer-upper, and I’m seeing benefits (from the screenshot I’m now at TTM of $526k, long way to go but happy to see the trend in the right direction.\n\nI’ll make another post at the 1 year mark, hopefully with great news but worst case, my advertising initiatives will fail and I’ll have to swallow my pride and accept that this business may never get back to the $1m+ it used to do and just treat it like a passive investment (right now I spend too much time on it due to the upcoming initiatives).\n\nOkie dokie… roast me. I’m still new to Amazon and this is literally the first business I’ve owned. I spent 20 years at a corporate job then burned out and decided to try this for a year or two.\n\nNote: Product is firearm-adjacent, which makes it almost impossible to sell anywhere except the US. I tried adding Brazil but spent weeks talking to an import specialist and gave up. Might try again in the future. Europe is so heavily regulated I can’t imagine it’d work there but who knows what the future holds. I do sell around $1-2k/mo on eBay and $6-8k/mo on my website.\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1763774803.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Step-by-step actions taken after acquiring a company; clearly sequential.",
    "composite_score": 3.106336847352684
  },
  {
    "score": 44,
    "title": "Should I keep importing from China with these massive Trump tariffs hitting hard?",
    "selftext": "Hey everyone,  \nI’ve been selling on Amazon for a few years now, mainly in the home and kitchen niche. Last year we did just over $1M in revenue with around 45% profit margins. This year, in under 4 months, we’re already at $400K in sales.\n\nNow with these new Trump tariffs rolling out, with going over 100%, I’m really not sure how to proceed.\n\nThe increased costs are definitely going to take a serious bite out of the bottom line. We ran the numbers and we’ll still be profitable even with the new tariffs, but the margins will obviously take a big hit. So far this year, we’ve done around 35,000 orders, so restocking is constant and not something we can delay for long.\n\nAt the same time, I’m worried about not continuing to send large shipments into the U.S., because a few of our top ASINs are ranking really high and I don’t want to lose momentum or risk dropping rank. Over 80% of our sales come organically (of course supported by PPC), so I’m hesitant to slow things down even for a bit.\n\nMy freight forwarder in China mentioned that there might be a loophole in the works that could help lower the impact of these crazy tariffs, but it’ll take time for that to be fully usable or reliable.\n\nJust wondering, is anyone else dealing with this at a similar scale?  \nAre you planning to keep importing despite the hit, or are you exploring alternatives?  \n  \nWould love to hear any strategies for mitigating this (legally), or insights into how long this situation might realistically last.\n\nThanks in advance , really appreciate any shared experience",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1744394622.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Open-ended request for strategies on tariffs; lacks substantive content.",
    "composite_score": 3.2313025007672875
  },
  {
    "score": 42,
    "title": "CASE STUDY: Everything we did to take $18k/mo store to ~50k with Amazon Ads",
    "selftext": "Here are the latest results from a client I've been working with, along with key takeaways you can apply to your own Amazon business.\n\n**Client Background &amp; Results:**\n\nWe began working together in June, and within the first month, we grew from $18k to $31k in sales. By the second month, we reached $56k in sales. Our initial focus was on driving top-line revenue and building ranking in a competitive niche. \n\nhttps://preview.redd.it/ubhz863axlud1.png?width=740&amp;format=png&amp;auto=webp&amp;s=0edfcca61ab048d1508df719c2471d23c6c57434\n\nWe're looking to beat July's sales in October, and are set up good for upcoming Q4.  \nThe graph below shows downtrend since it's still middle of October.\n\nhttps://preview.redd.it/ijmbusf0tlud1.png?width=1488&amp;format=png&amp;auto=webp&amp;s=e67b67ff9f2c8464b38db2046cb00c3f7babf0a4\n\n**Key Fundamentals You Can Apply to Your Amazon Products:**\n\n**1) Campaign Structure  -** 80% of the campaigns I manage are single-keyword campaigns—and for good reason. One of the biggest mistakes sellers make is mismanaging placements, which leads to inefficient PPC optimization. By structuring your campaigns this way, you can optimize placements more effectively (I've detailed this further in the post below).\n\n  \n[https://www.reddit.com/r/FulfillmentByAmazon/comments/1bw8y5d/many\\_amazon\\_sellers\\_mismanage\\_their\\_ppc\\_with\\_the/](https://www.reddit.com/r/FulfillmentByAmazon/comments/1bw8y5d/many_amazon_sellers_mismanage_their_ppc_with_the/)\n\n  \n2) **Budget allocation** - at least half of your budget should be focused on ranking campaigns targeting your most relevant keywords. The sales generated from these campaigns is what drives your organic growth.\n\n  \n3) **Wasted Ad Spend - a** common source of wasted ad spend comes from running too many broad or automatic discovery campaigns without proper negative targeting. To minimize wasted spend, limit your budget for these campaigns and implement strong negative targeting to keep waste at a minimum.\n\nhttps://preview.redd.it/1b5ogluctlud1.png?width=1026&amp;format=png&amp;auto=webp&amp;s=94537d644bf5b999edef96857b7329b3413a82b3\n\n4) **Ranking Campaigns -** don’t be afraid to run ranking campaigns at a higher ACoS than average. For example, one of our campaigns ran at an \"unprofitable ACoS\" but helped us achieve strong product ranking and significant organic sales growth.\n\nhttps://preview.redd.it/bfvkayaetlud1.png?width=1302&amp;format=png&amp;auto=webp&amp;s=53e94b7cec7cded046c993157f49e59a2bac18d1\n\n5) **Bids &amp; Placements -** proper bid and placement optimization is the main lever in Amazon PPC. I recommend optimizing your ads 2-3 times a week and monitoring certain campaigns daily. Keep a close eye on your organic ranking and overall sales performance. Analyze weekly trends and adjust your campaigns accordingly.\n\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1728861832.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.79,
    "category_rationale": "Case-study style with 3 actionable Amazon ad optimization items.",
    "composite_score": 2.949014085107427
  },
  {
    "score": 43,
    "title": "Road to $2M YTD after Listing Suspension. Scaling Month after Month.",
    "selftext": "One of my clients had the worstt June ever. Amazon randomly suspended a couple of their main listings and everything just got straight-up removed. Sales went from normal to nothing overnight.\n\nWhen the listings finally came back - we basically had 0 ranking on all of the keywords, so i treated it as a full relaunch.\n\nHere’s everything I did to turn it around:\n\nThe first thing we did wasn’t “blast ads everywhere.” That’s where most sellers screw up after a suspension or any downtime. They panic and try to brute force their way back with higher bids and way too much spend. \n\nWe have not used any of the AI tools either, that reduce your bid because ‘ACoS is too high’, resulting in you losing your impression and leaving you wondering why your Amazon business is down 20% over last month. (idk why people use AI to manage ads if it still sucks creating basic videos lol).\n\nAnyways, what I actually did was to find our ‘hero’ keywords that had the most spend/sales and high conversion - double down on these in the beginning and expand towards the end of the list, starting with the highest conversion. \n\nIt’s the exact same process I use to find the root cause breakdown of anytime our sales are trending down.   \n  \nSoftware of choice?   \n  \nAdlabs.\n\nI use Adlabs to help me manage the accounts. I keep fixed bidding on 99% of the campaigns (anything with ‘down’ or ‘up-down’ will leave your ads at the mercy of Amazon to decide whether to show up your campaign  on high-converting Top-of-Search/Rest-of-Search or waste ad budget on Product-Pages placement). \n\nWhat saved up the most money? Dayparting. The product’s peak period is 10am-12pm, and the worst hours are night hours (like for most products). With dayparting set up through Adlabs we were able to show our ads at highest converting times. \n\nLet’s not forget the AMC audiences,, and the things you actually want to ‘over-bid’ on, such as people opening your product page multiple times, brand store visitors but those who didn’t buy etc.. these audiences have been working consistently for me at 30% ACoS or less. \n\nThe biggest PPC win right after the listings came back was catching new keywords early. \n\nAmazon starts testing your product on random searches as soon as traffic comes back, and most sellers don’t even notice. I do the opposite - I dig into every new term that just got a sale or two, grab the promising ones, and throw it under Broad Match Modified ad the same day. \n\nThose BMM campaigns ended up generating more orders for these new keywords and getting our product to rank fast.\n\nWe also watched organic rank every few days. Whenever I saw Amazon giving us good signals (like suddenly ranking a bit higher out of nowhere), I boosted that keyword on purpose - little extra push, not crazy aggressive. That timing is super important. If you boost the wrong keyword at the wrong time, you’re basically paying to stay stuck. But if you push when Amazon already “likes” the listing, you climb way faster and way cheaper.\n\nThe biggest unlock was single-keyword campaigns with placement optimization based on conversion. I only push placements for the highest converting spot, not all three like most ppl do. And once we found the winning placement, everything started compounding. Lower CPC, higher CVR, more stability, better spend efficiency, and the organic ranking followed it like a shadow.\n\nSince July, the account has basically been on steroids with clean upward slope. (ngl June stressed me out too lol). The crazy thing is they’re now doing more monthly revenue than before the suspension - with better ads and healthier TACoS.\n\nHonestly, if more sellers just stopped using random AI tools to auto-adjust bids, actually checked their organic rank, used fixed bidding, and pushed the right keywords at the right moment… most of their “PPC problems” would disappear. \n\nIt’s not complicated, it’s just a lot of people don’t know what to look at or what to ignore.\n\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1765480259.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.86,
    "category_rationale": "Step-by-step-like sequence of actions to relaunch and recover after suspension.",
    "composite_score": 2.7279376786541967
  },
  {
    "score": 45,
    "title": "Was just given ownership to a store that does 150k a year",
    "selftext": "Long story short - I work for a manufacturer who’s products used to be sold exclusively through an outside Amazon seller. They wanted out and it landed on my lap.\n\nI created my seller central account, it’s all verified. I transferred all the listings over and deleted the old ones. I have made a quick V1 storefront. No ads or campaigns running, no A+ content, the listings are a bit of a mess with old photos and dated descriptions. The previous seller has separate listings for separate quantities of the same product (listing #1 is 1pc of item TEST, listing #2 is 2pcs of item TEST and so on). I am working on making product variations so all the different quantities will be under the same listing (is this a smart move?)\n\nThe previous seller said he spend about 3 hours a week on the store - very much so autopilot.\n\n\nThe overall question - if you were in my shoes, what would be your order of operations? I have a small amount of Amazon experience, good bit of ecomm experience. Everything regarding fulfillment is taken care of ",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1746737978.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Mostly a request for guidance with limited substantive content.",
    "composite_score": 3.0984386785987104
  },
  {
    "score": 20,
    "title": "How Chinese Sellers Are Beating US Sellers on Amazon?",
    "selftext": "I’ve been noticing a huge shift on Amazon lately — Chinese sellers are dominating a lot of categories, and it’s getting harder for US-based sellers to compete.\n\nFrom what I’ve seen, there are a few main reasons behind this:\n\n1. **Low Production Costs** – They manufacture products at a fraction of what it costs US sellers, so their margins are naturally higher.\n2. **Fast Copying Ability** – Once they see a product doing well, they replicate it quickly — same design, same packaging, sometimes even better QC — but at a much lower price.\n3. **Review Strategy (**[VVRO Method](https://www.reddit.com/r/AmazonFBA/comments/1o0dri2/how_i_create_vvro_very_very_real_orders_for_my/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)**)** – Rather than pouring all their budget into ads, many focus on building review velocity through agents and coordinated orders. That spike in verified purchases and reviews quickly boosts rank, which makes it really hard for organic US sellers to catch up.\n\nOn the flip side, many US sellers are making a couple of critical mistakes that let this happen:\n\n* They **assume Amazon’s algorithm or enforcement will protect them** — some even say they’ll “get Section 3” or that Amazon will just remove the fakes. But they misunderstand how the ranking algorithm and marketplace dynamics actually work. A big review spike can catapult a listing before any enforcement action happens.\n* They’re **too slow to respond** — slow product updates, slow pricing adjustments, slow marketing. By the time they react, the listing’s already entrenched.\n* They often **focus solely on ads** and neglect other ranking levers and customer experience optimizations that matter long-term.\n\nI already posted before about how VVRO works and — whether you call it breaking Amazon rules or not — the reality is this: it’s being used as a tactic to beat competitors. I don’t frame it as “breaking Amazon,” I frame it as “beating your competitor at their own game.” And honestly: \n\n\"If you don’t eat the lion, it doesn’t mean the lion won’t eat you\".\n\n\n\n",
    "subreddit": "AmazonFBA",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1761143367.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Explanatory analysis of why Chinese sellers beat US sellers with supporting points.",
    "composite_score": 2.6215960952103337
  }
]