[
  {
    "score": 188,
    "title": "I got 100K downloads in one day to my AI for kids app",
    "selftext": "I run a kids app (Askie - AI for kids). December was going normally, then suddenly Apple Analytics showed 100K downloads in a single day.\n\nAll from Germany. Source: \"Institutional Purchase\".\n\nThe weird part? Almost none of these users created accounts in my app. \n\nMy assumptions:\n\n* A school district or government org bulk-deployed via Apple School Manager\n* Users might not need to sign in if the institution configured it that way\n* The downloads are \"real\" but the users may never actually open the app\n\nMy questions:\n\n1. Has anyone experienced this before?\n2. Is there any way to find out WHO made the institutional purchase?\n3. Can I contact Apple to get details about the organization?\n4. Do institutional purchases typically result in actual usage, or do apps just sit on managed devices?\n\nThis could be a huge B2B opportunity if I can figure out who they are. Or it could be nothing. Any insights appreciated.\n\n",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 188,
    "downs": 0,
    "created_utc": 1767300186.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for insights about a bulk institutional download scenario rather than providing a list or model.",
    "composite_score": 3.782746892222212
  },
  {
    "score": 180,
    "title": "I scaled 6 B2C apps to $48,000/month. Here are 12 things I learned the hard way.",
    "selftext": "Every time I launched a new app, I thought *this* would finally be the one where everything goes smoothly.\n\nNever happened.\n\nBut after 6 B2C apps and hitting $48K MRR combined, I noticed the same patterns repeating both the wins and the failures.\n\nHere are the **12 lessons I wish someone had slapped me with earlier:**\n\n\n\n# 1. Ship before you’re ready\n\nYour “perfect” version will always be 3 months away.  \nUsers can’t pay for an idea in your head.\n\n# 2. Solve real pain\n\nIf people aren’t complaining about it daily, you won’t grow.  \nPainkillers win. Vitamins struggle.\n\n# 3. Simplicity always sells\n\nUsers don’t want “powerful.”  \nThey want “obvious.”\n\n# 4. Speed &gt; polish\n\nThe market moves too fast to waste 4 weeks picking a shade of blue.\n\n# 5. Users want a fresh start\n\nGive them a reset button, a progress tracker, a clean slate.  \nPeople love feeling like they’re improving.\n\n# 6. Influencers work\n\nMicro-influencers especially.  \n200 engaged followers &gt; 20,000 silent ones.\n\n# 7. Feedback is everything\n\nYour users will write your roadmap for you *if you let them*.\n\n# 8. Hard paywalls work\n\nStop being scared to charge.  \nFree users drain your servers, not your Stripe account.\n\n# 9. Tell everyone what you’re building\n\nBuilding in silence = growing in silence.\n\n# 10. Retention &gt; Sales\n\nIf people don’t come back, your marketing budget becomes a bonfire.\n\n# 11. ASO is overrated\n\nMarketing &gt; Development.  \nDistribution &gt; Features.\n\n# 12. Start now\n\nYou’re not early.  \nYou’re not late.  \nYou’re just delaying.\n\n\n\n# The funny thing?\n\nEvery time I ignored these rules, my apps struggled.  \nEvery time I followed them, growth came easier than expected.\n\nIf you're building an app in 2025, I hope this saves you a few months (and a few burnouts).",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 180,
    "downs": 0,
    "created_utc": 1765461169.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Contains a numbered list of 12 actionable lessons learned from building apps.",
    "composite_score": 3.8152766148834414
  },
  {
    "score": 138,
    "title": "I cant believe it!",
    "selftext": "Hey everyone,\n\n\n\nI just wanted to share a small (but huge for me) milestone. This Week I launched my App in the apple Appstore and also I got my **first real paying customers** for something I built completely on my own!\n\n\n\nSeeing those first paid trials pop up, actual people paying real money for something I made, is surreal. For the longest time, I thought I was the only one dealing with these budgeting frustrations. Building the app started as a personal tool, and now it’s helping others enough that they’re willing to support it financially. That means more to me than I can explain.\n\n\n\nI know the numbers are tiny, but I’m honestly proud of myself for sticking with it long enough to get here.\n\n\n\nThanks for letting me share this win. ❤️\n\n\n\nIf anyone is working on a project and doubts themselves: keep going. That first user who pays, downloads, or even sends you a message can change everything.\n\n  \nIf anyone want to checkout my App and give me some feedback would also be appreciated: [LeanBudget](https://apps.apple.com/ch/app/leanbudget-finanzplan/id6754504678) ",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 138,
    "downs": 0,
    "created_utc": 1764076792.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal milestone post with no actionable content or explained model.",
    "composite_score": 3.83975730969342
  },
  {
    "score": 115,
    "title": "My friend died from smoking. I decided to build an app to help myself quit.",
    "selftext": "Two months ago, a close friend of mine passed away from lung cancer. What shocked me the most was how fast everything happened. He went for annual health checkups every year and everything always came back “normal”. Then one day, he was diagnosed — and just three weeks later, he was gone. He left behind everything he had built in his life: his wife and two young daughters.\n\nThat hit me hard. I’ve been smoking for about 10 years. Around half a pack a day. I also do regular health checkups, and just like him, everything looks fine. But after what happened, I couldn’t stop thinking: what if it happens to me too? I don’t want to disappear that quickly because of cigarettes.\n\nI’ve tried quitting many times using willpower alone, and I always failed. I also didn’t want to use medication or see a doctor — not because I think they’re wrong, but because deep down I didn’t want to see myself as “an addict”.\n\nWhen I felt the most desperate, I stumbled onto a very simple idea — something close to mindfulness in Buddhism. Instead of trying to quit, I started **paying attention**.\n\nI took a notebook and wrote down every cigarette:\n\n* when I smoked\n* how many\n* why I smoked\n* how I felt afterward\n\nThat’s it. Nothing else. No pressure to quit. After about two weeks, something unexpected happened. I realized how much **time** I was wasting on smoking. Every cigarette meant going out to the balcony and standing there for about 5 minutes. When I added it all up, I was spending almost **an hour every day**, and nearly **6 hours a week**, just smoking.\n\nWriting down the reasons helped too. I started noticing clear triggers:\n\n* arguments with coworkers or my wife\n* after dinner\n* drinking alcohol\n\nI could *see* cravings coming before they hit. This didn’t make me quit overnight. But it changed how I *felt* about cigarettes. They stopped feeling like a “small joy” or a reward. They started feeling… unnecessary. The number of cigarettes I smoked dropped naturally. From about 10 a day to around 3–6.\n\nThe problem was that writing everything down was exhausting. I looked for apps, but none of them really fit what I needed. So I built one for myself. It’s extremely simple. One button per cigarette. That’s it. From there, I can see my data for today, this week, this month, this year. To strengthen my willpower, I added a small goal system. After each cigarette, I set a goal like “wait at least 2 hours before the next one”. At the end of the day, I can see how many times I succeeded — and how many times I failed.\n\nFor me, this has been the only method that actually works without medication or doctors. Doing this every day slowly changes your subconscious. It changes how you perceive smoking. I truly believe most of us can’t quit because deep down, we don’t really want to. We’ve associated cigarettes with comfort and relief, instead of seeing the real danger behind them.\n\nYou can absolutely do this with pen and paper like I did at first. But if you want something more convenient, you can try the app I made. It’s completely free, and all data is stored locally on your phone. I’m not trying to sell anything. I honestly just don’t want to see more people end up like my friend. I’d really appreciate any feedback or suggestions so I can improve it for people who are trying to quit.\n\nThank you for reading.\n\n**iOS:**\n\n[https://apps.apple.com/app/6754150567](https://apps.apple.com/app/6754150567)\n\n**Android (Closed Test):**\n\nGoogle requires 13 testers. If you’re on Android, please join the Google Group first, then use the test link.\n\nGoogle Group:\n\n[https://groups.google.com/g/test-tracking-smoker](https://groups.google.com/g/test-tracking-smoker)\n\nTest link:\n\n[https://play.google.com/store/apps/details?id=com.quanghuy9742.expotrackingsmoker](https://play.google.com/store/apps/details?id=com.quanghuy9742.expotrackingsmoker)",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 115,
    "downs": 0,
    "created_utc": 1765856160.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Offers a personal narrative and mental-model for quitting using mindful journaling.",
    "composite_score": 3.6157430772758863
  },
  {
    "score": 113,
    "title": "My first ever app got 100+ users! I can't believe it!",
    "selftext": "What started out as a side project for me to learn SwiftUI has turned into my first ever app on the App Store, and recently it crossed the 100 user mark!  \nIt may not seem like much compared to the other apps out there, but I personally am super excited about this achievement.\n\nIf you'd like to user a habit tracker that doesn't lie to you, but rather gives you a 'true' sense of progress (vs 'perceived' progress), do take a look at [Pact](https://apps.apple.com/in/app/habit-tracker-pact/id6748974170)\n\nAlso, I've love to hear suggestions on how I can further build on these numbers - thanks in advance!",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 113,
    "downs": 0,
    "created_utc": 1765795683.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal milestone with a request for feedback; lacks a list or model.",
    "composite_score": 3.7265207112019607
  },
  {
    "score": 115,
    "title": "My app finally made its first 30$ :')",
    "selftext": "Super excited about this. I hope my app ends up helping a bunch of people, I put a ton of time into it and to see even a small return makes me feel grateful.\n\n  \nThe app is a consistency tracker, like other productivity apps you can track habits, but I also integrated deep work tracking, because I think thats just as important for building consistency.\n\n  \nIf you guys want to check it out here's the [link.](https://apps.apple.com/fi/app/consistency-tracker/id6751214337)\n\nLets keep building!",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 115,
    "downs": 0,
    "created_utc": 1764159876.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal milestone about first revenue; no actionable framework.",
    "composite_score": 3.714128263953709
  },
  {
    "score": 107,
    "title": "My First App has received 500+ downloads organically 🥳",
    "selftext": "The first app has reached over 500+ downloads in just  less than a month! It’s a simple, user-friendly tool designed to help you create unique, custom fonts for your projects—whether it’s for graphic design, social media, or just having fun with text. I did the below things that might have helped.\n\n* Focused on ASO.\n* Multiple updates with new features.\n\nWould love your feedback on the App.  \nLink: [https://play.google.com/store/apps/details?id=com.fancyfonts.top](https://play.google.com/store/apps/details?id=com.fancyfonts.top)",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1758207418.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.6,
    "category_rationale": "Two-item list of growth actions that contributed to organic downloads.",
    "composite_score": 3.4295334028539095
  },
  {
    "score": 102,
    "title": "My Experience Developing Apps with AI",
    "selftext": "I’ll try to keep this short.  \nFirst, a bit about me: I worked as a software engineer for about 10 years. I’d say I was an average engineer. Around 2.5 years ago, I quit my job, went through a severe depression for about a year, then took another year just to rest. For the last 4 months, I’ve been trying to develop apps again — but this time, with AI.\n\nIn my latest app, the codebase reached around **15,000 lines** spread across **50 Swift files** — all communicating with each other. Having AI build that structure without me writing a single line of code was honestly a *mind-blowing* experience. It took around 25 days.  \nFor comparison, my previous app was way simpler, yet it took me more than 2 months to finish.  \nIt’s worth noting that this was my *first time* using a Mac, *first time* using Xcode, and *first time* publishing an app to the App Store. As time went on, I started understanding how to communicate with AI better and use it more effectively.\n\nNow, can someone with **no software background** build an app with AI? I’m not so sure.  \nBeing a good debugger and having years of experience solving technical problems definitely helped. Sometimes the AI gets stuck or confused, and you need to approach the issue from a different angle — something that experience gives you. Without that background, I don’t think I could’ve done it.\n\nAI drastically shortens development time — but it still takes a *lot* of time.  \nIf you’re working solo, you have to handle everything yourself.  \nMy estimate: something that used to take 7–8 months can now be done in under a month.  \nBut even that one month is *intense*. I probably spent around 90–100 hours on it.  \nI’m sure my next app will be much faster to develop.\n\nOne thing I’ve learned: building a *simple tool* for your own use is easy now, but taking it all the way to a *product* is still really hard.  \nFunctionality, UX, UI, configuring your App Store Connect product, testing — it’s all very time-consuming. Doing it all alone can get overwhelming.\n\nAnd no — I haven’t made any money yet :)  \nNow I have to learn *marketing* too.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 102,
    "downs": 0,
    "created_utc": 1760365407.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Reflective explanation of building apps with AI and the associated time/effort.",
    "composite_score": 3.6133388965225715
  },
  {
    "score": 89,
    "title": "I am proof that if you keep building and shipping, eventually someone will say yes",
    "selftext": "I got my first paying customer today\n\nOne subscription to BlinkDo, my Books to Action app\n\nRevenue: $10\n\nBut the money isn't the point\n\nFor months, I've been:\n\n* Building in silence\n* Doubting if anyone would care\n* Wondering if I should just give up\n\n**Then someone I've never met hit \"subscribe.\"**\n\nThey believed in what I built before I fully believed in it myself\n\n**Here's what I learned:**\n\nYour first customer isn't buying a perfect product\n\nThey're buying your vision, your commitment, and the problem you're solving\n\nShip it. Put it out there. Let people decide\n\nThe worst that happens? You learn what doesn't work\n\nThe best that happens? Someone says yes\n\n**Today, someone said yes**\n\n  \n[https://play.google.com/store/apps/details?id=com.blinkdo](https://play.google.com/store/apps/details?id=com.blinkdo)\n\n[https://apps.apple.com/in/app/blinkdo/id6752018225](https://apps.apple.com/in/app/blinkdo/id6752018225)",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1763797559.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Narrative with a takeaway about shipping and validating with a first customer.",
    "composite_score": 3.617279910789738
  },
  {
    "score": 79,
    "title": "Found an iOS app making $9 per download with less than 3K users",
    "selftext": "Just discovered Sutara: Buddhist Stories sitting at #86 in iOS Reference revenue charts.\nThe numbers:\n\t•\t&lt;3K total downloads\n\t•\t$9K revenue\n\t•\t$9 per download (!)\n\t•\tLaunched 2 months ago\n\t•\tOnly 47 reviews with 4.0⭐ rating\n\nThis is exactly the type of low-competition, high-revenue niche that most developers overlook. Reference category apps often have incredible monetization but get ignored for flashier categories.\nAnyone else finding success in “boring” categories like Reference, Productivity, or Utilities?​​​​​​​​​​​​​​​​\n",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1753350077.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Case study-like post highlighting high revenue per download and implications.",
    "composite_score": 3.466179973983887
  },
  {
    "score": 78,
    "title": "First app, and first users :)",
    "selftext": "Ever since I was in college, I was looking for silly ways to make money without much effort, I've lurked this subreddit for far too long for app ideas hehe\n\nI'm a student and have tried a million flash card websites, but I liked only one of them. I could add my lecture notes PDFs into it and it would create flashcards using AI. But I didn't know of any mobile app at the time that would do the same. \n\nI'm not exactly a programmer, just have the ideas of basics of python. I vibecoded the whole app using vibecodeapp in 5 days, tweaked things around and refined the prompts for flash card generation till a point it works well.\n\nIt's not exactly the best, but I thought I'd keep on improving it. I've had 2 random subscribers now, making 6$/month doing no effort hehe. It's not enough money to quit my real job and pursue this fulltime but it's a start to some journey I feel. \n\nI'm not exactly successful but from what I understand, a little tip for people trying to do this, is if you publish mobile apps you don't exactly require a groundbreaking idea, sometimes just fixing your own little problems would do the job as long as you figure some way to distribute. Then sit back and watch the 10s of dollars flow ",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1765390702.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Personal app idea/story plus a single actionable takeaway about fixing small problems and distribution.",
    "composite_score": 3.3708079382075775
  },
  {
    "score": 76,
    "title": "How much can I realistically sell my app",
    "selftext": "I built the app about a year ago just for laughs but only started posting about it 4 months ago and the revenue you see has been largely stable since. Even though the mrr is what you see, I often make about double that (I get about one lifetime purchase every month which is not included). What multiple would be fair and pragmatic.\n\nUPDATE - This post is getting a lot more attention than expected. For those who might actually be interested in acquiring, I listed the app on Microns and Acquire (Microacquire) and also added a link to the app below\n\nAppstore - https://apps.apple.com/nl/app/langua-ai-language-tutor/id6651852422?l=en-GB\n\nMicrons - https://app.microns.io/buyer/listing?listing_id=4981853152847589\n\nAcquire - https://app.acquire.com/startup/gqE5lpDe7tgxfu5wuY5KCArkqEt2/YRL0DDqW9zSF4OHSK7gI?source=marketplace",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1765966898.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains app valuation and potential sale multiples with examples.",
    "composite_score": 3.4694167309935535
  },
  {
    "score": 69,
    "title": "Anyone want to buy these apps from me",
    "selftext": "Just what the title says, cofounder and I went our separate ways in march of last year after releasing them in january and february and they have just been sitting. I log on to app store connect every now and again and im always shocked that they are still pulling in a little money each month. Keep in mind the numbers posted are YTD revenue, last month they did a combined $34, combined $56 so far in november, $40 in september, $91 in august, you get the gist. Nothing crazy by any means but we havent made an effort with them since march of this year and they just sit, so figured id throw it out. ",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1763170972.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Sales-oriented post pitching the sale of apps; not a how-to or explanation.",
    "composite_score": 3.5043395142912246
  },
  {
    "score": 70,
    "title": "Finally got my first paying user after weeks of 0 revenue 🔥",
    "selftext": "I launched my app *Roast App: Roast Battle* a few months ago, and today I made my first **yearly plan sale ($21)**!\n\nHere’s a quick breakdown (past month):\n\n* Impressions: 1.5K\n* Product Page Views: 105\n* Conversion Rate: 5.23%\n* Downloads: 60\n* Crashes: 0 🙌\n\nFor a solo dev project with zero marketing, does this look promising or average?  \nI’d really appreciate honest feedback — both on my **App Store listing** and the **app’s UI/experience** itself.\n\nApp link for context 👉 [https://apps.apple.com/us/app/roast-app-roast-battle/id6751084596](https://apps.apple.com/us/app/roast-app-roast-battle/id6751084596)",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1761536408.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Narrative with early success metrics and request for feedback; lacks a process or model.",
    "composite_score": 3.3244391956362116
  },
  {
    "score": 65,
    "title": "Three dead apps at $0, fourth app passed $4.5K MRR once I stopped coding first and started validating like a grown-up",
    "selftext": "My first three apps were beautiful, polished, and completely useless. Six months of coding each, pixel-perfect UI, clever features I was proud of—zero paying users, zero revenue, zero traction. I never spoke to a single real user before building. I just trusted my \"product instincts\" and whatever seemed to be trending on Twitter and Product Hunt. Classic technical founder mistake repeated three times.\n\n\n\nThe turning point was studying real app founders who shared exactly how they got from 0 to 1,000 users with receipts: 20-30 customer interviews upfront before writing code, shipping ugly one-feature MVPs in 2-3 weeks not 6 months, multi-platform launches across 20+ directories not just App Store, and doing manual onboarding calls with the first 50 users to understand confusion points and actual needs.\n\n\n\nFor app #4, I forced myself to follow that exact pattern instead of jumping straight into code like always. Execution looked completely different: spoke with 32 people in my target niche (freelance marketers struggling with client reporting) about one specific pain point, killed two different ideas in week one before writing a single line of code because fewer than 10 people would commit to paying, finally validated a third idea where 14 people said they'd pay $19/month, then built just one core feature in 2.5 weeks using a React Native boilerplate instead of reinventing authentication and payments infrastructure for the fourth time.\n\n\n\nLaunch strategy was systematic not heroic: posted problem-first content in 5-6 relevant Reddit and Facebook communities before ever mentioning I had a solution, submitted to 20+ app directories and startup listing sites over 2 focused weeks, personally onboarded the first 40 users via 20-minute Zoom calls while furiously tweaking onboarding flow every few days based on where they got confused or dropped off.\n\n\n\nTimeline and numbers: month 1 had 19 paying users at $19/month ($361 MRR), month 3 reached $1.7K MRR after implementing annual pricing, month 8 hit $4.5K MRR with monthly churn under 4% because I'd built something people actually needed.\n\n\n\nThe app itself wasn't dramatically better than my failed ones. The difference was entirely the process: validate with real conversations, build the absolute smallest version that solves one problem, launch everywhere relevant systematically, and learn directly from the first paying users instead of guessing in isolation. All borrowed from founders in [FounderToolkit](http://foundertoolkit.org/) who were generous enough to share their exact playbooks, metrics, and timeline breakdowns publicly.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.73,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1766642475.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Detailed step-by-step process to validate ideas and reach 1k users; a clear playbook.",
    "composite_score": 3.1327833940629963
  },
  {
    "score": 64,
    "title": "Launched my first app two days ago. And people actually paid for it!!!",
    "selftext": "For context, I launched my first app on the mac app store two days, wasn't expecting any sales for maybe after a while, but people actually paid for it. Not just that, I had 16 IAP (that's a conversion of almost 14%). I charge $20 for lifetime and $1.99/monthly with 14 days trial. I got people saying the price is too high for a video player, so I was considering reducing the price, but with this numbers, do you think I should still reduce the price, or just wait and see?\n\nAnd what advice would you give to improve the downloads number?",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1765765703.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.56,
    "category_rationale": "Early sales data and pricing questions; lacks structured guidance.",
    "composite_score": 3.3528051549512607
  },
  {
    "score": 62,
    "title": "🎮 Selling My Mobile Game Portfolio (iOS + Android) — $2.7k Monthly Profit 💰 For Sale",
    "selftext": "Hey everyone,\n\nI’m putting up for sale my cross-platform mobile game portfolio (iOS + Android). Both versions are established, profitable, and have strong foundations:\n\n📱 **iOS Version (100% Organic Growth)**\n\n* Lifetime: 282K+ downloads since 2023\n* Last 12 months profit: **$11.6k**\n* Avg monthly profit: **$966**\n* Traffic entirely organic via ASO (no paid UA ever)\n* Zero expenses (no APIs, no servers)\n* Minimal workload — only light updates needed\n\n🤖 **Android Version (Paid UA with Positive ROI)**\n\n* Lifetime: 7.83M+ downloads\n* Last 12 months profit: **$21.1k**\n* Avg monthly profit: **$1,762**\n* Runs paid install campaigns via **Mintegral ad network**\n* ROI since March has stayed strong: **1.54×–1.68×**\n* Ad monetization + IAP mix, scalable with additional budget\n\n📊 **Combined Portfolio (TTM – Aug ’24 to Jul ’25)**\n\n* Total profit: **$32.7k**\n* Avg monthly profit: **$2,728**\n* 2.1M+ lifetime downloads across both platforms\n* Organic + paid growth mix → stable + scalable foundation\n\n**Why selling?**  \nI’m shifting focus to new projects and don’t have the bandwidth to scale this one further. With its organic iOS base and proven paid UA funnel on Android, the portfolio is in a great position for someone looking to operate or grow further.\n\n💵 **Asking Price: $68k** (≈25× monthly profit TTM, open to offers)\n\nDM me for serious inquiries — I can share full dashboards, campaign data, and retention metrics.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 62,
    "downs": 0,
    "created_utc": 1755690167.0,
    "media": null,
    "is_video": false,
    "num_comments": 189,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Selling a portfolio with metrics; asset listing.",
    "composite_score": 3.6812173499299963
  },
  {
    "score": 60,
    "title": "3 months of hard work gone to waste",
    "selftext": "Hey everyone,\n\nI recently developed a makeup app that took 3 months of solo development. This was my first solo app project. \n\nIt got approved within the first week of submission to the App Store and started doing well. Slowly, I began getting downloads, and within one week of being on the App Store, I had already made $180 through subscriptions.\n\nI submitted an update (version 1.0.1), which was approved after going back and forth with App Store Review a couple of times. The app kept gaining more downloads, and within the first 3 weeks, it reached $900 in subscription revenue (keep in mind, my marketing on TikTok and Instagram was going crazy viral).\n\nThe problem occurred when I submitted a new update (version 1.0.2). It got rejected under Guideline 4.1 for being a “copycat.” Apple claimed I was copying another app. I spent two weeks going back and forth with them, until I finally had enough and scheduled a phone call.\n\nOn the call, a woman explained that my app had the same functionality and similar UI as another app — not on the App Store, but on Google Play — which I had never even heard of. She said that because my app’s functionality wasn’t broad enough, they wouldn’t accept the update unless I added multiple new features, changed the UI completely, and changed the metadata as well. Basically saying I needed to completely redevelop my app for it to get accepted, if even.\n\nI honestly don’t know what to do. She seemed extremely unprofessional, and I don’t see me working on this project for another 3 weeks just for a chance of it being accepted. Is this a failed project?",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1753468391.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.84,
    "category_rationale": "Rant about a failed update and rejection; emotional vent.",
    "composite_score": 3.4020438317922355
  },
  {
    "score": 54,
    "title": "Is anyone interested in co-founding a app with me?",
    "selftext": "EDIT: We've found enough developers, we're STILL looking for marketers, if you have any marketing experience with Apps &amp; WebApps, please reach out to me, we'll provide you with good equity, we ONLY need marketers! Thank you!\n\nHi guys, I'm in need of someone who's a little bit experienced with apps, I can develop the app itself, we can brainstorm and come up with something and I just need help with deployment and marketing, of course I'll work with you, but I'm in need of someone who's a little more experienced than me! Please do DM me, I'm very friendly and inviting 😙\n",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1759750551.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.63,
    "category_rationale": "Seeking a co-founder/marketer; collaboration request.",
    "composite_score": 3.430122315803553
  },
  {
    "score": 53,
    "title": "What are you building? Let’s promote each other 🚀",
    "selftext": "I'll go first I’m building [Contactjournalists.com](http://Contactjournalists.com) a simple way for founders to get press without hiring a PR agency.\n\nIf you’ve got a startup or SaaS project, it helps you:\n\n* Find real journalists who are already looking for stories\n* Get featured in blogs, magazines, and podcasts that fit your niche\n* Save time chasing replies and tracking outreach\n\nWhat are you building right now? Drop your link or one line about it — let’s all give each other a boost 🚀",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1762079035.0,
    "media": null,
    "is_video": false,
    "num_comments": 126,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.66,
    "category_rationale": "Promoting others' projects and inviting mutual promotion.",
    "composite_score": 3.511795620300947
  },
  {
    "score": 51,
    "title": "Hit 1,000 users on the calories tracker app I built with my wife - $0 ad spend",
    "selftext": "Just noticed our little tracking app crossed the 1k user mark and honestly I'm pretty stoked on this because we've spent $0 on ads. The whole thing costs me about $10/mo to keep running.\n\nSome cool stats I pulled from the db:\n\n* Over 950K calories logged\n* 3520+ entries\n* An average of 38 entries/day\n* An average of 261 calories/entry\n\nI'm building this app with my wife, who is an MD. We wanted to make something that was  useful. We have plans to leverage her medical background to add more deep health and science-based features soon, but for now, we're just happy providing a simple, free utility to the community.\n\nJust a reminder that you don't always need a massive marketing budget. Sometimes building something simple is enough.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1767605927.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Share a bootstrapping success story with a general takeaway, not a step-by-step guide or a list.",
    "composite_score": 3.144702342584277
  },
  {
    "score": 51,
    "title": "Used TikTok to boost my app's ASO - 2k to 18k monthly downloads",
    "selftext": "I tested TikTok as a pre-launch channel for my meditation app and the results were honestly\nway better than expected. I'm seeing 3-5x more organic installs than I ever got from just\nkeyword optimization. It really feels like the App Store algo is weighing social signals pretty heavily now. \n\nUS TikTok views specifically seem to correlate with ranking boosts in competitive categories.\nI kept it super simple. Just 12-second demo clips, literally just a swipe gesture leading to \"instant calm\".I used trending audio and hashtags like #appcalm. The biggest issue was that since I'm not in the US, the FYP wasn't pushing my stuff to Americans. I was stuck at like 12% US audience share no matter what I did.\n\nI ended up switching to a geo-verified setup (used tokportal for the US device provisioning) and my audience immediately jumped to 92% US. Impressions went up 4x without spending a dime on ads.\n\n\nAlso, weird finding: \"Free Trial\" on the landing page beat \"Download Now\" by 28%. We hit category rank #47 in the US within 10 days of the TikTok account taking off. Anyone else\nusing TikTok specifically for ASO?",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1767270565.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.65,
    "category_rationale": "Describes a sequence of actions for ASO via TikTok with results, effectively a reproducible playbook.",
    "composite_score": 3.1520823593059086
  },
  {
    "score": 49,
    "title": "A little-known Chinese app studio is making ~$50M a year",
    "selftext": "the app studio is called Next Vision and they have 14 apps total with 5 of their apps (Rock Identifier, Coin Identifier, Bird Identifier and a fitness app) pulling in almost all of their revenue.\n\nTheir strategy is simple: skip brand names and name apps after exact search terms. \"Rock Identifier\" ranks #1 for \"rock identifier.\" Then they scale with paid ads. Rock Identifier alone has 180+ active ads on Facebook right now.\n\nWe've entered a new era where venture backed apps with big teams and offices are being outcompeted and crushed by small teams and even single person companies that are agile and integrate AI tools into their workflows.\n\nThe average person has barely used AI and has no idea what is happening. Teams are now launching and spinning multiple apps per month with tools like [AppAlchemy](https://appalchemy.ai/) and [Cursor](https://www.cursor.com/). The mobile apps space is beginning to look a lot more like Ecom where people can test multiple products and find and scale winners.\n\nWhat's happening right now is very big i think.\n\ni do a lot of research on apps like this and talk about it in r/ViralApps, feel free to join!\n\nhttps://preview.redd.it/ohaoxe0zl68g1.png?width=1118&amp;format=png&amp;auto=webp&amp;s=187b02aab8dc52d3a30f088f8f740360f1ad867d\n\n",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.74,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1766159194.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Offers analysis of market dynamics and a mental model of competition without a step-by-step process.",
    "composite_score": 2.8816062568876717
  },
  {
    "score": 51,
    "title": "After more than 5 years, my first Android app is starting to really feel deserving of REAL $$.",
    "selftext": "I started my android app business in January 2020. [Random Lists ](https://play.google.com/store/apps/details?id=peakvalleytech.randi)was my first app. \n\nI grinded it out for the first year without it making any money. Even after the second year, I was only beginning to start to monetize it. \n\nInitially, i was thinking about monetization. I was just so passionate about the app that i just wanted it to exist for myself. After two years, I started to monetize it. But progress was slow and only a few dollars a month. \n\nBut at the end of my 3rd year in 2023, things started to take off. The app was getting hundreds of users a month. And finally started seeing $. \n\nSince then it has been pretty steady, with the app generating consisten revenue. \n\nSo far this month, my entire app business is having one of the best months so far. \n\nThere were times when I felt like giving up. \n\nBut with a bit of passion and the support of users anything is possible.\n\n**I want to thank every users that has supported my dream. I would not be here writing this if not for each and everyone of you. Thank you from the bottom of my heart.**\n\n",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1755742486.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Pure personal narrative about monetization with thanks, no actionable guidance.",
    "composite_score": 3.0380633349627617
  },
  {
    "score": 44,
    "title": "So... ChatGPT just announced monetization in Chat apps",
    "selftext": "Idk about you guys, but I think this is MASSIVE.\n\n\n\nIf you're a developer or even a semi-experienced vibe coder, you could basically hack distribution and generate revenue directly from 800M weekly users.\n\n\n\nIt's basically the golden age of monetized apps/themes in the early Shopify days all over again.\n\n\n\nSo far, I've brainstormed 12 ChatGPT monetization frameworks with my dev partner that could print IF executed well, y'all will lmk what you think.\n\n\n\nBuyer Agent :\n\nPost-purchase apps that keep customers hooked, getting the most out of the product, reorder reminders, cancel preventers, and limit refunds/returns.\n\n\n\nData-for-Dollars:\n\nLead magnet quiz apps you license to brands - they capture zero-party data, you externalize the solution.\n\n\n\nInfluencer Middleware:\n\n\"Shop my \\[thing\\]\" apps for creators - fans chat their vibe, get personalized affiliate recs with creator commission baked in. RIP link in bio. Chat in bio is here.\n\n\n\nApp Agency:\n\nBuild ChatGPT apps for e-commerce brands to grow revenue, ROAS, and retention, as well as create high-converting, personalized content.\n\n\n\nDiscovery Tax:\n\n\"Free\" research tools that collect pain points. A startup validator that external-checkouts aggregated market reports you compiled.\n\n\n\nExpert Matcher:\n\nSkill-matching apps that externalize checkout specialist bookings, designers, developers, and coaches from your vetted marketplace.\n\n\n\nGatekeepers-as-a-Service:\n\nAssessment tools that score users, then external-checkout the certification/bootcamp that \"fixes\" their gaps.\n\n\n\nCo-Founder Connector:\n\nNiche matchmaking apps, free to browse, paid to unlock intros via external checkout (accountability partners, masterminds).\n\n\n\nROI Theater:\n\nB2B calculators that diagnose problems, then external checkout demo calls, and commission on closed deals.\n\n\n\nDemo Liaison:\n\nInteractive product tours via chat that external-checkout expedited onboarding calls or premium setup.\n\n\n\nSymptom-to-Consult:\n\nDiagnostic apps that analyze situations, then external-checkout 1-on-1 expert sessions (financial, legal, career).\n\n\n\nWaitlist Agent:\n\nEarly access apps that take $1 deposits via instant-checkout - validate demand before building, capture waitlist.\n\n\n\n\\-----------------------------------------------------------------------------------------------\n\nWe are thinking of pausing client onboarding just to build a portfolio of these apps in the next 3 months.\n\n\n\nIf you're a killer with product distribution or have other app ideas you think could print, hit me up!",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1765963835.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Enumerates multiple monetization frameworks as distinct items.",
    "composite_score": 3.071451972296471
  },
  {
    "score": 49,
    "title": "App store reviews are literally free user research",
    "selftext": "Fellow devs, are you guys reading competitor app reviews before building features?  \n  \nJust realized I've been sitting on a goldmine of user feedback and completely ignoring it. Started systematically reading 1-star reviews of apps similar to mine and holy sh, users tell you exactly what to fix.  \n  \nNow whenever I see patterns in complaints, I immediately research how other apps handle those issues using Screensdesign since you can actually watch complete user flows. Been applying this approach to my fitness app and conversions are up huge, ngl.  \n  \nIt's literally free market research sitting in the app store. Sharing this here because honestly kind of annoyed at myself for not doing this sooner. So much wasted time!",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1756586607.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Proposes a method (analyzing reviews) as a way to gather user insight and improve features.",
    "composite_score": 2.9696663469151314
  },
  {
    "score": 45,
    "title": "Sell me your App",
    "selftext": "Hey everyone 👋\n\nI’m looking to acquire mobile or web apps generating **at least $1,000 MRR**.  \nOpen to different niches, preferably with:\n\n* Steady recurring revenue\n* Low churn and decent retention\n* Simple operations or semi-passive setup\n\nIf you’re looking to sell (or know someone who is), drop a comment or DM me with some quick details like:\n\n* Monthly revenue &amp; expenses\n* Traffic/source of users\n* Monetization model\n\nHappy to keep things confidential and quick.  \n",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1759924807.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "A request to acquire apps; lacks substantive content beyond the ask.",
    "composite_score": 3.199136747522361
  },
  {
    "score": 43,
    "title": "I added support of skills to my starter kit - Indie Kit",
    "selftext": "Hey r/AppBusiness,\n\nAfter crossing 900+ users I decided to build skills for everything that my users have asked for in my starter kit. So I built the following things in my starter kit named \"Indie Kit\"\n\nGet here: [https://www.google.com/search?q=indie+kit+pro](https://www.google.com/search?q=indie+kit+pro)\n\n**Agents** (always watching)\n\n* db-architect\n* nextjs-architect\n* typescript-specialist\n* security-manager\n* seo-specialist\n* designer\n* internal-docs-manager\n\n**Commands**\n\n* /bootstrap (full app in one shot)\n* /add-feature (pages, APIs, DB, UI, tests)\n\n**Skills** (just mention them in prompts)\n\n* auth-handler\n* stripe-handler\n* credits-handler\n* plans-handler\n* db-handler\n* page-builder\n* ui-handler\n* copywriter\n* seo-handler\n* theme-handler\n* \\+20 more\n\nDrop a prompt like “/bootstrap AI image SaaS with credits and Stripe” and it just builds.\n\nNo more 3-day setup. Indie Kit now ships with all the pro stuff out of the box.\n\nI hope you will love the idea.\n\nThanks",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1764510947.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Lists new features and prompts in the starter kit as items.",
    "composite_score": 2.7075283016780096
  },
  {
    "score": 40,
    "title": "One thing I’ve realised after sharing my product on Reddit",
    "selftext": "I’ve been sharing a product I recently built across a few places, and something became very clear to me.\n\nReddit gives the most honest feedback I’ve received anywhere.\n\nTwitter is mostly hype.\nLinkedIn is mostly politeness.\nFriends and family are supportive but biased.\n\nReddit, on the other hand, will:\n\t•\ttell you what’s confusing\n\t•\tpoint out what’s useless\n\t•\tcall out what sounds like BS\n\t•\tand still help you improve if you’re genuine\n\nSome comments stung a bit. Some were surprisingly thoughtful. A few spotted issues I completely missed as the builder.\n\nIf you’re building something and actually want to make it better (not just validation), Reddit feels like the place where reality checks happen.\n\nCurious if others have had the same experience here.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1766218645.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Reflects on Reddit as a source of honest feedback and what it reveals about user perception.",
    "composite_score": 3.105816160232985
  },
  {
    "score": 40,
    "title": "I bult a platform for app testing and it just hit 140 users!🎉",
    "selftext": "One month ago, I launched a platform where indie devs can get their first users and testers.  \nI am now at **140 users,** **65 apps** have been uploaded and **115 tests** have been done!\n\nThe platform works as follows:\n\n* You can **earn credits** by testing indie apps (fun + you help other makers)\n* You can **use credits to get your own app tested by real people**\n* No fake accounts -&gt; all testers are real users\n\nMy strategy was as follows:  \nI posted about the platform here on Reddit and got some users. Many of them had some suggestions on what to improve. I kept implementing those and kept posting about updates and more and more users were joining. Now everyday some tests are done and it's just so fulfilling to see how an idea turns into reality...\n\nI will keep you guys updated and feel free to check it out and tell me your feedback.  \nIt's totally **free** to use: [https://www.indieappcircle.com/](https://www.indieappcircle.com/)\n\nAny comments/feedback/roasts are welcome!",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1761837328.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Narrative of platform launch with a few growth tips, offering lessons learned.",
    "composite_score": 3.1413138523837167
  },
  {
    "score": 39,
    "title": "Is anyone interested in co-founding an app with me?",
    "selftext": "Hi guys, so I recently grew my IG page to a bit over 9k followers and it’s actually getting decent engagement, and I’d really like to build something around it instead of just posting forever for free 😅\n\nI’m looking for someone who has experience with app development (exclusively someone from Eastern Europe / Europe, please do not dm or comment here unless you match with the criteria), someone chill that I can brainstorm with and then work together on building and launching.\n\nI have the audience + the vibe + the content curation angle, I just need help on the technical side so we can turn this into something real.\n\nIf you feel like this could be you — please do DM me, I’m very friendly and normal I promise 😙\n\n\n---\n\nThe app idea:\nBusiness Idea: ReelRadar – Movies but TikTok Brain Compatible\nDiscover new movies through short cinematic clips + theme-based discovery + links on where to watch (including spicy ones 👀)\n\n🧠 Core Concept\n\nProblem:\nPeople literally spend more time deciding what to watch than actually watching.\nEverything is scattered. IMDB is boring. Reddit is chaotic. YouTube trailers are too long.\nTikTok edits are cool but unorganized and you can’t save them.\n\nSolution:\nAn app that:\n\nShows TikTok-style short clips from movies/shows\n\nOrganizes everything by vibes / mood / themes\n\nLets you instantly see where to watch (official or… “uncensored mode”)\n\nLets users save movies into mood playlists like “late night crisis” or “date night”\n\n\n📱 Core Features\n\n1. Short Clip Feed Swipe through curated 10–20 sec edits, scenes, intros, vibes.\n\n\n2. Theme/Mood Discovery Examples:\n\n\n\n“Movies that awaken your villain arc”\n\n“Soft girl cozy night picks”\n\n“Films for when you hate everyone”\n\n“Main character era”\n\n\n3. Where to Watch (Including Optional Spicy Toggle) Links to:\n\n\n\nNetflix / HBO / Prime etc.\n\nHidden sources (only if toggle is ON) 😉\n\n\n4. Save &amp; Build Mood Playlists Collections like:\n\n\n\n“Watch when I’m burnt out”\n\n“Films that feel like autumn”\n\n“Girlboss meltdown cinema”\n\n\n🔥 Unique Part\n\nThe IG page grows the community → The app becomes the home for it.\n\nI already know how to get the audience, aesthetic, clips, themes, and viral angle — I just need someone who can build the actual thing with me.\n\n💸 Monetization (Simple &amp; Realistic)\n\nAffiliate streaming signups\n\nPremium: save into playlist, unlimited scroll...\n\nSponsored playlists from studios/platforms\n\nCreator curation packs (like playlist bundles)\n\n\n\n---\n\nSo yeah — if you can build apps and want to co-found something fun and cinematic with actual audience traction…\n\nDM me 🤝\nI’m super open-minded and easy to talk to.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1761461543.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Seeking a co-founder to build an app; no actionable steps or model presented.",
    "composite_score": 3.2298775886267372
  },
  {
    "score": 34,
    "title": "Why do people build habit building apps?",
    "selftext": "Why do people build habit building apps?\n\nThis might be a bit of a shower thought, but I’ve always been curious why habit-building apps are such a popular thing to build.\n\nOn one hand, habits are super personal and messy, and on the other hand there are already tons of apps that do basically the same thing. Track a habit, keep a streak, send reminders, repeat. And yet, new ones keep popping up all the time.\n\nI’m not saying they’re bad. I’ve used a few myself and some of them genuinely helped, at least for a while. I just wonder what keeps pulling people to build them. Is it because habits are something everyone struggles with? Because the problem never really goes away? Or because even small improvements can feel meaningful?\n\nCurious what people think.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1766077029.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Explores why people build habit-tracking apps with reasoning about incentives.",
    "composite_score": 3.0632943825933694
  },
  {
    "score": 34,
    "title": "I built a free app that converts any article (Substack, Medium, etc.), pdf, fb2 or text photos into a high-quality audiobook and would love to hear your thoughts!",
    "selftext": "I spend a lot of time commuting and wanted to make that time more productive by listening to articles from Substack, Medium, and pdf, fb2 books. But every text-to-speech app I tried had robotic or unpleasant voices, making it difficult to listen for long periods.\n\nSo, I built a free app that converts any article or file into natural-sounding audio. Just paste a URL, file or text and you’re good to go. It has high-quality, realistic voices, works with any article from the web. No unnecessary permissions, and it’s free to use (with daily limit). The app called Frateca.\n\nWould love to hear your feedback—give it a try and let me know what you think!\n\n[Free iPhone app](https://apps.apple.com/us/app/frateca-text-to-speech-audio/id6741859465),\n\n[Free Android app on Google Play](https://play.google.com/store/apps/details?id=ai.texttospeech.app)",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1763768730.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Describes a product and solicits feedback; primary value is product concept, not steps.",
    "composite_score": 2.813539720503694
  },
  {
    "score": 33,
    "title": "Is there hope?!",
    "selftext": "Hey guys!\n\nI launched a passion project of mine to learn Portuguese:\n\n[https://flashapp.app/](https://flashapp.app/)\n\n[https://apps.apple.com/us/app/learn-portuguese-flashapp/id6751175150](https://apps.apple.com/us/app/learn-portuguese-flashapp/id6751175150)\n\n  \nAs I was building it, I felt like it actually had some legs. An alternative to Duolingo that is more straightforward. Drill flashcards that intelligently return (or not), self-judge, get points, progress. I myself am learning a lot with it and enjoy it. So it's been a great experience already.\n\nI launched it a few weeks ago and I have 4 subscribers (not sure how they found it), but only like 1-2 downloads a day now. The 4 subscribers though gives me some hope... All yearly subscribers too. I've tried posting on reddit and such but it always gets taken down, so it doesn't feel like a good approach. MAYBE I can create a tiktok ad and target people trying to learn PT?\n\nI'm trying to decide how much more work and money to put into it, but so far I'm continuing because I'm enjoying the process. My long long long term goal would be like $750 MRR or something like that. That could meaningfully change my life. But for now I'm in the Red. I spent something like $500 making the app.\n\nAny feedback or tips would be greatly appreciated. Thank you.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1767026902.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Shares experience and asks for feedback to decide future investment; informative, not a how-to.",
    "composite_score": 3.0271597639593915
  },
  {
    "score": 30,
    "title": "A silly app (500 signups, people want it for safety too)",
    "selftext": "This started as a silly idea: I used to fake phone calls to escape awkward conversations. It felt like a personal “hack,” but also awkward to pull off. So I built ComfortCall — your phone actually rings from a real number, with short natural scenarios (friendly check-in, colleague reminder, etc.) you can trigger in one tap.\n\nWhat surprised me: I put up a [waitlist](https://tactical-form-511209.framer.app/) and got 500 signups. I emailed the first batch and got 65 thoughtful replies.\n\nPeople told me they’d use it not just for small talk, but for things I didn’t expect: • walking home alone at night • getting out of a meeting going nowhere • even avoiding creepy interactions\n\nThat got me thinking: this isn’t just an “awkwardness hack.” It could be a wellness + safety tool.\n\nI’m building the MVP.\n\nWould love your feedback: What scenarios would make this actually useful to you? Do you see this more as a safety/wellness product, or a niche hack? For something like this, would you pay per minute or via subscription?",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1757338887.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Notes traction and asks for feedback on usefulness and monetization; product update.",
    "composite_score": 2.858238494310687
  },
  {
    "score": 29,
    "title": "My first real sale with my own macOS app 🎉",
    "selftext": "I recently released my first macOS app, FocusDot - a minimalist focus app that runs in the menu bar and helps you stay focused. 🔵\n\nToday I made my first 2 sales! 😭\nIt's just a small launch, but it feels super good to see that someone out there is using my app.\n\nI designed and programmed the app entirely myself and published it in the Mac App Store.\nIf you are also interested in productivity tools, please take a look at them or give me feedback on what I could improve 🙏\n\n💻 FocusDot – Stay focused. Less distraction.\n\n🔗 https://apps.apple.com/us/app/focusdot/id6754207332",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1762253604.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Reports first sales and asks for feedback to improve; product update.",
    "composite_score": 2.7328175972987747
  },
  {
    "score": 27,
    "title": "Made an AI-moderated anonymous video chat platform - Scaled it to 150k monthly users so far!",
    "selftext": "Hey all, made a fun video and text chat platform where you can easily meet\r\npeeps from anywhere including your city. I have been a member of several reddit\r\nchat subs, and making a platform like this for you all has always been on the\r\nback of my mind.\n\r\nYou can match with random strangers from all over the world on the site through\r\neither video or text chat. Talk as long as you want, and if you aren't interested,\r\njust skip to the next person. If you vibe with someone, you can save them to your\r\nfriendlist. This way you don't lose them to the crowd and even if they ghost you,\r\nyou can always ping them up to connect again. You can check if they are online\r\nor not, and ask to connect with them. You can add your city as an interest on the\r\nsite and when you match, the algo will try to pair you with users from your city,\r\nthat's a plus!\n\r\nAlso the AI moderation ensures most of them are genuine and not there for illicit\r\nstuff. Some really cool features on the way too, including hangouts where you can chat over video or audio in a room full of people, stream movies together and\r\nall. Very fun!\n\r\nThe platform is having 150k monthly users atm, and 200k daily video chats. If\r\nyou are interested, check out https://app.vooz.co/ and provide some feedback :)",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1765866280.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.67,
    "category_rationale": "Promotional/traction claim with features and asks for feedback.",
    "composite_score": 2.8757370470133288
  },
  {
    "score": 27,
    "title": "Launched my first app to the app store today",
    "selftext": "Hey everyone!\n\nJust launched my first app on the App Store and honestly still can't believe it's actually live. I've been doing software development for about 5 years now, mostly frontend work, but I've always had this itch to build something for mobile. Started as a side project, but somewhere along the way, I got really into it and decided to see it through.\n\nThe app is called [**Ignis: Epic Micro Learning**](https://apps.apple.com/ro/app/ignis-epic-micro-learning/id6754519612%20Ignis:%20Epic%20Micro%20learning) \\- bite-sized learning sessions across topics like history, art, economy, science, and fashion. Planning to add cinema, music, and theater next. Spent a lot of time curating the content to keep it engaging and not just fluff.\n\nAlso added gamification, progress tracking, and daily challenges to keep things interesting.\n\nTook me roughly 5 months of nights and weekends while juggling my regular job. Went with React Native + Expo, Firebase for backend, RevenueCat for subscriptions, and Sentry for error tracking.\n\nFigured it's better to get it out there and iterate based on real feedback. Actually working on a flashcard feature for the next release, where I'm trying to capture that TikTok-style scrolling, but for learning. The idea is to hijack that addictive swipe mechanic for something productive.\n\nNow comes the fun part: actually getting people to find it. Planning to experiment with paid ads and content marketing. If anyone has tips on what worked (or what was a waste of money), I'm all ears.\n\nIf you want to check the app, here's the link to the app store: [https://apps.apple.com/ro/app/ignis-epic-micro-learning/id6754519612](https://apps.apple.com/ro/app/ignis-epic-micro-learning/id6754519612)\n\nWould really appreciate any feedback if you get a chance to check it out!\n\nThanks!\n\n",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1762200283.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Announces launch and requests tips/feedback; product update.",
    "composite_score": 2.896128035678238
  },
  {
    "score": 27,
    "title": "The most underrated \"feature\" of your app is a sharp promise",
    "selftext": "When you’re building an app business, it’s easy to believe that progress = more functionality. New filter here, another integration there, more analytics, more settings. On the inside, the product feels richer. On the outside, it often feels more confusing.\n\nAcross a lot of app journeys, one thing shows up repeatedly: the biggest jumps in signups or revenue don’t always come after big feature drops. They come after big _clarity_ drops—tightening who the app is for, what specific problem it solves, and what outcome users can expect.\n\nInside [FounderToolkit](http://foundertoolkit.org), you see example after example of founders who didn’t radically change their product, but changed the way they described it and who they showed it to. Rewriting the headline in the customer’s words. Narrowing the ICP from “for everyone” to “for X doing Y.” Simplifying onboarding so users hit first value in minutes, not hours. Reframing pricing around outcomes instead of feature lists.\n\nThe underlying app barely changed, but the story, target, and path to value did. That’s what moved numbers.\n\nIf your roadmap is full but your growth is flat, it might be worth pausing before you ship the next thing and asking: “Do people truly understand what this already does and who it’s for?” Sometimes, the highest‑ROI sprint isn’t adding functionality. It’s making the existing value impossible to misunderstand.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1765685017.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.75,
    "category_rationale": "Offers a strategic lesson on clarity in messaging; educational guidance.",
    "composite_score": 2.6578543739213316
  },
  {
    "score": 25,
    "title": "What are you building? Let's support each other 🚀",
    "selftext": "I'll go first! I'm building [**codesync.club**](http://codesync.club) \\- an AI coding tutor that teaches you to code by building real apps really fast, not watching boring videos.\n\nIf you've always wanted to learn coding but kept quitting courses, it helps you:\n\n* Learn to build apps, websites &amp; games with AI courses\n* Learn and code on the same screen\n* Build fun projects - todolist app, snake game, portfolio website\n* 20+ projects to build, all for free\n\nBuilding it because no matter which platform you use to learn, there's a friction between learning &amp; building. \n\nWhat are you building right now?",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1763274700.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Invites networking and discussion about what others are building; community support.",
    "composite_score": 3.0466873447522866
  },
  {
    "score": 25,
    "title": "Personal experience about app marketing (marketed around 200+ apps)",
    "selftext": "Hi this is my first post on this community, just wanted to share what i experienced after promoting like 200+ apps in my lifetime.\n\nAbout my journey \nSo i started as a app developer freelancer but quickly found out that not many people on fiverr are providing the correct service for the app marketing even though its a very huge market. So i just created a gig and it blew up and got me couple of thousand dollars and ton of experience working with early stage startups, solo preneurs.\n\nAfter seeing good growth started my agency digitalshift - thedigitalshift.co\n\nHave worked with both games and apps\n\nWorked with 0 download apps to even 10 million downloads apps\n\nWhat i learnt about the market \n\n1. If you are launching your app in a competitive market dont expect that you will magically get users with aso. Its all a fuggazi, you need to invest in ads no matter what. ASO works, but only works if you have a lot of data, reviews, ratings. It will not work in starting. So before you invest in ASO at 0 downloads, think twice.\n\n2. You can scale your app revenue from investing just 2 dollars a day when you start and you can scale your revenues to 100s or even thousands of dollars per day. Just you need to optimise your campaign for the right event, targeting the right audience, and eye catching videos\n\n3. Dont create shady apps and expect it to earn you huge amount, i have come across many clients who wanted to promote shady apps like money earning apps, free fire apps and so on. These could give you temporary revenue, but there is a high chance that they will flag your app or even suspend your publisher account. (Also google ads will disapprove the ads)\n\n4. Make sure you a/b test your app screenshots, app descriptions, logo and other meta data\n\n5. If you want fb ads for marketing your app, you can try a/b test multiple audiences, graphics. Try a cbo ads campaign, or even a ROAS campaign \n\n6. My personal experience on which ad platform is best - I prefer google ads to be way better, the cost is lower in tier 1 countries compared to fb ads (some niche it could be reverse but i have never seen this case)\n\nAlso quality of users are definitely good if you target for the right event in google ads. Also if you are launching only android app then google ads is no brainer as your ads will be shown on other apps, on play store search, google search, YouTube\n\n7. Apple search ads - it can be very expensive if you dont get it right. Make sure you use low competition keywords, create multiple ad group with different localised keywords (different languages). And do remember to add a cpa target or else it will spend all your money and you will get high cpa costs.\n\nOfcourse there are many things that i have missed out but i can definitely answer all your questions, you can dm me or comment, i will try to answer all your questions.\n\n",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1721934095.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.76,
    "category_rationale": "Contains a numbered list of 6 distinct app-marketing lessons, functioning as a listicle.",
    "composite_score": 2.996352263811605
  },
  {
    "score": 25,
    "title": "Built a Smart News App That Helps Me Follow Topics, Not Platforms",
    "selftext": "Hey everyone! Over the past couple of years, I've noticed something about how we consume information today: the harder we try to \"keep up,\" the more overwhelming it becomes. We jump between group chats, newsletters, timelines, and endless feeds, not because we enjoy it, but because we're afraid of missing something important. But all that effort rarely leads to clarity. Instead, it drains our focus and leaves us feeling like we're running faster but seeing less. I wanted a better way, not to chase more information, but to finally make sense of it.\n\nFor the past few months, I've been working on YouFeed, a personal AI news agent designed to help you stay informed without drowning in noise. Instead of giving you more feeds to scroll, YouFeed tracks the topics you care about, scans high-quality sources across the web, filters out low-value content, and delivers only the essentials, in a clear, concise, and timely way.\n\nApp concept: YouFeed is built around a simple idea: follow topics, not platforms. Whether you care about AI breakthroughs, markets, policy changes, scientific discoveries, or niche interests, YouFeed monitors trusted sources for you. It summarizes key updates with AI, shows real-time changes as stories develop, and keeps everything organized in one place.\n\nOne feature I'm particularly proud of is the AI-powered topic tracking. You define the areas you care about, like technologies, companies, global events, industries, and the system works 24/7 to gather, filter, and summarize everything relevant. Instead of manually checking multiple websites or group chats, you get clean, verified updates in seconds. It's like having your own personal researcher who never sleeps.\n\nIf this resonates with you, I'd love your feedback. In an age where high-quality information is everything, I'm curious: Where do you usually find valuable content? What problems do you face when trying to stay updated? With AI, I believe we can help people track and understand meaningful information faster, and your insights would really help shape how YouFeed does that.\n\nThanks for reading! and if you're curious, I'd love for you to try youfeed and see whether it makes your information world a bit more readable: [https://youfeed.app/](https://youfeed.app/)",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1764833643.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Centers on a mental model for information tracking with AI; explanatory rather than a list of items.",
    "composite_score": 2.315488345802809
  },
  {
    "score": 23,
    "title": "70% of app growth dies without easy sharing. In-app sharing helped me gain 100k+ organic installs.",
    "selftext": "Do you let users share your app or products right from inside it. If not, you are directly making your own Customer Acquisitions expeensive.\n\nQuick background on me. I managed 4 apps last year and each with 1M+ users.\n\nAdding share features drives real growth. Users bring in friends without you spending on ads and retention improves when people return for shared content.\n\nFirebase Dynamic Links was the go-to stable choice for years but it shut down.  \n\n\nWhat setups do you run for sharing. ",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1762843593.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Advocates in-app sharing as a driver of growth with brief supporting reasoning.",
    "composite_score": 2.871945469501399
  },
  {
    "score": 22,
    "title": "How do you decide which app to develop?",
    "selftext": "I want to develop an app that is easy to market, an easy concept to explain. Im not looking for the $20k mmr type, just something that can pay the bills.\n\nChatgpt always ends up recommending the same kind of stuff: plant recognition apps, habit tracker, fitness, etc. \n\nHow would you find the right niche and category to make a bit of cash flow and keep the business going? I dont have any particular angle I could lean on for marketing, im not great at social media or doing ads.\n\nI have a couple apps which I'm struggling to find a way to promote them profitably, because the math does not work, I would have to change the payment plan drastically.\n\nBut anyway, I know it's a difficult question, but there's got to be some niche or category people or teams think they are too small to go for, and us little guys can make a small profit on. Anyone has an idea? or has seen cases like that?",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1766338816.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Primarily a request for ideas/advice about niche selection; mostly a question, little content.",
    "composite_score": 2.8656197643774606
  },
  {
    "score": 23,
    "title": "What Are You Building? Let's Promote Each Other!",
    "selftext": "I'll kick off! I’m building [ContactJournalists.com](https://www.contactjournalists.com/) — a simple way for founders to get featured in the press\n\nIf you’ve got a startup or SaaS project, it helps you:\n\n🚨 Get live requests from journalists who are looking for stories\n\n📰 Get featured in blogs, magazines, and podcasts that fit your niche\n\n🚀 Save time chasing replies and tracking outreach\n\nWe’re launching in 13 days, and it’s gonna be free for the first three months for the first 200 sign-ups (currently at 196!) 💕 Sign up at [ContactJournalists.com](https://www.contactjournalists.com/) What are you building?",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1763394081.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional/community-engagement post asking others what they are building; not a how-to or model.",
    "composite_score": 2.9478761592169898
  },
  {
    "score": 23,
    "title": "Made my first sale! Alhamdulillah",
    "selftext": "I was so nervous. Yet I gathered all my strength and published Share Wifi on Appstore: [https://apps.apple.com/us/app/share-wifi-qr-code-connect/id6748231219](https://apps.apple.com/us/app/share-wifi-qr-code-connect/id6748231219)\n\nIn 15 days I have had 50+ downloads and 1 first subscriber! I haven't paid any dime in marketing yet. I have tried to post on several sub reddits. Most of them got decline as I have very low karma. The app itself is to store and share beautiful wifi cards.\n\nThe app had a better download rates on the first week. Now I get mostly one or zero downloads. I am planning my next big update very soon. And I have also started writing more frequently.   \n  \n\\- Please wish me luck.   \n  \n\\- I would really love if you please give any feedback on the app. Any criticism is precious to me. \n\n\\- I would also be grateful if you any fellow indie dev provide the valuable advice on growing the app.\n\nPS: this is my first ever app published on appstore..",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1762788280.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal milestone post with a request for feedback; mainly narration and social engagement.",
    "composite_score": 2.577711241711606
  },
  {
    "score": 22,
    "title": "If I build a profitable app, would you want to own it?",
    "selftext": "Hey folks,\n\nI’m an iOS developer (React Native, but iOS-only focus) and I’m exploring a model where:\n\n* I build a polished iOS app from scratch.\n* I grow it to early traction ($100–$1000 MRR).\n* Then I transfer full ownership to you via Apple’s App Store Connect transfer process.\n\nThat means you’d skip the entire “idea → code → launch” phase and immediately step into owning a live app with real users and revenue.\n\n👉 My question:  \nWhat type of iOS app would you *actually want to acquire*?\n\n* A utility app?\n* Subscription SaaS (fitness, productivity, niche tools)?\n* Something in content/AI?\n\nI’m not looking to build throwaway projects — only something people here would truly want to own and operate long term.\n\nIf this sounds interesting, I’d love to hear what apps you’d pay for (or what niches you’d want to buy into).",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1757937171.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Open-ended inquiry about what apps people would want to acquire; discussion prompt.",
    "composite_score": 2.927894084233227
  },
  {
    "score": 24,
    "title": "Why Jibble is Better Than Connecteam",
    "selftext": "If you’re trying to decide between Jibble and Connecteam, let me save you some time... Jibble is the way to go. It’s super easy to use with a ton of features and best of all, it’s actually free for unlimited users. Connecteam, on the other hand, locks a lot of useful features behind a payment, which isn’t great if you’re a small business on a budget.\n\nThey both have face recognition, gps tracking, etc but in my opinion Jibble is a little more professional and easy to use without giving too much access to employees. Plus, it integrates smoothly with tools like Slack, so managing your team feels way less complicated. Connecteam’s interface can be a bit overwhelming, while Jibble keeps things simple and efficient.\n\nSo... if you want a feature-rich time tracking tool without paying too much, Jibble is the better choice.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1738696519.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Comparative product evaluation arguing Jibble is better; reasoning.",
    "composite_score": 2.704911684825456
  },
  {
    "score": 22,
    "title": "Is it true?",
    "selftext": "🚩 You can build the highest-quality app in the world… but if no one can find it, it doesn’t matter.\n\nFor a long time, I believed the product itself was everything.\n\nBut the more I ship, the more obvious it becomes that marketing is the real engine behind profitable apps.\n\nYes — ASO is powerful and I rely on it heavily. It’s helped my apps stay profitable (No matter how small the MRR 😄 🤣 ).\n\nBut when you’re competing against huge players, ASO alone can be slow and unpredictable. Ranking well takes time, and sometimes, it’s simply not enough.\n\nWhat I’m learning is this:\n\n💡 Indie developers can build amazing products… but reaching users requires a solid marketing strategy.\n\n🟩The right strategy can take your app from invisible → discoverable → scalable.\n\nSo I’m curious to learn :\n\n👉 What marketing strategies would you recommend for indie app developers — especially the ones that help us avoid wasting money while we try, fail, and learn (because most of us start with zero marketing knowledge 😅)?\n\nWould love to hear any advice, frameworks, or lessons you’ve learned along the way. 🫰 \n\nI’ll start with the first piece of advice from my own mistakes:\n\n❌ Never enable “Automatically match my ad to relevant searches” in Apple Search Ads.\n\nIt sounds helpful, but it can drain your budget fast with almost zero meaningful results.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1765969011.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Discussion of marketing strategies with examples and a request for advice.",
    "composite_score": 2.6697734655454335
  },
  {
    "score": 22,
    "title": "Just hit $5k MRR from a simple calorie counter, thoughts? ",
    "selftext": "Hey everyone!\n\nAfter months (or years) of late nights, countless iterations, and endless learning, my side hustle just hit **$5K MRR**. It feels surreal to finally hit this milestone, and I wanted to share it with the community that’s been a constant source of inspiration and motivation.\n\nI’d love to **pay it forward**, answer questions, and chat with anyone on a similar journey! Whether you’re just starting out, scaling, or stuck in the grind, ask me anything about:\n\n* **What worked and what didn’t** during the early stages\n* How I managed **time and stress** with a full-time job\n* Building a customer base and **retention strategies**\n* **Tools, tech stack, or marketing strategies** that got me here\n* How I’m planning to **scale further from here**\n\nFeel free to ask about the **challenges** too—because there have been many! 😂\n\nThanks to everyone who’s been part of the community here—it’s helped me push through. Let’s chat and grow together! Please let me know if you guys have any criticism about my app, thanks. 🚀\n\n[https://dietapp.ai](https://dietapp.ai)",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1729965383.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Milestone post inviting questions and feedback; personal narrative.",
    "composite_score": 2.6213184590414054
  },
  {
    "score": 22,
    "title": "4-Month Old App for Sale – $5K/Month Revenue",
    "selftext": "Me and my friend launched an AI-powered fitness app that tracks calories from food photos. In just 4 months it’s grown to 85K downloads, 21K active users, and makes around $5K/month in revenue with 18K new customers last month. The app has built-in gamification features (streaks, challenges) that keep users engaged, and there’s huge potential to expand into new markets beyond MENA. We’re considering selling it to someone who wants to scale it further — DM if interested.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1759320690.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Sale listing with revenue/traffic metrics; not a how-to or curated set.",
    "composite_score": 2.883761858192731
  },
  {
    "score": 20,
    "title": "Shipped my first iOS app with zero Swift experience (thanks to vibe coding). Here’s what I learned.",
    "selftext": "Hey everyone,\n\nI just got my first iOS app **\\[redacted\\]** approved on the App Store today! 🎉 Took \\~4 weeks of evenings and weekend work (on top of my full time job) and about 12 App Store rejections to finally get through. I’m an electronics engineer by trade, so Swift, Xcode, and App Store Connect were all completely new to me - most of my 'expertise' is in C (but I haven't touched much of it since my college courses about a half decade ago). I leaned heavily on Cursor + vibe coding, and somehow pulled it across the finish line.\n\n**Technical Learnings:**\n\n* **Navigation is harder than it looks.** Screen-to-screen transitions get messy fast — you really need some kind of central manager to avoid race conditions. Since I didn't map things out from the beginning I had major issues with moving from one screen to the next -&gt; especially onboarding to main app view. \n* **Onboarding needs to hit dopamine.** If it’s not fun/engaging, people bounce. This was eye-opening. I uploaded screenshots of my onboarding flow to GPT-5 and asked it to review it as if it were a YC mentor (lol). And it did a pretty good job of helping me fine tune the onboarding to get extra dopamine! \n* **UI consistency matters.** I built the UI in native SwiftUI first, then added a theme later. That made onboarding feel different from the rest of the app. If I’d defined the theme up front, I could’ve applied it consistently instead of retrofitting it everywhere.\n* **The App Store process itself is its own learning curve.** Payments, metadata, EULA/ToS, rejection reasons, etc. I found t[his reddit post](https://www.reddit.com/r/iOSProgramming/comments/1jz8bg0/i_just_figured_out_inapp_purchase_subscriptions/?share_id=xsol0Q6myNsqITxsDNNUm&amp;utm_content=1&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_source=share&amp;utm_term=1) extremely helpful and saved me a bunch of rejections probably. \n* **OpenAI API quirks.** Cost metering is easy (token counts are returned). If you want real-time UX, you basically need the priority tier. Regular, mini and nano are great to use for all sorts of different things. \n* **Vibe coding reality check.** Great for boilerplate, but complex features require mapping things out and doing real research about the features/apis and stuff. Endless “fix it” prompts to Opus just don’t cut it ha ha.\n* **Ecosystem tools.** CloudKit + Sign in with Apple were way easier than expected and fit great for vibe coding. Xcode toolchain… painful but learned a ton.\n* **Knowing which model to use.** \n   * Gemini-2.5-Pro → UI workhorse\n   * Claude/Opus → Swift help \n   * GPT-5 reasoning → UX/flow brainstorming\n   * Claude Sonnet long-context → best for big refactors\n   * Fast models = useless for vibe coding (no surprise)\n* **Back end.** Vercel Functions for my AI proxy backend were shockingly good - easy, cheap, straightforward. Feels light years ahead of AWS/Wordpress/Github pages I messed with back in college. I was shocked to see how far cloud infra has come in like 6 years.\n\n**Business Reflections:**\n\n* My App itself is probably *too broad* to market well (it’s an AI goal planner/coach). A niche version of my app like “AI Goal Planning &amp; Coaching for Runners/Weightlifters” or Students, or photographers would likely be a better play. I'm gonna be surprised if this app ever finds an audience in its current state. \n* The freemium pricing model is rough with AI backend calls. At a realistic 2–5% conversion rate, the free tier has to be so limited that it’s my app isn't very usable. Right now I have the free tier priced above sustainable limits just to see if I can successfully market the app. I’ll keep it live, but may pull it or nerf the free tier if it ends up costing me too much.\n* My next big milestone is just seeing if I can land **one paying customer**. I'm planning on trying to grow organically through AI generated UGC adds and targeted forum posts.  \n\nWould love to hear from others - do these lessons resonate with your experience? Have you found different strategies that worked better (especially around onboarding, freemium design, or vibe coding workflows)?\n\nCheers!",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1759031910.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Provides learnings and mental-model style explanations from building an iOS app.",
    "composite_score": 2.627324915589722
  },
  {
    "score": 21,
    "title": "Review about our experience with Jibble",
    "selftext": "Jibble is a cloud-based time tracking and attendance management application designed to streamline workforce monitoring for businesses of all sizes. It offers features such as facial recognition, GPS tracking, and customizable timesheets to enhance productivity and accountability.\n\n**Pros:**\n\n* **User-Friendly Interface:** My team appreciate Jibble's intuitive design, which simplifies the process of clocking in and out across various devices, including mobile, desktop, and tablets.\n* **Advanced Identity Verification:** The app's facial recognition and selfie capture features help prevent buddy punching, ensuring accurate attendance records.\n* **GPS and Geofencing Capabilities:** Jibble's GPS tracking and geofencing features allow employers to monitor employee locations in real-time, which is particularly beneficial for businesses with remote or mobile workforces.\n* **Comprehensive Free Plan:** Jibble offers a robust free plan that includes essential time tracking features, making it an attractive option for small businesses and freelancers.\n\n**Cons:**\n\n* **Limited Integrations:** Some users have noted that Jibble's integrations are limited, which may pose challenges for businesses seeking seamless connectivity with other tools.\n* **Restricted Features in Free Version:** Certain advanced functionalities, such as exporting timesheets and setting up multiple work schedules, are only available in the paid plans, which might limit usability for some businesses.\n* **Occasional Syncing Issues:** There have been reports of delays in syncing data between the mobile app and the web version, requiring users to log out and back in to see updates.\n\nIn summary, Jibble is a feature-rich time tracking solution that offers a user-friendly experience and advanced verification methods. While its free plan is quite comprehensive, businesses requiring more advanced features and integrations may need to consider the paid plans to fully leverage the application's capabilities.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1739540833.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Product review with pros/cons and identified limitations.",
    "composite_score": 2.760028301678009
  },
  {
    "score": 20,
    "title": "I've got my first customer !",
    "selftext": "I wanted to share a small milestone that some of you might relate to.\n\nThis week, my app got its first two subscriptions on RevenueCat.\n\nOne of them is from me (because of course I had to test the flow).  \nBut the second one is from an actual stranger.  \nNot my mom. Not a friend. Not someone I begged.  \nJust... a human who used the app and decided it was worth paying for.\n\nIt’s obviously tiny in absolute terms, but psychologically it hit way harder than expected.\n\nThe funny thing is: it came after an exhausting App Store review cycle.  \nMultiple rejections, mysterious IAP errors, privacy label issues, back-and-forth with support...  \nYou know the drill.\n\nSeeing that first paid user appear right after all that pain was probably the best possible timing.\n\nI’m curious: for those of you who shipped subscription apps, did your first \"real\" subscriber change your motivation, roadmap, or how you thought about the product?\n\nHappy to chat about the launch experience, RevenueCat setup, or the App Store pitfalls if anyone’s in the same boat.",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1764094695.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Sharing launch milestone and challenges with a question seeking advice.",
    "composite_score": 2.7732799220937503
  },
  {
    "score": 19,
    "title": "Built a clock-style habit to help me visualize my day.",
    "selftext": "Hey everyone! I've been building this app for the past 2-3months, and soon I'm going to release it on the App Store.\n\nI have mainly been building this app because I love the Stoic philosophy, and I'm into modern self-development, and I thought that I could make an app that combines both of them to build a useful app that is not just going to help me only but also help other people learn about Stoicism and help them improve their lives daily.\n\n**App's concept:** it is based on the four cardinal virtues of Stoicism: Wisdom, Courage, Justice, Temperance, and the goal is to improve these virtues throughout building your own habits (called Rituals) and reflecting on your days as the Stoics used to do.\n\n**Friends Section:** This section, to me, is really interesting as it is made for users to improve with their friends by building shared rituals, sharing quotes and ideas to reflect on, and other things, so we can all improve the best way possible.\n\nIf you like the app idea, I would love to hear some recommendations and advice to help me make it even more helpful to all of us. I'm leaving the website link here if you are interested, so you can join the waitlist: [stoivyn.com](https://www.stoivyn.com/)\n\nThank you for your time!!",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1762362158.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Describes app concept and asks for recommendations; not a procedural guide.",
    "composite_score": 2.641544993495972
  },
  {
    "score": 19,
    "title": "7 Profitable Apps Making over $3-200K MMR",
    "selftext": "Hey! I'm Andrei, the founder of [Inspo Stories](https://inspostories.com/stories)\n\nInspo Stories is a deep dives about successful apps, saas and business in general.   \nNow we are focusing more on Mobile apps, that's why it might be interesting for u\n\nAnd our recent deep dives are:\n\n1. [How Hevy tipped the scales: Insights on reaching $160K MRR](https://inspostories.com/story/hevy-app)\n2. [Locket Widget: $200K MRR &amp; 1M Downloads](https://inspostories.com/story/locket-app)\n3. [Letterly - Your speech into well-written text. From 0 to 1](https://inspostories.com/story/letterly-app)\n4. [Structured: Daily Planner - $100k MRR](https://inspostories.com/story/structured-app)\n5. [How 23 y/o making $740,000 a year with Mobile App](https://inspostories.com/story/700k-mobile-apps-story)s\n6. [Productivity tracker app is making over $90K/month](https://inspostories.com/story/habit-tracker-app)\n7. [Tune Track app story: Top charts 40 countries, 4M downloads](https://inspostories.com/story/tunetrack-app)\n\nHope some of stories will inspire you!  \nWe spent over 80 hours to write all these articles in depth\n\n# ",
    "subreddit": "AppBusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1716037664.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Explicitly lists seven stories/resources about profitable apps.",
    "composite_score": 2.3220599913279623
  }
]