[
  {
    "score": 97,
    "title": "I 17 yo and this is my first app - please help",
    "selftext": "\nDo u ever feel like the code is just impossible? \n\nAfter high school, I took an interest in building apps. Then in August  I sold my company to go all in on building an app, \n\nDid some market research and got a lot of great feedback from people and got started with building it. \n\nIt’s been two months now I on average code 12 hrs to 8hrs on unproductive days. I’ve never done such a thing in my life before. I usually meet with a lot of bugs and problems tht take me days to solve but now I’m just stuck fr\n\nMy investor expected a launch last week Im about to finish but there’s an error I can’t seem to see where it’s coming from \n\nI know I’m a cry baby, at 17 we gotta be tough but like I just can’t do this \n\nSo please on the bottom of my heart I am asking for help, if you know react native please consider helping me pleaseee\n\nI know I’m a stranger and some kid on the internet but please please some help we can do a small call maybe for u to review my code   \n\nRn I feel like a failure, but I am not I’ll be one if I stop trying. \n",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 97,
    "downs": 0,
    "created_utc": 1763713437.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal help request about building an app by a teen; no structured guidance or list.",
    "composite_score": 3.4607600978676327
  },
  {
    "score": 77,
    "title": "Hired an app development company — Should I fire them?",
    "selftext": "Hello everyone,  \n  \nI hired an app development company (Western Europe-based) to build a fairly simple app. They’re a small team of around 10–15 people.\n\nThe design and functionality are very straightforward, and they originally said it would take 2–3 months to complete. That deadline was 3 months ago — so we’re now 6 months in — and the app still isn’t working as it should.\n\nWe’re already at version 15, and every new version is still full of bugs and basic issues. For example, one of the simplest features — making the app vibrate on launch — took them *weeks* to fix.\n\nWhat’s even more frustrating is that they always claim to have “tested everything thoroughly” and that the app “works perfectly,” but every time I test it myself, I immediately find multiple obvious errors.\n\nAt this point, I’m starting to think they simply don’t have the technical skills to build this app, or they’ve massively overpromised what they can deliver.\n\nI’m seriously considering firing them and hiring a new developer or small agency to take over the project — but since this is my first time working with an app development company, I’d really like to hear from others:\n\n* Is this level of delay and error somewhat “normal” in app development?\n* Or does this sound like I’m dealing with an unqualified team?\n* Has anyone switched developers mid-project, and how did it go?",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1760556353.0,
    "media": null,
    "is_video": false,
    "num_comments": 206,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Asking for opinions about firing a dev; discussion-based, no step-by-step.",
    "composite_score": 3.762579775418939
  },
  {
    "score": 74,
    "title": "finally reached 10k rev with my app after years of failure - here's what worked",
    "selftext": "After years of trial and error, questioning myself, talking into the ether, self doubt, and probably a few lost hairs, I finally got my first app to 10k monthly revenue. \n\nWanted to share how I got here and hopefully inspire a few of you, especially if you don’t think there’s a light at the end of the tunnel. \n\n\n\n1) I made the app available for free to the first 500 (didn’t have payments in place). This allowed me to a) build up a user base whose needs I could better understand and then b) also boost ASO. The app itself doesn’t have too many AI features, so my costs for running it are fairly minimal. Those users then also became advocates for the app, which helped with word of mouth and early growth. \n\nThe app continues to operate on a freemium model, so around 70% of features remain free.\n\n\n\n2) The way I found those users was to post in relevant subreddits (don’t bother searching this account’s history, I used another account). The post themselves were phrased like “Hey, I built a free app for xyz and would love your feedback”. \n\nThe operating term here, I think, was free. Reddit users are allergic to being sold something, so by solving their problem for free, they would’ve looked like c\\*nts for shitting on me (esp since competing apps do charge). \n\n\n\n3) Build features customers of your competition request. Lucky enough, two of my competitors have public feature voting boards. I basically just scanned those and implemented the most requested ones, then used that in my marketing (e.g., content I made or in the App Store description) and within the app (e.g., during onboarding) wherever I could. \n\nAnd then obviously the features I now build are all based on user feedback and voting results as well. \n\n\n\n4) Next to Reddit, I have also been experimenting with TikTok a lot. It’s far and beyond the best platform to go from 0 to crazy revenue jump with just one successful piece of content. \n\nI started out with two accounts on my phone, one doing slideshows and one doing simple reaction videos. I’ve since expanded to 15 accounts across 4 phones. \n\nMy basic workflow is to warm up for 3-4 days, then create first few content pieces on phone, and then switching to a third-party scheduler, which has automations build in and also allows you to hire human UGC creators. I’ve now hired a VA from the Philippines who I pay $4/hr and she manages all the content using that platform. \n\n\n\n5) SEO starting to take off slowly but surely as well. I don’t do free tools or blog posts for now but have a few feature pages that are ranking well. But more importantly, the programmatic pages I set up are finally working. I basically scraped data from a few different sources, use some of our own (anonymized) data, and created around 450 pages that I let rest for a while. \n\nI just crossed 5k organic clicks a few days ago ([https://ibb.co/Y7t6p8Bp](https://ibb.co/Y7t6p8Bp)) and now get about 1-3 sales a day from SEO. Nothing crazy but this should scale linearly (assuming same customer demographics), which means at 50k clicks / month, which is not impossible to reach, I could probably make enough passively already to live off of SEO and not rely on organic anymore (which I’ll obv still continue pouring money and resources in because it is all related in the end). \n\n\n\nHope this little breakdown helps some of you guys currently struggling to get your apps off the ground.\n\n\n\nHappy to answer any questions you have :)",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1765982725.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Contains a numbered sequence of actionable growth steps; functions as a playbook.",
    "composite_score": 3.2569380638681142
  },
  {
    "score": 77,
    "title": "broke and can't code, how do i build an app?",
    "selftext": "yall i really wanna build an app but im a broke college student and i don't know anything about coding. i tried to learn but i think my brain is just geniunely stupid and it's gonna take a really long time for me to get the grasp of this.   \n  \ni'm working part-time to take care of my bills but i've always dreamed of building my own app, running my own business making money on my own terms.  \n  \nhow do i do this? I don't have the money to pay a developer or team to build this out for me. i've heard of app builders and stuff but i want something where i can tell it what to build and it does that for me. do you guys know anything like that?",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1761610751.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Simple question seeking guidance rather than a method.",
    "composite_score": 3.4788085994719493
  },
  {
    "score": 71,
    "title": "Looking for an app developer, for long term projects",
    "selftext": "I run a bootstrapped software studio, where we build apps for clients and inhouse apps as well.\n\nI'm looking for a builder (doesn't matter if you're a college student or a recent graduate) to join and help on a project. We will start off with 1 project and if it goes well then this will turn into a long term partnership.\n\nThis is a 100% paid opportunity. \n\nPlease comment if you're interested, I'll reach out with more details.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1753514590.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Recruitment/posting for a long-term collaboration; no instructional content.",
    "composite_score": 3.696394795608499
  },
  {
    "score": 60,
    "title": "Looking for a developer for a mobile app",
    "selftext": "I’m looking for a developer for a mobile and web app maybe a PWA would be the best fit. I’ve already worked with a developer, and the app was supposed to launch at the end of September, but he hasn’t even started. After two bad experiences with freelancers, I’m now looking for someone experienced who has already built apps.\n\nMy budget is €10K, but that needs to cover hosting, design, etc. If you’re interested, please send me a DM. I’m looking for someone I can truly trust.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1757574825.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Job inquiry for a developer; not instructional.",
    "composite_score": 3.5374905219020887
  },
  {
    "score": 58,
    "title": "Looking for App Developer",
    "selftext": "Hello there everybody, I'm looking for App Developer for IOS and Android but IOS for just now is fine. looking for experienced people who have done app developing before ( dose not matter if your student) I'm looking into building a service app where people can book the service. You can be from anywhere and payments will be $1000+ and +bonus if a good job is done. Thanks everybody message if you want join us  ",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1755011100.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Recruitment post for app developers; not instructional.",
    "composite_score": 3.4546655572873646
  },
  {
    "score": 57,
    "title": "Have some shame !",
    "selftext": "Hello Everyone,\n\nEspecially those sitting on their million or billion dollar ideas!\n\nYou want to give “equity”, which somehow magically replaces real money and expect seasoned developers to build your dream, while you sit back, command like a CEO, and take zero risk?\n\nYou honestly believe that just building an app, with no marketing, no budget, no skin in the game, will make you a millionaire overnight?\n\nYou won’t even invest $2,000 in your own “revolutionary” MVP, but you want others to invest their time, skill, and sanity for a slice of imaginary future profits?\n\nCome on. Have some shame.\nAt least get yourself a $20 Claude subscription and build it yourself.\nStop flooding forums with “billion-dollar idea, need dev for equity” posts.\n",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1761568611.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Expresses strong moral judgment and frustration about equity and risk in startups.",
    "composite_score": 3.3298069094037244
  },
  {
    "score": 47,
    "title": "App developer Needed",
    "selftext": "We are seeking a qualified developer or development team to assist in building a lead generation application tailored to the service industry. The app will be designed to streamline the process of identifying and capturing high-quality leads. Additional project details, including scope and functionality, will be provided upon further discussion.\n\nIf you're interested, please reach out to initiate the conversation.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1752520739.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Project/lead-gen focused post; not instructional.",
    "composite_score": 3.278906154880971
  },
  {
    "score": 50,
    "title": "Hiring an App Developer !",
    "selftext": "**Hey everyone! 👋**\n\nI’m working on an idea for an app that helps people find sports partners for activities like tennis, ultimate frisbee, volleyball, basketball, cycling, and running.\n\nAs someone who travels often, I’ve found it really tough to keep up with my sports routine — not because I don’t want to play, but because it’s hard to find others to play with. At the same time, I think this kind of app could be a great way to meet new people and make friends, especially for anyone who’s new to a city or feeling a bit disconnected. In that sense, it could also help combat loneliness and build real social connection through shared activity.\n\nI’m currently based in Toronto 🇨🇦 and planning to launch the app on **iOS first**.  \nSome of the apps that inspire me are **Couchsurfing, Strava, Uber, Hinge**, and **Tinder** — basically platforms that bring people together through shared goals or interests.\n\nIf this sounds interesting to you — whether you’d like to help out, brainstorm, or just chat — I’d love to connect!\n\nTo help us save time, I'd really appreciate it if you could briefly introduce yourself — including your previous experience, current location, and any relevant background. Looking forward to learning more about you!",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1749575617.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Idea pitch asking for collaborators; not instructional.",
    "composite_score": 3.316784172879405
  },
  {
    "score": 48,
    "title": "My friend died from smoking. I decided to build an app to help myself quit.",
    "selftext": "Two months ago, a close friend of mine passed away from lung cancer. What shocked me the most was how fast everything happened. He went for annual health checkups every year and everything always came back “normal”. Then one day, he was diagnosed — and just three weeks later, he was gone. He left behind everything he had built in his life: his wife and two young daughters.\n\nThat hit me hard. I’ve been smoking for about 10 years. Around half a pack a day. I also do regular health checkups, and just like him, everything looks fine. But after what happened, I couldn’t stop thinking: what if it happens to me too? I don’t want to disappear that quickly because of cigarettes.\n\nI’ve tried quitting many times using willpower alone, and I always failed. I also didn’t want to use medication or see a doctor — not because I think they’re wrong, but because deep down I didn’t want to see myself as “an addict”.\n\nWhen I felt the most desperate, I stumbled onto a very simple idea — something close to mindfulness in Buddhism. Instead of trying to quit, I started **paying attention**.\n\nI took a notebook and wrote down every cigarette:\n\n* when I smoked\n* how many\n* why I smoked\n* how I felt afterward\n\nThat’s it. Nothing else. No pressure to quit. After about two weeks, something unexpected happened. I realized how much **time** I was wasting on smoking. Every cigarette meant going out to the balcony and standing there for about 5 minutes. When I added it all up, I was spending almost **an hour every day**, and nearly **6 hours a week**, just smoking.\n\nWriting down the reasons helped too. I started noticing clear triggers:\n\n* arguments with coworkers or my wife\n* after dinner\n* drinking alcohol\n\nI could *see* cravings coming before they hit. This didn’t make me quit overnight. But it changed how I *felt* about cigarettes. They stopped feeling like a “small joy” or a reward. They started feeling… unnecessary. The number of cigarettes I smoked dropped naturally. From about 10 a day to around 3–6.\n\nThe problem was that writing everything down was exhausting. I looked for apps, but none of them really fit what I needed. So I built one for myself. It’s extremely simple. One button per cigarette. That’s it. From there, I can see my data for today, this week, this month, this year. To strengthen my willpower, I added a small goal system. After each cigarette, I set a goal like “wait at least 2 hours before the next one”. At the end of the day, I can see how many times I succeeded — and how many times I failed.\n\nFor me, this has been the only method that actually works without medication or doctors. Doing this every day slowly changes your subconscious. It changes how you perceive smoking. I truly believe most of us can’t quit because deep down, we don’t really want to. We’ve associated cigarettes with comfort and relief, instead of seeing the real danger behind them.\n\nYou can absolutely do this with pen and paper like I did at first. But if you want something more convenient, you can try the app I made. It’s completely free, and all data is stored locally on your phone. I’m not trying to sell anything. I honestly just don’t want to see more people end up like my friend. I’d really appreciate any feedback or suggestions so I can improve it for people who are trying to quit.\n\nThank you for reading.\n\n**iOS:**\n\n[https://apps.apple.com/app/6754150567](https://apps.apple.com/app/6754150567)\n\n**Android (Closed Test):**\n\nGoogle requires 13 testers. If you’re on Android, please join the Google Group first, then use the test link.\n\nGoogle Group:\n\n[https://groups.google.com/g/test-tracking-smoker](https://groups.google.com/g/test-tracking-smoker)\n\nTest link:\n\n[https://play.google.com/store/apps/details?id=com.quanghuy9742.expotrackingsmoker](https://play.google.com/store/apps/details?id=com.quanghuy9742.expotrackingsmoker)",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1765855578.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": true,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Personal quitting story with a mind-set/mental-model explanation (paying attention) rather than a simple how-to list.",
    "composite_score": 3.037832332580167
  },
  {
    "score": 42,
    "title": "Need to talk with some developers",
    "selftext": "I’m looking for a developer or small team to help me bring the MVP to life. Ideally someone who:\n\t•\tHas experience with React Native, Flutter, or Swift/Kotlin\n\t•\tUnderstands AI integration (recommendation engines, OpenAI APIs, etc.)\n\t•\tIs open to temporary equity stake with reduced rate with potential for full-time role later\n\t•\tIs passionate about creative, social-style apps\n\nThe app already has a strong concept, monetization plan (ads + membership), and clear investor interest.\n\nIf this sounds exciting, DM me or drop a comment and let’s connect!\n\nEdit: Something really important is the possibility of hiring team after launch as this like will fail or scale to an insane amount of users over 200k projected users per day in first 3-6 months\n\nAlso a bit of confusion it’s equity along with short term contract $$ the equity it will make since if you are qualified and see the vision when I go over the blueprint with you.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1763035459.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Recruiting announcement with skills list; not a how-to or model.",
    "composite_score": 3.257893000948214
  },
  {
    "score": 42,
    "title": "People Treat App Development Like a Joke… It’s Not",
    "selftext": "I can’t be the only one noticing this: some folks think building an app is just dragging screens in Figma and clicking “connect.”\n\nNewsflash: planning, executing, and delivering a real app takes months of hard work, even for experienced developers. I’ve delivered government-funded education apps with 100k+ downloads, medical apps based on US regulations… and trust me, even tech giants don’t make it look easy.\n\nYet some “idea people” act like they’re geniuses, promise equity, and expect a finished product overnight. Equity discussions are thrown around like candy before they even understand what it actually takes to build, debug, and maintain an app.\n\nIdeas are cheap, development is hard, and respect for the craft is mandatory. Stop treating app development like a weekend project—it’s not a joke.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1759676822.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Emotional critique of the app-development culture with frustration about equity promises.",
    "composite_score": 2.9565324734187053
  },
  {
    "score": 39,
    "title": "Looking for an App developer",
    "selftext": "Hello everyone,\n\nI’m looking for a skilled mobile app developer to help build a new app. I can’t share the full details publicly yet, but here’s what I can provide upfront:\n\n• Project type: A mobile application with several custom features (details limited for confidentiality).\n• Platforms: [Android / iOS / Webpage ]\n• What I need: End-to-end development or collaboration (UI/UX, frontend, backend, integrations, etc.) depending on your expertise.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1764580264.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.57,
    "category_rationale": "Recruiting post for an app developer; no substantive content beyond the request.",
    "composite_score": 3.2995599913279623
  },
  {
    "score": 38,
    "title": "App developer needed",
    "selftext": "I’m seeking a skilled **mobile app developer/API integration** to help bring an exciting project to life. \n\nWe already have a solid business plan and mockups. Now, I’m looking for a **skilled app developer (or small dev team)** to help turn this into a reality.\n\nThe ideal person should have experience with:\n\n* Building clean, user-friendly interfaces\n* Mobile app development (Android/iOS, Flutter or React Native a plus)\n* Secure fintech/payment integrations\n* Building scalable dashboards (for both B2B and B2C)\n* Startup mindset: agile, fast, and collaborative\n* API integration and backend connectivity\n\nWhether you’re a freelancer or part of a small team, I’d love to connect. If you’ve built apps before (especially in fintech), please share your portfolio or past work.\n\nIf this excites you, or you know someone who would be a great fit, please reach out via **DM.**\n\nLet’s build something great together!",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1757380074.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Recruitment post for app developer with required experience.",
    "composite_score": 3.196502034862745
  },
  {
    "score": 35,
    "title": "Looking for a tech partner or dev team to build new app idea",
    "selftext": "Hi everyone,\n\nMy friend and I have been working in a specific field for a few years, and we’ve been thinking about developing an app (and website) based on our experience for a long time. This isn’t just an idea out of nowhere, we really believe there’s a big opportunity here, and with the right product, it could work well. There are some apps in this space, but none that target the broader market we want to focus on.\n\nThe app itself would need to be fairly complex, visual, and robust. Think of an interface somewhat similar to Tinder (not a dating app, but with a comparable experience). From what I’ve read in this group, that kind of project usually requires a team of 4–5 engineers.\n\nHere’s my main question: since we don’t have a tech background (just some basics), would it be smarter to bring in a technical partner with equity + funding to lead development, or would it make more sense to simply hire a professional dev team and pay for the service? We have a decent budget, so we just want to make sure the result is professional.\n\nHow much would you estimate it costs to hire a team for something like this? Do you think a single strong partner could realistically build it alone?\n\nI’m based in the US. I’d really appreciate your thoughts and advice. Also, if anyone here is interested in hearing more about the project, I’d be open to connect.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1758058463.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asks for advice about equity vs paying for a dev; lacks a model or steps.",
    "composite_score": 3.212759179088715
  },
  {
    "score": 35,
    "title": "Looking for App developer",
    "selftext": "Hey everyone,\n\nI run a calisthenics YouTube channel called **Benji Calisthenics** (feel free to check me out). A while back, I created a simple 1-week PDF program that got **7,000 orders**, and an 8-week follow-up program that got **200 paid orders at $20 each**. Reviews were really positive, but honestly, PDFs felt limited—it’s basically just “do X reps, Y sets” with not much long-term value.\n\nI’ve been in calisthenics for over **6 years**, and I know what I wish I had when I started. That’s why I want to build an app: a **fun, intuitive, all-in-one tool for people’s calisthenics journey.**\n\n**Core MVP features I’d like to start with:**\n\n* Exercise library (videos, form cues, muscles worked)\n* Create your own workouts\n* Profiles (basic accounts)\n* Skill tree (progression roadmap for skills)\n* My programs (converted from PDFs into app form)\n\nLater on I’d love to add things like community features, AI-suggested progressions, challenges, etc.—but for now I want to get an MVP out there.\n\n**Who I’m looking for:**\n\n* A developer who can help me build the MVP (Flutter, React Native, or whatever you think fits best)\n* Ideally someone who’s also into fitness/calisthenics, since you’d instantly “get” the vibe and audience\n* Open-minded about collaboration: I’m a student with a small budget, but I can compensate somewhat, and I’m open to revenue-sharing or giving you credits if you want more long-term involvement\n\nIf this sounds interesting to you, shoot me a message! I’d love to chat and share more details.\n\nThanks ",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1755609662.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Recruiting post for app developer with collaboration options.",
    "composite_score": 3.145940435567682
  },
  {
    "score": 32,
    "title": "Looking for backend/full-stack developer",
    "selftext": "Looking for backend/full-stack developer! \n\nMy team and I are currently working on developing an app for the equestrian community. During our market research we have found a huge gap in the market and a need for a solution like ours.\n\nFeatures we want to provide:\n- gps tracking\n- GPS guide \n- Database of tracked routes\n- Filtering that database\n- User-profiles\n- Calendar function \n\nWe have had some students who started working on developing the app using Swift and Java, mainly focusing on iOS coding. However, to our understanding it seems like they neglected the backend coding. \n\nWe therefore need some help in sorting out what the students provided and how to move forward. Preferably also someone who could help us solve this issue and get closer to launch.\n\nDue to our tight budget, since we’re a startup, we’re hoping to find a more affordable solution. \n\nSince we are based in Scandinavia we prefer someone who’s in the same times one or hopefully someone Scandinavian. \n\nDm for more info or if you’re interested! \n\n",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1763579324.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Recruiting backend/full-stack dev; budget note; not instructional.",
    "composite_score": 3.0434057381862925
  },
  {
    "score": 35,
    "title": "[Hiring] Mobile Developer",
    "selftext": "Hi guys, I’m finding a Mobile Developer with strong experience in React Native and full-stack development.\n\nWe’re currently looking for someone who can help us publish an existing app to the Apple App Store using the latest macOS and Xcode, and then continue supporting ongoing mobile and backend projects. The ideal candidate should have a solid understanding of API integration, backend systems, and consumer-facing platforms.\n\nThis is a freelance position for an individual developer only. We’re looking for someone who is reliable, cost-efficient, and available to start immediately.\n\nOur budget is flexible, depending on experience and skills.\n\n👉 If you’re interested, please leave a comment below. ",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1762702895.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Hiring post for mobile developer; lacks instructional content.",
    "composite_score": 3.1724993806787714
  },
  {
    "score": 35,
    "title": "I'm live-streaming how I build iOS apps fast and will be sharing my full development process as a senior engineer",
    "selftext": "links: [session 1](https://youtu.be/DTWP9i_GgAk), [session 2](https://youtu.be/I-ysff-Ia7s)\n\nI’ve been building apps for startups and businesses for over 6 years now through my own development agency. Over time, I’ve become known for delivering high-quality apps quickly and affordably — and now I want to share exactly how I do it.\n\nSo I’m going to be live-streaming my full app development process on YouTube — from planning and architecture to writing clean, scalable code for iOS, Android, and the web.\n\nThis isn’t just a build-in-public thing — I’ll be explaining my thought process, how I break down features, structure the codebase for growth, and all the tools and shortcuts I use to build fast.\n\nIt’s totally free — just something I wish I had when I was starting out.\n\nI’ll be going live starting tomorrow, and I’ll update this post with the link.\n\nIf you're an aspiring developer, freelancer, or just curious how real-world apps are built — you’ll probably find it valuable.\n\nLet me know if you have any questions or if there’s something specific you want to see!",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1752969145.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Promises to share development process and architectural thinking; educational in nature.",
    "composite_score": 2.7838025007672873
  },
  {
    "score": 31,
    "title": "Need full stack developer",
    "selftext": "We are seeking a skilled Full‑Stack Developer with expertise in Next.js and FastAPI to join our team immediately.\nThe ideal candidate must have proven experience building secure, scalable applications—paired with clean routing, authentication via JWT or OAuth, middleware architecture, and management of authorization contexts. Strong understanding of time and space complexity optimization is essential.\nPlease send a direct message with your portfolio and contact details if you're interested in contributing to a high-impact SaaS project.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1754505556.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.79,
    "category_rationale": "Recruitment post seeking a full-stack developer; no instructional content.",
    "composite_score": 2.997184000495044
  },
  {
    "score": 32,
    "title": "Looking for Developer to Help Build Clothing Social Media Platform.",
    "selftext": "I’m looking for a developer to help build a social media app focused around all things streetwear and other similar clothing. \n\nI've been working on the UI side in Figma and so can handle most of that although any experience/tips in it would be greatly appreciated. You’d handle the development side.\n\nThis could be freelance or a longer-term collaboration. Would be great to discuss all this in detail even just for some advice.  \nIf you're into fashion, streetwear, or just want to help build something cool, DM me.\n\nThanks!",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1754327995.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.77,
    "category_rationale": "Recruitment post seeking a developer to build a clothing/social platform; no steps or model.",
    "composite_score": 3.007614801911385
  },
  {
    "score": 29,
    "title": "MVP App Developer Needed",
    "selftext": "Hi, I’m building a **golf-club engagement app**  aimed at increasing retention at UK golf clubs. As always I have 101 features I'd love but the MVP must include features like:\n\n* Chat ability - peer to peer and group chats.\n* The app needs a **multi-tenant architecture**, meaning one codebase, one app… but many clubs using it.\n* The platform requires a **web-based Back Office suite** for each golf club. This lets club staff easily manage their content without technical knowledge. It should support **role-based access**, for example:\n   * **Club Manager** – full control (events, announcements, membership, matchplay, settings)\n   * **Pro Shop** – can upload lesson availability, special offers, teaching content\n   * **Caterer** – can post daily specials, menus, themed nights\n* Push Notifications ability\n\n  \nA few other features too but I assume the above to be the more technically challenging ones.\n\n  \n**Looking for a Developer Who:**\n\n* Has **solid portfolio examples** — I want to see previous apps you’ve built (MVPs or full products).\n* Can **explain your technical decisions** (e.g., why Flutter vs RN vs native).\n* Understands how to build something **scalable and clean**.\n* Can work with **Figma prototypes** (I already have early screens).\n* Comfortable planning **ongoing development costs** (not just build-and-run).\n* Communicates clearly and reliably.\n\n# Bonus if you have experience with:\n\n* Sports apps\n* Booking systems\n* Live chat/messaging\n* Real-time data\n* Membership systems\n* Clean UI/UX\n\n# What you’ll be building:\n\nA functioning MVP that clubs can trial — **not a toy demo**, but also not a full production platform.  \nCore features only, but built sensibly and future-proof.\n\n# To Apply:\n\nPlease send:\n\n1. **Links/screenshots/videos** of your previous apps\n2. **Short explanation of your preferred tech stack** and why\n3. Your **estimate for initial MVP** and **ongoing monthly support/maintenance**\n4. Your **process** (milestones, delivery style, communication, QA, etc.)\n\n# ",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1763372190.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.8,
    "category_rationale": "Recruitment post for an MVP app with feature list; primary value is hiring, not guidance.",
    "composite_score": 3.0750472605407344
  },
  {
    "score": 30,
    "title": "Need a Developer for my Startup (MVP built)",
    "selftext": "Need a developer for my Startup, We are working on a idea similar to Airtasker, Taskrabbit or can say like one time task/help/job app in my region. The mvp was built but we need developer to fasten the process of next stage  developments , we use flutter for frontend, .net , firebase . We need developers to make ui/ux look great , add functions, features of the app , etc., on development side . last but not least, I have less source of money to spend on my developers. We are happy to share profits based on  your contributions ( actually not making any money right now , but we mostly expecting in near future ) and make you a job if we liked your work and your interest to continue. To make it more professional and secure for both of us ,we can sign an NDA to pursue. ",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1755087090.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.82,
    "category_rationale": "Startup development recruitment post; describes project and NDA, not a how-to.",
    "composite_score": 3.1253183721557005
  },
  {
    "score": 29,
    "title": "Need App Developer",
    "selftext": "Hello developers,\n\nI work with a startup and we want to get a simple Android app developed and published on the Google Play store. \n\nIts a simple app with minimal functioning and logics.\nWe can pay you for the contract/Hire you as an intern/ or you can work with us as a freelancer.\n\nDm me or let me know in the comments if you are up for it, ill send the detailed document. \n\n\nLooking for someone:\n1. Who has experience developing and deploying apps on playstore\n2. Freshers are welcome as well \n3. Quick turnaround times\n4. Willing to provide some support post launch and during KT\n\nTLDR :Android app developer needed\n            App to be published on Play store\n            End to end project",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1706377717.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.75,
    "category_rationale": "General recruitment post for Android/iOS app development; no instructional content.",
    "composite_score": 3.0732875029352966
  },
  {
    "score": 28,
    "title": "App Developer wanted - Paid Opportunity",
    "selftext": "I am looking for an app developer that can create an ai integrated chat style app.  I have a prototype (nonworking) on flutterflow. Flutterflow experience is a plus.\n\nThe requirements are: Authentication, List style conversation history, able to upload images, AI integration.\n\nIf interested please DM me with a link to your portfolio.  US based developers preferred, potential for continued partnership for 2 other apps.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1755610036.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.76,
    "category_rationale": "App development opportunity posting; seeks portfolio and ongoing work, not a method.",
    "composite_score": 2.9964988599324536
  },
  {
    "score": 27,
    "title": "Looking for an app developer",
    "selftext": "App is going to be a golfing app, all the way from novice to professional! This would include a unique user experience, with them being able to locate courses nearby there would be an in  chat feature being able communicate with friends and also fellow golf colleagues. In addition it would track putts speed distance and direction of swings. There would also be link to the news and upcoming events happening in the golfing world as well as in the membership clubs what’s going on.\nThere would also be access to order from the bar snacks treats. Etc",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1755449239.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.74,
    "category_rationale": "Recruitment post for a golf app developer; describes features but primarily hiring.",
    "composite_score": 2.977595459178465
  },
  {
    "score": 28,
    "title": "looking for an app developer",
    "selftext": "# Project Brief: Premium Audio/Video Streaming &amp; eCommerce App\n\n## 1. Introduction &amp; Vision\n\nWe are seeking proposals from experienced mobile app developers (individuals or small teams) to build a complete, cross-platform application. The project is a closed, premium content platform for a single creator.\n\nThe core of the app is to provide an exclusive, intimate space for users to engage with unique audio and video content. The overall feeling should be rebellious, mysterious, and emotionally engaging. The concept is fully defined, and we are now seeking a technical partner for development and delivery.\n\n**Target Audience:** Adults (18+) looking for emotional depth, inspiration, and intimate audio/video experiences.\n\n## 2. Core App Functionality\n\n### User-Facing Features:\n*   **User Accounts:** Standard registration and login with username/password.\n*   **Secure Content Streaming:** Users can stream audio and video content securely within the app. **Downloading or exporting content must be prevented.**\n*   **Offline Access:** Content that has been previously streamed/loaded should be accessible for a limited time without an active internet connection.\n*   **Two-Tier Subscription Model:**\n    *   **Standard Tier (€9.90/month):** Access to all general motivational and exclusive content.\n    *   **Premium Tier (€12.00/month):** Full access, including all standard content plus a gated 18+ section.\n*   **eCommerce Shop:** A simple store to sell physical products directly.\n    *   **Key Product:** A physical book.\n    *   **Personalization Feature:** Customers must have the option to order the book **with or without a personal message** from the creator.\n*   **In-App Purchases:** Ability to purchase digital items, such as a full audiobook.\n*   **Push Notifications:** To alert users about new content releases.\n*   **Direct Messaging:** A simple feature for users to send messages to the admin.\n\n### Administrator Features (Web-Based Dashboard):\nA simple, non-technical admin panel is required for the creator to manage the entire platform independently.\n*   **Content Management:** Upload, manage, and organize all audio and video files.\n*   **Product Management:** Add, edit, and remove physical products in the shop (including inventory management).\n*   **Order Management:** View and process orders for physical products.\n*   **Customer Management:** View customer information and subscription status.\n*   **Simple CMS:** Ability to edit text on static pages (like the \"Home\" and \"Sponsor\" pages).\n*   **Analytics:** View basic sales and user statistics.\n*   **Settings:** Configure payment methods and shipping options.\n\n## 3. App Structure &amp; Screen Layout\n\nThe main navigation should include the following sections:\n\n1.  **🏠 Home:** A landing page introducing the creator and the mission behind the platform.\n2.  **🎧 Shorts:** A feed of exclusive, short-form audio and video clips.\n3.  **🔥 MindGasm (18+ Section):** A section containing sensual/erotic audio and video. This section must be strictly age-gated and only accessible to Premium Tier subscribers.\n4.  **📚 Audiobook:** An integrated player to listen to chapters of the creator's audiobook.\n5.  **📦 Book Purchase:** The dedicated shop page for ordering the physical book (with the personalization option).\n6.  **🏗️ Sponsor Page:** A static page dedicated to a corporate sponsor, containing their company information, a link to their website, and contact details (phone/email).\n\n## 4. Design &amp; Look-and-Feel\n\n*   **Style:** Professional, sleek, and mysterious.\n*   **UI Inspiration:** Dark \"Netflix-style\" interface. The layout should be clean, elegant, and focused on visual tiles for content.\n*   **Color Palette:**\n    *   **Background:** Black metallic.\n    *   **Accents/Borders:** Silver metallic.\n    *   **Typography:** Clean, elegant, and highly readable white font.\n*   **Logo:** A logo has already been designed and will be provided.\n\n## 5. Technical Specifications &amp; Expectations\n\n*   **Platforms:** The app must be developed for both **iOS and Android**.\n*   **Technology:** We are open to suggestions, but prefer a low-maintenance and self-contained stack.\n    *   **Cross-Platform Framework:** Flutter or React Native.\n    *   **Backend:** Supabase is preferred for its integrated features, but we are open to custom solutions (e.g., Node.js, PHP).\n    *   **Payments:** Subscriptions via Apple/Google in-app payment systems. Product purchases via Stripe or Mollie.\n    *   **Hosting:** A cost-effective, self-hosted solution (e.g., VPS). We want to **avoid vendor lock-in** (like Firebase) and complex, high-maintenance server setups.\n*   **Future Plans:** The system should be built with potential future expansion in mind (e.g., adding more products to the shop, new content channels).\n\n## 6. What to Include in Your Proposal\n\nPlease provide the following information in your response:\n\n1.  **Estimated Cost:** A quote for the full project delivery. Phased pricing (e.g., for an MVP and a full version) is also welcome.\n2.  **Project Timeline:** An estimated timeline for key milestones and final delivery.\n3.  **Proposed Tech Stack:** The technologies you would recommend for the app and backend.\n4.  **Portfolio:** Links to relevant past projects, especially those involving streaming, subscriptions, or eCommerce.\n5.  **Technical Approach:** A brief explanation of how you would handle key challenges like secure content streaming and the subscription system.\n6.  **Your Team:** Please state whether you are a solo developer or part of a small team.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1754412950.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.83,
    "category_rationale": "Extensive project brief seeking developers; recruitment rather than a how-to guide.",
    "composite_score": 3.00359487781044
  },
  {
    "score": 27,
    "title": "Looking for an app developer",
    "selftext": "I’ve built an app using lovable and supabase to help people track their spending in a new and simple way and honestly have the design about 90% the way I want it. \n\nI just need a developer to help me with:\n\n- Polishing up the final details in a way I’m not able to with Lovable\n\n- Simplifying the code as I have a feeling it’s quite messy right now. \n\n- Helping me with the backend (This is my first app, not sure what to look out for)\n\n- And ultimately get the app ready for testing. \n\nNot trying to make this the “next viral app”, more of a useful utility app that already exists out there, just with a more modern spin to it. Hoping to add a ChatGPT aspect to it, but that could be done later. \n\nWorking with a tight budget. Anyone able to help or point me in the right direction? \n\n\n\n",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1751840843.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.73,
    "category_rationale": "Seeking a developer to finish and test an existing app; not instructional content.",
    "composite_score": 3.001643033510229
  },
  {
    "score": 27,
    "title": "I’m searching an IOS App Developer",
    "selftext": "Hi, I’m new to building apps, but i have an Idea.\nWe all use WhatsApp, but the thing is: some kids doesn’t have a phone with a SIM card, they have an iPad or something else, but non a SIM card.\nSo what if we build an app like WhatsApp but the login is with Google Authenticator or something else like Microsoft Authentication, Apple Password app, etc.\nAfter the login, you create your profile:\n1. Choose your name, that you will give to other people to make them send you a friend request;\n2. A profile picture;\n3. You choose who can see like the last online, your profile pic etc.;\n4. And then you choose if you want to do chat backups.\n\nIf someone can help me i will be very grateful, for those wondering, I’m Italian and the app name will be Talksy.\nWho knows, maybe in the future Talksy will be on App Stores.\n\nBye\n\n\nMauro",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1760457161.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.71,
    "category_rationale": "Startup app idea pitch seeking an iOS developer; no process or model provided.",
    "composite_score": 2.9466920535173573
  },
  {
    "score": 28,
    "title": "My app was supposed to launch at the end of September, but my developer still hasn’t started.",
    "selftext": "Hello everyone, I need HELP. Since June, I’ve been trying to build an app with a developer. It was supposed to launch at the end of September, but he’s messing me around, he doesn’t meet deadlines and the app hasn’t even been started yet. The website isn’t even finished.\n\nThe app is meant to be a PWA, and right now I’m looking for a solution to this problem. Maybe I could switch to another developer, but that would likely be more expensive. Another option could be bringing in a CTO, but that’s hard to find for an early-stage project since my budget is only €10k, including hosting and everything else.\n\nDo you have any solutions?",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1757574225.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional vent about a developer missing deadlines and asks for solutions.",
    "composite_score": 3.0015226430979065
  },
  {
    "score": 24,
    "title": "Help a young aspiring app developer!",
    "selftext": "Hello! \n\nI'm a 18 year old university student in Sweden. I really want to learn how to build apps. The problem is that I really don't know where to start and how to set a good foundation for my learning journey. I have tried apps that make you do programming daily, but I don't know if they useful? Do anyone have any great tips, advice or recommendations? Lastly, I would be so grateful if anyone would like to agree on a online meeting where they could give me some guidence :)\n\nBest regards!\n\n",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1754768144.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Requests tips/advice for starting app development; no concrete guidance or list.",
    "composite_score": 2.7591513490831407
  },
  {
    "score": 25,
    "title": "Looking for App Developer",
    "selftext": "Hello! I just graduated from the University of Wisconsin and have been building my app Nomad for the past 8 months. The Figma design is nearly complete, the prototype was built and launched on test flight by another developer, and now I am looking for a co-founder to be my new partner.\n\nNomad is an application that allows users to choose travel activities based on recommendations and tips from people in their direct network. Similar to beli - but for all travel recs. Starting with the target market of students studying abroad.\n\nPlease reach out if you are interested in learning more!",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1753973707.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Seeking a co-founder/partner; collaboration request.",
    "composite_score": 2.841443352306837
  },
  {
    "score": 25,
    "title": "Looking for a developer",
    "selftext": "Hey, I have made an app for people who want to better their sleep. There is a sleep log, AI coach trained only on research papers, a habit tracker, and a progress tab. I've done it in Base44 in about two weeks, but it works quite well, and I'm looking for a person who would be interested to develop this 'start-up' together as a co-founder. If this idea sounds cool to you and you would be willing to co-work on it, reach out.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1758535828.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.61,
    "category_rationale": "Seeking a co-founder to work on a startup app.",
    "composite_score": 2.727697808659955
  },
  {
    "score": 25,
    "title": "Looking for websites developers",
    "selftext": "Hi, I run a online business, and currently I sell courses through Stan Store, its fine, but its growing quick, and I wanna be more professional. I'm looking for something like this website: [https://www.jamessmith.business/](https://www.jamessmith.business/) . As you can see, it sells courses on it. Please, just send me a msg if you know how to do it, quote and how long it would take. Thanks for that",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1758321332.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Hiring a website developer; asks for quotes and timelines.",
    "composite_score": 2.9242303179097617
  },
  {
    "score": 24,
    "title": "Looking for Developer to Help Finish Real Estate Offer App",
    "selftext": "I’ve built a working web app that lets users quickly submit real estate offers online. The core framework is in place, but I’m looking for a developer to help me finish it.\n\nWhat I need help with:\n\t•\tAdding interactive forms into the app\n\t•\tMaking it so users can fill out blanks directly on the form in a clean, user-friendly way\n\t•\tEnsuring the form data can be saved, processed, and exported (PDF or sent via email)\n\t•\tMobile-friendly and smooth UX\n\nRight now it’s a web app deployed on Replit, so experience with JavaScript, HTML/CSS, and potentially React (or wrapping for mobile) would be helpful.\n\nIf you’ve worked on form-heavy apps before, especially ones that handle sensitive data, I’d love to connect.\n\nDrop me a DM with your experience, examples of past work, and your availability.\n",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1754861795.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.63,
    "category_rationale": "Describes project and seeks a form-heavy app developer to join.",
    "composite_score": 2.8490190243431472
  },
  {
    "score": 23,
    "title": "Hiring mobile app developer (iOS &amp; Android) for feed-based news aggregation app",
    "selftext": "I’m building a cross-platform mobile app (iOS &amp; Android) focused on feed-based news aggregation.\n\nFigma is ~80% complete, and I’m now looking to hire a developer to build the app, with frontend and backend choices open to your recommendations based on experience, app needs, and scalability.\n\nCore requirements:\n-Cross-platform mobile app (iOS &amp; Android)\n-Backend-driven feed (not client-side aggregation)\n-Multiple API integrations\n-Deduplication of content across sources\n-AI-assisted discovery of content sources (RSS / web)\n-Push notifications and basic user preferences\n-Clean architecture that can scale as usage grows\n\nI’m looking for someone who:\n-Has built feed-based or content-heavy apps\n-Can recommend and implement the right frontend/backend stack\n-Thinks about performance, data flow, and maintainability\n-Is comfortable building from Figma designs through to production\n\nIf interested, please DM or comment with:\nYour preferred tech stack\nRelevant apps you’ve worked on\nHow you’d approach building a scalable feed-based app\n\nThank you.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1765600950.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.63,
    "category_rationale": "Hiring a mobile app developer; requests candidates and stack input.",
    "composite_score": 2.867603040020011
  },
  {
    "score": 24,
    "title": "I want to create an app with no experience how much will it cost",
    "selftext": "Hi! I have an idea for a dating app which is basically just like tinder bumble etc but you can filter people based on the diet they eat. \n\nI don’t have any code experience or anything. How much would it realistically cost to have a team do everything for me? And how would I go about doing it? Thank you any advice or thoughts are really appreciated.\n\nFeatures would be simple:\nSwiping\nEmail/phone sign up\nLocation based so you can find people close to you\nCustomer support\nNo payments free 100%\nChat\nFilters for diet and other simple things.",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1760356561.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks about cost and process to build an app with no experience.",
    "composite_score": 3.0513258758051602
  },
  {
    "score": 23,
    "title": "Looking for a app developer",
    "selftext": "Hello everyone, I am looking for a app developer who can help me with the production of a start-up IT Learning App. I want people to learn the different sectors of the IT Industry but not only that, I also want people to understand the dangers of the internet and ways to be safe online but I am only just starting to code and this project has been a passion of mine for a few years but never truly understood how to do everything but now im starting to get a better understanding of it all.\n\n  \nSo if there is any app developers out there able to help me make the app Keswyn - A IT Learning Hub come to life, please message me on here or at [keswyn@outlook.com](mailto:keswyn@outlook.com)",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1752883047.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.63,
    "category_rationale": "Looking for developers to help produce an IT learning app.",
    "composite_score": 2.8393121037451037
  },
  {
    "score": 25,
    "title": "What’s your game plan for app maintenance after launch?",
    "selftext": "\nWe launched our app a few months ago and now we're starting to hit that classic post-launch phase. We're seeing crashes on specific OS versions, random errors popping up in our Firebase logs, and some weird bugs that definitely weren't there in earlier builds.\n\nIt's also become pretty clear that we didn't really budget much for ongoing maintenance. We focused almost entirely on getting the development done and the app out the door. Now, it feels like we're constantly just reacting to issues instead of having a solid plan in place.\n\nWe have been looking into post-launch support for apps, and one option I'm considering is partnering with a dev agency that offers structured maintenance packages. But I'm still trying to weigh all the pros and cons for now.\n\nDo you have a dedicated process for post launch support? Are you actively monitoring crashes regularly, or do you mostly rely on user reports to flag issues? Also, roughly how much do you typically budget for monthly maintenance?",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1752074984.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Discusses post-launch maintenance and asks for processes and budgets.",
    "composite_score": 2.6165183414667896
  },
  {
    "score": 23,
    "title": "Looking for app/website developer",
    "selftext": "\n\nYes this is copy and pasted from freelancer, but the gist is there.\n\n  \nPreferably looking for someone in the US even better if you are located in PST time zone.\n\nI also have a simple mock I created on Figma to get the ideas flowing.\n\nIm looking for an experienced developer or team to create a comprehensive social media app and website.  \n  \nKey Features:  \n\\- Real-time messaging  \n\\- User profiles  \n\\- Content sharing (text posts, images, videos)  \n\\- User authentication via social media login  \n\\- advanced features like secure messaging(really want software or something to prevent screenshots/screen record)  \n  \nIdeal Skills and Experience:  \n\\- Proficiency in app and web development  \n\\- Experience with real-time messaging integration  \n\\- Strong UI/UX design skills  \n\\- Familiarity with user authentication protocols  \n\\- Background in social media platforms development  \n  \n\\*\\*\\*\\*\\*Must be willing to sign an NDA\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nPay in its entirety 5-10K\n\n  \nPlease provide a portfolio showcasing relevant projects.\n\n",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1766772772.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Job posting for hiring developers; not a list, explanation, or step-by-step guide.",
    "composite_score": 2.958212913529006
  },
  {
    "score": 23,
    "title": "Looking to hire a mobile app developer to join my team",
    "selftext": "Hey everyone,\n\nI’m looking to bring on a mobile app developer who’s solid with **Flutter** and comfortable working on an **existing application** (iOS + Android). There’s also a web version of the app, so experience in that area is a bonus.\n\nThe app itself is a **social media platform**, so you’d be working with features around profiles, feeds, interactions, etc. It’s already up and running, but I need someone who can help polish, improve, and roll out new functionality.\n\nI’m totally fine if you lean into **vibe coding** or use **AI tools** as part of your workflow — as long as you can deliver in Flutter and make the app better.\n\nWhat I’m looking for:\n\n* Strong Flutter experience (mobile dev focus, web experience is a plus)\n* Ability to jump into an existing codebase and figure things out\n* Team player mindset (this isn’t a one-off gig — ideally looking for someone who wants to grow with the project)",
    "subreddit": "AppDevelopers",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1757085132.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Hiring post for a mobile Flutter developer; does not fit other defined categories.",
    "composite_score": 2.793393123791099
  }
]