[
  {
    "score": 1075,
    "title": "NSFW AI Chatbot For Sexy Talk and Porn Chat",
    "selftext": "So I started this about a month ago as a web app but I am having doubts now. Not really for ethical reasons but mostly for competition. I see a bunch of nsfw ai projects popping up and I know I can do better from the tech side (senior web dev) but not sure I can challenge in terms of marketing.\n\nHas anyone worked on a similar project but gave up due to competition? Should I just launch the best nsfw chatbot I can and traffic will happen organically?\n\nThanks for the help and contributions, please no hate just helpful comments.\n\nAlso if you have used any of these and you believe one really stand out, I am curious to hear why as it can help the dev of my own app.",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 1075,
    "downs": 0,
    "created_utc": 1759228282.0,
    "media": null,
    "is_video": false,
    "num_comments": 352,
    "num_reports": null,
    "over_18": true,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asking for feedback on a competitive NSFW chatbot project; no clear list or actionable framework.",
    "composite_score": 5.0031996240242815
  },
  {
    "score": 539,
    "title": "My completely free budget tracking app reached 9347 daily active users",
    "selftext": "The turn of the month is coming up and in the past few days my app has peaked at 9,347 daily users. I just can’t believe I’m about to hit 10,000 daily users.\n\nAt the beginning of 2024 I made the app free, and since then the number of users has been growing continuously.\n\nI’m just so happy, thank you reddit! :)\n\n\\-----\n\nI was frustrated with budget tracking apps, especially recurring transactions. Every app I tried seemed to break down at some point due to time zone glitches, syncing errors, or missed/duplicated recurring payments.\n\nSo I built my own.\n\nIt’s completely free, simple, and reliable. No subscriptions, no ads, no tracking.\n\nWould love your feedback!\n\n[https://apps.apple.com/us/app/budget-expense-tracker-monee/id1617877213?uo=4](https://apps.apple.com/us/app/budget-expense-tracker-monee/id1617877213?uo=4)\n\n[https://play.google.com/store/apps/details?id=app.monee](https://play.google.com/store/apps/details?id=app.monee)\n\n\\[Monee is currently the #1 budget tracker in Germany on iOS and climbing fast in Canada, US, France and Italy. Android version was just released 6 weeks ago\\]",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 539,
    "downs": 0,
    "created_utc": 1759233478.0,
    "media": null,
    "is_video": false,
    "num_comments": 119,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.56,
    "category_rationale": "Shares growth metrics and asks for feedback; not a how-to or list.",
    "composite_score": 4.506984382846781
  },
  {
    "score": 389,
    "title": "Best ai girlfriend rn, my top 5 apps",
    "selftext": "Alright, so I've spent way too much time (and probably money) trying out all the AI girlfriend apps. Since people are always asking what's actually good, here's my personal, no-BS top 5 list right now.\n\n1\\. Candy\n\nHonestly, this is my go-to. It's the be⁤st all-rounder. The chat feels real, and the picture generation is just chef's kiss. The app is super clean and easy to get into, but it still has all the features you'd want. It just wo⁤rks.\n\n2\\. OurDream\n\nIf you're all about the visuals, this is it. The character creator is insane. You can literally tweak everything. The chat is good, but you're here to build your perfect visual partner, and nothing else really comes close on that front.\n\n3\\. Nomi\n\nThis one's for the feels. Seriously, if you want an AI that feels like an actual person with a personality, Nomi is the one. They remember stuff, have their own opinions, and the group chats are a trip. It's less 'chatbot,' more 'companion.'\n\n4\\. Kindroid\n\nFor the storytellers out there. If you're into long, detailed roleplays, Kindroid's memory is wild. It'll remember some random detail you mentioned weeks ago. The devs are also super active on their Discord, which is a huge plus in my book.\n\n5\\. Muah\n\nVoice chat. That's the magic word here. Muah's voice feature is creepy-good realistic. It completely changes the game and makes everything feel way more immersive. The other features are fine, but the voice is why it makes the list.\n\nSo yeah, that's my take. This whole scene changes so fast though. What are you guys using? Drop your top 5 below, I'm curious if I missed a hidden gem.",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.76,
    "subreddit_type": "public",
    "ups": 389,
    "downs": 0,
    "created_utc": 1765796632.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": true,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Explicit top-5 list of AI girlfriend apps with brief descriptions.",
    "composite_score": 4.145306081303467
  },
  {
    "score": 233,
    "title": "Looking for an honest review about Ourdream AI?",
    "selftext": "I've been looking for a good AI girlfriend app that can do voices and simulate calls, send nudes, have a chat with good memory and even maybe send quality videos. I've seen that there is a lot of different apps and websites and it is difficult to know which one is best or if it is all the same.  \n  \nI've noticed Ourdream is a website often recommended, that is why I would like the genuine opinion and reviews about Ourdream AI, **from those that have rally tried it**. I'm open to the reviews of any other website or app, if some of you compared a few that would be even better.  \nAlso wanted to know if Ourdream give the option to dl an app if you have the paid plan?  \n  \nI think it can be a good idea to dev the ultimate AI girlfriend app that can simulate all the real convo you can have with someone real: text message, voice message, photo, nudes, videos, calls, etc.  \nI suppose the challenge will be to get accepted on the appstore and playstore obviously",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 233,
    "downs": 0,
    "created_utc": 1760080988.0,
    "media": null,
    "is_video": false,
    "num_comments": 104,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests honest reviews of an AI girlfriend app; no steps or structured guidance.",
    "composite_score": 4.122310506945112
  },
  {
    "score": 159,
    "title": "Ultimate App for Making Beautiful Device Mockups &amp; Screenshots",
    "selftext": "Hey everyone!\n\nI made an app that makes it incredibly easy to create stunning mockups and screenshots - perfect for showing off your app, website, product designs, or social media posts.\n\n✨ **Features**\n\n* **Website Screenshots:** Instantly grab a screenshot by entering any URL.\n* **30+ Mockup Devices &amp; Browser Frames:** Showcase your project on phones, tablets, laptops, desktop browsers, and more.\n* **Fully Customizable:** Change backgrounds, add overlay shadows, tweak layouts, apply 3D transforms, use multi-image templates, and a ton more.\n* **Annotation Tool:** Add text, stickers, arrows, highlights, steps, and other markup.\n* **Social Media Screenshots:** Capture and style posts from X or Bluesky—great for styling testimonials.\n* **Chrome Extension:** Snap selected areas, specific elements, or full-page screenshots right from your browser.\n\n**Try it out:** Editor: [https://postspark.app](https://postspark.app/)  \nExtension: [Chrome Web Store](https://chromewebstore.google.com/detail/postspark-create-nice-scr/glpanohoedaffcnogfenhacnofnlggfc)\n\nWould love to hear what you think!",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 159,
    "downs": 0,
    "created_utc": 1761749075.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/20ks3glgc2yf1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1080,
        "width": 1624,
        "scrubber_media_url": "https://v.redd.it/20ks3glgc2yf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/20ks3glgc2yf1/DASHPlaylist.mpd?a=1770354099%2CZTA2YmIxNTBkMThmYWFmM2NlODBjYzEyNjhmNjE3OTU1NWFiNDBjMzQ2Y2JkNjEyM2EzMjljNGE1Njk0OTNjYQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 39,
        "hls_url": "https://v.redd.it/20ks3glgc2yf1/HLSPlaylist.m3u8?a=1770354099%2CYTA1ZDVlOTY4MGI5NTUzYWQ0ODM4YTVhYTJhMjVjZThmNzIxZTE1OTQzZGI1ZDZmYTZmMzk2YjgwZTI0YjI0NA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Promotional post listing multiple app features in a structured list.",
    "composite_score": 3.600229630022884
  },
  {
    "score": 99,
    "title": "Tinder but for beating each other up.",
    "selftext": "This is an awful idea i had today and i don't even think it's legal since it's just mutual combat with extra steps. But, imagine a Tinder-like app where you upload pics of yourself, with a small bio, your height and weight and other random shit, where you then have to swipe on other dudes' profiles left and right, except that the left swipe is \"I would lose\" and the right swipe is \"I would win\", and if both of you swipe right a chat opens where you can arrange an MMA match,and the results then get added to your record.\n\nIf you're on a winning streak you get flames and shit around your profile and you get a little title you can edit to become something like \"Michael 'The Chainsaw', 24\".\n\nYou're free to steal this genius and brilliant idea, only thing I ask is to get \"The Big One\" as my title when I make an account.",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1760218661.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Proposes a concept for an MMA dating-like app; not a how-to or list.",
    "composite_score": 3.480074989159953
  },
  {
    "score": 96,
    "title": "I built a completely free budget tracking app because every other app struggled",
    "selftext": "I was frustrated with budget tracking apps, especially recurring transactions. Every app I tried seemed to break down at some point due to time zone glitches, syncing errors, or missed/duplicated recurring payments.\n\nSo I built my own.\n\nIt’s completely free, simple, and reliable. No subscriptions, no ads, no tracking.\n\nWould love your feedback!\n\n[https://apps.apple.com/us/app/budget-expense-tracker-monee/id1617877213?uo=4](https://apps.apple.com/us/app/budget-expense-tracker-monee/id1617877213?uo=4)\n\n[https://play.google.com/store/apps/details?id=app.monee](https://play.google.com/store/apps/details?id=app.monee)\n\n\\[Monee is currently the #1 budget tracker in Germany on iOS. Android version was just released 5 weeks ago\\]",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1759071114.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Another post sharing budget-tracking app success and asking for feedback.",
    "composite_score": 3.4575111927873725
  },
  {
    "score": 69,
    "title": "Why I stopped asking \"what should I build?\" and started asking \"what are people already complaining about?\"",
    "selftext": "Probably going to get roasted for this but whatever.\n\nI used to be that guy scrolling through this subreddit for hours looking for the \"perfect\" startup idea. Bookmarked probably 200 posts. Built exactly zero things.\n\nThen I had this random realization while procrastinating (again) on Reddit: instead of thinking up problems, why not just listen to problems people are already screaming about?\n\nSo I started manually going through:\n\n1-star reviews on G2 and Capterra\n\nAngry rants in SaaS subreddits\n\n\"Looking for\" posts on Upwork\n\nTwitter threads where people complain about software\n\nThe stuff I found was gold. Not theoretical problems. Real \"I'm paying $200/month for this trash software and it doesn't even do X\" problems.\n\nWhat I learned:\n\nReal problems are boring. The flashy AI/blockchain/whatever ideas get upvotes here. The real problems are mundane. \"Our project management tool doesn't integrate with our accounting software.\" Not sexy, but someone's paying for a solution.\n\nVolume matters more than novelty. Found the same complaint across 50+ different sources? That's not \"market saturation\" - that's \"massive opportunity.\" If existing solutions were working, people wouldn't be complaining.\n\nJob posts are underrated goldmines. Upwork is full of \"I need someone to build a simple tool that does X because existing tools suck.\" These are literally people offering to pay for solutions.\n\nPain intensity &gt; market size. Would rather solve a $50/month problem that 1000 people are desperate about than a $10/month problem that 10,000 people are mildly annoyed by.\n\nThis approach completely changed how I think about ideas. Instead of \"what cool thing can I build?\" it became \"what existing pain can I eliminate?\"\n\nCurrently building something based on this exact process (launching next week, nervous as hell). The validation feels different when you're solving a problem you've seen hundreds of people complain about vs. something you thought up in the shower.\n\nAnyone else tried this complaint-mining approach? Or am I just overthinking the obvious?\n",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1748002261.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.79,
    "category_rationale": "Explains a mental model and provides a step-by-step approach to identify problems from existing pain points.",
    "composite_score": 3.2865680443502754
  },
  {
    "score": 55,
    "title": "Was excited to build an AI calorie tracker",
    "selftext": "https://reddit.com/link/1mr55d1/video/ot2ajmup18jf1/player\n\nWanted to build an AI calorie tracking app (even have features in mind), so i thought I'd be smart and research the competition first...\n\nWent on Screensdesign and found that the market is slightly saturated...by like 100+ apps lol. feels like showing up to a potluck with the same dish as everyone else 😆\n\nWhat would even make a new calorie app stand out at this point???! now i'm having an existential crisis. do I:  \na) build it anyway and pray  \nb) find a less crowded space  \nc) just eat tacos and forget this whole building thing\n\nhelp me brainstorm ideas or tell me to move on 😂",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1755280390.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests brainstorming ideas after noticing saturation; no steps.",
    "composite_score": 3.229788889039698
  },
  {
    "score": 55,
    "title": "I'm building an AI layer to fact-check Instagram Reels and TikToks because algorithms prioritize virality over truth.",
    "selftext": "Short-form video is the primary source of information for millions, yet it strips away all nuance and citations. Verification requires leaving the app and breaking the flow, so nobody does it.\n\nI built an MVP to automate this \"sanity check.\"\n\n**How it works:**\n\n1. **Share:** You are watching a Reel/TikTok/Short that makes a bold claim. You share the link to this app.\n2. **Analyze:** The AI extracts audio and visual text, then performs a grounded Google Search to cross-reference the claims against indexed sources.\n3. **Result:** It returns a confidence score (Verified/Questionable/Debunked) and, crucially, provides the missing context and direct source links.\n\n**The Goal:** This isn't an \"absolute truth\" arbiter. The objective is to reduce the friction of research. It provides immediate context to prevent misinformation from settling as fact.\n\nI am looking for feedback on the utility of this workflow. Would you use a \"context button\" for your social feed?",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1764509968.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/xwadrf1fbe4g1/CMAF_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1920,
        "width": 864,
        "scrubber_media_url": "https://v.redd.it/xwadrf1fbe4g1/CMAF_96.mp4",
        "dash_url": "https://v.redd.it/xwadrf1fbe4g1/DASHPlaylist.mpd?a=1770354099%2COTYwMTVhMDEwNjA4ZDM2YTNlYzM3NWJjZDgxNGY5YmJkYTcyMjc1NDMwNjA4ODhjZWJmMmIxNGM0OTI4ODU1Yg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 60,
        "hls_url": "https://v.redd.it/xwadrf1fbe4g1/HLSPlaylist.m3u8?a=1770354099%2CMmI5OWJmMjc4Njg4ZWI0NDI4MGUyMjc1MGNjYjQwY2Y1MGQ4ZWYyZjMxYTcwMDM0NGNjYTk4NzhiZTI1NWU3ZA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Outlines a three-step workflow for fact-checking videos and asks for feedback on the workflow.",
    "composite_score": 3.168869909085694
  },
  {
    "score": 54,
    "title": "Ultimate App for Making Beautiful Mockups &amp; Screenshots",
    "selftext": "Hey everyone!\n\nI made an app that makes it incredibly easy to create stunning mockups and screenshots—perfect for showing off your app, website, product designs, or social media posts.\n\nRecently launched a new feature - **Bulk Edit**. It allows you to edit multiple screenshots at once and export them all together!\n\nTry it out: [https://postspark.app](https://postspark.app/)\n\nWould love to hear what you think!",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1759134805.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/xikq2slwe2sf1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1080,
        "width": 1832,
        "scrubber_media_url": "https://v.redd.it/xikq2slwe2sf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/xikq2slwe2sf1/DASHPlaylist.mpd?a=1770354099%2CM2M1YzE3YTU2OGQwMGFhMmRlZmYwMDc2NzBhZGIxMDFiNzYxOTJjYTgyMjhlNGQ0YTYzMTcyZTM2ZDJiNjM3NA%3D%3D&amp;v=1&amp;f=sd",
        "duration": 32,
        "hls_url": "https://v.redd.it/xikq2slwe2sf1/HLSPlaylist.m3u8?a=1770354099%2CNWRhZThmNWZiYzViYzBkMTBmZmM4ODc5ZjI5MzdmMDcxNDE4MzRkNWZkMDFhM2EyNWY4M2RlNGJiZDQyNjg3OQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Promotional app description with feature mention; not a list or steps.",
    "composite_score": 2.6108776873262345
  },
  {
    "score": 45,
    "title": "gamification is mostly just annoying",
    "selftext": "Why does every app need points, badges, streaks, and levels? I'm trying to accomplish a task and instead i'm being interrupted with \"you've completed your first project!\" popup celebrations.\n\nThe only place gamification kind of works is for apps where the behavior itself isn't inherently rewarding, like exercise or language learning. But when i'm actually getting value from the core product, the extra gamification just feels patronizing.\n\nBeen looking at productivity apps on mobbin and the ones i respect most don't have any gamification. They just help you get things done without treating you like a child who needs gold stars. Maybe we should stop adding games to everything?",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1760672381.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Clear emotional stance about gamification being annoying.",
    "composite_score": 2.9398178230095366
  },
  {
    "score": 49,
    "title": "AI-Powered Audio-to-Text Organizer and Formatter App",
    "selftext": "**Idea:**\n\nA platform to translate audio to text, with added features for text formatting and organization. Users can upload mp3 files or record audio directly from the app/browser.\n\n**Functionality:**\n\nThe app would take prompts, like \"rewrite this as an email,\" or \"restructure this as a note for my team.\" The objective is to eliminate filler words and repetitions, ensuring a concise and readable format.\n\n**Added Instructions:**\n\nThe user can command the app to add headings, split the text into logical sections, and even move different topics to their appropriate place within the document.\n\n**Exporting:**\n\nUpon completion, users can easily export their organized text. This caters to those who find it easier to express their thoughts in audio, but struggle with the lack of structure in raw transcripts.\n\n**Applications:**\n\nWith the assistance of AI for rewriting and organizing, this app can help create notes, posts, or blog entries. It harnesses the convenience of audio expression and provides a refined, structured text output.",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1689162752.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Central concept explanation and features for an AI-powered audio-to-text organizer.",
    "composite_score": 3.0145156338638595
  },
  {
    "score": 46,
    "title": "I have a small app idea, to bring positive energy",
    "selftext": "I just really want to build this app because I think it can make the life more fun. \nBut I still haven’t had the chance to build it. So I want to share it here, if anyone is interested, just comment below.\n\nI might call it **LittleSmile**, or something like that.  \n\nThe core idea is a simple gamification app that gives users small daily quest.\n\nExamples:\n\n* Buy a flower for your wife today.\n* Send a warm message to your mom.\n* Wash your car this week.\n* Give a small donation or lucky money to a homeless.\n* Say Hi to a stranger.\n* Go to the park with your kids.\n* Call an old friend you haven’t spoken to in years.\n* Hug your grandma.\n* Plant a tiny tree on your desk.\n* Buy a coffee for your colleague.\n\nBasically, any small action that makes you smile — or makes someone else smile.\n\nI know if just like that, it’s quite boring and user would leave. It needs to be engaging and social to keep users motivated. So there are some expansions:\n\nYou can **share your story** when you complete a quest — anonymously or not. Others can **view stories** and send a “celebration” (like upvotes or karma).\n\nThere are achievement system: badges, streaks, leaderboards (maybe), or a “karma tree” that grows with every completed quest (like daily habit drink water apps)\n\nThere are so many ways to expand this idea, but I’d rather keep it **simple and meaningful first**.\n\nP/S: I don’t know why my last post was removed, it’s much more detailed than this.\n",
    "subreddit": "AppIdeas",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1760241687.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.75,
    "category_rationale": "Contains a list of daily quest ideas and expansions presented as examples.",
    "composite_score": 3.1122034787915203
  },
  {
    "score": 42,
    "title": "App idea after my daughter was ill",
    "selftext": "\\*I posted earlier but can't edit my post to include the image\\*  \n  \nWould you use an app that tells you when to take your medication and show any rules that need to be followed with it: eg penicillin is no food 2hrs before and 30mins after; your taking metronidazole so don’t drink alcohol; rifabutin effects efficiency of the contraceptive pill etc.\n\nMy daughter was very ill and prescribed 3x different antibiotics and I was struggling to keep track of when she had to take them, her last dose and if she could eat or not (I was starting to worry about the efficacy of the prescription). Ive created an app that helps you follow your dose efficiently and flags common conflicts/allergies/side effects etc. I thought others might benefit too, so I’m exploring turning it into a proper app. Would this be useful to you (or for your patients)? I’d appreciate any feedback, good or bad. Thank you! 🙏",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1751925350.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Describes an app idea with user scenarios and features, offering explanation and potential applications.",
    "composite_score": 3.0285740764353895
  },
  {
    "score": 41,
    "title": "I found a simple way to come up with great app ideas",
    "selftext": "So, I’ve been thinking a lot about what makes a good app idea, and I realized it’s actually pretty simple:\n\n1. Immerse yourself in a specific industry or niche.\n2. Try out similar apps and analyze how they work.\n3. Find an alternative (and better) way to solve an existing problem.\n\nThe *really* good ideas come from combining this approach with intuition or a spark of inspiration. And two weeks ago, I had one of those moments.\n\nI designed the entire app design, talked to 50–60 people to validate the idea aaaaaaand… I’m not a developer. So, now I’m looking for a cool dev to team up with",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1738254438.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Provides a numbered sequence of steps for generating app ideas.",
    "composite_score": 3.0282359643833097
  },
  {
    "score": 39,
    "title": "I'm sick of spending $7 per coffee so I'm building this",
    "selftext": "I’m exploring a concept for an app and would love your honest feedback.\n\n**The idea: A Café Hopping App**  \nIt’s a monthly membership platform where users get credits to redeem artisanal matcha and coffee drinks at curated local cafés. Kind of like ClassPass, but for coffee. You get to explore cool new cafés, it’s more affordable than paying full price each time, and you collect digital stamps with each visit that unlock rewards (like discounts, freebies, etc).\n\n* You get a set number of monthly credits to use on drinks.\n* Drink costs vary (1–3 credits) depending on price.\n* Every visit earns you a digital stamp. Perks increase the more you explore.\n\nWould you actually use something like this in your city? Would this concept be worth investing in if it had solid café partners and a user-friendly app? What would make you *not* use it?\n\nAppreciate any thoughts, critical or supportive.",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1754458071.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Promotional concept with features and questions, not a how-to.",
    "composite_score": 3.0744517896363677
  },
  {
    "score": 40,
    "title": "I built an app to help people prepare for the German citizenship test (Einbürgerungstest)",
    "selftext": "Hey everyone 👋\n\nI’ve been living in Germany for a while now and when I and some of my friends started preparing for the Einbürgerungstest (citizenship test), I realized how outdated most of the prep apps are.\n\nA lot of them only work in German which isn’t ideal if you’re still learning the language, have weird UI, or just feel old.\n\nSo I built DEU: Leben in Deutschland 2025, a simple iOS app to help people study for the test in a clean, easy and multilingual way.\n\nIt includes all 310 official questions, plus state-specific ones for all 16 Bundesländer. You can study in English, German, Spanish, Turkish, Arabic, Polish, Russian, Romanian, Italian, or Persian and it works completely offline.\n\nMost importantly, it includes detailed explanations for each answer, something we really wanted for ourselves and haven’t seen in other apps. I’m curious if others find that helpful too 🙂\n\nIf you’re preparing for the test yourself, or know someone who is, I’d love your feedback. I’m still tweaking a few things before adding more features like study reminders and better progress stats.\n\nYou can check it out here: https://apps.apple.com/de/app/deu-einb%C3%BCrgerungstest-2025/id6746731600?l=en-GB",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1761686581.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional post about a language/citizenship test app with feedback request.",
    "composite_score": 2.7368594819115573
  },
  {
    "score": 40,
    "title": "I created a tool to design mobile apps with AI (and export to Figma)",
    "selftext": "I created this tool that lets you **design mobile app** interfaces just by chatting, and then export them to *Figma* (and also *React* code for now).\n\nI won't mention the name because this isn't meant to be a promo post, but I want to find someone interested in trying it out.\n\nIf anyone thinks it could be useful and wants to try it out (in exchange for honest, unfiltered feedback :)) let me know in the comments and I'll get in touch and give you some free credits to test it out.",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1759931718.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/7h7bdkoh8wtf1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/7h7bdkoh8wtf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/7h7bdkoh8wtf1/DASHPlaylist.mpd?a=1770354099%2CZjU0MDY5NDYxYjhiY2E2MWNiMGM1NjI0NWViMzBkOWFhNTY0MGIxY2RhNzA0YTkyODIwMmJmZjI0MjBjYzVkMQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 17,
        "hls_url": "https://v.redd.it/7h7bdkoh8wtf1/HLSPlaylist.m3u8?a=1770354099%2CN2YzODJmZTk2ZDBmNTg5NDAyZWZiMmY3NDVlZWJmNmRmNjViMzZlZjM5ODIyZmJiYjFjMzQwY2IwOTg1NTYyMw%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional/product-pitch post for an AI design tool.",
    "composite_score": 3.3027838567197354
  },
  {
    "score": 38,
    "title": "Everyone is building apps, no one is selling?",
    "selftext": "**Everyone seems to chase the 10k MRR.**\n\nEveryone looks at the 1-in-a-million-stories of making it to a 10k MRR influencers.  \nEveryone is be able to build now-a-days with the rapid growth of tools.  \nNew (web) apps are launched every second. (very stupid ones most of the time)  \nNew tools/apps for building are launched every second as well.  \nEveryone seems to be focussed on the building part and its just a community of builders buying eachothers tools. No actual market.\n\nWhile...\n\nNOBODY seems to focus on building something to market. **REAL market**. Not another directory-launch-your-app tool or website. product hunt, dev hunt or whatever.\n\nWhy is nobody making a real contribution in selling the apps, their focus is just on builders trying to build more and more and more.\n\nThis makes me wonder...\n\nIf all influencers that are promoting building apps. Launching platforms. \"learning how to build with this next new great tool\". Then there seems to be something fishy going on here.\n\nIs it fake? Are we not ready? Or?\n\nWe are absolutely missing the go-to-market part in this builders paradise. But why? I think I know why. But what do you think?",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1752220434.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Analytical critique about market focus and go-to-market strategy in the app industry.",
    "composite_score": 3.0292158574101427
  },
  {
    "score": 37,
    "title": "I reached $10k+ revenue in 6 months thanks to this playbook",
    "selftext": "First things first, here's a screenshot of my [revenue](https://i.imgur.com/JTfOGbn.jpeg) from Stripe.\n\nI’ve been asked how we were able to grow our SaaS so quick so here’s everything we did (that worked) to take us from $0 to $10,000+ revenue in 6 months.\n\n# Validating before building\n\nBy now you have probably heard this but it was a key factor for us.\n\nWe started by defining a clear solution to the problem we were solving. The first idea was a platform where founders could build their products with the help of AI.\n\nSo we created a survey with 6-8 questions about the problem (founders failing to build successful products) and shared it in communities with founders.\n\nWe found out that if we managed to create a good solution, people were willing to pay a monthly subscription. Great. Now we can build it.\n\n# Talking to users\n\nSee the theme here? It’s always about understanding what your customers want. A product that no one wants is a dead product.\n\nSo we always made a point of talking to users. My brother and co-founder still has calls with users every week where he asks them questions to try to understand them better and most importantly, understand how we can improve the product for them.\n\nGetting in touch with users is easier than you think. Just send them an email a few days after they sign up and ask if they would be willing to get on a call. Keep it brief and make it easy for them to schedule.\n\nBut what if you don’t have any users yet?\n\n# Start with scrappy marketing\n\nI’ll tell you exactly how we went from 0 to our first 100 users.\n\nWe realized that our target audience hangs out on X (Twitter), especially in communities like build in public and startup.\n\nSo we set a goal of doing 5 posts and 50 replies every day for 2 weeks. I want to be super clear here. Don’t spam low value content—no one will check out your product.\n\nYou have to actually help people. The good thing is that you have probably built a product around a topic that you understand (if not, learn more and then build a product later).\n\nI have years of experience running a successful SaaS so when people ask questions about that topic, I can actually give them some good advice.\n\nThey will see my project in bio or I’ll mention it and that’s a potential user.\n\nThis method is hard work and it doesn’t scale but you have to start somewhere to get those first users.\n\n# Make an effort for the launch\n\nOnce we had gotten those first 100 users and improved our MVP, it was time for the official launch.\n\nI don’t recommend everyone to launch on Product Hunt but for us it made sense because our audience is there.\n\nOur plan for the launch was to spend 12 hours on launch day doing more of the scrappy marketing with a “Live on product hunt” link in our bio. We posted updates throughout the day about how it was going so people could follow along.\n\nWe also set up a camera in our office and live streamed the whole day with live stats from the launch.\n\nWith all this we were able to create a buzz around our launch and ended up getting 500+ upvotes and claim the #4 spot.\n\nThat got us around 500 new users in 24 hours and our first paying customers.\n\n# Spending 99% of our time on product\n\nSo far I have talked a lot about marketing and in the beginning we would spend much of our time on it.\n\nBut after getting that core of users we shifted to spending literally 99% of our time on product.\n\nA good product really is the foundation for everything.\n\nWhen people sign up for [Buildpad](https://buildpad.io/?ref=Reddit) we’ll often get emails like “btw, guys your service is outstanding! I never thought I could enjoy using a product so much, it makes addiction!” (a new user sent this yesterday so just using it as an example).\n\nThat is the reason we are able to grow.\n\nWhen Elon Musk acquired SolarCity he told the person he put in charge to not worry about sales tactics because truly awesome products spread naturally through word of mouth.\n\nIn the beginning you’ll have to do some scrappy marketing to get started but make sure you have an awesome product because that will take you further than anything.\n\nI can confidently say that we have the most awesome product for founders that want to build something that people actually want.\n\nAnd with the time we are spending on product, it will only get better, fast.",
    "subreddit": "AppIdeas",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1743172720.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.78,
    "category_rationale": "Explicit, sequential actions to replicate revenue growth (playbook).",
    "composite_score": 2.840008057305947
  }
]