[
  {
    "score": 318,
    "title": "What Hawk Tuah Girl’s Rise and $325K Exit Tells Us About Influencer Marketing Today",
    "selftext": "Not sure if anyone else here’s been following the whole “Hawk Tuah Girl” saga, but it’s honestly one of the craziest case studies in viral personal branding I’ve seen in a while and now maybe a warning sign?\n\nShe went from a random street interview in June to full-blown internet fame in weeks. Millions of TikTok views, launched a podcast (\"Talk Tuah\"), got picked up by Jake Paul’s Betr platform, even dropped merch. Textbook viral marketing arc. Then the twist…\n\nShe launched a meme coin ($HAWK) that hit nearly half a billion in market cap then it crashed 90% almost overnight. She claimed she didn’t profit, and said the SEC/FBI cleared her, but obviously the trust was gone. A lot of people felt burned.\n\nNow this week, her X (formerly Twitter) account which had massive reachh has been wiped and rebranded into a crypto meme page called \"Up Only Memes.\" A DM screenshot suggests she sold it for $325K.\n\nCouple of big questions for marketers:\n\n* Is this the new lifecycle of viral fame? Explode &gt; merch &gt;crypto &gt; cash-out &gt; disappear?\n* How do you build trust with a viral audience if you grow too fast?\n* Are these one-hit viral creators a smart brand collab or a reputational risk?\n\nAlso worth noting: selling your X account is technically against TOS, but people are obviously still doing it. Wild west stuff.\n\nI’ve run influencer campaigns and content-driven funnels for years, and I’ve never seen fame move this fast, or burn out this publicly. Curious what others here think is this the norm now, or a cautionary tale?\n\nWould love to hear from anyone who’s worked on brand deals with viral creators or meme accounts — what’s your vetting process like these days?",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 318,
    "downs": 0,
    "created_utc": 1753354497.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.129328084407595
  },
  {
    "score": 255,
    "title": "I launched a marketing campaign my got my company fined $25 million...",
    "selftext": "\n\nI can’t believe I’m even typing this. I work at a pretty big CPG company and we just launched a national campaign for a new “natural” product line. Everything looked good. The design team nailed the look, legal reviewed the copy, we got final approval, and everyone celebrated the launch.\n\nFew weeks later we got a notice from regulators saying one of our ingredient claims didn’t meet updated FDA rules. The claim had passed in the past, but the guidance changed recently and no one caught it.\n\nNow the product is being pulled from shelves, we’re getting hit with a big fine and my team has been in panic mode since last week. It’s brutal. I feel sick about it because I was the brand manager who led the launch.\n\nHow did we all miss it? \n\nFor anyone here working in CPG or regulated industries, how do you handle creative and packaging reviews? \n\nDo you use any tools that actually help, or is it just endless email threads between marketing and legal?\n\nAny advice would help. I never want to be in this situation again.\n\n",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 255,
    "downs": 0,
    "created_utc": 1762266498.0,
    "media": null,
    "is_video": false,
    "num_comments": 153,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.21450032573008
  },
  {
    "score": 156,
    "title": "Do you avoid using long dashes (—) in work writing because they “look AI-generated”?",
    "selftext": "Since ChatGPT became part of our daily lives, I’ve started noticing something interesting. People seem much more sensitive to well-structured text—good punctuation, clear formatting, and especially long dashes (—).\n\nSome have even started associating long dashes with AI-generated content. One of my clients recently told me: “Don’t use long dashes in the copy. I don’t want it to look like it was written by ChatGPT.”\n\nPersonally, I find this a bit strange. I’ve been using long dashes long before ChatGPT existed, and I remember seeing them regularly in professional writing, articles, and books as well.\n\nSo I’m curious:\n\n— Do you consciously avoid long dashes in work-related writing now? \n\n— Have clients or editors commented on punctuation choices like this? \n\n— Or do you think this is just a temporary overreaction to AI-written text?\n\nWould love to hear how others are handling this.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 156,
    "downs": 0,
    "created_utc": 1766912285.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9104203485697804
  },
  {
    "score": 95,
    "title": "Effective SEO / GEO strategies for LLM visibility?",
    "selftext": "Hey there. Hoping to pick your brains a bit. \n\nTo cut to the chase: CEO wants to go hard on LLM visibility strategies. He was pretty pissed when chatgpt and claude didn’t mention our brand, but kept recommending our competitors. I’m sure at least a handful of people here are going through the same thing, so I have to ask what’s working?\n\nI genuinely don’t like the LinkedIn guru fluff and I’d rather ask this here and get a straightfaced answer. Everything I’ve looked at mostly boils down to the same thing: Just do great SEO and you will have LLM visibility.\n\nI know we’re still guessing here, but maybe you guys have some more specifics you can share a bit here? I need an actual strategy, so please no generic advice about EEAT or whatever good practices. Help a feller out please?\n\nEdit: Thanks for the tips guys. I’ve been trying out Parse to see what our mention rank is on LLMs and it’s kinda low to non-existent atp. Hopefully we can improve on this over time with some of the things you’ve shared",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1753718044.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.641025689392687
  },
  {
    "score": 87,
    "title": "Looking to improve our marketing stack. Any advice?",
    "selftext": "**TL;DR:** 6-person agency reviewing our tech stack. Managing 6 D2C clients (\\~$15-40k monthly ad spend each). What tools are we missing?\n\nHi everyone, first time posting here, so hope this is the right place.\n\nWe've been running a growing agency (6 people) focusing on paid social and lead gen. Started with 2 clients about a year ago, now managing 6 accounts (\\~$15-40k monthly ad spend each). Reviewing our current stack. Is there anything we miss or should add? Here's our current setup:\n\n1. Perplexity AI - For research and content creation. The web-sourcing feature saves hours on finding credible sources. Much better than other AIs for factual data.\n2. Claude AI - Main copywriting tool. Gets the job done for ads and emails, sounds pretty natural. Tried Copy.ai and Jasper too - stick with Claude or switch? What are you using for ad copy?\n3. Telescope AI - For lead gen. Very easy to use and surprisingly accurate targeting. Perfect for teams who want results without the complexity.\n4. CRM - Started with Hubspot but testing Attio now. Hubspot works fine but feels clunky and outdated compared to Attio. Attio's interface is cleaner and more modern, but still deciding if it's worth the switch. Anyone tried both?\n5. Looker Studio - For client reporting. Basic but gets the job done for now.\n6. Semrush - For SEO and competitive analysis. The content marketing toolkit is surprisingly good.\n7. Canva - Quick designs for social and presentations. Works well enough for our current needs.\n8. Screen Studio - Client presentations and walkthroughs. Makes our campaign recordings look very professional and beautiful. Good long-term investment since it's a one-time purchase.\n9. Asana - Project management. Works for now but open to alternatives.\n\nLooking to optimize our workflow and add new tools as we scale. Any must-have recommendations we're missing or should try? Would be thankful for any feedback!",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 87,
    "downs": 0,
    "created_utc": 1731003764.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.43304329951
  },
  {
    "score": 68,
    "title": "Publicis cancer",
    "selftext": "Have you seen the campaign Publicis \"working with cancer\". I found out something really upsetting but also proving how this industry is full of garbage. A former Publicis in Canada who has a lawsuit against them over how she was treated after asking accommodations had been sharing her story on social Media.\nHer cancer has returned and she is badly ill now.\n\nThis is a harsh reminder of how broken this industry can be. There's a lot of talk, but people are often treated terribly even in these situations.\n\nMy wife faced breast cancer few years ago, and she lost her job too after treatment and her leave .\n\nLuckily I could afford and she could move on but not always is a happy ending like we had.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1765938190.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1909090820652177
  },
  {
    "score": 61,
    "title": "I built a business with my best friend… now it’s ruining both my life and our friendship.",
    "selftext": "I'm 32M and a few years ago I started a small business with a close friend from college (33M). Back then it was just a side hustle. We’d do design work, websites, socials, and split the money evenly. It was never huge but it felt fun, like maybe one day it could grow into something real. We used to daydream about being our own bosses.\n\nFast forward to now and it couldn’t look more different. My friend quit his job to go all in, while I’ve hung onto mine. The business doesn’t make nearly enough to support us both, and since I can’t put in full time hours, I only see a tiny slice of the revenue. We also split Bill's 50/50 that take big chunks from my share. The workload hasn’t changed though, I’m still dragged into client management, pitches, admin, finances, marketing. None of it’s paid, and the only time I can do it is nights or weekends, which I’m already giving up to keep my full time job afloat.\n\nIt’s gotten relentless. He calls, messages, books my calendar constantly. He’ll pitch ambitious projects to nonprofits that don’t pay and then announce that I’m the one delivering them. I’ve been pressured into pro bono work when I barely have the time for the paying clients.  Meanwhile I’ve got a mortgage, a finance, family to support, and a dog at home. I can’t live in “always on” mode anymore.\n\nWhat’s worse is I don’t even enjoy it now. The work is repetitive, AI is swallowing chunks of what we used to do, and it doesn’t challenge me like my actual job does. My friend bounces from idea to idea, most of which never get finished. He even wanted to hire someone new for admin when we can’t even pay ourselves properly. It feels like we’re just spinning our wheels, keeping ourselves busy for the sake of it, and I’ve lost faith that this thing is sustainable.\n\nThe problem is that he’s not just a business partner. He’s been one of my closest friends for years. We always said we’d make this our main gig someday, but I don’t want that anymore. I’m burned out, resentful, and scared of what this is doing to our friendship. At the same time, the economy is shaky and I’m terrified of losing my main job, if that happens I’d probably change industries entirely, not double down on a failing side hustle.\n\nSo how do I step back without blowing up a friendship that really matters to me? Has anyone here managed to walk away from a business without destroying the personal relationship behind it?",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1755867240.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3409406184661123
  },
  {
    "score": 56,
    "title": "After Years in Marketing, I Think I’m Done- Anyone else feel this way?",
    "selftext": "I’m 36F and have spent most of my career working in B2B marketing, mainly within agencies. I used to enjoy the fast-paced, demanding nature of agency life, working on different projects and constantly learning - but over time, I’ve realised that marketing just doesn’t bring me the same satisfaction anymore.\n\nI have two little kids, and the stress and burnout from constantly being “on,” even during my days off, has started to affect me deeply.\n\nAt this stage, I feel like I want something slower-paced - a role that actually feels fulfilling and meaningful, rather than just draining.\n\nI’m curious if anyone else has made a similar shift away from marketing - what did you move into, and are you happier ? \n\nThanks in advance  ! \n\n\nEdit : thank you all for your responses, appreciate it, it does make me feel slightly better that I’m not alone. I need to try and find something else that makes me happy. ",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1761075305.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.379968869175592
  },
  {
    "score": 51,
    "title": "What’s one marketing skill you wish you’d focused on earlier in your career and why?",
    "selftext": "Lately, I’ve been reflecting on how much time I spent early on chasing “hot” tactics (new platforms, trendy tools) instead of deeply mastering foundational skills like messaging, positioning or customer research.\n\nIf I could go back, I’d tell myself to get better at understanding *why* people buy and how to communicate value clearly, because honestly, platforms and trends change, but those human principles don’t.\n\nI’m curious: what about you guys? Is there a skill you now see as essential that you wish you’d invested in sooner? Maybe copywriting, analytics, branding, storytelling, media buying, or something else?\n\nWould love to hear what you’d prioritise if you were starting fresh today!",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1746427795.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.214154594018443
  },
  {
    "score": 52,
    "title": "Iman Gadzhi, should I trust him??",
    "selftext": "hi everyone , i got some questions . i'm new in the smma world .my friend just introduced me here and i got the course of iman gadzhi for free .im watching it right now but i just saw some people here call him a scammer and a liar . i'm just confused here . Is smma a good option for  somone like me , 20years and studying in college. is the other alternatives , like affiliate marketing.....  Thank you all",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1693416337.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.064412122152442
  },
  {
    "score": 48,
    "title": "What tools help you come up with creative video ideas for digital marketing?",
    "selftext": "Hi professors! I do freelance marketing for a mix of clients, from local cafés to small SaaS startups — and the biggest challenge lately is keeping content fresh, sometimes I feel like all of this is draining me...\nThey all have a huge passion for TikTok, but providing video ideas has exhausted me. You know, I can’t recycle the same video concepts across clients, but I also don’t have the budget to hire a full creative team for each brand.\n\nSometimes I just wish I could skip the blank-page brainstorming and jump straight into producing something that’s already close to a trend or has a proven structure.\n\nWhat do you all use to find new, creative video ideas quickly?",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1755443361.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1787567073883447
  },
  {
    "score": 47,
    "title": "Starting a Digital Marketing Agency Need Guidance from Experienced Marketers",
    "selftext": "Hey everyone,\nI’m planning to start my own digital marketing agency, and while I have experience in the field (SEO, social media, ads, etc.), running an agency is a whole different game. I’m reaching out to ask for honest advice, insights, and tips from those who’ve either started their own agency or are currently running one.\n\nHere are a few things I’d love help with:\n\n\t•\tWhat are the first 3 most important steps when launching an agency?\n\t•\tHow did you land your first client?\n\t•\tHow do you price your services when starting out?\n\t•\tWhat are common mistakes to avoid in the beginning?\n\t•\tIs it better to niche down or offer a wide range of services early on?\n\nI’m also interested in learning about your tech stack, client onboarding process, and any tools you can’t live without.\n\nAny input is hugely appreciated. Thank you in advance",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1747986648.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.12134685823139
  },
  {
    "score": 46,
    "title": "I really don't know what kind of content i can do without it looking as an ad, could someone help me?",
    "selftext": "I have been reading books about marketing (I don't have the resources to hire someone to do the marketing for me, so I have to do it myself), and all of them say that I need to create content that is useful, engaging, and doesn't look like an ad. \n\nThe problem is that every content that I do ends up being just an ad that nobody cares. I have no idea of how to create content related to my product that doesn't end up being a terrible ad.\n\nFor example (this is for a form builder plugin I have):\n\n* Thinking of my customers\\` pain points, I thought it was a great idea to add ai support to the plugin so inexperienced users could quickly do complex forms.\n* I worked for weeks to add this feature\n* I created a video about how easy it is to create those forms using ai\n\nThe result is that now I have a video explaining my plugin features... which basically is just an ad that nobody cares about. \n\nI know i suck at marketing but is something that i must do, otherwise i will keep creating products (or adding features) that nobody care about. \n\nSo could someone guide me, please? What kind of content could I do that people actually care about? What is the formula, or what should I be doing to communicate my product (or its features) in a way that people actually care about?\n\nThanks for the help.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1744835638.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9951618757748366
  },
  {
    "score": 43,
    "title": "What's Your Best Hack In Getting Good Creatives working with designers?",
    "selftext": "Running a DTC brand for 2 clients and having issues with one of the contract designers we have. They're spread across a few projects so all the creatives we're getting either look the same and are low effort or don't convert and are not performing well. \n\n  \nI can't change our designers but need help in giving them good briefs to work off of. We're getting only 2 static ads per week per brand and would ideally like to have more to do some testing with along with better inspiration.\n\nAny suggestions would be appreciated, thanks!",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1744488656.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.91804329951
  },
  {
    "score": 44,
    "title": "Struggling to find work post college",
    "selftext": "Hey guys, not sure if anyone has any ideas but it’s worth a shot. I graduate this December with a degree in Advertising, minor in Digital Marketing. I’ve been going crazy with job applications over the last few months- 200+. Everything from digital marketing to branding to social media management and I haven’t even come close to landing something. A few interviews but nothing great. I have a deep portfolio, and my resume looks clean with tons of prior work/internship experience. Anyone have any ideas?? Really don’t want to move back home post college, and I have the skills to really help a team. Just need the opportunity.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1764011909.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.06907643178414
  },
  {
    "score": 40,
    "title": "How to get reps to use my marketing pages?",
    "selftext": "I've slaved on making industry and account specific pages. Lots of research and sweating over messaging, proof points, and CTAs. All for sales resources and to help reps with their outreach, boss said I needed to make it more relevant and outreach. \n\nI'm new to the company and don't have a good relationship with sales, and they just ignore everything I submit. They seemed to have stuck to what they have like one pagers and the old decks. \n\nI don't want to nag or tell my boss they're not using my stuff. How do I get them to trust the pages enough to use them? Is it about incentives and culture? \n\nWe use Google Drive for everything and I shared it all with them through there, and it's not hard to check it out. Please help me get through to them? \n\n",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1758893316.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0361477747285317
  },
  {
    "score": 42,
    "title": "Are AEO tools really worth it?",
    "selftext": "Idk if I should invest into any AEO tool for my brand. I am currently doing pretty well with general SEO, but I am contradicted. A lot of people around me are using chatgpt and I am lost. I could invest into one but idk if it is really worth it. Have any of you used some and could recommend any cheaper ones to look into? or maybe the ones taht have free trial so I could try it out? Would like to really read some opinions about aeo in general.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1764587949.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.179000759092836
  },
  {
    "score": 38,
    "title": "How do you usually find genuine influencers without agencies?",
    "selftext": "Finding small but authentic influencers for lifestyle and startup projects has been taking up way too much of my time. Filtering through inactive accounts or creators who don’t really fit my niche is exhausting. I’ve tried a few influencer tools that work but can feel clunky with lots of filters, CSV uploads, or manual setup before you actually get anything useful. Recently, I experimented with Lessie AI, an AI-driven tool for discovering influencers. It’s still in beta and invite-only, but it helped me generate lists of influencers and founders based on follower count, niche, or activity. While it’s not perfect, it already feels faster and less bloated than some other approaches I’ve used. Has anyone else tried Lessie AI or similar tools for finding influencers? How do you usually discover collaborators who are genuinely active and responsive?",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1761049498.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0117464891059926
  },
  {
    "score": 37,
    "title": "Struggling with creative performance drops, did you fix it in-house or with an agency?",
    "selftext": "We keep running into the same cycle. Campaign launches, performance is good, and then the drop begins. We test small tweaks and sometimes it slows the decline but it rarely fixes the issue. This leads to the constant discussion of whether to handle everything in-house or bring in an agency to shake things up. The problem with agencies is you never know if they are just recycling the same ideas. On the other hand, in-house teams can get stuck seeing things the same way every time. For those of you who have been here, did you solve creative fatigue on your own or with an outside partner?",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1756410263.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.902847614455929
  },
  {
    "score": 38,
    "title": "I have certs, projects, and study daily. How do I land my first job?",
    "selftext": "I have hubspot social media marketing I &amp; II, and google DM skillshop cert. I've built my own website on wordpress, optimized it for SEO, I've experimented w google ads, learned how to keep track of analytics, ran a instagram marketing campaign w good results, and done a few mock SEO audits of local businesses. I want to get more hands on experience for all this stuff and feel like I'd benefit from working at an agency and learning from people w experience. \nAny recommendations for my next move? Job boards to look for entry level positions? Stories to share of how you got into the industry (in the last few years)? Ways that I could network w other entry level DMers? Or just any advice in general?",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1764097628.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8305362831799177
  },
  {
    "score": 35,
    "title": "What’s Your Go-To SEO Chrome Extension in 2025?",
    "selftext": "I’m currently exploring different SEO Chrome extensions and plugins to improve my workflow and analysis.\n\nThere seem to be tons of options out there — from keyword research tools to full-blown on-page analyzers — and I’d love to know which ones actually make a difference for you.\n\nWhether you’re an SEO pro or someone just learning the ropes, which extensions do you rely on daily? Any underrated tools or new releases worth checking out?",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1761580417.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0586942990756922
  },
  {
    "score": 35,
    "title": "10 Brutal Digital Marketing Lessons They Don’t Teach in Courses",
    "selftext": "* **Posting daily ≠ Growing daily** If it doesn’t connect, it doesn’t convert — even if you post 100 times.\n* **Nobody reads your copy if the hook sucks** You’ve got 3 seconds. Start strong or scroll on.\n* **SEO is slow… painfully slow** It works — just don’t expect magic in month one.\n* **Paid ads amplify crap too** Bad landing page? Weak offer? Ads will burn cash faster than a match.\n* **Your audience doesn’t care about you** They care about *what’s in it for them*. Market to that.\n* **“Going viral” isn’t a strategy** It’s luck. Focus on delivering consistent value instead.\n* **Email isn’t dead. Your emails are just boring** Stop sending newsletters no one asked for. Start solving problems.\n* **Vanity metrics are addictive but useless** 100 likes won’t pay your bills. Sales &gt; Shares.\n* **Most funnels leak like crazy** Track drop-offs. Fix one step at a time. No one converts on a broken journey.\n* **No one wins alone** Collaborate. Borrow audiences. Tap into communities. Growth is a team sport.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1752214240.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9664081216230898
  },
  {
    "score": 33,
    "title": "After 5 Years in Marketing, I’m Rethinking My Future in Performance Marketing",
    "selftext": "I’ve been working in marketing for the past five years, with the last four focused entirely on performance marketing. Over this time, I’ve worked with three different agencies and noticed that competition in digital marketing is extremely high. It feels like many people who don’t do well in other career paths end up moving into performance marketing, which drives down pay hikes since there’s always someone willing to do the same job for less.\n\nNow, with platforms like Meta and Google moving toward greater automation, I’ve started to feel burnt out both with performance marketing and the agency culture in general. I’m beginning to question whether I chose the wrong field. Should I consider changing my career path, or should I continue down this road?\n\n",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1761241972.0,
    "media": null,
    "is_video": false,
    "num_comments": 70,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1621080914017927
  },
  {
    "score": 35,
    "title": "What’s one underrated digital marketing skill you think everyone should learn?",
    "selftext": "I’m a digital marketer with about 1 years of experience, and I’ve been learning a lot from both work and communities like this one. While we often talk about SEO, ads, and social media, I feel there are other skills that don’t get enough spotlight but make a huge difference.\n\nIn your experience, what’s one underrated skill (like copywriting, analytics, community engagement, etc.) that every marketer should focus on? Would love to hear your thoughts and maybe discover some new areas to grow in.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1758952405.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1376814166080744
  },
  {
    "score": 35,
    "title": "Reddit Marketing?",
    "selftext": "Hi all! \n\nI have a company that provides software for case management - typically social workers, therapists… surprisingly financial professionals. \n\nI am trying to try some new marketing channels. Currently I do LinkedIn outbound , posting, and have been thinking about Reddit marketing. What is the deal with marketing on here? What tools should I use to get started? I’ve seen the dos and don’t of advertising etc. are there any Reddit marketing gurus you can point me to? 🤣 \n\nThanks!🙏 \n\n",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1748845240.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0736942990756924
  },
  {
    "score": 31,
    "title": "Anyone else feeling like their marketing job doesn’t match their values anymore?",
    "selftext": "I’ve been seeing a trend of marketers on LinkedIn saying they’ve fallen out of love with marketing, quitting their jobs or closing their agency. Honestly, I’m starting to feel it too.\n\nNot because I hate the job. I actually love it. I love pulling my hair on finding the right positioning, brainstorming creative campaigns, writing mean copy, etc. But the longer I do this, the more I feel the gap between what I’m good at and what I personally believe in.\n\nLike... Am I really spending my time pushing a new AI feature so someone can be 3% more productive and help their company scale faster with fewer people? Or launching a campaign that basically boils down to “here’s why you should buy more stuff you don’t really need”?\n\nI don't know where to stand. I love my job and the skills I get to use every day, but I also care for the planet and the people living on it. And sometimes this work feels completely at odds with that.\n\nJust wondering if anyone else here has experienced the same thing. Is there a way to stay in this field without feeling like you’re constantly compromising on your personal values and the person you want to be in this world?\n\n**EDIT:** Thank you all for sharing your stories! The biggest issue I have with my job is its environmental cost (which then impacts a lot of humans). Not colleagues, incompetencies, added value to the business itself, and whatnot. So to reframe the conversation, here's my follow-up question: **if you were given the opportunity to mitigate the environmental impact of your job, would you take it? What would it ideally look like for you?**",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1747918927.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.012184000495044
  },
  {
    "score": 31,
    "title": "What’s the best social media platform for getting business leads in 2025?",
    "selftext": "Hey everyone! \n\nI’ve been looking into different social media platforms to figure out where businesses are actually finding leads this year.\n\nSo far, I’ve checked out:\n\nLinkedIn – seems active, but not sure how well it converts\n\nTwitter/X – getting views, but not much engagement\n\nFacebook – feels pretty dead for this type of thing\n\nFor anyone doing outreach or lead gen in 2025,  what’s been working for you? Would love to hear what platforms or content types (ads, posts, videos, etc.) are bringing real results.\n\nAppreciate any tips or experiences you can share!",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1753094182.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.081756235207578
  },
  {
    "score": 31,
    "title": "What Do People Really Think About AI Ad Creatives?",
    "selftext": "I’ve been testing out a bunch of AI creative tools lately: Icon, AdCreative, and a bunch of AI-powered UGC platforms I found through LinkedIn signups.\n\nHere’s my honest take so far:\n\nIcon Ads: Consistent output, but most creatives feel templated. That’s not always a bad thing — if you’re battling creative fatigue, it might actually help.\n\nAdCreative.ai: A more advanced version of Canva, but ironically offers less creative freedom. It’s polished, but still feels boxed in.\n\nUGC Platforms: Disappointing. Many showcase real UGC on their landing pages, but what you actually get feels unmistakably AI-generated — stiff, overly clean, and lacking soul. I shouldn’t be surprised, but I kind of was.\n\nCurious, has anyone found an AI creative tool that actually *feels* human?\n\nP.S. Please don’t slide into my DMs pitching your AI agent. If it’s genuinely useful, I’ll find it and sign up, no need to ask.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1750901839.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.843195607847747
  },
  {
    "score": 31,
    "title": "I'm losing my sh*t. I guess I need therapy",
    "selftext": "Yeah, I mean..\n\r\nMeta says it drove 400 conversions.\r\nGoogle says it drove 380.\r\nShopify says 510 total conversions.\r\nMy CRM says 270 were actually new customers.\n\r\nHow is this even possible? I swear if one more dashboard tells me “you crushed it,” but my revenue report says otherwise… I’m gonna flip a f**king table.\n\r\nLike, is anyone actually trusting these attribution numbers anymore? Are you all using CAPI, MMM, experiments? Some black magic? \n\nI need therapy. Or a working attribution model. Maybe both",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1747289942.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.986541906679774
  },
  {
    "score": 30,
    "title": "How do I get organic clients",
    "selftext": "Hey Marketing guys, I am a new startup founder (Nexeo Security) and I have created website and socials but I don’t know how to get clients. Like I don’t want to spend on google ads or Facebook ads. Our primary service is Vulnerability Assessment and Penetration Testing (VAPT) report. Can any of you help me and tell me the most effective way to reach out to clients and actually get a client. \nThanks in advance. 😊",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1757419302.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0639597338485296
  },
  {
    "score": 28,
    "title": "After 16 years in marketing, these are my takeaways - can you share yours?",
    "selftext": "When I was 18, I decided to offer freelance marketing projects and try to make a living out of creative marketing work because I always wanted to do what I truly enjoyed. The journey was quite a tough ride, but eventually, I managed to hire a few people.   \n  \nTwo years ago, I actually left the business I created and started a new one. The old one is still running and remains in the family, but I honestly have no idea what’s going on there now because I’m so focused on this new venture.  \n\nI’m 34 now, and in my current business, I work with many people from the marketing industry. I’m lucky to be in a position where I can learn from them, as they collaborate with multiple companies, and I get to observe and gain insights from their experiences too. I absolutely love it!  \n\nI thought I’d share the top three things I’ve learned so far, especially for anyone newer to the industry:  \n\n1. Measure everything. Even if the results aren’t great, the data is incredibly valuable and helps you improve.  it's a learning process you can't make profitable campaigns straight away \n\n2. Automation beats doing things manually every single time, and it’s easier to set up now than ever before.  very valuable :) \n\n3. The more precisely you define your audience, the easier it becomes to create valuable written, graphic or video content. The better you understand who you’re speaking to, the smoother everything flows.  \n\nFeel free to share what you have learned. \n\n",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1765903705.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8905798799784495
  },
  {
    "score": 29,
    "title": "That moment of realization that your TV ads are being shown to people who would NEVER buy your product….",
    "selftext": "I had a wild moment this week. We reviewed our TV placements and discovered our ads were airing during shows absolutely no one from our target audience watches. Like… zero overlap. No wonder our results were flat. It made me think why are we still trusting the “old TV rules” when everything else in marketing is data-driven and customizable? I want something smarter something that actually shows ads to the right households, based on who they are and what they care about. If digital ads can be laser-focused, why are TV ads still stuck in broadcast-land??\n\n",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1765799993.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7476852725587815
  },
  {
    "score": 29,
    "title": "Google Ad Courses in 2025",
    "selftext": "Hey everyone, I was recently hired as a marketing manager at a friend’s small insurance brokerage where my main focus is lead generation. I’ve had some early success converting a lead through Facebook ads, but I’m eager to expand my skills and learn more about Google Ads. Are there any free courses you'd recommend for getting started? Also, curious to know - am I too late to hop on the Google Ads bandwagon, or is now still a good time to learn? ",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1759885972.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.905303136799156
  },
  {
    "score": 30,
    "title": "Marketing an upcoming app has been one of the hardest things I’ve done, feeling invisible most of the time.",
    "selftext": "I’ve been leading the marketing efforts for a startup app we’re building, and I won’t lie... it’s been one of the hardest things I’ve experienced so far.\n\nMost days it feels like I’m shouting into a void. I create content, post regularly, try to speak to our target audience… and yet engagement is close to zero. It honestly reminds me of those people handing out flyers at the mall that everyone walks past. People see the posts, sure, but barely anyone interacts or signs up.\n\nI know marketing isn’t just about posting stuff online. I get that it’s a mix of quality, timing, and strategy with a sprinkle of luck. But right now, it feels like luck just isn’t on my side. And with a sign-up target to reach, I’m feeling the pressure.\n\nOur niche is broad, and that’s part of the challenge. It’s difficult to narrow down the messaging when the app could technically serve a wide range of people. I'm trying to learn as I go, test different angles, and stay consistent but it’s hard not to feel discouraged sometimes.\n\nStill, I know this is part of the process. I’m not here to promote anything, just sharing what I’m going through in hopes that others who’ve been here can relate or share what helped them push through this phase.\n\n**Any tips, mindset shifts, or even hard truths would be super appreciated.**\n\nMarketing is a journey, and I’m open to learning every step of the way. :))",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1754545346.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.07274060967506
  },
  {
    "score": 29,
    "title": "Must have ai tools for marketing &amp; seo teams",
    "selftext": "Hii folks, i’ve been diving into ai tools to speed up marketing campaigns and improve seo workflows, and i’ve found some that really make a difference. if you’re in marketing or seo, here are ai tools i think you should check out right now:\n\nChatgpt:\ni use chatgpt to come up with campaign ideas, draft ad copy variations, and generate keyword-rich headlines when i’m stuck.\n\nSurferSEO:\nthis tool helps me plan and optimize blog content so it’s structured around what’s already ranking, which has been a game changer for seo.\n\nWalter Writes AI:\nhelps me rewrite ai-generated marketing copy to sound more natural and less robotic, which is key for avoiding detection and connecting with customers.\n\nGrammarly:\nkeeps every piece of marketing content clean, professional, and easy to read before publishing.\n\nWritesonic:\ngreat for quickly drafting product descriptions, meta tags, or social posts that don’t sound repetitive.\n\nProofademic:\ni like to check long-form content with proofademic to make sure it doesn’t look ai-generated, especially for important pages like landing pages or whitepapers.\n\nCopy.ai:\nuseful for coming up with dozens of headline options or brainstorming creative angles for campaigns.\n\nScalenut:\nhelps with seo-driven outlines and ensures blog posts cover related questions people are searching for.\n\nJasper:\ni’ve used jasper to draft marketing emails or catchy ad text when i need something quickly.\n\nLately AI:\nuses ai to repurpose blog content into multiple social media posts, which saves so much time for our team.\n\nwhat ai tools have helped you level up your marketing or seo work?",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1751891309.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.842345715408799
  },
  {
    "score": 29,
    "title": "How can I make money using digital marketing?",
    "selftext": "Hi, for reference I’m an 18 year old, just starting my second year of college.\nI’ve seen a lot of information about affiliate marketing, drop shipping, etc. and how these can be side hustles that’ll make money. \nI wanna start earning myself through these mechanisms but I literally don’t know where to start- I don’t have a social media page or anything relating to a brand page where I can sell, so I’ll literally be starting from scratch.\nAny advice is appreciated :)",
    "subreddit": "AskMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1751229845.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0438554825094557
  },
  {
    "score": 28,
    "title": "I heard a friend turn down a cold call, and as a cold outreach guy, I’m heartbroken!",
    "selftext": "So, I was with a friend from the corporate world, and I heard him receive a cold call. After listening to the sales guy for a few seconds, he told him to send an email. He said it a second time, “Just send me an email.” He then said, “Just because we are on a call doesn’t mean we changed how we do business; just send me an email.” The sales guy must have hesitated, because why would he need to send an email if they were already talking on the phone?\n\n\n\nA few minutes after hanging up, my corporate friend turned to me and said, “Huh! Another email from that shook-up Brian about web development services! Watch this!” He then went ahead and deleted the email while I watched.\n\n\n\nI then asked him why he didn’t tell the web dev guy he wasn't interested during the call, and he said, “That guy won’t leave me alone!”\n\n\n\nAre cold calls that irritating? Is that the way you feel when you’re cold-called? We could just as well stop cold calling altogether, focus on cold emails, and manage emails via EmailAnalytics.",
    "subreddit": "AskMarketing",
    "upvote_ratio": 0.68,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1748451289.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8918225432675833
  }
]