[
  {
    "score": 8489,
    "title": "Australian youth “giving up” early",
    "selftext": "Has anyone else seen the rise of this? Otherwise extremely intelligent and hard working people who have just decided that the social contract is just broken and decided to give up and enjoy their lives rather than tread the standard path?\n\nFor context, a family friends son 25M who’s extremely intelligent, very hard working as in 99.xx ATAR, went to law school and subsequently got a very good job offer in a top tier firm. Few years ago just quit, because found it wasn’t worth it anymore.\n\nHis rationale was that he will have to work like a dog for decades, and even then when he is at the apex of his career won’t even be able to afford the lifestyle such as home, that someone who failed upwards did a generation ago. (Which honestly is a fair assessment, considering most of the boomers could never afford the homes they live in if they have to mortgage today).\n\nHe explained to me how the social contract has been broken, and our generation has to work so much harder to achieve half of what the Gen X and Boomers has. \n\nHe now literally works only 2 days a week in a random job from home, just concerns himself with paying bills but doesn’t care for investing. Spends his free time just enjoying life. Few of his mates also doing the same, all hard working and intelligent people who said the rat race isn’t worth it.\n\nAnyone noticed something similar?",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 8489,
    "downs": 0,
    "created_utc": 1677746955.0,
    "media": null,
    "is_video": false,
    "num_comments": 2335,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.318144109464134
  },
  {
    "score": 4747,
    "title": "I genuinely feel like our future was sold and I want to just give up",
    "selftext": "I’m a 31 year old sparky and I would consider myself a pretty simple man. I want to just have a family home, raise some rugrats, work till I’m 60 and hopefully see through a retirement.\n\nI have no vices, don’t drink, don’t smoke and don’t gamble and don’t have any expensive hobbies. Despite all this, the basics of life have become so expensive to the point that I don’t think I’ll genuinely ever own a home. The clocks ticking and I’ll never be able to have kids because of a lack of financial security due to housing.\n\nI just don’t understand how our society ended up like this. Some of the older sparkies in my crew (50+) have multiple houses, spend and drink like drunken sailors and have a more spendy lifestyle. For the exact same job they live like kings while I’m stuck forever as a pauper. \n\nIt feels to me what I imagine fuedalism was like and I’m just a serf. This whole situation is rotten to the core. I just wanna live a simple life and be a good dad but I feel I was robbed of the opportunity because of greed and speculation.\n\nIt feels like the only way to make it in my generation is if you have wealthy parents or earn money that most of us will never see. How did we as a society make it so essential workers can’t afford the simple things in life like housing? Not all of us can be lawyers or doctors, society couldn’t function that way! And I’m sure we need sparkies around.\n\nIt certainly feels like a lucky country, for some but not all of us.",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 4747,
    "downs": 0,
    "created_utc": 1699737493.0,
    "media": null,
    "is_video": false,
    "num_comments": 1268,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.918241521329906
  },
  {
    "score": 4440,
    "title": "WFH is the single best thing to have ever happened to my career",
    "selftext": "The gains in my overall sense of well-being, happiness and productivity are enormous.\n\nI work in professional services and in a largely stressful field dealing with clients that can be very very difficult to deal with. I always dreaded going in to the office every day. Dealing with malignant personalities that are attracted to my line of work was also unpleasant.\n\nFast forward to almost 3 years later, I take out a three hour break in the middle of the day to head to the gym or swim I’m in the best physical shape I’ve ever been in my life. I don’t drink alcohol as much as I used to, which was to deal with the stress of work. I’m so much more productive and quality of my work has skyrocketed. Not to mention, weirdly enough I have been getting SO much positive feedback from clients. It’s gotten to the point that every week I’ll be forwarded an email from my director with clients giving me glowing praise. This never happened in person. A part of this I believe is that when working with people remotely they are judged on the quality of their work rather than how they look, speak or sound - whether we like to admit it or not lots of discrimination happens for all sorts of reasons. I have a ph accent and people sometimes comment on it.\n\nI only go in to the office rarely, once a quarter and the day of I just begin to dread it.\n\nI don’t think I can ever go back to working in an office ever again.\n\nWe need to make sure WFH is here to stay. To my extroverted friends out there, sorry!",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 4440,
    "downs": 0,
    "created_utc": 1676002506.0,
    "media": null,
    "is_video": false,
    "num_comments": 612,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.776211010432884
  },
  {
    "score": 3404,
    "title": "Went to a house inspection. Agent said the other older couple is making an offer. The older couple are my parents.",
    "selftext": "Long story short I went back for another final view at a house inspection. House was struggling to sell.  Didn’t sell during the initial campaign. I asked my parents to go have a look as well. \n\nNext day the agent rang and told me I better make a decision quick because the other older couple at the inspection were very interested and likely to snap it up by the end of the night. \n\nThe other couple were my parents 😂😂😂😂",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 3404,
    "downs": 0,
    "created_utc": 1685522700.0,
    "media": null,
    "is_video": false,
    "num_comments": 297,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.496725248286931
  },
  {
    "score": 3370,
    "title": "Financially, I would never work from the office ever again",
    "selftext": "No webcam except for twice-a-year performance reviews.\n\nNo $25 unhealthy lunches. No worrying about office gossip or politics. No having to engage with people I don't like. No petrol, public transport, *post-work fatigue*. \n\n10-15 hours saved per week, translating to **$100.96/hr** in my role if you break my salary down to per hour.\n\nHealthy blood markers, no chronic illnesses, healthy BMI (19.5), translating to **hundreds of thousands**, or millions of dollars, measured by health value. An unspoken long-term cost saved, and unspoken health issues saved.\n\nYes, you can eat healthy at work but it is far more challenging than home-cooking meals.\n\n**I don't see why financially companies don't adopt a full WFH strategy. If the business allows it, the business should move towards it. Everyone wins.** \n\n",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 3370,
    "downs": 0,
    "created_utc": 1751234501.0,
    "media": null,
    "is_video": false,
    "num_comments": 763,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.644305431808816
  },
  {
    "score": 3280,
    "title": "The australia we have made for our self.",
    "selftext": "So I own outright my investment property- I have a family there - they have been there for 11 years now - and for the most part I have followed the rental trends - in the 11 years it’s gone from 170/week till now where it was 289/week.\n\nI stopped increasing the rates when I paid in full for it in 2016.\n\nMy tenants are amazing they have painted it twice and even did the kitchen up for me - I just paid the materials. That was there choice - I just have them free rent why they where doing it. \n\nMy agent has been really aggressive about increasing the rent to 490 a week and to day I got email telling me that the current rate for my place is 550 a week - they charge 20% of my rent and if I do not increase it they will start charging me based on the market rate.. yup $110 a week..\n\nI no longer have a agent",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 3280,
    "downs": 0,
    "created_utc": 1677145213.0,
    "media": null,
    "is_video": false,
    "num_comments": 561,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.580874388170579
  },
  {
    "score": 2599,
    "title": "Buy a modern, safe car not a 90s Corolla. ",
    "selftext": "I've been an emergency service worker in rural NSW for 15 years, in that time I've attended a fatal accident around every 6 months, so at least thirty in total. I know the general consensus for people asking what car they should buy is a a cheap old Toyota.\n\nI agree they are reliable but not safe compared to modern cars. The correct answer is the safest car you can afford. A lot of fatalities could have been prevented of the victim was in a safer, modern car, old hiluxs and Corollas offer zero protection when traveling at 100kmph. It especially scares me when people have young children in the back. Driving is the most dangerous thing you will ever do. I've attended scenes where a head on collision has occurred, modern vs old vehicle, a lot of variables involved buy both sedans one from the 90s and one a few years old. Modern passages walked away, 90s model driver  killed. \n\nNewer cars are just safer. After a major accident if you could offer the family a time machine and tell them there loved one would survive if they drove a 100k Mercedes, they would all find a way to do it.\n\nThere is no point being financially savvy saving money on a car if it ends up killing you and your family. \n \nI'm sure there will people who argue they had an accident in their old car and they walked away while the other driver in a modern car was injured. There will always be outliers, just like the 90 year old man who smokes every day thinks it safe because he never got cancer. \n\nJust my two cents. ",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 2599,
    "downs": 0,
    "created_utc": 1725486634.0,
    "media": null,
    "is_video": false,
    "num_comments": 627,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.496453169839416
  },
  {
    "score": 2498,
    "title": "A crash isn’t always a good thing",
    "selftext": "I just had avocado on toast at a local restaurant with friends. They are excited about a market crash because interest rates will go down and they can refinance for a pool.\n\nI was working for a consulting engineering firm during the 2007 crash. We laid off hundreds of people over a few months, we had months of fear as years worth of pipeline of work dried up. I remember my parents panicked because while they were 7 years away from retirement, their nest egg was under threat and dropping fast. \n\nPeople were panicking and the PM had to give a live address to guarantee money in banks.\n\nLong story short, this may just be a blimp that will correct next month. Lower interest rates are nice, but crashes are real, scary and have real impacts on everyday people. Good luck to everyone as we navigate these times. ",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 2498,
    "downs": 0,
    "created_utc": 1744016668.0,
    "media": null,
    "is_video": false,
    "num_comments": 557,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.4760833555952395
  },
  {
    "score": 2406,
    "title": "Stripe is holding $8,000 of my money indefinitely. My post on r/stripe hit 16k views and was removed. Here are the receipts.",
    "selftext": "I run a small business in Australia. Stripe is keeping $7,946 of my money permanently. When I posted about it on r/stripe, it hit 16,000 views within hours. Then the mods removed it. Screenshots attached.\n\nThis is what happened.\n\nA client paid me $5,500 USD for completed AI development work. Stripe refuses to release it. Their justification: a completely unrelated $50 dispute from a random person. That dispute is already resolved. The person got their refund weeks ago. Case closed.\n\nDespite that, Stripe is using this resolved $50 dispute to hold nearly $8,000 that has nothing to do with it.\n\nKey facts:\n\n• I passed all verification requirements. Identity, documents, compliance checks. Dashboard showed all tasks completed.\n\n• Stripe froze my account the day before the payout was scheduled. Not during any investigation. They waited until the last moment.\n\n• Stripe claimed they would refund money to customers within five days. My client confirmed they received nothing. Stripe kept the funds.\n\n• My client provided a signed statement confirming the payment was legitimate, the work was delivered, and no dispute will ever be filed. Stripe ignored it.\n\n• All communication from Stripe is a copy-paste response: “high risk.” No explanation, no evidence, no path to resolution.\n\nThe numbers:\n\nDisputed amount: $50\nAmount Stripe is keeping: $7,946\nRatio: 160 times the disputed amount\nThe dispute is from a different customer and is already resolved.\n\nWhat I’ve done:\n\n• Complaint filed with Stripe. Their final answer: “We’re keeping your money.”\n• Complaint filed with AFCA (Australian Financial Complaints Authority). Case number: 12-25-334332\n• Final Notice filed in SA Magistrates Court. Case number: FNL-25-010285\n• Report filed with ACCC for unconscionable conduct. Reference: accc-report:0098524\n• Posted on r/stripe. Removed after going semi-viral. Screenshots attached.\n\nI followed every rule. Verified identity. Provided documentation. Delivered the work. My client is happy. Stripe decided to keep the money anyway.\n\nIf Stripe can withhold funds arbitrarily, ignore evidence, and silence criticism, every small business is at risk.\n\nSharing this so others understand the danger before relying on Stripe.",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2406,
    "downs": 0,
    "created_utc": 1765222170.0,
    "media": null,
    "is_video": false,
    "num_comments": 276,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.345215974807254
  },
  {
    "score": 2149,
    "title": "Update: Slashing our insane takeaway spending",
    "selftext": "Just over a month ago, I posted about my family's out-of-control spending on takeout/restaurants ($700 per week!) and groceries ($430 per week). It was a real eye-opener, and I got absolutely flamed for it—some people even called me a deadbeat dad. That one stung. But I wanted to come back with an update because, despite the backlash, I took the criticism on board and made some big changes.\n\nSince then, we’ve managed to cut our takeout spending down to an average of $200 per week and groceries are now around $450 per week. It’s still a work in progress, but that’s a $500 weekly cut, or over $25k per year saved. That’s a whole family holiday (or two) right there.\n\nWhat helped:\n✅ Meal prepping &amp; batch cooking – We make large portions ahead of time so there’s always something easy to heat up.\n✅ Having backup \"lazy meals\" – Instead of defaulting to takeout, we have super quick, low-effort meals (e.g., pre-made burrito bowls, frozen stir-fries, or even just toasties).\n✅ Setting rules – No mid-week takeout unless it's planned.\n✅ Mindset shift – Instead of “stuff it, just get takeout,” we remind ourselves of the savings and what we’re working towards.\n\nWe’re still crazy busy (full-time jobs + running a sports club + kids in sports five nights a week), so we’re realistic that some takeout is unavoidable. But this change has already made a huge difference—not just financially but also in how we eat and how we feel.\n\nFor those who gave constructive advice—thank you. It actually helped. And for those who just trashed me, well… enjoy your outrage, I guess.\n\n\nOriginal:\nhttps://www.reddit.com/r/AusFinance/comments/1hu2t60/someone_help_me_not_feel_like_a_crazy_person_with/",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 2149,
    "downs": 0,
    "created_utc": 1738901091.0,
    "media": null,
    "is_video": false,
    "num_comments": 321,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.30636639576352
  },
  {
    "score": 1949,
    "title": "Finally hit 200k savings at 32M. At 24 I had nothing. ",
    "selftext": "I remember buying a cheap watch with the very last of my money and pulling apart the car, cupboards and couch to gather coins for food later in the week. I was about to turn 25 and realized I was failing to thrive as an adult. \n\nI just hit 200k in the bank this week at 32. Turning things around has been slow going but it can certainly happen.  I'm still renting with my partner and feel like I'm a long way behind people who bought property in their mid-late 20s, but am celebrating this milestone tonight!",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 1949,
    "downs": 0,
    "created_utc": 1712216380.0,
    "media": null,
    "is_video": false,
    "num_comments": 393,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.247782722275305
  },
  {
    "score": 1910,
    "title": "I just paid off my mortgage, gosh , it feels good.",
    "selftext": "Twenty years to pay it off. I saved , then every  year , I would look and think, how much of this can go towards the mortgage, sometimes, bugger it , all of it. It’s amazing it’s not as if I borrowed a heap in 2005, just $250,000 but I still took 20 years of saving. I really feel for the people owning $800,000.\nWhat with cost of living and TAX. You put $20,000 of hard earned savings and it hardly puts a dent in it. Housing now is so expensive. ",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1910,
    "downs": 0,
    "created_utc": 1747085257.0,
    "media": null,
    "is_video": false,
    "num_comments": 335,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.2644303257499345
  },
  {
    "score": 1824,
    "title": "Got scammed tonight - help",
    "selftext": "Got a phone call tonight from someone saying they were calling from my bank (they got the bank name correct). They said they were investigating a suspicious transaction and wanted to talk to me.\n\nAt first I was (rightfully) suspicious and said maybe I should call the police. The person on the line said there’s no need to as the bank was already working with the police. The person then gained my trust by saying they were legitimate as they were in my system and could see my details. They then told me my date of birth, address, and recent transactions.\n\nThe person said before we could talk they needed to authenticate my identity and asked me to repeat back a text message code I got from the bank. I did so and whoosh the money was sent via pay id to another account.\n\nIs there any chance I can get the money back? What do I do to maximise my chances?\n\nNote: I have already lodged a police report and have also contacted the bank. Bank immediately blocked all further transfers but, since I made the call after hours, they couldn’t help me further until the morning when the anti-fraud team comes in.\n\n**EDIT: bank found 60%+ of the money already. Currently they are trying to find the rest.**",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1824,
    "downs": 0,
    "created_utc": 1703082236.0,
    "media": null,
    "is_video": false,
    "num_comments": 1025,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.486836549180392
  },
  {
    "score": 1812,
    "title": "Is anyone here on under $100k a year",
    "selftext": "I’ve been curious for a while. Most of the people I know aren’t at 100k a majority of them are under 85k. So is there anyone here that’s under 100k?\n\nI mean I know people who are on 100k+ but they are all in their late 30s\n\nSo to whoever’s reading this. \n\nWhat are you on? What do you do? How old are you? How long have you done what you’re doing.\n\n\nEdit: for the people who said ‘OP didn’t share’ \n\n\nI’m will be on 0 income starting tomorrow (Between jobs)\n\nBut I was on 54k a year as a undergrad. If you look at my previous post you might be able to see what I did.",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1812,
    "downs": 0,
    "created_utc": 1685861135.0,
    "media": null,
    "is_video": false,
    "num_comments": 3020,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.688473166732149
  },
  {
    "score": 1798,
    "title": "Cutting student debt by 20% - today the bill was introduced in parliament",
    "selftext": "As promised this was one of the first priorities now that parliament has began to sit again. This will still need to pass both Houses of Parliament before the following can be done:\n\n- The ATO will commence retrospectively applying the 20% reduction to the balance of your HELP debt as at 1 June 2025 and the indexation that was applied will be adjusted to reflect the reduced debt amount. \n\n- The minimum repayment threshold will increase to $67,000 in 2025-26\n\nhttps://www.studyassist.gov.au/news/legislation-introduced-reduce-help-debt-20-and-change-help-debt-repayment-rates#:~:text=On%2023%20July%202025%20the,required%20to%20start%20repaying%20their\n",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1798,
    "downs": 0,
    "created_utc": 1753267464.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/i6fnj9kaslef1/DASH_720.mp4?source=fallback",
        "has_audio": true,
        "height": 1280,
        "width": 718,
        "scrubber_media_url": "https://v.redd.it/i6fnj9kaslef1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/i6fnj9kaslef1/DASHPlaylist.mpd?a=1770354131%2CMDIwODI1YTZmYjVkZDkzZDNmZWY0ZmI5NmM4Y2M1MDk1ZDM0MzA2ZDQ1YTU0ODIyOGUyZjkzNWE0NzFhZTJjZQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 9,
        "hls_url": "https://v.redd.it/i6fnj9kaslef1/HLSPlaylist.m3u8?a=1770354131%2CYmI4NDRjODM5OGEwZWJjNzYxYzkzMDZhNWVkNGM2YjY2MDU0ZjkzNDliNTAwYmYyYTYzYzYwZGNlZTRjMTQ1Mg%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 751,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.383140083641373
  },
  {
    "score": 1760,
    "title": "Doxxed myself - be careful",
    "selftext": "A friendly reminder. \nNo all on this sub are friendly, if you offer advice, opinions or your experience please be careful that some people might be out there adding together the puzzle to try and figure out who you are, where you work and hold that against you. \n\nA little shitty that someone has tried to blackmail me, especially when they got some key things wrong, but just a heads up. Be careful what you share and how you offer support. Not everyone here has the best of intentions. \n\nI know, this is a shitty post, but just something to keep in mind when trying to offer support. ",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1760,
    "downs": 0,
    "created_utc": 1737881518.0,
    "media": null,
    "is_video": false,
    "num_comments": 133,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.036811755149681
  },
  {
    "score": 1730,
    "title": "Most middle class families in 90s lived pretty basic",
    "selftext": "I’ll just put this at the start. I completely recognise that housing prices relative to wage are out of control (and yes impacts me, I’m 30).\n\nBut the way people post on this sub and say they don’t have the quality of life because don’t have a brand new car, go on overseas holiday and have a home etc compared to the past is wild.\n\nMiddle class in the 90s / 2000s was nothing like that. My parents were both teachers. They only drove second hand cars. A holiday was one every one or two years… often to Adelaide to stay at Grandmas. I didn’t know a single person in primary or high school going overseas. Families had the single mortgage they were paying down. A lot of comforts / goods available now wasn’t back then. Going out for dinner was for parmigiana night at the local club. \n\nPoint being is that people take the current and absolutely real negatives, but they then compound their misery by imagining they can’t live their imagined “middle class life” of European ski trips and $60k car.",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 1730,
    "downs": 0,
    "created_utc": 1713590491.0,
    "media": null,
    "is_video": false,
    "num_comments": 675,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.298270415846211
  },
  {
    "score": 1635,
    "title": "How did it go so wrong so quickly?",
    "selftext": "20 years ago households required ~37.5 hours of work to financially maintain a home. \n\nToday households require ~80 hours to financially maintain a home. \n\n20 years ago 1 income earner working 7.5 hour days with a 20min commute bought a ~800sqm suburban home - they raised 2.5 kids and had a partner who stayed home and dedicated their time to maintain the home. \n\nToday 2 income earners are required to work 8 hour days with a 35min commute to and from their ~350sqm PPOR and because they both have to work they pay a service to raise their 1.4 kids. \n\nTo top it off maintaining a house still requires 40 hours of work that isn't getting done as both partners work. So now not only do you have 80 hours of work you also have 40 hours of home chores to keep up with. \n\nThen you read articles that population growth has plummeted and all you can think is duh. \n\n\n\n\nEdit: alot of claiming 2004 was hard too and it should be closer to 30 or 40 years.\n\nHere are the numbers taken from ABS and finder.\n\n\nAverage yearly salary to Average House price for Australia.\n\n1984 - 20,000 salary 60,000 house (1:3)\n\n1994 - 34,000 salary 141,000 house (1:4.14) \n\n2004 - 56,000 salary 308,000 house (1:5.5) \n\n2014 - 79,000 salary 512,000 house (1:6.48)\n\n2024 - 103,000 salary 958,000 house (1:9.3)\n\n\nVariable Interest rate at the time and what the min repayment would have been for an for average priced home at the time assuming 20% deposit.\n\n1984 - 60,000 @ 11.5% = 110pw\n\n1994 - 141,000 @ 8.5% = $200pw\n\n2004 - 308,000 @ 6.25% = $350pw\n\n2014 - 512,000 @ 4.95% = $409pw\n\n2024 - 958,000 @ 6.70% = $1141pw \n\n\nWeekly Min repayment : average single weekly wage \n\n1984 - 110:385 = 30% \n\n1994 - 200:654 = 30%\n\n2004 - 350:1077 = 32%\n\n2014 - 409:1519 = 26%\n\n2024 - 1141:1980 = 58% \n\n\nSomeone smarter than me fact check me and make a new post. I scribbled all this on the back of a napkin and dropped it in - I'm not 100% sure if the wages are right as there were FT public and FT private wages (and for some reason it's done in weekly not annually) so I just used the biggest number I could find for that period. \n\nNot sure if morgatges were all 30 years back in the 80's or 90's but all min repayments were done on 30 years. I used Figura.finace repayment calculator to get the min repayment. ",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1635,
    "downs": 0,
    "created_utc": 1729178384.0,
    "media": null,
    "is_video": false,
    "num_comments": 622,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.323527322664889
  },
  {
    "score": 1615,
    "title": "The numbers behind why GP's can not continue to Bulk Bill",
    "selftext": " \n\nFull disclosure, I am not a GP but a doctor in another private practice area.\n\nI saw a thread recently with an article stating that the standard consult fee (item 23/level) will be rising to around $100 and people were dismayed and stating how unfair it was. The MBS rebate for item 23 is $41.20 , meaning the overall gap would be approx $58.8.\n\nIf a GP was to Bulk Bill a patient, it means that the GP is happy to accept the rebate alone as the cost of the consultation. Meaning the patient doesn't pay at point of service. The AMA publishes a fee list, which I can not actually quote, but this fee list is simply the same medicare item numbers, if medicare had kept up with inflation, and is a reccomendation.\n\nUnfortunetly, because the government has not kept the rebate up with inflation and the Gillard GVT initiated a freeze, which the Conservative GVT continued, this has compounded the erosion of your rebate as a patient. You have to remember, the rebate that is assigned to the consultation is YOURS, you as the patient own the rebate and are responsible for lobbying the GVT to increase your rebate.\n\nTo run the numbers a little, if a GP bulk bills and gets the $41.20, around 40% of it automatically goes to the clinic (this varies between 30-50% depending on the clinic). Meaning that the GP only ends up with $24.72. Of that, around 10-15% (lets assume 12.5%) goes to sick leave, annual leave and insurance, as they are contractors. Leaving the GP with $21.63, and then a further 10.5% goes to super, again because they aren't paid super as contractors. Therefore, in total for a consult before tax, they are paid a paltry $19.36. Could you even get a lawyer to respond to an e-mail for $19? Let alone expect a medical professional to take a history, perform an examination, write a referral for investigation, write a medication script which may have interaction or side effects and then also accept medicolegal responsibility for everything they have done, for $19. Is there even a tradie in Australia that would pick up the phone for a job netting them $19?\n\nOn top of this, the amount of unpaid overtime continues to explode. Reviewing results and conversations with other specialists and clinical governance takes up a lot of the working day. Most GP's are spending 1-2 hours per 6-8 hour consulting time on clinical governance. Yes, that's right, just because you spend 15 minutes in the room with the Doctor doesn't mean that they didn't spend an additional 5-10 minutes on the backend doing various things related to the consult (unpaid)\n\nIt's truly unsustainable, at this point the overwhelming majority of graduates leaving medical school are opting not to do GP, because now they know they'll be underpaid compared to their counterparts. I am a prime example, I always wanted to do GP but saw the writing on the wall. Now I'm in a speciality where I make much more with far less stress and far less unpaid overtime and unrealistic expectations.\n\nDoctors WANT to bulk bill, we all WANT to have improved access, but YOU need to speak to the GVT to increase YOUR rebate.",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 1615,
    "downs": 0,
    "created_utc": 1698451439.0,
    "media": null,
    "is_video": false,
    "num_comments": 874,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.376945382949724
  },
  {
    "score": 1589,
    "title": "Why do recruiters keep listing legal requirements as ‘benefits’?",
    "selftext": "Currently mass-applying for roles since my position’s being made redundant.\n\nWhy do recruiters and talent acquisition people keep saying things like *“we offer 4 weeks annual leave and contribute to superannuation”* as if they’re handing out some golden benefit?\n\nThat’s literally a **legal requirement**, not a perk. Stop advertising compliance with employment law like it’s a selling point.\n\n  \n\\#rant",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1589,
    "downs": 0,
    "created_utc": 1759902329.0,
    "media": null,
    "is_video": false,
    "num_comments": 180,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.065236411755044
  },
  {
    "score": 1571,
    "title": "Does anyone miss their 'pre-professional' job?",
    "selftext": "I worked at Woolies (and Coles) for 10 years, from 15 to 25. I worked there throughout high school and all of my double degree (engineering/commerce, took me 7 years) at university.\n\nI was working on the checkout and as the trolley boy. It wasn't the best job, but I really loved packing bags and talking to customers, as well as getting paid to do exercise from bringing in trolleys.\n\nI've been a tax consultant for a while now and I do enjoy it, but man it is so sedentary. Definitely makes me reminisce my times working at Coles/Woolies haha.\n\nAnyone else feel the same?",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1571,
    "downs": 0,
    "created_utc": 1704852246.0,
    "media": null,
    "is_video": false,
    "num_comments": 493,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.2783160161652125
  },
  {
    "score": 1547,
    "title": "Was jobless for 3 months. This is what I learned about recruiters",
    "selftext": "Made redundant in June. In an industry that has dried up due to interest rates. Have a new role now. These are key takeaways I've learned about  recruiters\n\n1. These people are not your friends. They are friends with the employer and are trying to sell you to them for as cheap as possible.\n\n2. Do NOT tell them what salary you are/were on as 4/5 recruiters will disclose that to the business they refer you to eliminating the chance to increase your salary. Instead tell them your expected salary.\n\n3. Tell the recruiter EXACTLY what you want in a job, eg. Minimum days work from home, location and what not. Don't let them waste your time.\n\n4. If you are in the process of interviewing with a company DO NOT tell the recruiter about or who it is. I did not know a recruiter had sent a company my resume, the recruiter proceeded to call the company out about it after divulging I was going to interview. The director who interviewed me said the recruiter had a cry it and it was very awkward. Basically wrecking my chances with them...\n\n5. Be very VERY clear on the type of role you want. Many times I went for an interview to find out the role the employer wanted filled was completely different what what I wanted\n\n6. If you are unemployed such as I was do not let them bully you. I had a recruiter fear mongering me that I wouldn't find an opportunity when an employer gave me a really low salary offer and wouldn't budge. If you have enough savings stay strong.\n\n7. I would recommend to do your utmost to just avoid recruiters all together. I was just getting a little desperate as money was just melting away.\n\n TLDR: recruiters are a waste of oxygen\n\nEdit: This isn't ALL recruiters but the vast majority",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1547,
    "downs": 0,
    "created_utc": 1728090277.0,
    "media": null,
    "is_video": false,
    "num_comments": 235,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.1037269578319275
  },
  {
    "score": 1531,
    "title": "Aussies can only have kids if they’re rich.",
    "selftext": "Me and my partner (24f and 25m) earn a decent income.100k and 75k respectively. We just bought a small 2 bedroom house for just under 1 million. It is the outskirts of Sydney. We are high income earners for our age, and we saved since we were 17 to get a big deposit to even get the place. We both have bachelors and have grinded so hard in our careers and I am so burnt out.  \n\nWe pay 5.5k a month in mortgage, then around 500 on other fees (council, water, electricity, insurance) then another 500 on groceries. Then we pay car , rego, any other small fees We barely have enough to save up properly. We are left with around 2k a month if we are lucky, that’s assuming we don’t have any leisure purchases  \n\nWe are pretty much using 70 percent of our income to survive…  stress levels are supposed to be at 30 percent just to live. But we’re not close, and I don’t imagine anyone else our age is either. For now we’re surviving. We’re not great, but we’re doing ok by ourselves.\n\nOnly problem… We want to have kids but I just can’t imagine how feasible it is for us OR anyone else to do this. Especially in todays economy where rent/ mortgage is astronomically high. \n\nI don’t want to work the rest of my life dry until I’m 60. I don’t want my kids to grow up in a household where they don’t have access to what they want. I want a kid to live comfortably, not in a tight poverty situation. I want to be there for my kids, not constantly in day care. \n\nI’m working hard on a second job, doing everything I can to get extra money ontop of my 100k income but it’s still not enough…\n\nThe truth is only the rich can have kids. It’s heartbreaking.\n",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.77,
    "subreddit_type": "public",
    "ups": 1531,
    "downs": 0,
    "created_utc": 1713565746.0,
    "media": null,
    "is_video": false,
    "num_comments": 1380,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.3328556045859
  },
  {
    "score": 1524,
    "title": "Prop is killing all innovation in this country.",
    "selftext": "We do not seem to invest any money into innovation, tech or anything that is a net positive to the society.\n\nI will probably get downvoted but I see so many investors selling their property course, buyers agents popping up left and right. There is no way this is going to end up nicely, people are buying houses because of fomo at the moment, not because they got a good deal or they like the house.\n\nProperty prices going up don't produce any value, the value going up for prop is Aus is a net negative to society, its not like a business where its producing value and making people's lives easier, prices going up do not contribute or make anyones life easy, instead high prop prices tie people down to mortgages and rob people of their freedom to spend money on wants, travel, dining out, etc.\n\nA property I bought for 400k in 2023 is 750+ now, thats not normal at all. Everyone that says otherwise is delusional. This levels of growth is unsustainable, and if it keeps going up like this, sooner or later there the bubble will pop.\n\nChina took a turn on prop prices in 2021  and Xi came out and said \"Houses are for living, not for speculation\". Their prop has been in a decline ever since and look at how much innovation they have at the moment, they produce everything for us, phones, clothes, furniture, steel, cars and even prebuilt kit homes soon. We don't even make glass anymore. They have robots running marathons.",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1524,
    "downs": 0,
    "created_utc": 1763369806.0,
    "media": null,
    "is_video": false,
    "num_comments": 390,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.184358222380738
  },
  {
    "score": 1483,
    "title": "Anyone noticing younger people (&lt;35) are giving less f**ks about spending money?",
    "selftext": "I don't know if its just my friendship group but a lot of my friends (mid twenties to early thirties) seem to give no f\\*\\*ks about their spending anymore.\n\nDuring COVID, everyone was trying to save money, learn how to budget etc. but lately with all the price rises my friends just don't seem to care anymore. The fear has just been replaced with apathy and acceptance.\n\n$5.5 coffee? fine. Can't be fked to get groceries? I'll uber it. $20 lunch? Count me in. Then you'll find them planning holidays and whatnot despite e.g. the flight price increases.\n\nIt's not that my friends haven't noticed the price increases or haven't felt the rising cost of living. There's just a feeling of \"*I've tried my best already so I give up\".*\n\nAnyone notice this? This is mentally for younger professionals w/o kids.\n\nEDIT: this thread is just for a bit of fun. Obviously all examples are anecdotal in nature - trust the statistics more lol",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 1483,
    "downs": 0,
    "created_utc": 1684361110.0,
    "media": null,
    "is_video": false,
    "num_comments": 972,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.347990321077185
  },
  {
    "score": 1472,
    "title": "Is anyone else going to do worse off financially than their parents, despite earning significantly more and being better educated?",
    "selftext": "I am just wondering if anyone else is in a similar situation. Old man worked as a public servant whole life, never higher than APS6 equivalent in salary. I'm now in my early 30's earning more than double his peak earnings and I couldn't even dream of buying the single and only home he bought.\n\nHe had no education, worked a job which was median salary or below and yet somehow going to end up way better off financially.\n\nAt my current age he already owned a home, had a nice car and was setting himself up well, had kids already. I'm earning way more, living in a tiny shitbox apartment and just wondering how I followed the play book but still going to be worse off than my old man?\n\nI am just really confused. Anyone else doing worse than their parents at the same point in their lives?",
    "subreddit": "AusFinance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 1472,
    "downs": 0,
    "created_utc": 1697355447.0,
    "media": null,
    "is_video": false,
    "num_comments": 420,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.177843794760465
  }
]