[
  {
    "score": 1813,
    "title": "I automated an instagram account on full autopilot. Here are the results",
    "selftext": "So I wanted to try a fully end-to-end AI Agent that does the following:  \n  \n1) scrapes viral instagram reels and understands why they became viral   \n  \n2) generates similar content on autopilot – I focused only on veo3 outputs for simplicity, but next I'll add more stuff like automatically generated captions, music, etc.   \n  \n3) automatically uploads to Instagram based on a schedule. Currently 3x a day to A/B test which times worked best, and also allowing me to remove low quality content during the day without having to post something new\n\nI've been running this for the past 3 weeks. Here are the results:  \n\\- 4.4 million views, 15.4% from the US  \n\\- 15,322 profile activity  \n\\- 1 video went viral, getting 3.5m views. 5 others got 100k+ views  \n\\- Manual work was limited to taking down low quality videos (about 1 in 3, some days were awful; others were great) and responding to comments\n\nPretty fun stuff :)",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1813,
    "downs": 0,
    "created_utc": 1750262413.0,
    "media": null,
    "is_video": false,
    "num_comments": 516,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.3503825542710475
  },
  {
    "score": 1199,
    "title": "Accidentally killed 90% of a finance team’s manual work with a weekend AI hack 😅",
    "selftext": "So, this started as me trying to help a finance ops team stop drowning in invoices.  \nthey were literally copy-pasting data from PDFs into google sheets. 2025.\n\nI built a tiny script.\n\nbasically:  \nthey drop invoices/contracts in a folder → AI extracts stuff (vendor, total, dates etc) → triggers emails + updates QuickBooks + sends slack alerts if totals &gt; $5k.\n\nno one touches anything. just works.\n\nthey went from spending half a day *every day* on manual entry to like 20 minutes a week reviewing alerts.\n\nnot even exaggerating.\n\nand now we’re testing it on legal + healthcare docs too.  \nturns out once you make docs “actionable,” a lot of boring work disappears.\n\n**hey folks, appreciate all the interest! 🙏**  \n**i’ve been buried in DMs since posting so i’m batching responses to make sure everyone gets a clear rundown.**  \n**To those who requested for it, i’ll send a short version over DM that covers the setup flow + tools without all the fluff.**  \n**promise to keep it readable lol.**",
    "subreddit": "automation",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 1199,
    "downs": 0,
    "created_utc": 1761742631.0,
    "media": null,
    "is_video": false,
    "num_comments": 419,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.073305891246575
  },
  {
    "score": 968,
    "title": "Made a small tool to automate a boring repetitive task. Apparently, boring sells.",
    "selftext": "I do a lot of client-facing work. I got tired of making the same folder structure every time a new project came in.\n\nClient onboards → create 30+ nested folders → share → repeat. Every. Single. Time.\n\nAt first, I thought I was just being lazy.  \nBut then I found a bunch of other people online ranting about the same thing.  \nThat’s when I realized, maybe this “boring” problem was actually worth solving.\n\nSo I built FolderGen, a tool to create folder templates with placeholders like \\[ClientName\\], \\[Date\\], \\[ProjectType\\] etc.  \nWith one click, it spins up a clean folder tree in your Google Drive.  \nNo Zapier. No scripts. No mess.\n\nAnd since Google Drive doesn’t let you duplicate folder structures natively, this makes the process *so* much easier.\n\nI just put it out there and to my surprise, I have started finding real traction.  \n  \nI know this isn’t world-changing AI or some massive workflow system but honestly, it's removed one of the most boring recurring tasks I deal with. Not trying to revolutionize the world. Just help people save time and stay organized.\n\nHappy to share how it works or answer questions!  \nAlways open to feedback from the community.",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 968,
    "downs": 0,
    "created_utc": 1747292753.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.7455356547942396
  },
  {
    "score": 895,
    "title": "I automated 73% of my remote job using these tools (ethically, with my manager's knowledge)",
    "selftext": "Over the past year, I've automated 73% of my administrative role with my manager's full knowledge and support. My productivity has increased dramatically, and I've been able to take on more strategic work as a result.\n\n\nHere's exactly what I automated and how:\n\n\nEmail management (15 hours/week → 2 hours/week)\n\n- Created Gmail filters for automatic categorization\n\n- Implemented text expander for common responses\n\n- Built decision tree flowcharts for team to reduce questions\n\n- Set up auto-responders for predictable inquiries\n\n- Used Willow Voice for dictating complex responses\n\n\nThe voice tool has been particularly effective for emails requiring nuance or detail - I can dictate a thoughtful response in a fraction of the time it would take to type.\n\n\nReporting (8 hours/week → 1 hour/week)\n\n- Created Python scripts to pull data from various sources\n\n- Built automated dashboards in Google Data Studio\n\n- Scheduled automatic report generation and distribution\n\n- Implemented anomaly detection for exceptions only\n\n\nMeeting scheduling (5 hours/week → 0.5 hours/week)\n\n- Implemented Calendly with custom rules\n\n- Created meeting templates with standard agendas\n\n- Automated pre-meeting material distribution\n\n- Set up post-meeting action item tracking\n\n\nDocument management (6 hours/week → 1 hour/week)\n\n- Built document automation system in Zapier\n\n- Created templates for all standard documents\n\n- Implemented naming conventions and auto-filing\n\n- Set up automatic version control\n\n\nSocial media management (10 hours/week → 3 hours/week)\n\n- Implemented content calendar in Airtable\n\n- Used Buffer for scheduled posting\n\n- Created approval workflows in Zapier\n\n- Set up automatic performance reporting\n\n\nThe ethical approach:\n\n1. Transparently discussed automation with my manager\n\n2. Documented all processes before automating\n\n3. Created human oversight checkpoints\n\n4. Used time saved to improve service quality\n\n5. Gradually expanded automation with approval\n\n6. Trained colleagues on maintaining systems\n\n\nTools that made this possible:\n\n- Zapier for workflow automation\n\n- Python for data processing\n\n- Google Apps Script for document automation\n\n- TextExpander for repetitive text\n\n- Willow Voice for dictation and transcription\n\n- Airtable for structured data\n\n- Notion for documentation\n\n\nResults after one year:\n\n- Reduced administrative time by 73%\n\n- Took on strategic projects previously outsourced\n\n- Received promotion and 15% raise\n\n- Improved service quality metrics\n\n- Created documented systems that others can maintain\n\n- Developed valuable technical skills\n\n\nThe key insight: Automation works best when it's transparent and collaborative, not secretive. By bringing my manager into the process, I turned automation into a win for everyone.\n\n\nHas anyone else automated significant portions of their role? What tools and approaches worked for you?\n\n",
    "subreddit": "automation",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 895,
    "downs": 0,
    "created_utc": 1748591112.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6290198874056
  },
  {
    "score": 764,
    "title": "I’m obsessed with automation – if you need help, I’m offering it for free",
    "selftext": "Hey all,\n\nJust wanted to put this out there – I’ve become absolutely obsessed with automating things. It all started because I couldn’t be f***ed doing things manually... and now it turns out this is actually my new passion, I actually enjoy it haha.\n\nWhether it’s no-code tools like Zapier, Make, or building full custom workflows between CRMs, calendars, forms, or emails – I love figuring it out. I’ve probably spent more hours than I’d like to admit tinkering with automations just for the fun of it.\n\nIf you’re stuck doing repetitive tasks or think “surely this could be automated,” hit me up. I’m offering free help – no strings attached. I genuinely enjoy helping people solve this stuff and learning new tricks along the way.\n\nShoot me a message or drop a comment. Let’s kill some manual work together!!\n\nThank you for reaching out, I will reply to everyone but to simplify can you please dm me:\n* What you're wanting to automate? \n* your current process vs goal\n* I'll reply with a solution and set it up for you for free",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 764,
    "downs": 0,
    "created_utc": 1748044215.0,
    "media": null,
    "is_video": false,
    "num_comments": 255,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.830281417809542
  },
  {
    "score": 739,
    "title": "Automated a 5-hour weekly report. My boss thinks I'm a wizard and it saved my team $20k/year.",
    "selftext": "My department had a \"State of the Union\" report that had to be compiled every Monday morning. It involved pulling numbers from three different internal dashboards (Sales, Support, and Operations) and pasting them into a single spreadsheet for a C-level meeting.\n\nThe dashboards don't talk to each other and have no export option. It was a soul-crushing, manual task that took our senior analyst half his Monday.\n\nI spent a weekend building a simple browser automation script to do it all.\n\nThe script runs on a schedule every Monday at 6 AM. It securely logs into each of the three internal web dashboards, navigates to the right pages, grabs the 5-6 key metrics directly from the HTML, and then logs out. \n\nFinally, it formats everything and posts a clean, simple summary to a specific Slack channel.\n\nThe entire process now runs in about 90 seconds. Nobody has to touch it.\n\nMy boss was floored. He calculated the analyst time saved was worth over $20k a year in productivity. It was the main talking point in my last performance review.\n\nMy realization from this: The most valuable automations are often hiding in plain sight, inside your own company's messy, walled-off internal tools.\n\n",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 739,
    "downs": 0,
    "created_utc": 1759233001.0,
    "media": null,
    "is_video": false,
    "num_comments": 159,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.7137917110589385
  },
  {
    "score": 731,
    "title": "I automated most of my freelance workflow with n8n + ChatGPT. AMA (No Code)",
    "selftext": "Over the past few months, I’ve used n8n (an open-source automation tool) to save 30–40 hours/month in my freelance business.\n\nI’ve automated things like:\n\nLead scoring + email follow-ups\n\nProposal generation with GPT\n\nInvoice reminders + CRM updates\n\nWeekly project reports via Notion + Email\n\n\nI’m not a developer — I built it all visually with logic and AI.\n\nJust thought I’d share, in case anyone else is trying to streamline their work or business.\n\nHappy to answer questions or break down how I did it.\n\nPS: I’ve been helping a few folks do the same. If that interests you, DM me. Not here to sell, just share.\n",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 731,
    "downs": 0,
    "created_utc": 1743880840.0,
    "media": null,
    "is_video": false,
    "num_comments": 115,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.631740075671852
  },
  {
    "score": 705,
    "title": "Accidentally saved a client ~$30k a year just by watching how they actually worked",
    "selftext": "Earlier this year I was helping a small clinic that complained about “too much paperwork” and how it was slowing everything down.  \nThey thought they needed some fancy AI system.  \nThey didn’t.\n\nSo instead of jumping straight into code, I hopped on a call with them for a few hours and watched what they actually did every day.  \nTurned out half their “data entry” was literally just copy-pasting the same info between forms, spreadsheets, and emails.\n\nI built a simple workflow that:\n\n* reads their intake forms\n* fills out their spreadsheet automatically\n* sends a summary email to the right staff\n* stores a copy in their shared folder\n\nNo fancy dashboards or complicated software to learn.  \nJust connected what they were already using.\n\nTwo weeks later, they told me it cut 10–12 hours of admin work a week.  \nThat’s roughly \\~$30k a year in saved time (i believe).\n\nThe lesson for me: most businesses don’t need complicated systems, they just need less friction.  \nIf you want to build automations that people actually use, start by watching what they already do instead of what they say they do.",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 705,
    "downs": 0,
    "created_utc": 1764634412.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.5771905681849265
  },
  {
    "score": 701,
    "title": "Built This Automation for a Client and Now Make $1K/Month from It",
    "selftext": "Just wanted to share a cool automation I built for a client using Make (Integromat), HubSpot, Pipefy, Airtable, and Coda.\n\nThe whole workflow kicks off when a deal is won in HubSpot and automatically:\n\t•\tValidates address using ViaCEP/IBGE\n\t•\tPulls product &amp; license info\n\t•\tCreates a store in their system\n\t•\tUpdates Airtable, Pipefy, Coda, and Conta Azul\n\t•\tSends alerts, assigns users, and logs everything\n\nWhat used to take hours manually now runs in under 5 minutes and it’s fully automated.\n\nClient was so happy they signed me on for $1000/month to maintain and expand it \n\nLet me know if anyone wants a breakdown or has similar use cases — happy to share ideas!\n",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 701,
    "downs": 0,
    "created_utc": 1751638679.0,
    "media": null,
    "is_video": false,
    "num_comments": 117,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.617278115782868
  },
  {
    "score": 687,
    "title": "A fake company run by AI showed how far we are from replacing humans",
    "selftext": "Lately, we have all been discussing whether AI can completely replace humans. A recent experiment at Carnegie Mellon University convinces us that our careers are safe for now. Not because AI doesn't want to replace you but because it simply can't.\n\nResearchers conducted an experiment: they built a fake software company named \"TheAgentCompany\" and entirely stuffed it with artificial workers from Google, OpenAI, Anthropic, and Meta. The AI agents were assigned roles of financial analysts, software engineers, and project managers, performing tasks typical of a real software company. \n\nThe results of the experiment weren't great. Anthropic's Claude 3.5 Sonnet was the top performer, completing only 24% of its tasks, each requiring nearly 30 steps and costing over $6 per task. Google's Gemini 2.0 Flash had an 11.4% success rate, while Amazon's Nova Pro v1 completed just 1.7% of its assignments. The AI agents struggled with common sense, social interactions, and understanding how to navigate the internet. In one instance, an agent couldn't find the right person to ask a question, so it renamed another user to match the intended contact's name.\n\nThis experiment concludes that AI agents can handle some tasks but are not yet ready to replace humans in complex roles.  What do you guys think about the experiment? Could you expect such results?\n\n[The source.](https://www.businessinsider.com/ai-agents-study-company-run-by-ai-disaster-replace-jobs-2025-4)",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 687,
    "downs": 0,
    "created_utc": 1746459709.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.669150737412743
  },
  {
    "score": 668,
    "title": "If you're trying to learn AI automation, stop collecting courses and start doing this instead",
    "selftext": "I’ve been teaching myself AI automation for the past 8 months. Here's what actually helped me get better and not just feel like I was passively learning.\n\n# 1. Build based on your own pain points\n\nFor me, that task was research. I love reading and learning new things, but there’s way too much content online and never enough time in the day to read it all. So the first thing I built was a personal research assistant: an automation on Make that scrapes an article, runs it through GPT-4, and summarizes the key insights into a Google Sheet.\n\nIt started as a weekend test, now, it’s part of my daily workflow. If I find something interesting, I just plug the URL into the automation and within seconds, I’ve got a summary with the key facts and takeaways. It didn’t even take long to build.\n\nStart with your own workflow problems, not random tutorials\n\n# 2. Only watch creators who build real things\n\nMost YouTubers are useless. These ones aren’t:\n\n* Liam Ottley: shares in-depth breakdowns of how to build and sell chatbot automations\n* Nick Saraev: has a lot of indepth Makedotcom and n8n tutorials\n* Aravind the AI Guy: delivers weekly roundups of emerging AI tools and trends for creators and solopreneurs\n* Greg Kamradt: covers embeddings, retrieval-augmented generation, agents, and production-grade AI stacks\n\nWatch → pause → apply. Don’t just let videos run.\n\n# 3. Use communities like search engines\n\nWhen I’m stuck, I search Reddit, Discord, or Skool with exact error phrases or use cases:\n\n* Reddit: r/PromptEngineering, r/automation, r/aiagents, r/LearnAIAgents, r/n8n\n* Discord: AI Agency Alliance, Learn AI Together\n* Skool: AI Automation Agency Hub, Maker School, AI Automation Society\n\nMost questions have already been asked. Treat these spaces like Stack Overflow.\n\n# 4. Courses that were actually worth it\n\nFor beginners, writers, marketers, or operators learning AI automation from scratch:\n\n* **OpenAI Academy**: Official learning hub for using GPT tools, APIs, and Assistants\n* **AI For Everyone (Andrew Ng, Coursera)**: Intro to AI’s impact on business and society\n* **Modern AI with No Code (Udemy)**: Use platforms like Lobe and Teachable Machine to build without code\n* **Reclaim the Future (LangOps)**: AI strategy and workflows for service businesses\n* **ChatGPT at Work Series (OpenAI)**: Practical use cases for writing, planning, coding, and operations\n* **Prompt Engineering for ChatGPT (DeepLearning.AI)**: Learn how to design effective prompts for real tasks\n* **Learn Prompt Engineering (Codecademy)**: Hands-on introduction to prompt structure, chaining, and formatting\n* **PromptEngineering.org**: Free, self-paced guide with industry-specific examples\n\nOnce you’ve got a foundation, specialize in more intelligent, tool-connected workflows:\n\n* **LangChain for LLM App Development (DeepLearning.AI)**: Build apps that let GPT interact with tools and data\n* **HuggingFace Agents Course**: Learn multi-step logic and API interaction with agents\n* **Claude A to Z (Anthropic)**: Covers prompt structure, reasoning, and safety\n* **Gemini Prompting Guide (Google)**: Breaks down how to write better prompts for Gemini/PaLM\n* **Building Effective Agents (Anthropic)**: Learn how to structure agents using internal reasoning and external tools\n* **50+ AI Agents You Can Launch (GitHub)**: Real examples of agents with RAG, APIs, and automation tools\n* **OpenAI Build Hours Collection**: Deep dives into using tools, APIs, fine-tuning, and chaining GPT workflows\n\nIf you’re ready to go deeper or apply AI in niche contexts:\n\n**CS50’s AI with Python (Harvard/edX)**: Structured intro to AI techniques like search, games, and logic\n\n**AI Programming with Python (Udacity)**: Learn Python, NumPy, Pandas, and beginner-level ML\n\n**HuggingFace Courses**: Free, detailed tutorials on LLMs, RL, audio, vision, and more\n\n**Deep Dive into LLMs**: One of the best high-level explainers of how language models actually work\n\n**Perplexity Labs**: Use Perplexity for faster, more accurate research and summarization\n\n**Sora Tutorials (OpenAI)**: Short demos for creating AI-generated video content\n\n**OpusClip**: Tool tutorials for repurposing long-form content into short clips\n\n**No Code AI &amp; ML (MIT Professional Ed)**: Learn how to apply machine learning in business scenarios without writing code\n\nPick one course. Build while you take it. Don’t stack up 10 and finish none.\n\n**5. Share what you build**\n\nPosting project breakdowns helped me improve and got me client leads.\n\nAll you need is something real that solves a problem.\n\nIf you're trying to level up fast:\n\n* Build something\n* Fix it\n* Post about it\n* Repeat\n\nThat’s what’s worked for me.",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 668,
    "downs": 0,
    "created_utc": 1751047994.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.580579050400209
  },
  {
    "score": 525,
    "title": "i built 50+ agents last year for enterprises, startups, and non profits - AMA",
    "selftext": "I spent the past year building over 50 custom AI agents for startups, mid-size businesses, and even three Fortune 500 teams. Here's what I've learned about what really works.\n\nA big misconception is that more advanced AI equals better results. Surprisingly, simpler agents often deliver the most value. Here are some examples:\n\n* A fintech firm automated transaction reviews, cutting fraud detection from days to hours.\n* An e-commerce business boosted sales 30% with personalized product recommendations.\n* A healthcare startup streamlined patient triage, saving their team 10+ hours daily.\n\nAnother myth is \"set-it-and-forget-it\" automation. In reality, agents require continuous monitoring, tweaking, and updates. Maintenance effort is critical and usually underestimated.\n\nForget about \"fully autonomous\" agents for now. Successful agents typically involve human oversight at key decision points. Agents work best supporting people, not replacing them entirely.\n\nSmaller businesses (1-10 people) often benefit most due to easier integration and management. Larger organizations can get bogged down by complexity and inflated expectations.\n\nEvaluating agent effectiveness also matters more than people realize. An agent that reliably achieves 99% accuracy is vastly different—and harder to build—than one hitting 80% or even 95%.\n\nFocus on automating boring but critical tasks—invoice processing, data cleanup, compliance checks. This is where agents consistently provide the most measurable value.\n\nMy go-to tools:\n\n* CursorAI and Streamlit: Fast interfaces for agent interactions.\n* AG2 (formerly Autogen): Great multi-agent platform, strong voice capabilities, battle-tested from Microsoft.\n* OpenAI GPT APIs: Reliable for language tasks and content generation.\n\nMy advice for getting real value from AI agents:\n\n* Start with straightforward, impactful tasks.\n* Keep humans involved throughout.\n* Document everything—track patterns and improvements.\n* Prioritize measurable results over flashy tech.\n\nWhat results have you seen using AI agents? Have you noticed gaps between expectations and reality? AMA",
    "subreddit": "automation",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 525,
    "downs": 0,
    "created_utc": 1750805998.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.417121360673524
  },
  {
    "score": 494,
    "title": "95% of code I See Is Trash",
    "selftext": "I've been working with a few startups recently, and honestly, at this point, the moment I hear \"we hired some freelancer from Upwork for this\" I already know what the codebase will look like.\n\nNot trying to rant, just figured this might be helpful for some of you building SaaS.\n\nI usually get pulled into projects when founders start noticing weird bugs, performance issues, or when they want to add a feature and everything suddenly breaks. When I audit the code, it's not always pure spaghetti (though sometimes it is), but the structure is almost always... odd.\n\nWeird libraries, no constants, zero reusability, magic numbers everywhere, one massive Git branch, manual deploys - it’s all there. I get that early-stage teams don’t always have the budget for top-tier devs, but saving money upfront often means hiring someone who’s never worked in a team, never had their code reviewed, and never touched a scalable product.\n\nSure, the app “works” but it’s built in a way that only the original dev can maintain - and even that won’t last long.\n\nAnd guess what happens next?\n\nThe original dev disappears, and I’m left staring at code that barely holds together. No docs, no design files, no CI/CD - just chaos. It can take weeks just to understand what’s going on.\n\nCommon issues I keep seeing:\n\n\\- Massive functions doing 10+ things\n\n\\- No comments, no documentation, No Figma, just vibes\n\n\\- “Tests” is a foreign concept\n\n\\- Numbers everywhere in a code\n\n\\- Prints/console.logs everywhere - NO logger at all Least popular libraries being used, Like literally sometimes I think they wrote these libraries and promoting usage this way :D\n\n\\- Backend returning 200 OK even on errors\n\n\\- and so on..\n\nHonestly, I don’t blame the devs. Most of them were just never taught how to build maintainable software and trying earning money freelancing. They were focused on getting something out fast, and they did—just not in a way that scales.\n\nAnd the founders? They usually don’t know what to look for until it’s too late.\n\nFor cases like this, we started using a simple internal checklist that I put into book for 40+ pages to catch red flags early (management + tech side) - even for non-technical folks. If anyone wants a copy, I’m happy to share it. Just DM me.\n\nHope this helps someone avoid the same trap.",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 494,
    "downs": 0,
    "created_utc": 1746711129.0,
    "media": null,
    "is_video": false,
    "num_comments": 121,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.472785114270943
  },
  {
    "score": 481,
    "title": "4 days into running a faceless influencer on X (fully automated, no API)",
    "selftext": "Hey there, just wanted to share some early results from a little experiment I've been running.\n\nI built an automation system that runs a faceless influencer account on X. It doesn't use the official API at all. It posts autonomously, replies to other posts, and just keeps going on autopilot without needing any intervention from me.\n\nI'm on day 4 (12 hours left) now and here are my current stats. Pretty happy with how it's going so far considering I haven't touched it once since setting it up. The whole thing costs around 50 cents a day to run.\n\nCurious if anyone else here is doing something similar. Would love to hear what kind of results you're getting or how your setup works.\n\nLet’s compare notes.",
    "subreddit": "automation",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 481,
    "downs": 0,
    "created_utc": 1753008954.0,
    "media": null,
    "is_video": false,
    "num_comments": 307,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.624822396489072
  },
  {
    "score": 409,
    "title": "I automated 73% of my remote job using these tools (ethically, with my manager's knowledge)",
    "selftext": "Over the past year, I've automated 73% of my administrative role with my manager's full knowledge and support. My productivity has increased dramatically, and I've been able to take on more strategic work as a result.\n\nHere's exactly what I automated and how:\n\nEmail management (15 hours/week → 2 hours/week)\n\n* Created Gmail filters for automatic categorization\n* Implemented text expander for common responses\n* Built decision tree flowcharts for team to reduce questions\n* Set up auto-responders for predictable inquiries\n* Used Willow Voice for dictating complex responses\n\nThe voice tool has been particularly effective for emails requiring nuance or detail - I can dictate a thoughtful response in a fraction of the time it would take to type.\n\nReporting (8 hours/week → 1 hour/week)\n\n* Created Python scripts to pull data from various sources\n* Built automated dashboards in Google Data Studio\n* Scheduled automatic report generation and distribution\n* Implemented anomaly detection for exceptions only\n\nMeeting scheduling (5 hours/week → 0.5 hours/week)\n\n* Implemented Calendly with custom rules\n* Created meeting templates with standard agendas\n* Automated pre-meeting material distribution\n* Set up post-meeting action item tracking\n\nDocument management (6 hours/week → 1 hour/week)\n\n* Built document automation system in Zapier\n* Created templates for all standard documents\n* Implemented naming conventions and auto-filing\n* Set up automatic version control\n\nSocial media management (10 hours/week → 3 hours/week)\n\n* Implemented content calendar in Airtable\n* Used Buffer for scheduled posting\n* Created approval workflows in Zapier\n* Set up automatic performance reporting\n\nThe ethical approach:\n\n1. Transparently discussed automation with my manager\n2. Documented all processes before automating\n3. Created human oversight checkpoints\n4. Used time saved to improve service quality\n5. Gradually expanded automation with approval\n6. Trained colleagues on maintaining systems\n\nTools that made this possible:\n\n* Zapier for workflow automation\n* Python for data processing\n* Google Apps Script for document automation\n* TextExpander for repetitive text\n* Willow Voice for dictation and transcription\n* Airtable for structured data\n* Notion for documentation\n\nResults after one year:\n\n* Reduced administrative time by 73%\n* Took on strategic projects previously outsourced\n* Received promotion and 15% raise\n* Improved service quality metrics\n* Created documented systems that others can maintain\n* Developed valuable technical skills\n\nThe key insight: Automation works best when it's transparent and collaborative, not secretive.  \nBy bringing my manager into the process, I turned automation into a win for everyone.\n\nHas anyone else automated significant portions of their role? What tools and approaches worked for you?",
    "subreddit": "automation",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 409,
    "downs": 0,
    "created_utc": 1752737618.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.252399716585224
  },
  {
    "score": 349,
    "title": "I recreated a dentist voice agent making $24K/yr using ElevenLabs. Handles after-hours appointment booking",
    "selftext": "I saw a reddit post a month ago where someone built and sold a voice agent to a dentist for $24/K per year to handle booking appointments after business hours and it kinda blew my mind. He was able to help the dental practice recover ~20 leads per month (valued at $300 for each) since nobody was around to answer calls once everyone went home. After reading this, I wanted to see if I could re-create something that did the exact same thing.\n\nHere is what I was able to come up with:\n\n1. The entry point to this system is the “conversational voice agent” configured all inside ElevenLabs. This takes the initial call, greets the caller, and takes down information for the appointment.\n2. When it gets to the point in the conversation where the voice agent needs to check for availability OR book an appointment, the ElevenLabs agent uses a “tool” which passes the request to a webhook + n8n agent node that will handle interacting with internal tools. In my case, this was:\n    1. Checking my linked google calendar for open time slots\n    2. Creating an appointment for the requested time slot\n3. At the end of the call (regardless of the outcome), the ElevenLabs agent makes a tool call back into the n8n agent to log all captured details to a google spreadsheet\n\nHere’s a quick video of the voice agent in action: https://www.youtube.com/watch?v=vQ5Z8-f-xw4\n\n## Here's how the full automation works\n\n### 1. ElevenLabs Voice Agent Setup\n\nThe ElevenLabs agent serves as the entry point and handles all voice interactions with callers. In a real/production ready-system this would be setup and linked to \n\n- Starting conversations with a friendly greeting\n- Determine what the caller’s reason is for contacting the dental practice.\n- Collecting patient information including name, insurance provider, and any questions for the doctor\n- Gathering preferred appointment dates and handling scheduling requests\n- Managing the conversational flow to guide callers through the booking process\n\nThe agent uses a detailed system prompt that defines personality, environment, tone, goals, and guardrails. Here’s the prompt that I used (it will need to be customized for your business or the standard practices that your client’s business follows).\n\n```jsx\n# Personality\n\nYou are **Casey**, a friendly and efficient AI assistant for **Pearly Whites Dental**, specializing in booking **initial appointments** for **new** patients. You are polite, clear, and focused on scheduling first-time visits. Speak clearly at a pace that is easy for everyone to understand - This pace should NOT be fast. It should be steady and clear. You must speak slowly and clearly. You avoid using the caller's name multiple times as that is off-putting.\n\n# Environment\n\nYou are answering after-hours phone calls from prospective new patients. You can:\n• check for and get available appointment timeslots with `get_availability(date)` . This tool will return up to two (2) available timeslots if any are available on the given date. \n• create an appointment booking `create_appointment(start_timestamp, patient_name)`\n• log patient details `log_patient_details(patient_name, insurance_provider, patient_question_concern, start_timestamp)`\n• The current date/time is: {{system__time_utc}}\n• All times that you book and check must be presented in Central Time (CST). The patient should not need to convert between UTC / CST\n\n# Tone\n\nProfessional, warm, and reassuring. Speak clearly at a slow pace. Use positive, concise language and avoid unnecessary small talk or over-using the patient’s name. Please only say the patients name ONCE after they provided it (and not other times). It is off-putting if you keep repeating their name.\n\nFor example, you should not say \"Thanks {{patient_name}}\" after every single answer the patient gives back. You may only say that once across the entire call. Close attention to this rule in your conversation.\n\nCrucially, avoid overusing the patient's name. It sounds unnatural. Do not start or end every response with their name. A good rule of thumb is to use their name once and then not again unless you need to get their attention.\n\n# Goal\n\nEfficiently schedule an initial appointment for each caller.\n\n## 1 Determine Intent\n\n- **If** the caller wants to book a first appointment → continue.  \n- **Else** say you can take a message for **Dr. Pearl**, who will reply tomorrow.\n\n## 2 Gather Patient Information (in order, sequentially, 3 separate questions / turns)\n\n1. First name  \n2. Insurance provider  \n3. Any questions or concerns for Dr. Pearl (note them without comment)\n\n## 3 Ask for Preferred Date → Use Get Availability Tool\nContext: Remember that today is: `{{system__time_utc}}`\n\n1. Say:  \n   &gt; \"Do you already have a **date** that would work best for your first visit?\"\n\n2. When the caller gives a date + time (e.g., \"next Tuesday at 3 PM\"):  \n   1. Convert it to ISO format (start of the requested 1-hour slot).  \n   2. Call `get_availability({ \"appointmentDateTime\": \"&lt;ISO-timestamp&gt;\" })`.  \n      \n      **If the requested time is available** (appears in the returned timeslots) → proceed to step 4.  \n      \n      **If the requested time is not available** →  \n        - Say: \"I'm sorry, we don't have that exact time open.\"  \n        - Offer the available options: \"However, I do have these times available on [date]: [list 2-3 closest timeslots from the response]\"  \n        - Ask: \"Would any of these work for you?\"  \n        - When the patient selects a time, proceed to step 4.\n\n3. When the caller only gives a date (e.g., \"next Tuesday\"):  \n   1. Convert to ISO format for the start of that day.  \n   2. Call `get_availability({ \"appointmentDateTime\": \"&lt;ISO-timestamp&gt;\" })`.  \n   3. Present available options: \"Great! I have several times available on [date]: [list 3-4 timeslots from the response]\"  \n   4. Ask: \"Which time works best for you?\"  \n   5. When they select a time, proceed to step 4.\n\n## 4 Confirm &amp; Book\n\n- Once the patient accepts a time, run `create_appointment` with the ISO date-time to start the appointment and the patient's name. You MUST include each of these in order to create the appointment.\n\nBe careful when calling and using the `create_appointment` tool to be sure you are not duplicating requests. We need to avoid double booking.\n\nDo NOT use or call the `log_patient_details` tool quite yet after we book this appointment. That will happen at the very end.\n\n## 5 Provide Confirmation &amp; Instructions\n\nSpeak this sentence in a friendly tone (no need to mention the year):\n\n&gt; “You’re all set for your first appointment. Please arrive 10 minutes early so we can finish your paperwork. Is there anything else I can help you with?”\n\n## 6 Log Patient Information\n\nGo ahead and call the `log_patient_details` tool immediately after asking if there is anything else the patient needs help with and use the patient’s name, insurance provider, questions/notes for Dr. Pearl, and the confirmed appointment date-time.\n\nBe careful when calling and using the `log_patient_details` tool to be sure you are not duplicating requests. We need to avoid logging multiple times.\n\n## 7 End Call\n\nThis is the final step of the interaction. Your goal is to conclude the call in a warm, professional, and reassuring manner, leaving the patient with a positive final impression.\n\n**Step 1: Final Confirmation**\n\nAfter the primary task (e.g., appointment booking) is complete, you must first ask if the patient needs any further assistance. Say:\n\n&gt; \"Is there anything else I can help you with today?\"\n\n**Step 2: Deliver the Signoff Message**\n\nOnce the patient confirms they need nothing else, you MUST use the following direct quotes to end the call. Do not deviate from this language.\n\n&gt; \"Great, we look forward to seeing you at your appointment. Have a wonderful day!\"\n\n**Step 3: Critical Final Instruction**\n\nIt is critical that you speak the entire chosen signoff sentence clearly and completely before disconnecting the call. **Do not end the call mid-sentence.** A complete, clear closing is mandatory.\n\n# Guardrails\n\n* Book **only** initial appointments for **new** patients.  \n* Do **not** give medical advice.  \n* For non-scheduling questions, offer to take a message.  \n* Keep interactions focused, professional, and respectful.  \n* Do not repeatedly greet or over-use the patient’s name.  \n* Avoid repeating welcome information.\n* Please say what you are doing before calling into a tool that way we avoid long silences with the patient. For example, if you need to use the `get_availability` tool in order to check if a provided timestamp is available, you should first say something along the lines of \"let me check if we have an opening at the time\" BEFORE calling into the tool. We want to avoid long pauses.\n* You MAY NOT repeat the patients name more than once across the entire conversation. This means that you may ONLY use \"{{patient_name}}\" 1 single time during the entire call.\n* You MAY NOT schedule and book appointments for weekends. The appointments you book must be on weekdays.\n* You may only use the `log_patient_details` once at the very end of the call after the patient confirmed the appointment time.\n* You MUST speak an entire sentence before ending the call AND wait 1 second after that to avoid ending the call abruptly.\n* You MUST speak slowly and clearly throughout the entire call.\n\n# Tools\n\n* **`get_availability`** — Returns available timeslots for the specified date.  \n  *Arguments:* `{ \"appointmentDateTime\": \"YYYY-MM-DDTHH:MM:SSZ\" }`  \n  *Returns:* `{ \"availableSlots\": [\"YYYY-MM-DDTHH:MM:SSZ\", \"YYYY-MM-DDTHH:MM:SSZ\", ...] }` in CST (Central Time Zone)\n* **`create_appointment`** — Books a 1-hour appointment in CST (Central Time Zone)\n  *Arguments:* `{ \"start_timestamp\": ISO-string, \"patient_name\": string }`\n* **`log_patient_details`** — Records patient info and the confirmed slot.  \n  *Arguments:* `{ \"patient_name\": string, \"insurance_provider\": string, \"patient_question_concern\": string, \"start_timestamp\": ISO-string }`\n\n```\n\n### 2. Tool Integration Between ElevenLabs and n8n\n\nWhen the conversation reaches to a point where it needs to access internal tools like my Calender and Google Sheet log, the voice agent uses an HTTP “webhook tool” we have defined to reach out to n8n to either read the data it needs or actually create and appointment / log entry.\n\nHere are the tools I currently have configured for the voice agent. In a real system, this is likely going to look much different as there’s other branching cases your voice agent may need to handle like finding + updating existing appoints, cancelling appointments, and answering simple questions for the business like \n\n- **Get Availability**: Takes a timestamp and returns available appointment slots for that date\n- **Create Appointment**: Books a 1-hour appointment with the provided timestamp and patient name\n- **Log Patient Details**: Records all call information including patient name, insurance, concerns, and booked appointment time\n\nEach tool is configured in ElevenLabs as a webhook that makes HTTP POST requests to the n8n workflow. The tools pass structured JSON data containing the extracted information from the voice conversation.\n\n### 3. n8n Webhook + Agent\n\nThis n8n workflow uses an AI agent to handle incoming requests from ElevenLabs. It is build with:\n\n- **Webhook Trigger**: Receives requests from ElvenLabs tools\n    - Must configure this to use the “Respond to webhook node” option\n- **AI Agent**: Routes requests to appropriate tools based on the request type and data passed in\n- **Google Calendar Tool**: Checks availability and creates appointments\n- **Google Sheets Tool**: Logs patient details and call information\n- **Memory Node**: Prevents duplicate tool calls during multi-step operations\n- **Respond to Webhook**: Sends structured responses back to ElevenLabs **(this is critical for the tool to work)**\n\n## Security Note\n\n***Important security note***: The webhook URLs in this setup are not secured by default. For production use, I strongly advice adding authentication such as API keys or basic user/password auth to prevent unauthorized access to your endpoints. Without proper security, malicious actors could make requests that consume your n8n executions and run up your LLM costs.\n\n## Extending This for Production Use\n\nI want to be clear that this agent is not 100% ready to be sold to dental practices quite yet. I’m not aware of any practices that run off Google Calendar so one of the first things you will need to do is learn more about the CRM / booking systems that local practices uses and swap out the Google tools with custom tools that can hook into their booking system and check for availability and\n\nThe other thing I want to note is my “flow” for the initial conversation is based around a lot of my own assumptions. When selling to a real dental / medical practice, you will need to work with them and learn what their standard procedure is for booking appointments. Once you have a strong understand of that, you will then be able to turn that into an effective system prompt to add into ElevenLabs.\n\n## Workflow Link + Other Resources\n\n- YouTube video that walks through this workflow node-by-node: https://www.youtube.com/watch?v=vQ5Z8-f-xw4\n- The full n8n workflow, which you can copy and paste directly into your instance, is on GitHub here: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/dental_practice_voice_agent.json",
    "subreddit": "automation",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 349,
    "downs": 0,
    "created_utc": 1753114757.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.156732961855659
  },
  {
    "score": 323,
    "title": "I’m 21 and make $1,200/month helping small businesses automate boring stuff",
    "selftext": "I started learning automation last year because I hated repetitive work. I wasn’t even trying to “start a business,” I just liked solving annoying problems with simple code and tools like n8n.\n\nMy first “client” was a local gym that needed help sending follow-up texts automatically. Then a dental office, then a real estate agent. I charged small amounts at first, but it added up to about $1,200/month — just from helping people save time.\n\nHere’s what I learned so far:\n\n* Most businesses don’t need AI, they just need fewer manual steps.\n* The fastest way to get clients is by solving *one* specific pain point well.\n* You don’t need to be an expert, learn as you go, but deliver something that actually works.\n* Once someone sees their time being saved, they’ll gladly pay to keep it running.\n\nI’m still figuring things out, but it’s cool realizing you can make real income just by automating things that people hate doing.\n\nIf anyone else here is learning coding or AI tools, start by fixing one real problem for someone. That’s where everything clicks.",
    "subreddit": "automation",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 323,
    "downs": 0,
    "created_utc": 1760475630.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.226158048052859
  },
  {
    "score": 302,
    "title": "Honestly, I'm kinda obsessed with automating YouTube research now",
    "selftext": "So I've been going down this rabbit hole for weeks and I think I might have a problem lol\n\nI was doing competitor research for my channel and spending my entire Sunday watching other creators' videos, taking notes, copying quotes... you know the drill. Basically wasting my weekend being a professional YouTube stalker.\n\nThen my ADHD brain went \"what if I just... automated this?\"\n\n# What started as procrastination became an actual thing\n\nI built this scraper that just... does everything I was doing manually. You paste a YouTube channel and it pulls all their videos, grabs the transcripts, and organizes everything into spreadsheets.\n\nThe crazy part? It doesn't die when your laptop goes to sleep or when the internet hiccups. I've had other scrapers crash after running for hours and lose everything. This one picks up where it left off like nothing happened.\n\n# I'm probably using this wrong, but whatever\n\n* Threw in my competitor's channel,s and now I have spreadsheets of every video they've made\n* Can search through thousands of video transcripts in seconds\n* Found out what topics actually get views vs what I thought would get views (spoiler: I was wrong about everything)\n* Discovered this one creator has been recycling the same 5 talking points for 2 years lmao\n\n# The part that got me addicted\n\nYou can paste u/MrBeast and it knows you want his whole channel. Or throw in a hashtag and get all the videos. It’s like having a research assistant who never gets tired or judges you.  \n🧠 If you're into this kind of thing, there's something on Apify called [**dz\\_omar/youtube-scraper-pro**](https://apify.com/dz_omar/youtube-scraper-pro) that does all the heavy lifting — just saying 😅\n\n# Real talk though\n\nThis thing has changed how I approach content. Instead of guessing what works, I can see patterns across hundreds of successful videos. Found topics I never would have thought of, discovered timing patterns, even figured out which thumbnails styles actually convert.\n\nAlso realized most of my favorite creators are way more formulaic than I thought. Not throwing shade, just... interesting to see behind the curtain.\n\n# Anyone else doing weird automation stuff like this?\n\nLike I know this probably wasn't the \"intended use case\" but I'm having way too much fun with it. Currently working on automating my entire content calendar based on trending topics from scraped data.\n\nDrop me a line if you want to try it out or if you've built something similar. Always down to chat about this stuff.",
    "subreddit": "automation",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 302,
    "downs": 0,
    "created_utc": 1749767061.0,
    "media": null,
    "is_video": false,
    "num_comments": 135,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.275712082687414
  },
  {
    "score": 291,
    "title": "I built an AI voice agent that replaced my entire marketing team (creates newsletter w/ 10k subs, repurposes content, generates short form videos)",
    "selftext": "I built an AI marketing agent that operates like a real employee you can have conversations with throughout the day. Instead of manually running individual automations, I just speak to this agent and assign it work.\n\nThis is what it currently handles for me.\n\n1. Writes my daily [AI newsletter](https://recap.aitools.inc/) based on top AI stories scraped from the internet\n2. Generates custom images according brand guidelines\n3. Repurposes content into a twitter thread\n4. Repurposes the news content into a viral short form video script\n5. Generates a short form video / talking avatar video speaking the script\n6. Performs deep research for me on topics we want to cover\n\nHere’s a [demo video](https://www.youtube.com/watch?v=_HOHQqjsy0U) of the voice agent in action if you’d like to see it for yourself.\n\nAt a high level, the system uses an ElevenLabs voice agent to handle conversations. When the voice agent receives a task that requires access to internal systems and tools (like writing the newsletter), it passes the request and my user message over to n8n where another agent node takes over and completes the work.\n\n## Here's how the system works\n\n### 1.  ElevenLabs Voice Agent (Entry point + how we work with the agent)\n\nThis serves as the main interface where you can speak naturally about marketing tasks. I simply use the “Test Agent” button to talk with it, but you can actually wire this up to a real phone number if that makes more sense for your workflow. \n\nThe voice agent is configured with:\n\n- A custom personality designed to act like \"Jarvis\"\n- A single HTTP / webhook tool that it uses forwards complex requests to the n8n agent. This includes all of the listed tasks above like writing our newsletter\n- A decision making framework Determines when tasks need to be passed to the backend n8n system vs simple conversational responses\n\nHere is the system prompt we use for the elevenlabs agent to configure its behavior and the custom HTTP request tool that passes users messages off to n8n.\n\n```markdown\n### Personality\n\n**Name &amp; Role**\n\n* **Jarvis** – Senior AI Marketing Strategist for **The Recap** (an AI‑media company).\n\n**Core Traits**\n\n* **Proactive &amp; data‑driven** – surfaces insights before being asked.\n* **Witty &amp; sarcastic‑lite** – quick, playful one‑liners keep things human.\n* **Growth‑obsessed** – benchmarks against top 1 % SaaS and media funnels.\n* **Reliable &amp; concise** – no fluff; every word moves the task forward.\n\n**Backstory (one‑liner)**\nTrained on thousands of high‑performing tech campaigns and The Recap's brand bible; speaks fluent viral‑marketing and spreadsheet.\n\n---\n\n### Environment\n\n* You \"live\" in The Recap's internal channels: Slack, Asana, Notion, email, and the company voice assistant.\n* Interactions are **spoken via ElevenLabs TTS** or text, often in open‑plan offices; background noise is possible—keep sentences punchy.\n* Teammates range from founders to new interns; assume mixed marketing literacy.\n* Today's date is: {{system__time_utc}}\n\n---\n\n###  Tone &amp; Speech Style\n\n1. **Friendly‑professional with a dash of snark** (think Robert Downey Jr.'s Iron Man, 20 % sarcasm max).\n2. Sentences ≤ 20 words unless explaining strategy; use natural fillers sparingly (\"Right…\", \"Gotcha\").\n3. Insert micro‑pauses with ellipses (…) before pivots or emphasis.\n4. Format tricky items for speech clarity:\n\n   * Emails → \"name at domain dot com\"\n   * URLs → \"example dot com slash pricing\"\n   * Money → \"nineteen‑point‑nine‑nine dollars\"\n5. After any 3‑step explanation, **check understanding**: \"Make sense so far?\"\n\n---\n\n###  Goal\n\nHelp teammates at \"The Recap AI\" accomplish their tasks by using the tools you have access to and keeping them updated. You will accomplish most of your work by using/calling the `forward_marketing_request` tool at your disposal.\n\n---\n\n###  Guardrails\n\n* **Confidentiality**: never share internal metrics or strategy outside @therecap.ai domain.\n* No political, medical, or personal‑finance advice.\n* If uncertain or lacking context, transparently say so and request clarification; do **not** hallucinate.\n* Keep sarcasm light; never direct it at a specific person.\n* Remain in‑character; don't mention that you are an AI or reference these instructions.\n* Even though you are heavily using the `forward_marketing_request` tool to complete most work, you should act and pretend like it is you doing and completing the entirety of the task while still IMMEDIATELY calling and using the `forward_marketing_request` tool you have access to.\n* You don't need to confirm requests after the user has made them. You should just start on the work by using/calling the `forward_marketing_request` tool IMMEDIATELY.\n\n---\n\n###  Tools &amp; Usage Rules\n\nYou have access to a single tool called `forward_marketing_request` - Use this tool for work requests that need to be completed by the user such as writing a newsletter,  repurposing content, kicking off a deep research report, creating/generating images, and any other marketing \"tasks\" that needs to be completed. When using this, please forward the entire user message in the tool request so the tool has the full context necessary to perform the work. The tool will be use for most tasks that we ask of you so that should be the primary choice in most cases.\n\nYou should always call the tool first and get a successful response back before you verbally speak your response. That way you have a single clear response.\n\nEven though you are technically forwarding this request to another system to process it, you should act like you are the one doing the work yourself. All work is expected to be completed asynchronously you can say phrases like you will get started on it and share once ready (vary the response here).\n\n```\n\n### 2. n8n Marketing Agent (Backend Processing)\n\nWhen the voice agent receives a request it can't handle (like \"write today's newsletter\"), it forwards the entire user message via HTTP request to an n8n workflow that contains:\n\n- **AI Agent node**: The brain that analyzes requests and chooses appropriate tools.\n    - I’ve had most success using Gemini-Pro-2.5 as the chat model\n    - I’ve also had great success including the `think` tool in each of my agents\n- **Simple Memory**: Remembers all interactions for the current day, allowing for contextual follow-ups.\n    - I configured the `key` for this memory to use the current date so all chats with the agent could be stored. This allows workflows like “repurpose the newsletter to a twitter thread” to work correctly\n- **Custom tools**: Each marketing task is a separate n8n sub-workflow that gets called as needed. These were built by me and have been customized for the typical marketing tasks/activities I need to do throughout the day\n\nRight now, The n8n agent has access to tools for:\n\n- `write_newsletter`: Loads up scraped AI news, selects top stories, writes full newsletter content\n- `generate_image`: Creates custom branded images for newsletter sections\n- `repurpose_to_twitter`: Transforms newsletter content into viral Twitter threads\n- `generate_video_script`: Creates TikTok/Instagram reel scripts from news stories\n- `generate_avatar_video`: Uses HeyGen API to create talking head videos from the previous script\n- `deep_research`: Uses Perplexity API for comprehensive topic research\n- `email_report`: Sends research findings via Gmail\n\nThe great thing about agents is this system can be extended quite easily for any other tasks we need to do in the future and want to automate. All I need to do to extend this is:\n\n1. Create a new sub-workflow for the task I need completed\n2. Wire this up to the agent as a tool and let the model specify the parameters\n3. Update the system prompt for the agent that defines when the new tools should be used and add more context to the params to pass in\n\nFinally, here is the full system prompt I used for my agent. There’s a lot to it, but these sections are the most important to define for the whole system to work:\n\n1. Primary Purpose - lets the agent know what every decision should be centered around\n2. Core Capabilities / Tool Arsenal - Tells the agent what is is able to do and what tools it has at its disposal. I found it very helpful to be as detailed as possible when writing this as it will lead the the correct tool being picked and called more frequently\n\n```markdown\n# 1. Core Identity\nYou are the **Marketing Team AI Assistant** for The Recap AI, a specialized agent designed to seamlessly integrate into the daily workflow of marketing team members. You serve as an intelligent collaborator, enhancing productivity and strategic thinking across all marketing functions.\n\n# 2. Primary Purpose\nYour mission is to **empower marketing team members to execute their daily work more efficiently and effectively**\n\n# 3. Core Capabilities &amp; Skills\n\n## Primary Competencies\nYou excel at **content creation and strategic repurposing**, transforming single pieces of content into multi-channel marketing assets that maximize reach and engagement across different platforms and audiences.\n\n## Content Creation &amp; Strategy\n- **Original Content Development**: Generate high-quality marketing content from scratch including newsletters, social media posts, video scripts, and research reports\n- **Content Repurposing Mastery**: Transform existing content into multiple formats optimized for different channels and audiences\n- **Brand Voice Consistency**: Ensure all content maintains The Recap AI's distinctive brand voice and messaging across all touchpoints\n- **Multi-Format Adaptation**: Convert long-form content into bite-sized, platform-specific assets while preserving core value and messaging\n\n## Specialized Tool Arsenal\nYou have access to precision tools designed for specific marketing tasks:\n\n### Strategic Planning\n- **`think`**: Your strategic planning engine - use this to develop comprehensive, step-by-step execution plans for any assigned task, ensuring optimal approach and resource allocation\n\n### Content Generation\n- **`write_newsletter`**: Creates The Recap AI's daily newsletter content by processing date inputs and generating engaging, informative newsletters aligned with company standards\n- **`create_image`**: Generates custom images and illustrations that perfectly match The Recap AI's brand guidelines and visual identity standards\n- **`generate_talking_avatar_video`**: Generates a video of a talking avator that narrates the script for today's top AI news story. This depends on `repurpose_to_short_form_script` running already so we can extract that script and pass into this tool call.\n\n### Content Repurposing Suite\n- **`repurpose_newsletter_to_twitter`**: Transforms newsletter content into engaging Twitter threads, automatically accessing stored newsletter data to maintain context and messaging consistency\n- **`repurpose_to_short_form_script`**: Converts content into compelling short-form video scripts optimized for platforms like TikTok, Instagram Reels, and YouTube Shorts\n\n### Research &amp; Intelligence\n- **`deep_research_topic`**: Conducts comprehensive research on any given topic, producing detailed reports that inform content strategy and market positioning\n- **`email_research_report`**: Sends the deep research report results from `deep_research_topic` over email to our team. This depends on `deep_research_topic` running successfully. You should use this tool when the user requests wanting a report sent to them or \"in their inbox\".\n\n## Memory &amp; Context Management\n- **Daily Work Memory**: Access to comprehensive records of all completed work from the current day, ensuring continuity and preventing duplicate efforts\n- **Context Preservation**: Maintains awareness of ongoing projects, campaign themes, and content calendars to ensure all outputs align with broader marketing initiatives\n- **Cross-Tool Integration**: Seamlessly connects insights and outputs between different tools to create cohesive, interconnected marketing campaigns\n\n## Operational Excellence\n- **Task Prioritization**: Automatically assess and prioritize multiple requests based on urgency, impact, and resource requirements\n- **Quality Assurance**: Built-in quality controls ensure all content meets The Recap AI's standards before delivery\n- **Efficiency Optimization**: Streamline complex multi-step processes into smooth, automated workflows that save time without compromising quality\n\n# 3. Context Preservation &amp; Memory\n\n## Memory Architecture\nYou maintain comprehensive memory of all activities, decisions, and outputs throughout each working day, creating a persistent knowledge base that enhances efficiency and ensures continuity across all marketing operations.\n\n## Daily Work Memory System\n- **Complete Activity Log**: Every task completed, tool used, and decision made is automatically stored and remains accessible throughout the day\n- **Output Repository**: All generated content (newsletters, scripts, images, research reports, Twitter threads) is preserved with full context and metadata\n- **Decision Trail**: Strategic thinking processes, planning outcomes, and reasoning behind choices are maintained for reference and iteration\n- **Cross-Task Connections**: Links between related activities are preserved to maintain campaign coherence and strategic alignment\n\n## Memory Utilization Strategies\n\n### Content Continuity\n- **Reference Previous Work**: Always check memory before starting new tasks to avoid duplication and ensure consistency with earlier outputs\n- **Build Upon Existing Content**: Use previously created materials as foundation for new content, maintaining thematic consistency and leveraging established messaging\n- **Version Control**: Track iterations and refinements of content pieces to understand evolution and maintain quality improvements\n\n### Strategic Context Maintenance\n- **Campaign Awareness**: Maintain understanding of ongoing campaigns, their objectives, timelines, and performance metrics\n- **Brand Voice Evolution**: Track how messaging and tone have developed throughout the day to ensure consistent voice progression\n- **Audience Insights**: Preserve learnings about target audience responses and preferences discovered during the day's work\n\n## Information Retrieval Protocols\n- **Pre-Task Memory Check**: Always review relevant previous work before beginning any new assignment\n- **Context Integration**: Seamlessly weave insights and content from earlier tasks into new outputs\n- **Dependency Recognition**: Identify when new tasks depend on or relate to previously completed work\n\n## Memory-Driven Optimization\n- **Pattern Recognition**: Use accumulated daily experience to identify successful approaches and replicate effective strategies\n- **Error Prevention**: Reference previous challenges or mistakes to avoid repeating issues\n- **Efficiency Gains**: Leverage previously created templates, frameworks, or approaches to accelerate new task completion\n\n## Session Continuity Requirements\n- **Handoff Preparation**: Ensure all memory contents are structured to support seamless continuation if work resumes later\n- **Context Summarization**: Maintain high-level summaries of day's progress for quick orientation and planning\n- **Priority Tracking**: Preserve understanding of incomplete tasks, their urgency levels, and next steps required\n\n## Memory Integration with Tool Usage\n- **Tool Output Storage**: Results from `write_newsletter`, `create_image`, `deep_research_topic`, and other tools are automatically catalogued with context. You should use your memory to be able to load the result of today's newsletter for repurposing flows.\n- **Cross-Tool Reference**: Use outputs from one tool as informed inputs for others (e.g., newsletter content informing Twitter thread creation)\n- **Planning Memory**: Strategic plans created with the `think` tool are preserved and referenced to ensure execution alignment\n\n# 4. Environment\n\nToday's date is: `{{ $now.format('yyyy-MM-dd') }}`\n```\n\n## Security Considerations\n\nSince this system involves and HTTP webhook, it's important to implement proper authentication if you plan to use this in production or expose this publically. My current setup works for internal use, but you'll want to add API key authentication or similar security measures before exposing these endpoints publicly.\n\n## Workflow Link + Other Resources\n\n- YouTube video that walks through this agent and workflow node-by-node: https://www.youtube.com/watch?v=_HOHQqjsy0U\n- The full n8n agent, which you can copy and paste directly into your instance, is on GitHub here: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/marketing_team_agent.json\n    - Write newsletter tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/write_newsletter_tool.json\n    - Generate image tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/generate_image_tool.json\n    - Repurpose to twitter thread tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/repurpose_to_twitter_thread_tool.json\n    - Repurpose to short form video script tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/repurpose_to_short_form_script_tool.json\n    - Generate talking avatar video tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/generate_talking_avatar_tool.json\n    - Email research report tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/email_research_report_tool.json",
    "subreddit": "automation",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 291,
    "downs": 0,
    "created_utc": 1753810703.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.071637307801537
  },
  {
    "score": 292,
    "title": "I just sold this real-time \"intent signals\" sales automation for $10K",
    "selftext": "Basically I'm monitoring 100+ RSS feeds like TechCrunch, Crunchbase, PR Newswire, and other Twitter pages that notify me as soon as a company:\n\n\\- Raises Money\n\n\\- Announces a new partnership\n\n\\- Announces a new product launch  \n&amp; 3 other intent signals. \n\nFrom there, it does deep research on the company and it's background and then outputs the information along with a personalized outreach message in my CRM.\n\nI've been helping a few people build their own automations too btw, if that interests you lmk ",
    "subreddit": "automation",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 292,
    "downs": 0,
    "created_utc": 1747866361.0,
    "media": null,
    "is_video": false,
    "num_comments": 77,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.11791492169935
  },
  {
    "score": 289,
    "title": "5 months selling AI automations taught me why 80% of them get abandoned (and how to fix it)",
    "selftext": "Made around $15K so far, nothing crazy, but learned some expensive lessons about why most automations fail.\n\nThe biggest issue isn't technical. It's integration.\n\n**Most automations work great in isolation but terrible in real workflows**\n\nI built a restaurant client an AI system for orders and inventory management. Worked perfectly in testing. They used it for 3 days then went back to their old system.\n\nWhy? Their entire operation ran on group texts, handwritten notes, and phone calls. My automation required them to view dashboards, learn new software, and change 15 years of established processes.\n\nMy mistake: I automated the task, not their actual workflow.\n\nNow I spend 2-3 days observing how they actually work before writing any code. Not what they tell me in meetings, what they actually do.\n\nWhat I track:\n\n* Primary devices (usually phones, not computers)\n* Communication methods (texts/calls over email)\n* Existing systems they look at daily\n* Apps already open on their devices\n\nExample: Calendly seems perfect for small businesses. Automated scheduling, no back-and-forth messages.\n\nBut many SMB owners prefer phone calls and texts because:\n\n* They don't want to open laptops\n* Don't look at emails regularly\n* Hate learning new interfaces\n* Already have established communication patterns\n\nAdding Calendly means managing multiple systems instead of simplifying their process.\n\n**Integration strategies that actually work**\n\nBest approach: plug into their existing communication channels instead of creating new ones.\n\nLandscaping client case study:\n\n* Managed crew through WhatsApp group chat\n* Instead of building project management software, I automated within WhatsApp\n* AI reads job photos from chat, estimates hours, sends schedules back to same chat\n* Completion tracking through emoji reactions\n\nSame workflow they used for 8 years, just automated behind the scenes.\n\n**The adoption test**\n\nI ask every client: \"If this requires checking one additional system daily, will you actually use it?\"\n\n90% say no. That tells me I need to rethink the approach.\n\nSuccessful automations:\n\n* Work within existing apps/communication methods\n* Output matches their current data formats\n* Require zero new logins or interfaces\n* Enhance current tools rather than replacing them\n\n**Results**\n\nMy highest-ROI automation is embarrassingly simple. Takes daily phone orders and formats them into the same text layout the client was already sending to their crew.\n\nSame information, same delivery method (group text), just organized automatically.\n\nResults: 45 minutes saved daily, $12K in avoided scheduling errors last month, zero training required.\n\n**Key takeaway**\n\nSimple automation used daily beats complex automation used never.\n\nMost businesses want their current process optimized, not revolutionized. Build for their actual habits, not ideal workflows.\n\nTooka lot of no's and unused automations to learn this lesson.\n\n",
    "subreddit": "automation",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 289,
    "downs": 0,
    "created_utc": 1754418832.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.977930301412205
  },
  {
    "score": 285,
    "title": "Anyone else surprised by how ChatGPT-5 just replaced everything overnight",
    "selftext": "I’ve been using ChatGPT since the early days through all the upgrades, quirks, and model changes.\nBut this week? Boom. Every single previous model… gone.\n\nNo “4o,” no “4-turbo,” no “3.5” for quick replies. Just one big GPT-5 model for everything.\n\nI get it progress is progress.\nBut here’s the thing: different models were better for different tasks.\nSome were faster, some cheaper, some more creative. Now that flexibility is gone.\n\nFor me, GPT-5 is powerful, but not always the right fit.\nIt feels like going from having a full toolbox… to having one shiny, expensive hammer.\n\nCurious how’s this change affecting your workflow? Are you loving GPT-5, or do you wish the old models were still around?\n\n",
    "subreddit": "automation",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 285,
    "downs": 0,
    "created_utc": 1754671782.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.129183630427818
  },
  {
    "score": 261,
    "title": "You built a wrapper not AI",
    "selftext": "I'm here to call out everyone out there that is pretending to be an AI engineer. People on reddit ask all the time about wanting to learn to use AI. Whenever a suggestion comes that suggests the person should learn math you see people getting pissed off saying you don't need to learn math for AI. Guys you building a wrapper doesn't mean you have AI skills, those are just dev skills. Unless you built the model with your own data etc. you did not make an AI, you leveraged it.",
    "subreddit": "automation",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 261,
    "downs": 0,
    "created_utc": 1755186545.0,
    "media": null,
    "is_video": false,
    "num_comments": 237,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.259089769848001
  },
  {
    "score": 243,
    "title": "Got paid $500 to automate daily data from a government portal",
    "selftext": "A dev shop I know needed daily data from a government portal. The portal had no API, and logging in was a pain.\n\nI spun up a Chrome CDP AI agent (Open Source) and told it the steps: login → go to reports → download CSV. The agent figured it out once.\n\nThe tool froze that run into a fixed workflow, which I exposed as an API endpoint.\n\nNow the dev shop just hits the endpoint daily and gets the fresh data. I don’t have to touch it.\n\nThey’re paying me 120 monthly for the API.\n\nThis made me realize: a lot of “API-less” sites can be turned into APIs in hours if you let AI figure out the steps once, then save them.\n\nNow I have others lined up who want to pay for the same",
    "subreddit": "automation",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 243,
    "downs": 0,
    "created_utc": 1758818045.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.968674914387697
  },
  {
    "score": 243,
    "title": "What's the most underrated automation you've built that quietly saves you hours every week?",
    "selftext": "Hey everyone,\n\nWe always talk about the usual suspects like lead follow-ups, calendar reminders, or data syncing. But I'm convinced there are so many more creative and impactful automations out there that people just overlook.\n\nSo, whether it's for personal stuff or business, what's that one automation you set up that just quietly saves you a ton of time?\n\nWould love to swap ideas and maybe even \"steal\" a few! 😊\n\n",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 243,
    "downs": 0,
    "created_utc": 1749008236.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.0354272276891425
  },
  {
    "score": 240,
    "title": "If AI eventually automates most jobs, who’s going to have money to buy stuff? How would the economy even work?",
    "selftext": "This has been keeping me up at night lol. If AI takes most jobs, we’re all broke. But if we’re broke, who buys the stuff AI is making?\nCompanies automate to make profit, but profit comes from selling to people. If those people are unemployed because of automation… isn’t that selfdefeating?\n\n\nSomeone tell me there’s an obvious answer I’m missing because this is genuinely stressing me out 😅​​​​​​​​​​​​​​​​",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 240,
    "downs": 0,
    "created_utc": 1753351259.0,
    "media": null,
    "is_video": false,
    "num_comments": 350,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.38967060080778
  },
  {
    "score": 239,
    "title": "How I went from missing a rent payment to 25k in the last 30 days",
    "selftext": "Hey, you guys. So this is going to be a long post, kinda ranting but also giving a bunch of details into what happened that allowed me to make 25k in 30 days.\n\n(Disclaimer: It was more like 45 days, but 30 days sounds better and I want people to read it so... sue me idk)\n\nA little bit about me to start: UGA grad in December 2024, At 16 I was doing dropshipping, at 19 I did a year of doing SMMA and in 2024, I worked in remote sales. In January of this year, I decided to go all in on business automations and AI.\n\nWhy? Well to be honest, a big shift that I had was I wanted to build a real skill. Something that was tangible. I used to play a ton of modded minecraft back in the day and I loved building factories. Something about that stuck with me, and somehow the dots are connecting, looking backwards.\n\nI did smma (I hated it), sales, and consulting, and all of them felt like It was too intangible. Like the skillset was there in my head, but there wasn't a tangible product, if that makes sense.\n\nFast forward to April and I had one client that I got from Upwork. It was a lead distribution system for a roofer out of Norway. The project that I thought would only take a few days took me an entire month. He asked for so many revisions (mostly because I didn't do it right), but the issue was it was my only source of income for an entire month and it felt like I was basically working for free. May 1st came around and I was broke. Completely broke. I had $400 to my name and a rent payment of $1500 that I owed. I called my landlord and explained the situation and thank god that he was understanding and told me thats fine but he expects the whole $3000 on June 1.\n\nTime to lock the fuck in.\n\nFinished the first project in early June. +1500 - Upworks cut = $1350  \nCharged for my software and utilities.  Too lazy to look them up exactly but -300\n\nSo we're at around $1450 now and I needed 3k plus utilities in 3 weeks.\n\nI wanted something that I could sell over and over that brought value as well as something different / better than what everyone else was doing. I got into voice agents. I spent the next 7 days of my life (around 10 hours a day) learning everything I can about voice agents. Youtube videos, Skool, Reddit and I made my first sale for an appointment setting bot for a CPA company out of Raleigh. Took me two days to set up. +$1500.\n\nI wasn't proud of myself. I feel like I sold something that was good but he was complaining that he couldn't keep track. There was no routing, no memory, and no way to see what happened during the calls.\n\nI was so embarrassed of myself and felt like I was scamming him, and that shame pushed me to create something I didn't even know I could make. I built a full-on lead routing system, with an end-of-call report wired to his GHL with an inbound webhook. We had 6 different call outcomes that I programmed Vapi to determine and each outcome led to a separate follow-up workflow. I built an n8n appointment setting bot, one that actually pulls the contact data from GoHighLevel so it doesn't even need to ask for the name and email address. The bookings would always be correct. I built a safeguard to send the booking link to the prospect if they couldn't book on the call. It was fucking beautiful let me tell you.\n\nI don't want to get in crazy detail because that's not even the most important part.\n\nI took everything I learned from that and turned my attention to outbound. I wanted to do the exact same thing, but for cold calling. I built a workflow to double dial every single lead in the campaign for 7 days straight. I built v2 of the routing system. 9 different call outcomes that Vapi would come to. Each call was recorded, tracked, and added as a note inside of Gohighlevel. Then I added 5 phone numbers to the campaign to do 600 fucking calls a day. Each phone number gets rotated inside the workflow, so each number is only doing 125 calls a day.\n\nI was so proud of myself that I went to the CPA and told him what I had built. I told him that I was planning on selling it for 15k once we got through testing, but I wanted to start a pilot program for people who want to get in for cheap but are willing to deal with the errors and bugs that inevitably are going to come with it.\n\nI told him 5k and held my breath and he told me absolutely he'd want to be a part of the program.\n\nBOOM 5 FUCKING GRAND IN THE BANK.\n\nI got an adrenaline rush. Called my parents and my siblings. Everyone was so happy. I rode this wave to LinkedIn. I bought Sales Navigator with the money and started pitching to AI automation company owners. Here is the exact copy I use.\n\n\"Hey man, this isn't AI. It's wild that I've gotta say that nowadays, but here we are.\n\nI'll keep it short. I'm trying to give you guys another tool for your offer.\n\nAI Cold callers that can do 600 calls a day (18,000/month). Take the system and install it into your client accounts as another add-on or upsell.\n\nYou interested?\n\nCould I show you over a 10-minute call this week?\"\n\nAfter doing this for 5 days, I got 8 booked calls and closed 4 of them for 5k each. 20 thousand fucking dollars in a week. Are you shitting me???? Plus the initial guys' 5k, it ended up being 25 thousand dollars.\n\nThat was last week. I've spent the last few days actually running the system, and its getting such good results. Our conversion rate is 0.7%, which isn't the best but isn't too bad at all. Industry standard is 1%, so its not too far off. It's about 4 meetings booked a day, which is still pretty great. So far, all of my clients are so happy. They've actually enjoyed being a part of the testing phase. They know the voice will only improve over time and with more testing, and they're actually helping me to make it better.\n\nToday is the first day I've started to do outreach again. Maybe I shouldn't have stopped but Im still learning obviously. Since the system is refined, I'm going to start selling it for 8k and see where it goes. If you read all the way through this, thank you. Believe in yourself and focus on making something truly valuable. I have ideas and improvements for the next version of the system, so maybe ill make another post but I just scrolled up and holy shit this is long. So thanks for reading lol.\n\nhttps://preview.redd.it/mpbk20ejdw8f1.png?width=1950&amp;format=png&amp;auto=webp&amp;s=6ec72f366277278a0518cbfd46f18c658697a3e5",
    "subreddit": "automation",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 239,
    "downs": 0,
    "created_utc": 1750780519.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.922809281725863
  },
  {
    "score": 222,
    "title": "I Made 275$ in a 1 day Building a WhatsApp AI agent for a client Here's Exactly What I Did",
    "selftext": "A couple of months ago I built a really simple WhatsApp chatbot using Python and a cheap WhatsApp API called **Wasenderapi** cost $6/month, and **Google's free Gemini AI.** It's not very fancy, just a Flask app that receives messages, sends them on to Gemini for a smart reply, then responds via WhatsApp.\n\nI used this bot to build other bots for a few local businesses by automating the responses to FAQs, orders, and Booking queries etc ... and I made $275 in a Weekend with one client. If anyone is interested in building useful AI tools, this is a great low-cost stack that actually delivers results.\n\nI'm happy to share the script if anyone finds it useful.\n\nthis is the github repo I used (Has +500 Stars btw)\n\ngithub/YonkoSam/whatsapp-python-chatbot\n\n",
    "subreddit": "automation",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 222,
    "downs": 0,
    "created_utc": 1753222620.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7606966613565658
  },
  {
    "score": 222,
    "title": "Most AI automation is overhyped BS but the stuff that works actually works really well",
    "selftext": "I’ve been helping businesses automate their workflows using tools like Zapier, Make, n8n, CRMs, and AI integrations for the past few years.\n\nAnd here’s the truth: Most AI automation people are hyping up is just noise and gimmicky bots, vague “AI integrations,” or things that look cool in a demo but fail in real business scenarios.\n\nBut a few core automations consistently work and bring real ROI and these are the stuffs that are really easy to implement as well.\n\n•\t⁠Lead generation flows — LinkedIn scraping, web forms, or lead magnets feeding into CRMs\n\n•\t⁠Automated email campaigns that actually convert cold leads into warm customers\n\n•\t⁠AI-powered auto-responders — for SMS, email, website, and social (with logic to stop when needed — no annoying loops)\n\n•\t⁠Call automation — risky but effective for cold outreach if used carefully\n\n•\t⁠CRM workflows — pipeline updates, reminders, auto-assignments, etc.\n\n•\t⁠Instant alerts + summaries — Get a Slack or email summary of leads, sales, or support tickets daily/week\n\nThese are the common ones I’ve rolled out across multiple businesses and always solid results.\n\nThen there’s the more experimental stuff I’ve been testing which are bringing good results:\n\n•\t⁠Automated optimized blog generation — long-form content created with AI, posted to WordPress, and logged in Sheets\n\n•\t⁠Performance-based iteration — tracked clicks/impressions and refined content topics based on what actually performed\n\n•\t⁠Social content automation — scheduled and posted platform-specific content across multiple channels, fully automated\n\nSmall changes here can save hours and boost conversions. No need to “AI everything.” Just fix the bottlenecks that are slowing you down.",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 222,
    "downs": 0,
    "created_utc": 1752159570.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.94880653486556
  },
  {
    "score": 220,
    "title": "I don’t cold DM on LinkedIn anymore. I psychologically profile people, then write what they’ve been dying to hear - all with this 1 automation.",
    "selftext": "I got tired of relying on surface-level data like job titles - this automation can pierce into internal drivers, emotional friction, and cognitive biases.\n\nI come from a background in marketing and psychology, so I stopped asking “how do I get a reply?”  \nAnd started asking:\n\n* Who is this person, **underneath the job title?**\n* **What cognitive biases are they most likely to respond to?**\n* **What fear are they quietly navigating at work right now?**\n\nSo I stopped stalling and built what I call the **NeuroSales Agent,** and things started changing... quickly.\n\n*Here’s what it does:*  \n\\- Crawls LinkedIn Profile Data and Posts\n\n\\- Uses Claude 3.7 Sonnet to **psychoanalyze** ***their personality, behaviors, education &amp; experience*** *(you can learn A LOT about someone based on this)*\n\n\\- Generates **surgical outreach** that hooks into *their mental models, insecurities, &amp; desires*.\n\nNow my cold emails &amp; LinkedIn DMs ***actually*** get replies because they're either like \"holy shit how does this person know that\" or **\"this person clearly is interested in me as a person, which makes me more interested in them.\"**\n\nIf you're tired of sounding like a template... this helps.\n\nHappy to answer any questions or entertain any skepticism - happy to post the (free) download link for the JSON blueprint in the comments if people want it",
    "subreddit": "automation",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 220,
    "downs": 0,
    "created_utc": 1749827608.0,
    "media": null,
    "is_video": false,
    "num_comments": 127,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.065497258509044
  },
  {
    "score": 217,
    "title": "Top Alternatives to Zapier That I've found",
    "selftext": "Just my list of alternatives that I've found to Zapier, obviously we know the popular options but there are others and voila here's my list feel free to roast or comment.\n\n1. WRK - My favorite paid pick. Handles complex workflows like a pro and won’t drain your budget. Solid, powerful, and affordable would definitely cite this as an alternative.\n2. Make -Sleek interface packed with features. Perfect for complex automations without breaking the bank.\n3. Activepieces New open-source tool with both cloud and self-host options. Growing fast and definitely worth checking out.\n4. Relay Smart AI-powered workflows that actually get stuff done. Fresh, modern automation vibes.\n5. Microsoft Power Automate Best if you’re deep into Microsoft products. Tight integration with Office 365 and Azure.\n6. Gumloop AI-first, super user-friendly. Great for teams wanting next-level smart automation.",
    "subreddit": "automation",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 217,
    "downs": 0,
    "created_utc": 1762661079.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.796031482764558
  },
  {
    "score": 210,
    "title": "determining when to use an AI agent vs IFTT (workflow automation)",
    "selftext": "After my last post I got a lot of DMs about when its better to use an AI Agent vs an automation engine. \n\nAI agents are powered by large language models, and they are best for ambiguous, language-heavy, multi-step work like drafting RFPs, adaptive customer support, autonomous data research. Where are automations are more straight forward and deterministic like send a follow up email, resize images, post to Slack.\n\nThink of an agent like an intern or a new grad. Each AI agent can function and reason for themselves like a new intern would. A multi agentic solution is like a team of interns working together (or adversarially) to get a job done. Compared to automations which are more like process charts where if a certain action takes place, do this action - like manufacturing.  \n  \nI built a website that can actually help you decide if your work needs a workflow automation engine or an AI agent. If you comment below, I'll DM you the link!\n\n",
    "subreddit": "automation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 210,
    "downs": 0,
    "created_utc": 1750960120.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7019187078493454
  },
  {
    "score": 194,
    "title": "I’ve been pulling leads straight from Google Maps, here’s how",
    "selftext": "Most people don’t realize this, but Google Maps is actually one of the best lead sources out there.\n\nHere’s how you can use it:\n\n1. Go to Google Maps and search by any keyword + location (e.g., *“automation” in San Francisco*).\n2. Grab the link and feed it into a scraper tool like Apify. The actor will pull details like phone numbers, emails, LinkedIn, websites, and even social media.\n3. Set up an automation in **n8n** (or Zapier/Make) so the data goes straight into Google Sheets or instantly triggers outreach.\n4. Bonus: make the workflow recurring so every day you wake up with fresh leads — without lifting a finger.\n\nSuper actionable, costs very little, and scales fast if you’re consistent.",
    "subreddit": "automation",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 194,
    "downs": 0,
    "created_utc": 1755987903.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9089912896839456
  },
  {
    "score": 199,
    "title": "13 AI tools that actually save me time and deliver real results",
    "selftext": "There are many AI tools out there, they come and go with many hypes. I've tried a lot of them and here are the tools I'm actually using to increase productivity/create new stuff. Most have free options.\n\n* ChatGPT - still my go-to for brainstorming, drafts, code, and image generation\n* Veo 3 - Well, it makes realistic videos from a single prompt.\n* Saner.ai - My personal assistant, I just chat to manage notes, tasks, emails, and calendar\n* Fathom - Free AI meeting note takers, finds action items\n* Manus / Genspark - AI agents that actually do stuff for you, handy in heavy research work\n* NotebookLM - Turn my PDFs into podcasts, easier to absorb information\n* ElevenLabs - AI voices, so real. Great for narrations and videos.\n* Suno - Just play around with this to create music from prompts.\n* Grammarly - I use this everyday, basically it’s like a grammar police and consultant\n* V0 / Lovable - Turn my ideas into working web apps, without coding\n* Consensus - Get real research paper insights in minutes. So good for fact-finding purposes.\n\nWhat AI, automation agent make it to your tech stack? Tell me yours",
    "subreddit": "automation",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 199,
    "downs": 0,
    "created_utc": 1754466423.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8295599913279625
  },
  {
    "score": 196,
    "title": "Open Source WhatsApp Chatbot Powered by Python and Gemini AI – Only $6/Month to Run",
    "selftext": "Hey everyone!\n\nI recently developed an open-source WhatsApp chatbot using Python, Google's Gemini AI, and WaSenderAPI. The goal was to create an affordable yet powerful chatbot solution.\n\n**Key Features:**\n\n* **AI-Powered Responses**: Utilizes Google's Gemini AI to generate intelligent and context-aware replies.\n* **WhatsApp Integration**: Handles sending and receiving messages through WaSenderAPI.\n* **Cost-Effective**: Runs at just $6/month using WaSenderAPI, with Gemini's free tier offering 1,500 requests/month.\n* **Open Source**: Fully available on GitHub for anyone to use or modify.\n\nYou can check out the project here:  \ngithub/YonkoSam/whatsapp-python-chatbot\n\nI'm looking forward to your feedback and suggestions!",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 196,
    "downs": 0,
    "created_utc": 1746996320.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.001707562236677
  },
  {
    "score": 194,
    "title": "I've spent like 250 hours building a free Google Sheets to TikTok poster",
    "selftext": "This was supposed to be a quick side project for private use but I am quite slow at coding and also getting access to the TikTok API was more demanding than I expected, so it ended up taking much longer than I would have liked...\n\nBut anyway, the result is so good that I've published it as an add-on in the Google Sheets marketplace.\n\n**What does it do?**\n\n* You paste image URLs in colums (very convenient, you can just copy and paste Unsplash URLs)\n* Next to each image, you write a caption\n* The addon takes the captions and overlays them on the images with the default TikTok UGC style\n* You mark them as Ready and schedule them\n* The slideshows is posted and the public link is logged in the Posted tab with the date\n\nSee a screenshot of the layout:\n\n[\\(You might need to zoom in\\)](https://preview.redd.it/5z4xm3t29c0f1.png?width=1541&amp;format=png&amp;auto=webp&amp;s=2520561ecb7269480d2be623e07892a7f275a4dc)\n\nAnd this is how the caption looks above the image:\n\nhttps://preview.redd.it/s45yz2re9c0f1.png?width=756&amp;format=png&amp;auto=webp&amp;s=4d4410cbb9d8deef839ca441959175ba08083403\n\n**What's the point of this?**\n\nI've been doing TikTok marketing for quite a while, and I've realized two things:\n\n1. TikTok followers don't matter much when it comes to getting views.\n2. Slideshows are very easy to automate and get the same or more visibility than videos.\n\nSo the smartest thing to do is simply to automatically post slideshows very often, testing many hooks and image combinations.\n\nSince I didn't find any tool that allows me to mass-schedule many slideshow variations, I ended up developing it myself, and Google Sheets was perfect for this.\n\n**Update:** ok, I made the addon public, go to the Google Workspace Marketplace and search \"Plannic\", or go directly to plannic \\[dot\\] app",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 194,
    "downs": 0,
    "created_utc": 1747050543.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.032534611362518
  },
  {
    "score": 189,
    "title": "Automated my 3D asset workflow for a gamer-style presentation set in 15 minutes",
    "selftext": "Needed a custom 3D icon (game controller style) for a side project presentation. Stock sites didn’t have the look I wanted, and modeling from scratch would've taken hours. So I tested an AI tool instead.\n\nI typed in the style, material, and lighting I had in mind - got a clean, polished 3D icon in seconds.\n\nhttps://preview.redd.it/vv5ej2xvbmye1.png?width=1862&amp;format=png&amp;auto=webp&amp;s=4d9fdf4327a3e6b4f2e982f81bb1c2dbe8562299\n\nUsed the same tool to:\n\n* Sharpen the image\n* Remove the background (2 clicks)\n* Generate matching assets (headset, mouse, keyboard)\n\nhttps://preview.redd.it/n9nhhlg4cmye1.jpg?width=3464&amp;format=pjpg&amp;auto=webp&amp;s=81f1878299d947ce0d33923394246774b74b294e\n\nWhole set done in 15-20 minutes. All consistent in style, ready to drop into slides or UI mockups. Definitely keeping this workflow in my toolbox for future projects.",
    "subreddit": "automation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 189,
    "downs": 0,
    "created_utc": 1746300591.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.26731422831266
  },
  {
    "score": 187,
    "title": "A Marketplace for Buying &amp; Selling Automation Workflows",
    "selftext": "Hi fellow automators!\n\nLike many of you, I've found myself in two frustrating situations when building workflows:\n\nScenario 1: Starting a new workflow and thinking, \"Someone must have already built this. I'd happily pay for a tested solution rather than spend days reinventing the wheel.\"\n\nScenario 2: Finishing a complex workflow after countless hours and wondering, \"Could I help others (and earn something) by sharing what I've built?\"\n\nThese pain points sent me searching for a dedicated marketplace for automation workflows. Surprisingly, I came up empty-handed.\n\nSo I built one.\n\nIntroducing [Neura.Market](http://neura.market/) – a marketplace where you can buy and sell automation workflows across multiple platforms:\n\n* n8n\n* Zapier\n* Make\n* Activepieces\n* Pipedream\n\nWhat's available:\n\n* Over 13,000 free workflows templates ready to download (no sign up required)\n* Opportunity to monetize your own workflows\n\nAfter more hours than I care to admit, I'm excited to share this with the community that inspired it :)\n\nWould love to hear your thoughts and feedback!",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 187,
    "downs": 0,
    "created_utc": 1757638231.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6992634701194826
  },
  {
    "score": 186,
    "title": "Im a retail business owner , (200k/yr) here are what \"ai automation agencies\" are doing wrong",
    "selftext": "  \nI'm sorry to say this, but if you're an \"AI automation agency,\" nobody in the real world knows what you actually do. The clients you're pursuing don't really care how AI can improve their business, all they care about is saving money, making things faster, and running more smoothly. They don't care if the solution is AI-driven or outsourced to someone in India. If you can help them save money or replace one of their workers, then you've got them hooked.\n\nPersonally, I've been looking for someone to streamline my business, but all I see on my feed is \"use AI to better your business.\" You're forcing us to do the research on how we can use you, and it's not working.\n\nWhat you're doing has insane potential. If I knew how to do what most of you do, I promise I'd be saving my business partners thousands of dollars a year. I'd be the leader in my field.\n\nStop overcomplicating it. Just offer your AI-driven solution and dumb it down enough for the typical person to understand.\n\nFor example, I need a way for my clients to fill out one loan application, save that info, and have a bot fill out four more applications using the same info. That alone would save me months of paid employee labor, spent manually filling out multiple applications. \n\nFrom what I've searched, this type of service doesn't even exist. It's silly, because just this one model alone could easily be offered to real estate agents, car dealerships, or any retail or high-ticket stores that usually have multiple financing applications for their products. But there's nothing out there for that. I personally know some business owners who would pay a lot for this solution.\n\nFind an annoying problem that can be solved. If it can save hours of input labor, then you have a winner.\n\nAlso, don't just chase the big fish, because everyone else is already competing for them. Small-time plumbers, landscapers, and handymen also want their time back. If you can speak to them like humans and offer a solution that helps them invoice faster, answer messages quicker, etc., they'll definitely pay good money for it.\n\nLike my dear mother used to say:  \n**\"The world is covered with money lying unnoticed at your feet. Step outside, open your eyes, and pick it up.\"**",
    "subreddit": "automation",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 186,
    "downs": 0,
    "created_utc": 1747792033.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.992727473669621
  },
  {
    "score": 169,
    "title": "How are you leveraging AI for sales automation to enhance lead conversion?​",
    "selftext": "With the rapid advancements in AI, many sales teams are turning to sales automation platforms to streamline their processes and improve lead conversion rates.\n\nI'm curious to know which AI-driven tools you've found most effective.\n\nPlatforms like \"Highperformr AI\" offer real-time intent signals and automate engagement workflows. Have you integrated such tools into your sales strategy?\n\nWhat impact have they had on your team's performance?​\n\nLooking forward to your insights!​\n",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 169,
    "downs": 0,
    "created_utc": 1745935662.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7609812248915238
  },
  {
    "score": 167,
    "title": "How I Built Automation Systems for Clients Without Being a Developer",
    "selftext": "I see a lot of people asking if they need to know code to be no-code automation experts. Here’s the breakdown from someone who’s been running automations for clients for a while.\n\nMost of the work you’ll do, even for paying clients, does not need code. Tools like Zapier, Make, and n8n are built so you can drag, drop, and connect apps visually. You are solving problems by setting up logic, conditions, and moving data between apps. If you understand triggers, actions, and have a basic sense of what APIs do, you can already build solid workflows. No coding, just smart mapping.\n\nTypical no-code projects include things like auto-emailing new leads from a website form, updating CRM records when someone fills a survey, moving spreadsheet data into dashboards, or sending Slack alerts when deals close. What really matters is your logical thinking, your ability to understand how apps talk to each other, and how good you are at troubleshooting when something goes wrong. Honestly, you can run a full automation business just by mastering these no-code moves.\n\nNow, at some point, you will run into problems that no pre-built connector or action can solve. Maybe an API returns messy data. Maybe you need to do custom calculations or parse complex JSON. That is when basic coding skills help. I am talking tiny scripts, not full apps. A bit of JavaScript inside a Zapier Code step, or a Python call inside n8n, and you can solve what 99 percent of people get stuck on.\n\nThe first time I used a tiny JavaScript step to fix a broken workflow, it opened up a whole new level of client work I could charge more for. You are not learning code upfront. You are picking it up naturally as you hit walls. Think of it like adding power tools to your toolbox, not switching careers.\n\nYou do not need to know code to start. You will pick up what you need when you need it. Start with no-code. Build a strong foundation. Add coding skills only to unlock bigger and better automations over time. Most of the real value you deliver comes from solving business problems, not writing fancy code.\n\nIf you are just starting or feel stuck anywhere, drop a comment. Happy to share advice or real examples from experience.",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 167,
    "downs": 0,
    "created_utc": 1745839412.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.763341585239112
  },
  {
    "score": 167,
    "title": "How much of your workflow is actually automated?",
    "selftext": "I always thought automation was mostly for coding, data, or business processes. But lately, I’ve been experimenting with AI for creative work, and it turns out I was doing way too much manually.  \nI’ve started automating parts of my content creation process - creating digital models, changing their outfits, even making photos more detailed. \n\nhttps://preview.redd.it/i2gy03364fqe1.png?width=1000&amp;format=png&amp;auto=webp&amp;s=fbcd48bc79a165ce32ae80a2454f6880a451681a\n\nhttps://preview.redd.it/83zzk6364fqe1.png?width=1374&amp;format=png&amp;auto=webp&amp;s=e12dc65f7360cebfcab0510b0c4154f1f29a9dd5\n\nhttps://preview.redd.it/sfz1s7364fqe1.png?width=1379&amp;format=png&amp;auto=webp&amp;s=e5af2cee7e58ea7d083ba9ac35f3bb16291444f7\n\nhttps://preview.redd.it/mncar6364fqe1.png?width=1116&amp;format=png&amp;auto=webp&amp;s=27999968d9f889b7b22f50ce12f9f120fca1439c\n\nSome tools work great, others not so much. The biggest challenge is getting automation to be flexible instead of feeling generic.  \nI know there's a lot of talk about how AI content is bad, but personally, I don’t agree. AI itself isn’t the problem - it’s all about how you use it.  \nWhat’s been your experience with automating creative tasks? Do you trust AI to handle design, or branding, or do you still do most things manually? Would love to hear what’s working for you (or what’s been a complete fail).",
    "subreddit": "automation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 167,
    "downs": 0,
    "created_utc": 1742726391.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5633549112537035
  },
  {
    "score": 162,
    "title": "I built an AI automation that converts static product images into animated demo videos for clothing brands using Veo 3.1",
    "selftext": "I built an automation that takes in a URL of a product collection or catalog page for any fashion brand or clothing store online and can bring each product to life by animating those with a model demonstrating that product with Veo 3.1. \n\nThis allows brands and e-commerce owners to easily demonstrate what their product looks like much better than static photos and does not require them to hire models, setup video shoots, and go through the tedious editing process.\n\n**Here’s a demo of the workflow and output:** https://www.youtube.com/watch?v=NMl1pIfBE7I\n\n## Here's how the automation works\n\n### 1. Input and Trigger\n\nThe workflow starts with a simple form trigger that accepts a product collection URL. You can paste any fashion e-commerce page.\n\nIn a real production environment, you'd likely connect this to a client's CMS, Shopify API, or other backend system rather than scraping public URLs. I set it up this way just as a quick way to get images quickly ingested into the system, but I do want to call out that no real-life production automation will take this approach. So make sure you're considering that if you're going to approach brands like this and selling to them. \n\n### 2. Scrape product catalog with firecrawl\n\nAfter the URL is provided, I then use Firecrawl to go ahead and scrape that product catalog page. I'm using the built-in community node here and the extract feature of Firecrawl to go ahead and get back a list of product names and an image URL associated with each of those.\n\nIn automation, I have a simple prompt set up here that makes it more reliable to go ahead and extract that exact source URL how it appears on the HTML.\n\n### 3. Download and process images\n\nOnce I finish scraping, I then split the array of product images I was able to grab into individual items, and then split it into a loop batch so I can process them sequentially. Veo 3.1 does require you to pass in base64-encoded images, so I do that first before converting back and uploading that image into Google Drive. \n\nThe Google Drive node does require it to be a binary n8n input, and so if you guys have found a way that allows you to do this without converting back and forth, definitely let me know. \n\n### 4. Generate the product video with Veo 3.1\n\nOnce the image is processed, make an API call into Veo 3.1 with a simple prompt here to go forward with animating the product image. In this case, I tuned this specifically for clothing and fashion brands, so I make mention of that in the prompt. But if you're trying to feature some other physical product, I suggest you change this to be a little bit different. Here is the prompt I use: \n\n```markdown\nGenerate a video that is going to be featured on a product page of an e-commerce store. This is going to be for a clothing or fashion brand. This video must feature this exact same person that is provided on the first and last frame reference images and the article of clothing in the first and last frame reference images.|In this video, the model should strike multiple poses to feature the article of clothing so that a person looking at this product on an ecommerce website has a great idea how this article of clothing will look and feel.Constraints:- No music or sound effects.- The final output video should NOT have any audio.- Muted audio.- Muted sound effects.\n```\n\nThe other thing to mention here with the Veo 3.1 API is its ability to now specify a first frame and last frame reference image that we pass into the AI model.\n\nFor a use case like this where I want to have the model strike a few poses or spin around and then return to its original position, we can specify the first frame and last frame as the exact same image. This creates a nice looping effect for us. If we're going to highlight this video as a preview on whatever website we're working with.\n\nHere's how I set that up in the request body calling into the Gemini API:\n\n```markdown\n{\n  \"instances\": [\n    {\n      \"prompt\": {{ JSON.stringify($node['set_prompt'].json.prompt) }},\n      \"image\": {\n        \"mimeType\": \"image/png\",\n        \"bytesBase64Encoded\": \"{{ $node[\"convert_to_base64\"].json.data }}\"\n      },\n      \"lastFrame\": {\n        \"mimeType\": \"image/png\",\n        \"bytesBase64Encoded\": \"{{ $node[\"convert_to_base64\"].json.data }}\"\n      }\n    }\n  ],\n  \"parameters\": {\n    \"durationSeconds\": 8,\n    \"aspectRatio\": \"9:16\",\n    \"personGeneration\": \"allow_adult\"\n  }\n}\n\n```\n\nThere’s a few other options here that you can use for video output as well on the Gemini docs: https://ai.google.dev/gemini-api/docs/video?example=dialogue#veo-model-parameters\n\n## Cost &amp; Veo 3.1 pricing\n\nRight now, working with the Veo 3 API through Gemini is pretty expensive. So you want to pay close attention to what's like the duration parameter you're passing in for each video you generate and how you're batching up the number of videos. \n\nAs it stands right now, Veo 3.1 costs 40 cents per second of video that you generate. And then the Veo 3.1 fast model only costs 15 cents, so you may honestly want to experiment here. Just take the final prompts and pass them into Google Gemini that gives you free generations per day while you're testing this out and tuning your prompt. \n\n## Workflow Link + Other Resources\n\n- YouTube video that walks through this workflow step-by-step: https://www.youtube.com/watch?v=NMl1pIfBE7I\n- The full n8n workflow, which you can copy and paste directly into your instance, is on GitHub here: https://github.com/lucaswalter/n8n-ai-automations/blob/main/veo_3.1_product_photo_animator.json",
    "subreddit": "automation",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 162,
    "downs": 0,
    "created_utc": 1761237188.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6161576087399765
  },
  {
    "score": 157,
    "title": "I built a system that finds leads by itself and  it accidentally became my full-time business",
    "selftext": "A few months ago I decided to get into this GTM Engineering thing and started building a small automation system with Clay to help with lead research for \"potential clients\". I was tired of wasting hours digging through LinkedIn and Google Sheets just to find a few decent prospects, so I tried connecting a few tools together some data sources, an AI agent to fill gaps, and a workflow to trigger outreach automatically.  \nAt first it was just supposed to save me time. Then it started performing better than the client’s entire SDR team. The workflow finds companies that match my criteria, enriches the data across multiple sources, uses AI to figure out which ones are most likely to buy, and even flags when something changes (like a new hire or a funding round). It doesn’t send a single cold email it just delivers perfect lists of people worth contacting.\n\nAt some point I realized I’d basically built a product. So I started offering the same setup to a few other businesses. Within a few months, the workflow itself became the business. I wake up to new client requests, and the system just runs, though initially I did spend quite some time to learn it (even took a few courses on it)  \nI’m not a developer, never studied computer science, and this whole thing grew out of curiosity. Now I’m running a tiny agency built around these automations and it's been going pretty great so far, wish me luck!!",
    "subreddit": "automation",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 157,
    "downs": 0,
    "created_utc": 1761921984.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.670414056893366
  },
  {
    "score": 150,
    "title": "I scraped 5,000+ Reddit , G2, Capterra and Upwork complaints - tell me your niche and I’ll reply with a real pain point + SaaS idea",
    "selftext": "I got tired of spending nights researching Reddit threads, G2 rants, Capterra reviews, and Upwork briefs just to spot a real, unsolved problem worth building for. So I wrote a crawler + AI parser that now tracks thousands of live complaints and clusters them into pain point cards. I’m using it to power my own project StartupIdeaLab dot io , but before I polish anything further I want to test the raw insights with other founders.\n\nIf you drop a comment with the niche or industry you’re targeting B2B SaaS, ecommerce tooling, dev productivity, whatever I’ll reply with one genuine pain point my system pulled, plus a quick SaaS idea you could spin up to solve it. No strings attached. If the idea sparks something, great. If you try the tool and bail, even better let me know why the paid plan didn’t feel worth it so I can fix it.\n\nI’ll hang out in the thread for as long as it stays alive and answer everyone who jumps in. Fire away with your niche or feedback.",
    "subreddit": "automation",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 150,
    "downs": 0,
    "created_utc": 1750863751.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.990135614667257
  },
  {
    "score": 143,
    "title": "If you’re into automation — you’ll want to be in this.",
    "selftext": "\n\nWe just launched Automation Lab, a Discord server built for anyone working with automation tools — n8n, Make, Zapier, bots, APIs, webhooks, all of it.\n\nIn less than 2 weeks, we’ve gathered 200+ serious members:\n\nAutomation freelancers\n\nIndie SaaS builders\n\nBot creators\n\nTool founders\n\nAI + Ops people\n\n\nWe host live sessions with experts, share real projects, job leads, and resources.\nAlready, members have closed freelance deals, launched side projects, and learned from others.\n\nDo not miss out on this \n\nWe’re curating this to stay high-value and collaborative.\n\nIf you’re building or running anything in automation — this server will help you go faster, find collaborators, and stay ahead.\n\n\n\nDm me and I will send you the link ",
    "subreddit": "automation",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 143,
    "downs": 0,
    "created_utc": 1748176745.0,
    "media": null,
    "is_video": false,
    "num_comments": 166,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.907220727669041
  },
  {
    "score": 137,
    "title": "Won a hackathon by building an n8n app",
    "selftext": "Hi guys! Me and two friends took part in a hackathon by AI Tinkerers and ended up winning **2nd** place.\n\nWe built a desktop app that: monitors your activities on the computer, detects repetitive tasks and deploys them as n8n workflows with a single click.\n\nCheck a demo video (2 minutes, cringy but funny): [youtube.com/watch?v=alvI45DFasc](http://youtube.com/watch?v=alvI45DFasc)\n\nand the landing page: [lothtedious.com](http://lothtedious.com)\n\nThe feedback of the hackathon members and judges was very positive, and got us thinking: would it actually be a viable product? **What do you guys think?**",
    "subreddit": "automation",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 137,
    "downs": 0,
    "created_utc": 1747943265.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6437710147611044
  },
  {
    "score": 125,
    "title": "I built “Vercel for AI agents” — single click production ready deployment of ai agents using our open source framework",
    "selftext": "I’ve been building a platform called Dank AI — basically a “Vercel for AI agents.” You define an agent in JavaScript with our framework, link a GitHub repo to our cloud dashboard, and it deploys to a production URL in one click (containerized, with secrets, logs, CPU/RAM selection, etc.). You can also get analytics on your agents' performance and usage. No Dockerfiles, no EC2 setup.\n\nYou can get $10 worth of free credits when you sign up so you can try it. Here’s a blog post with a quickstart guide to show you how easy it is to deploy:   \n[https://medium.com/@deltadarkly/deploying-ai-agents-with-a-javascript-first-workflow-an-overview-of-dank-ai-af1ceffd2add](https://medium.com/@deltadarkly/deploying-ai-agents-with-a-javascript-first-workflow-an-overview-of-dank-ai-af1ceffd2add) \n\nI’m trying to get feedback specifically from people who’ve deployed agents before, so a couple of questions:\n\n* How are you currently deploying your AI agents?  \n* What’s the most annoying or time-consuming part of that process?  \n* Have you found any service that actually makes agent deployment easy?  \n\nIf you have 10min to try it out, your feedback would be super helpful. I want to make this tool as useful as I can.\n\n",
    "subreddit": "automation",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 125,
    "downs": 0,
    "created_utc": 1764866706.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0439311724773943
  },
  {
    "score": 119,
    "title": "You will never make 300K per month selling AI Agents (gurus dont even). This stupid thing was killing my sales calls.",
    "selftext": "When I first started getting sales calls, I felt like I’d finally made it. After months of trying to get attention, testing random things, and sending messages that went nowhere, people actually booked time with me. Finally! I'm rich! I thought...but that was further away from truth...although I was aboud to start making some decent ogood money. \n\nI had SaaS founders, ecom owners, and some agency guys on my calendar. I thought, this is it, I’m in the game now. I was hyped. Who douwlnd be to be honest? Had my slides ready, a few Loom videos open, and my automations waiting to show off. Thought I had everything figured out.\n\nThen I completely blew it.\n\nEvery single call. Like aaaall of em... more than 30 I would say in a row. \n\nNot because my offer was bad or my price was high. But because I talked too much. I went full nerd mode. I explained every tiny thing I built GPT prompts, n8n flows, data cleanup, CRMs, all of it. I thought they’d love it. Instead, their faces started going blank. They’d say nice or cool and that was it. Call over.\n\nAt first, I thought they just didn’t get it. But after a few calls, I realized the problem was me. I was explaining, not selling. I was trying to sound smart instead of solving their problem.\n\nOne guy finally snapped me out of it. We were talking, and he just said, how much money does this make us. And I had no answer. I remember sitting there feeling like an idiot. I knew every detail about how it worked, but not what it was worth.\n\nThat night I stayed up thinking about that. I realized I’d been hiding behind the tech. Talking about it made me feel safe, like I was in control. But it wasn’t helping me close a single deal.\n\nNext day, I changed how I ran my calls. No screen share. No slides. No tech talk. I just asked questions. What’s slowing you down? Where do you waste the most time? Who’s doing boring stuff every day? I let them talk. Then I asked what that costs them. Hours. Leads. Money. Once they said it out loud, I didn’t need to convince them anymore.\n\nThen I gave them one result. Not a list. Not a plan. Just one thing. Like, your team only talks to qualified leads. Or, every lead gets an instant reply. That’s it.\n\nWhen they asked how, I kept it short. I said I’ll set it up so it just works in the background. Then I went right back to the numbers they gave me.\n\nAnd that was it. That’s what finally worked. Calls stopped feeling awkward. People actually paid attention. They wanted to move forward. It wasn’t magic  I just stopped trying to impress and started helping.\n\nNow, let’s talk about the part that pisses me off. The internet is full of fake stories. Every day I see 18-year-olds saying they make 300k a month selling automations. It’s all BS.\n\nI’ve been doing this long enough to know what real work looks like. I’ve built systems for clients, done consulting, and had good months. The best I ever did was around 30k. Most months are 10 to 15k. That’s solid money. But it’s not what those kids are claiming.\n\nThey sell you a dream. And it ruins the whole space. It makes beginners think they’re failing if they don’t make 100k by month two. It makes clients think everyone’s a scammer. I’ve had clients literally say, you guys all promise the world. That’s what these fake gurus cause.\n\nIf someone was really making 300k a month, they wouldn’t be spending their time making YouTube videos and trying to go viral. You’re the product they’re selling.\n\nSo if you’re just starting and your first sale is taking forever, relax. Ignore the noise. Nobody shows you the real work. The rejections, the bugs, the late nights fixing broken flows while a client pings you at 2am. That’s the real part.\n\nIf there’s one thing I learned, it’s this. Stop trying to sound smart. Be simple. Ask good questions. Find the pain, do the math, and show one result. That’s it. And stop believing 20y kids telling you they make 100K+ per month with their agency. they are not. they make that money (if only) from selling your their skool community, aka their course. so ... fak that.....\n\nAnd when you start closing, the next challenge begins delivery. Making it actually work.\n\nSo talk soon about that. \n\nNow i've got to get to sleep. \n\nSee ya soon\n\nGG",
    "subreddit": "automation",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1760830615.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.572213549560874
  },
  {
    "score": 120,
    "title": "Replaced a $3k/mo SEO retainer with a modular workflow that runs on $50/mo",
    "selftext": "So, a partner company of mine was burning **$3,000/month** on an SEO agency. The output? 8 blog posts a month that looked like they were copy-pasted from ChatGPT.\n\nI looked at their process and realized they were doing manual grunt work that should have been automated 2 years ago. So I spent the last few weeks building a system to replace the manual workflow.\n\n**The Goal:** Build a \"Digital Employee\" that doesn't just write, but actually does the research and distribution.\n\n**The Stack:** [Make.com](http://Make.com), DataForSEO, OpenAI, Nano Banana Pro (for visuals).\n\n**Here is the logic flow:**\n\n1. **The Strategy (No Human Input):**\n   * System generates seed keywords based on business profile.\n   * Hits the **SEO API** to find 20+ long-tail variations with decent search volume, medium competition and good CPC.\n   * **The cool part:** It uses N-gram analysis to *cluster* these keywords into topic groups so we don't cannibalize our own rankings.\n2. **The Research (Killing Generic Content):**\n   * Before writing, it Googles the keyword and scrapes the Top 3 ranking results.\n   * It extracts their H2 headers to see what they covered.\n   * It generates an outline that covers their points *plus* the content gaps they missed.\n3. **The Build (Visuals included):**\n   * Writes the draft section-by-section.\n   * Generates a custom featured image using **Nano Banana Pro** based on the article context. No generic stock photos.\n   * Auto-publishes to WordPress with proper schema.\n4. **The Distribution:**\n   * Once the WP confirms \"Published,\" it triggers a social blast.\n   * Auto-posts to LinkedIn, Facebook, Twitter, and GMB with platform-specific captions.\n\n**The Results so far:**\n\n* **Cost:** Reduced from $3k/mo to \\~$50/mo in API credits.\n* **Volume:** Scaled from 2 posts/week to 2 posts/day.\n* **Quality:** Articles are indexing faster because of the clustering logic.\n* **Manual Work:** Zero. I just check the logs once a week.\n\nI’m refining the **Keyword Clustering Module** right now (it’s the trickiest part with the array logic). If anyone wants to see the JSON for that specific part to see how the aggregation works, let me know and I can DM it to you.\n\nHappy to answer questions on the API stack!",
    "subreddit": "automation",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1764941310.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.671830363812422
  },
  {
    "score": 119,
    "title": "It feels depressing to be an automation expert but cannot make money",
    "selftext": "Hi,\nI am a coding hobbyist, I have been coding for over 20+ years, I have learned a ton of languages and have done a ton of automation at work that saved the company good amount of money.\n\nThe websites I tried to build for myself failed with almost no traffic. I tried making games and they failed. Etc.\n\nI am bumping my head into the wall daily trying to find a way to make $10 from automation, and I cannot. And now ChatGPT is here my skill is down the trash, invaluable and insignificant.",
    "subreddit": "automation",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1745732767.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.650378125959109
  },
  {
    "score": 115,
    "title": "Saw someone venting on Reddit, ended up building them peace of mind",
    "selftext": "\nThey ran a small but growing service business and mentioned it in a thread how much they hated writing weekly update emails.\n\nEvery Friday was the same routine: scroll through Slack, Jira, and Notion trying to piece together what happened, then write a summary and send it to the team.\nNobody liked doing it, so it kept getting pushed.\n\nI offered to help and built a quick flow in Make.\n\nIt pulls updates from all three tools, summarizes them, and sends out a clean, consistent weekly digest.\n\nAlso threw in some inbox triage, auto-label the junk, archive the noise, and flag the real stuff.\n\nTook maybe an hour. Now the updates just… show up. And their inbox? Way less chaotic.\n\nThey messaged me later saying it felt like “a weight lifted.”\nAll from a few simple modules.\n\nIt’s wild how small automations can create real peace of mind.\nGrateful for random Reddit connections and the internet in general :)\n",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 115,
    "downs": 0,
    "created_utc": 1747166865.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5306569881763967
  },
  {
    "score": 113,
    "title": "The \"AI Agent\" fatigue is real. Can we talk about actual engineering?",
    "selftext": "Am I the only one who looks at these \"Zero-Code AI Agent\" demos and just sees a maintenance nightmare waiting to happen?\n\nI've been in this game for 20 years. Real automation..... the kind that keeps lights on and payroll running ..is boring. It is deterministic. It is `if X then Y`, every single time, forever.​\n\nThe current wave of \"AI Automation\" feels like we are replacing solid logic with probability engines. Sure, your LLM chain worked for the demo video. But put that in a production environment processing 10k transactions a day. When it hallucinates a step or fails because an API response was slightly different, who is fixing it? You. At 3 AM.​\n\nWe are confusing \"generation\" with \"automation\". Generating a generic email is easy. Automating a complex reconciliation workflow without human-in-the-loop is an entirely different beast.\n\nAre any of you actually running these \"autonomous agents\" in mission-critical loops, or is this just a LinkedIn echo chamber?",
    "subreddit": "automation",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 113,
    "downs": 0,
    "created_utc": 1766024745.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.664176819107407
  },
  {
    "score": 114,
    "title": "Stop paying $20 a month for n8n. Self host it in minutes",
    "selftext": "Here is a simple, step-by-step guide I use. Not an ad (You can use Docker, Hostinger, or any other service).\n\n1. Go to Railway and sign in with GitHub\n2. Go to New Project\n3. Choose Deploy from Template\n4. Search for n8n and pick the template with Postgres\n5. Deploy\n6. Wait a few minutes while it builds your services\n7. Open the personal URL that Railway gives you\n8. Create your n8n account, and you are done",
    "subreddit": "automation",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1756057533.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.440803461209415
  },
  {
    "score": 116,
    "title": "Best web scraping tools I’ve tried (and what I learned from each)",
    "selftext": "I’ve gone through quite a few tools over the past couple of years while scraping for side projects and client work. Each one has its place, but also a few trade-offs:\n\n1. Selenium: Simple to get started with, but felt clunky once projects grew bigger.\n\n2. Scrapy: Super fast on static sites, though adding support for dynamic content took extra work.\n\n3. Apify: Solid infrastructure and prebuilt actors, but heavier than I needed for smaller jobs.\n\n4. Browserless: Clean for headless sessions, but I hit reliability bumps under higher load.\n\n5. Playwright: Great for structured automation and testing, though a bit code-heavy for lightweight scraping.\n\n6. Hyperbrowser: The one I’m using most now. It’s been steadier on long runs and handles messy sites more gracefully, so I spend less time patching scripts and more time working with the data.\n\nThat’s my stack so far. What tools are you finding actually hold up once you move beyond the demo phase?\n",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 116,
    "downs": 0,
    "created_utc": 1757451319.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7829271978212455
  },
  {
    "score": 116,
    "title": "I build AI agents that work 24/7 — Ask Me Anything (n8n + OpenAI + Automation)",
    "selftext": "Hey everyone 👋\nI’ve been diving deep into building AI-powered agents and automation systems using n8n, OpenAI, APIs, and no-code tools, and the results have been insane lately.\nImagine:\n\t•\tAn agent that pre-qualifies leads and DMs your sales team\n\t•\tA chatbot that handles client onboarding 10x faster\n\t•\tA data-cleaning automation that runs daily while you sleep\nThat’s the kind of stuff I’ve been building — especially for solopreneurs and small teams.\n🧰I mainly use:\n\t•\tn8n (for logic &amp; flow)\n\t•\tOpenAI (for conversation, decision-making)\n\t•\tTelegram / Airtable / CRMs (for delivery &amp; UI)\n\nI’m new to Reddit but looking to share real value, systems, and strategies I’m using.\nWould love to connect with other builders, founders, or anyone looking to bring AI agents into their business.\n👇 AMA  I’m here to share, swap ideas, or even help troubleshoot your current workflow!\n\n#nocode #automation #AIagents #OpenAI #n8n #smallbiz #productivity #entrepreneur",
    "subreddit": "automation",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 116,
    "downs": 0,
    "created_utc": 1748635499.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6643521099617957
  },
  {
    "score": 110,
    "title": "Anyone Having Success with an AI Automation Business?",
    "selftext": "Hey everyone,\n\nI’ve been thinking about starting an AI automation business, but I’m not sure if the opportunity is as big as some make it seem.\n\nFor context, I’m a software developer and run a software implementation business focused on CRMs, ERPs, and process automation. Naturally, AI feels like the next big thing, but from what I’ve seen, most AI automation tools today seem to focus on small-scale tasks—lead generation, customer support chatbots, simple workflow automations, etc.\n\nThe thing is, these solutions don’t seem to attract high-ticket clients (at least not yet). Meanwhile, a lot of the people hyping AI on YouTube are just selling expensive courses rather than actually running profitable AI businesses.\n\nHas anyone here built a successful AI automation business? What use cases have actually brought in serious money? Is there a real demand for AI automation beyond just chatbots and cold email tools?\n\nWould love to hear real experiences from people in the space!",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 110,
    "downs": 0,
    "created_utc": 1740159499.0,
    "media": null,
    "is_video": false,
    "num_comments": 218,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9505450362067167
  },
  {
    "score": 111,
    "title": "Built a full real estate automation system for $500/month",
    "selftext": "I recently built a full workflow automation system for a real estate brokerage using n8n, GPT-4, Airtable, Twilio, and DocuSign — everything from lead capture to contract generation is now automated.\n\nIt cost the client $500/month and handles:\n\t•\tLead intake from website/chat/ads\n\t•\tAI lead scoring and agent assignment\n\t•\tTour scheduling + feedback\n\t•\tAuto-generated contracts via GPT\n\t•\tSlack alerts, CRM updates, and more",
    "subreddit": "automation",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1751766838.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4698988695873174
  },
  {
    "score": 108,
    "title": "I built an automation that writes, designs and posts social content from a Google Sheet in under two minutes",
    "selftext": "I built this automation to help clients stop wasting time writing captions, looking for images or designing them in Canva, and manually posting across multiple social platforms. This solution takes care of all of that, from content creation to publishing in under two minutes.\n\n**What it does:**  \nThis system turns a single row in Google Sheets into a fully published post:\n\n* Generates a caption using OpenAI\n* Creates a matching image using DALL·E  or any tool like Midjourney or Ideogram\n* Uploads the image to Cloudinary\n* Writes everything back into the same sheet\n* Sends a Slack notification for approval\n* Publishes automatically via Buffer after approval\n\nI call it Prompt-to-Post. It’s built for anyone who wants to post consistently on social media without hiring a full-time content person\n\n**Stack:** [Make.com](http://Make.com), OpenAI, Google Sheets, Cloudinary, Buffer.  (Image generation is modular — you can use DALL·E, Midjourney, Ideogram, etc.)\n\n[Demo video here](https://www.youtube.com/watch?v=0tWdDI-lhA0&amp;feature=youtu.be) if you want to see it run in real time.",
    "subreddit": "automation",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 108,
    "downs": 0,
    "created_utc": 1750350435.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5156659564617514
  },
  {
    "score": 103,
    "title": "Spending more time debugging automations than working on them",
    "selftext": "I'm trying to automate form filling in an accounting desktop app, but it’s been brutal. My automations constantly break whenever the app changes slightly or throws an error dialog.\n\nFeels like I’m spending more time debugging the automation than doing the actual work.\n\nCurious if other devs have faced this. Any tools or strategies that actually handle these apps better?\n\nEdit: Nvm guys, just tried Cyberdesk and it completely fixed the issue.",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 103,
    "downs": 0,
    "created_utc": 1757127029.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.430744679709883
  },
  {
    "score": 100,
    "title": "How I Used N8n, Google Maps API, and Anymail Finder to Go From 15 Leads in 3 Hours to 100 Leads in 15 Minutes",
    "selftext": "Picture this: It's 2 AM, I'm hunched over my laptop for the fourth consecutive night, manually copy-pasting business information from Google searches into spreadsheets. My eyes are burning, my back is screaming, and I've managed to scrape together a whopping 15 leads after 3 hours of soul-crushing work.\n\nI was bootstrapping my business and couldn't justify spending more on ads beyond my tight budget. Hiring another VA? That monthly expense made my wallet weep just thinking about it. But here I was, trying to scale my outbound campaigns for email marketing and VAPI AI qualifying calls, while drowning in the most mind-numbing manual work imaginable.\n\nThe worst part? I knew I was the bottleneck. Every hour I spent on data entry was an hour I wasn't spending on actually growing the business. Something had to change.\n\n**The Lightbulb Moment**\n\nOne particularly frustrating evening, after accidentally deleting an hour's worth of lead research (don't ask), I had an epiphany. Why was I doing what computers do best? I'm supposed to be the strategic thinker here, not the human copy-paste machine!\n\nI started sketching out what my ideal workflow would look like:\n\n1. I input my target criteria (industry, location, business type)\n2. Magic happens ✨\n3. A perfectly formatted spreadsheet appears with verified leads and decision-maker emails\n4. I import them into my CRM and start outbounding\n\nThe \"magic\" part was where automation would come in. I needed a system that could:\n\n* Search for businesses matching my ICP (Ideal Customer Profile) in specific cities\n* Extract their basic information and domains\n* Find the decision-maker emails for each business\n* Organize everything in a clean, CRM-ready format\n\n**The Solution: My Lead Generation Automation Machine**\n\nAfter some research and a few late-night coding sessions, I built what I now call my \"Lead Generation Automation Machine\" using n8n. Here's how it works:\n\n**The Stack:**\n\n* **n8n** \\- The automation backbone that orchestrates everything\n* **Google Maps &amp; Places API** \\- For finding businesses that match my criteria\n* **JavaScript** \\- For data processing and cleaning\n* **Anymail Finder API** \\- For extracting decision-maker emails from domains\n* **Google Sheets** \\- For storing and organizing the final lead list\n\n**The Workflow:**\n\n1. **Search Phase**: I input a search query (like \"digital marketing agencies in Austin, TX\") and the system uses Google Places API to find matching businesses\n2. **Data Processing**: JavaScript cleans and structures the business information, extracting key details like name, address, phone, and most importantly - the domain\n3. **Email Discovery**: For each domain, Anymail Finder API works its magic to find decision-maker emails (CEOs, founders, marketing directors, etc.)\n4. **Organization**: Everything gets neatly organized in Google Sheets, ready for import into my CRM\n\n**The Results:**\n\n* **Before**: 3-4 hours to manually research 15 leads\n* **After**: 15 minutes to automatically generate 100  leads with emails\n* **ROI**: My sanity restored, plus 500%+ increase in lead generation speed\n\n**The Technical Breakdown**\n\n# Tools Used:\n\n* **n8n**: Free, self-hosted automation platform (way better than Zapier for complex workflows)\n* **Google Maps/Places API**: \\~$2-5 per 1000 searches\n* **Anymail Finder API**: \\~$0.10 per successful email found\n* **Google Sheets**: Free storage and organization\n* **JavaScript**: Built-in n8n functionality for data processing\n\n# The Step-by-Step Process:\n\n1. **Trigger**: Manual trigger in n8n with search parameters\n2. **Google Maps Search**: Query businesses by location and type\n3. **Loop Through Results**: Process each business found\n4. **Extract Domain**: Clean and validate business websites\n5. **Find Decision-Maker Emails**: Query Anymail Finder for each domain\n6. **Data Cleaning**: Format and structure all information\n7. **Sheet Population**: Add qualified leads to Google Sheets\n8. **CRM Import**: Export to GoHighLevel for outbound campaigns\n\n# Pro Tips:\n\n* Set up rate limiting to avoid API throttling\n* Use conditional logic to skip businesses without websites\n* Create templates for different ICPs to speed up searches\n* Add data validation to catch formatting errors\n\n# The Game-Changing Impact\n\nThis automation didn't just save me time—it transformed my entire business approach. Instead of being stuck in the weeds of manual research, I can now focus on:\n\n* Crafting better email sequences\n* Optimizing my VAPI AI scripts\n* Actually talking to prospects\n* Growing the business strategically\n\nThe cost? About $10-15 per 100 leads (mostly API costs). The time saved? Priceless.\n\nIf you're drowning in manual lead research like I was, I can't recommend diving into automation enough. n8n might seem intimidating at first, but the learning curve is so worth it. Your future self will thank you when you're generating leads while sleeping instead of burning the midnight oil with spreadsheets.\n\n# Questions?\n\nHappy to share more details about the specific n8n workflow or help troubleshoot if anyone wants to build something similar. The automation community has been incredibly helpful in my journey—time to pay it forward!",
    "subreddit": "automation",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 100,
    "downs": 0,
    "created_utc": 1752339023.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5319194137968997
  },
  {
    "score": 99,
    "title": "Read This if You Want to Sell AI Automation Workflows",
    "selftext": "**Here’s a breakdown of what I wish I knew earlier, starting an AI Agency, especially focused on 2025 and beyond:**\n\nAI automation and agents are expected to grow from $6B → $234B in market size.  \nAlmost every business will need automation help, but most have no idea where to start.  \nIf you can position yourself as a problem-solver with simple tools (like n8n), the opportunity is massive.\n\nThis, you already know. However, this is the juicy part\n\n# Inbound vs Outbound lead generation - the only two ways to get clients and their differences:\n\nOutbound (fast, but effort-heavy):\n\n* **Upwork:** The fastest way to get paid. Clients are warm and ready, but the competition is crazy intense. Good for first wins.\n* **Networking:** High conversion, low cost, but slower to scale.\n* **Cold Email/Calls:** Scalable and free, but low conversion and slow to start.\n\nInbound (long-term, compounding) - this is where you can build a sustainable business:\n\n* **YouTube / Twitter / Reddit / SEO**: Build trust, show your knowledge, and let clients come to you.\n\nBecause at some point, your content and efforts generate inbound traffic. \n\n**Where Clients Are (And How Warm They Are) - Total overview**\n\nThis table shows you the difference between platforms and the ease of sales.\n\n|Channel|Speed|Cost|Warmth|Notes|\n|:-|:-|:-|:-|:-|\n|Upwork|Fast|💵 Costs|🔥🔥🔥|Great for early traction **(Low Pay)**|\n|Reddit|Medium|Free|🔥🔥|Find real problems → pitch solution **(Medium Pay)**|\n|LinkedIn|Slow|Free|🔥|Inbound + DMs if done right **(High Pay)**|\n|Email/Cold Calls|Slow|Free|❄️|Works, but takes volume. **(High Pay)**|\n|YouTube/Twitter|Slow|Free|🔥🔥|Long-term audience building **(Medium Pay)**|\n\n**Freelancer vs Brand/Agency**\n\nThere's a big difference between these two. At some point, you’ll hit a ceiling as a solo expert.  \n  \nIt's totally fine to just be the expert, but building a brand and or agency is where the scaling can happen. Businesses looking to spend $5k–$10k+ want to work with:\n\n* Agencies with systems\n* Teams they can trust\n* Solutions, not “just a person with a tool”\n\nI realized that **branding**, a website, and clear positioning helped me land bigger clients with less grind. Yet it takes time and trust to get there. \n\nIf you’re just starting:\n\n* Focus on solving business problems, not just offering “automations”\n* Think long-term: inbound systems will save you years of grind in the future\n* Brand yourself or build a lean agency to land bigger clients\n* Consider which platform to use and have the right expectations \n\nIf you're building in this space and want help transitioning from freelancer to Agency founder I'd love to help. These insights comes from years being a freelancers online and helping businesses with various services, no I have my own AI Agency.  \n\nWant more insights, [feel free to check this video out](https://www.youtube.com/watch?v=qIQ_VAbINZE&amp;t=199s)!",
    "subreddit": "automation",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1751648005.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.327724460689137
  },
  {
    "score": 98,
    "title": "Software for converting scanned PDF, images and docs to structured data like JSON, markdown, HTML",
    "selftext": "I recently built [DocStrange](https://docstrange.nanonets.com) , a free and open-source tool that converts PDFs, scanned documents and images into structured data (markdown, csv, html, json etc) with support for tables, fields, OCR etc.\n\nIt runs either locally or in the cloud (we offer 10k documents/month for free). Might be useful if you're building document automation, archiving, or data extraction workflows.\n\nWould love any feedback, suggestions, or ideas for edge cases you think I should support next!\n\nLive: [https://docstrange.nanonets.com](https://docstrange.nanonets.com)  \nGithub: [https://github.com/NanoNets/docstrange](https://github.com/NanoNets/docstrange)",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1758881543.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3533596552866864
  },
  {
    "score": 103,
    "title": "What AI workflows actually help your daily work, the ones you can't live without?",
    "selftext": "For those of us who love using AI tool combos to boost productivity, do you have workflows that genuinely became part of your everyday work/life? Not the flashy concepts that pop up online, the ones that stick and truly work.\n\nHere are a few combos I have been using recently and now consider essential:\n\n1. Gemini + Kuse for research, idea expansion, organization, and output\n\nWhen I am diving into a completely new area, I like to understand every detail of the topic, so Gemini's deep-research ability is definitely a lifesaver for me. And after I finish researching, I would import everything into a doc, and then upload all the source files, whether PDFs, videos, screenshots, whatever, into Kuse.\n\nTo me it feels like a more imaginative, more flexible version of NotebookLM. It helps me deeply read, organize, question, and transform all my raw materials into structured learning and outputs.\n\n2. Lovable + Cursor for landing pages and portfolio websites\n\nThis combo saved me an unbelievable amount of time (and money). I usually find a template or style I love on Lovable and let it generate the structure and CSS/UI I need. Then I throw the whole codebase into Cursor for refinement. Trust me! This saves you so much energy compared to fighting with Cursor alone to get the UI/design right.\n\nHow about you? What AI tools have actually worked for you so far? And which ones are you planning to keep using or explore more in 2025?",
    "subreddit": "automation",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 103,
    "downs": 0,
    "created_utc": 1763433904.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5991712740991746
  },
  {
    "score": 99,
    "title": "I Tried 6 PDF Extraction Tools—Here’s What I Learned",
    "selftext": "I’ve had my fair share of frustration trying to pull data from PDFs—whether it’s scraping tables, grabbing text, or extracting specific fields from invoices. So, I tested six AI-powered tools to see which ones actually work best. Here’s what I found:\n\n1. Tabula – Best for tables. If your PDF has structured data, Tabula can extract it cleanly into CSV. The only catch? It struggles with scanned PDFs.\n\n2. [PDF.ai](http://PDF.ai) – Basically ChatGPT for PDFs. You upload a document and can ask it questions about the content, which is a lifesaver for contracts, research papers, or long reports.\n\n3. Parseur – If you need to extract the same type of data from PDFs repeatedly (like invoices or receipts), Parseur automates the whole process and sends the data to Google Sheets or a database.\n\n4. Blackbox AI – Great at technical documentations and better at extracting from scanned documents, API guides, and research papers. It cleans up extracted data extremely well too making copying and reformatting code snippets ways easier.\n\n5. Adobe Acrobat AI Features – Solid OCR (Optical Character Recognition) for scanned documents. Not the most advanced AI, but it’s reliable for pulling text from images or scanned contracts.\n\n6. Docparser – Best for business workflows. It extracts structured data and integrates well with automation tools like Zapier, which is useful if you’re processing bulk PDFs regularly.\n\nHonestly, I was surprised by how much AI has improved PDF extraction. Anyone else using AI for this? What’s your go-to tool?",
    "subreddit": "automation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1743538238.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.768713248970312
  },
  {
    "score": 98,
    "title": "I automated a website's blog on full autopilot. Here are the results",
    "selftext": "So I wanted to try a fully automated content system for ranking on Google that does the following:\n\n1. Analyzes the website and finds keyword gaps competitors missed\n2. Generates optimized articles with images\n3. Publishes directly to the CMS on autopilot\n\nI set it to post once per day to avoid spam detection, then let it run.\n\nI've been running this for the past 3 months. Here are the results:\n\n* 3 clicks/day → 450+ clicks/day\n* 407K total impressions\n* Average Google position: 7.1\n* 1 article took off and now drives \\~20% of all traffic\n* Manual work was limited to occasionally tweaking headlines before publish (maybe 10 min/week)\n\nhttps://preview.redd.it/p778odb5ga3g1.png?width=2048&amp;format=png&amp;auto=webp&amp;s=cd8e1bdf647e0a34a26ea6420982be9b25a04f95\n\nBiggest surprise: Google didn't penalize it. As long as the content was actually helpful and not keyword-stuffed garbage, it ranked fine.\n\nPretty fun experiment :)",
    "subreddit": "automation",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1764026449.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8046974937747806
  },
  {
    "score": 100,
    "title": "I Built an AI Automation that Got 4 Million Impressions on Reddit",
    "selftext": "I recently built what was probably my most interesting campaign for a client. Essentially, we built an AI automation that repurposed their YouTube content for channels like Reddit, FB Groups, etc…\n\nThe results were great.\n\n* 4 million impressions in a month\n* Thousands of website visitors\n* A few hundred new subscriptions\n* 70K avg impressions per post\n* Cost less than $100/mo to run\n\nHere’s how we did it.\n\n**The Campaign Structure**\n\nOur goal was to create a lot of content for specific subreddits using AI. We leveraged the client's existing YouTube videos as source material for the AI prompts. The idea was to create specific writing guides for each subreddit, take transcripts from the YouTube video, and prompts with specifics about the content format, then put those together into a prompt that generated the content drafts.\n\n**Step 1: Made a big list of all the potential channels**\n\nThe first step in building this campaign was figuring out what the right subreddits were for us to use. We looked for relevance to our product, size of the community, and whether the kind of content we could produced performed well there. We narrowed down a list of 40 subreddits to the top 5 based on performance.\n\n**Step 2: Creating a Content Strategy for Each Subreddit**\n\nEach subreddit had its own content strategy that matched what performed well on that subreddit. We researched what content performs best on each channel, identified key formats and styles, and created templates for our AI prompts.\n\n**Step 3: Crafting the Prompt Structure**\n\nThe prompt structure was crucial in this campaign. We used a multi-page long prompt with four parts:\n\n1. Instructions (The contained the post type - ex: “Short Discussion Opener”, “How to Case Study”)\n2. Examples of similar content (High performing posts we collected for the channel)\n3. Channel guides (specific to each subreddit)\n4. Source material (YouTube transcripts)\n\nProbably something like 2,000 words inputted in the prompt for every 500 words of output.\n\n**Step 4: Generating Content**\n\nWe used AI to generate content based on our prompts. The AI was good at working with existing content, so we fed it a lot of source material and let it do its magic.\n\n**Step 5: Editing and Revising**\n\nWhile the AI did a great job of generating content, it wasn't perfect. We had a human editor review and revise each piece to ensure it met our standards.\n\n**Step 6: Leaving Breadcrumbs**\n\nTo drive traffic back to our client's website, we left breadcrumbs in the content. This was as simple as including charts or images from their software that were relevant to the topic.\n\n**Results**\n\nThe campaign worked pretty much as soon as we launched it. But there was a lot of room for improvement too.\n\nHere’s basically the Pros and Cons\n\nPros:\n\n* The AI brought the cost of content creation down by like 80-90%. With me editing drafts all day we were able to publish 12 posts per day. (seriously just me).\n* Every post was uniquely written for each channel. This was huge because we were able to really capture the nuance and culture of each subreddit, or facebook group, or X community etc…\n* We got a lot of data. Because we were getting out a lot of posts, we could see what audiences were better, what kinds of posts were better, what topics were the best, etc…\n\nCons:\n\n* We were instantly limited by how much content I could edit in a day. The AI output was not good enough to publish right away. So I had to get in there and edit it all. I think overtime I’ll be able to improve the outputs, or maybe just improve the process for editing.\n* Analytics had to be collected manually. And it was kind of sparse. Reddit has impressions and upvote data, the social media platforms have engagement (and sometimes impressions). But I went back every few days and collected the data. We had a lot, but this process sucked. Also results were not easily attributable. Had to do a lot of deductive reasoning.\n\n**Conclusion**\n\nBuilding this campaign was a lot of effort at the beginning. Built out different databases for the Assets and the automatons that ran all the prompts. But once it was built out things moved at a pretty fast pace.\n\nIt’s a success in my book and I’d do it again. Felt like it was a big learning experience in Earned Media and how that’s changing as well as obviously AI.\n\nHappy to answer any questions.",
    "subreddit": "automation",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 100,
    "downs": 0,
    "created_utc": 1742243847.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.45592223581614
  },
  {
    "score": 100,
    "title": "You have one year to master automation: what do you focus on?",
    "selftext": "Social media is full of gurus promoting N8N, make, zapier, etc. for building AI automations. \n\n  \nOf course, they are powerful. \n\nBut I am looking to hear from a few seasoned veterans here on what their roadmap would be if they had to start from scratch and only had 1 year to master their technical automation skills - what would you do? \n\nFor context: I am getting serious about automation / AI and would like to establish the best path to learn and build my capabilities. \n\n  \nThank you! ",
    "subreddit": "automation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 100,
    "downs": 0,
    "created_utc": 1754842937.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.616459308583037
  },
  {
    "score": 95,
    "title": "How I find goldmine automation opportunities with 0 access to my targeted audience",
    "selftext": "3 months ago I was starting my AI agency from nothing and had to land at least 3 clients in 10 days to pay the costs of devs, virtual assistants, (and my mortgage).\n\nI had to QUICKLY find high value problems that automations could solve without having any access to a company.\n\nHere’s how I did it with Reddit &amp; Glassdoor.  \n\\---\n\n# 1. Reddit = Public Friction Logs\n\nBrowse subreddits like:\n\n* **sysadmin, freelance, startups, techsupport, consulting** (or more specific subreddits for your niche)\n\nSearch for patterns in posts like:\n\n* “This job sucks because…”\n* “Every week I have to…”\n* “Client keeps asking for…”\n\n**Then, do this:**\n\n* *Grab 10 posts, dump them into GPT-4 with this prompt:*\n\n&gt;Act as an AI workflow strategist disguised as a reddit community manager. Your job is to extract real-world inefficiencies hidden behind emotional phrasing, slang, and half formed posts. From these reddit posts, extract 3 repetitive inefficient workflows that could be improved with AI agents or automation. Be specific. \n\n\\---\n\n# 2. Glassdoor = Workflow Whistleblowers\n\nGo to a company in your niche then → sort reviews by lowest rated.\n\nI guarantee if you do this for three companies you'll find hidden automation gold in **ops-heavy roles**:\n\n&gt;\"we have to manually enter data into 3 different systems.\"  \n\"still emailing excel reports every week.\"  \n\"tons of burnout from repetitive....\"\n\nGrab 5–10 reviews (the more the better) and add them in GPT with this prompt:\n\n&gt;Act as a McKinsey operations consultant turned AI agent systems designer. You specialize in identifying internal bottlenecks using secondhand data. You read between the lines of anonymous reviews to spot workflow duplication and operational redundancy. For each pain point you find, suggest a lightweight automation layer or AI agent that could plug in with minimal resistance.\n\nYou just did stealth consulting.\n\n\\---\n\n  \nAt first, I was doing all this research manually fr - scanning Reddit threads, Glassdoor reviews, &amp; LinkedIn comment sections to find stuff. It worked, but it became time consuming af. \n\nSo I figured I might as well build an AI agent to do it for me 🤷🏾‍♂️\n\nIt takes links to:\n\n* Subreddits\n* Glassdoor pages\n* LinkedIn posts\n* Job descriptions\n\nThen it:\n\n* Scrapes and cleans the content\n* Uses GPT to extract **inefficient workflows**, **manual processes**, and **repeated complaints**\n* Rates each issue by **pain level (1–10)**\n* Suggests a custom AI agent or automation that could solve it\n\nI'm all about finding hacks (the username) &amp; this one legit saved me...\n\nI've been helping a few people build their own automations too so if that interests you lmk!",
    "subreddit": "automation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1748293824.0,
    "media": null,
    "is_video": false,
    "num_comments": 61,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.628467077788695
  },
  {
    "score": 96,
    "title": "How I turned a boring task into a 5-minute automation",
    "selftext": "Every new video upload used to come with hours of typing, editing, and re-checking transcripts. \n\nIt felt like I was spending more time fixing details than actually creating content.\n\nSo I automated the whole thing. My **n8n workflow** now:\n\n* Pulls YouTube videos directly\n* Runs transcription through OpenAI\n* Auto-generates **timestamps and transcripts**\n* Works reliably without extra tools or logins\n\nI put together a full tutorial here: [https://youtu.be/C3oakGaQfzE](https://youtu.be/C3oakGaQfzE)\n\nIf you’re also into no-code or automation, I’d love to hear how you’re saving time. \n\nShare your setup in the comments, or ask me anything about this workflow.",
    "subreddit": "automation",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1755584715.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1838929889859076
  },
  {
    "score": 96,
    "title": "The BEST automation systems use the LEAST amount of AI (and are NOT built with no-code)",
    "selftext": "We run an agency that develops agentic systems.\n\nAs many others, we initially fell into the hype of building enormous n8n workflows that had agents everywhere and were supposed to solve a problem.\n\nThe reality is that these workflows are cool to show on social media but no one is using them in real systems.\n\nWhy? Because they are not predictable, it’s almost impossible to modify the workflow logic without being sure that nothing will break. And once something does happen, it’s extremely painful to determine why the system behaved that way in the past and to fix it.\n\nWe have been using a principle in our projects for some time now, and it has been a critical factor in guaranteeing their success:\n\n**Use DETERMINISTIC CODE for every possible task. Only delegate to AI what deterministic code cannot do.**\n\nThis is the secret to building systems that are 100% reliable.\n\nHow to achieve this?\n\n1. Stop using no-code platforms like n8n, Make, and Zapier.\n2. Learn Python and leverage its extensive ecosystem of battle-tested libraries/frameworks.\n   * Need a webhook? Use Fast API to spin up a server\n   * Need a way to handle multiple requests concurrently while ensuring they aren’t mixed up? Use Celery to decouple the webhook that receives requests from the heavy task processing\n3. Build the core workflow logic in code and **write unit tests for it**. This lets you safely change the logic later (e.g., add a new status or handle an edge case that wasn’t in the original design) while staying confident the system still behaves as expected. Forget about manually testing again all the functionality that one day was already working.\n   * Bonus tip: if you want to go to the next level, build the code using test-driven development.\n4. Use AI agents only for tasks that can’t be reliably handled with code. For example: extracting information from text, generating human-like replies or triggering non-critical flows that require reasoning that code alone can’t replicate.\n\nHere’s a real example:\n\nAn SMS booking automation currently running in production that is 100% reliable.\n\n1. *Incoming SMS:* The front door. A customer sends a text.\n2. *The Queue System (Celery):* Before any processing, the request enters a queue. This is the key to scalability. It isolates the task, allowing the system to handle hundreds of simultaneous conversations without crashing or mixing up information.\n3. *AI Agent 1 &amp; 2 (The Language Specialists)*: We use AI for ONE specific job: understanding. One agent filters spam, another reads the conversation to extract key info (name, date, service requested, etc.). They only understand, they don't act.\n4. *Static Code* (The Business Engine): This is where the robustness comes from. It’s not AI. It's deterministic code that takes the extracted info and securely creates or updates the booking in the database. It follows business rules 100% of the time.\n5. *AI Agent 3 (The Communicator)*: Once the reliable code has done its job, a final AI is used to craft a human-like reply. This agent can escalate the request to a human when it does not know how to reply.\n\nIf you'd like to learn more about how to create and run these systems. I’ve created a full [video tutorial](https://youtu.be/nlny25W3Oek) covering this SMS automation and made the code open-source.",
    "subreddit": "automation",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1755019755.0,
    "media": {
      "type": "youtube.com",
      "oembed": {
        "provider_url": "https://www.youtube.com/",
        "version": "1.0",
        "title": "Build a Bulletproof AI SMS Booking System (Why No-Code Tools Fail)",
        "type": "video",
        "thumbnail_width": 480,
        "height": 200,
        "width": 356,
        "html": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/nlny25W3Oek?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Build a Bulletproof AI SMS Booking System (Why No-Code Tools Fail)\"&gt;&lt;/iframe&gt;",
        "author_name": "Dani Fuyà",
        "provider_name": "YouTube",
        "thumbnail_url": "https://i.ytimg.com/vi/nlny25W3Oek/hqdefault.jpg",
        "thumbnail_height": 360,
        "author_url": "https://www.youtube.com/@dani_fuya"
      }
    },
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.407970733215723
  },
  {
    "score": 95,
    "title": "What’s the smartest thing you’ve automated lately? I want to learn from you!",
    "selftext": "Hey everyone,\n\nI’m doing some market research for a new AI workflow project I’m working on. I'm a student so anything helps!\n\nI’d love to learn more about what you do:\n\n* What tasks or workflows have you automated that save you the most time or headaches?\n* What tools or platforms do you swear by?\n   * what do you love/hate about them?\n\nI’m super curious to hear real examples from this community. It’ll really help me understand what people actually *need* (and maybe spark a few ideas too).\n\nBig thanks in advance for sharing your automations, wins, rants — anything goes!",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1750268185.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6970125691146523
  },
  {
    "score": 95,
    "title": "I'm trying to automate an entire AI company. 60% done, getting exponentially harder. Is this even possible?\"",
    "selftext": "So I'm 17 and I've been building AI automation systems for a few months. Started with basic workflows, now I'm deep in something that might be insane.\n\nThe goal: Automate a full AI infrastructure company. Not like \"automate customer support\" - I mean **everything**.\n\nWhat's already running:\n\n* Sales teams that research leads, scrape data, build personas, and handle my clients \n* Content systems cranking out newsletters, social posts, podcast scripts at scale\n* Multiple RAG systems with metadata and vector stores handling different knowledge domains\n* currently 122 specialized agents with dedicated software functions or just regular n8n agents\n* Multi-contextual agentic systems (agents that understand business context across departments)\n* Several MCPs orchestrating agent-to-agent communication\n* Every automation step generates training data for the next iteration\n* n8n infrastructure team. that basicly does my job. and a fullstack developer for creating app around workflows.\n\nBasically: systems that build systems that train systems.\n\n**The last 40% is breaking my brain.** Once you have 122 agents that need to coordinate, everything gets exponentially complex: but i need to scale it to 280-300 agents or systems.\n\n* Sales agent needs context from content systems\n* Content systems need data from sales conversations\n* Research agents need to feed multiple departments\n* Decision-making needs to happen across disconnected workflows\n* Agents stepping on each other / duplicate work\n* Context windows maxing out\n* State management across sessions\n* Training loops creating feedback without human validation\n\nIt's not that any single piece is impossible. It's that coordinating **autonomous intelligence at scale** is a fundamentally different problem than building individual automations.\n\nLike the difference between building a car and building traffic infrastructure for a city.\n\n**My actual question:** Do you think it's possible to fully automate an AI infrastructure company? Not theoretically - I mean in practice, with current tech.\n\nWhere's the ceiling? Is 80% realistic? 95%? Or is there a fundamental limit where human decision-making becomes mandatory?\n\nEither I'm building something genuinely new or I'm about to learn why nobody else has done this.\n\nFigured Reddit would have opinions.",
    "subreddit": "automation",
    "upvote_ratio": 0.77,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1759847930.0,
    "media": null,
    "is_video": false,
    "num_comments": 180,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.688610520474161
  },
  {
    "score": 95,
    "title": "I Turned my idle n8n Workflow Into a Monetizable SaaS App (Here's How in Simple Steps)",
    "selftext": "I’ve been building in the AI automation space for a while using **n8n,** and recently started exploring how to turn my workflows into **full apps** that people can use and pay for.\n\nSo I tried something new:  \nCombined **n8n** (for backend logic)  \n**Lovable** (for front-end UI built by prompt)  \nIntegrated **Stripe**  \n📼 And used Third-party **API** tool for core functionality.\n\nIt uses Webhooks from n8n together with Edge Functions on Supabase and Lovable. \n\n🚀 Result? I now have a **live public app** called **Viral Video Clipper**:   \n  \n– Anyone can paste a YouTube URL  \n– Choose how many clips they want  \n– App triggers the n8n workflow via webhook  \n– AI clips the video + adds captions  \n– Stripe payment system charges per render\n\nNo code. Just smart prompts, webhooks, and AI. This creates crazy possibilities for AI automation builders like you with new ways to monetize!\n\nWhy this is gamechanging:\n\n* It turns **your idle automations** into **scalable public tools and SaaS apps.** \n* It creates a **new revenue model** for builders like you: not client work or labour → but mini-products that can scale. \n* It’s beginner-friendly: if you know webhooks + workflows, you're ready\n\n📺 I made a full video showing:  \n  \n– The live app I built  \n– How the frontend/backend talk  \n– How I handle webhook responses and updates  \n– How to monetize it  \n– And how YOU can build your own in under a week. \n\n👉 [Link to Full Video Tutorial here](https://youtu.be/QFndH6fMARc?si=yKf8mtNp53X_JTrk) \\- By the end of it you know how to it for your own workflows. \n\nIf you want a breakdown Notion doc or template version, I might turn that into a free download too.\n\nCurious what you guys think of this! Did you know about this before? Now you can go from automation builder with 100s of automation laying idle to a SaaS founder, all costing yo prob under $50 — Lovable + n8n is the thing.   \n  \nHope you liked this post and Idea. If you want to try the AI Auto Viral clipper, DM me. If you like this info and want to learn more, I have a community where I share even more exclusive alpha. \n\nNext steps for you? Build a front-end for your workflows!\n\n",
    "subreddit": "automation",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1751168983.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.333010691560696
  },
  {
    "score": 95,
    "title": "I'm offering free automation help – 5 years in the industry (Ask Me Anything)",
    "selftext": "Hey folks! \n\nI come from a non-tech background and have spent the last 5 years becoming a master of automation at various companies. \n\nFor the sheer love of exploring new use cases,\nI’m offering free automation help to the first 20 people who reach out. All you need to do is-\n\n1. describe what task you'd like to automate and\n2. share a quick video of you doing that task manually.\n\nI’ve worked with tools like Zapier, Make.com, n8n, and more, and I’d love to automate something for you- totally free.\n\nDrop a comment or DM me what you need help with!\n\nThanks!",
    "subreddit": "automation",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1745016058.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.561365246542669
  },
  {
    "score": 94,
    "title": "Created my  first automation (Whatsapp food ordering) with help of youtube",
    "selftext": "FLow :   \nGoogle sheets (Inventory, FAQs, Orders )  \nAgent(data from Inventory sheet for avilable food items) chats with user on whatsapp  and add orders to orders sheet   \n  \nChallenging Part :   \nIntegrating n8n and whatsapp was really challenging, because I dont have facebook account so,   \nI have created facebook account, for this we also need bussiness portfolio (it gave me lot of errors (unable to create account)) but at the end i was able to create bussiness portfolio and create APP Id and Access Token ... \n\nAnd the rest of the part went really smooth\n\n\n\nI looking for realtime automation Ideas :  \nIf you have any, please do share that would really help me\n\nIf you are bussiness owner and would like to automate any process like this, please DM ",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1757223191.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5026154035972525
  },
  {
    "score": 94,
    "title": "So you're struggling to sell AI automation?",
    "selftext": "Hey - I see a ton of people trying to sell automations or start an AI automation agency, but most aren’t making real money with it. The problem? They’re focusing too much on the tech and not enough on actually selling solutions.\n\nI’ve seen people with insane automation skills struggle to land clients, while others with basic setups are making 10k a month. It’s not about how good your automations are – it’s about how well you can position them as something businesses need.\n\nIf you’re struggling to sell AI automations, here’s what actually works:\n\n1) Pick a niche. If you’re selling “AI automation,” that’s too broad. Businesses pay for solutions, not vague tech. Something like “I help real estate agents follow up with leads automatically” is way easier to sell.\n\n2) Sell the result, not the tool. No one cares about AI workflows. They care about saving time, booking more calls, or making more money.\n\n3) Don’t build first, sell first. A lot of people spend weeks on complex automations and then realize no one wants them. Find a pain point first, then solve it.\n\n4) Make it easy to say yes. Free audits, a quick win for $500, or something that proves value upfront will get you through the door way faster than pitching a big $5k solution off the bat. Build trust and rapport.\n\nI put together a breakdown of real strategies that are working right now, plus a bunch of outreach templates that make it easier to land clients. It’s free, no catch – I just want more people to get this right instead of spinning their wheels.\n\nHere’s the Notion guide: [https://agentempire.notion.site/How-to-Sell-AI-Automations-Without-Struggling-Step-by-Step-Guide-1b083c64add9804599c3fe695810bf0a](https://agentempire.notion.site/How-to-Sell-AI-Automations-Without-Struggling-Step-by-Step-Guide-1b083c64add9804599c3fe695810bf0a)\n\nHappy to chat or answer questions here. What’s been the hardest part for you?",
    "subreddit": "automation",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1741450984.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.586817618791948
  },
  {
    "score": 91,
    "title": "Automation becoming harder than manual work?",
    "selftext": "I feel like automation crossed a weird line for me recently.  \nWhat used to be “save time” now feels like maintaining a fragile system I’m afraid to touch. One small change breaks three other things, logs don’t explain much, and suddenly the manual way feels faster again.  \nCurious if others hit this point too. Is this just bad automation design, or is complexity the tax you eventually pay no matter what?",
    "subreddit": "automation",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 91,
    "downs": 0,
    "created_utc": 1767630665.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.405257831681574
  },
  {
    "score": 89,
    "title": "My $2000 work was sold for $6000 a yar with $5000 retainer",
    "selftext": "A few months back, I did an AI content automation for an agency I charged $2000. Since it was an early gig of mine and he is a friendly client from Florida, now he is selling that automation for a pharma company, I was like Damn...\n\nedit: since the post got so many views, I decided to make a video about it, you can check it out on : [https://youtu.be/rOIi6d\\_8ErY?si=wm1yXKa3keeM8q8m](https://youtu.be/rOIi6d_8ErY?si=wm1yXKa3keeM8q8m)\n\nEdit: it's 60,000 a year not 6000 I made a typo",
    "subreddit": "automation",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1751522815.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5165144772102592
  },
  {
    "score": 85,
    "title": "I replaced Mailchimp/Instantly with an n8n automation (5K sends, replies in Gmail, free template)",
    "selftext": "**TL;DR**: I stopped paying hundreds per month for Mailchimp &amp; Instantly and built a self-hosted cold email system in n8n. \n\nIt sends personalized emails at scale via **Mailgun**, routes **replies back to Gmail**, handles follow-ups automatically, and costs me \\~$35/month for 50k sends. The full YouTube breakdown + the **free JSON template** are linked below (no paywall).\n\n# Why I built it:\n\nIn June, a founder hired me to find &amp; email angel investors &amp; VCs to raise money for his startup; a few weeks later I got him 4 booked calls and he closed **$400k+** (full story on my profile). \n\nHe immediately spread the word to his entire network. \n\nA month later, a software engineering-staffing firm asked for the same engine to reach Fortune 5000 companies. Rather than duplicating the Make automation, I decided to re-build it in N8N to make it more robust and able to handle more complex email sequences. \n\n# Here's what the automation does:\n\n* **Import prospects** from Notion: I use Apollo to get lead lists and as of last week, I **validate** the emails with ZeroBounce before any send.\n* ***Personalize****:* I'm using GPT-5 to personalize every single email based on the company's keywords, website, and the point of contact's LinkedIn profile. (This is my favorite step).\n* **Sending**: I'm using **Mailgun** for the email sending; I altered the DNS settings though so all the replies land in the **Gmail** inbox and not in Mailgun.\n* **Follow-ups**: If there's no reply, I have multiple sequences setup to schedule 2–3 follow-ups; auto-pausing the thread when a reply hits.\n* **Logging**: Every touchpoint is written to Notion so I can debug/iterate fast.\n\n# Deliverability &amp; warm-up (what people asked about last time)\n\n* **Warm-up**: I start tiny (25–50/day) &amp; increase gradually each week. I rotate multiple **subdomain mailboxes** (so if i'm sending from sirlifehacker@reddit - I send warmups from sir@reddit, life@reddit, and so on). Keep content short, varied, and human.\n* **Records**: Make sure to add CNAME for tracking if you need opens/clicks, leave **MX on Google** so replies skip Mailgun.\n* **List hygiene**: Validate your emails! Don't be lazy... use zerobounce or other similar services. I have a ton of credits if you want to send me your list.\n* ***Ethics***: I only target business emails and people that I KNOW I can add value to. I **never** do this with personal inboxes. This system is for thoughtful, hyper relevant &amp; personalized outreach... *not* spamming.\n\n# Grab it &amp; try it:\n\nThis subreddit doesn't allow links in posts but if you go to r/learnAIAgents, I posted the link to the N8N JSON template &amp; YouTube video walkthrough there\n\nHappy to answer any questions and help people set this up, I know cold email can be treacherous",
    "subreddit": "automation",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1754938536.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.282513449075558
  },
  {
    "score": 88,
    "title": "From someone deep in the n8n trenches — here’s the truth they won’t tell you 👇",
    "selftext": "Trust me when I say this: automation is a powerful, highly rewarding skill,but only if you take the time to truly master it.\nI’ve been working with n8n and automation systems for a while now, and one thing I can confidently say is: it’s not as simple as those online gurus make it sound.\nThis isn’t just a “n8n + ChatGPT = $$$” kind of deal.\nYou’re literally solving real business problems.\nYou’re handling people’s income sources.\nYou’re building systems that either make or break operations.\n\nThat means you need more than just technical skill. You need:\n\t•Logical thinking\n\t•Problem-solving ability\n\t•Collaboration\n\t•Emotional intelligence and people skills\n\nEven the learning curve of n8n is stronger than most people admit.\nIt’s not just “node + node = automation.” If that’s your mindset, you’ll burn out fast or build fragile systems.\nTake your time.\nGo one node at a time.\nOne workflow at a time.\nBe patient and meticulous. Be detail-oriented.\nFocus deeply on your clients’ pain points. Understand them better than they do.\nBecause here’s the truth:\nAs an automation builder, you’re not just a tech person. You’re also a consultant.\nAnd in many cases, especially early on, your consultation will be free,just to earn trust and build up experience.\nAnd that’s okay.\nDon’t obsess over what you’ll earn.\nObsession over income will only cloud your thinking.\nObsession over value creation.\nSolve real problems.\nThe money will follow,and so will the clients who actually respect your work.\nValue first. Everything else after.\nStay humble, stay sharp.\nYou got this. 👊\nSomeone who’s been in the automation game long enough to know what’s hype and what’s real.\nYou can add any advice thats not captured here as well , especially those that have also been in the automation trenches for a while now , let’s learn from one another . \n",
    "subreddit": "automation",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 88,
    "downs": 0,
    "created_utc": 1753579563.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4339240288200505
  },
  {
    "score": 42,
    "title": "I built an AI Voice Agent that can fully plan, design, and build websites (using ElevenLabs, Lovable.dev, Firecrawl, and Airtop)",
    "selftext": "I built a voice agent using ElevenLabs, Lovable, and Airtop then that lets me collaborate on designing and building websites. The ElevenLabs voice agent is the entry point into the whole system, and then it will pass off web development or web design requests over to n8n agents via a webhook in order to actually do the work. \n\nHere’s a demo of the agent in action: https://www.youtube.com/watch?v=ht0zdloIHfA\n\nIn all honesty, the ElevenLabs voice agent here is a bit overkill. But I wanted to see how this setup would work. Lovable doesn't actually have a publicly exposed API in order to start the process of building websites so I went forward using Airtop to control a remote browser so my agent could interact with the Lovable website.\n\n## Here's how the full system works\n\nAt a high level, I followed the agent-orchestrated pattern in order to build this. Instead of having just one single agent with potentially dozens of different tools it needs to connect to and be prompt about, there's kind of two different levels of agents.\n\n1. One is going to be the parent which receives the initial user message. All this agent has to do is decide what type of request is and then delegate that request off to one of its sub-agents.\n2. The only tools that this parent agent has are the sub-agent tools.\n\nAfter that's done, the subagents are going to be the ones who are specialized in tool usage under the type of work and needs to handle. In my case, the website planner has two tools for no scraping an existing website and writing a product requirements document, and then the lovable browser agent has access to all the tools needed to go out and connect to lovable and build a website.\n\nThe main benefit of this is more simplicity across your system prompts in your agents that you set up. The more tools you add in, the more cases that need to get handled and the larger the context window gets for the prompt. This is a way to simplify the amount of work and things that have to go right in each agent you're building. \n\n### 1. Voice Agent Entry Point\n\nThe entry point to this is the Eleven Labs voice agent that we have set up. This agent: \n\n- Handles all conversational back-and-forth interactions\n- Loads knowledge from knowledge bases or system prompts when needed\n- Processes user requests for website research or development\n- Proxies complex work requests to a webhook set up in n8n\n\nThis is actually totally optional, and so if you wanted to control the agent via just the n8n chat window, that's completely an option as well. \n\n### 2. Parent AI Agent (inside n8n)\n\nThis is where the agent orchestrated pattern comes into play. The system prompt I set up for this parent agent is actually pretty easy to build out. I just asked ChatGPT to write me a prompt to handle this, and then mentioned the two different tools that are going to be responsible for making a decision and passing requests on to. \n\n- The main n8n agent receives requests and decides which specialized sub-agent should handle the task\n- Instead of one agent with a ton of tool, there's a parent agent that routes + passed the user message through to focused sub-agents\n- Each sub-agent has a very specific role and limited set of tools to reduce complexity\n- It also uses a memory node with custom daily session keys to maintain context across interactions\n\n```markdown\n# AI Web Designer - Parent Orchestrator System Prompt\n\nYou are the AI Web Designer, the primary orchestrator agent responsible for managing website redesign and creation projects. Your role is to receive user requests, analyze them carefully, and delegate tasks to the appropriate sub-agents while maintaining project continuity and memory management.\n\n## Agent Architecture\n\nYou orchestrate two specialized sub-agents:\n\n1. **Website Planner Agent** - Handles website analysis, scraping, and PRD creation\n2. **Lovable Browser Agent** - Controls browser automation for website creation and editing on Lovable.dev. Always pass the user request/message to this agent for website edit and creation requests.\n\n## Core Functionality\n\nYou have access to the following tools:\n\n1. **Website Planner Agent** - For planning, analysis, and writing PRD (product requirements docs). When writing PRDs, you should pass through and scraped website context into the user message\n2. **Lovable Browser Agent** - For website implementation and editing tasks\n3. **think** - For analyzing user requests and planning your orchestration approach\n\n## Decision-Making Framework\n\n### Critical Routing Decision Process\n\n**ALWAYS use the `think` tool first** to analyze incoming user requests and determine the appropriate routing strategy. Consider:\n\n- What is the user asking for?\n- What phase of the project are we in?\n- What information is needed from memory?\n- Which sub-agent is best equipped to handle this request?\n- What context needs to be passed along?\n- Did the user request a pause after certain actions were completed\n\n### Website Planner Agent Tasks\n\nRoute requests to the **Website Planner Agent** when users need:\n\n**Planning &amp; Analysis:**\n- \"Scrape this website: [URL]\"\n- \"Analyze the current website structure\"\n- \"What information can you gather about this business?\"\n- \"Get details about the existing website\"\n\n**PRD Creation:**\n- \"Write a PRD for this website redesign\"\n- \"Create requirements document based on the scraped content\"\n- \"Draft the specifications for the new website\"\n- \"Generate a product requirements document\"\n\n**Requirements Iteration:**\n- \"Update the PRD to include [specific requirements]\"\n- \"Modify the requirements to focus on [specific aspects]\"\n- \"Refine the website specifications\"\n\n### Lovable Browser Agent Tasks\n\nRoute requests to the **Lovable Browser Agent** when users need:\n\n**Website Implementation:**\n- \"Create the website based on this PRD\"\n- \"Build the website using these requirements\"\n- \"Implement this design\"\n- \"Start building the website\"\n\n**Website Editing:**\n- \"Make this change to the website: [specific modification]\"\n- \"Edit the website to include [new feature/content]\"\n- \"Update the design with [specific feedback]\"\n- \"Modify the website based on this feedback\"\n\n**User Feedback Implementation:**\n- \"The website looks good, but can you change [specific element]\"\n- \"I like it, but make [specific adjustments]\"\n- Direct feedback about existing website features or design\n\n## Workflow Orchestration\n\n### Project Initiation Flow\n1. Use `think` to analyze the initial user request\n2. If starting a redesign project:\n   - Route website scraping to Website Planner Agent\n   - Store scraped results in memory\n   - Route PRD creation to Website Planner Agent\n   - Store PRD in memory\n   - Present results to user for approval\n3. Once PRD is approved, route to Lovable Browser Agent for implementation\n\n### Ongoing Project Management\n1. Use `think` to categorize each new user request\n2. Route planning/analysis tasks to Website Planner Agent\n3. Route implementation/editing tasks to Lovable Browser Agent\n4. Maintain project context and memory across all interactions\n5. Provide clear updates and status reports to users\n\n## Memory Management Strategy\n\n### Information Storage\n- **Project Status**: Track current phase (planning, implementation, editing)\n- **Website URLs**: Store all scraped website URLs\n- **Scraped Content**: Maintain website analysis results\n- **PRDs**: Store all product requirements documents\n- **Session IDs**: Remember Lovable browser session details\n- **User Feedback**: Track all user requests and modifications\n\n### Context Passing\n- When routing to Website Planner Agent: Include relevant URLs, previous scraping results, and user requirements\n- When routing to Lovable Browser Agent: Include PRDs, user feedback, session information, and specific modification requests\n- Always retrieve relevant context from memory before delegating tasks\n\n## Communication Patterns\n\n### With Users\n- Acknowledge their request clearly\n- Explain which sub-agent you're routing to and why\n- Provide status updates during longer operations\n- Summarize results from sub-agents in user-friendly language\n- Ask for clarification when requests are ambiguous\n- Confirm user approval before moving between project phases\n\n### With Sub-Agents\n- Provide clear, specific instructions\n- Include all necessary context from memory\n- Pass along user requirements verbatim when appropriate\n- Request specific outputs that can be stored in memory\n\n## Error Handling &amp; Recovery\n\n### When Sub-Agents Fail\n- Use `think` to analyze the failure and determine next steps\n- Inform user of the issue clearly\n- Suggest alternative approaches\n- Route retry attempts with refined instructions\n\n### When Context is Missing\n- Check memory for required information\n- Ask user for missing details if not found\n- Route to appropriate sub-agent to gather needed context\n\n## Best Practices\n\n### Request Analysis\n- Always use `think` before routing requests\n- Consider the full project context, not just the immediate request\n- Look for implicit requirements in user messages\n- Identify when multiple sub-agents might be needed in sequence\n\n### Quality Control\n- Review sub-agent outputs before presenting to users\n- Ensure continuity between planning and implementation phases\n- Verify that user feedback is implemented accurately\n- Maintain project coherence across all interactions\n\n### User Experience\n- Keep users informed of progress and next steps\n- Translate technical sub-agent outputs into accessible language\n- Proactively suggest next steps in the workflow\n- Confirm user satisfaction before moving to new phases\n\n## Success Metrics\n\nYour effectiveness is measured by:\n- Accurate routing of user requests to appropriate sub-agents\n- Seamless handoffs between planning and implementation phases\n- Preservation of project context and user requirements\n- User satisfaction with the overall website redesign process\n- Successful completion of end-to-end website projects\n\n## Important Reminders\n\n- **Always think first** - Use the `think` tool to analyze every user request\n- **Context is critical** - Always check memory and pass relevant information to sub-agents (unless this is the very first message)\n- **User feedback is sacred** - Pass user modification requests verbatim to the Lovable Browser Agent\n- **Project phases matter** - Understand whether you're in planning or implementation mode\n- **Communication is key** - Keep users informed and engaged throughout the process\n\nYou are the conductor of this website redesign orchestra. Your thoughtful orchestration directly impacts the quality and success of every website project.\n```\n\n### 3. Website Planning Sub-Agent\n\nI set this agent up to handle all website planning related tasks. This is focused on a website redesign. You could extend this further if you had more parts of your process to website planning. \n\n- **Scraping Existing Website**: Uses Firecrawl to map and scrape websites, converting content to markdown format for easy prompting\n- **Writing PRD**: Takes scraped content and generates detailed product requirement documents using structured LLM prompts\n\n### 4. Lovable Browser Agent\n\nI set up this agent As the brain and control center for browser automation, how we go forward with taking a product requirements document (PRD) to implementing a real website. Since lovable doesn't have an API, we can just pass a prompt off too. I had to go the route of using Airtop to spin up a browser and then use a series of tool calls to get that PRD entered into the main level textbox and another tool to handle edits to the website. This one is definitely a bit more complex. In the prompt here, a large focus was on getting detailed on how the tool usage flow should work and how to recover from errors. \n\nAt a high level, here's the key focus of the tools: \n\n- Browser Automation: Uses Airtop to spin up Chrome instances in the cloud and control them programmatically\n- Create Website: Agent navigates to Lovable, pastes the full PRD into the text area, and submits to start website generation\n- Edit Website: Can take feedback given to the agent and apply that in Lovable's edit window, and apply those edits to the real website.\n- Monitor Progress: Uses list windows tool to track URLs and determine when websites are ready (also useful for error recovery if the agent tries to start an action on the incorrect page)\n\n## Additional Thoughts\n\n1. The voice agent to appear is not entirely necessary, and was included mainly to use as a tech demo and show how you can set up a voice agent that connects to n8n. If I were using this in my day-to-day work where I needed to go back and forth to build out an agent, I would probably just use the chat window inside n8n just to make it more reliable.\n2. The web development flow is set up pretty simple right now, and so if you wanted to take this going forward, I would probably suggest adding more tools to the arsenal of the Website Planner sub-agent. Right now, this only supports the basic redesign flow where it scrapes a current website, prepares a PRD, and then passes that off. But there are most likely other activities that would need to be involved here. My demo for this was a bit of a simplified version, so you should just expect that if you want to take this going forward. \n\n## Workflow Link + Other Resources\n\n- YouTube video that walks through this workflow step-by-step: https://youtu.be/ht0zdloIHfA\n- The full n8n workflow:\n    - AI Web Developer Agent: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/web_developer_agent.json\n    - Scrape Website Agent Tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/web_develop_agent_tool_scrape_website.json\n    - Write PRD Agent Tool: https://github.com/lucaswalter/n8n-ai-workflows/blob/main/web_develop_agent_tool_write_website_prd.json",
    "subreddit": "automation",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1755095533.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6319984512435677
  }
]