[
  {
    "score": 134,
    "title": "The Man Who Killed Google [Steve Jobs on Why Monopolies Die]",
    "selftext": "Some very interesting insights coming out as to why the SERPs are providing low-quality search results at the moment on Google, which is coming from internal issues/politics at Google:\n\n&gt;\n\nIn February 2019, Google's ads and finance teams called a \"code yellow\" on search, because revenue was slow and - seriously - people were not asking Google enough questions. Ben Gomes, then head of search, refused to make Google Search worse for profit— Ed Zitron (@edzitron) April 23, 2024\n\n  \nGomes managed to help get Google through the code yellow - but Raghavan demanded more, saying Ben hadn't increased queries enough. Gomes sent a letter to stating he was \"deeply, deeply uncomfortable\" with the ways that Google wanted to grow search— Ed Zitron (@edzitron) April 23, 2024\n\n  \nPrabhakar Raghavan may be a computer scientist, but he joined Google in 2012 as a manager, working directly under CEO Sundar Pichai, a former McKinsey man. Raghavan is a class traitor that deliberately ran out Ben Gomes, who worked on search for 19 years.— Ed Zitron (@edzitron) April 23, 2024\n\n  \nPrabhakar Raghavan is a career failure, a man who has fallen upwards into the most important job in software, and since becoming head of search in 2020, Google has become an ultra-profitable and increasingly less-useful site. Raghavan is a villain. — Ed Zitron (@edzitron) April 23, 2024\n\nGoogle replaced a founding member who was passionate about user experience for a guy who worked at Yahoo and caused Yahoo to make considerable losses financially, this explains perfectly why Google is a complete mess at the moment  \nThis is a classic example of exactly what Steve Jobs said was the reason why monopolist companies die:\n\n&gt;\n\nWhen you have monopoly market share, the company's not any more successful. So the people that can make the company more successful are sales and marketing people, and they end up running the companies. And the product people get driven out of the decision making forums, and the companies forget what it means to make great products. The product sensibility and the product genius that brought them to that monopolistic position gets rotted out by people running these companies that have no conception of a good product versus a bad product. They have no conception of the craftsmanship that's required to take a good idea and turn it into a good product. And they really have no feeling in their hearts, usually, about wanting to really help the customers – Steve Jobs\n\n",
    "subreddit": "bigseo",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 134,
    "downs": 0,
    "created_utc": 1714079252.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.595408757654959
  },
  {
    "score": 116,
    "title": "Yandex SEO algorithm leaked",
    "selftext": "Yandex, a Russian search giant with many former Google employees had its data leaked, including the 1922 ranking factors they used. You can find the file with the ranking factors here: [https://www.dropbox.com/s/toyehkkfduogbwk/factors\\_gen.txt?dl=0](https://www.dropbox.com/s/toyehkkfduogbwk/factors_gen.txt?dl=0)\n\nWhy This is Huge News for the SEO community?\n\nIn my experience Yandex and Google results correlated better than Google and Bing results. I used to see movement in Yandex about the same time I saw in Google.\n\nMany of the developers working at Yandex are former Google employees and I think there are plenty of similarities.\n\nTranslate the description and you will see for yourself. Unfortunately the internal wiki is not part of the leak\n\nEDIT: This dropbox link has the description translated: [https://www.dropbox.com/s/l9p1j1f3ino95ex/Yandex%20Ranking%20Factors.docx.txt?dl=0](https://www.dropbox.com/s/l9p1j1f3ino95ex/Yandex%20Ranking%20Factors.docx.txt?dl=0)",
    "subreddit": "bigseo",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 116,
    "downs": 0,
    "created_utc": 1674855291.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.596715857410143
  },
  {
    "score": 100,
    "title": "Hi BigSEO! I'm Tim Soulo from Ahrefs. It's been 10 years (crazy!). And we’re still looking for your feedback!",
    "selftext": "Hey BigSEO!\n\nOn August 4th, 2015, just a few weeks after joining Ahrefs, I posted a thread here asking for your feedback about our product. That thread got an impressive 116 comments and gave us a lot to think about.\n\nSince then, it has become a good tradition of mine to post the same thread here every two years on the same day. There have been 5 of them so far:\n\n1. [2015](https://www.reddit.com/r/bigseo/comments/3fprta/im_tim_soulo_from_ahrefs_and_im_looking_for_some/)\n2. [2017](https://www.reddit.com/r/bigseo/comments/6rj3hh/hi_im_tim_soulo_from_ahrefs_it_has_been_2_years/)\n3. [2019](https://www.reddit.com/r/bigseo/comments/clti04/hi_bigseo_im_tim_soulo_from_ahrefs_its_been_4/)\n4. [2021](https://www.reddit.com/r/bigseo/comments/oxnjey/hi_bigseo_im_tim_soulo_from_ahrefs_its_been_6/)\n5. [2023](https://www.reddit.com/r/bigseo/comments/15hw4oo/hi_bigseo_im_tim_soulo_from_ahrefs_its_been_8/)\n\nWe’re not a public company and we don’t do investor updates. But since our customers are our investors - consider this to be our version of it.\n\n…\n\n\n\nThe last 2 years in the SEO industry were without a doubt the craziest of the decade. AI is changing everything. And only the fittest will survive.\n\nHere are four major themes that you might’ve observed from Ahrefs in these past two years:\n\n\n\n**#1 AI adoption.** \\- Everyone in the SEO industry is now caught up in the middle of two tectonic shifts: AI is changing how we search and AI is changing how we work. Here at Ahrefs we’re making it our highest priority to collect data &amp; build solutions to help you navigate GEO / AEO / LLMO / SEO. We’re also integrating AI in our product where it actually helps – not just shiny features, but real workflows our own marketing team uses and relies on every day.\n\nWe’ve launched Brand Radar, which is a one of a kind tool with the largest LLM visibility index on the market *(it’s our fastest-growing new product btw, adding $1M in ARR every 2 weeks)*. We’re actively integrating AI across many existing workflows in Ahrefs *(details here - ahrefs.com/ai )*. And we also launched an official MCP server *(connects your AI chatbot to the Ahrefs API)*, which we’re continuing to add more endpoints to.\n\n\n\n**#2 SEO is evolving.** \\- I always had a firm conviction that SEO is not just a narrow isolated discipline, siloed from the rest of marketing. To me it has always been holistic, cross-functional and deeply integrated into many critical business functions. So after a decade of digging vertically, we felt the need to start expanding Ahrefs horizontally. Our goal is to make Ahrefs the go-to marketing platform for discoverability. That means supporting everything that helps people find your business, from SEO &amp; AI-powered search to social media and beyond.\n\nIn that regard, we’ve launched AI Content Kit and free Web Analytics *(our fastest growing free product, adding 10K websites/mo)*. We also launched a beta version of a Social Media Management tool just a few weeks ago.\n\nFor each of these directions, we don’t want to merely replicate what’s already out there. We have a rather unique vision of what these solutions should look like. So stay tuned.\n\n  \n**#3 Making Ahrefs more accessible** \\- We finally delivered a cheaper plan, that was requested for so long - $29/month. We keep adding value to our free “Webmaster Tools” plan: now you get free Web Analytics for verified websites *(up to 1M web sessions)*, run free Site Audit reports *(up to 5,000 pages/mo per project)* and use our GSC reporting tool, which gives you more flexibility than the actual GSC.\n\n  \n**#4 Making Ahrefs more scalable** \\- For larger teams &amp; brands, we’ve made significant strides over the past few years to support more reporting workflows. We launched API v3, which closely mirrors the data available in our UI, giving teams programmatic access to nearly everything. We also introduced Report Builder, allowing users to mix and match data and visualizations across Ahrefs for daily reporting. And with Portfolios, you can aggregate performance across multiple domains or URL sets – making it easier to track and prove results by region, brand, business unit, or category. \n\nOn top of that, we've strengthened security and governance with SSO and granular access management, and now host Ahrefs in three locations - improving reliability, speed, and resilience as we work towards near-100% uptime.\n\n\n\nAnd that more or less covers the major moves at Ahrefs in the last two years.\n\nThe team is improving Ahrefs every single day – no part of the product is standing still (we shipped 40+ new feature releases in July alone). And your feedback helps shape what comes next.\n\n…\n\n  \nNow we’re keen to hear back from the SEO community.\n\n\n\n**What feedback do you have for us?**\n\n* What should Ahrefs prioritise to support you in your job?\n* How is your management (or clients) responding to all the changes?\n* What’s the general sentiment? Are you excited about the future of SEO or does it scare you?\n\n\n\nAs it always happens with these threads, nearly the entire Ahrefs team *(including our founder Dmytro Gerasymenko)* will be closely following the conversation here. So please speak your mind and I can assure you that you’ll be heard by the relevant people on our team.\n\n",
    "subreddit": "bigseo",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 100,
    "downs": 0,
    "created_utc": 1754302856.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.692517716361755
  },
  {
    "score": 96,
    "title": "Has Google just officially poisoned Reddit?",
    "selftext": "[Google - An expanded partnership with Reddit](https://blog.google/inside-google/company-announcements/expanded-reddit-partnership/)\n\n&gt;This partnership will facilitate more content-forward displays of Reddit information that will make our products more helpful for our users and make it easier to participate in Reddit communities and conversations.\n\nWe're aware that Reddit has been way more visible in SERPs for the past 6 months, which likely sparked the multiple generic article posts we see each day. Spammers are attempting to rank on generic queries through Reddit.  \n\n\nWith this partnership, I feel like Reddit will be even more visible in Google and everyone will know about it. Every theme where products exist and has a subreddit will be spammed by ChatGPT generated content from brands.  \n\n\nThoughts?",
    "subreddit": "bigseo",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1708962278.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.502304037779494
  },
  {
    "score": 86,
    "title": "GEO/AIO is essentially just a scam",
    "selftext": "Every SEO expert on LinkedIn loves hyping their breakthrough GEO and AIO platforms like they've cracked some impossible code. Most of these tools are either glorified prompt engineering or completely delusional about what they actually accomplish, yet they're charging enterprise prices for basic automation that you could build yourself over a weekend.\n\nI spent some time examining these platforms and they're embarrassingly basic. Generic OpenAI API calls scraping web data, then wrapping it in dashboards that look impressive but do nothing revolutionary. The \"proprietary algorithms\" usually just mean they wrote decent system prompts and decided to call it innovation, which means either these founders are sitting on secret breakthroughs or they're counting basic prompt execution as cutting-edge technology.\n\nThe whole optimization craze is mostly snake oil anyway since having software rewrite your meta descriptions doesn't automatically improve rankings. Real SEO requires understanding search intent, technical optimization, and content strategy that actually serves users rather than just feeding search engines with generated fluff that sounds impressive but lacks substance.\n\nMost extreme claims I've seen involve platforms promising overnight ranking improvements through \"network amplification\" or other vague buzzwords, then they show you manipulated metrics that can't prove causation while your accounts get flagged for automated spam. The pressure to adopt every new optimization tool is exhausting even when you know most of it is repackaged automation with fancier dashboards and premium pricing that doesn't match the actual value delivered.\n\nI know I'm getting cynical after seeing too many people waste money on these platforms, but it genuinely bothers me when good SEOs get burned by tools that promise so much and deliver basic prompt execution. The industry has real problems that need solving, and companies are making it harder for legitimate innovation to break through the noise. If you're considering one of these platforms, just ask them to show you exactly what they do under the hood. Most of the time, you'll save yourself a lot of money and frustration.",
    "subreddit": "bigseo",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 86,
    "downs": 0,
    "created_utc": 1758222251.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4999452584396904
  },
  {
    "score": 65,
    "title": "Those who moved on from SEO, what are you doing now?",
    "selftext": "I've been doing this for about 10 years and I admit I'm getting tired of it. Worked on all sorts of SEO projects, explored all I could, took some time off to recharge, but I still feel like I need something new or different. Thankfully, I make a decent living and I'm in no rush to switch things up, but I can't imagine working in SEO for another 5-10 years.\n\nIs there anyone here who moved on to something else? How did it work out for you?",
    "subreddit": "bigseo",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1718786011.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.448298391894987
  },
  {
    "score": 64,
    "title": "Hi BigSEO! I'm Tim Soulo from Ahrefs. It's been 8 years. And we’re still looking for your feedback!",
    "selftext": "Hey BigSEO!\n\nOn August 4th, 2015, just a few weeks after joining Ahrefs, I posted a thread here on r/BigSEO asking for your feedback about our company. That thread got an impressive 116 comments and gave me (&amp; the rest of the team) a lot to think about.\n\nSince then, it has become a tradition of mine to post the same thread here every two years on the same day. There has been 4 of them so far:\n\n* [2015](https://www.reddit.com/r/bigseo/comments/3fprta/im_tim_soulo_from_ahrefs_and_im_looking_for_some/)\n* [2017](https://www.reddit.com/r/bigseo/comments/6rj3hh/hi_im_tim_soulo_from_ahrefs_it_has_been_2_years/)\n* [2019](https://www.reddit.com/r/bigseo/comments/clti04/hi_bigseo_im_tim_soulo_from_ahrefs_its_been_4/)\n* [2021](https://www.reddit.com/r/bigseo/comments/oxnjey/hi_bigseo_im_tim_soulo_from_ahrefs_its_been_6/)\n\nA lot has happened in the last two years. Not just at Ahrefs, but also in the SEO industry as a whole (let alone in the world).\n\nHere are just four of the most notable highlights from Ahrefs in the past couple years:\n\n**#1** [Yep](https://yep.com/), we actually launched the beta version of our search engine. As of today it is the only alternative search engine with a big independent index. We learn a lot from working on it and we keep iterating. That project motivated us to take our backend infrastructure to a whole new level, as well as start aggressively expanding our Data Science team. Both of these resources are shared between Ahrefs &amp; Yep. And the tech that we developed for Yep has enabled us to add some features to Ahrefs which weren’t possible before (examples: [Web Explorer](https://twitter.com/timsoulo/status/1658728636223213568) &amp; [HTML source history](https://twitter.com/ahrefs/status/1660345034435330049)).  \n\n**#2** We’ve launched our own datacenter in the US and [continue advancing our hardware](https://twitter.com/botsbreeder/status/1686861537103720448). Our US-based customers should now feel a significant boost in the platform's speed and performance.\n*(&amp; If you’re a tech nerd, check out how we [saved $400M USD in the past 3 years by not going to the cloud](https://tech.ahrefs.com/how-ahrefs-saved-us-400m-in-3-years-by-not-going-to-the-cloud-8939dd930af8))*\n\n**#3** We’re almost done moving all our tools and reports to new tech (OCaml + ReasonML). This transition allowed us to significantly speed up the pace of development, as well as produce some features which weren’t possible on the old tech (like comparing your ranking positions between any two dates in the past). Just in July alone we have shipped 25 user-visible updates (see the list [here](https://app.screencast.com/jxctNROu7q8ft)).\n\n**#4** We moved to usage-based pricing. We didn’t touch our prices for many years, while our platform kept evolving and becoming costlier to maintain. We didn’t want to raise our pricing for entry-level users, but at the same time we felt the need to charge the most active users more. So we revamped our pricing to make it usage-based and to affect 20% of our most active customers. And then [we invested quite a bit of work to polish and improve it](https://ahrefs.com/blog/transparent-pricing/).\n\nThat’s about it from me.\n\nNow we want to hear from the SEO community here at /r/BigSEO.\n\n**What feedback do you folks have for us today?**\n\nAs it always happens with these threads, nearly the entire Ahrefs team will be closely following the conversation here. So please speak your mind and I can assure you that you’ll be heard by the relevant people on our team.",
    "subreddit": "bigseo",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1691144239.0,
    "media": null,
    "is_video": false,
    "num_comments": 222,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5870657881669357
  },
  {
    "score": 59,
    "title": "The Couple That Took on Google",
    "selftext": "&gt;Foundem had been hit by a Google search penalty, prompted by one of the search engine’s automatic spam filters. It pushed the website way down the lists of search results for relevant queries like \"price comparison\" and \"comparison shopping\".\n\n&gt;The couple sent Google numerous requests to have the restriction lifted but, more than two years later, nothing had changed and they said they received no response.\n\n&gt;In its 2017 judgement, the European Commission found that Google had illegally promoted its own comparison shopping service in search results, whilst demoting those of competitors.\n\nSource - https://www.bbc.com/news/articles/cjr431lr72jo\n\nInterview - https://www.bbc.co.uk/programmes/m00245nx",
    "subreddit": "bigseo",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1730731399.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.115028050860058
  },
  {
    "score": 57,
    "title": "Will Forbes ever be penalized by Google?",
    "selftext": "I always wonder why Forbes ranks in Google so much when it's notoriously terrible content, and then I saw t[his Twitter thread](https://twitter.com/searchliaison/status/1613462881248448512) today, which made me think about it again. \n\nI know Forbes has a high DA, but [everyone knows](https://www.buzzfeednews.com/article/jonchristian/jayson-demers-audienceboom-forbes-entrepreneur-pay-for-play) most of their content is a total joke -- usually by selfish, unpaid contributors, or worse, members of the paid Forbes Council, which anyone can join. There are no journalistic standards there either even by content by their \"reporters.\" \n\nGoogle has these \"[content standards](https://developers.google.com/search/docs/fundamentals/creating-helpful-content)\" and I think I understand the ranking signals pretty well, so I don't understand why it would keep ranking this site. Does authority trump everything else? \n\nI've noticed Forbes (and similar sites) are even targeting keywords that are in completely different niches and almost immediately they outrank authoritative, dedicated niche sites with good content. \n\nCan anyone help me understand why this is happening, AND **more importantly, do you think Google will ever put their foot down on this site (and similar ones) in the \\[near\\] future by penalizing them or something?**",
    "subreddit": "bigseo",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1673655455.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.199507009234047
  },
  {
    "score": 54,
    "title": "10 years of BigSEO",
    "selftext": "Looks like no one noticed...\n\n&gt;Created Mar 4, 2013\n\nThank you for all the ~~relentless amounts of SEO spam~~ fantastic posts/comments you guys have submitted over the years!\n\nBest / funniest BigSEO incidents?\n\nAnything cool you'd like to share?\n\nI definitely have BigSEO to thank for meeting the wonderful u/tuilere &amp; the other mods, and a bunch of other amazing people.\n\nI started reading in I think 2014, a little while before I left my agency job and went fulltime freelance / site owner. How long have you guys been reading BigSEO?\n\n**Edit/update: 10 years of AMAs:** [https://www.reddit.com/r/bigseo/comments/12kmvr2/10\\_years\\_of\\_amas/](https://www.reddit.com/r/bigseo/comments/12kmvr2/10_years_of_amas/)",
    "subreddit": "bigseo",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1681302276.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.274254617854112
  }
]