[
  {
    "score": 344,
    "title": "Google took everything back.",
    "selftext": "Today I had to let go of the last of our content team. It hurts.\n\nI started Geekflare in 2015, and Google recognized our work and started ranking. I won’t rant much, as Google ranked us without doing much SEO work. It was entirely based on quality, but in 2023, everything changed.\n\nFlash back: pre-HUC, we were getting \\~6 million pageviews monthly, we were 33 full-time and \\~20 freelancers. We had a great, happy team. Our articles were performing well, and one day Google rolled out the algo updates, and everything started going upside down. \n\nAt first, we thought it was a general ranking correction, but Google had a different plan altogether. We listened to their guidelines, spent many months improving stuff, and hired industry leaders to give us some ideas, but nothing worked. Soon, it became obvious that Google HCU was not a typical search improvement algo but a plan to keep Google healthy financially.\n\nWhatever it was, it impacted us in a hard way. We had no other options than to start downsizing. I was optimistic and planned to do it in phases, thinking if we see some recovery, we will stop it, but the ringmaster didn’t show any mercy.\n\nToday, we are left out with just 2 people in the content team and have completely lost trust in Google.\n\nI wish Google had been transparent, instead of implying 'just improve your content.' It would have saved us money and heartbreak.\n\nFuture: We are going to focus on building products where reliance on Google is less.\n\nThat’s the end.  \nChandan",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 344,
    "downs": 0,
    "created_utc": 1752839914.0,
    "media": null,
    "is_video": false,
    "num_comments": 124,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Personal narrative with emotional frustration about Google's impact on the business.",
    "composite_score": 4.321274101577302
  },
  {
    "score": 219,
    "title": "My attempts to save time on content without losing its quality",
    "selftext": "I've been experimenting with different ways to make content faster without losing quality. Before, I was juggling multiple AI tools – one for text, another for images, another for video – and paying for a bunch of separate subscriptions. It worked, but it was a hassle.\n\nLately, I’ve been testing an all-in-one setup (AiMensa) where I write a post, turn it into an image automatically, then generate a short video from that image – all without switching between different apps. It’s definitely been a time-saver.\n\nStill wish there was a built-in AI for music, but for now, this workflow is making things way easier.\n\nHow do you guys handle content creation? Are you using multiple tools or have you found a way to keep it all in one place?",
    "subreddit": "Blogging",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 219,
    "downs": 0,
    "created_utc": 1742242804.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Describes a time-saving content-creation workflow and the rationale behind using an all-in-one setup.",
    "composite_score": 3.554922680822206
  },
  {
    "score": 208,
    "title": "My 1 Year Blogging Anniversary: $4K Earned, 561K Clicks &amp; Lessons Learned",
    "selftext": "My 1 Year Blogging Anniversary: $4K Earned, 561K Clicks &amp; Lessons Learned \\[Screenshots Inside\\]\n\nHey Reddit fam! Today marks exactly ONE YEAR since I launched my blog (April 28, 2024), and what a rollercoaster it's been! I wanted to share my journey, the wins, the setbacks, and everything I've learned along the way.\n\n# The Numbers (Because We All Love Data)\n\n* **Total Posts:** 55 (averaging about 1 post per week)\n* **Total Search Clicks:** 561,000 (yes, over half a million!) ([Click here](https://imgur.com/HWw8Xr8))\n* **Total Impressions:** 7.06 MILLION\n* **Total Earnings:** $4,000\n* **Highest Monthly Revenue:** $1,067 ([Click here](https://imgur.com/a/S4L9DSA))\n* **Current Daily Traffic:** \\~500-600 clicks ([Click here](https://imgur.com/a/LNUDnKk))\n\n# Month-by-Month Breakdown\n\n**Month 1:** Pure hustle mode - published my first 5 posts with absolutely zero traffic\n\n**Month 2:** The magical moment I got my very first Google search click! I literally celebrated.\n\n**Month 3:** Hit the 100 search clicks milestone and started believing this could work. ***(You can review my earlier posts to see my blogging report that I previously added to this community.)***\n\n**Months 4-6:** This is where things went CRAZY. Somehow hit 100K search clicks by the 6-month mark. I still don't know how it happened so fast, but I kept publishing consistently.\n\n**Month 7:** Got accepted into Journey By Mediavine! Finally started monetizing all that traffic\n\n**Month 8:** Peak performance - hit 10K clicks in a single day and was averaging 4K+ daily clicks\n\n# The Plot Twist\n\nDecember came with an unwelcome surprise - Google's Spam Update hit me HARD. My traffic tanked seemingly overnight.  \nI discovered someone had literally copied my entire blog and was somehow ranking ABOVE me on Google. Talk about frustrating!\n\n# The Comeback\n\nInstead of giving up, I focused on what I could control. By February, I started seeing organic traffic from Bing, Yahoo, and even ChatGPT (which was a nice surprise). While I'm not back to my peak numbers, I'm still getting a steady 500-600 clicks daily, which I'm grateful for. *(SS added above)*\n\n# What I've Learned\n\n1. **Consistency matters more than perfection**: 55 posts in a year isn't a ton, but being consistent got me here\n2. **Diversify your traffic sources** \\- when Google slapped me, other platforms saved my income: Facebook, Pinterest and my Telegram channel.\n3. **Content thieves exist** \\- protect your work and report plagiarism when you find it\n4. **Celebrate the wins** \\- from first click to first $1K month, every milestone matters\n\n# What's Next?\n\nI'm focusing on creating even better content, exploring new traffic channels, and hopefully hitting the $2K/month mark by the end of year two!\n\nA few more blogs have been started; I will talk about them later.\n\nFor those just starting out, just keep pushing. I went from zero to $4K in a year with just 55 posts. If I can do it, you absolutely can too.\n\nHappy to answer any questions in the comments!",
    "subreddit": "Blogging",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 208,
    "downs": 0,
    "created_utc": 1745936154.0,
    "media": null,
    "is_video": false,
    "num_comments": 117,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Shares a year-long blogging journey with numbers and lessons learned (insights and reasoning).",
    "composite_score": 4.106087289764117
  },
  {
    "score": 188,
    "title": "To all the bloggers wondering if it's worth it. It is",
    "selftext": "This is a message for all my fellow bloggers that I wanted to share with you.\n\nI started creating content in early 2023 but not with blogging. At first I tried YouTube and TikTok, thinking that was the best way to share my contents. But I quickly realized video content wasn’t for me it. So I switched to blogging. I liked writing. It wasn’t easy, but I liked the research around a topic and then working on it until there's a final article. I realized it was very rewarding.\n\nThe issue is I wasn’t consistent. I had a job, and I was only covering a small part of my niche. Then in beginning of 2024 my contract ended which gave me more time to focus on my blog. I published here and there but I also remember thinking, should I really continue ? Then time passed, still no job so this summer, I made a decision: I was going all in. I expanded my content, covering news, trends, and events. My goal was to become of the main source of information in my niche. By August I started writing daily and mainly news.\n\nI also made another big change: I switched from Wix to WordPress. Wix was great as a beginner. But over time, I realized it wasn’t professional enough for what I wanted to build. I knew I needed something more polished if I wanted to be taken seriously and be seen as a true source in my niche. So I switched to a WordPress template and it made a huge difference. People are subscribing to my newsletter much more and I received a lot of compliments about it. Having a website that looks professional matters. If you want to grow and be perceived as an authority, your site should reflect that. \n\nOne of the biggest reasons I decided to expand my content was because I saw an opportunity. When I looked at my niche, I realized there were only about five french websites in my industry targeting a B2B audience. There was content out there, but very little that actually provided insights and deep analysis for professionals.I think this is something bloggers should think about. If you want to stand out and grow, select your niche carefully. Topics like finance, health, or cooking are great, but they’re also highly saturated. In my case, I found a space where there’s demand, but not enough specialized content. \n\nAt first, it was rough. My first article was in October 2023, and until December, I barely got 10 or 20 clicks per month. But now I have 2 000 monthly visits. I wish I had more traffic sometimes but when you’re mainly covering news it's different. I focus on writing more evergreen content because they are bringing long-term traffic. Nevertheless sometimes a trendy news well referenced on Google can bring very high traffic, it happened twice. Overall for me today what matters most is being seen as a trusted source in my niche and not monthly views.\n\nWhen I started, I had zero knowledge about blogging. I didn’t know if it was even worth it. I knew nothing about SEO, refreshing articles, or building traffic. But I learned so so much here so I genuinely want to thank you all. \n\nNow things are moving forward. I was interviewed in a podcast, I was a moderator at an event, I had a partnership with an event in my sector, one of my competitor and leader in my niche has subscribed to my newsletter (I'm still wondering whether it's a good or bad thing haha).\n\nThat said I don’t see blogging as my main job yet. Making real money from blogging takes time, and I’m still looking for a job. It’s tough but while I search, I’m putting my energy into growing this blog (that I no longer call a blog but an online media, it sounds better).\n\nAs blogger we have to be patient. Unlike social media, blogging isn’t about instant results. It’s a long game. I’ve had articles sit there with no traffic, then suddenly out of nowhere, they start trending. You never know what can happen.\n\nBlogging is tough, but when the results start coming in, it’s so so so worth it.\n\nIf you’re struggling, if you’re doubting yourself, don’t quit. Keep writing. Keep learning. Keep going. You never know where it’ll take you.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 188,
    "downs": 0,
    "created_utc": 1738490267.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Offers motivational guidance and practical tips for building a professional blog presence.",
    "composite_score": 3.911132078900035
  },
  {
    "score": 179,
    "title": "First ever niche site sold for $100,000+ (upfront investment $300)",
    "selftext": "I'm writing today because the sale of my niche site that I've been working on for the last 4 years has finally been paid out and this journey has come to an end.\n\nI wanted to share my experience of creating a niche site in the recent climate, as well as what decisions I made along the way. I know that for most people my site is unremarkable and the amount I sold it for is modest, but as a first time business owner who \"just started,\" with no other experience in entrepreneurship, internet or otherwise, I feel that this was an excellent learning experience and I'm proud of what I accomplished and achieved along the way. Hopefully this post is instructive and inspirational for those who are also first timers on a bootstrapped budget and want to know whether this is really possible for someone who, for all intents and purposes, doesn't really know what they're doing.\n\n**General stats upon sale:**\n\n* Sold for **$102,000**, listed at $145,626 (39x)\n* Monthly revenue **$4,450** and monthly profit **$3,735** (over 12 months)\n* Monetized primarily through AdThrive **(80%)**, with the remaining 20% comprised of digital products on Etsy, YouTube Adsense, Online Course (Teachable), and Affiliate.\n* Traffic sources were primarily through Google search **(71%)**, direct - email newsletter **(16%)**, and social media - Pinterest **(9%)**\n* When sold, I had 2 freelance writers, a Virtual Assistant, and Pinterest manager, and had outsourced almost all work except for the core craft tutorials that I alone could produce\n* The sale did not include my likeness, and also did not include the 2 book deals that I had signed and continue to work on\n* **The only money I ever invested into the business was $300 up front.** After that, I never spent a penny of my own money and only re-invested profits from the business (aside from sweat equity of course)\n\n***Year 1 ('20): Beginnings***\n\nI began learning my craft in January of 2020, and conceived the idea of trying out blogging on March of 2020, when I started creating and designing tutorials for my craft and posting them on Instagram. In June of 2020, I purchased my domain name, and bought a $300 course from a fiber arts blog that I looked up to about \"how to become a craft blogger.\" Keep in mind that I was a 20 year old at the time, to whom $300 was actually a substantial amount of money (I believe my bank account had about $800 in it around then).\n\n**Key skills gained in Y1:**\n\n* I became an expert in my craft! This seems like an overstatement, but during this first year I designed, photographed, sent out for testing, edited, finalized, and published so many tutorials, that I was able to iterate on my process and level up my professionalism. This helped me greatly when I reached out to brands, magazines, and eventually book publishers in Y2-4\n* I learned the basics of SEO and set up my blog — I ran into many technical difficulties, but my boyfriend was a software engineer and helped me with the backend.\n* I learned the basics of marketing and how to present myself on Instagram (photography is everything!), as well as managing an audience when I ran giveaways, Q&amp;As, etc\n\n***Y2 ('21): Slow Growth***\n\nDuring year 2, I continued my work from year 1, but just more efficiently and with higher returns. At this point, I was focusing really hard on creating good, original content with the goal of getting to Mediavine, but I was writing all the articles on my own so it was slow going.\n\nIt was about this time that I also got really into email marketing. I switched to Flodesk after hitting the maximum free number of subscribers on MailChimp (about 1000), and loved the beautiful templates. I optimized my sign up forms, ran several campaigns to build subscribers, and built out my welcome sequence workflows and ran several sales that generated a couple hundred dollars at a time. This was extremely exciting to me because at this point I had become pretty burned out on Instagram and was looking for ways to move away from social media — **I quit Instagram at the end of 2021, the source of the majority of my income so far (brand deals).**\n\nI also started trying to outsource low-level content to various places. I tried a few content mills during this time and it was expensive and not very high quality.\n\n\n\n||Total Rev '21|Avg/mo|\n|:-|:-|:-|\n|Sponsored blog post|$ 6,200.00|$ 764.29|\n|Ezoic|$ 598.99|$ 85.22|\n|Etsy|$ 2,007.18|$ 278.38|\n|Info product - bundle|$ 657.19|$ 93.88|\n|Info product - Payhip upsell|$ 288.76|$ 41.25|\n|Magazine Commission|$ 645.00|$ 50.00|\n|Affiliate|$ 214.98|$ 30.71|\n|**Total Revenue**|$ 10,612.10|$ 1,343.74|\n|Total Expenses|$ 999.99|$ 142.86|\n|**Net Profit**|$ 9,612.11|$ 1,200.88|\n\n\n\n\n\n|Stats|Avg/Mo|Comments|YOY Change|\n|:-|:-|:-|:-|\n|Traffic|27,193|Strong upward trend in winter as I expected (fiber arts is heavily seasonal)|\\+26,193|\n|Users|11,064||\\+10,000|\n|Instagram (Quit at end '21)|10,000 ish followers||\\+9,000|\n|Email Marketing - flodesk|3000 subscribers|Highlight was an event I ran where I gained 1000 subscribers in a day!|\\+2000|\n\n\n\n\n\n***Y3 ('22): Focus on SEO &amp; Mediavine!***\n\nThroughout 2022 not much changed in terms of revenue, but I was zero-ing in on my goal to reach Mediavine. The bulk of my revenue was still in commissioned posts for the brand. I was putting out a lot more high quality blog posts that ranked really well — a highlight was when I dug into an academic article and translated French, all in the pursuit of creating *original* content, and all that paid off when **I qualified for Mediavine in October of 2022.**\n\nQualifying for and being accepted into Mediavine was a huge turning point for me. It represented the goal that I had been working towards for 2 years at this point, and also tripled my revenue in one fell swoop. I went out to omakase to celebrate!\n\n||Total Rev '22|Avg/mo|\n|:-|:-|:-|\n|Sponsored blog post|$ 3,806.00|$ 317.17|\n|Mediavine|$ 2,401.00|$ 200.08 (started in Nov)|\n|Etsy|$ 3,684.00|$ 307.00|\n|Info product - bundle|$ 277.00|$ 23.08|\n|Info product - Payhip upsell|$ 871.00|$ 72.58|\n|WooCommerce (personal e-commerce)|$ 309.00|$ 25.75|\n|Affiliate|$ 2,479.00|$ 206.58|\n|**Total Revenue**|$ 13,912.00|$ 1,159.33|\n|Total Expenses|$ 2,148.45|$ 179.04|\n|**Net Profit**|$ 11,763.55|$ 980.30|\n\n  \n\n\n|Stats|Avg/Mo|YOY Change|\n|:-|:-|:-|\n|Traffic|56,650|\\+30k/mo|\n|Users|30,410|\\+20k/mo|\n|Instagram (Quit at end '21)|10,000 ish followers|\\+0|\n|Email Marketing - flodesk|6000+ subscribers|\\+3000|\n\n***Y4 ('23): Fast Growth, Diversification, and AdThrive***\n\nI qualified for AdThrive in December of 2022 (on Christmas!) and was onboarded with them by February. This was incredible growth for me and was the culmination of all the SEO work I did in 2023.\n\nAt the beginning of 2023, I embarked on a massive plan to scale up by hiring a total of 5 writers, and outsourcing Pinterest to a new VA. This increased my expenses by 10x, but I had seen that outsourcing had worked to get me onto AdThrive and I wanted to continue to grow.\n\nI had only been on Mediavine for 3 months, but from what I saw, it seemed like AdThrive provided a 30-50% bump on my revenue (in exchange for more intrusive ads).\n\nSeveral other things happened this year:\n\n* Chat GPT went mainstream in March of 2023, and that heavily rocked the MV/AT community. Personally, I began to feel some anxiety about generative AI, and started to look into sources for diversification.\n* I started filming YouTube videos in early 2023 and was monetized in August, to the tune of around $150/month right off the bat\n* In June of 2023, I created, filmed, tested, and published a beginner course on Teachable. I ran a pre-sale through my newsletter only and earned $800 in revenue before the course went live. This was very successful and I ran another sale around the holidays.\n* In the fall of 2023, a publisher reached out to me to write a book of tutorials in my niche. This was hugely exciting to me and one of my main goals that I had had from the beginning. I accepted the deal even though revenue was negligible and I knew it would be a time-consuming project (deadline mid 2024).\n\nHowever, in my personal life, things were going south quickly:\n\n* In July of 2023, I achieved my goal of replacing my income at my full time corporate job (&gt;4k a month net profit) and quit my job. This was hugely validating and one of my primary goals from the beginning.\n* However, in September, my parent had a second, much more severe stroke (similar to the one in 2020) that landed them in the emergency room for over a month. During this time I was the primary caregiver and power of attorney. Needless to say, I did not do anything productive for the remainder of 2023, even though my revenue/profits in Q4 were record breaking (hit 200k pageviews in Sept and 6k revenue in Dec).\n\n||Total Rev '23|Avg/mo|\n|:-|:-|:-|\n|Sponsored blog post (ended in March)|$ 900.00|$ 75.00|\n|Mediavine (ended in Feb)|$ 2,975.00|$ 247.92|\n|AdThrive (start in Feb)|$ 36,633.00|$ 3,052.75|\n|Etsy|$ 3,699.95|$ 308.33|\n|Info product - Payhip upsell|$ 206.98|$ 17.25|\n|Teachable Course|$ 2,676.68|$ 223.06|\n|Affiliate|$ 787.56|$ 65.63|\n|YouTube|$ 762.43|$ 63.54|\n|Book Deal|$ 375.00|$ 31.25|\n|**Total Revenue**|$ 49,035.80|$ 4,086.32|\n|Total Expenses|$ 9,641.51|$ 803.46|\n|**Net Profit**|$ 39,394.29|$ 3,282.86|\n\n|Stats|Avg/Mo|YOY Change|\n|:-|:-|:-|\n|Traffic|152,733|\\+100k/mo|\n|Users|82,272|\\+50k/mo|\n|Instagram (Quit at end '21)|10,000 ish followers|\\+0|\n|Email Marketing - flodesk|12,000+ subscribers|\\+6000|\n\n***Y4.5 ('24): Passive Income + Sale***\n\nGiven the family medical crisis that did not/has not abated, I was unable to work on the site, which caused me considerable stress. Even though it was cashflowing enough to more than cover all my expenses, my site was hit in the March update (had never been hit in an HCU update). Additionally, Google rolled out their AI snippets and I was aware that I needed to take action to continue growing.\n\nDuring this time, I was also working on my book project and taking care of family (e.g. fighting insurance companies, hospitals, and assisted living facilities).\n\nI made the decision in April of '24 to list the site on Empire Flippers since my traffic had been falling steadily (down to about 100k pageviews a month in April). Empire Flippers was incredible to work with and made the entire process so easy for a first time business owner. I received an offer at 70% of the valuation within a week, I did some negotiating to increase the up front payment, and it took about a month until the close.\n\nInitially, I was hesitant about forking over a full 15% of the sale price to a broker, but after this experience, I've realized that the value Empire Flippers provided was truly invaluable and worth every penny. If I could do it again, I would go with EF 100% of the time. The last reason I found EF to be so helpful is that they administer the migration, which actually took almost 3 months (very unusual for a business this small), mostly due to a disorganized and slow to respond buyer. Without a broker to add a little extra pressure, it would've been very stressful for me to push the buyer when I needed their go-ahead to get the funds released to me from the escrow account.\n\n**Overall Thoughts post Sale:**\n\nI feel very happy with the result I got with the sale. As the year progressed in 2024, it became increasingly clear that I wasn't going to have the time to devote to the business like I had in previous years. It also became clear that I **didn't really want to continue working on it**. This is mostly because of the anxiety that came with AI, as well as general burnout from managing a business where the win conditions are moving targets.\n\nIn the last 4 years, Instagram has completely changed and the strategies I used to grow rapidly in 2020-21 are completely obsolete, and the SEO tactics I used to grow rapidly in 2022-2023 are likely going to be obsolete in the near future. Additionally, a big part of the burnout was the fact that **trends changed rapidly in my niche**, with a new style of craft that I personally did not like absolutely dominating. It was very exhausting to stress about whether I should make a new project in the new style versus the one that I personally preferred, for years on end. This was part of the reason why it was a welcome relief to work on a years-long book project, where all of my projects (in the style I preferred) were set in advance without the need for my deliberation.\n\nTikTok was also a huge reason for burnout - I never got on TikTok, but the effect it had on other social media like Instagram, YouTube, and Pinterest was very stressful to me as someone who does not like creating short form video content.\n\nIn the future, I'm definitely planning on pursuing entrepreneurship again, though perhaps through a high value service based business rather than a model of mass content creation. I also deeply value the book deals I got and continue to work on (just signed the second book deal a month ago) because it allows me to continue pursuing my craft creatively even past the sale of my business.\n\nIn addition, through the sale, I essentially earned over 2 years of net profit from my business all at once. Personally, I don't believe I would have been able to sustain the business at its level throughout the next 2 years (who knows what the online publishing space will even look like at that point), so it felt like a good payout to me. Most importantly, it gave me peace of mind while I continue to attend to family matters without having to stress about pageviews and volatility in the SERPs.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 179,
    "downs": 0,
    "created_utc": 1733035597.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Narrates an exit/sale of a niche site with stats and takeaways for others.",
    "composite_score": 3.8990269614564244
  },
  {
    "score": 175,
    "title": "WTF do I (we) do now?? It's all dying",
    "selftext": "Demoralizing - past 28 days another 52% drop in traffic.\n\nI started my site 3.5 yrs ago, wrote about 110+ articles, and made around 40 videos. \n\nAt best I was getting about 30k sessions per month, and affiliate earnings on average $1.25k a month - with a high of $9k in peak purchase month and a low of $300 in winter months (gear &amp; travel blog).\n\nEverything 100% organic, original images, really well-written, etc and I was cruising to top #5 spots on many articles.\n\nThen, as we all know, Sept/Oct HCU came and screwed us all. \n\nAs the trend goes, my site will be dead entirely by summer, and income will drop.\n\nI have a YT channel at 10k subs with 1 vid at 1M+ views.\n\nThe thing is - I don't like it anymore. I don't like social media, sitting inside, doing this stuff for another 5-10 years - I've been doing this computer crap since I can remember, and the current internet and future has just gotten crappier and crappier.\n\nIn some way I feel like going full-send somehow will get rewards on the blog side, but tbh, it's probably killing most everyone right now.\n\nYT is certainly an option, but again, you gotta be still enslaved to google, weekly upload schedule, etc. I'm tired of spending 3+ days on a video to maybe get 5-20k average views and barely much income.\n\nSo... WTF do I (we) do?",
    "subreddit": "Blogging",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 175,
    "downs": 0,
    "created_utc": 1706877580.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Openly expresses frustration about traffic decline and burnout in a venting tone.",
    "composite_score": 3.9224195940060085
  },
  {
    "score": 162,
    "title": "4 Lessons from 10+ Years of Blogging (and Making it Work)",
    "selftext": "After years of trial and error, building blogs that pay the bills... and actually make real money, here are my 4 golden rules...  \n  \nIf you stick with them and don't deviate, you will be successful.\n\n**1. Use AI (but don’t overdo it)**  \nUse AI and yourself in equal measure. Every single time you MUST edit your content and add your own personality, own experiences, and your own little bits of things only you know how to say... this is what makes you unique.  \n  \n**2. Look after the basics.**   \nMake sure you have good hosting, a fast site, optimized images, quality (not overloaded) plugins, and the ability to collect people's email addresses.  \n  \n3. **Repurpose like a nut**  \nAlways, and I must repeat this.... ALWAYS repurpose your blog posts into multiple forms of content (10x) and place them onto other social sites, bookmarking sites, create threads, flipboards etc...  \n  \n4. **Pick a schedule and stick to it**  \nTreat it like a non-negotiable. (Life happens, but consistency is what separates the winners from the rest.)  \n  \nDo these things and your Blog, is more than *just* a blog... **It's A Business!**  \n  \nWhat about you? What’s *your* \\#1 blogging lesson?  \n  \nGood luck.   \n\nBlog smarter, not harder!",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 162,
    "downs": 0,
    "created_utc": 1734841704.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Explicitly presents four actionable blogging lessons in list form.",
    "composite_score": 3.9337515312038067
  },
  {
    "score": 164,
    "title": "3 Signs You Should NOT Start a Blog in 2025",
    "selftext": "Ok, so I'm a blogger, marketer, ex Editor in Chief and earn well from blogging... still in the age of AI.\n\nBut, honestly, let's get to the meat and potatoes in your head for a moment. \n\nEveryone’s out here telling you why you should NOT start a blog... AI and all that malarkey...\n\nBut the truth isn't that... AI isn't your barrier. \n\nBlogging just isn’t for everyone, and that’s fine.\n\nSo, here are my 3 signs you should look for to absolutely NOT start a blog:\n\n1. You’re Just Looking For Easy Money\n\nYou saw some flashy ass guru on YouTube saying blogging is passive income on steroids... and AI made it easier.\n\nNewsflash: it’s not. \n\nBlogging is hard, upfront grind. If you’re allergic to patience and think money will start raining on you in the first month, save yourself the heartbreak.\n\nBlogging is more marathon, less lucky lottery ticket.\n\n\n2. You Hate Writing (or Learning)\n\nYeah, I know, AI can help, but it won’t magically turn you into someone who loves creating content. \n\nIf you hate the thought of writing a 1,500-word article or tweaking it to rank on Google, blogging is going to feel like slow torture... seriously pull your toe nails instead.\n\nAnd if you’re not willing to learn SEO, strategy, or how to engage with readers? Forget it.\n\n3. You Have Zero Patience\n\nIf waiting six months (or longer) for decent traffic sounds like a nightmare, don’t even start. \n\nBlogging isn’t a \"post it and they’ll come\" deal... this isn't a Kevin Costner movie (that should give you an idea of my age lol).\n\nYou’ll need consistency, smart strategies, diversification and time. \n\nLots of it. \n\nThe world doesn’t care that you launched a blog... so, you’ve gotta work your ass off to make them care.\n\nLook, I’m not here to crush dreams. \n\nIf you’re serious about this, awesome...\n\nYou’ve already dodged most people’s mistakes just by being realistic. \n\nBut if any of these hit too close to home?\n\nSkip the blog and do something else that actually fits your personality.\n\nPeace. \n\nRL.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 164,
    "downs": 0,
    "created_utc": 1736556057.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Presents three signs in numbered/list form advising not to start a blog.",
    "composite_score": 3.8970229904019433
  },
  {
    "score": 158,
    "title": "Month 3 Progress: Earned My First Blogging Money, $0.24 😅",
    "selftext": "Hey everyone,\n\n 3-month update and my first income from blogging:  $0.24! 😅 You can check out my stats from this (I don't want to be banned )\n\nI’ve been posting these updates monthly, but I won’t keep sharing them unless I feel like I’m providing value to you all. I did the same things as in Month 2, but this month, I finally saw some growth 1.9k views in the last 26 days (because I forgot to fix my Google Analytics last month). Also I started to get some traffic to my blog from other social media platforms.\n\nYouTube: over 100 new subscribers.\nPinterest:  6k views. \nBlog Posts:  14 new blog posts and added ads to my site.\n\nSame things happened for me:\nConsistency is key to growth.\nPromoting content on social media \n\nI also joined Journey by Mediavine one month ago because they are open to everyone and they had a super annoying script tag error. I wrote a blog about it, and it got impressions and clicks from Google.\n\nSo, I hope I will be ready in 6 months for it…\n\nI don’t care about SEO, only using the Ahrefs browser tool. \n\nAlso, I don’t care about narrowing down my wider niche. It might be helpful, but I’m not gonna do it. \nI’m still using the same tools: Canva, ChatGPT, Midjourney, and VN.\n\nFrom now on, I’ll share updates at the 6-month mark and on my 1-year anniversary. Good luck to everyone, and happy blogging! 💪✨",
    "subreddit": "Blogging",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 158,
    "downs": 0,
    "created_utc": 1726959299.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Provides a month-3 progress update with tips and lessons learned for bloggers.",
    "composite_score": 3.9481972102014096
  },
  {
    "score": 152,
    "title": "3 years, 4 Blogs, 2k a month. Here’s what I’ve learned",
    "selftext": "What up people. Just wanted to share some tips in case anyone finds it useful.\n\n1. It’s going to take time. Be patient.\n\nNot sure what you’ve heard but figuring out how to make it affiliate blogging (or any way) takes time. Prioritize your mental health and only take on what you can reasonably handle. You’re in this for the long haul.\n\n2. Habits are better than inspiration.\n\nHaving ideas is great. But generating ideas and actually creating content takes habits. Figure out what works for you. For me it’s 30 minutes on Monday thinking/generating content ideas and 30 minutes each day writing.\n\n3. Start multiple blogs.\n\nDouble down on what works. Don’t be afraid to start multiple blogs if you have the time. If you start seeing early signs of success, double down on it.\n\n4. Don’t neglect distribution.\n\nI was waiting on SEO for too long and I almost gave up. There are other methods of distributing your blog. Start early on repurposing your content on Pinterest, LinkedIn, Twitter, Reddit or wherever - you’ll be surprised how much traffic you’ll be able to generate.\n\nHope this helps someone\n\n\nEDIT\n\nSince I’ve gotten a bunch of DMs asking about distribution - I’m [linking a tweet of mine here](https://x.com/2whazzuup/status/1967711437578703001?s=46) ",
    "subreddit": "Blogging",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 152,
    "downs": 0,
    "created_utc": 1759625857.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Gives four concrete lessons/tips about blogging and consistency in list form.",
    "composite_score": 3.8919008936747455
  },
  {
    "score": 145,
    "title": "My blog hit a big milestone in August",
    "selftext": "My personal site surpassed $20k in revenue from affiliate marketing and brand collaborations in August 2025. \n\nWhat’s wild is that this was my goal for 2025.  \n\nI'm celebrating this achievement much, much sooner than expected! \n\nBut let me be honest: it wasn’t an overnight win. It took me 4 years to turn a side hustle into something real. I’ve been a one-woman team the whole time, writing, editing, managing, and updating every part of the site myself. \n\nI had to say “no” to 99% of opportunities, because they would have never brought me to where I am now. Including the ones like \"Can we exchange backlinks?\" and \"We will send you a 100% human-written guest post.\" \n\nMy website continues growing thanks to a \"traditional\" SEO approach that I've been sticking to for years:\n\n* Prioritising content over backlinks\n* Linking to relevant sites and pages only\n* Aligning my content with Google's EEAT\n* Constantly maintaining top-performing pages\n* Building a brand and getting mentions on different platforms, even without backlinks\n* Trying to get 1-2 high-quality backlinks per month (I often had no time for this task)\n* And that's basically it! \n\n\"Self Made Millennials\" is becoming so much more than just a personal blog, and it makes me beyond happy. ",
    "subreddit": "Blogging",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 145,
    "downs": 0,
    "created_utc": 1756995488.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Contains a bullet list of individual SEO actions/tools as items.",
    "composite_score": 3.871373551944984
  },
  {
    "score": 139,
    "title": "Ten things I learned from running my blog.",
    "selftext": "I wanted to share some of my experiences as a small blogger who learned everything on her own. I run a blog in a very niche segment — probably even a bit outdated! Still, here are some lessons I’ve learned along the way:\n\n1. **Google won’t do the work for you** — you need to actively promote your site in some way.\n2. **Social media can help a lot** and might be the spark that brings in your first audience.\n3. **Newsletters matter**. Give people something useful and quick — be remembered.\n4. **Prioritize functionality over looks**. A beautiful site means nothing if users can't navigate it.\n5. **Keywords and search terms matter**, but don’t make your titles weird or forced. Let things sound natural.\n6. **Stick to your chosen theme**, but explore related subtopics to keep content fresh.\n7. **If a subtopic starts drawing a lot of traffic, be careful not to let it take over your whole site.** Interests change fast.\n8. **Any site change can take weeks or months to show results**. Keep a changelog so you know what you’ve tried and can track what worked.\n9. **Spend more time learning about your niche than obsessing over SEO tricks.** Your site can be perfectly optimized, but if your content isn’t fresh or valuable, you’ll stall and lose motivation. You can always adjust — most things are learned by doing.\n10. **AI isn’t your enemy.** Use it wisely, but don’t hand over the creative side of your work. Find joy in what you do. Somehow I believe people can feel that when they visit your site. Maybe it’s just a feminine thing to say, but I really think it’s true.\n\n  \nPlus\n\nBE HAPPY AND ENJOY YOUR LIFE!",
    "subreddit": "Blogging",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1749234383.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Explicit 10-item list of blogging lessons.",
    "composite_score": 3.814034831818634
  },
  {
    "score": 139,
    "title": "The harsh reality of blogging",
    "selftext": "I've had the privilege of mentoring a number of aspiring bloggers, setting up their websites, and sharing my knowledge on everything from SEO to crafting compelling content. At first, they're always pumped, eager to dive in and start creating.\n\nBut then reality sets in. They're faced with the daunting task of actually producing content, and their enthusiasm quickly wanes. I've lost count of how many blogs I've helped launch, only to see them collect dust. I've had clients spend hours agonizing over trivial details, like the perfect font or color scheme, while neglecting the actual content.\n\nI've got a virtual graveyard of abandoned blogs that I occasionally check in on, and it's disheartening to see that many of them still have the default WordPress post. These are people who begged for my guidance, and yet, they couldn't sustain the effort.\n\nThe truth is, blogging is a grind. It requires a level of discipline, patience, and persistence that many people just don't possess. We're conditioned to expect instant results, like a paycheck at the end of the week. But blogging doesn't work that way. It's a marathon, not a sprint.\n\nIf you're used to playing strategy games or working on long-term projects, you might have an edge. You understand that progress is incremental, and that the real reward comes from putting in the work.\n\nSo, if you're thinking of starting a blog, be honest with yourself. Are you willing to put in the time and effort required to succeed? Or are you looking for a quick fix? If it's the latter, you might want to reconsider.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1723141756.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Emotional critique about blogging reality and burnout.",
    "composite_score": 3.7053622634680314
  },
  {
    "score": 134,
    "title": "9 months of blogging… and I finally hit total 50 views 😅",
    "selftext": "I’ve been running a small blog on mental health for 9 months now. I write about anxiety, emotions, and the everyday struggles we usually keep quiet about.\n\nAfter all that effort, I finally hit 50 total views. It’s a small number, but to me, it means someone out there found my words worth a click  and maybe a little comfort.\n\nGrowth is slow, but I’m not losing hope. Every post feels like a step forward. One day, I believe it’ll reach the people who really need it. 🌱",
    "subreddit": "Blogging",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 134,
    "downs": 0,
    "created_utc": 1760898596.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal milestone post with little substance beyond anecdote.",
    "composite_score": 3.878151365793781
  },
  {
    "score": 135,
    "title": "5 years from now, you would be proud that you did not give up.",
    "selftext": "Yes it is tough. \n\nThe constant decimation by multiple updates is hard to bear. \n\nBut, don't give up. \n\n**Just don't.** \n\nKeep trying until the last breath. \n\nBecause your blog is going to change your life. It will give you not just money but a kind of FREEDOM that you would never expect. \n\nWe are the BLOG warriors. We are here to improvise, overcome and adapt. \n\nWe won't give up. \n\nWe will keep going until and unless our blog reaches a $10,000 per month revenue. \n\nAnd that money is not just going to be money. It's gonna be MONEY + FREEDOM. \n\nFreedom to wake up whenever you want. Freedom to go to sleep whenever you want. Freedom to travel the world. Freedom to meet new people and fellow bloggers along the way. \n\nOur countries received freedom a long time ago. But 99.99% of the people in our respective countries are not TRULY free. \n\nYou have the only chance to shine in this world of white-collar slavery. You are going to be inevitable. You are going to be the next big thing in the publishing world. \n\nAnd listen to me, you won't stop until you win. \n\nLet's go. ",
    "subreddit": "Blogging",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 135,
    "downs": 0,
    "created_utc": 1712325131.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Motivational post with a goal, not a how-to or model.",
    "composite_score": 3.545008912706236
  },
  {
    "score": 133,
    "title": "I am Eric Hochberger, CEO of Mediavine -- AMA",
    "selftext": "Hey [r/blogging](https://www.reddit.com/r/blogging)! I'm Eric Hochberger, the CEO and co-founder of Mediavine, a full-service ad management company representing over 17,000 publishers. I've been following [r/blogging](https://www.reddit.com/r/blogging) for years and have seen a lot of questions about our new self-serve ad offering, Journey, as well as Mediavine in general, so I figured I'd come join you guys for an AMA!\n\nAsk me anything about Mediavine, ad monetization, growing your site, or anything else I can answer to help in your blogging journeys.\n\nVerification: [https://imgur.com/a/gT540np](https://imgur.com/a/gT540np)\n\n  \nEDIT: Looks like our time is over. That was a wild 4 hours, and thank you all for your questions. I'll try to finish answering the last few remaining ones.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 133,
    "downs": 0,
    "created_utc": 1758117778.0,
    "media": null,
    "is_video": false,
    "num_comments": 238,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "AMA announcement, not contentful guidance.",
    "composite_score": 4.0138037488388765
  },
  {
    "score": 119,
    "title": "Results of my first month of blogging!",
    "selftext": "I decided last month to finally start blogging after wanting to do some form of content creation for many many years but being too scared to actually put myself out there. And I’m so proud that I finally did it. \n\nMy niche revolves around books and reading. So book reviews, book news, discussions on things in the community, etc. \n\nI used Wordpress.com for both building my site and purchasing a domain. I like the ease of Wordpress since I have no background in building sites from scratch. \n\nI decided to focus primarily on growing a social media audience along with my blog, so that’s where all but one visit came from. To me I don’t see prioritizing SEO or keywords as a big thing right now just because of how new my site is. When I finally decided to configure GSC this week, majority of my posts weren’t indexed (all but two are now) and the one that was only had about 22 impressions with no clicks.  \n\nBluesky has by far been the highest source of traffic for me. I also have Twitter and Threads accounts but those are doing next to nothing. I think this might be down to me understanding how to use Bluesky a little better though, so your own mileage may vary. The most frustrating part of using social media to promote posts is people will share your posts without ever actually reading them, which is wild to me, and has really shown me why misinformation spreads so easily these days. \n\nBut as for the results:\n\nTotal page views: 179\nUnique page visits: 132\n\nIt may not seem like much, but I didn’t expect to get anything this first month, so I’m beyond happy and excited for the future. :) I hope this can be helpful for people also wanting to start a blog. Of course, what ends up working for you may be completely different. ",
    "subreddit": "Blogging",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1744377545.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal milestone with metrics; mainly narrative.",
    "composite_score": 3.6459154738374178
  },
  {
    "score": 120,
    "title": "A Little Support Moment: Drop Your Blog, I’ll Read &amp; Comment on Each One 🩷",
    "selftext": "Hey fellow bloggers! 🌷\n\nI know how much time, energy, and heart goes into writing and maintaining a blog — and sometimes it can feel like you’re shouting into the void. So, I thought I’d create a small support moment here:\n\nDrop your blog link below and I’ll read it and leave a thoughtful comment. Whether it’s a recent post or one you’re particularly proud of, I’d love to check it out. I’ll read every one and engage genuinely.☕️\n\nLet’s lift each other up a bit today. If you're in the mood, you can visit someone else’s blog too and leave a kind word — but no pressure.\n\nIf you want to return the favor: Here is my food related blog (in dutch): https://plantifulcharlotte.wordpress.com/ here is my new book blog: https://storyboundcharlotte.wordpress.com/\n\nEDIT: Thanks all for sharing! I Will look at them in the morning 🙂 There is a little problem tho: I always have to sign in to post a comment on most of your websites… is there any way I don’t have to make an account for all your blog hosts? ",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1750871453.0,
    "media": null,
    "is_video": false,
    "num_comments": 351,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Community engagement post; no guidance or model.",
    "composite_score": 4.091056702055516
  },
  {
    "score": 118,
    "title": "After 4 Months of Blogging I Had My First Organic Sale!",
    "selftext": "I started my blog 4 months ago with the original goal of using it as a way to draw traffic and sell an eBook that I wrote. I had given away 15 copies of it through free codes (fill out a survey for 100% off) but today I have my first full-price sale!\n\nIve gotten distracted a bit along the way. Ive been focusing a lot on SEO and monetizing through ads and venturing into Amazon affiliate marketing. Its been hard and sometimes I wonder if all the effort I put in is worth it. This first sale has reignited my drive to make this successful. \n\nSome people ask on here how hard or how long does it take to monetize a blog. While this isn't true for everyone, for me, it took 4 months of daily research and writing to make my first $10. \n\nFeeling on top of the world today!",
    "subreddit": "Blogging",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 118,
    "downs": 0,
    "created_utc": 1705688027.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Shares lessons on monetization timeline and strategy.",
    "composite_score": 3.728636948384474
  },
  {
    "score": 115,
    "title": "Travel Blog Income Report (Year 2)",
    "selftext": "I want to update my travel blog income report for all the new bloggers out there wondering if it's still possible to have success in 2025 (especially those who want to be in the travel space).\n\nMy first year of blogging (2023) I had 3,118 users and made $44.73, ending the year with 64 total posts (I posted those stats [here](https://www.reddit.com/r/Blogging/comments/1915jqk/one_year_of_progress_on_a_new_blog/) a year ago).\n\nI had a much higher income in 2024 after getting accepted to a handful of large affiliate programs.\n\nI've continued to \"niche down,\" getting my content more focused and deliberate. For 2025 I've identified what my site will *actually* be about (there's some disjointed stuff on there now), and I'm excited to make that message clear and focus on it. And it's a topic I love! So I'm pumped to push it harder.\n\nEven though I made much more money, I actually (embarrassingly) only added 22 posts in 2024. But in July 2024 I finally started looking for larger affiliate programs after seeing which content was doing well and feeling like I had a solid foundation.\n\nI haven't used display ads and don't plan to, so all this income is from affiliate programs.\n\nLots of positive momentum in 2024, and I'm excited for 2025 (especially with posting more than 22 times...).\n\nHappy to answer questions and discuss.\n\n**Some things I believe...**\n\n1. You might not have your niche right away. That's fine. Start writing, build internal links, and you'll find your style/topics. Just start!\n2. Make sure your site is very user-friendly. I didn't mess with many affiliate links until I was hitting about 5,000 users per month. I don't use display ads because they annoy me when I have to close them on other peoples' websites.\n3. Find a few high-earning affiliate products and make all your content 3 degrees of separation or less from those products. This will be a big focus for me in 2025.\n4. Network! I need to practice this. In 2025 I want to get some quality backlinks from other travel bloggers/sites.\n\n|Month|Affiliate Income|Google Impressions|Users|Post Count|\n|:-|:-|:-|:-|:-|\n|Jan '24|$6.82|63,200|1,184|64|\n|Feb '24|$11.21|64,000|1,210|64|\n|March '24|$14.70|111,184|2,297|64|\n|April '24|$31.00|156,000|3,534|65|\n|May '24|$12.94|181,363|4,355|66|\n|June '24|$25.78|256,691|5,884|70|\n|July '24|$191.26|304,505|7,090|75|\n|Aug '24|$1,544.09|327,074|7,315|76|\n|Sep '24|$3,109.93|287,011|7,091|77|\n|Oct '24|$2,282.53|310,883|7,290|81|\n|Nov '24|$1,460.00|390,880|8,252|86|\n|Dec '24|$1,244.36|383,999|6,737|86|\n|**Totals**|**$9,934.62**|**2,863,790**|**61,234**||\n|2023|$44.73|158,633|\\-|\\-|",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 115,
    "downs": 0,
    "created_utc": 1735873436.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Income report plus four guiding beliefs; provides insights.",
    "composite_score": 3.8058766015795045
  },
  {
    "score": 114,
    "title": "I got my first paid subscriber! 🤯",
    "selftext": "Hey everyone, I just started writing my blog/newsletter on Substack a couple of weeks ago. About 7 weeks, to be precise. This is not my first time writing. It's my third attempt at starting a new newsletter after trying different niches over the year.\n\nAnd I'm freaking out right now because I just turned on payments 2 days ago and I received my first paid subscriber yesterday who paid for the entire year! 🤯 🤯",
    "subreddit": "Blogging",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1745739900.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal milestone update with no actionable content or list.",
    "composite_score": 3.7033627578589954
  },
  {
    "score": 117,
    "title": "I've built and sold 4 blogs over the past 7 years. Here's 4 tips.",
    "selftext": "**1) Try to avoid monetizing with display.** There are lots of creative monetization methods out there that could yield better than display while also offering a better user experience. For example, print on demand. You can design some of your own products and monetize through a tool like Printful.\n\n**2) Layer in other channels.** This could be a podcast, Youtube channel, Etsy store, instagram, etc. You need to be in 2-3 places all at the same time. I realize this is might not be easy for most starting out, but this helps build a brand and that's becoming a more important to Google's algorithm. Just like a bank needs to see another form of ID, Google needs to see another facet of your brand.\n\n**3) Ask for feedback.** If your blog gets more than 25,000 visitors in a month, you need a feedback button. Somewhere on your post pages, install a plugin that allows users to tell you was this content helpful \\[Y/N\\] and/or \"do you have any feedback or ideas on how we can improve this page\"? You'd be surprised how many responses you get, and you'd also be surprised how valuable the feedback can be for new content, features or monetization ideas. You look at your site all the time, which can diminish new thinking, so if a user wants to proactively offer a fresh perspective they needs to be heard.\n\n**4) Mastering outsourcing and learn AI tools**. This is not the time to shy away from spending or adapting to new tools. Your competition probably is and you don't want to become the Blockbuster of your niche.\n\nHope this is helpful! If you have questions put them in the comments and I'll do my best to respond. Or feel free to DM me.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 117,
    "downs": 0,
    "created_utc": 1682481980.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.95,
    "category_rationale": "Enumerated tips for blogging monetization and growth.",
    "composite_score": 3.63901994210652
  },
  {
    "score": 113,
    "title": "I Spoke To Top Tier Bloggers (This Is What They Said)",
    "selftext": "As the title mentions, I reached out to top-tier bloggers in my niche (personal finance) and got responses from most of them, and I am still waiting on a few of them. Anyways, I am here to share with you my biggest takeaways if you run a blog still today. FYI, some of it you may have heard these tips before, but I am sure there is at least one thing you can take away from this, HOPEFULLY.\n\n* Unfortunately, it is true that even the top bloggers are struggling with **GOOGLE TRAFFIC**\n* **Informative content** is borderline gone thanks to AI\n* Focusing on transactional content and reviews is the new wave in blogging\n* Short videos and YouTube content are their biggest traffic drivers\n* Utilizing social media specifically (Pinterest, Reddit, and Facebook) is a better traffic driver than search engines\n* Focus on high-ticket offers (not hundreds of low commission affiliate links)\n* Domain rating hardly matters anymore for most content\n* Long articles are a thing of the past (attention spans are shorter than ever before), so keep your content short and to the point\n\nBlogging is not dead today, despite how many people try to claim it is. But with that being said, the old style of blogging is mostly gone at this point. If you truly want to be a full-time professional blogger, the strategy is changing, and you need to adapt fast to avoid the Google updates and AI platforms that take views away from creators like us. I just wanted to share the common things I have learned over the span of my blogging career, as well as share what other creators I spoke to who were in my niche mentioned as well.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 113,
    "downs": 0,
    "created_utc": 1747779904.0,
    "media": null,
    "is_video": false,
    "num_comments": 131,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Contains a list of takeaways from conversations with top bloggers.",
    "composite_score": 3.829691816939398
  },
  {
    "score": 107,
    "title": "Don’t Quit Blogging Because of AI",
    "selftext": "Many of my competitor blogs have stopped posting new articles.\n\nSome bloggers think AI tools like ChatGPT have ended blogging, so they quit. It is true that getting traffic is harder now, but blogging is still alive.\n\nJust write around 100 blog posts on topics you like and keep updating them. Think of them as your personal notes.\n\nIf you are doing a regular job, you already face many work related problems. Write simple posts that give solutions to those problems. You can even earn some passive income from it.\n\nIf blogging is your hobby, keep doing it. But if you want to earn a full time income, try new ways to make money from your blog.\n\nMy blog still gets around 6,000 page views every day from Google. Some are from posts I wrote years ago, and some are from articles I published just a few months back.\n\nIf possible, turn your blog posts into YouTube videos. It will help you reach more people.\n\n**Update: For people who think it’s generated by ChatGPT, here’s the link to the** [**Screenshot**](https://snipboard.io/LXfR79.jpg)",
    "subreddit": "Blogging",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1761753397.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Offers a mental model/position on continuing blogging despite AI developments.",
    "composite_score": 3.6015443741747433
  },
  {
    "score": 105,
    "title": "Most people aren't cut out for this",
    "selftext": "I've helped quite a few people with blogging, set up blogs for them, and told them everything they need to get started from how to do keyword research to how to write content that converts affiliate offers.\n\nTheir excitement is palpable until . . . the time comes to put the work in. They've got a brand new shiny domain with a fresh WordPress installation and the perfect theme. That's when their interest suddenly fizzles.\n\nThe last guy I helped on a four hour call agonised over the minutiae such as the thickness and opacity of the divider line under the menu. A year later, that blog's still empty.\n\nI've got a graveyard of blogs I've helped set up that I check up on every now and then, and the only post is the default 'Hello World' one from Wordpress. And these are blogs made by people who've twisted my arm for coaching, which I don't normally do.\n\nThe truth is that blogging is a lot of monotonous hard work and takes more disclipline and patience than what most people have, even though the rewards are big.\n\nMost people don't want to work without instant gratification, as they've been conditioned by employment.\n\nIt helps if you've played MMORPGs.\n\n(This isn't an attempt at guerilla marketing; I'm not selling coaching services so don't DM me please)",
    "subreddit": "Blogging",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 105,
    "downs": 0,
    "created_utc": 1695357001.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Emotional critique about people willing to coach or start blogs but not follow through.",
    "composite_score": 3.6514721134804047
  },
  {
    "score": 104,
    "title": "Today I Hit Half a Million Lifetime Page Views - Here Are My Tips",
    "selftext": "Today I hit 500,000 lifetime page views on my travel blog, according to my WordPress stats.  Google Analytics says I reached this milestone a few days ago, but I have always just gone by the WordPress number for my personal use. \n\n**Background:** My blog is just a hobby and I only write about things I want to write about. I have a full-time day job that makes up 99% of my income.  I started my blog in late 2018 before I left for an around-the-world trip, which I fortunately returned from nine days (!) before COVID shut everything down. So, the initial growth was very slow due to nobody traveling.  I don't use any AI, I write everything myself and the most I pay for ads is about $20 per year if I feel like boosting a post on FB just to see what happens.  \n\n**Current Stats:** I am currently at about 30,000 page views per month.  My traffic in 2023 *so far* is more than 10% higher than my *total* traffic in 2022, so I think I'm on a decent growth track in light of the fact that it's just a hobby.  My monthly income is anywhere from €200-1000, which are mostly through hotel affiliate bookings, though I've recently added a tour aggregator affiliate and it's been a nice little boost. Amazon currently brings in the least, but more than covers the cost of running the blog. I don't run display ads because I'm holding out for Mediavine numbers (50,000 sessions per month). \n\n**My Personal Tips:**\n\n1. **Write about something you like (if you want to stick with it).** I fall somewhere between blogging for fun and blogging as a business, in that I started blogging for fun and to share my travel stories, but learned that it could generate some income. I don't think I'd stick with it if I wasn't writing about things I really enjoyed.  I like traveling and I like helping people plan good trips. \n2. **Write about something other people are reading about (if you want views).** At first, growth on my blog was slow, because I was writing about the obscure places I was visiting, like Nagorno-Karabakh and Chiatura. By chance, I wrote about a place that was becoming popular (Sicily) and that led to a sudden traffic increase. I now consider reader interest when I'm choosing a place to travel, because I know it becomes a \"free trip\" of sorts (I can earn back the money I spend on the trip through affiliate sales later).  \n3. **Don't rely on your friends and family to be your readers.** I haven't shared my blog with my friends or family yet. I'm a firm believer in the idea of \"don't tell people what you're going to do, show them what you've done\". I get validation from knowing my writing adds value to perfect strangers, not from getting obligatory likes from friends and family.  That being said, a handful of friends have found my blog as I had to use my personal phone number for the social accounts and it appeared in their \"people you may know\" and they figured it out! \n4. **Be authentic.** I think the biggest mistake that I see on r/blogging is people trying to monetize generic content that doesn't add any value for the reader. I see this so much in the lifestyle, health, business and tech content that gets shared here.  You don't necessarily have to put your name and face on your blog, but you do have to have a USP (unique selling point) that makes your content stand out from other sites. Taking your own photos definitely helps. An average-looking photo taken by you is 100 times better than the generic photos that come up at the top of a search on a free stock photo site. Replying to comments with actual advice helps. Talking about, and *showing*, your own personal experience helps. \n5. **Don't sweat the small stuff.** For 99% of bloggers, nobody is reading what you write for the first few months anyways. Don't ruminate over your publishing schedule, your theme or your social media accounts when you could be publishing content. You can make lots of little tweaks here and there in your first few months without it being problematic. \n6. **But do set up the basics from Day One.** If you ever want to monetize, skip the free blogging platforms altogether and start with your own domain name and your own hosting plan.  I had a different blog many years ago that I started on a free platform and tried to move to self-hosted WordPress, and it went so badly that I gave up. If I'd just invested $100 or so in my own domain and hosting from the start, it would have saved me so much time and stress.  I consider $30-40 per year a reasonable expenditure for something that I enjoy doing, even if it didn't have any return on investment. \n7. **Give and take.** I learned a lot about how to use WordPress and how to attract readers to a travel blog from Facebook groups for bloggers in my niche. These are technically my \"competitors\", but it's actually quite a supportive community. I try to pay it forward by helping other new bloggers when I can, either here, on Twitter or in those same Facebook groups. That being said, if you steal one of my photos and use it on your income-generating blog, I **will** come for you!",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 104,
    "downs": 0,
    "created_utc": 1687016403.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.86,
    "category_rationale": "Two clearly listed personal tips for blogging growth.",
    "composite_score": 3.6379032958514066
  },
  {
    "score": 104,
    "title": "If substack is so popular why don’t people just go back to blogging",
    "selftext": "I thought of joining Substack but I’d rather start a blog. I’m not sure if people gave up in the idea of just having a website but I loved the idea of having different spaces where there’s less distractions and it’s just slower, more intentional. People were so relieved for a space like Substack and medium that focuses on written content but blogging has been here all along. Im trying to understand what changed and why hosting your own website isnt even mentioned anymore. ",
    "subreddit": "Blogging",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 104,
    "downs": 0,
    "created_utc": 1758909704.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question/discussion prompt about Substack vs traditional blogging with no substance.",
    "composite_score": 3.7383843023923946
  },
  {
    "score": 98,
    "title": "Hit my 1 year blogging Anniversary last week and here’s where I’m at",
    "selftext": "🥳 Last week (June 27th) was my first blog post anniversary. I’m in a open ended crafting niche (currently focused on crochet) and here’s where I’m at 1 year later: \n\nBlog posts: 139\n\nMonthly sessions: 25,000 \n\nInstagram: 100 followers away from 10k\n\nGot accepted into mediavine’s new program for small blogs at the end of May and made $370 last month. \n\nAnd a ton of top ranking posts and organic keywords. (I’m away from my computer and can’t check atm) \n\nThis is all juggling a 5 year old and full time job \n\n\nAnyways, it can be done - it just takes effort, research and time.  \n",
    "subreddit": "Blogging",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1720053402.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Anniversary update with statistics; lacks actionable steps or structured guidance.",
    "composite_score": 3.5647414514852214
  },
  {
    "score": 98,
    "title": "Reaching 1,000 Monthly Views: A Few Things I’ve Learned",
    "selftext": "Hey all, \n\nOne of the biggest things I’ve learned about blogging in the relatively short time I’ve been doing it is to celebrate the victories, no matter how small!\n\nToday, I reached my latest goal of **1,000 visitors in a month**, which I‘ve been chasing for a few weeks, so it feels amazing to finally tick it off the list! Although I’ve had some up and down days, daily visitors have been slowly but surely creeping up over the last few months. I know these are still very small numbers, but I’m hoping that slow and steady wins the race!\n\nI’ve seen lots of posts here asking whether blogging is still worth it in the world of AI, or whether it’s something people should even pursue anymore. I just wanted to give a bit of encouragement to anyone in that position…. with hard work, results do start to happen, all be it, slowly.\n\nIf you’re in the same boat and trying to get a new blog off the ground, here are some of the things that seem to have worked well for me:\n\n**Regular Posting**\n\n* I’ve generally been posting at least one blog post per week, with at least one per month being “marquee” content. By marquee content, I mean a post that pulls together several of my other posts into a cluster. For example, if I’ve written a lot of hike reviews in Alberta, I might create a post called *“10 Best Hikes in Alberta”* and interlink each of the individual reviews. I use a Google Sheet to plan this.\n\n**Improving SEO**\n\n* I’ve been auditing my older posts and updating them for **SEO and AI**. I’ve been focusing on improving my post introductions and, where possible, add lists and FAQs that answer specific user-intent questions. This seems to be gaining traction with AI and I’ve had quite a few clicks through via ChatGPT.\n* I’ve worked on improving internal linking between my posts to help with SEO.\n* I’ve also regularly used Google Search Console to see what’s working and what isn’t. I usually look at the end of each week to see where growth has happened and try to double down on areas that are doing well, and update posts that aren’t performing.\n\n**Site Speed**\n\n* I’ve spent a lot of time resizing images - some of them were HUGE and I think it was dragging the site down. I had images over 5MB that weren’t even full-page banners! I’ve fixed most of the worst offenders, though there’s still a bit of work to do.\n\n**Social Media Growth**\n\n* I decided to give **Pinterest** a try! I’ve seen SO many people on Reddit talk about using Pinterest as a strategy, so I’ve committed to giving it a proper shot for two months. I’ve been posting five new pins a day, plus re-pinning others and my impressions have increased a lot - though so far, it hasn’t converted into many clicks. I’ll be watching this space to see how it goes.\n* I’m also planning to link my Pinterest and Instagram accounts to see if that helps drive views too.\n\nI’m the type of person who really benefits from having a plan in whatever I’m doing, so hopefully this helps someone out there too!",
    "subreddit": "Blogging",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1748631164.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.84,
    "category_rationale": "List of things learned to reach 1,000 monthly views; tips-style.",
    "composite_score": 3.6575597399661772
  },
  {
    "score": 97,
    "title": "How blogging has changed (+ what’s actually working in 2025)",
    "selftext": "I’ve been travel blogging since 2011, and one shift I’ve noticed big time is this:\n\nIf your whole strategy is “start a site, publish posts, and hope SEO/ad revenue pays off”… that’s not sustainable anymore.\n\nSure, SEO still matters. But if you’re not also building an audience, nurturing an email list, creating products, and thinking like a *business owner*, growth becomes so much harder.\n\nHere’s what’s been working for me (and others I know) in 2025:\n\n* **Creating topic clusters** around topics that truly help your audience (vs just chasing easy keywords)\n* **Diversifying traffic**: Along with SEO, I lean on Pinterest, Facebook, collabs, and my email list—currently eyeing Flipboard as a next strategy\n* **Growing + nurturing an email list** (not just “collecting” subscribers)\n* **Selling digital products**—even low-ticket ones add up and build loyalty\n* **Building genuine relationships** with other creators (collabs are such an underrated growth hack)\n\nWould love to hear from others:\n\n**What’s been working for you lately—or what’s shifted in your approach to blogging?**",
    "subreddit": "Blogging",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 97,
    "downs": 0,
    "created_utc": 1743169486.0,
    "media": null,
    "is_video": false,
    "num_comments": 123,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Enumerated strategies that are working in 2025 for blogging growth.",
    "composite_score": 3.7429369182736125
  },
  {
    "score": 99,
    "title": "How I monetize my niche blog that gets 13k+ visitors a month",
    "selftext": "I started my website (link in the profile) as a digital playground. I played around with content and tried different on-page SEO tricks. \n\nEventually, I decided to focus on two main topics I believe I know well: SEO writing and making money online.\n\nI kept sharing what I learned and publishing helpful and optimized content on my site. \n\nAs of April 2025, my website has around 100 indexed pages and gets around 13,000 visits a month, according to Google Analytics (organic, referral, and social). \n\nAt this point, it’s more than just a side project. So, I’ve started turning it into a real income stream.\n\nHere are two strategies that help me turn traffic into revenue.\n\n# Turning views into income with partnerships\n\nThese days, I don’t just share helpful content. I also focus on keywords that bring in money.\n\nWhether users look for tools, books, courses, or any other professional software, my task is to recommend the best solutions I’ve personally used as a content creator, solopreneur, and SEO specialist.\n\nLet me share the breakdown of my affiliate income and sponsorships from 2025. A more detailed breakdown by partner program is available in my newsletters (linked in my profile).\n\n* January 2025 — $1,205.59\n* February 2025 — $2,068. 57\n* March 2025 — $2,094.10\n* April 2025 — $3,748.59 (as of April 16th) \n\nI turned views into numbers after I decided to treat my website more seriously, despite being busy with client SEO.\n\nMy top money-making page, which is responsible for most of my website conversions, is this one: AI SEO tools post. This article ranks in the top 3 positions for multiple keywords because I strive to keep it up to date.\n\n# Turning views into a real business\n\nBesides affiliate marketing,  I see a solid opportunity to create optimized service pages.\n\nI haven’t focused on this in a while. Most of my leads came from LinkedIn, Medium, and my newsletter. But these platforms only work if I keep showing up. Once I pause, the leads dry up.\n\nThat’s why I recently created and optimized two new service pages:\n\n* SEO content writing services\n* Keyword research services\n\nEven though these keywords seem easy on paper, they’re actually quite competitive. Lots of SEO companies are going after them.\n\nSo far, the results look promising. My SEO content writing page already ranks for several transactional keywords, like “*SEO writing company*” and others. But there’s still work to do to get more visibility and attract the right audience.\n\n# SEO isn't dead\n\nThe purpose of this post was to show what a humble content creator can achieve with SEO, even when everyone’s yelling, “SEO is dead.”\n\nEvery time I scroll through LinkedIn or Reddit, I see folks saying SEO isn’t worth it anymore.\n\nThey blame AI and say search results are getting worse.\n\nAnd sure, people are using more AI tools to create content fast. But most of that content isn’t helpful.\n\nA lot of top-ranking pages are useless. That’s actually good news. It makes it easier to beat them with solid content.\n\n**I’ve been doing SEO for 5 years. A lot has changed, but my key beliefs haven’t:**\n\n* SEO requires consistency\n* Content creation over link building\n* Content quality over quantity\n* Support your SEO efforts by growing a brand\n\n\n\n",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1744840269.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Two distinct monetization strategies presented as items, forming a short list.",
    "composite_score": 3.571048928967859
  },
  {
    "score": 98,
    "title": "I run a high five-figure per month blog network - AMA",
    "selftext": "Hello!\n\nI've connected with the mods and they are leting me run this AMA today (thanks mods).\n\nI've been in the digital marketing space since 2005, and in that time have built and sold over a dozen properties for various valuations (most were five figure exits).\n\nToday, I run a blog network that generates north of 9MM PV's/mo and has a high-six figure / low seven-figure social following (depending on the vertical).\n\nOur core sites see more than 1MM PV's/mo each via SEO, and we've steadily built our newsletter audiences. Some of our sites generate north of $20k/mo each.\n\nIn addition, I am the co-founder of a Saas/ecom focused SEO agency that generates low-seven-figures in annual revenue.\n\nI'll be on/off for most of the day today until around 3 pm MST.\n\n**Ask me anything about SEO, email, social, content management, building/growing your team, ranking and banking, and more.**\n\n**EDIT: These are some of my favorite questions/answers so far:**\n\n* [Can you give a rough outline of your content strategy - has it evolved much over time?](https://www.reddit.com/r/Blogging/comments/12ejqnv/comment/jfbtzcs/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n* [What are the first things on a beginner blog that should be outsourced / delegated to someone else?](https://www.reddit.com/r/Blogging/comments/12ejqnv/comment/jfbdha5/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n* [What about niche, macro or micro?](https://www.reddit.com/r/Blogging/comments/12ejqnv/comment/jfbwuui/?context=3)\n* [When did you know you know you needed to hire help for your projects?](https://www.reddit.com/r/Blogging/comments/12ejqnv/comment/jfc3qax/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1680870640.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Promotional AMA with claims; lacks a clear actionable framework or list.",
    "composite_score": 3.705330197920006
  },
  {
    "score": 94,
    "title": "We Grew Our Blog to $5K/Month, Then Lost Most of It After Google’s Update",
    "selftext": "In early 2021, the blogger I had first worked with offered me a partnership. At that point, her website had around 1,000 monthly visitors. She would focus on the creative side, and I would handle all the technical work, including SEO, marketing, development, and maintenance.\n\nBy mid-2021, we had crossed 10,000 monthly visitors and applied for Ezoic. Honestly, Ezoic was difficult to deal with, but we still made a few thousand dollars. By December 2021, we hit Mediavine’s 50,000 monthly traffic requirement and got accepted.\n\n2022 was our best year. Traffic grew to 100,000 monthly visitors, coming from both Google and Pinterest. Early 2023 was even better, and traffic rose to 150,000 per month after the March update. During that time, we barely did much work because my partner was pregnant. At our peak, we were earning around 5,000 dollars per month.\n\nThen everything changed. In September 2023, Google’s Helpful Content Update hit and we got affected badly. I had started working on a SaaS startup and became the marketing lead there. My partner had just given birth to a beautiful daughter, so she was fully occupied. Meanwhile, our little blog suffered and we posted only 10 to 15 blog posts all year. Still, that blog has generated more than 150,000 dollars for us over the years.\n\nRecently, my partner started posting again. This time we focused on Pinterest, and traffic is slowly growing back. This month we reached 25,000 visitors and are earning around 1,000 to 1,500 dollars, mostly from Pinterest.\n\nI don’t believe blogging will die. Writing didn’t die when the internet came; it just changed medium. Blogging is evolving the same way. I am determined to bring our blog back, and this time I will share all my research and insights along the way.\n\nI would love to hear how your blogging journey is going. I was mainly in the DIY and crafting niche, and also worked on food and recipes. I would love to know your story.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1759749360.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.79,
    "category_rationale": "Narrative of growth and decline with explanations and lessons about Google's update.",
    "composite_score": 3.610761006639261
  },
  {
    "score": 98,
    "title": "Hit 100 posts today on my blog.",
    "selftext": "I have had this tech blog mostly focusing on Apple for just over a year. I haven’t been consistent on it, but in the past two months I have taken it a bit more seriously and have been consistent. \n\nI just posted my 100th post today and it just feels nice. I also hit 15k visitors recently :) \n\nI don’t know if I am ever going to monetise this or even if I will make a penny out of it. I think I just like writing so I am going to continue doing just that. I often see the “is blogging dead?” kind of posts here, and I am here to just remind you it’s not. Not if you enjoy writing/blogging. ",
    "subreddit": "Blogging",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1751546777.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Personal milestone update with little structure or guidance.",
    "composite_score": 3.599420282646518
  },
  {
    "score": 94,
    "title": "Why Some Blogs Blow Up While Others Stay Invisible - The Unspoken Formula",
    "selftext": "It's like every blogger wants to make their content reach more and more people, yet there are some greatly built content pieces that barely get noticed. It's not just with beginners, but seasoned bloggers as well who follow all the SEO recipes they must. So what's the secret sauce then?  \nOne of the biggest difference we've noticed is how they position their content. The blogs that actually take off are the ones that bring a fresh perspective. For instance, instead of another \"Best Productivity Hacks\", they share personal experiences like \"I tried Waking Up at 4 AM for 30 days - Here's What Actually Changed\". This makes readers give a real experience to engage with.   \nSome of the most successful blogs don't just deliver information, but create a personality with a unique tone that makes them memorable. Blogs with highly competitive topics tend to stand out simply because they sound different from the rest. That gives it a newer perspective all together.   \nAnd then there's storytelling. Facts are everywhere, but stories keep readers hooked. Elements like personal journey, relatable struggle or say a surprising twist make readers stay, share, and even come back for more. We made one client of ours move from listicles to expert-driven content, and within months they saw engagement bars rising and readers reaching out directly.   \nSEO definitely gets you seen, but storytelling, brand voice, and your perspective makes people stay. Have you found your unique angle yet? Would love to hear your take.   \nCheers!",
    "subreddit": "Blogging",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1741332002.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.83,
    "category_rationale": "Presents ideas on content positioning, storytelling, and branding as a framework for success.",
    "composite_score": 3.4277102792742564
  },
  {
    "score": 92,
    "title": "Thinking of Getting Back into Blogging — Has AI Killed SEO and Blogging?",
    "selftext": "Hey everyone, I have two WordPress blogs that I started about six years ago, and both were approved for Google AdSense. I have to admit—I never really invested much time or effort into them, so they never produced any meaningful results. Lately, I’ve been thinking about getting back into blogging, but I’m concerned that blogging and SEO might be dying out due to the rise of AI. What do you think? Is it still worth starting or reviving a blog in today’s landscape?",
    "subreddit": "Blogging",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 92,
    "downs": 0,
    "created_utc": 1748229581.0,
    "media": null,
    "is_video": false,
    "num_comments": 136,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Question-focused post that invites discussion rather than a model or steps.",
    "composite_score": 3.7193432321321387
  },
  {
    "score": 92,
    "title": "My 6-month blogging report (100K Organic Clicks)",
    "selftext": "Hello everyone! I hope you are doing great. Previous month I shared my 5-month blogging report, and you guys gave so much love and support. Thank you for that!\n\nHere is my 6-month blogging report:\n\n**Total Post**: I have total fo 35 blog posts and I wrote 3 posts this month.\n\n**Organic traffic**: I got 80K plus organic traffic from Google this month. And overall, I have crossed the 100,000 mark.\n\n**Total Impression**: 1.4M\n\n**Social Media**: Last month I got some suggestions from this community, and it worked.\n\n* **Facebook**: I got over 300 views from Facebook.\n* **Pinterest**: 43 outbound clicks.\n* **X**: Not sure, but I got 6 new followers.\n* **LinkedIn**: Shared some infographics in groups, got 100 something views.\n\n**Goal**: Last month my goal was to focus on social media. This month will be doing the same thing. And will focus on off-page SEO.\n\nSo far my journey is from 100 search engine clicks in my third month of blogging to 100K clicks at the end of the 6th month.\n\nThank you once again! Happy Blogging!",
    "subreddit": "Blogging",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 92,
    "downs": 0,
    "created_utc": 1729777734.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares metrics and outcomes with interpretive insights rather than a step-by-step guide.",
    "composite_score": 3.630692411411081
  },
  {
    "score": 90,
    "title": "A list of traffic sources to help grow your blog",
    "selftext": "Been seeing a lot of people asking in this sub about what they can do to get more traffic to their blog, so created a list that I use for my sites.\n\nI will not be mentioning mainstream methods in this list (Pinterest for instance). I beleive they have been discussed already to a greater degree in this sub.\n\n* **threads**\\- been seeing good traction and engagement here by posting links to new posts on a weekly basis.\n* **lemon8**\\- tiktok’s fast-growing sister app that allows you to add longer captions, which can be suitable for lifestyle bloggers.\n* **interactivity studio** \\- easy to get instant visibility for your blog here by creating and posting interactive images with a link to your blog. Posting on the community gets you a do-follow backlink.\n* **peerlist**\\- Articles you post here get indexed fast and you get a do-follow backlink when you post in the weekly 'Spotlight.' Can be good for parasite SEO.\n* **product hunt** \\- My recommendation for this one would be to create a tool of some sort that is related to your niche and then post a link to the tool on a PH launch.\n* wordpress (dot) com. - I create a parellel blog on the free plan (that comes on a [xyz.wordpress.com](http://xyz.wordpress.com) subdomain) I put in some effort to rank for the same keywords as my own blog by creating high-quality content that fits the user’s search intent. Once the blog starts to rank and get organic traffic, I add links to my main site for the topic. (Warning- do not create more than 1 such site or else you’ll end up with a PBN (private blog network), which can be risky in the medium-long term).\n* **flipboard** \\- works really well with visual niches. Original content tends to gain good traction here in my experience.\n* **webview apps** \\- get someone to ‘turn your website into an android app’ through a Fiverr gig. If you’re in a high-competition, high-search volume niche, having an app that opens up with your website can deliver great results since your app will show up in the SERP on mobile under Google Play’s website, on par with some big sites. (I recommend starting with android since it is a one-time fee of $25 to list the app, while on iOS, you’ll pay $99/year).\n* **email** \\- I capture email using the grow plugin and add each new subscriber to an automated email pipeline through convertkit which helps create more returning users.\n* **bluesky**\\- great potential for all kinds of niches. Easier to get visibility for your blog here than X.\n\nOk, that’s all that I can think of that are not mainstream (yet). You might say- hey isn’t email mainstream at this point? I agree, but it is worth mentioning the email capture funnel method for those who might not be looking into it. Also, mainstream is subjective, and these are just sources and methods I found over the years that I don’t see people talking about much, so here we go!\n\n\\*\\*\\*\n\nEdit- I just started a newsletter where I am sharing my strategies for growing my blogs. The sign-up link is on my profile page. If you found any value from this post, I am confident that you will have a lot more to gain from my newsletter. I hope that you will check it out!",
    "subreddit": "Blogging",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 90,
    "downs": 0,
    "created_utc": 1731244773.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Explicit list of traffic sources and methods for growing a blog.",
    "composite_score": 3.5937116670478844
  },
  {
    "score": 88,
    "title": "This is My 1st day of blogging",
    "selftext": "Hi everyone, \nToday, I have started my journey of blogging and I will be covering my journey of 100 days of blogging here.\n\nFor the past few days, I have been creating a website layout for WordPress. Finally, I finished my website design and I decided to buy the domain and hosting. Today I bought the domain and hosting and I completely set up the blog.\n\nI also had written an article for the blog, however, I was tired today so I decided to start publishing from tomorrow.\n\nSo it's my first day I just set up the website and it is looking good as per my friends.\n\nI will not share the name and niche of my website. However, I will keep sharing the other insights here.\n\nThank you for reading.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 88,
    "downs": 0,
    "created_utc": 1707239386.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.42,
    "category_rationale": "Very short personal update with minimal substantive content.",
    "composite_score": 3.5198916784623124
  },
  {
    "score": 57,
    "title": "Blogging since 2011 and I FINALLY added ads to my travel blog (through Journey by Mediavine) - whyyy did I not do this sooner",
    "selftext": "I've had a luxury travel blog since 2011 (https://luxlifelondon.com/), and I've always had my blog as a hobby on the side of my full-time job in SEO and content marketing. I've earned a good amount of money from it over the years from various affiliate links and sponsorships, but I'd \\*never\\* had ads on the site as I always wanted to keep it ad-free to make it a really great user experience. \n\nWell, last year I thought I'd finally try ads out...I signed up to Journey by Mediavine and now I'm wondering why I didn't do it sooner - I'm earning an extra $400 a month from doing nothing and it pains me to think of the thousands of $ I've missed out on over the past 10+ years by insisting it stay ad-free lol. I started with $0.07 RPM and I'm now up to $27 RPM. \n\nHonestly, if you're close to 10k sessions a month and haven't signed up yet, DO IT. 100% worth it.",
    "subreddit": "Blogging",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1744661171.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Shares monetization experience with advice and concrete results from ads.",
    "composite_score": 3.284457989226919
  }
]