[
  {
    "score": 1084,
    "title": "can someone explain why users ask for dashboards they literally never open?",
    "selftext": "i checked our usage logs today and bro i’m actually crying. this one manager begged me for months to make him this super important dashboard. he would ping me nonstop like it was a life or death situation.  \nso i finally build it, make it clean, make it pretty, all that.\n\nguess how many times he opened it?  \ntwo. two times. In four months.  \n\nlike why do people treat dashboards like some kinda achievement badge. they don’t use them, they just want to say they have one.\n\nhow do you all deal with ppl who act like dashboards are trophies? \n\ndo you just build them anyway or do you start saying no?\n\n",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1084,
    "downs": 0,
    "created_utc": 1764421123.0,
    "media": null,
    "is_video": false,
    "num_comments": 171,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.895693961638322
  },
  {
    "score": 539,
    "title": "The BI industry is worse than it's ever been. Let me share my experience",
    "selftext": "After graduating in 2015 with a bachelor's in information systems from a top-tier university in my state, I landed an internship at a Fortune 500 company. Quickly promoted to a business analyst, transitioning to a BI analyst role was seamless. After three years there, I pursued an exciting senior BI analyst position in Georgia, where I stayed for two years until an unexpected team restructuring led to a layoff. \n\nDespite six months of efforts to secure another role within the same company, I had to pivot to a new company. Currently, I'm putting in 50 to 60 hours a week as a BI engineering and data engineering professional.\n\nThe reality? No matter how many applications I submit, the competition is fierce. Recruiters have praised my outstanding resume and skill set, but with 90 to 150 applicants for each position, standing out is a challenge. Without a Harvard pedigree or advanced degree, getting an interview, let alone a job, feels like scaling a mountain.",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 539,
    "downs": 0,
    "created_utc": 1711284399.0,
    "media": null,
    "is_video": false,
    "num_comments": 211,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.585561690287345
  },
  {
    "score": 399,
    "title": "Lessons learned from working with 100 clients in the Business Intelligence space",
    "selftext": "My story:\n\nIn 2017 I started moonlight as a Tableau dev freelancer. Four months in I had a client offer me 20 hours a week and I quit my job. \n\nLate this October, me and our three staff, received payment from our 100th client and I got a poster made for the office today. \n\nWe never niched and have grown far from Tableau, although not into data sciences. Databases, visualization, strategy and training. I've worked with one person startups in the entertainment space to America's biggest coffee chain. So this list is from a wide berth of experiences. \n\n1. Build to audiences ability. If you're presenting to a bunch of data scientists then get fancy with it. If your client are restaurant operators then bar charts and text tables. It's not sexy but that's what they'll understand. Not every dashboard needs to be viz of the day candidate - hell most shouldn't even come close. \n2. Put the analytics where the users are already going. Having them go to PBI or Tableau online is an extra click they aren't likely to make. Embed it into sharepoint, send subscriptions when relevant. Bring the water to the horse. And check user metrics - see if there's uptake on the content you're slaving over. If not - why not, do the outreach, figure it out. \n3. Socialize the idea of imperfection throughout the build process. My old FTJ we had to have full branding in place before the first review. Then we'd get a bunch of change requests and have to rebrand and re-font all the new charts. Pain in the ass, time suck, cost funnel. Sometimes I'll brand just to give it a wow factor but my first meetings the designs are rough - is this the data you want to see, is this in the right direction. When it's ready for prime time stick that last coat of paint on it. \n4. Estimates without seeing the data are asking for trouble. Funnily my 100th client pushed and pushed for this. They couldn't share ANYTHING until there was a contract and a budget. And I pushed back. I've built bar charts that have taken 25 hours because the data is such a gong show. INSIST on seeing data before getting into a project. It's not feasible otherwise. \n5. Soft skills are what will separate you as an analyst. There's a huge group of people who can code. I hate to tell you but SQL ain't that hard. PowerBI is built to be easy. I'm technically good at stuff, but I wouldn't be where I am without the fluffy stuff. Rapport and delivery are everything. Knowing the right questions to ask to understand a business problem on the first go goes a long way. Just being generally jovial. Taking things seriously but not too seriously. All of these things, I know, are what our clients have appreciated in working with the company. \n\nHappy to answer any specific questions... or to just swap shit. ",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 399,
    "downs": 0,
    "created_utc": 1700594383.0,
    "media": null,
    "is_video": false,
    "num_comments": 70,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.2701891656875
  },
  {
    "score": 378,
    "title": "RIP to all the text-to-SQL startups that just got killed by OpenAI.",
    "selftext": "Hyperbole, obviously. But there are 20+ startups doing some version of a SQL chatbot that can connect to data, build interactive visualizations, and run semi-advanced analysis.\n\nOpenAI just announced that exact feature set, plus some extra goodies. Right now it only integrates with your Google Drive, but it's not a big leap from here to data warehouses.\n\nhttps://openai.com/index/improvements-to-data-analysis-in-chatgpt/",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 378,
    "downs": 0,
    "created_utc": 1715900493.0,
    "media": null,
    "is_video": false,
    "num_comments": 115,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.323368204581531
  },
  {
    "score": 268,
    "title": "The ultimate chart decision tree: never pick the wrong visualization again",
    "selftext": "We created this chart cheat sheet that maps your analytical needs directly to the right visualization. Whether you're showing composition, comparison, distribution, or relationships, this cheat sheet makes chart selection dead simple.\n\nThe framework works regardless of your BI tool ✌️\n\n[Download the PDF here](https://www.metabase.com/learn/cheat-sheets/which-chart-to-use).\n\nWhat's your go-to chart that you think more data folks should be using?",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 268,
    "downs": 0,
    "created_utc": 1747684205.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7593122713303706
  },
  {
    "score": 246,
    "title": "Analytics Manager here with 10 YOE and a side consulting business that generates six figures. AMA",
    "selftext": "Hey all\n\nI made a post on a salary-related thread here not long ago that garnered a lot of questions to the extent that I didn't have enough time to respond to a lot of folks, but the questions themselves came from people through a variety of different backgrounds. I'm setting this AMA up to help others as well\n\n  \nAs for me, I am currently an analytics manager with a base pay of $180k/year, and a side consulting business that *should* get me to about $150k in gross revenue before the end of the year. AMA!",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 246,
    "downs": 0,
    "created_utc": 1725307289.0,
    "media": null,
    "is_video": false,
    "num_comments": 169,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.212921413948803
  },
  {
    "score": 237,
    "title": "Am I the only one drowning in data and getting zero insights?",
    "selftext": "Okay I need to rant for a sec. Our company has like a million data sources. CRMs. spreadsheets. APIs. you name it. And somehow instead of actually helping us understand anything it just feels like we are collecting chaos. Dashboards barely update. Reports take forever. Half the team cant even make sense of the stuff they pull. \n\nI swear I spend more time trying to figure out where the data even came from than actually using it to make decisions. Feels like we are stuck in this loop of lets gather more data without actually knowing what the hell to do with it.\n\n Am I missing some secret sauce here or is it just me struggling to make BI actually work. How do you guys keep your dashboards manageable and actually useful?",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 237,
    "downs": 0,
    "created_utc": 1758810097.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9535619592245212
  },
  {
    "score": 191,
    "title": "Be honest does business intelligence actually change the way decisions get made?",
    "selftext": "Most of the time, the decision is already made. BI just shows up afterward to make it look data driven.\n\nDashboards do not drive action. They validate opinions.  \nReal time data often does not help either. It adds noise, urgency and panic without clarity.  \nAnd a lot of the metrics we track exist simply because no one wants to admit they do not matter.\n\nI am not saying BI is useless. I am saying it has turned into a safety blanket instead of a decision tool.\n\nIf BI disappeared tomorrow would your company actually make worse decisions or would it just feel less confident about the same ones?\n\n",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 191,
    "downs": 0,
    "created_utc": 1767255821.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9703402748915866
  },
  {
    "score": 189,
    "title": "8 Years running a business intelligence consultancy. Experience + AMA",
    "selftext": "Hey sub, \n\nI do this like once a year or so because there seems to be a lot of interest on and off about the life on the other side (running your own show). \n\nI started full time in November 2017. I am in New Brunswick, Canada. Have a team of 3 FTEs and a couple contractors. We've worked with about 150 clients. Some are ongoing partnerships, the longest having been there since day 1. Others are a couple week contract and you each go your separate ways. \n\nOur workload is about 30% database shit, 20% Tableau, 20% PBI, 10% Prep/Alteryx, 10% strategy and implementation - these are projects where were just hired to formally provide guidance and direction. I also personally do a bunch of corporate training which isn't factored into the above breakout but corporate training is about 10% of revenue.  \n\n**Client Acquisition:** Most of our clients early going (first 3 years) were from freelance sites. And the last 5 years we've completely moved away from platforms and bring clients in via LinkedIn, in person networking events and referrals. We are also partnered with a few larger consultancies to offer specialized pieces to their delivery through them. They do their own lead gen and bring us in on new projects. \n\n**This year** \\- I'm friggen tired. I'm old now. It's a grind. It's not that I'm not having fun, but just the constant mental load is really starting to wear me out. \n\nScaling from 1 person to 3 isn't just adding someone and they take 40 hours off your plate (obviously). We've successfully grown as a team, but we've had plenty of growing pains as well. It's not like you can just continuously throw more resources in and lower the company's dependency on me. \n\nI've put a lot of effort and money the last three months at becoming more scalable. And I'm going to continue that into the next year. \n\n**AI -** because I am sure people will ask. We've yet to see a true negative (or positive) impact of AI. The main players haven't integrated it very well. CoPilot in PBI and whatever tf the Tableau one is pulse or w/e- they just aren't good enough yet. Will they be? Probably. I certainly have people asking about it. But every pilot has fallen short and we've just reverted to building out basic dashboards. \n\nWe've also tried to integrate AI into the data side of the equation and again mixed success. It's smart enough to do 80% of things correctly but the other 20% it still needs help. And it doesn't tell you when it needs help so you're kind in the same spot you started. I think this will come before the data viz aspects though. \n\n**You want to do this too? -** Advice to anyone that wants to start this journey - get good at communicating the value of analytics. Be able to talk to ROI, be able to articulate what a restaurant gets with a dashboard, with an analysis, with a database. I think short of making the actual connections with people this is where a lot of people trip up. \"I'll build you a dashboard\" doesn't sell tickets. \"I'll give you a tool to reduce food waste before it happens\" is a more interesting conversation starter, \"and I already have a demo of what that looks like\" is an even better follow up. \n\nPeople hire consultants to provide excellence. So make sure you really can bring great value to a company. Be confident in yourself and be able to back it. It's not something I recommend to anyone that doesn't have experience in the field already.\n\nFeel free to pepper me with any questions. ",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 189,
    "downs": 0,
    "created_utc": 1762205899.0,
    "media": null,
    "is_video": false,
    "num_comments": 161,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.111011108224144
  },
  {
    "score": 169,
    "title": "Current BI Salaries",
    "selftext": "Hey All,\n\nI am trying to feel out the current salaries everyone is at in the BI world. If you don't mind sharing and providing the below information, it would be awesome to have some more transparency.\n\n\n\nTitle:  \nState/Country:\n\nYears of Experience:\n\nSalary:\n\n\n\nMine currently is:\n\nTitle: Business Intelligence Associate\n\nState: NYC\n\nYears of Experience: 1 as Data Analyst, 2 as BI Analyst, 1 as BI Associate\n\nSalary: 117k + 25k bonus",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 169,
    "downs": 0,
    "created_utc": 1722541168.0,
    "media": null,
    "is_video": false,
    "num_comments": 357,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.197390434700211
  },
  {
    "score": 158,
    "title": "Is Tableau corp committing suicide?",
    "selftext": "Okay that’s a harsh title, but let me explain. I really admire dashboard made with Tableau from a design perspectiv. A lot of nice things out of the box, where you need to spend hours in other tools (in my case Power BI). But things are moving as MS invests a lot in native visuals month by month and MS fabric will give a complete new experience. I don’t have the impression that Tableau is very innovative - they are loosing their advantages. Now I heard that they have raised licences by 30% and they already were on the expensive side of business. Are they really serious?",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 158,
    "downs": 0,
    "created_utc": 1697230182.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9029363460621607
  },
  {
    "score": 154,
    "title": "I made a Python data analysis tool inspired by Figma",
    "selftext": "Hello there! I’ve been using Jupyter for data projects in my university research, but I found it frustrating. The documents tend to get really long, and it’s hard to keep track of data dependencies. With Jupyter (or any notebook), organizing data and analysis steps for future reference is challenging.\n\nSo, my friends and I developed a node-based data analysis tool that lets you visually organize the process on a board. It’s still in a prototype form, so we’re limiting access for now, but we’d love to hear your feedback!\nYou can try it out from here: https://celbo.app/beta-en/",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 154,
    "downs": 0,
    "created_utc": 1730861055.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/1vms3jqj27zd1/DASH_720.mp4?source=fallback",
        "has_audio": true,
        "height": 720,
        "width": 1280,
        "scrubber_media_url": "https://v.redd.it/1vms3jqj27zd1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/1vms3jqj27zd1/DASHPlaylist.mpd?a=1770354071%2CZmNjM2QzNDk2YzQ2YjE3MDU1NTIyNmNhMWUwYWY5ZTczZTRiZjVhMmE3Mzg4MDcwOWQ1ZDZmODQ2ODM3YWU3Yg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 18,
        "hls_url": "https://v.redd.it/1vms3jqj27zd1/HLSPlaylist.m3u8?a=1770354071%2CMmUxOGM3ZWU0OWRjZmQyNDU3ZGYwNTUwMmY5MWE4YzhlZDU4MThjZjUyNzQ5MjAxOTMwODdjZWQyZWJiZmU1ZQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.449922321194104
  },
  {
    "score": 146,
    "title": "Every commercial real estate analyst job is 70% manual excel work.",
    "selftext": "Serious question. In most industries when you hire a business analyst or data analyst you expect them to analyze stuff, find insights, spot trends, whatever.\n\nIn commercial real estate the job says \"analyst\" but the work is like 70% just moving data around. Copy this report from yardi into excel. Check if these numbers match those numbers. Pull occupancy data that should come automatically but doesn't.\n\nWe hire smart people with finance degrees then have them do work that could be automated. Is this just real estate or do other industries work like this too?",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 146,
    "downs": 0,
    "created_utc": 1767133187.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7411024227971437
  },
  {
    "score": 143,
    "title": "Is it just me or are some Data Scientists missing the basics?",
    "selftext": "Hey folks,\n \nI'm working on a BI project at a client, coming in through a data consultancy. The client also brought in Data Scientists from another consulting firm to work on the same project.\n \nHere's the issue: these Data Scientists don’t seem to know basic stuff — like how to do a `JOIN`, compare two tables, use `GROUP BY`, or just explore data properly. I was honestly shocked. I'm having to do my work *and* help them with things I assumed were day-one skills.\n \nIt feels like they're more focused on the hype of building models than actually understanding the data underneath. Like… what's the point of a fancy model if you can't even prep the data right?\n \nIs this normal? Has anyone else dealt with this kind of situation?\n\nThanks",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 143,
    "downs": 0,
    "created_utc": 1745549829.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.758952479087193
  },
  {
    "score": 139,
    "title": "What's the point of BI in 2023?",
    "selftext": "I've been in this industry since 2010 and I've seen things go from the Cognos days of robust metadata models feeding old-school standard reports, to single-use Snowflake tables feeding Tableau reports. Now we have LLMs, the return of semantic layers, BI notebooks, etc etc. Lots of change in tech, philosophy and practice in that time.\n\nSo my question is - what's the point of BI in 2023? To enable self-service? To provide system-of-record reporting? To build visualizations for the business?\n\nIs BI still relevant, or are developments in AI and data science making us obsolete?\n\nI'm asking as a research question - I have a small BI focused YouTube and LinkedIn show and this weeks episode is 'What's the point of BI in 2023?'\n\nI'd like to share your answers on the show. Thanks!",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1695760180.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6990540414993105
  },
  {
    "score": 138,
    "title": "This is the story of how I cost my analytics agency $5,000",
    "selftext": "Earlier this year my agency closed a large 9-figure DTC brand as a client. The brand wanted us to help them automate some complex excel-based reports.\n\nWe got to work and set them up with a data stack of Fivetran, BigQuery, dbt and Tableau. We hooked up over 10 data sources to Fivetran and started loading the data into their new data warehouse.  \n  \nOnce all the data was in BigQuery we got to work building hundreds of data models in dbt. Things were going great, and according to the plan.  \n  \nAbout 2 weeks into the project I decided to take a look at their cloud costs. My stomach dropped when I saw that we were trending towards $8,000 for the month in Google Cloud Services costs. It was a complete shock. I had told the client they could expect +-$250 a month in cloud costs.  \n  \nI took a deep breathe and started to investigate.The culprit was Klaviyo. The brand was a very heavy user of Klaviyo and generated billions of rows of data a year.   \n  \nKlaviyo is a very problematic data source to work with because there is no way to parse out certain events through their API end points. This means that you either pull all events or none. If you know anything about Klaviyo, you know they generate a lot of events, most are unhelpful and ignored by Klaviyo practitioners.  \n  \nI deactived the Klaviyo connector in Fivetran and disabled its dbt models. As a result, the cloud costs dropped down to under $10 a day.  \n  \nI then got on a call with our main point of contact at the brand, explained the situation and told him that I would discount the price of the project by $5,000 to help off set the unexpected cost.  \n  \nFor a small analytics agency writing off $5k (25% of the cost of a 8 week long project) was very painful but it had to be done. The best lessons are learnt through pain and I can promise you, I won't make this mistake again.",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 138,
    "downs": 0,
    "created_utc": 1729106300.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.749269256607213
  },
  {
    "score": 130,
    "title": "is there a reason all my data sources tell a different story or are they just messing with me?",
    "selftext": "bro i swear i’m losing my mind.  \ni pulled the same metric from 3 different sources today and got three completely different numbers.\n\nlike  \nsource a: 12,000  \nsource b: 9,800  \nsource c: error connecting to server  \nsource d (that i didn’t even know existed): 14,500?\n\nhow. how are we all looking at the same company but seeing different universes?\n\nand of course leadership goes why don’t we have a single source of truth?  \nidk man maybe because half the org is running secret spreadsheets like it’s the wild west?\n\npls someone tell me your worst why are these numbers different nightmare.\n\n",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 130,
    "downs": 0,
    "created_utc": 1765268619.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6608012913197454
  },
  {
    "score": 123,
    "title": "I love growing with BI...",
    "selftext": "Five years ago I pivoted my career to being a freelance Tableau dev. I was above average at Tableau and could read and understand most SQL but would have a hard time programming more than a select from where. \n\nJust closed my fiscal and last year my biggest projects in order of revenue were \n\n1. Alteryx (had some experience from my previous full time role but limited).\n2. Snowflake ELT into Tableau, but most of my work is back end\n3. Corporate training contracts in Tableau, PBI, Alteryx and Data Viz\n4. Tableau (client dating back to my first year of operations)\n5. Big Query into Data Studio (this was actually for a huge company and I'm still astounded they leaned so heavily on data studio). \n\nI just think it's so fun what you can do with a career. You start with Tableau but you realize the data is slow, so you do a bit of googling and learn how to do an aggregation. And then you want to only bring in the first two instances of a customer so you google again and you learn how to do a Partition. And then you need to do the same thing in Snowflake or BigQuery and that's ok because while not identical they're close enough so you can do that. And suddenly you're doing more back end than front end, and that's ok because it's fun too. \n\nIDk. Just monologuing. It's a find place to grow.",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1678198466.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5844516808262163
  },
  {
    "score": 120,
    "title": "Has anyone here moved away from dashboards as main source of insights?",
    "selftext": "I am getting tired of dashboards, and especially the tools surrounding it. Whether it is Power BI, Tableau or Qlik the dev time is high and the lifecycle is short, making it a lot of effort for moderate new insights. For new insights we often move to ad-hoc analysis anyway as the question is often outside of set data models' scope.\n\nTherefor I was thinking to move away from the \"big\" vendors and move to a more modular approach, like:\n\n1. A dbt environment w. semantic layer\n2. A \"Steep\" like app for KPI tracking and investigating the \"why\"\n3. A tool for ad-hoc analysis and presentation (like a Jupyter Notebook but with presentation more suited for business than data analysts)\n\nAnyone has any experience of this or similar?  What tools do you use? What are your main upsides/downsides with the idea?",
    "subreddit": "BusinessIntelligence",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1738926747.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7239516185320842
  }
]