[
  {
    "score": 660,
    "title": "I have an opportunity to buy warehouse at half cost but I don't know exactly what to do with the property",
    "selftext": "My father is selling a lot. It has two buildings on it. One is the warehouse that i have shown above. Roughly 22000 sq ft with both ends of the building currently being rented out at an additional 10,000 sq ft.. The middle and rear of the warehouse is currently just being held for misc storage. The other building is separate on the corner of the lot. It's roughly 1000 sq ft. That also currently has a tenant but it will end shortly.\n\nI have not personally run my own business but I've worked with my father for almost 20 years at his previous business. I have roughly 100,000 in capital to work with after the purchase of the property. My wife would help with marketing as she has a background in it and I have a good report with the local community through various clubs and programs. \n\nMy main question is what could I use to bring into the middle of the warehouse? I could always use it as storage (has been car/boat/rv storage in the past) so that is an option. Really looking into making a more aggressive play to maximize profits.\n\nNote there is no heating element of any kind, one could be added and structures can be built inside.\n\nI was thinking maybe a golf simulator place. There are a few golf courses with in 30 mins in any direction but we have snow between November - March so courses are shut down. Possibly try and get a liquor license and build a member only bar/club to help attract client tell but I have not delve down that rabbit hole. Might not be worth the headache.\n\nPerhaps run indoor storage units. Sell it as more upscale/private/secure with them being inside.\n\nI'm from a smaller town, so I haven't really seen many options that could go into a place like this that you might find in larger cities. Any ideas here would be greatly appreciated. \n\nI hope I've hit the requirement for this post as I'm new to the sub and have read the rules. Thank you!",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 660,
    "downs": 0,
    "created_utc": 1735874116.0,
    "media": null,
    "is_video": false,
    "num_comments": 1046,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.057674800325061
  },
  {
    "score": 383,
    "title": "TikTok Pays Really Well!",
    "selftext": "Hi all,  \n\nI just wanted to share about how TikTok can be a great side business if you put the effort in. Here’s what I have earned last month. \n\nIt took me around six months to be monetized via the TikTok creator fund, but now that I am, it’s a great little earner. \n\n**How to earn money on TikTok**\n\nBefore I begin, I just want to say this is all dependant on the TikTok creator program and if you’re eligible to join it. \n\n**You need to:**  \nBe over the age of 18.  \nBe a resident in an eligible country.  \nHave 10,000 followers on your TikTok page.  \nHave had at least 100,000 views in the last 30 days.\n\nYou may look at the 10,000 followers and 100,000 views like a huge obstacle. However, once you know TikTok, it becomes easy to achieve.  \n\n**Here’s how:**\n\n**1. Choose a Niche**\n\nStart by deciding on a niche for your content. Think of something you’re passionate about or knowledgeable in, like gaming, locksmithing, or even hunting.\n\n**2. Create Engaging Content**\n\nConsistency is key. You need to make videos that capture attention and post regularly to stay in front of your audience.\n\n**3. Edit Like a Pro**\n\nEditing your videos to keep viewers engaged is crucial. The longer people stay on your video, the more TikTok pushes it out to others.\n\nIf you can follow these steps and make quality content, you’ll hit the 10,000 follower mark in no time and get into the Creator Program.\n\nOnce you’re in, keep in mind that videos need to be longer than 61 seconds to qualify for monetization.\n\n**Why TikTok?**\n\nTikTok’s algorithm is one of the best for growing an audience quickly. Once you’ve got a decent following, you can start branching out to other platforms to maximize your income streams.\n\nIt only takes one viral video for your channel to gain the traction needed! ",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 383,
    "downs": 0,
    "created_utc": 1729085529.0,
    "media": null,
    "is_video": false,
    "num_comments": 131,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.289618189970456
  },
  {
    "score": 379,
    "title": "As an introvert with a budget under $1,000, what type of business can I start?",
    "selftext": "I am a cloud engineer with an introverted nature, my goal is to start a business, whether it's a side hustle or a small venture, primarily online. My hobbies are playing video games, watching football and pro wrestling etc.\nDespite lacking handcraft skills, I'm open to learning and exploring options.\nI researched a lot about what type of business or side hustle would fit for my personality but while conventional suggestions like blogging and YouTube don't appeal to me, I'm considering the possibility of acquiring a SaaS business from platforms like Flippa or Motion Invest to jumpstart my entrepreneurial journey within my mentioned budget. I'm enthusiastic, ready to learn, and explore but thing is idea is lagging. Again, I am not sure if it's a good idea to buy a business from flippa or motion invest as I am not sure how it'll workout at the end.\nWhat do you guys suggest? I need your guidance and recommendations",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 379,
    "downs": 0,
    "created_utc": 1704726366.0,
    "media": null,
    "is_video": false,
    "num_comments": 316,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.5278132277256855
  },
  {
    "score": 379,
    "title": "Someone please steal this idea",
    "selftext": " **Background:**\n\n**Solar panels are hot.** Currently 4% of American households have solar panels, but this is expected to rise to 18% in the next 10 years!\n\n**The business idea:**\n\n**it’s solar panel cleaning (as a middleman)**. I love this idea for so many reasons. You can operate this from home, there’s already contractors available in this market, and your market cap will 4x.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/24t8zgyn5gic1.png?width=1292&amp;format=png&amp;auto=webp&amp;s=a007c87c8c53290270ea638ff0535c70d273813b\n\n**The MVP:**\n\n**This is something you can test for less than $50 and from the comfort of your own home.**\n\nHere’s what I would do:\n\n&amp;#x200B;\n\n1. Open Google Maps in your neighborhood\n2. Find the houses with solar panels (like below)\n3. &amp;#x200B;\n\nhttps://preview.redd.it/u4jgsfyp5gic1.png?width=1292&amp;format=png&amp;auto=webp&amp;s=8e27b667c1443ba3ad416a543f641ec37d530e07\n\n1. Click on the houses with solar panels to find their addresses\n2. Make a google sheet of all the addresses in your area\n3. Create a solar panel cleaning flyer on Canva and create a door flyer Every Door Direct Mail (EDDM) campaign with [*USPS*](https://flight.beehiiv.net/v2/clicks/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1cmwiOiJodHRwczovL3d3dy51c3BzLmNvbS9idXNpbmVzcy9ldmVyeS1kb29yLWRpcmVjdC1tYWlsLmh0bT91dG1fc291cmNlPXd3dy50aGVnaG9zdGJ1c2luZXNzLmNvbSZ1dG1fbWVkaXVtPXJlZmVycmFsJnV0bV9jYW1wYWlnbj1zb2xhci1wYW5lbC1jbGVhbmluZy1mcm9tLWhvbWUiLCJwb3N0X2lkIjoiYWM1YjdhNjMtYmU1NC00MTRlLWIyM2YtNmZjMTJkN2JiOTI2IiwicHVibGljYXRpb25faWQiOiJiOWMyZThjNS1lN2JjLTRkMjktOTIyZS1hZjFiMDFmZDkyMTciLCJ2aXNpdF90b2tlbiI6ImM2MjM3ZWM3LTdlODAtNGNkZC04MjA3LThkZGFjMjJiM2M0ZSIsImlhdCI6MTcwNzg1ODkwNSwiaXNzIjoib3JjaGlkIn0.RG6qauweYzJlbAzh4--3cy9FQddXn4MiUfDwtAYumB8)\n4. Have them send the flyers for \\~$.20 ea to 100 of the addresses you found on maps (all in $20)\n5. Create a free landing page on [*Carrd*](https://flight.beehiiv.net/v2/clicks/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1cmwiOiJodHRwczovL2NhcnJkLmNvLz91dG1fc291cmNlPXd3dy50aGVnaG9zdGJ1c2luZXNzLmNvbSZ1dG1fbWVkaXVtPXJlZmVycmFsJnV0bV9jYW1wYWlnbj1zb2xhci1wYW5lbC1jbGVhbmluZy1mcm9tLWhvbWUiLCJwb3N0X2lkIjoiYWM1YjdhNjMtYmU1NC00MTRlLWIyM2YtNmZjMTJkN2JiOTI2IiwicHVibGljYXRpb25faWQiOiJiOWMyZThjNS1lN2JjLTRkMjktOTIyZS1hZjFiMDFmZDkyMTciLCJ2aXNpdF90b2tlbiI6ImM2MjM3ZWM3LTdlODAtNGNkZC04MjA3LThkZGFjMjJiM2M0ZSIsImlhdCI6MTcwNzg1ODkwNSwiaXNzIjoib3JjaGlkIn0.OzkbK-32oc2w65rTCqohecQZFe41VQ6Zdafx4xOp3aY) to point the flyers to and register inbound leads.\n\n**Did you get at least 1 inquiry? Congrats this $20 campaign just paid for itself!**\n\nStart by getting some roofers, window washers, and decorative light hanger guys on contract and figuring out their hourly wages.\n\nThis will help us deliver quotes to leads, which we can start to automate quickly (but more on this later)\n\n**Estimating the time it takes for these guys to clean panels is crucial. Once you can nail stuff down like:**\n\n* type of roof\n* number of panels\n* type of cleaning solution\n* location/stories/height of roof\n\nAll of these will play a part in your quote estimation. Once you can start nailing quotes down you can start earning 10%-40% on every panel cleaned.\n\n**The best part is this can all be (nearly) automated** 💻\n\nWe can:\n\n1. Hire a VA (virtual assistant) to find homes on maps and send DM (direct mail) to solar powered homes\n2. Automate quotes by creating an intake form that immediately spits out a quote based on questions you have.\n3. Have these hot leads immediately sent to contractors\n4. Automate payments once contractor has completed work (income from client, expense for contractor)\n5. Automate followups for reviews and every 6mo cleanings\n\n&amp;#x200B;\n\nIf you decide to do this, please let me know how it goes! Would love to followup in a few months.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 379,
    "downs": 0,
    "created_utc": 1707871284.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.310396634463058
  },
  {
    "score": 278,
    "title": "My app makes me $6.4k/mo after 9 months. How I would start again from $0",
    "selftext": "So last year I built Buildpad which is an app that helps with market research and guidance from idea to product. It resonated well with people when I launched and keeps growing at a steady pace. I launched 9 months ago and now it makes me $6.4k per month ([MRR pic](https://imgur.com/a/7I6gfiC))\n\nI see a lot of people here that struggle to make money from their products which made me think about how I would do it if I had to start again from 0.\n\n**Here it is:**\n\nI’d start by finding a group of people to solve a problem for. I would go on the subreddits I visit the most myself, sort by top posts and make a list of common questions and pain points people in the community bring up.\n\nFrom that list I would write down the 2-3 problems that get brought up the most. Then I’d use any LLM with deep research (Claude is best) and just ask it to do a thorough market analysis of the problem statement to validate whether the problem is real. My goal would be to understand how large the market is, how the problem impacts people/businesses (the problem should be painful), and what existing solutions there are.\n\nIf the market exists, I’d build a very simple solution either with code or using no-code tools. Just aiming to be able to say that I have a simple solution for the problem. Once I have a basic version, I’d go back to the same subreddit where I found the problem and then launch it there.\n\nIn the beginning I want a lot of feedback in order to improve the solution so I would also look for Facebook groups, discord groups, etc, where the people that have the problem hang out. Then I would be active in the community, post value, comment, DM, and mention my solution when I genuinely think it could help someone. This is how I got my first users for two previous projects so I know it works.\n\nOnce I start getting some traction, I’d look to automate marketing more by sponsoring newsletters, substacks, influencers, basically anyone who writes content relevant to my target audience. In my experience, ROI on smaller creators with a relevant audience is great.\n\nWhile the marketing is rolling I would spend my time improving the product until I reach a few thousand per month in revenue. At that point it’s time to make the choice whether I want to cut down my time to just a few hours a week and cruise or spend more time to grow the project.\n\nThis path isn’t complicated, I’ve been through it twice. It just takes dedication in the beginning and not giving up even though you might not see fast or obvious results. There will be days when it seems like nothing is working, but if you keep pushing through it and stay rational, the results will come.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 278,
    "downs": 0,
    "created_utc": 1752302992.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.027742138073992
  },
  {
    "score": 226,
    "title": "Update: I have an opportunity to buy a warehouse at half price",
    "selftext": "I wanted to edit this post to give more clarity and answer some questions that I've seen asked several times. Since I'm not allowed to (because I loaded up pics?) Ill leave a longer follow up comment that hopefully gets upvoted so everyone can see.\n\nThis lot is located in a small town. We only have 3 stop lights in our entire town. Think rural, farm land. While I don't have the population numbers readily available, my graduating class only had 150 kids if that helps. It's located in NY, BUT NO WHERE NEAR NYC. Its about 45 mins from Buffalo. Were like 5 times closer to Canada (90 mins) then NYC(420).\n\nMy father currently has it listed for $300K (warehouse) and 100K (corner building) totaling $400K. Depending on the the deal I would be purchasing it at $200,000 at the most. \n\nI would not be buying it (with my fathers deal allowing me to on the cheap) just to turn it around and sell it at full cost. He is allowing me to get a deal on the property because I am his son. I would not turn around instantly and flip it for full cost. Now years down the road if a major player comes in and offers something substantial, then we can have that discussion. Perhaps even have something in writing for such a scenario.\n\nThere are currently 3 tenants. Two are on year long leases and one that has an open ended lease (he's retired). The tenants currently pay what it would cost to get the loan/mortgage form the warehouse.\n\nI would only make the purchase after all the initial steps were taken to make sure it was a viable purchase. This includes but is not limited to Inspections, Zoning, Renovations if needed, a business plan, etc. While I do not think anyone was trying to be snarky, I heard many responses along the lines of this \"You should never purchase a space like this without a gameplan\", I'm paraphrasing. Due diligences would be in place before just throwing cash at it. Most of you either understood the assignment or realized that this was just a brainstorming post.\n\nHere are some of the most common ideas.\n\n1. Storage - This one is pretty self explanatory. While there are were several versions of idea, it was by far the most common.  \n2. Sell Weed - I do not know much about the business but from just basic things like like licenses and growing equipment, not to mention hiring people that do know what they are doing. It would be a super expensive endeavor, even if it meant radically high returns.  \n3. 3PL - 3rd Party Logistics  \n4. Gym - Different types as well. Bouldering, cross fit, themed gyms  \n5. Smash Room / Axe Throwing  \n6. Wedding Venue / Event Spaces  \n7. Build individual rooms for various businesses: Content Creation, Work Space, Esports, Art Studios, Photography Stations, etc  \n8. Niche Sports - Skate Parks, RC Park, Paintball, BMX  \n9. Automotive Shop - Restoration, Mechanical, Chop: One of the tenants is an autobody shop, and there is a non compete clause in their lease so this idea, while good could not exist in this location.  \n10. Brewery\n\nI hope this helps clarify some of the questions that many people had regarding this property. I also never thought this would blow up like it has. Thank you for so many responses and ideas. Its nice to find a community like this to continue to build in.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 226,
    "downs": 0,
    "created_utc": 1738026827.0,
    "media": null,
    "is_video": false,
    "num_comments": 150,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.143014330839707
  },
  {
    "score": 218,
    "title": "You don’t need to solve a problem to start a business. ",
    "selftext": "Most seem to think you need to solve some major problem to start a business. I disagree. Think about how many gas stations are on most exits. Or how many fast food burger places are within a 15 minute radius of any city. \n\nSure, being the first to solve a problem would be ideal, but it often becomes the reason why people never start anything. Don’t let that be your excuse! Adopt the abundance theory mentality. There’s plenty of room in the market for you. Especially when you look at industries that have poorly ran businesses. \n\nJust pick something that you don’t hate. Choose intentional competitive advantages. Test, validate, retest. Get in front of the niche that cares about your competitive advantages. Be humble. Learn everyday. Work hard. And carve yourself out a piece of the pie. \n\nBut most importantly, JUST GET STARTED DOING SOMETHING. Good luck pals",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 218,
    "downs": 0,
    "created_utc": 1737243494.0,
    "media": null,
    "is_video": false,
    "num_comments": 184,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1565299790416255
  },
  {
    "score": 214,
    "title": "With 200k, what is the best business to start?",
    "selftext": "I have 150-200k saved up and I was wondering what the most profitable business would be. I might partner up with someone so budget for buying a business could be doubled. Some ideas I’ve had on this have been maybe buying a gas station, coffee shop franchise (Tim Hortons), or liquor store. I just want to hear some thoughts, experiences, and ideas on starting my a business with 200k without much initial experience. I am located in the Midwest.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 214,
    "downs": 0,
    "created_utc": 1707428288.0,
    "media": null,
    "is_video": false,
    "num_comments": 511,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.392073440403521
  },
  {
    "score": 213,
    "title": "My project made $7,800 in the first 6 months. Here’s what I did differently this time",
    "selftext": "I started building side projects this year.\n\nSome got a few users but they didn’t make any money.\n\nMy latest project is different :)\n\nI launched 6 months ago and it’s my most successful product by far!\n\nI wanted to share some things I did differently this time:\n\n# Habit of writing down ideas\n\nI have this notes map on my phone where I write down ideas.\n\nI made it a habit to always think about problems to solve or new ideas, and whenever I got one I wrote it down.\n\nSo when I decided to build a new side project I had tons of ideas to choose from.\n\nMost sucked but there were at least 3-4 that I thought had potential.\n\n# Validate the idea before building\n\nThis was the most important thing I did.\n\nAfter I had picked the idea I believed in the most, instead of building the project immediately, I wanted proof that the idea was actually good.\n\nBy getting that proof I would know that I’m building something valuable instead of wasting my time on another dead project.\n\nThe way I validated the idea was by posting on Reddit and X, asking to exchange feedback with other founders (this worked for me because my target audience was founders).\n\n# Asking users what they want\n\nNow that I actually had people using the product I could ask them what they wanted from the product.\n\nThis made developing new features and improving the product a lot easier.\n\nI only built things that users told me they wanted. What’s the point of building something if nobody wants it?\n\n# Tracking metrics\n\nHaving clear data of the different conversions and other metrics for my product has been huge.\n- I know exactly how many people I convert to users that land on my website.\n- I know how many of those users become paying customers.\n- I know what actions users should take to increase the chance of them converting to paying customers (activation).\n\nWith all the data it becomes clear where my bottlenecks are and what I should focus on improving.\n\nFor example, in the beginning my landing page conversion was around 5%. I knew I could improve that.\n\nSo I took some time to focus on improving the landing page. Those changes led to a landing page conversion rate of 10%.\n\nDoubling landing page conversion will also lead to about a double in new customers so that was a big win.\n\n# TL;DR\n\nI had a lot to learn before I was able to build something that people actually wanted. The biggest key was validating my idea before building it, but I also learned important product building lessons along the way.\n\nI hope some people found this helpful :)",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 213,
    "downs": 0,
    "created_utc": 1738852433.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7739744007090223
  },
  {
    "score": 213,
    "title": "Overthinking was the reason I failed",
    "selftext": "I was caught in a loop of developing a great business idea in my head, getting a dopamine high for a few hours where I would tell friends or family about my idea, then a few hours or days later, after the dopamine rush ended, I would disqualify the idea without ever acting on it. \n\nMany entrepreneurs have addictive personalities. Most of the time, this is a good thing as it allows them to become obsessed with pushing their business towards success. However, if you haven't started your business yet, there is a risk you will become addicted and obsessed with being your own judge and jury to your ideas and never get past ideation. \n\nThe truth is, I was not content with this state of perpetual ideation. I was increasingly frustrated and running out of ideas to disqualify. I imagine others are feeling the same way.\n\nIf you have experienced this, how did you push through overthinking into action? \n\n&amp;#x200B;",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 213,
    "downs": 0,
    "created_utc": 1713284901.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.964370451670619
  },
  {
    "score": 209,
    "title": "I've built a website that is the IMDB of Youtube channels",
    "selftext": "Youtube is full of quality content but it is sometimes hard to find it so I created [a website](https://www.favoree.io/) where you can rate and review channels and that helps you discover new ones.\n\nThe goal is to make a platform like IMDB or Rotten Tomatoes but for Youtube content. I want to go the opposite direction to Youtube that for instance removed the dislikes on videos.\n\nFor now there are not so many channels but users can submit content and I'm adding more everyday.\n\nI offer you different new ways to discover new content our website: Detailed filters (topic, avg duration, type of video, mood...) / Advanced search / Top similar channels\n\nI would be really happy to receive candid feedback on it and if it is something you could use!",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 209,
    "downs": 0,
    "created_utc": 1676571826.0,
    "media": null,
    "is_video": false,
    "num_comments": 77,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.018266596079159
  },
  {
    "score": 197,
    "title": "Overlooked service business with high demand and no competition",
    "selftext": "Been in the cleaning industry for over a decade. I run a team of 35, and we maintain over 16 million sq. ft. of commercial space annually—about the size of the Pentagon.\n\nOne of the most overlooked (and profitable) services we’ve offered: cleaning commercial kitchen equipment.\n\nMost bars and restaurants have fryers, flat tops, ovens, etc. that are severely neglected. Kitchen staff are too busy or too short-handed to deal with it. And yet, these appliances have to be cleaned. That’s where the opportunity is.\n\nWe regularly charge $350–$750 per unit, and many kitchens have 3–4 units. Hardly any competition in most cities.\n\nExample: we did a retirement home kitchen that hadn’t been cleaned in 5 years. We charged $2,500. They signed up for quarterly visits afterward.\n\nStartup costs are minimal:\n\t•\tCarbon remover\n\t•\tScrapers, pads, and brushes\n\t•\tPump sprayer\n\t•\tTowels\n\t•\tStainless polish\n\nUnder $100 to start. If someone made a basic website and marketed this locally, they could carve out a nice income fast.\n\nHappy to answer questions if anyone’s exploring service-based ideas.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 197,
    "downs": 0,
    "created_utc": 1748377299.0,
    "media": null,
    "is_video": false,
    "num_comments": 77,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.985212491606771
  },
  {
    "score": 196,
    "title": "How to validate ANY business idea before building (and wasting time and money on it)",
    "selftext": "**Experienced Founder/ CEO here.**\n\nMy team and I have bootstrapped an education company from 5k to nearly $1M revenue in 2 years.  \nBut I've had some other business ideas that **failed BIG time**.\n\nThis is what this post is about and how to avoid that failure.\n\nSo, I did try SaaS, even Dropshipping, Amazon FBA, and more. **ALL failed.**\n\nAnd i hope this post helps you to not do the same mistakes that i did when i asked myself \"what online business can i start?\"\n\nI've failed not because these models or ideas of business don't work - but because I've never actually **VALIDATED if there is actually real demand for this.**\n\nI call this the classic rookie mistake for first time founders.  \nAnd I've fallen into the trap multiple times tbh. **(5x to be exact!)**\n\nI've never talked to real breathing human beings one-to-one if they **really** **needed** **this and would spend money on it**.\n\nSo I've blew money that i did not have, a lot of time and energy into a thing that i've build - but - surprise, surprise -nobody wanted it.\n\nHowever is reading this thinking about starting something new I truthfully hope this will not happen to you - now you know this pitfall!\n\n**So what can we learn from this?**  \nWhatever business model or market you pick, make sure you **validate first**.\n\nValidation is just a fancy word for making sure people are **interested** in something(your product/service) - **before** your building your product/service.\n\nLet me say this again:\n\n**Validate First.**  \n**Build Second**\n\nAnd we want to validate **CHEAP** and **FAST**.\n\nok, but how we do that?\n\n**Here's what the smart people do:**\n\nBefore spending a single dollar, create what I call a \"*Smoke Test*\"\n\nWhen plumbers fix pipes, they pump smoke through them first.\n\nIf there's a leak, you'll see the smoke before any water damage happens. - Easy.\n\nAnd in business, it's the same concept:\n\nYou're testing for \"leaks\" in your business idea before pouring in real money (water)\n\n**Example:**  \nLet's say you wanna do a premium coffee delivery subscription service. Ok Great.\n\nInstead of buying inventory and spending your 5k right away, you create a simple landing page that says  \n\"*Rare Premium Coffee Beans Delivered Monthly to you home* *-* ***Join the Waitlist*** \"\n\nThere are **2 ways** to do that:\n\n***You Spend Money:***  \n*Now run $50 worth of Facebook ads to your target audience. (paid)*\n\n*If your don't want to spend any* ***money*** *- you have to spend* ***time***.\n\n***You Spend Time:***  \nfind your people online and tell them something like \"*hi, i'm thinking about to start a monthly Rare Coffee Beans Delivery -- would you be interested -* ***join the waitinglist***\"\n\nIf 100 people view your page and nobody signs up - you've saved yourself $4,950. - happy days - good for you.\n\nIf 30-40 people join your waitlist - you've got **proof of interest - and a business.**\n\nThis is exactly what Dropbox did - they made a video showing their \"product\" before writing a single line of code. Or a more recent example is Elon Musk and his Cybertruck.\n\nDropbox collected 75,000+ email addresses overnight. **(and they did not even wrote a single line of code yet)**\n\nElon Musk collected idk how many emails + 100millions deposits of people overnight. (and he did not build a sigle truck yet)\n\nThat's validation for **true** **demand**.\n\nSo all we do is simply and cheaply collect signs of interest before we get moving.\n\nI feel like a lot pf people are missing this step.\n\nHope this is valuable to you! :)",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 196,
    "downs": 0,
    "created_utc": 1731392094.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8832513142105607
  },
  {
    "score": 192,
    "title": "Rejected from every SWE job to raising $500k to build the anti-Google. Here's my story.",
    "selftext": "In Jan of this year, I was a junior in college struggling to find internships for the summer. Every application I submitted was a shot in the dark...\n\nIn Feb, I got severe neck spasms that had me bedridden for almost a month. I was skipping classes, without a job in a lot of pain feeling hopeless.\n\nI remember searching up questions like \"are chiropractors legit?\" on Google and I kept getting answers from (obviously biased) chiropractic blogs telling me why I should visit a chiropractor.\n\nI realized that today 16 dominant publishing companies dominate search, meaning answers no longer benefit a user but drive publishing companies money. Why should a few companies control our source of information when I wanted to hear from experiences from real people?\n\nAnd then I turned to reddit..I found so many useful life experiences from real people like me. But the problem? There was so much content out there that it was so hard to find the consensus.\n\nAnd that's when I realized I had to build the solution. I spun up a working prototype that cut through the SEO/Affiliate BS and generated crowd-sourced recommendations from Reddit, YouTube and TikTok.\n\nWhile basically bedridden, I sent it to a few friends and they shared it to their friends and soon enough I had over 2k people using it. But here's the catch...I had no money and wellll... these things are expensive :(\n\nFast forward to today, I was recently accepted into a startup accelerator in SF and raised pre-seed funding to build my vision of a more democratized internet driven by the experiences of real people!\n\nAt the end of the day, build things in this world that solve real problems you are passionate about and the rest will align :)",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.72,
    "subreddit_type": "public",
    "ups": 192,
    "downs": 0,
    "created_utc": 1726669461.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7109833148288462
  },
  {
    "score": 177,
    "title": "I made $120 this week from a tiny site I built alone, and I still can’t believe it",
    "selftext": "I launched a tiny site two months ago. It’s a small place where indie makers can share their tools and actually get seen. No endless feeds, no big launches drowning the rest. Just 10 products on the homepage at a time. That’s it.\n\nThis week, for the first time ever, it felt like people *really* got it.  \nIn 7 days:\n\n* $120 in revenue\n* 2100+ visits\n* 300+ users\n* almost 200 products submitted\n\nIt’s not life-changing money. But for me, it means everything.  \nProof that strangers found value in something I made from scratch. Proof that people still like simple things made with care.\n\nI didn’t run ads. No launch hack. Just built in public, listened, and kept going.  \nSome people told me this idea wouldn’t work. That there’s already Product Hunt. That it’s too small.  \nThey were wrong.\n\nI just wanted to create a place where everyone gets a chance, not just the loudest or most followed.\n\nAnd somehow, it’s working.  \nStill learning, still fixing bugs, still replying to every message personally.  \nBut yeah… $120 in a week. That’s wild to me.\n\nIf you’re building something, and you want people to see it, give Top10 a try. It’s small, but it’s growing.  \nAnd it’s built for you.\n\n👉 [https://top10.now](https://top10.now)",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 177,
    "downs": 0,
    "created_utc": 1747238054.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.773346008129966
  },
  {
    "score": 171,
    "title": "I’ve spent a long time figuring out where to find business ideas that actually make money, and here’s what I ended up with",
    "selftext": "Most startup ideas fail because they solve problems nobody cares about. But there’s a place where real pain points hide - niche markets.\n\nLook for manual work - if people complain about Excel, copy-pasting, or repetitive tasks, that’s low-hanging fruit. Every “Export” button is an opportunity.\n\nObserve professionals - join subreddits like r/Accounting, r/Lawyertalk, r/marketing. Their daily routine can become your next SaaS idea.\n\nIgnore \"comfortable\" ideas like to-do apps. Instead, think: \"What would a freelancer/doctor/small biz owner pay $20/month to automate?\"\n\nExample: someone spends hours compiling reports. You build a tool that does it in minutes and charge $19/month. Profit.\n\nI built a small app for myself where I input subreddits I’m interested in, and it analyzes user posts to generate startup ideas. [Try it](https://app.discovry.dev?utm_source=reddit&amp;utm_medium=social&amp;utm_campaign=manual&amp;utm_content=niche), you might find some valuable ideas too.\n\nI’m building it in public, so I will be glad if you join me at [r/discovry](https://www.reddit.com/r/discovry/)",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 171,
    "downs": 0,
    "created_utc": 1745523869.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.676998451243567
  },
  {
    "score": 162,
    "title": "Thinking about converting a decommissioned fire truck into a mobile beer &amp; wine bar – looking for real-world feedback",
    "selftext": "Hey everyone,\nI’m in the early research phase of a potential side business and wanted to get some honest, practical feedback from people who’ve done mobile businesses, event work, or dealt with permits.\n\nThe idea: convert a decommissioned fire truck into a mobile beer &amp; wine bar for private events (weddings, parties, corporate events, festivals). Think taps built into the side compartments, clean plumbing, tasteful branding—not a novelty party bus.\n\nA few things I want to be clear about up front:\n\t•\tThis would be beer &amp; wine only (no liquor)\n\t•\tPrivate events first, not street vending\n\t•\tAll alcohol service would follow state ABC laws (licensed, insured, trained servers)\n\t•\tI’m fully aware this isn’t a cheap or “easy money” idea—I’m trying to understand the real hurdles before going further\n\nWhat I’m hoping to get feedback on:\n\t1.\tHidden costs you ran into with mobile bars or specialty vehicles\n\t2.\tPermit / insurance gotchas people don’t think about early\n\t3.\tWhether the fire truck angle feels like a legit differentiator or more of a headache\n\t4.\tThings you wish you knew before you invested in a mobile/event-based business\n\t5.\tAny “this killed the idea for me” lessons you learned the hard way\n\nI’m not emotionally attached to the idea yet—this is very much a validate or kill it early phase. If you’ve done something similar (mobile bar, food truck, specialty vehicle, event rentals), I’d really appreciate your perspective.\n\nThanks in advance 🍻\n",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 162,
    "downs": 0,
    "created_utc": 1766542856.0,
    "media": null,
    "is_video": false,
    "num_comments": 165,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.019741648423985
  },
  {
    "score": 148,
    "title": "Starting my own business at 18.",
    "selftext": "I am 18 years old and have been doing HVAC for about the last year and a half. I feel unhappy in the work I am doing and feel as though I want to make a change. \n\nI stumbled across junk removal services a few months ago and have been doing some research to gather a better understanding of the whole process. \n\nTo give all of you an idea of my situation right now. I am still living at home with my parents and plan to be for a few more years, they provide everything I need as far as living expenses go. I have a little over $15,000 in my bank account. I own a 2015 Toyota RAV4 that is completely payed off, so I am only paying for the car insurance and any maintenance.\n\nTo get into the whole business side of why I am making this post. I want peoples advice on if it is a smart idea to get into the junk removal business. I would need to buy a truck and a trailer. I also know I would need an LLC, business insurance and many other things(just don’t want to make the post too long). I also understand that finding jobs to do is not an easy task between marketing and actually pricing out the jobs. I really have an ambition to do this but I just want people’s opinions on everything. \n\nSorry for the long post! Thanks in advance.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 148,
    "downs": 0,
    "created_utc": 1704981307.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9512318979401146
  },
  {
    "score": 143,
    "title": "If you have $500k, what business would you start or buy?",
    "selftext": "Title says it all, what business would you start or buy if you had $500k. Been contemplating becoming my own boss. Tried building an app, which went nowhere. I'm considering something where I can run the business day-to-day, keep me busy while I'm not gofling.\n\nI know restaurants are a tough, tough business. However, being from the nordics, I have thought about maybe opening a small to-go type of restaurant, focusing on smørrebrød type of dishes. There is a place I visit when I'm in Denmark that I very much enjoy and wish I could have it here. Problem is, I know nothing about the restaurant business nor have I ever worked in one.\n\nSo, back to the original question, if you have $500k to dispose of, what business would you either start or look to buy?",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 143,
    "downs": 0,
    "created_utc": 1752433532.0,
    "media": null,
    "is_video": false,
    "num_comments": 353,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.145364123108143
  },
  {
    "score": 145,
    "title": "A Public Directory of Startups With Verified Metrics",
    "selftext": "I have watched founders post fake screenshots of traffic and/or revenue metrics for too long.\n\nAs a result, I built [TrustTraffic.co](http://trusttraffic.co/) that relies on verified data instead of screenshots.\n\nThis platform lets website owners add their startup and connect GA4. The system pulls the real traffic numbers and publishes them publicly. There is nothing to edit or massage. The data shown is the actual data.\n\nAt the same time, I also built [TrustMRR.co](http://trustmrr.co/) Similar but allows people to verify their revenue through Stripe, Dodo, Polar, or LemonSqueezy. \n\nIdeas or feedback would help a lot. If you have a site would love to see it added :)",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 145,
    "downs": 0,
    "created_utc": 1764445745.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.365897849280409
  },
  {
    "score": 144,
    "title": "Why I believe selling \"shovels\" is safer than digging for gold with AI.",
    "selftext": "If you are brainstorming business ideas for 2026, it feels like everyone is rushing to build the next AI wrapper. But from where I stand, I think there is a safer path.\n\nI work in the data industry, and I’ve noticed a pattern. The market seems flooded with \"Brains\" (the AI), but it looks starving for \"Hands\" (the tools).\n\nHere is my thinking: An AI is amazing at understanding a request. But it actually struggles with the boring, repetitive work. If you ask an AI to go visit 1,000 websites to find the best price, it often gets blocked or costs a fortune to run.\n\nTo me, it seems the AI doesn't want to do the hard work itself. It prefers connecting to a simple, reliable tool that does it for it.\n\nSo instead of trying to compete on the \"Intelligence\" layer, I think the opportunity is in the \"Action\" layer. Building the unsexy tools that handle the boring tasks like collecting data or formatting files.\n\nEveryone is trying to sell the gold. It might be smarter to be the one selling the shovels.\n\nWhat do you think? Does this make sense to you?",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 144,
    "downs": 0,
    "created_utc": 1765308490.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6677469180757623
  },
  {
    "score": 130,
    "title": "If you had 20 million dollars and your goal was to turn it into 100 million in five years, what would you do?",
    "selftext": "Imagine you have 20 million dollars in your account. This is your own capital. No outside investors. No loans. No obligations. Just you and a five-year goal to reach 100 million.\n\nHow would you approach it? Would you focus on a single big idea or spread your bets across multiple industries? Would you go into tech, real estate, private acquisitions, manufacturing, e-commerce, or something completely unexpected?\n\nCurious to hear how others would think about this. Especially if you have experience building and scaling businesses or making significant returns. Assume you have access to global talent, tools, and markets.\n\nWhat would your playbook look like starting today?",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 130,
    "downs": 0,
    "created_utc": 1747562464.0,
    "media": null,
    "is_video": false,
    "num_comments": 411,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.069719903672332
  },
  {
    "score": 126,
    "title": "Please Steal This Idea pt 2",
    "selftext": "Last week I posted about a [business idea for cleaning solar panels](https://www.reddit.com/r/Business_Ideas/comments/1aq9nzz/someone_please_steal_this_idea/), which got a ton of great feedback. figured I'd continue to share some ideas with this awesome sub.\n\n**Background:**\n\nDelivery fees are really high for customers and restaurants. Delivery drivers aren't getting paid enough.\n\n**Business Idea:**\n\nI discovered a guy (Tony (*no affiliation*)) that launched his own delivery service. No apps, no high fees, and no car?? (he has a bike) I fell in love with this because it addresses an issue that many of us have. This can also be tested and launched in a weekend!\n\n* Tony sets \\~1.5mile radius boundary for the restaurants he serves and delivery area.\n* Tony only charges $5/order\n* Tony is his own boss\n* Tony is my man crush\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2pkz450hazjc1.png?width=984&amp;format=png&amp;auto=webp&amp;s=e14d79f3f4ca6f3785ef2c1bdd8918fd5ffb6906\n\n## The MVP\n\n**STEP 1:** Go to your Facebook Neighborhood Group and post exactly this. “I’ll deliver anywhere on this map (screenshot), from these restaurants (provide list, assuming they take online paid pickup orders) for $5 flat.\"\n\n**STEP 2:** You will get orders. I’d give someone $5 RIGHT NOW to get a burrito for me)\n\n**STEP 3:** Go get the order (that's already paid for) and deliver it to the buyer\n\n**STEP 4:** Accept your $5\n\n**STEP 5:** Don’t mess the previous 4 steps up. **Repeat**\n\n# So how much could you actually bring in being the taco transporter?\n\nTony operates in a 1.5 mile radius. Let’s break down his possible earnings per day:\n\n3 deliveries a day: $15\n\n* 10 deliveries a day: $50\n* 20 deliveries a day: $100\n* 30 deliveries a day: $150\n\nLet’s say the average delivery is 2 miles round trip let’s say that takes \\~20 min. If every restaurant and customer were at opposite ends of the delivery map, he could pump out 3 orders per hour. I think Tony is a great biker and finds efficiencies, **he can probably do 5 deliveries/hour = $25/hour on bike.**\n\nNot bad, counting he can start/stop whenever, probably receives tips and can probably do more deliveries if he used a car/expanded his area.\n\n**He’s easily clearing $100/day on bike with very little upfront cash and technical skills. This is fantastic if you just need to get some cash going** (and possibly love biking)\n\nIf you (or Tony) wanted to scale this into something bigger:\n\n* You could also be making referral dollars for adding restaurants to your service area.\n* You could expand your area/add more delivery drivers\n* You can run sms ad campaigns with all of the phone numbers you have stored\n* You could add local shops for “last mile deliveries”.\n* You could turn this into a full fledged enterprise (like [*B-Line*](https://flight.beehiiv.net/v2/clicks/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1cmwiOiJodHRwczovL2ItbGluZXBkeC5jb20vP3V0bV9zb3VyY2U9d3d3LnRoZWdob3N0YnVzaW5lc3MuY29tJnV0bV9tZWRpdW09cmVmZXJyYWwmdXRtX2NhbXBhaWduPWJlY29tZS15b3VyLW93bi1kb29yZGFzaC10b2RheSIsInBvc3RfaWQiOiIxMTY3YTRlYi03YzZjLTQ0MzItYmI0Yi0zMzkwMjBiNzI0NWYiLCJwdWJsaWNhdGlvbl9pZCI6ImI5YzJlOGM1LWU3YmMtNGQyOS05MjJlLWFmMWIwMWZkOTIxNyIsInZpc2l0X3Rva2VuIjoiNDExNzZkMjktYTIyNi00NDNmLWFmODEtZjFlMTcwMDAyOWE1IiwiaWF0IjoxNzA4NTM4MzE5LCJpc3MiOiJvcmNoaWQifQ.vVeziK_saY5tpOGsVTX5GgK0k3u2pe_HTgnldsPBYPI)) in Portland, OR that specializes in reduced carbon (last mile) deliveries, have warehouses and [run ads](https://b-linepdx.com/services/advertising-and-promotion/) on their bike carriers.\n\nIf you do decide to test/run with this, please let me know! I would love to learn how it goes (I'll also order a burrito)",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 126,
    "downs": 0,
    "created_utc": 1708540420.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.64803794874575
  },
  {
    "score": 119,
    "title": "Once you make your first dollar while you sleep, you will become addicted to chasing that feeling.",
    "selftext": "$167 is not a life-changing amount of money, but the feeling you get when you see that you did maybe one hour of work the whole month… Will change your life. \n\nThe screenshot above is from an Etsy store where I saw digital prints. \n\nLet this be your your first business/project you actually launch, and makes you money. \n\nStep one is kind of obvious… Find a niche. \nA market place like Etsy is obviously great because there are a lot of people looking to buy some thing. \n\nStep two… Figure out what kind of digital prints you can make… Inspirational quotes,  some kind of art… Whatever you are interested in other people probably like to… And probably would buy some art that they could simply print online. \n\nStep three… if you’re not an artist, that is absolutely not a problem. I found someone on Fiverr to draw illustrations. I pay him probably $5 to $10 for what I want. Then I listed on Etsy for $5 dollars so I only need one person to buy the print for me to breakeven, and every single other person that buys the print is profit. \n\nIf you are like me and you have a lot of ideas you want to get off the ground. Start here. \n\nBecause like I said once you make your first dollar - you will chase the feeling. \n\nYour decision making on everything else is different.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1706892355.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6846186738838704
  },
  {
    "score": 111,
    "title": "42% of startups fail because of this.",
    "selftext": "The #1 killer of startups isn't:\n\n* Running out of cash\n* Competition\n* Poor marketing\n\nIt's building something nobody wants.\n\nCB Insights analyzed 101 startup post-mortems and found that 42% failed due to \"no market need.\"\n\nThink about that.\n\n4 out of 10 founders spend months (or years) building products...\n\nOnly to discover nobody wants them.\n\nThe solution?\n\nTalk to your market BEFORE writing a single line of code.\n\nIt sounds obvious, but here's the thing:\n\nMost founders skip this step because they're \"certain\" about their idea.\n\nReal example:\n\nWhen building Buildpad, we could have jumped straight into development.\n\nInstead, we:\n\n* Talked to founders\n* Understood their specific challenges\n* Validated our solution\n* THEN started building\n\nResult?\n\nWe launched 3 months ago and have 3000+ founders on our platform.\n\nWhy? Because we built something people actually wanted.\n\nHere's a simple way to start:\n\nSay you got an idea for a SEO tool.\n\n\\&gt; DM 10 people actively using SEO tools\n\n\\&gt; Ask about their challenges\n\n\\&gt; Present your solution (the idea)\n\n\\&gt; Listen to their feedback\n\nThe market will tell you if you're onto something.\n\nDon't be part of the 42%.\n\nValidate first, build second.\n\nYour future self will thank you.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1736087374.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4483188847036788
  },
  {
    "score": 111,
    "title": "Anyone Here Ever Started a Faceless YouTube Channel? Share Your Experience!",
    "selftext": "Hey everyone,\n\nI’m thinking about starting a faceless YouTube channel. You know, the kind of channel where you don’t show your face at all—maybe using animations, stock footage, or just voiceovers instead. But honestly, I’m still a bit clueless about how to get started and what it really takes.\n\nSo, I’d love to hear from anyone who’s been down this road:\n\n1. What’s your experience like running a faceless channel? What challenges did you face?\n2. Were there any fun or rewarding moments along the way?\n3. What have you gained from your channel so far—whether it’s income, skills, or even unexpected surprises?\n\nI’m considering this because I feel more comfortable behind the scenes rather than in front of the camera, but I still want to be productive and explore the YouTube world. Your stories and advice would mean a lot to me (and maybe help others who are thinking about the same thing).\n\nThanks in advance for sharing your thoughts! 😊",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1736826537.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.745960532109506
  },
  {
    "score": 110,
    "title": "finding your Niche takes time",
    "selftext": " Your niche finds you. However, you can't expect it to fall into your lap. You need to take action and do...take risks, get comfortable being uncomfortable, and put yourself out there. You will feel it, and people will validate it when you're in your niche zone through their reactions to seeing you in your zone.\n\nStop researching and just start on something. You need to train your mind and body to consistent activity. A lot of people, including myself, fall into the mind trap of constant thinking and research. They get excited about an idea for a few days and then, in their mind, disqualify the idea and repeat that cycle until they are paralyzed with anxiety.\n\nI found my niche after 20 years in different fields/disciplines. During that time, I thought I had found my niche several times. Each time I would end up burnout or hating what I was doing. Although moving on from each niche was tough, I learned a lot about myself, and looking back, the journey was worth it. It all starts with action.",
    "subreddit": "Business_Ideas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 110,
    "downs": 0,
    "created_utc": 1712938497.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4779285996424605
  }
]