[
  {
    "score": 5654,
    "title": "I just turned 40 , have worked at top companies and made a bunch of mistakes - here is what I wish I knew 20 years ago",
    "selftext": "I started my career at big-name companies, climbed the corporate ladder, and did well financially. But looking back, I realize how much I could have done better. If I could sit down with my 20-year-old self, I’d say:\n\t1.\tForget stock-picking—just buy S&amp;P 500 ETFs and let compounding work its magic. I wasted time and money thinking I could beat the market. I couldn’t.\n\t2.\tYour salary matters, but how much you keep matters more. Lifestyle creep is real. I know people making millions who are broke.\n\t3.\tNetworking isn’t sleazy—it’s how things actually get done. Build real relationships, help people without expecting anything in return, and opportunities will come.\n\t4.\tNo one cares about your job title. They care about whether you’re a decent person to work with.\n\t5.\tYour health is worth more than any paycheck. Working out and eating well will give you energy that money can’t buy.\n\t6.\tTime with your family is priceless. Your kids won’t care how much you worked, but they’ll remember if you were there.\n\t7.\tMost “urgent” work crises are forgotten in a week. Don’t let them ruin your day.\n\t8.\tDon’t wait for some magic number to “be happy.” If you can’t enjoy life now, more money won’t change that.\n\nWhat’s the best financial or career advice you’ve ever received?",
    "subreddit": "consulting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 5654,
    "downs": 0,
    "created_utc": 1741332375.0,
    "media": null,
    "is_video": false,
    "num_comments": 198,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Primarily a numbered list of personal career/financial advice items.",
    "composite_score": 5.644359147466327
  },
  {
    "score": 3206,
    "title": "I left consulting and this is what my manager told me",
    "selftext": "After three years, one promotion, a lot of hard work, long hours and eventually burn out I decided to quit consulting. I was staffed on a complex C-level project at a MNC as a team lead and we had not enough budget nor expertise. It was a total horror project. I did not receive any support from my manager nor partner even though I asked for help on weekly basis. I was always told that they will see what they can do. I could not take it anymore and I jumped the ship because I knew that nothing will change.\n\nI announced that I am leaving and my partner stopped talking to me from that day. He was always friendly to me, we went to eat lunch together etc. and then suddenly I stopped existing to him.\n\nThen on my last day at this firm my manager came to me and told me that if he knew that I would leave he would have never invested so much time in my development and that he would have never let me lead such an important and prestigious project (idk what that's supposed to mean). He never really done anything for my development except for giving me tons of responsibility and no budget.\n\nI felt like I left a cult, I never felt so free. Its just business, nobody cares about you and you should not care about the firm either. If you feel unhappy do not waste time thinking that things will get better. Its most likely not going to happen. When you see the opportunity to jump the ship - do it.",
    "subreddit": "consulting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 3206,
    "downs": 0,
    "created_utc": 1740491809.0,
    "media": null,
    "is_video": false,
    "num_comments": 144,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Narrative venting about a toxic consulting experience with emotional emphasis.",
    "composite_score": 5.329282961045927
  },
  {
    "score": 2473,
    "title": "DOGE is acting like the world's worst consultants",
    "selftext": "The DOGE department that Musk is running is acting like the world's most stereotypical consultants. Using a bunch of smart young people but who have zero experience in anything, doing things they know nothing about, and/or announcing findings without validating them. \n\nI find irony in the fact that DOGE/Musk also canceled all government consulting projects when his team is now doing it, but likely in a far worse way than consultants do. ",
    "subreddit": "consulting",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 2473,
    "downs": 0,
    "created_utc": 1739901771.0,
    "media": null,
    "is_video": false,
    "num_comments": 244,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Critical opinion about DOGE consultants with emotional stance.",
    "composite_score": 5.2779827374753685
  },
  {
    "score": 2411,
    "title": "Why are so many young people leaving the profession? I'll tell you. ",
    "selftext": "For context, I'm Director at Big 4, in my early 30s based in London. My experiences aren't going to be the same as everyone else's and this post is not meant to be a universal answer to attrition or job satisfaction within the industry, It's a reflection on my time within the consulting industry and the changes I have seen since starting out:\n\nI am increasingly asked the same question by senior management within my department: 'Why don't our consultants want to stay with us past the junior grades?', 'Why do they keep moving out to worse paying, less dynamic jobs?', 'Why do we keep haemorrhaging the experience we have built within the team?'. Senior (read older) figures are flabbergasted that junior staff would want to leave this industry for seemingly mundane jobs elsewhere. \n\nThe simple answer to all of these questions is: 'Consulting is not what is once was'. \n\nIt's not the same career as when they started out, it's not even the same career as when I started out. \n\nConsulting used to be a pretty good gig. It was (broadly) well thought of, well paid, dynamic and interesting and had great career prospects should you be successful. However the attributes that once made this a top tier career have gradually been eroded by greed. Below I will list the key changes through the course of my career which I believe have contributed to the devaluation of consulting as a career choice. \n\n1) The Loss of Perks - The often touted lifestyle of a consultant used to be attractive to many young people. Flying all over the continent, dinners with clients, nights out with the team in far flung destinations, adventure and life experiences. Certainly, looking back even 10 years ago, consultants used to have a plethora of travel and social opportunities should they desire. \n\nIt made the tedium of correcting a PowerPoint for the 17th time bearable, it made visiting irritating clients worth it and it afforded us the opportunity to visit places we would have otherwise probably not chosen to go. Granted, most of the time it was a budget flight, a visit to a commercial estate out of town, a dinner and a drink in an average restaurant and then a fitful night of sleep in a three star hotel. But on occasion, the stars aligned and some truly amazing memories were created. Not to mention the tangential benefits of accruing points for your chosen airline of hotel chain for personal use later. \n\nBut now, corporate cards are reduced to ornaments, travel is restricted under the dubious auspices of ESG and any activity outside of what is deemed strictly necessary is deemed to be an excess too far. All in the name of the bottom line. \n\n2) The Loss of the Collegiate Environment - I'm prepared to be hounded by the angry 'WFH Mafia' on this one so I will preface this by saying that I know that the office environment isn't for everyone. However, I strongly believe that bonds between colleagues, especially at the genesis of a career is incredibly important for a feeling of overall job satisfaction. This may be a bit of an outdated idea, and perhaps leaves me open to accusations of being a dinosaur but I'm willing to live with that. \n\nI'm not looking forward to coming to work to create shareholder value, I'm not looking forward to coming into work to interrogate a spreadsheet, to have a call with a client or even to make a presentation to a Partner. I'm looking forward to coming into work because my colleagues make it bearable. Constantly tapping away from in front of my screen on my kitchen table in a shared flat is more depressing than 1000 cringe pizza parties. Once again, I appreciate that this doesn't apply to everyone, but I know for a fact that some, especially more junior consultants, genuinely want the opportunity to have the office team experience on SOME DAYS. \n\nBut, even if they wanted to, they can't. Cutbacks in office space and the introduction of extreme hotdesking mean that fostering this kind of environment is increasingly impossible. Want to get an area for your team? Good luck - try booking it three months in advance. Teams can no longer come into the office and confidently  expect to be sat within 20 meters of one another. It's incredibly difficult to foster any sort of Team camaraderie.\n\nWithout colleagues or perks, the stark reality of the job creeps in, consultants realise that the extent of their job is actually just copy, paste and ppt creation. There is nothing to mask it, and without the mask, the career is farcical.  \n\n3) The dilution of the Partner Grade - Whilst not in the front of mind for everyone, a significant number of consultants come into the business with the aim of one day becoming a partner. Partners make the big bucks, they take a home a share of the profits and they get to direct the running of the practice. It's a milestone in your career, a reward for all the hard work. Right? Well, it used to be.\n\nThe above description more accurately describes the Equity Partner position within most firms. In order to ensure that these equity partners are insulted from profit share dilution associated with increasing their ranks, 'Junior' or salary partner positions have been created within most firms. These are partners in name only, they do not receive a profit share and they aren't on the Partnership agreement. \n\nIn practice, you are now going to be waiting much longer into your career before you get any sort of 'slice of the pie'. And that's if you are lucky enough that the existing Partners don't sell you out to private equity before you get there. \n\nFor a lot of people it's just not worth it without the goal of partnership within a reasonable amount of time. \n\n4) Decrease in Value - Finally, I have seen a steady decrease in the value (or at least perceived value) delivered to clients. Increasingly, consultants are seen as chancers who come in, tell the client what they already know and then bill large amounts of money without creating any real value. This used to be a meme, a funny joke, not something reflected in reality. But as Partners or Shareholders continue to look for dollars and cents on the bottom line, I have seen a real and sustained decrease in the value of the work provided to clients. Corner cutting, over promising, generic delivery and overbilling have all become more prevalent over the past 10 years (anecdotally of course).\n\nA downturn in the value of our product perpetuates the stereotype of consultancy as a career for frauds, drives talent out of the industry and thus increases the chances of poor quality work in the future. A vicious cycle and a self fulfilling prophecy. \n\n/TLDR and in Conclusion: Consultancy is no longer attractive to young people, due in large part to greed: It has been stripped of its perks, had it's career trajectory blunted and its reputation left in tatters. \n\n\n\n\n\n\n\n",
    "subreddit": "consulting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 2411,
    "downs": 0,
    "created_utc": 1723652895.0,
    "media": null,
    "is_video": false,
    "num_comments": 417,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Enumerated analysis of changes causing devaluation of consulting; listicle format.",
    "composite_score": 5.3979654443556315
  },
  {
    "score": 1791,
    "title": "Everyone who exits consulting",
    "selftext": "https://preview.redd.it/p1wxi9jerwpe1.png?width=700&amp;format=png&amp;auto=webp&amp;s=bcadec46a5fd0395c416d88afdd3cea4210ed8e9\n\nI was building 12 decks a day. 10, 15 client meetings every day. I took the consulting thing as far as I could. But then I started to ask myself, what is this all about? Why am I so interested in making the client happy?\n\nThen I got it - maybe I want to BE the client. I want to be the one asking stupid questions. I want to ask myself for more data. I wanted to leave stickies on MY slides.",
    "subreddit": "consulting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1791,
    "downs": 0,
    "created_utc": 1742504097.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Personal reflection with an insight about shifting from consultant to client mindset.",
    "composite_score": 4.915262550694734
  },
  {
    "score": 1588,
    "title": "My grandma found out I got laid off from PwC",
    "selftext": "I did record it and post it everywhere though so she has a point. Good luck fellow consultants- may AI not take your jobs like it did to mine. \n\nif you are experiencing anxiety about a potential layoff or it’s already happened to you - it’ll be ok. It was the best thing that’s ever happened to me, it kickstarted my whole business entrepreneurial journey. \n\nSo take a second and listen to yourself, are you really going for that partner track? or is your own destiny somewhere else’s? \n\nI used to believe I was gonna make partner, but I found I liked the idea of having my own business (the allure of being a partner to me was owning the business, running it).\n\ncurious what you all think about our seemingly shrinking / ai automatable industry. For me it was the best place to learn business quickly and hard work ethic. Lots of great connections with amazing people too. Just wish some things were different in the consulting industry to encourage less shark vs shark behavior and bad culture. ",
    "subreddit": "consulting",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 1588,
    "downs": 0,
    "created_utc": 1746642626.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Personal story with insights on AI impact and entrepreneurial pivot.",
    "composite_score": 4.741625569024779
  },
  {
    "score": 1428,
    "title": "Most women in consulting are gone by their 30s. Why?",
    "selftext": "Watching another brilliant working mom quietly exit the partner track this month. She was crushing it until she had kids, then suddenly every promotion conversation became about \"work-life balance\" and \"maybe try a local office role.\"\n\nSame pattern every time: travel becomes impossible, male peers advance while she's managing an \"impossible\" juggling act, zero role models who've actually figured this out.\n\nThe frustrating part? She didn't want to leave. Loved the work, great at it, strong network. But the system pushed her out right when she should be hitting her stride.\n\n**For those who've navigated this successfully - what actually worked?**\n\nAnd for firms lurking here - what would it take to keep your best talent instead of watching them walk away?\n\n**Edit / spoiler alert:**  Some replies have implied that I'm an AI bot. I’m very much a human and a retired consulting director and a mom. The fact that some people would rather believe a bot wrote this than consider a woman’s perspective says a lot.  The comments here have been eye-opening : some insightful, some dismissive, and unfortunately, some blatantly sexist. If your first instinct is to discredit or dehumanize instead of engaging with the topic, that says more about you and highlights the core problem that I'm trying to drive discussion about which is about systemic solutions and creative ideas.  ",
    "subreddit": "consulting",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 1428,
    "downs": 0,
    "created_utc": 1753182965.0,
    "media": null,
    "is_video": false,
    "num_comments": 475,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Analytical discussion of why women exit consulting and what could improve retention.",
    "composite_score": 5.176335705151217
  }
]