[
  {
    "score": 1230,
    "title": "Got replaced by AI. CEO regretted it and asked me back.",
    "selftext": "So, here’s a story about how I got replaced by AI and junior copywriters, only for my old CEO to come crawling back. Spoiler alert: I didn’t go back.\n\nI used to work as a copywriter for this company. The CEO decided to replace me with beginner copywriters and AI-generated content to save costs. He was convinced that AI tools like ChatGPT could handle everything, from blog posts to social media, without human input. I tried explaining to him that AI doesn’t always get it right, especially for niche industries or clients with physical products. For example, some of our clients sold stuff like electrical tools (wrenches, screwdrivers) or machine parts (bearings, etc.), and ChatGPT would often recommend the wrong products or include inaccurate details. Clients had to correct us all the time.\n\nI told him some tasks required real research and manual effort to ensure accuracy. But he drank the “AI can do it all” Kool-Aid and decided I wasn’t necessary. He even asked me to hand over my prompts. The ones I use to create engaging social media posts and blogs. At that point, I could see the writing on the wall. So, I only gave them a watered-down version of my prompts, keeping the advanced ones to myself. Here's a tip: Never give away your secret sauce. It’s your edge, especially in marketing.\n\nWhile training the junior copywriters, I pointed out that certain things needed to be done manually. Though some of those tasks could’ve been automated if you actually knew how to use AI properly. But I wasn’t wrong about one thing. To write well for a client, you need to understand their business and do real research, not just rely on ChatGPT to spit out content.\n\nFast forward to when the juniors thought they had my process somewhat figured out (spoiler: they didn’t). The CEO decided I was expendable and fired me. He went all in on cheaper labor and AI.\n\nI kept tabs on the company after I left and, honestly, the content they were putting out was embarrassing. The blog posts and social media were just... bad. The difference between my work and theirs was obvious. And the client got mad and asked for a refund.\n\nTwo weeks later, HR reached out to me. Apparently, the CEO realized his mistake and wanted me back because he was impressed with my results (the ones he’d taken for granted). I felt vindicated, but there was no way I was going back. By then, I had decided to go full-time freelance, and things were already looking up. I have two clients now and a potential third lined up.\n\nMoral of the story: Don’t let anyone devalue your work or your expertise. AI is a tool, not a replacement for skill, experience, and understanding. And never, ever hand over the keys to your kingdom.\n\nFYI. This whole thing I am writing is \"aided\" by AI. Take note, \"aided\" by AI, not generated by AI. There's a difference. What I am doing here is blabbing about whatever comes to mind and using GPT to restructure what I am saying. Most of this was me talking into the microphone, and GPT was used to refine my post. This is another way of creating a post. Say whatever you want and use GPT to restructure.",
    "subreddit": "copywriting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1230,
    "downs": 0,
    "created_utc": 1732681534.0,
    "media": null,
    "is_video": false,
    "num_comments": 140,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.62,
    "category_rationale": "Personal story with emotional frustration about being replaced by AI and low regard for the CEO's decision.",
    "composite_score": 4.892367609259006
  },
  {
    "score": 578,
    "title": "After earning minimum wage my whole life, I just got my first job for $70,000! Thank you r/copywriting",
    "selftext": "I've been working in retail most of my life for minimum wage.\n\n2 years ago I was laid off during covid. I watched many of these 'top jobs to make money online' on Youtube and heard about copywriting. I then asked a million questions on this subreddit, showed off my bad copy, got told i'm crap then gradually got better and better (New account so you can't see my old posts).\n\nI watched so many youtube videos, read copywriting books, completed Udemy courses and read through inspirational Reddit posts. I practised and practised until I started getting work on Upwork and Fiver, my aim was to make $100. I did this after a few weeks, the agent then gave me more and more work until I earned my first $1000.\n\nI looked at so many paid courses from people like Kyle Milligan. He puts out many great free yt videos that you kind of get the point from his courses (Make the product seem: New Easy Safe and Big. You don't need to pay for anything, the internet is the best free tool out there and r/copywriting has some really talented people who are direct yet helpful. Most of the people trying to sell you courses are copywriters with a niche in copywriting - Meaning they are just trying to sell to desperate people looking to 'make an easy 7 figures online'. Their whole career is selling to you. You are their niche. - some people on here have benefitted from these courses, but realistically just save your money. \n\nI was freelancing and happy even with 0.08c a word but I was getting experience. I was feeling very lonely working only online and hardly seeing anybody except over Zoom. I was also tired of becoming an expert on different products and once the project was done, the info would be useless. I also didn't enjoy selling myself, cold emailing, and constantly bidding for jobs.\n\nI wanted to become an expert on one product and then sell the hell out of that product.\n\nI  recently applied for a full-time copywriting job in cyber security randomly after a client told me he went with a copywriter offering a lower fee than I offered.\n\nI sent a few samples to an employer I found on LinkedIn. After 2 interviews they called me today with an offer of $70,000 and a lot of other perks starting next month.\n\nI would never be here if it wasn't for you. There are many grammar/spelling mistakes in this post because I'm currently celebrating with a big bottle of wine. My life has changed, I no longer need to scan prices and choose the cheapest things in the store. This is the beginning of my career.\n\nThank you r/copywriting",
    "subreddit": "copywriting",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 578,
    "downs": 0,
    "created_utc": 1676576123.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Shares a career journey with insights about how to approach copywriting and what to focus on for success.",
    "composite_score": 4.432103109096063
  },
  {
    "score": 508,
    "title": "It finally happened. After 25 years of steady, in-house work, my position was just eliminated.",
    "selftext": "This isn't an easy post to write, but I feel like I have to. \n\nIn short: My position was just eliminated at my company. I'm only going to be working until the end of the month. So I'll need to find work again ASAP. \n\nIn long...I'm terrified. Absolutely gutted. Not just because I'm suddenly out of work again for the first time in six years, but because I don't know what I'm supposed to do now. \n\nI loved this job, I liked this company a whole awful lot, and I had hoped to stay there long enough to eke out something like a retirement from it. \n\nBut not now. All gone.\n\nI'm assured this wasn't performance-based. I was told it was for financial reasons. And I believe that. I've received nothing but glowing performance reviews and the maximum merit-based yearly wage increases during my entire tenure at this company. My soon-to-be former boss is a genuinely good guy, and has always been straight with me. He still was today. He was REALLY upset during the Teams call with HR.\n\nEven so, this job wasn't just what I did. It was WHO I AM. I've been writing full-time for 25 years. The last year and a half, I've been my company's Content Manager. But now, a craft to which I've dedicated my life is being taken over nearly wholesale by AI and content mills. And not just at in the global sense. That's literally what's happening at my company. \n\nI guess I should have seen it coming, though. I've been \"spearheading AI productivity initiatives\" for months. Creating workflows, writing out best practices documentation, and getting unqualified folks with no real copy or content experience trained up on our products in case we needed to give them \"overflow\". So I should have seen the (literal) writing on the wall in terms of training my replacements, robot and otherwise. \n\n(Not to mention that I've long worried that the classic Venn diagram of \"Cheap, Fast, Good: Pick Two\" would eventually bite me in the ass in a general career sense, since most of the decision-makers who wouldn't know good copy if it slapped them in the face only give a tenth of a tin shit about the first two.)\n\nUltimately, I just have no idea where to go. I'm sad, scared and angry. \n\nThankfully, content management is still a somewhat viable career field, I guess. Even in the most automated workplace settings, they still need humans to babysit the robots; to keep them running. There are jobs out there, and I'm going to aggressively pursue them...largely because I have no choice. I'm also getting a tidy severance package — one that will just about wipe out my credit card debt, which is a VERY slim silver lining. I can likely also apply for unemployment. So there's that. \n\nBut overall, I'm just crushed. Broken. Beaten down by capitalism. Torn up by the constant pursuit of profit over people, the understanding that this is the most dismal job market in years, and the ever-present knowledge that no matter how good you are at your career, at any given time, some wonk with a red budget pen can just click a spreadsheet and drop a virtual dirty bomb into your entire life. Then go on with their day like it's nothing. Because it is nothing. To THEM, at least.\n\nIf you've read this far, I appreciate you. But I also need help, which is something that I am characteristically LOATH to ask for, even under the most dire of circumstances. Please, I beg of you: if you know of anyone who is hiring for a Content Manager, Creative Director, Social Media Manager, Marketing Manager, or (I'll take a step down if I have to) Sr. Copywriter, PLEASE refer them to me. I know it's a tall order. I know I'm likely boned. And I know we're ALL pretty screwed lately, since creative jobs are dying out fast thanks to the \"aY-EyE rEvOLuTiOn\", but — this is all I know. It's all I'm good at. And I can do it in my sleep. Plus, I can't really \"pivot\" at 50, y'know...? \n\nThank you for reading. And may we ultimately triumph over the goddamned clankers. ",
    "subreddit": "copywriting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 508,
    "downs": 0,
    "created_utc": 1755144379.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Emotional distress about job elimination and AI replacing a lifelong role.",
    "composite_score": 4.458429660080234
  },
  {
    "score": 498,
    "title": "I closed $136K in copywriting work last month. Trust me: AI isn't replacing great copywriters any time soon.",
    "selftext": "I've been seeing a lot of despair in the copywriting community as more and more clients are choosing to go with ChatGPT over copywriters.\n\nI've put myself in rooms with AI thought leaders this year, and here's the conclusion I've come to:\n\nAn unskilled writer can get ChatGPT to write \"good enough\" copy pretty easily now. As a tool, it's improved a lot since it took LinkedIn by storm in 2023.\n\nHOWEVER...\n\nI am yet to see amazing copy created on ChatGPT without being prompted and then heavily edited by someone who understands:\n\n- stages of awareness\n- market sophistication\n- how to tap cognitive biases \n- messaging hirearchies\n- voice and tone\n- connection-provoking storytelling \n- how to facilitate mindset shifts\n- voice-of-customer\n- how to read like a warm-blooded human\n\nI'm sure there's a word for someone who has mastery over all that...\n\nOh yeah... a COPYWRITER.\n\nThe reality is, if you only want to be a \"good enough\" copywriter, you might struggle to find gigs now.\n\nBut the clients you want - the clients who pay me $50k to write and optimize their funnels - they sure as helvetica aren't settling for \"good enough\".\n\nSo if AI is making you despair, either try your hand at something else (leaving *a lot* of money on the table)\n\nOR commit to getting darn freakin' fantastic at strategizing, writing and editing copy. And then use those skills to start selling to clients who love to pay for the best. \n\nBecause while we can't predict what AI will be able to do in 10 years, there's still plenty of copywriters making hay in 2025.\n\nJanuary was my first $50k/month. Not because I've stumbled onto a big secret that makes the best. But because AI has forced me to nail my process and put my prices up so I'm not competing with ChatGPT or other copywriters. \n\nIf you also have goals to make 2025 your best year yet, I really hope you do the same. ",
    "subreddit": "copywriting",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 498,
    "downs": 0,
    "created_utc": 1738500815.0,
    "media": null,
    "is_video": false,
    "num_comments": 291,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Argues that AI won’t replace great copywriters and explains what distinguishes top-tier work.",
    "composite_score": 4.583291971347599
  },
  {
    "score": 414,
    "title": "AI took my job… to the next level. ",
    "selftext": "For those worried about AI…\n\nI am in-house copywriter for a Fortune 500 company and I just got promoted. I’ve also hired a junior writer. We both use chatGPT as part of our creative writing process. \n\nOur team has never been more productive.\n\nWill they one day replace us all with AI? Who can really say. But in my experience, writers + AI are more creative &amp; productive than AI alone. \n\nWe’ve proven it.\n\nEdit: I should add my company has given everyone access to GPT (enterprise model). I’ve fully embraced it and have even championed others to try it. It’s not the elephant in the room at my company. Anyway, thanks for coming to my TED talk. \n\nEdit 2: No, we don’t let GPT do the FUN stuff - creative writing, workshopping, strategizing. Why would we do that? By the way, AI has not grasped our brand voice(s). We don’t want it to! We still rely heavily on our own creative chops. \n\nYes, AI saves us time by taking over the mundane tasks like summarizing customer research into reports (we still listen to every word) and creating lists of content ideas (we still edit and input our ideas) - just to name a few. ",
    "subreddit": "copywriting",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 414,
    "downs": 0,
    "created_utc": 1714761517.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Describes a positive integration of AI and human skills to boost productivity with examples.",
    "composite_score": 4.3233215774083575
  },
  {
    "score": 370,
    "title": "If you're a beginner copywriter, please read this to save yourself a whole lot of time.",
    "selftext": "If you understand human nature / consumer psychology you will probably be pretty successful in copywriting. Study it. \n\nRead. Books. READING will do more for you as a writer than writing sample copy.\n\nNow that doesn't mean completely stop practicing. It simply means spend a lot of time reading, a little bit of time practicing, and a lot of time getting ACTUAL experience. \n\nIn the beginning stages, drop the ego and do free work.\n\nYou aren't worth a monthly retainer yet.\n\nYou need to build your skills and portfolio before you can scale, or you won't be able to keep up. ",
    "subreddit": "copywriting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 370,
    "downs": 0,
    "created_utc": 1727797532.0,
    "media": null,
    "is_video": false,
    "num_comments": 111,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Offers guidance for beginners: read, practice, gain real experience, and build a portfolio.",
    "composite_score": 4.321482920950137
  },
  {
    "score": 356,
    "title": "Copywriting is NOT something you can just do.",
    "selftext": "I’m going to acknowledge being a dick here, but I am SO TIRED of reading posts of people thinking that copywriting is a get rich quick scheme.\n\nNo internet course will teach you GOOD copy. Agency life is cutthroat. Any experienced freelancer with the correct credentials will tell you that. I am tired of seeing posts with godawful copy asking to collaborate, network, get advice etc. \n\nI find it insulting to the craft. I am disappointed that I have to unfollow this sub. Thanks for reading, and if you feel like this applies to you please read actual books on copywriting and creative advertising. Oh, and strategy and concept.\n",
    "subreddit": "copywriting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 356,
    "downs": 0,
    "created_utc": 1720046274.0,
    "media": null,
    "is_video": false,
    "num_comments": 209,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Vent/critique of the copywriting community and the idea of copywriting as a get-rich-quick scheme.",
    "composite_score": 4.411277863479152
  },
  {
    "score": 345,
    "title": "Please stop listening to gurus and giving them money",
    "selftext": "Here's an e-mail Tyson 4D (\"six figure copywriter\" and Andrew Tate student/follower) sent out about offering coaching. I'm gonna rip this sucker apart and tell you why you shouldn't by giving people like this money or publicity. (And yes, I see the irony in me publicizing an e-mail of his to tell you not to patronize or publicize him) EDIT: HE'S CHARGING $100 USD/mo WITH A $300 SIGN UP FEE.\n\n\"Most people know me as Tyson “FREE Value” 4D…\n\nI have dozens of YouTube courses to help you become a 6-figure copywriter.\n\nBut if you wanna get to $5k-$10k/mo ten times faster,\n\nHere’s the best way:\n\nQuestion…\n\nWhat do Elon Musk, Mark Zuckerberg, And Jeff Bezos all have in common?\n\nAside from being some of the richest men in the world,\n\nThey all pay millions every year for people’s advice and insight.\n\nWhy?\n\nBecause having someone in your corner is a business cheat code.\n\nWhile everyone else is concerned with “free, fast, and easy”,\n\nThe winners figure out how to get a competitive advantage.\n\nHaving a mentor is like having a 10 second head start in the 100m dash…\n\nSimply nobody can compete with you. It’s completely unfair.\n\nAnd that’s what I’m giving you the opportunity to do.\n\nIf you want to start working directly with me and the 4D team.\n\nReply to this email with the word “COACH”.\n\n(But ONLY if you're actually willing to commit to the work).\n\nMy team and I will get you up to speed with copywriting and show you the path to getting clients ASAP.\n\nBUT…\n\nI’ll only be answering emails for the next few hours, so don’t put off your reply until later.\n\nI'll see you in tomorrow's free value email. 😎\n\nTalk soon,\n\nTyson 4D.\"\n\nHe already claims his free videos which are already pretty useless are capable of getting you a 6 figure income in 90 days. Is he magically going to will his students get 6 figures in 10 days? Not only is that unrealistic, I'm certain that's downright impossible.\n\nNotice how he's using terms like cheat code and competitive advantage. This is how guys like this trick you into buying their snake oil. Any rational person who knows it's going to take them months, or much more probably years to develop the skills they need to make a reliable six figure income in any practice, let alone creative pursuits like copywriting. You know what gets in the way of our rational thinking? Emotion. As copywriters we're trying to trigger some kind of emotional response from our readers. You know what makes people really emotional? Fear and desperation. That's what sleezeballs like this take advantage of. Desperate or gullible (or stupid, though that's not mutually exclusive with being gullible). Let me put it this way, his videos get tens of thousands, if not hundreds of thousands of views. His group on Skool has over 25,000 members. If even 1/10 of them signed up for a $5/mo course, he's making 150K for the year. Odds are he's gonna charge $15-20 on the low end if he makes a premium course, probably gonna charge hundreds an hour for 1-on-1 mentoring.\n\nThis is how people like this make their six figure incomes. They sell you really shitty advice that you can find for free elsewhere. Literally any piece of advice he gives you can be found with a simple Google search because he isn't a good copywriter. He's another hack following whatever e-mail templates he got from idiots like Andrew Tate. And he shows us how much he learned from Tate by using terms like \"winner\" to suggest that you'll be above all the plebians who didn't pay him. Well that and the fact he writes in several 2-3 line paragraphs and takes multiple lines to make even the simplest points.\n\nSeriously, many of the great copywriting books recommended on here are $10-15 for a digital copy. That'll go much further than paying some guy who can't write for shit gives you paid instruction.\n\nNotice how vague everything he wrote is. He's just trying to get hyped by saying it's basically cheating because he knows people are desperate for shortcuts. He doesn't even tell you what new things he'd be teaching you about which if you're trying to sell ***INFORMATION/KNOWLEDGE*** you should be trying to pique your reader's interest. There's a reason a lot of contractors, landscapers, cleaners, etc. will come down to give you a quote. They're creating perceived value acting like you're getting something amazing for free. Tyson's doesn't even propose he's got some super secret course. He just vaguely says his coaching will make you rich 10 times faster.\n\nPlease stop giving assholes like this money. What you'll pay for his shitty coaching will get you several of the best books on copywriting. Bly's *Copywriter's Handbook* and Sugarman's *Adweek Copywriting Handbook* are on Spotify as audiobooks. Listen to some of podcasts on Spotify.\n\nBut please for the love of God stop giving people like Tyson and Andrew Tate your hard earned money. You're basically throwing it away. And you'd probably make money faster panhandling in LA than how fast they're promising to make you money.\n\nYou're not going to make six figures in weeks or a couple months copywriting. The people who make that much have years of experience, work for major clients, agencies, or companies, and make a major part of their income off commissions or royalties. Not writing one-off e-mails for e-commerce companies.\n\nI'd say stay away from courses all together unless you're paying to learn from someone who is actually successful in this field and is qualified to coach you, but even they write those same books that get recommended on this sub.\n\nI've paid for some cheap courses on learning sites like Udemy and I can safely say it's all bullshit. They just give you the same useless formulaic crap that Tate and Tyson 4D give you. This is all stuff you can find for free, but these guys won't teach you how to actually come up with ideas for or write copy.\n\nRead copywriting books from great writers, read great copy (I'm working on a swipe file with some great direct response stuff), practice writing copy, practice writing informal essays, take notes by hand, listen to audiobooks and podcasts about copywriting, watch informercials and video sales letters (seriously, don't pay attention to the super wacky shit, but pay attention to how they explain the benefits of their products and craft offers), but don't flush your money down the toilet by giving it to these jagoffs. I've felt the need to apologize to people I let buy me shitty courses like these people sell as a gift (and those were one-off payments, not subscriptions).\n\nAnd again, I can't stress this enough, YOU HAVE TO ENJOY WRITING if you want to be a copywriter. You don't need to be amazing at it, I can't write narrative fiction to save my life. I'm great at the general brainstorming and planning, but when it comes time to put pen to paper (or fingers to keyboard), I can't write more than a few lines. But I've always been good at quickly writing essays. Practical writing where I'm trying to convince you of some sort of point. Maybe I'm trying to explain the themes in am Orwell novel, maybe I'm trying to sell you on getting the outside of your house pressure washed, or maybe I'm trying to convince you to wise up and not give attention to snake oil salesmen!\n\nDisclaimer: I don't know what Tyson 4D is like as a person, but in my opinion he is piss poor writer judging by his copy and I think his business approach is slimy. Same with Andrew Tate any other \"six/seven figure copywriter\" who is trying to sell you a course where they tell you to follow 3 or 4 formulae to write copy. Also stay away from courses on sites like Udemy. There are actual copywriting coaches out there like David Garfinkel (he's the only one I can think of right now), but they charge you something like $1200 up front, they don't squeeze several hundred to a couple thousand out of you over time.\n\n(I'll work on correcting any typos, I wrote this on my phone with more than half written while walking back from the vending machine like 4 or 5 minutes from my apartment.)",
    "subreddit": "copywriting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 345,
    "downs": 0,
    "created_utc": 1720506104.0,
    "media": null,
    "is_video": false,
    "num_comments": 267,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Calls out gurus and dubious coaching, expressing clear moral judgment and distrust.",
    "composite_score": 4.495643495807171
  },
  {
    "score": 338,
    "title": "Stupid easy ways to land clients",
    "selftext": "You know what's funny?\n\nEveryone's looking for the \"secret\" to landing clients.\n\nLike there's some magic bullet hiding in the shadows that'll solve all their problems overnight.\n\nTruth is, most of the best client-getting strategies are stupid simple. So simple that people dismiss them because they don't feel fancy enough.\n\nBut here's the thing, simple doesn't mean instant.\n\nI've been doing this copywriting thing for years now, and I've tried just about everything to get clients.\n\nSome methods worked. Some didn't. Some took forever to pay off but were worth the wait.\n\nSo let me break down the strategies that actually moved the needle for me when I first started freelancing, starting with my favorite one.\n\n**Finding niche Facebook groups and becoming the helpful guy.**\n\nThis one's deceptively powerful. I'd join local and niche marketing groups, then camp out in the comments section. Not to sell anything. Just to help.\n\nMy goal was simple: get more likes on my comment than anyone else, including the original poster.\n\nHow? By giving away everything I knew.\n\nWhen someone asked about email open rates, I didn't just say \"try better subject lines.\" I'd break down the psychology behind what makes people click, share specific frameworks, give actual examples, etc.\n\nComments are beautiful because they don't feel salesy. If you're the top commenter, everyone sees you. And if you're consistently helpful, people start tagging you when questions come up. This creates massive social proof, and I was being referred to clients even by people who've never seen my work (but did read my comments).\n\nThis wasn't instant. I didn't land clients the first week. But over months, I became the go-to guy in those communities. That reputation was worth its weight in gold.\n\n**Applying to old job postings.**\n\nThis one sounds crazy, but stick with me.\n\nInstead of fighting for scraps on fresh job posts, I'd scroll back and find posts from 10+ days ago. Sometimes even 6 months old.\n\nThen I'd message them: \"Hey, did you ever find a copywriter for this project?\"\n\nMost had. Some hadn't. A few said they were always looking for good people to work with.\n\nThis worked way better than I thought it would. Why? Because the urgency was gone. No pressure. Just a friendly check-in that sometimes turned into real opportunities. \n\n I remember the first time I tried it, my 5th DM landed me a $3,000/mo retainer - crazy.\n\n**Cold outreach with a killer foot-in-the-door offer.**\n\nCold emails feel like shouting into the void. And honestly, most of the time they are.\n\nBut the ones that worked had one thing in common: a specific, low-risk offer that made it easy to say yes.\n\nI stopped pitching \"email marketing services.\" Instead, I'd ask something specific, like: \"Can I revive your dead list in the next 14 days?\"\n\nSpecific timeline. Specific outcome. Low barrier to entry.\n\nI kept tweaking these offers until I found ones that consistently got responses. This is probably the fastest way to get leads right now, which is why every freelancer needs to master it.\n\n**Creating a digital product.**\n\nThis one's definitely not easy, nor simple. It's actually unrealistic for most people, so feel free to skip it. I decided to include it anyway for anyone who's been freelancing successfully for a while and is looking to start consulting.\n\nI wrote a book on email marketing, built a full funnel around it with upsells, then ran ads. The funnel broke even - $1 in, $1 out.\n\nSounds terrible, right? But the people buying started asking for 1-on-1 coaching. That's how my consulting business was born.\n\nFair warning: this was a massive amount of work, and I had an unfair advantage since building funnels was my core service for years.\n\n**Actually asking for referrals.**\n\nThis one's so obvious that almost nobody does it.\n\nAfter hitting an emotional high with a client, (maybe we just launched a campaign that crushed it, or they got amazing results) I'd send a simple email:\n\n\"Hey, do you know anyone else who might need this kind of work?\"\n\nSome said no. Some said yes. Some ignored me until I followed up three times.\n\nBut every single freelancer should be doing this. It's the easiest ask in the world when you've just delivered great results.\n\n**Posting valuable content online.**\n\nLinkedIn, Reddit, and Facebook all work, but there's a catch: you need to know how to write content that gets engagement.\n\nOn LinkedIn, for example, this means writing lead-gen posts (those \"comment below to get my free XYZ\"). The goal here is to really give away everything you know. Yes, some people will go and do it on their own, but lots of people would prefer just to hire you to do it for them, and giving everything away makes people feel like you're still hiding a vast amount of knowledge.\n\nThis works particularly well if you combine it with my next piece of advice:\n\n**The pitch document that works while you sleep.**\n\nI created a 4-page Google Doc with a bold promise, my step-by-step framework, case studies, and exactly what clients get when they work with me.\n\nThen I put the link everywhere. Email signature. Social media bios. Website.\n\nThis way, anything that brought people to my socials also passively pitched them. Got tons of clicks and interest without having to sell myself constantly. (Check my last post on r/copywriting if you want more details about this.)\n\n**The Amaretto Sour Effect.**\n\nThis one sounds stupid but works.\n\nI'd share random life moments on Instagram and Facebook stories. Having a drink (amaretto sour being my fav), trying a new restaurant, whatever.\n\nCan't tell you how many times clients replied with \"Oh, I just remembered I was gonna ask you about...\"\n\nIt's just a way to remind people you exist and that you're doing well. Sometimes that's all it takes. Just remember to add your clients and prospects as friends on Facebook and follow them on IG.\n\n\\--\n\nThe thread connecting all of these? Consistency and genuine value.\n\nNone of this happens overnight (cold outreach and job boards are the quickest). But if you stick with it, if you actually help people instead of just trying to sell them, good things happen.\n\nYour reputation grows. People remember you. And when they need what you do, you're the first person they think of.\n\nThat's worth more than any \"secret strategy\" you'll find.\n\nP.S. It's easier to share everything and focus on long-term growth if you have a regular income. So having a job that pays your bills and building a freelancing business on the side makes a lot of sense.",
    "subreddit": "copywriting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 338,
    "downs": 0,
    "created_utc": 1748865492.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Presents multiple practical client-getting strategies as distinct tips.",
    "composite_score": 4.206513243848303
  },
  {
    "score": 327,
    "title": "Google NotebookLM is the best thing that's ever happened to my copywriting business",
    "selftext": "I'm a homepage copywriter for 100+ startups.\n\nI could roughly divide my process into four steps:\n\n1. Strategy (hard/highly-skilled)\n2. Customer intelligence (easy/tedious)\n3. Write the first draft (easy/tedious)\n4. Edit into finished copy (hard/highly-skilled)\n\nAs you can imagine, I tend to procrastinate at steps 2/3. 🙃\n\nSo, I recently 'hired' two team members to handle this work.\n\n* Researcher — Google NotebookLM handles customer intelligence\n* Junior copywriter — my custom-trained Gemini Gem writes the first draft\n\nNow I can focus on steps 1/4 which are a much better use of my time and energy.\n\nMuch to unpack, but I just wanted to point you all toward the wonderful Notebook LM.\n\n**You can essentially build a customer intelligence LLM for every client.**\n\nNotebookLM is optimised for research.\n\nIt can store, organise and search through 50-300 sources:\n\n* PDFs (sales decks, reports, white papers)\n* Customer surveys/video transcripts\n* Project briefing documents\n* Website pages\n\n**IMPORTANT:** You should spend a while carefully organising your folder of sources before you upload them. Batch your filenames. For example, 'Sales document — Autumn Product catalogue.PDF'\n\nNow you can refer to 'sales documents' as a collective etc.\n\nNotebookLM has a high level of accuracy and low haullucinations — but (like most engineers) it's not a good copywriter. So I create insights and briefs that I feed into Gemini.\n\nI could write for days about the incredible things that NotebookLM does.\n\nBut I'll give you just one workflow to illustrate the point.\n\nI used to spend several days crawling through videos and interviews to find user testimonials that I'd edit by hand and organise in a spreadsheet against use cases.\n\nNow it takes 1-2 hours.   \n  \n1. Download and transcribe 40+ podcast episodes in which my client interviews their customers.  \n  \n2. Drop the transcriptions into NotebookLM.  \n  \n3. Ask NotebookLM to find every quote that describes the impact of our product on a customer's life and create a table with columns for quote, person, company, use case.  \n  \n4. Copy this table into Gemini. Ask my custom-trained copywriter Gem to convert these raw testimonials into case studies with a short title that starts with the company name and includes any metrics, plus a short paragraph of explainer copy underneath.  \n  \nBoom. 1-2 days of work done in under an hour.\n\nI am jumping around like a kid at Christmas. I am so excited!\n\nI did the same thing with case studies",
    "subreddit": "copywriting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 327,
    "downs": 0,
    "created_utc": 1761690158.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Provides a four-step, repeatable workflow for using NotebookLM in copywriting.",
    "composite_score": 4.192780769903537
  },
  {
    "score": 282,
    "title": "Client begged me to stop hacking her website",
    "selftext": "This is my freelance-revenge story that happened about 8 years ago, and it was one of the first times I was ghosted without pay.\n\nI created a landing page for her Elven symbol jewelry store (a bunch of esoteric BS, but I was young and trying to break into copywriting, so I took any deal I could).\n\nWe agreed on a pure performance deal, so I got nothing upfront, but we settled on a 5% performance fee.\n\nHer wordpress store was really small, and I was aiming to get $300-800 out of it, but honestly at some level I would have been happy to just do it for practice &amp; my portfolio.\n\nLong story short: I wrote the landing page &amp; built it inside her wordpress site.\n\nShe started running some Facebook ads to it, and I was shocked to see that it was actually converting.\n\n$120 on day 1, $200 on day 2, $150 on day 3, $360 on day 4, etc.\n\nBy the end of the month that landing page brought in $6,000 in revenue.\n\nI honestly thought I struck gold.\n\n$300 in royalties in the first month??\n\nI was going to make bank from two days of work.\n\nWell, predictably, she disappeared the moment I mentioned \"first invoice.\"\n\n3 months go by. Nothing. No replies to emails, calls go unanswered. She's still running ads (I can see all the sales coming in, because I still have access to her website).\n\nThen out of nowhere I get a panicked message. \"My site is down! Are you doing this? Please stop!\"\n\nNow, I had NOTHING to do with her store going down. Probably just her cheap hosting. But after being ghosted for months while she made thousands off my work...\n\nI knew this could be my one and only shot at getting paid.\n\nSo I decided to play along...\n\nBut I had to be careful. I couldn't just \"admit\" in writing that I'm the hacker and threaten her to pay up, what if she went to the police and showed them the messages?\n\nNo, I knew I had to make her THINK I was... but not admit to anything at the same time.\n\nSo I replied:\n\n\"Sorry, but I'm not going to talk to you until you pay me what you owe me.\"\n\nThis turned out to be the perfect level of vague. I never said I hacked her site. I never threatened to keep it down. I just looked suspicious AF.\n\nShe immediately called me and asked me what I want.\n\nI told her I still have access to her website &amp; google analytics, I can see what she made off of the landing page, and that I want what we agreed on: 5% of sales from that landing page.\n\nIt ended up being just shy of $1,500.\n\nShe said she'll take care of it. We got off the call, I sent her the final invoice, and she wired the money immediately.\n\nShe then messaged me with a payment confirmation from her bank and asked me to enable her website.\n\nIT WORKED!!!\n\nI was shaking when I typed back this reply:\n\n\"I had nothing to do with your website crashing, you should talk to your hosting provider.\"\n\nI never heard from her again.",
    "subreddit": "copywriting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 282,
    "downs": 0,
    "created_utc": 1747691222.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Personal revenge anecdote with emotional venting rather than a how-to or model.",
    "composite_score": 3.9310434054632335
  },
  {
    "score": 264,
    "title": "To new copywriters: You can do it",
    "selftext": "I started my copywriting journey in this subreddit, one year and 5 months ago today. \n\nI posted asking about the definition of lead generation, I was literally brand new. \n\nNow, I’m a full time digital marketing professional who does ad copy for the agency I work for, multiple big UK businesses, copy Quality Assurance for their in house resources, as well as SEO and other DM responsibilities. \n\nI am 21 years old. \n\nThis isn’t a brag post, I’m saying this because I’m sure there are plenty of people lost and brand new to the space scrolling this subreddit right now. If that’s you, just know that you absolutely can break into this field in 2024.\n\nSome guidance and dedication will be required, but stay the course and above all else, LISTEN TO THE PROS. I would not be where I am now if it wasn’t for the harsh words of the professionals in this sub. \n\nGood luck, and remember, you can do it. ",
    "subreddit": "copywriting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 264,
    "downs": 0,
    "created_utc": 1730136156.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Motivational guidance for newcomers with a central message that you can break into copywriting.",
    "composite_score": 4.03617187975788
  },
  {
    "score": 249,
    "title": "AI took my job! With a twist",
    "selftext": "I have been a freelance copywriter for 12+ years covering the same 2 topics the entire time. \n\nOnce AI got popular, the companies I write for implemented an AI-detection tool and required a “90% human text” to pass. \n\nI could never get more than 40% and they accused me off ripping them off and canceled my contracts. \n\nI hand wrote every single word and was curious how this is possible. \n\nI tested a few AIs and found that they were referencing MY WORK to generate the AI text. \n\nThat exact moment felt like those movie scenes where real people meet their clone for the first time. \n\nCrazy world we live in. ",
    "subreddit": "copywriting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 249,
    "downs": 0,
    "created_utc": 1751836320.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares an explanatory observation about AI detectors misclassifying text and how AI references user work.",
    "composite_score": 3.9245408707055347
  },
  {
    "score": 248,
    "title": "My #1 tip for being a successful freelance copywriter is honestly VERY disappointing.",
    "selftext": "I've been a freelance copywriter for over a decade. My income varies, but it's typically in the $70k – 150k range. I work from home roughly 5 – 15 hours per week. Sometimes more. Sometimes zero.\n\nI've known a lot of copywriters in my day. And a lot of freelancers. I've observed who's successful and who's not.\n\nFrom my limited POV, there seems to be a uniting factor in the successful freelancers:\n\n***We've all worked as full-time copywriters BEFORE launching our freelance business.***\n\nWe know the trade. We have connections in the industry. We have experience with big brands.\n\nNone of us (as far as I know) have paid to take a copywriting course with an online coach. \n\nNone of us use gig boards like Fiverr, Upwork, etc. \n\nNot many of us send cold emails to prospective clients (although some do).\n\nSome of us don't even have an online portfolio! (Shocking, I know.)\n\nWhich is why, when I talk with aspiring freelancers, I offer them my #1 tip: \n\n***Get yourself a foundation of full-time copywriting experience before you go freelance.*** \n\nIt's easier said than done, of course. Jobs are just as competitive as freelance gigs. Some folks in certain geographic locations don't have ad agencies or big companies nearby who are hiring writers. \n\nAnd not every freelancer needs to do this to be successful. Some people go freelance from scratch, and they're rocking it! We all have our path.\n\nBut I believe that for most people, this is the single most important factor in lasting freelance success. \n\nCurious what you think!",
    "subreddit": "copywriting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 248,
    "downs": 0,
    "created_utc": 1712099279.0,
    "media": null,
    "is_video": false,
    "num_comments": 136,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Offers a single explicit tip about gaining full-time experience before freelancing.",
    "composite_score": 4.18455963067394
  },
  {
    "score": 237,
    "title": "I met a salaried copywriter, he makes $40,000 per year",
    "selftext": "I met a guy who does copywriting full time as a job, he works at a small agency.\n\nHe works 40 hours per week writing every piece of copy ever required for any of this agencies clients.\n\nHis total take home pay is $40,000 per year. I think this is pitiful compared to what you can make freelance.\n\nDoes anyone else know salaried copywriters? Is this a normal wage or is he getting ripped off?\n\n$40,000 to be available every day 8-5 for one client seems soooo low. \n\nThoughts?",
    "subreddit": "copywriting",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 237,
    "downs": 0,
    "created_utc": 1700450352.0,
    "media": null,
    "is_video": false,
    "num_comments": 161,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Short question asking whether a salaried copywriter’s pay is normal; lacks substance.",
    "composite_score": 4.193834464327827
  },
  {
    "score": 231,
    "title": "This sub is out of control",
    "selftext": "I'm not sure what's happened on this sub but, in my view, it seems we have an influx of copywriting-curious users who think copywriting is a glamorous side hustle with very low barriers to entry. But neither of these things are true.\n\nCopywriting is like most other jobs; outside of a small elite of highly specialized experts, it's not particularly glamorous and it can be really painful and unrewarding. Copywriting is not a job that anyone with decent written English can do. It's a vocation that takes practice and hard work. Unlike a lot of creative writing, copywriting is functional. Professional copy has to convert and, if your copy doesn't, you're out of a job.\n\nA lot of people on here want to go straight into freelance. But freelance is an opportunity for people who've honed their skills and have years of proven experience under their belt. I'm not saying the ambition of starting freelance with no experience is unachievable, but you wouldn't expect to become a freelance accountant without any proven experience, what's so different about copywriting?\n\nI understand you have to start somewhere, but this sub has got to the point where the majority of posts are questions that have already been answered, or they're questions that are too context-specific for any of us to answer.\n\nCould we possibly have a continuing newbie thread, where people can ask their questions? No offense to the newbies, but it'd be really nice if the sub worked for those of us who are currently working as copywriters too.\n\n&amp;#x200B;",
    "subreddit": "copywriting",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 231,
    "downs": 0,
    "created_utc": 1704872342.0,
    "media": null,
    "is_video": false,
    "num_comments": 77,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Critique of the sub and newbie dynamics, expressed as a venting opinion.",
    "composite_score": 4.02403528623614
  },
  {
    "score": 226,
    "title": "I'm SICK of AI detector tools!! This is ridiculous! ",
    "selftext": "I work for a software development company as a senior copywriter. The marketing manager introduced a new AI-detector tool and after scanning my articles, the tool determined 90% of the text was generated by AI.\n\nI can’t stress this enough - NONE of my work has been AI-generated. Yet, the damn detector shows it is MOSTLY AI-generated.\n\nNow I (and other copywriters) have to rewrite the articles using this AI detector tool. It's a bit I annoying, especially since the articles are human-written, but.. whatever.\n\nI rewrote some parts of the article and scanned in the detector and it still says the content is AI-generated. I tried different versions, and scanning the same versions several times, and it gives me random assessment scores - always on the AI side.\n\nI explained this to the manager, who believes I wrote those articles but wants \"results.\"\n\nWhat kind of results??? What is he talking about?!!!\n\nI also researched a lot and explained how these detector tools work. I asked some questions about the encouraged usage of AI too (management encourages writers to use ChatGPT to shorten the turnaround time for the articles), but no use!\n\n  \nSo. today, my team lead scheduled a call with me and told me that the manager gave her a….. oh god… “humanizer tool.”\n\nI’m crying…\n\nIt’s another AI tool that… humanizes the AI-generated content to bypass the AI content detectors.\n\nWhat is this.. what am I doing?!…",
    "subreddit": "copywriting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 226,
    "downs": 0,
    "created_utc": 1716393137.0,
    "media": null,
    "is_video": false,
    "num_comments": 166,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Rant about AI-detector tools and the stress of dealing with management; emotional.",
    "composite_score": 4.2023840927669145
  },
  {
    "score": 219,
    "title": "If AI is killing copywriting, why is OpenAI paying up to $393k for a content strategist?",
    "selftext": "So I'm scrolling through job boards late last night and see OpenAI posting for a content strategist. Nearly $400k.\n\nThis is the same company that built ChatGPT - the tool everyone said would kill copywriting jobs three years ago. Now they're paying Silicon Valley engineer money for someone who does content strategy.\n\nHad to double-take on that one. Here's OpenAI, literally the face of AI replacing writers, and they need a human with 6+ years of content experience.\n\nI've been thinking about this all morning. Maybe we've been looking at the AI thing backwards. Sure, I've seen junior copywriters get squeezed out by AI tools and content mills. That part is real.\n\nBut this OpenAI job posting feels like proof that the work is just splitting in two. There's the mechanical stuff - churning out product descriptions, social media captions, basic blog posts. AI handles that fine now.\n\nThen there's the other stuff. Understanding why a campaign isn't working. Reading customer feedback and spotting what they're not saying. Navigating company politics to get things approved. Building messaging that actually connects with people instead of just filling space.\n\nTurns out that the second part still needs a human brain. And apparently it's worth paying for.\n\nMy unconditional belief is that a copilot mode will win over autopilot for any observable future.",
    "subreddit": "copywriting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 219,
    "downs": 0,
    "created_utc": 1757034475.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Argues that OpenAI’s job posting illustrates a split in copywriting tasks and argues a future trend.",
    "composite_score": 4.019443376982753
  },
  {
    "score": 209,
    "title": "Every way I've made money (and how much I've charged per project) in 3 years as a freelance copywriter",
    "selftext": "I've been freelancing for just under 3 years. It took me 15 months to hit $100K. I did not have any prior experience before quitting my job to try to make it as a freelance copywriter.\n\n\n\nHere's every way I made money and what I charged:\n\nCopy for ads in newsletters: $25–$65  \nProduct copy: $75/blurb  \nClient calls: $75–$100/hour  \nCopyediting: $50–$100/hour  \nEmail campaigns: $100–$200/email  \nPodcast show notes: $100–$130  \nVideo &amp; podcast scripts: $200–$300  \nConsulting: $200–$300/hour  \nOne-pagers: $200–$400  \nBlogs: $200–$500  \nBusiness plans: $250  \nWalking tour scripts: $300  \nSpeaking engagements: $500/session  \nGhostwriting speeches: $500–$700/speech  \nLinkedIn profile rewrites: $500–$1,110  \nLanding pages: $600–$2,500  \nFull website copy: $2,500–$4,000  \nLinkedIn ghostwriting: $2,500+/mo\n\nI also recently signed my first book ghostwriting client at $12K for a 20,000-word manuscript.\n\nI've gotten clients from:\n\n• Reddit\n\n• Referrals\n\n• Cold email\n\n• Cold calling\n\n• LinkedIn\n\n• Handwritten letters\n\n• In-person handshakes\n\n• Friends &amp; family connections\n\nMy first \"big break\" was getting an agency to take a chance on me as a freelancer. If you want to freelance from scratch, I'd recommend trying to work for agencies as opposed to trying to find your own clients right out of the gate.\n\nIt's difficult to try to get a random business owner to take a chance on you when you don't have experience. It's still difficult to get agency owners to do so, but they can at least tell what good copy looks like. So if you create your own spec portfolio and have it ready to send, you'll have a shot at getting a chance.\n\nGetting clients early on is such a grind — work for someone who can get clients for you.\n\nHappy to answer any questions! (And provide proof to mods per rule 7 if need be)",
    "subreddit": "copywriting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 209,
    "downs": 0,
    "created_utc": 1752168171.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Enumerates multiple money-making methods and rates a freelancer uses.",
    "composite_score": 4.024468520355703
  },
  {
    "score": 209,
    "title": "How this sub helped me become an in-house copywriter in 9 months (thank you).",
    "selftext": "I joined this subreddit 9 months ago, hoping to find some advice on becoming a copywriter. At the time, I was unemployed because of a health condition and in a pretty low place in my life if I'm honest. I had just googled \"jobs that I can do with chronic fatigue\" and copywriter happened to be on the list.\n\nFrom that point on, between this sub's FAQ, searching old posts for questions I had, and posting my copy for critique, it was all I needed to break into this industry. I just wanted to say thank you to the experienced copywriters in this sub for all of your advice, I'm not sure I could have done it without you.\n\n**Last week, after months of freelancing, I signed on to become an in-house copywriter at a large corporation in New York.**\n\nI'm now making more money than I ever have before, doing something I actually enjoy. And did I mention it's also remote? (Score!)\n\nTo all of the new copywriters who are here now, in the same place I was a year ago, here's your proof it's possible if you put in the work.\n\n(Also, if anyone has any questions about how I did it, I'll be happy to help if I can.)",
    "subreddit": "copywriting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 209,
    "downs": 0,
    "created_utc": 1675984587.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Gratitude/story about how the sub helped the user become an in-house copywriter.",
    "composite_score": 3.971175973055347
  },
  {
    "score": 200,
    "title": "I'm coming for AI's job",
    "selftext": "Just kind of a funny/frustrating vent post.  I manage the marketing for a mid-sized independent hotel.  I inherited the job late last year from this woman who was *obsessed* with AI as part of her workflow.  As a result, almost all of our customer-facing print/web materials (aside from the ones I helped with before taking over) has the telltale \"it's not just a hotel - it's an experience, evoking feelings of...\" writing, lol.\n\nWhen I took over this job I figured I'd undo that and turn our site/print materials into a nice little portfolio piece to show off if I'm ever trying to jump ship.  But let me tell you, it's like coming back from the beach and finding sand in all your shit for months.  It's everywhere.  Every page, every newsletter template, literally everything has some amount of shitty AI copy that I need to redo.  My web designer is a boomer nepo hire the owner makes me use, so I can't even delegate effectively to her because she also uses AI for any copywriting tasks I give her lmao",
    "subreddit": "copywriting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 200,
    "downs": 0,
    "created_utc": 1753665321.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Emotional vent about AI copying copywriting and its impact on the job.",
    "composite_score": 3.837087985780357
  },
  {
    "score": 196,
    "title": "Here's the slide deck that I just used to close a $12.5k/month retainer",
    "selftext": "Hey, I figured this [slide deck](https://drive.google.com/file/d/1JEc8NBmXzfGUWE-EWmVgzy_3mTKfd24d/view?usp=drive_link) might be helpful or interesting.\n\nOne of my clients asked if I'm available for ongoing work.\n\nThis is usually a 'no' — I value my freedom.\n\nBut this is an exciting, funded startup that could be big.\n\nThey have a TONNE of use cases and audiences to target.\n\nAlso, I'm getting tired of context switching. I'm ready to focus on one startup for a while — so I can focus the rest of my attention on building out video content and podcasting.\n\nI'm also keen to see how much value I can add with total ownership of their conversion assets.\n\nI typically deliver 3-4 sales pages each month for around $5400 each.\n\nEach page takes a month from beginning to end — with customer interviews etc.\n\nNot for this project.\n\n**Accelerated process:**\n\n* Launch two new sales pages each week based on templates from my Figma pack.\n* Write fast — based on assumptions.\n* Run batched interviews and surveys after the fact to optimize them.\n* $12,500/month\n\nI anticipate this will initially take three days a week, but I can reduce it to two — as I will build and reuse assets.\n\nUltimately, I plan to build this into a case study that demonstrates my ability to add significant value to a funded startup. I can then position myself for cofounder roles.\n\nI figured this might be handy for anyone who is looking for 'next steps!'\n\nFeel free to ask Q's.\n\n",
    "subreddit": "copywriting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 196,
    "downs": 0,
    "created_utc": 1743800029.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.84,
    "category_rationale": "Explicit goal and sequential steps to execute a client-winning process.",
    "composite_score": 3.9146311436669765
  },
  {
    "score": 188,
    "title": "Free 22-hour \"Copywriting Megacourse\" 👇 (NEW)",
    "selftext": "**For beginner copywriters AND working copywriters who want to boost their career &amp; copy skills!**\n\nCopy That!'s Megacourse is finally out after 7 months of production and $60,000 of costs. \n\nWe try not to self-promote here, but I'll make this ONE exception because we made this to be as VALUABLE as possible for beginners (without being TOO overwhelming...)\n\nThis course is everything you need to get started. \n\nFrom persuasive principles to how to find work. Research. Writing copy. Editing copy. Career paths. Portfolio recommendations. Live writing examples. Fundamental concepts. Etc etc etc. \n\nThere's a TON. \n\nAnd to be ultra-transparent: There's also a link to sign-up to our email list where we sell things. THIS IS NOT MANDATORY. You can watch this whole course on its own and launch a career without paying a penny. \n\nWe are extremely open about who are paid products are for.\n\nIf you're a beginner, this free course has been designed to give you everything you need so you don't have to buy a course from a guru. \n\nIf you make money from copywriting and decide you want even more from us, great! \n\nBut this Megacourse is a passion project that we've poured everything into so beginners can avoid being conned into mandatory upselling. \n\nAlright, cool. \n\nThis project has been planned since 2023 as an expansion of my original 5-hour video... So if you got any value from the first one, hopefully you will get 5x more from this new version.\n\nWe started filming in October 2024 and it took us far longer than we expected to finish. \n\nSo... If this Megacourse does help you (or if there are any other kinds of content you want to see in the future) let us know!\n\n",
    "subreddit": "copywriting",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 188,
    "downs": 0,
    "created_utc": 1746174516.0,
    "media": {
      "type": "youtube.com",
      "oembed": {
        "provider_url": "https://www.youtube.com/",
        "version": "1.0",
        "title": "The Copywriting Megacourse | The Only Course You Need to Launch Your Career (No Experience Required)",
        "type": "video",
        "thumbnail_width": 480,
        "height": 200,
        "width": 356,
        "html": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/tC6bom34his?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"The Copywriting Megacourse | The Only Course You Need to Launch Your Career (No Experience Required)\"&gt;&lt;/iframe&gt;",
        "author_name": "Copy That!",
        "provider_name": "YouTube",
        "thumbnail_url": "https://i.ytimg.com/vi/tC6bom34his/hqdefault.jpg",
        "thumbnail_height": 360,
        "author_url": "https://www.youtube.com/@CopyThat"
      }
    },
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.69,
    "category_rationale": "Promotional course description with benefits and scope aimed at beginners.",
    "composite_score": 3.8987214304825533
  },
  {
    "score": 186,
    "title": "AI took my Copywriting Job",
    "selftext": "I’ve been working as a copywriter since 2012 and have been in my current full-time copywriting role for the past 5 years. Recently, my employer cut my pay by 25% and reduced my hours from 40/week to just 15/week.\n\nDuring my latest team task review, the CMO “joked” that all of my projects were gone anyway because “AI took them.”\n\nI’m feeling pretty stunned and frustrated. Has anyone else experienced something like this? How are you coping or pivoting?",
    "subreddit": "copywriting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 186,
    "downs": 0,
    "created_utc": 1751415880.0,
    "media": null,
    "is_video": false,
    "num_comments": 140,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Frustration about AI taking copywriting work with a request for coping/pivot.",
    "composite_score": 4.066451162864189
  },
  {
    "score": 186,
    "title": "Can I give one piece of feedback after 10+ years doing this?",
    "selftext": "Get into industries that make money. I don’t think I’m necessarily an amazing copywriter (actually, I am) or better than so many other copywriters who are amazing.\n\nOne thing I did do was get into a niche that always has budget (healthcare and pharma). I then niched down even further to women’s health because it’s a growing field and women spend the most money on health (and I’m a woman, not that it matters).\n\nThat’s my advice to you. Get experience in your portfolio that mirrors industries that have budget to pay you.\n\nA recommendation/example: manufacturing and construction. The “Build Back Better” program under Biden has infused BILLIONS into the AEC (architecture, engineering and construction) space. I randomly had one client in this space that I got via referral and they doubled their monthly retainer in the last few months. And because I have AEC experience, I recently signed another client who reached out to me.\n\nThat’s my advice: Get a portfolio that reflects the industries that make money.",
    "subreddit": "copywriting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 186,
    "downs": 0,
    "created_utc": 1726650647.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.71,
    "category_rationale": "Advice on niching into industries with budget and examples illustrating impact.",
    "composite_score": 3.9350869691227395
  },
  {
    "score": 183,
    "title": "I've been getting clients for 5 years without lifting a finger",
    "selftext": "Back in my early copywriting days, I stumbled across the story of Hotmail's genius growth hack.\n\nYou know the one where they added \"Get your free email at Hotmail\" to the bottom of every email sent through their platform. That single line turned every user into a walking billboard and helped them explode to 12 million users.\n\nWell, it made me think - why couldn't I do that for my copywriting biz?\n\nSo I built a simple Google Doc pitch for my funnel building service, added some client results, etc.\n\nNothing fancy - just a clean, professional overview of what I do and how I help clients.\n\nThen I added one line to my email signature: Curious how I help companies sell more with sales funnels? See here.\n\nThat same week I got my first passive lead.\n\nI was working with a client on their website copy. Midway through the project, they replied to one of my emails with: \"Hey, I noticed you also do funnels. Is that something you could help us with, too?\"\n\nJust like that - an upsell I didn't have to pitch, for a client who discovered it themself.\n\nSince then, I've been using this everywhere from my email signature to my social media profiles.\n\nThe result?\n\nI haven't had to market, sell or pitch myself in the last 5 years.\n\nI'm just going through my life, sending emails as normal, writing a post every once in a while on LinkedIn, and I get leads constantly.\n\nThe fact that clients self-select makes this work 100x better than active pitching - there's like zero pressure on them.\n\nFor anyone wanting to try this:\n\nKeep it simple. One compelling line in your signature with a link to a clean overview of your service. Make the promise specific (\"get 25 leads in the next 30 days\", not \"help with growth\").\n\nI've got 4 pages of copy in mine, going over everything they need to know to start working with me.\n\nI've probably sent thousands of emails in the last 5 years. That's thousands of opportunities for someone to discover my service when they need it most.\n\nSometimes the best sales strategy is just making it ridiculously easy for interested people to say yes.\n\n// This is a repost since my last post got removed by Reddit.\n\n// I got a lot of DMs asking for my example in the last post, so I took the last couple of hours and put together a short guide with examples on how to create your own Pitch Doc. [You can grab it here](https://freelancerstoolkit.com/l/pitch-doc) for free - you just need an email &amp; a free Canva account. If you hate lead magnets just put in a fake email address, it'll still work. I've got nothing to sell atm, but I will be giving away more of my freelancing assets in the future.",
    "subreddit": "copywriting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 183,
    "downs": 0,
    "created_utc": 1748347012.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.66,
    "category_rationale": "Narrative plus concrete technique and steps to implement (signature line, outreach).",
    "composite_score": 3.8244557578099307
  },
  {
    "score": 170,
    "title": "Here’s what being a copywriter is like ",
    "selftext": "You work hard on another website for a big corporate. \n\nYou get into it, too. Even feel like copywriting isn’t just the death of your writing passion for a moment. You start sounding chipper on client calls, nodding like a dog to buzzwords and doing that *smile*. \n\n‘Kewl, kewl. Yup, yup, we know you’re revolutionising automatic cat feeders and our copy will shake the world up blah blah blah.’\n\nYou think up some tasty H1s, H2s, H3s. Pithy, emotive, benefit driven word spears that skewer people right through their humanity. H2H, not B2C. \n\nTime passes…summer gets blown away by a crisp autumn wind, the days darken at the edges. \n\nYou get a message: the site is live. \n\nYou click faster than a bullet shrimp pulling the trigger! \n\nAaaaaand…you don’t recognise the copy. Actually, you do. You recognise snippets of it floating in a jargon soup, made from a base of *creative agency bollocks* stock  - like ‘ignite your cat’s optimal food intake routine’. \n\nAnd you wonder, who fucked it? Probably a private meeting between the higher ups. Hollow laughter, pandering, nonsensing. Loadsa money. \n\nYou know it can’t be used in your portfolio anymore. But, as a concession, you’re still on the hook if the copy that’s yours (but not yours at all) fails to perform. \n\nRepeat until lost. ",
    "subreddit": "copywriting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 170,
    "downs": 0,
    "created_utc": 1726153579.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Satirical vent about copywriting and corporate jargon in the industry.",
    "composite_score": 3.842090123895254
  },
  {
    "score": 165,
    "title": "You are cheaper than AI",
    "selftext": "Something I really want to get off my chest. My timeline and LinkedIn and everything else is full of copywriters stressed about gen AI. There’s a lot to be said about hallucinations and quality and degradation. I’m constantly seeing rebuttals about how AI will get smarter and more powerful. I read a lot of Ed Zitron, who’s my go-to on the topic: https://www.wheresyoured.at/longcon/\n\nThe thing nobody seems to want to talk about is how expensive and energy intensive AI is. It requires top of the line servers to be running white hot night and day. Each ChatGPT query uses 16 ounces of water. OpenAI wants you to forget that, so they’re eating that cost right now, burning through their endless stream of investment funding. They are losing billions each year. Eventually they’re going to have to start passing those costs onto someone. We’re in the “first taste is free” phase. \n\nIt may not seem like it right now, but a copywriter is cheaper than a ChatGPT query. Eventually the bill is going to show up; AI salesmen are hoping you’ll be long gone by then.",
    "subreddit": "copywriting",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 165,
    "downs": 0,
    "created_utc": 1746638227.0,
    "media": null,
    "is_video": false,
    "num_comments": 61,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.73,
    "category_rationale": "Argument about cost/energy of AI versus human copywriters with supporting reasoning.",
    "composite_score": 3.828803932789182
  },
  {
    "score": 160,
    "title": "20 Copywriting tips that helped Nicolas Cole make over $10M",
    "selftext": "Nicolas Cole is a popular writer online. He is active on Twitter and has written great books about writing.\n\nRecently, he opened a YouTube channel and posted a 32-minute video that was super valuable to me.\n\nI've already watched the video twice to take notes, and many of these tips were non-obvious. (I'll try to extract the best lessons from this video into an upcoming [newsletter](http://becomingacopywriter.substack.com) issue).\n\n**This was a true lesson in copywriting. I will return to this list often to apply these to my writing.**\n\n# Sharing my summary of the video:\n\n1. You are not selling anything -&gt; You give the customer an opportunity to change.\n2. Don't use formal language. Speak in a conversational tone as if talking to a friend.\n3. Use \"you might be experiencing\" instead of \"you are experiencing\" to address different problems.\n4. Avoid using the word \"better\" (and other ER words) to prevent comparison. Focus on what makes your offering different.\n5. Be a painkiller, not a vitamin. Frame your product or service as a solution to immediate pain rather than a preventative measure.\n6. Sell and emphasize the result, not the process.\n7. Write copy for one specific reader, not for a crowd.\n8. Don't sell the customer on your brand. Educate them on the category.\n9. Teach, don't sell. Focus on educating the customer about the problem and the solution.\n10. Never blame the customer. Empathize with them and pick a mutual enemy.\n11. Separate writing copy for insiders (those familiar with the industry) versus outsiders (beginners).\n12. Ground your argument in a shocking statistic whenever possible to capture attention.\n13. Use the phrase \"according to\" to add credibility to your writing.\n14. Organize information into lists to make it skimmable and easier to read.\n15. Don't oversell the problem. State it simply and clearly.\n16. Give your customers new language to talk about the new problem you're educating them on.\n17. Remind the customer what will happen if they don't take action.\n18. Emphasize the benefits, not the features of your product or service.\n19. Remove the fear of buyer remorse by offering guarantees or reassurances.\n20. Great copy doesn't read like a copy. It reads like a story or educational content that is engaging and helpful.\n\nThat's it!\n\nDid you find any of these tips helpful?",
    "subreddit": "copywriting",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 160,
    "downs": 0,
    "created_utc": 1721827752.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.86,
    "category_rationale": "Extensive enumerated list of actionable copywriting tips.",
    "composite_score": 3.6280248749813278
  },
  {
    "score": 159,
    "title": "I just signed my first client 🤩",
    "selftext": "First, I want to thank everyone in this community for sharing their knowledge on how to write a copy and find clients. I literally had zero idea where to start; all I had was a resume, so I started to learn copywriting in early September. I was taking notes from the experienced copywriters, but I didn't have any experience or a portfolio to showcase my work. I started outreaching, and I got my first client four days after my outreach. I am so happy now.",
    "subreddit": "copywriting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 159,
    "downs": 0,
    "created_utc": 1697638429.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal success story with minimal actionable guidance or model.",
    "composite_score": 3.8053168625674085
  },
  {
    "score": 159,
    "title": "You can’t be an illiterate copywriter. ",
    "selftext": "It’s like wanting to be a diving instructor that can’t swim. An immaculate contradiction. \n\nAI won’t save you either. It needs heavy rewriting to be human. And yes, it’s obvious. The egregious use of title case gives it away for a start. \n\nAnd forget your false idols. The grifting gurus. They just want your money, regardless of whether you can string a sentence together. \n\nSad really, but also not sad at all. Annoying af, actually, because all of this brain-dead copymaxxing floats around here like scum on a polluted lake. \n\nAnyone else got some rant? \n\nEdit: the state of this sub. The blind leading the blind and trying to lead the experienced too. I suppose this is a summoning spell for the very thing it criticises. Lots of literal people here. Yes yes, of course you can’t be an illiterate copywriter. I’m being hyperbolic. \n\nIn a nutshell: you must be able to write well to become a copywriter. Otherwise what do your mentors have to work with? \n\n\n\n\n\n\n\n\n\n\n",
    "subreddit": "copywriting",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 159,
    "downs": 0,
    "created_utc": 1732280403.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.86,
    "category_rationale": "Dominant emotional vent and moral judgment about copywriting quality and gurus.",
    "composite_score": 3.8227862308715586
  }
]