[
  {
    "score": 519,
    "title": "I analyzed 100 Data Scientist job descriptions. Here's the ultimate Skills &amp; Keywords cheat sheet for your resume.",
    "selftext": "Tired of tailoring your resume for every single job application? I was too. So I spent a weekend scraping and analyzing 100 recent Data Scientist job postings from companies like Google, Meta, Netflix, and growing startups.\n\n\n\nI've distilled it all down into a single, actionable checklist you can use to optimize your resume and LinkedIn profile. Make sure these keywords are present!\n\nThe Data Scientist Resume Keyword Cheat Sheet\n\nTechnical Skills (Prioritize these):\n\nProgramming: Python (obvious, but say it), SQL (CRITICAL), R, Scala\n\nML Libraries: Scikit-learn, TensorFlow, PyTorch, XGBoost, Keras\n\nBig Data &amp; Cloud: Spark, Hadoop, AWS (S3, Redshift, SageMaker), Azure ML, GCP (BigQuery, AI Platform)\n\nVisualization &amp; MLOps: Tableau, Power BI, Docker, Kubernetes, MLflow, Airflow\n\nBuzzwords &amp; Action Verbs (Sprinkle these everywhere):\n\nInstead of \"Made a model\": Developed, Engineered, Implemented, Productionized, Deployed\n\nInstead of \"Looked at data\": Analyzed, Synthesized, Interpreted, Evaluated, Quantified\n\nFor Impact: Optimized, Automated, Streamlined, Improved \\[Metric\\] by X%, Reduced costs by Y%\n\nThe \"Secret Sauce\" Section (What makes you stand out):\n\nA/B Testing | Causal Inference | Stakeholder Management | Storytelling | Agile/Scrum\n\nPro Tip: Use a Skills or Technical Proficiencies section on your resume and fill it with these keywords. Many companies use automated screeners (ATS) that look for an 80% keyword match.I've put the full, detailed breakdown into a free, one-page PDF. Kindly DM for PDF.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 519,
    "downs": 0,
    "created_utc": 1762166246.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Curated checklist of resume keywords and related items.",
    "composite_score": 4.292609600522471
  },
  {
    "score": 354,
    "title": "I've reviewed hundreds of data science applications",
    "selftext": "I'm an AI engineer who oversees hiring at my company. The gap between what candidates show and what gets them hired is honestly depressing.\n\nWhat job postings say:\n\n* PhD or Master's preferred\n* 5+ years ML/DL experience\n* Publications a plus\n* Expert in PyTorch, TensorFlow, scikit-learn\n\nWhat actually gets people hired:\n\n* Can you clean messy data without complaining?\n* Can you explain your model to someone's VP who doesn't code?\n* Can you ship something in production?\n* Do you know SQL well enough to not break things?\n* Are you pleasant to work with?\n\nIMO, most \"data science\" jobs are 70% data engineering. The modeling is maybe 20% of the actual work. If you can't wrangle APIs and build pipelines, you're going to struggle.\n\nKaggle portfolios might hurt you. Hiring managers see \"Kaggle competitions\" and think \"this person optimizes for leaderboards, not business problems.\" Show me something that solved a real problem, even a tiny one.\n\nThe PhD requirement is mostly BS. Companies write \"PhD preferred\" because they think that's what serious roles need. Then they hire the person who actually shipped something.\n\nEntry-level doesn't really exist anymore. When postings say \"3-5 years,\" they mean it. The \"we'll train you\" era is over.\n\nWhat actually works:\n\n* End-to-end projects (problem → data → model → deployed result)\n* GitHub with real code, not just notebooks\n* Proof you can work with engineers\n* Blog posts or anything showing you can explain technical stuff to humans\n* Referrals (still 80% of how people actually get jobs)\n\nSo, if you're applying to 100+ jobs with no response, it's probably not your skills. It's that you're showing academic credentials when companies need proof you solve business problems.\n\nThe market sucks right now. But the people getting hired are the ones who can demonstrate impact, not just knowledge.\n\nAm I wrong? What's your experience? What's actually working for people landing DS roles?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 354,
    "downs": 0,
    "created_utc": 1762806391.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains what actually matters in DS hiring with reasoning and examples.",
    "composite_score": 4.180818340047038
  },
  {
    "score": 226,
    "title": "Gen AI is just glorified autocomplete, not the next industrial revolution! 😒",
    "selftext": "Full automation of complex jobs isn’t happening in the next 15 years — not without real breakthroughs in AI research beyond clever prompt tricks and context engineering. What’s far more likely is AI chipping away at white-collar subtasks, with autocomplete-style models quietly handling bits and pieces instead of replacing entire professions. That means no sudden revolution, just a slow grind like the rollout of computers and the internet, where real value only appeared after years of messy engineering and integration. Along the way, demand for some jobs may shrink (though not vanish), making competition tougher without wiping whole careers out.\n\nAnyone else tired of the endless hype cycle? 😵",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 226,
    "downs": 0,
    "created_utc": 1756063159.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Skepticism and frustration about AI hype and its impact.",
    "composite_score": 3.9907208605155793
  },
  {
    "score": 165,
    "title": "I analyzed 71K data science H-1B applications from FY2024 - here's what the data shows about salaries, employers, and locations",
    "selftext": "I analyzed 70,965 data science-related H-1B LCA applications from FY2024 (8% of all H-1B apps):\n\n\n\nSalary Highlights:\n\n  \\- Median: $126,500 | Mean: $133,409\n\n  \\- ML Engineers earn highest at $172,931 median\n\n  \\- AI Engineers: $156K | Data Scientists: $138K | Data Analysts: $108K\n\n  \\- California pays highest ($166K median) vs Texas ($108K) - that's a $60K gap for similar roles\n\nTop Employers (no surprises):\n\n  \\- Amazon dominates with \\~2,900 applications\n\n  \\- Big Tech (Microsoft, Google, Meta, Apple) all in top 10\n\n  \\- Walmart at #2 shows retail's growing data appetite\n\n  \\- JPMorgan &amp; Goldman Sachs are the top finance hirers\n\nGeographic Distribution:\n\n  \\- California: 21% of all DS applications\n\n  \\- Top 5 states (CA, TX, NY, WA, NJ) = 59% of total\n\n  \\- NYC leads cities with 6,907 apps; Bay Area combined \\~6,000\n\nOther Interesting Findings:\n\n  \\- 89.4% certification rate (only 0.38% denial)\n\n  \\- 98.6% are full-time positions\n\n  \\- Level II wage jobs dominate (38%) - most hires are mid-level\n\n  \\- Info/Tech sector pays highest ($170K median); Education pays lowest ($75K)\n\nData source: Kaggle H-1B LCA Disclosure Data 2020-2024\n\nFull analysis: [https://app.verbagpt.com/shared/nU9Kevf29SyFfg8hM1-NrLblH2NNbQEK](https://app.verbagpt.com/shared/nU9Kevf29SyFfg8hM1-NrLblH2NNbQEK)",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 165,
    "downs": 0,
    "created_utc": 1764796034.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Data-driven findings about salaries, employers, and locations in H-1B data.",
    "composite_score": 3.7506403915533046
  },
  {
    "score": 156,
    "title": "Anyone else struggling this long to find a job? (Laid off data scientist, 8 months searching)",
    "selftext": "I used to work as a data scientist for the US government, but when the new administration came in earlier this year, I was one of the federal workers laid off. That was back in February, and I’m still out here searching almost 8 months later.\n\nSince then, I’ve been doing everything I thought I was “supposed to” — picked up more certifications (I just got the Microsoft Azure Data Scientist one), networking like crazy, tailoring my resume, applying daily… but it feels like nothing is moving. The job market honestly feels like shit right now.\n\nAm I the only one experiencing this, or are others going through the same thing? For those of you who did manage to land something after a long search, what worked for you? Was there one specific thing that helped you break through to your next role?\n\nI’m really trying not to lose hope, but after months of grinding, it’s hard not to feel like I’m missing something.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 156,
    "downs": 0,
    "created_utc": 1757174255.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Personal emotional plea about a long job search with frustration.",
    "composite_score": 3.830569927136024
  },
  {
    "score": 145,
    "title": "Is it just me, or is Data Science starting to feel more like “Data Cleaning” these days?",
    "selftext": "Seriously, I got into data science thinking I’d be building cool models and working on cutting edge stuff like NLP or computer vision. But lately, all I seem to be doing is cleaning messy datasets, fixing nulls, merging CSVs, and chasing stakeholders for missing data 😅\n\nDon’t get me wrong... I still love the field. But sometimes it feels like 80% of the job is just prepping the data, 15% is explaining the results, and 5% is actually running models.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 145,
    "downs": 0,
    "created_utc": 1754561737.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.64,
    "category_rationale": "Expresses frustration that data science work increasingly involves data cleaning.",
    "composite_score": 3.818166401429658
  },
  {
    "score": 137,
    "title": "Is data science going extinct",
    "selftext": "Im an industrial engineer whos gonna graduate by the end of the month. Ive been studying data science from the past 6 months (took ibm data science speciality, jose portilla's udemy course machine learning for data science masterclass, python, sql)\n\nIm currently lost on what steps to take next\n\nI sat down with a data scientist today and tried to ask for advice, he told me he doesnt even think that data science will stay, its gonna be replaced by AI. Especially the machine learning algorithms and classification methods (trees,boosting,etc) they aret being built from scratch anymore\n\nIm totally lost now and dont know what next steps to take and what to learn next. Should i pursue business analysis/data analysis/what courses to take/what skills to learn, and you see how my brain is exploding",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 137,
    "downs": 0,
    "created_utc": 1767469184.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for guidance on next steps with limited substantive content.",
    "composite_score": 3.7078050922223085
  },
  {
    "score": 133,
    "title": "IS JOB MARKET EVER GOING TO CHANGE ⁉️",
    "selftext": "Hey everyone,\n\nI’ve been on the job hunt since October 2024 and honestly, it’s starting to get really discouraging.\n\nI have 8 years of experience working as a Data Analyst, with solid skills in:\n\t•\tPython (scikit-learn, NumPy, Matplotlib)\n\t•\tData visualization tools (Looker, Power BI)\n\t•\tSnowflake, Databricks\n\t•\tGeneral data wrangling, reporting, and dashboard building\n\nDespite this, I feel like I’m sending my resume into a black hole. Most recruiters ghost me completely, and if I do hear back, it’s usually an automated rejection. Since last October, I’ve only had ONE interview.\n\nI’ve been applying consistently — tailoring my resume, writing custom cover letters, networking on LinkedIn — but nothing seems to be working.\n\nIs there something I’m missing here? Are my skills outdated? Is the market just this brutal right now?\n\nIf anyone has suggestions, resume tips, networking strategies, or even brutal honesty, I’m all ears. At this point, I just want to know what I can improve on.\n\nThanks for reading.\n",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 133,
    "downs": 0,
    "created_utc": 1755283090.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Asks for resume tips and networking strategies; seeks advice.",
    "composite_score": 3.7343767661357417
  },
  {
    "score": 106,
    "title": "Data Scientist vs Data Analyst – The Actual Difference",
    "selftext": "What a Data Analyst Does :\nA data analyst is the person a company turns to when they already have data and need to understand it. The job is about taking raw information, cleaning it up so it’s usable, and then presenting it in a way that makes sense to people who don’t live in spreadsheets all day.\nYou might pull numbers from a database with SQL, organize them in Excel, and then create dashboards or charts in Tableau or Power BI.\nMost of the work focuses on describing what happened in the past and figuring out why. For example: “Why did sales drop last quarter?” or “Which product category is growing the fastest?”\nAnalysts live in structured data (tables, rows, columns) and need to be able to explain their findings clearly to non-technical audiences.\n\nWhat a Data Scientist Does :\nA data scientist goes beyond explaining the past. The role is about building models and algorithms that can make predictions or automate decisions.\nThis means more coding (usually in Python or R), heavier use of statistics, and sometimes machine learning.\nInstead of just answering “Why did sales drop?” a data scientist might build a model that predicts which customers are likely to leave next month, so the business can take action in advance.\nData scientists often deal with messier, unstructured data like text, images, or logs, and they run experiments to test different approaches. The role sits closer to engineering than business operations.\n\nMindset Difference :\nAnalysts focus on What happened? and Why did it happen?\nScientists focus on What’s likely to happen next? and What should we do about it?\nAnalysts interpret the past; scientists try to shape the future.\n\nSkills and Tools :\n\nAnalyst: SQL, Excel, Tableau, Power BI, basic stats, business domain knowledge.\n\nScientist: Python/R, scikit-learn, TensorFlow, advanced stats, machine learning, some data engineering.\n\nCareer Paths : \nAnalysts often grow into senior analyst or BI roles, or add technical depth to move into data science.\nData scientists can progress into ML engineering, AI research, or lead data teams.\nPay is generally higher for data scientists, but the technical bar is also higher.\n\nWhich Role to Choose :\nIf you like telling a clear story with data and working closely with decision-makers, start with Data Analyst.\nIf you’re drawn to coding, algorithms, and building predictive systems, aim for Data Scientist but, be prepared for a steeper learning curve.\n\nBottom Line :\nBoth are valuable. Analysts explain the past. Scientists predict the future.\nThe best choice depends on whether you want to interpret data or build tools that act on it.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 106,
    "downs": 0,
    "created_utc": 1755070863.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains the difference between data scientists and data analysts with examples.",
    "composite_score": 3.356989398541013
  },
  {
    "score": 89,
    "title": "Why does everyone seem to be choosing data science these days?",
    "selftext": "I keep seeing a lot of people jumping into data science especially those without a tech background. Curious why this field is getting so much attention compared to others like cloud, web dev, or cybersec.  Is it the salary hype? the job flexibility? or just that it sounds cooler than traditional dev roles?  I’m personally torn between data science and going deeper into backend/web dev, so just wanted to hear from folks who’ve already picked a path. what made you choose data over other domains, and was it worth it?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1753626896.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question about why people choose data science and what path to take.",
    "composite_score": 3.4668405494535817
  },
  {
    "score": 70,
    "title": "H-1B: Laid off and struggling to find a Data Engineer role before grace period ends",
    "selftext": "Hey everyone,\n\nI’m in a really tough spot right now and could use some advice or leads. I was laid off from Amazon on Sept 12th, and since I’m on an H-1B visa, my 60-day grace period is already running. My last day to find something is Nov 10th.\n\nI have around 2 years of experience as a Data Engineer — worked at Amazon, State of Illinois, and earlier in India. My background is mostly in SQL, Python, AWS (Glue, Redshift, S3), ETL pipelines, Power BI, and some Azure (Synapse, Data Factory).\n\nI’m based in Texas, but I’m open to remote or relocation if it helps secure a quick H-1B transfer. At this point I’m open to both full-time and contract roles.\n\nThe situation honestly isn’t great, and I’m feeling pretty anxious with the clock ticking. If anyone knows of companies, recruiters, or even staffing agencies that are currently hiring Data Engineers and willing to file H-1B transfers, I’d be super grateful if you could point me in the right direction.\n\nThanks a lot for reading this. Any help, advice, or connections would mean the world right now.\n",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1759070320.0,
    "media": null,
    "is_video": false,
    "num_comments": 147,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal job-seeking request for leads and guidance on H-1B transfers.",
    "composite_score": 3.5288892064165545
  },
  {
    "score": 72,
    "title": "21(F), overwhelmed by AI/ML/Data Science… starting to second guess everything.",
    "selftext": "I’m 21 and really want to get into a product-based company in an AI/ML or Data Science role. But the deeper I go, the more overwhelmed I feel. Every field machine learning, deep learning, LLMs, MLOps feels so huge on its own. Everywhere I look, people say you need to know “everything” to stand a chance.\n\nIt’s getting to the point where I’m second-guessing every commitment I make. One day I feel confident about ML fundamentals, the next day I feel like I’m behind because someone else is working on LLM agents or advanced math or Kaggle competitions.\n\nI want to stay focused and consistent, but the amount of information out there is making me feel lost, confused, and honestly a bit scared that I’ll pick the wrong direction and waste years.\n\nHas anyone else felt this? How do you deal with the pressure of choosing the “right” path in AI/ML? And how do you avoid the feeling that you have to know the entire universe before you can even apply for a job?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1763925139.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Overwhelmed emotional post seeking coping strategies for choosing AI/ML paths.",
    "composite_score": 3.2716867781292525
  },
  {
    "score": 70,
    "title": "Why is it so hard for graduates to land data science jobs in a \"growing\" field?",
    "selftext": "Data science is supposedly gonna become more and more of one of the most sought after professions, but for graduates, the job hunt is rough let's be honest. Most entry-level roles still ask for 2–3 years of experience, and even internships are insanely competitive. At the same time, bootcamps, online certs, and university programs are flooding the market with new grads all chasing the same limited pool of junior roles.\n\nThe U.S. Bureau of Labor Statistics predicts 35% growth in data science jobs by 2032, but some recent estimates suggest that up to 50% of DS graduates remain unemployed or underemployed months after finishing their programs. And the roles that do exist often require a massive list of skills—cloud, ML, SQL, dashboards, stats, and production-level code—basically expecting a full-stack ML engineer for a junior salary.\n\nThe growth is there, but anyone else feel like it's only if you're already in the industry?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1748958211.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Analytical discussion about the data science job market and growth; explanatory in nature.",
    "composite_score": 3.3903829939180254
  },
  {
    "score": 70,
    "title": "AI/ML Interview",
    "selftext": "Today I had an interview for AI/ML internship. In which they asked me about the core concepts of machine learning. In depth. Like PSA, Random forest, XG boost how does it work internally. Explain to me in depth. and many more question.. Then they took my coding test for 30 minutes( I solved only 2). In it they asked me questions of advanced DSA. Even after taking so much interview, they said that I haven't asked about deep learning and LLM yet because I don't have time. Do you think such an interview should be conducted for a 6-month internship? If it is for a full time job, then it is fine. But such an interview for an internship? It is too much.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1754484913.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Frustration with internship interview length and difficulty; venting.",
    "composite_score": 3.1183489717428876
  },
  {
    "score": 64,
    "title": "I’m a data analyst with 6 years of experience—what’s the best way to break into data science or AI before it’s too late?",
    "selftext": "I’ve been working as a data analyst for the past six years and have experience with SQL, Python, BI tools, and basic statistics. I’ve been trying to transition into data science or AI, but I feel stuck.\n\nI’ve taken a few deep learning specialization courses from coursera, tried some Kaggle competitions and notebooks, and even worked on a few personal projects—but none of them have given me the kind of practical exposure or confidence I’m looking for.\n\nI’m worried I might be falling behind. What’s the best way to actually learn and apply data science/AI in a meaningful way? I’m looking for something that builds real skills—not just more videos or toy datasets.\n\nAny advice or paths that worked for you would be really appreciated!",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1750968924.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asking for guidance on breaking into data science/AI; no clear model or steps.",
    "composite_score": 3.3114433523068367
  },
  {
    "score": 58,
    "title": "Data Scientist → Quant Engineer: Is this path real, and is it actually worth it?",
    "selftext": "Hi everyone,\n\nI’m(21F) currently a **final-year student doing an internship at a tech startup**, working mostly in **data engineering \\\\ data science**, and I’ve been seriously thinking about where I want to end up long-term.\n\nLately, I’ve been really drawn toward **quant engineering** the math-heavy, systems-driven side of finance and I’m curious if anyone here has **actually made the transition from data science (or a similar role) into quant roles**.\n\nA few things I’d love honest input on:\n\n* Have you (or someone you know) gone from **DS/ML → Quant Engineer / Quant Research / Quant Dev**?\n* How realistic is this path **without a PhD in math/physics**?\n* What skills ended up mattering *way more* than expected (math, C++, probability, market knowledge, etc.)?\n* What skills did you think would matter, but didn’t as much?\n* Looking back — **was the effort worth it**, or would you choose a different path today?\n\nI’m not chasing “quant” just for prestige or comp — I genuinely enjoy math, modelling, and building systems — but I *also* want to be realistic about:\n\n* the opportunity cost\n* the mental load\n* and whether the day-to-day work matches the hype\n\nRight now, I’d say my resume is fairly solid for a data science role, but I’m trying to decide whether it’s worth investing the **next 1–2 years** deeply into quant-specific skills.\n\nWould really appreciate **brutally honest takes**, especially from people already in quant/trading/research roles.\n\nThanks in advance",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1765998881.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Examines a possible career transition and what matters in the path; seeking input.",
    "composite_score": 3.2403860338172823
  },
  {
    "score": 59,
    "title": "Why Data Science is still one of the most rewarding careers right now!!",
    "selftext": "Yes, the hype cycles come and go. Yes, you'll spend days cleaning data before you train a single model. But here's the thing, few jobs let you directly turn raw information into decisions that impact real people.\nData science isn't just about code or algorithms. It's about: Uncovering insights no one saw before, Turning messy data into meaningful stories, Building solutions that make businesses, products, and lives better\nAnd the best part? The demand for data driven decision making is only growing. Every industry, from healthcare to sports to entertainment, is realizing they need people who can bridge the gap between data and action.\nSo if you're early in your journey and feeling stuck, remember, every dataset you clean and every model you build is sharpening your skill to solve bigger, more impactful problems.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1754929803.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Positive argument about why data science is rewarding with supporting ideas.",
    "composite_score": 3.049362590794747
  },
  {
    "score": 54,
    "title": "What master’s degrees are actually worth it right now (for a Stats/Data Science grad)?",
    "selftext": "Hi,\n\nI'm a recent grad with a B.S. in Statistics and Data Science from a U.S. university, and I’ve been having a tough time landing a job.\n\nI’ve been thinking about applying to grad school so I can keep building skills while I’m unemployed, but I don’t want to waste time or money on a degree that won’t be relevant in the next few years or help long-term. I’m also open to pivoting if data science isn’t as sustainable as it used to be.\n\nFor anyone working in the field, what master’s degrees are actually worth pursuing right now? Which ones still hold weight or will stay relevant in the future (Data Science, Analytics, CS, something else)?\n\nAppreciate any advice!!!",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1761606111.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question about which master’s degrees are worth pursuing; seeking guidance.",
    "composite_score": 3.15622660750304
  },
  {
    "score": 53,
    "title": "Insight from a Senior Data Scientist that stuck with me",
    "selftext": "I worked in a growth engineering team (running those A/B experiments and thinking in terms of conversion funnels and the like) and I would interface with a Senior Data Scientist during various projects. There was a talk that this data scientist gave and one point from his talk sticks with me today:\n\n  \n\"Sometimes the best solution to a data science problem is using simple techniques like running linear regression on Google Sheets\"\n\n  \nBusiness impact + interpretability &gt;&gt;&gt; \"a complicated ML solution\"\n\n  \nI keep this quote in the back of my head even as an engineer and it's a pretty good forcing function\n\n  \nwhat do you guys think?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1754962216.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares a professional insight and invites opinions on its takeaway.",
    "composite_score": 3.067618220512106
  },
  {
    "score": 48,
    "title": "MS in Data Science to Break $120K? Currently Making $92K as a Data Engineer — Worth the Debt?",
    "selftext": "Hey everyone —\nI’m at a career crossroads and could really use some input from others in the field.\n\nI’m a Data Engineer in Florida making $92K with ~4 years of experience (DE and DA roles). I’ve worked at companies like ADP, DHL Supply Chain, FedEx, here’s a quick snapshot of my background:\n\n\t•\tLanguages: Python, R, Apache Spark, Pandas, DAX, SQL, JavaScript, PowerShell\n\t•\tTools/Platforms: Power BI, Tableau, SSIS, SSMS, Toad, Excel, Snowflake, Salesforce, SolarWinds\n\t•\tCerts: Azure Data Engineer Associate (DP-203), Power BI Data Analyst (PL-300)\n\t•\tI’ve built and deployed projects in forecasting (ARIMA, GARCH), dashboard automation, and data scraping (Google API)\n\nLately I’ve been applying around and keep getting offers in the $90–100K range, which doesn’t feel like enough of a jump. I’m considering getting a Master’s in Data Science at Eastern University, hoping it’ll help me:\n\n\t1.\tPivot more into DS/MLOps roles (I’m into stats + modeling)\n\t2.\tBreak into the $120K+ salary range\n\t3.\tBoost long-term career ceiling\n\nThe program would put me ~$10K in debt, which is manageable but still significant. I’m trying to figure out if the MS will actually unlock higher pay or if I’d be better off continuing to build experience and projects without it.\n\nMy questions:\n\n\t•\tWill the MS actually help me break into $120K+ roles? Or are there better routes to get there?\n\t•\tHas anyone successfully made the DE → DS or MLOps transition without a graduate degree?\n\t•\tIs the Eastern University program respected or just another credential?\n\nIf anyone’s been in a similar spot or made the jump I’m aiming for, I’d love your insights. Thanks in advance!",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1753053328.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Career/debt decision question about MS vs DS track; seeks input.",
    "composite_score": 3.043907420439617
  },
  {
    "score": 46,
    "title": "We are looking Data Scientist From Asia to Join our Team",
    "selftext": "# What We're Looking For (Requirements)\n\n\n\n* A solid foundational understanding of **Python** for data analysis.\n* Familiarity with core data science concepts (e.g., statistical analysis, machine learning algorithms).\n* A genuine passion for and exposure to **open-source technologies** (e.g., Jupyter, Git, SQL/NoSQL databases).\n* Strong analytical and problem-solving skills.\n* A \"growth mindset\" — you're eager to learn, receive feedback, and tackle new challenges.\n* Good communication skills and a collaborative, team-first attitude.\n* Bachelor's degree in Computer Science, Statistics, Mathematics, or a related field (or equivalent practical experience/projects).\n\n\n\n# Bonus Points (Preferred Qualifications)\n\n\n\n* **Experience or familiarity with IBM data flow tools (e.g., IBM Cloud Pak for Data, DataStage) is highly preferred.**\n* Personal projects or internship experience in data science or analysis.\n* Knowledge of SQL.\n* Experience with data visualization tools (e.g., Matplotlib, Seaborn, Tableau).\n\n  \ndm or comment if you interested",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1761023664.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Job posting with requirements; not a reader-facing list, step-by-step guide, or mental model.",
    "composite_score": 3.221191871438818
  },
  {
    "score": 47,
    "title": "Data Science Job Search",
    "selftext": "I have 7 years of data science experience and was principal data scientist at my previous company. I been looking for a job for a data science/machine learning job for 8 months and it is discouraging. I make it through technical rounds to behavioral at several FAANG (and non FAANG) companies but they have always decided to go with candidate with more years of experience. Any advice? Anyone hiring? I am the breadwinner and have run out of savings. \n\n\\*Also I have had companies where I applied to a job online and got an immediate rejection, then got referred for that same job and I had interviews. What is going on with the hiring system?\\*",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1755528032.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal job-search post asking for advice; primarily a request rather than advice with a model.",
    "composite_score": 3.151980695896715
  },
  {
    "score": 44,
    "title": "What kind of roles are 8–10 year experienced Data Scientists doing now?",
    "selftext": "Hey everyone,\n\nI was curious to hear from folks who’ve been in the data science space for around 8–10 years (or have seen colleagues at that level). What kind of roles and responsibilities do you currently have?\n\nAre you still hands-on with modeling and coding or have you transitioned more into leadership, strategy, or architecture roles (like AI Lead, Principal DS, or Head of Analytics)?\n\nIt would be great to know:What your current title and day-to-day work looks like - How your responsibilities have evolved over timeWhether you’ve specialized (e.g., MLOps, GenAI, Data Strategy, etc.) or moved toward broader business/management roles.\n\nTrying to get a better sense of what career progression typically looks like after a decade in this field.\n\nThanks in advance for sharing your experiences!",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1760756905.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question about roles for DS with 8–10 years of experience; discussion prompt.",
    "composite_score": 2.9537581433031845
  },
  {
    "score": 41,
    "title": "Data Science VS Data Engineering VS AI Engineering",
    "selftext": "Which of these 3 is likely to have the most job and career opportunities for new grads?\n\nI am very interested in data science and I have completed my bachelors degree in econometrics, but it seems like nowadays companies care more about the infrastructure of their data (data engineering) and building AI systems (AI engineering).\n\nAlso I feel like data science will be taken over by AI\n\nWhich path should I choose? I have taken a deep learning course and I didn't like it as much as stats/data science courses but it was okay I guess...\n\nEdit: by \"new grad\" I mean after a masters degree with 8 months of research assistant experience ",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1762014210.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Career-path question comparing DS/ENG/AI eng; request for guidance.",
    "composite_score": 2.9162949199257415
  },
  {
    "score": 40,
    "title": "Interview Experience for a Data Science role at Google",
    "selftext": "I’ve been grinding through interview prep lately and Google is one of the companies I’m aiming for this year. I’ve read the usual blog posts about their “structured interviews” and “behavioral + technical rounds,” but I feel like those don’t really tell you what it’s *actually* like.\n\nIf you’ve been through the process for a **Data Science** roleI there (even if you didn’t accept/land the offer), I’d love to hear:\n\n* How many rounds did you end up doing?\n* Was it more SQL/stats heavy, or machine learning focused?\n* Any curveball questions or unexpected formats?\n* Did they give you feedback after?\n\nHonestly just trying to get a sense of what to expect beyond what's out there. Any stories, advice, or “I wish I knew this before” moments would be awesome.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1755050873.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests Google interview experiences; information-seeking post.",
    "composite_score": 2.8983478745588545
  },
  {
    "score": 40,
    "title": "I need to accept that I’ll never get a Data Science role.",
    "selftext": "I studied Data Science at a massive SEC school and got my degree in May of 2024, and despite getting glowing reviews at my internship, I couldn’t secure a full time role due to budget cuts at the company I interned at. \n\nFast forward 9 months, 800+ applications, and a part-time job at my local grocery store later, I finally land a role in B2B sales at a Fortune 500. \n\nIt didn’t take me very long to figure out that I am not good at sales and that I wouldn’t make it very long. I started this job in May and the fact that I made it this far is a shock to me, because they love to fire due to underperformance. I can only coast for so long. I need to get out before I get put on a PIP, because if I get put on a PIP and I have nothing lined up, I’m cooked.\n\nI’m mainly looking in Houston, but am open to remote/hybrid roles, and am willing to relocate. \n\nI feel defeated because even though I have work experience now, it’s not in anyway related to data science.\n\nI’m kind of ranting on Reddit because networking has been hit or miss for me. \n\nAsk me anything, and I can elaborate.\n\nMy top technical skills are in Python &amp; R, but I have experience in Tableau, SQL, ArcGIS, and Java.\n\nEDIT: Fixed for typos",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1764446750.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.9,
    "category_rationale": "Explicit emotional vent about never getting a DS role; strong negative stance.",
    "composite_score": 3.0673178788948734
  },
  {
    "score": 39,
    "title": "Finding part-time or temporary work while job hunting",
    "selftext": "I'm sure there must be other posts on this, but I'm struggling to find some recent ones. Are there any ways to find part-time or temporary data science work? I'm in the process of job-hunting and could use some extra cash. I've heard about part-time or hourly gigs, but I haven't seen any great information about how to find them. A lot of job postings that mention hourly work or contract work on LinkedIn or other places seem a little scammy so it's hard to tell.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1764089515.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asking about part-time/temporary DS work; information-seeking.",
    "composite_score": 2.816650614351775
  },
  {
    "score": 39,
    "title": "Advice for Masters Degree",
    "selftext": "I’m (U.S.) planning on starting a ~1.5 year mechanical engineering masters program next fall and with a focus on data analysis and a specialization in robotics. My background is a BS in actuarial science and 2 years of experience as an actuary. \n\nI’m choosing this masters to hopefully give me opportunities in engineering/CS/data science because I’m not set on any specific field at the moment and want to keep my options open.\n\nI’m going to spend the next 8 months working part time and learning as much computer science and data science as I can and building a portfolio.\n\nDo you think that I can build enough of a resume with this plan to land a role in data science or even software by the time I graduate? I’m hoping that I can still enter a CS or data science field even if my masters is not in CS/statistics",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1764272592.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asking if a plan to build a resume during masters will help; guidance-seeking.",
    "composite_score": 2.820256333907075
  },
  {
    "score": 37,
    "title": "Is the Data Science Job Market Real Right Now? Feeling Completely Lost.",
    "selftext": "Hey everyone,\n\nI'm a 24-year-old from India with a recently completed Master's in Statistics. I've spent my time building what I thought was a solid skillset: I'm proficient in Python, R, and SQL for analysis and machine learning, and I have experience with tools like SPSS and Tableau.\n\nBut I'm hitting a wall, and the frustration is real.\n\nEverywhere I turn, I'm getting conflicting and discouraging advice. People in my network, even those in the private sector, are telling me to abandon ship and \"just try for a government job,\" saying there's no future in the private sector for data roles. This is incredibly disheartening because I genuinely love working with data and want to build a career as a Data Analyst or Data Scientist.\n\nThe biggest problem is the complete lack of guidance. I have the technical skills, but I have no idea how to structure my resume to get past ATS systems or what specific things to prepare for interviews. It feels like I have the pieces but no instructions for the puzzle.\n\nSo, I'm turning to this community for some real talk.\n\n· Is the entry-level data job market as dead as people are making it out to be?\n· For those who recently landed a role, what did your resume look like? What are recruiters actually looking for right now?\n· Beyond just listing Python/SQL, what specific projects or portfolio pieces made a difference for you?\n\nAny advice, resource links, or even just a bit of reassurance would mean the world. What should my first concrete step be?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1761607789.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Feeling that the DS job market is bad; emotional frustration and confusion.",
    "composite_score": 2.8393742196406224
  },
  {
    "score": 41,
    "title": "2 years since graduation, still jobless. Getting mocked by relatives. Feeling lost. Please help.",
    "selftext": "Hi everyone,\n\nI’m posting this from a throwaway account because I feel embarrassed, but I really need help.\n\nI graduated with a Computer Science degree in 2023. Initially, I took a short break thinking I’d start soon, but due to personal struggles, self-doubt, and lack of proper guidance, I never landed a job. It's been almost 2 years now.\n\nI’ve tried to upskill — did courses in Python, Excel, Power BI, and SQL. I also explored some basic web dev (HTML/CSS) and tools like Canva, but I couldn’t finish everything properly. I feel stuck in a loop — every job wants experience, and I don’t even have the confidence to apply anymore.\n\nWhat hurts more is the way people around me talk. My relatives openly insult me now. \"Still no job?\" \"What do you even do all day?\" It’s mentally exhausting.\n\nI'm not lazy — I’m just lost. I want to work. I need to get out of this.\n\nIf anyone can help with:\n\n* A referral for remote/internship/fresher jobs.\n\n* Entry-level roles in data, content writing, tech support, admin.\n\n* Any advice or realistic roadmap to get back on track.\n\nI’d be really grateful. Even a kind comment would mean a lot right now.\n\nThanks for reading this far. 🙏",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1749487145.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Feeling lost after graduation; emotional pleas for help.",
    "composite_score": 3.2284306351450223
  },
  {
    "score": 34,
    "title": "Masters in Data Science Worth it?",
    "selftext": "I'm a quantitative econ undergrad with a minor in data analytics and when i started i knew i wanted to go into data science i learnt Python, SQL, R, SPSS and Tableau on my own, i'm even am working on some economic papers and journals submission that uses machine learning. I got interested in the programming side of it and thought as an econ undergrad it might be my best shot to enter the tech field while utilizing my foundations.\n\nIssue is i'm really worried about the job market officially the plan was masters in Germany but with people saying AI is a fad and that data scientist position is dying and data engineering and ML engineers are filled with PHDs i was wondering what i should do.\n\nEither i shift go towards the finance, statistics side or I remain in econ. Master in Data Science is beginning to feel like eggs in one basket that might backfire if demand contracts or hype dies down. Just wanted a consensus on the job market and any advice on what i should do.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1762361072.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal career question seeking consensus/advice; lacks clear steps or a model.",
    "composite_score": 2.866128035678238
  },
  {
    "score": 37,
    "title": "Burned out from endless data science interviews",
    "selftext": "I’m in the thick of applying for DS roles now, and every week feels like a grind. Some days I’m juggling take-home tasks, live coding rounds, SQL tests, and panel interviews… \n\nA few interviews ago, I had one where they gave me a small dataset with barely any documentation and asked me to discover patterns under pressure. I froze when they asked me to explain why I chose one feature over another. I panicked, tried to justify with vague intuition, and later realized I hadn’t even mentioned scaling or outlier handling.\n\nAfter that, I still drill algorithms, statistics, Python, but I'd also pair that with the usual: peer review, whiteboarding with a friend, flashcards for edge cases. And I started doing mock interviews with a little assist like Beyz or chatgpt to nudge me when I forget to ask clarifying questions or skip edge cases. \n\nI believe deep thinking and instinct are irreplaceable. But when you’re navigating a gauntlet of rounds and pivots, the difference often comes from noticing what you’d usually miss. The trick is using tools to sharpen your awareness, not drown it out. The path forward in DS interviews isn’t memorizing everything. it’s catching your blind spots under pressure.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1760706108.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.68,
    "category_rationale": "Provides explicit interview-prep steps (pairing, whiteboarding, mock interviews) for data-science interviews.",
    "composite_score": 2.7523326166239386
  },
  {
    "score": 34,
    "title": "What programming questions should I focus on for Data Science roles? (FAANG)",
    "selftext": "Hi all,\n\nI’m currently working as a **Data Analyst / Business Intelligence Analyst** in an industry role and preparing to transition into a **Data Science / more technical role**.\n\n**Background:**\n\n* 3–4 years of industry experience\n* Master’s in Business Analytics\n* Strong in **intermediate SQL**\n* **Intermediate Tableau** (dashboards, data storytelling)\n* Good grasp of **statistics**\n* Foundational understanding of **Data Science &amp; ML concepts** (theory-level)\n* Recently started learning **Python**\n\nMy goal is to maximize my chances of getting hired for a **data science / tech-leaning analytics role**, so I want to be very intentional about *what I practice*.\n\nI’m confused about the **type of programming questions** I should focus on:\n\n* Should I spend time on **basic Python problems** like:\n   * star patterns (pyramids, diamonds, rhombus)\n   * number patterns\n   * very beginner control-flow exercises\n* Or should I **skip these** and focus directly on something else?\n\n**What I’d love guidance on:**\n\n1. What kinds of **Python/programming questions actually matter** for DS/DA interviews? (eg- Should I spend time on  **problems** like: star patterns (pyramids, diamonds, rhombus, number patterns)\n2. What should I **prioritize** given my background?\n3. What should I **avoid spending too much time on**?\n4. Any recommended **practice resources or question types** that are realistic for industry DS roles?\n\nI’m not trying to become a hardcore software engineer — I just want to spend my limited prep time on things that actually improve my **hireability**.\n\nWould really appreciate advice from people currently working in DS roles in FAANG or similar🙏",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1767312249.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Asks what programming questions matter and aims to refine focus with a guiding mental model.",
    "composite_score": 2.88844484482669
  },
  {
    "score": 31,
    "title": "Is a graduate certificate worth it?",
    "selftext": "Compared to having nothing tech-related at all? Or is it not worth my time?\n\nIm planning on transitioning to Data and trying to find a middle-ground between \"no certification/degree\" and \"Bachelors + Masters\".\n\nOn paper a graduate certificate makes some sense, but i have no idea if employers would care enough?\n\nIf I have demonstrable skills/portfolio without any degree/certificate and the same demonstrable skills/portfolio with a graduate certificate, would that boost my chances of employment?\n\nWhat do you guys think?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1763419406.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Question about whether a graduate certificate is worth it; lacks actionable guidance.",
    "composite_score": 2.805713996159025
  },
  {
    "score": 29,
    "title": "Are people just focusing on the wrong things when searching for jobs?",
    "selftext": "My background is strong in certain aspects (theory, relatively publicly prominent work, etc.) but weak in a really, really crucial one (I have zero industry experience, coming from academia!). In light of many friends I thought were far more qualified than I, I kind of ignored their suggestions for job applying (apply literally everywhere!) in light of their experiences (I think my friends are pretty consistent with most of the community; something like a 5% interview rate and \\~1% offer rate? brutal.). I applied to maybe 15 or 20 what I considered \"safety\" jobs; jobs that paid kinda bad relative what I thought I was worth, with much lower tier companies (startups in my areas of expertise, small businesses, etc). I got either no response (\\~8 of the 20) or straight rejected (\\~12 of the 20) from all of these, over 2.5 months. Literal 0 interviews.\n\nFor the jobs I actually wanted, I did a lot more due diligence than anybody I know. I'll use meta as an example (note: I did not actually end up applying to meta, but for sake of comparison). I found people on linkedin using search tags (Meta + my degree + &lt;desired position&gt;) who looked a lot like me either currently or in their past. And then I cold messaged them. A decent number of them (maybe 3-8 per company, basically just until I got a reply). Asking for advice on their transitions, how they went, etc. I prepped for each of these video chats like you would for a behavioral interview. To my surprise, about 50% of the people I contacted (many of whom were extremely high up) were more than happy to help out. Several actually looked at my resume and gave very helpful tips. I got multiple good conversations out of most of them, as well, so it wasn't just a 1-off video chat. Several put me in direct contact with HMs for the jobs I wanted, or PMs. I ended up with referrals from people whose titles ranged from senior &lt;position&gt; to Director of &lt;division to which I was applying&gt;. Obviously this took a while, but in the 2 months I was implementing this approach, I got 3 job offers from what I considered \"reaches\" (2 FAANG + one top pharma) out of about 6 applications to these 3 companies, for a 50% return rate. I had only done this for 3 companies because it is a lot of time and effort obviously, but I was planning to do it for a lot more, as I didn't realize how successful it would be.\n\nSo, just a word of advice: network, network, network. To my surprise, it seems to matter a lot more than volume. As a disclaimer, I think I come off as quite intelligent and personable, so YMMV if that's not you. But people were very willing to help, much more so than I possibly could have expected, which got my foot in the door. Which in this job market, is kind of everything just because of how much volume there is for open positions (several of the FAANG jobs that I was offered had 500+ applications on linkedin alone; absolutely insane). So, before pressing submit on 200 job applications, think about whether you might get more mileage networking first. Maybe this is small-sample bias; I don't know. but 0% in the lower-tier pool vs 50% in what I consider the higher-tier is a kind of big disparity for it to be down to chance.\n\nEDIT: I will also add, it's a lot easier to press submit on 200+ applications than perhaps this took. But simultaneously, it's a lot better on the ego for this approach than getting rejected 20 times (or 200 times, if you extend my experience by a factor of 10).",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1758465800.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.66,
    "category_rationale": "Narrative includes concrete job-search steps (outreach, referrals) that readers could imitate.",
    "composite_score": 2.6503175972987747
  },
  {
    "score": 27,
    "title": "Should *I* become a data analyst/scientist?",
    "selftext": "Hello.\n\nI have strong attention to detail. Im logical. Im fairly sharp. \n\nI have a respectable degree, but I do not come from a background in tech.\n\nI wouldnt say im the most tech-savvy but i dont think im bad either.\n\nIm a good communicator through written words, not so much verbally in person. Which is why i would prefer a job that would allow me to work remotely and/or minimize contact with people.\n\nThat is why Im considering being a data analyst/science, because i want to make a decent enough living through something that will leverage my strengths and minimize my weaknesses.\n\nBased on what Ive said, do you think i would be a good fit?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1762987319.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.56,
    "category_rationale": "Asks if a data-analytic path fits; no concrete model or steps offered.",
    "composite_score": 2.8453388782593554
  },
  {
    "score": 28,
    "title": "Data Scientists Needed!!",
    "selftext": "Hey Everyone, \n\nMy team is working a project for one of our clients. Anyone with 3-5+ years of exp in Data Science please DM me!! Required skills are 4+ years of data scientist experience (deep expertise in LLM’s, Generative AI based projects, RAG, and search technologies), Strong understanding and experience with retrieval and answer generation pipelines within RAG based architectures, Curate, structure, and maintain domain-specific knowledge bases to integrate with LLMs. **MUST BE LOCATED IN THE US**, no C2C, w2 only*. **Candidates residing outside of the US will not be considered**",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1762198016.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Job posting with requirements; not a guidance or theory post.",
    "composite_score": 2.8610969968484343
  },
  {
    "score": 29,
    "title": "32 y/o shifting from Data Analytics to Data Engineering— too late for me?",
    "selftext": "I'm 32 and have been working as a BI developer/data analyst, with hands-on experience in SQL, dbt, Tableau, and data modeling — plus a bit of orchestration and some exposure to cloud tools.\n\nLately, I’ve been trying to shift into data engineering. I’ve completed some well-known DE bootcamps and gone through a few popular books, but I still lack real-world data engineering experience.\n\nIs it too late to make this transition? Would I need to start from a junior role, or would companies consider someone with my background?\n\nI’d really love to hear from anyone who’s made a similar pivot — how did you get hands-on experience and break into the role?\n\nThanks in advance :)",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1756579196.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Questions about transitioning to data engineering; seeks advice rather than a model.",
    "composite_score": 2.722345715408799
  },
  {
    "score": 28,
    "title": "My university switched my major from Software Engineering to Data Science. What should I do?",
    "selftext": "Hi everyone,\n​I'm feeling lost and would appreciate some advice. Throughout my high school years, I've been focused on software development, building websites, apps, and even working with Arduino. I've always been passionate about Software Engineering and preparing myself for that specific field.\n​I was planning to pursue Software Engineering at my university, but I just found out that my international track only offers a Data Science major. This sudden change has put me in a tough spot. I'm worried about the heavy focus on math and statistics in data science, and I'm not sure if it's the right fit for me.\n​My main questions are:\n\n• ​Is the difference between Software Engineering and Data Science significant enough that it would completely change my career path? Can I still work as a software engineer with a degree in data science?\n\n\n• ​Should I consider transferring to another university that offers a Software Engineering program (even though it will take a year or so), or should I stick with my current university and major in Data Science?\n​\n•  Is the coding in Data Science so different that I'd struggle to learn Software Engineering on the side?\n\n\n​Any advice from people in the industry, especially those who have made a similar switch, would be incredibly helpful.\n\n**Update**: They said after 2 years of (préparatoire) in the Engineering cycle I could switch to the normal path and study SE in French\n\nShould I go with that?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1758035402.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks how to handle switching majors and what it means for career; seeks guidance.",
    "composite_score": 2.883078844816092
  },
  {
    "score": 27,
    "title": "Data Science Internship Interview Prep",
    "selftext": "I am a sophomore currently studying data science and I want to get interview ready, but I'm not entirely sure what to expect in interviews and what type of technical questions they ask. I am also not sure what resources I should use to get ready for interviews. Like for example, comp sci majors use LeetCode to grind for interview prep. What should a data science major use? And how do the interviews generally go?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1756679199.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks what to expect in data science internship interviews and resources; simple question.",
    "composite_score": 2.7541297074956375
  },
  {
    "score": 27,
    "title": "MSc Data Science vs MSc Machine Learning in the UK - Which is better for career &amp; salary?",
    "selftext": "Hi everyone,\n\nI’m applying for a Master’s in the UK for the **Sept 26/Fall intake**, and I needed some guidance regarding program choice and future opportunities.\n\nMy Profile/my\\_qualifications:\n\n* 1 year of experience as a **Data Analyst**\n* **IELTS: 8 bands**\n* **7.5 GPA**\n* [**B.Tech**](http://B.Tech) **IT – 2024 passout**\n* Applying to: **UCL, King’s College London, University of Manchester, University of Edinburgh, University of Bristol**\n* Goal: Become a **Data Scientist** or **Machine Learning Engineer**\n\nI’m confused between choosing **MSc Data Science** or **MSc Machine Learning**.  \nFrom a career and salary perspective, which degree provides better opportunities in the UK job market?\n\nAny suggestions, experiences, or insights from current students or grads would be super helpful.\n\nThanks in advance!",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1766060591.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question seeking guidance on degree choice with no list or steps.",
    "composite_score": 2.8521447053276283
  },
  {
    "score": 26,
    "title": "Is it too late to start with data science at 28?",
    "selftext": "I’ve been working in finance for a few years and lately I’ve been thinking about transitioning into data science or analytics. I’m 28 now and starting to wonder if I’m already too late to the game.I’ve seen programs like Intellipaat, Great Learning, etc that offer structured courses with job support but before I spend money or time, I want to know if anyone’s actually made the switch this “late.”Is it still worth jumping in? Did a course help you get your foot in the door?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1753636941.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal question about whether starting data science at age 28 is feasible.",
    "composite_score": 2.9493654359763872
  },
  {
    "score": 26,
    "title": "Data Scientist/Analyst or Related Jobs after Graduation",
    "selftext": "Hi everyone,\n\nI’m about to graduate with my bachelor’s in Computer Science, but I’ve struggled to choose a focus until now. I didn’t pursue internships during school — a decision I now realize was a mistake — and instead worked full-time due to financial and personal responsibilities.\n\nI currently work in the banking industry as a senior fraud analyst, where I audit fraud claims and contribute to internal projects. While my role involves some data work, it hasn’t been enough to land interviews for tech positions so far.\n\nI’m interested in transitioning into a data science or data analyst role, but I’m unsure how to position myself with no formal tech experience or internship background. Should I focus on building personal projects? How can I best showcase my skills on a resume, or is it too late now that I’ve already graduated?\n\nWould really appreciate any advice from others who’ve been in a similar situation or who’ve made the leap from a non-traditional path.",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1749408864.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asking for advice on transitioning careers without internships; not a how-to.",
    "composite_score": 2.7749734115259472
  },
  {
    "score": 24,
    "title": "Experienced Data Analyst (4 YOE) transitioning to Data Science. Strong in Python/SQL and ready to learn.",
    "selftext": "Hi everyone,\n\nI'm reaching out to this community for some help. I've spent the last 4 years working as a Data Analyst, solving business problems with SQL, Tableau, and Python. To take my skills to the next level, I recently took a career break to complete a Data Science program.\n\nI'm looking for an opportunity in the area of data science.\n\nMy Skills &amp; Projects:\n\n* Strong foundation in Python (Pandas, Scikit-learn) and Advanced SQL.\n* Built several projects including a churn prediction model, a customer segmentation analysis, and even a basic RAG pipeline using LangChain.\n* Currently getting better in Deep Learning and NLP.\n\nGoal:\n\nI am looking for a chance to work on live projects, learn best practices for model deployment (MLOps), and contribute to a real product. I'm a fast learner and I'm ready to work hard.\n\nIf you know of any entry-level Data Scientist or Data Analyst roles where I could be a good fit, I'd be very grateful for any leads.\n\nHowever, to demonstrate my capabilities and contribute value upfront, I am also open to a short-term, unpaid collaboration on a well-defined project. This could be a great way for a startup or a small team to tackle a specific analytical problem risk-free.\n\nI am open to remote roles globally. Happy to provide my GitHub and LinkedIn for more details. Please just send me a DM. Thanks for reading!\n\nSincerely\n\npale-blue-dotter",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1757818479.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests job leads and describes career transition; not a step-by-step guide.",
    "composite_score": 2.577411684825456
  },
  {
    "score": 22,
    "title": "To work as a Data Analyst, are these skills from YouTube enough to get a job?",
    "selftext": "I’m planning to become a Data Analyst and want to learn everything from YouTube for free.  \nIf I learn these skills, will it be enough to get a job or internship?  \n\nHere’s what I plan to study:  \n- Microsoft Excel  \n- Google Sheets  \n- SQL  \n- Python  \n- pandas  \n- numpy  \n- matplotlib  \n- seaborn  \n- Power BI  \n- Tableau  \n- Statistics and basic Maths  \n\nIf I learn all these properly and build some projects, **will I be able to get a job as a Data Analyst?**  \nOr do I need to learn something more?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1761887166.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asking if self-study via YouTube will lead to employment; seeking guidance.",
    "composite_score": 2.788197840353612
  },
  {
    "score": 21,
    "title": "People need to get really good at a few things",
    "selftext": "Hey everyone, not to insult or give advice, but from what I have noticed from people around me in school(average university at best) the people who get the few data science jobs out of college were really good at one thing. The reason I say this was because I recently attended a career fair at my school, and some  guys were saying that the market sucks(it absolutely does) and their friend who knows all of these languages and has done a bunch of projects can’t get a job. \n\nI hate saying this but I feel like applying your skill set deeply, especially at the undergrad level, shows that you can seriously think. Picking up a bunch of skills to briefly talk about it is not what interviewers want to see. They like to hear passion and genuine knowledge not the minimum in every relevant topic. \n\nIt’s unfortunate that everyone thinks that know all of these languages is going to get them a job. There are a few main ones(Python, SQL,R) that you definitely need to know but just hopping around from language to language because you heard one company looks for it is ridiculous.  \n\nIt genuinely all comes down to how much you know about it and if you can show that on an interview or at a career fair. I spoke to a few people after and none of them got interviews and it felt like they just wanted to tell recruiters they know everything when they don’t.\n\nHope people see my perspective, it kinda sucks that some people give the wrong guidance but this is my opinion. \n\nGood luck w your careers fr fr.\n\n\nAlso this one thing can be applying it to sports, getting really good at working with predictive models, etc.\n\n",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1759816427.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Opinionated vent about misaligned focus on many languages and expectations.",
    "composite_score": 2.6079376786541966
  },
  {
    "score": 22,
    "title": "The ONE time I forget something I’ve used 1000x, I get rejected for it",
    "selftext": "Bit of a vent tbh.\n\nI’ve done live coding interviews before where the interviewer told me “even if your code errors at the end, you can still pass. We just want to see how you think”. Effectively I couldn’t complete the task fully in time, but I passed.\n\nYesterday I had a technical interview where we did 45 minutes of technical questions and 30mins of live coding (15 mins python, 15 mins sql). The SQL one was perfect, but on the Python one I completely forgot the .isin in df[df[a].isin(df2[b])]. I still narrowed down the answer to maybe 75% of the task, but the indices were reset when the task asked for the original index, so it “failed” the runs because of it even tho the other parts of the logic were fine and the rest of the output was fine too. It’s stupid because I’ve used .isin a million times before.\n\nI obviously was under pressure but I tried to keep my chill and go thru possible solutions too, until there was no time left, so I submitted it.\n\nApparently they still rejected me for it, because the technical questions part was great. I personally think there should be some degree of error even in live coding exercises, you’re not supposed to code pressured like in an interview everyday and it’s odd that just because of the indices it would give 0 marks.\n\nBut yeah just frustrated because I’ve done this literally hundreds of times before. And actually just made this post to say, it’s funny how sometimes you think you did really well in an interview but you actually fail, and when you think you failed miserably you pass ",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1752672292.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Emotional vent about interview experiences and frustration with live coding.",
    "composite_score": 2.5042768560247213
  },
  {
    "score": 23,
    "title": "Plaid is hiring data scientists and data engineers, happy to refer qualified candidates",
    "selftext": "Currently an SDR at Plaid\n\nWe’re hiring experienced data scientists and data engineers at least 5 years of experience needed \n\nIf you’re interested, shoot me a DM with you’re linkedin and/or resume\n\nVisit these links to see if you qualify\n\nIF YOU WOULD LIKE A REFERRAL, DON’T APPLY UNLESS I WONT BE ABLE TO REFER YOU\n\nhttps://plaid.com/careers/openings/engineering/new-york/experienced-data-scientist/\n\nhttps://plaid.com/careers/openings/engineering/san-francisco/data-engineer-data-engineering/\n\n",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1749868148.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Referral/post about hiring openings; not a how-to or advice piece.",
    "composite_score": 2.7578474942632587
  },
  {
    "score": 22,
    "title": "finding a job after college",
    "selftext": "I recently graduated from a university with my Applied Statistics BS. besides of having a ton of skills and hands on experience using every statistical software under the sun, I don't have any world experience using it. I know that it's hard finding a job, but what did others do? I choose this major so I would have the best chance of finding a job after college, with everyone saying i wouldn't have trouble finding a job, but i have. What is your guys advise?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1748648719.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question about finding a job after college; seeking advice.",
    "composite_score": 2.628818459041405
  },
  {
    "score": 22,
    "title": "Stay Resilient",
    "selftext": "Hello!\n\nIve been a silent watcher on this sub and have seen people struggle with getting a job in this market. I am about to graduate this week with my masters in data science in a niche subject from a big school. I have only been coding for 1.5 years and have learned everything in this timeframe. \n\nI see new grads struggling to find a job. I have been looking since September of this year as I am a December grad. While I have not been unemployed for an extended amount of time or unemployed in general, it is entirely possible to get a job with grit and pure will! \n\nAfter 3 months of job searching (probably applying to hundreds of positions), I am pleased to announce that I have been extended a job offer! \n\n Here are my stats: \n- school well-known for CS \n- many personal projects posted on git \n- 2 capstone projects (1 with a very well-known company) \n- 3.7/4.0 GPA\n- ~500 applications \n- 7 phone screenings \n- 6 interviews \n- 1 offer, 1 pending \n\nI am not writing to brag, I am writing to tell you all to BELIEVE IN YOURSELF AND STAY VIGILANT!!! ",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1765308713.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Motivational update about gaining a job offer; not instructional.",
    "composite_score": 2.3502884633774244
  },
  {
    "score": 21,
    "title": "Fresh graduate seeking junior level position (Python, R, Java)",
    "selftext": "As the title says I am a graduate from May 2025, living in the New England region. \n\nI have a Bachelors degree in Data Science. I have mostly been using Python since I’ve graduated but Java and R were the focus of my degree program along with a couple SQL courses. \n\nI have experience using PyTorch and have trained projects like sentiment analysis and CBW token embedding models. Additionally I have used/finetuned various pre trained models from sources like hugging face and torch hub for personal projects and learning such as object detection, image embedding, translation and sentence embedding. \n\nI have internship experience in Bioinformatics where I created dashboard tools with R Shiny to run RNA-seq with a user interface rather than scripting languages to increase accessibility for non-programmers. \n\nOne subject in data science I really enjoy is using feature reduction models to visualize high dimensional data (such as image embedding) in a way that I can see relationships and clusters in the images or data.\n\nSince I’ve graduated I have been trying to learn more full stack stuff to expand horizons. For example last month I developed and launched my first api for real time object detection using FastAPI and AWS EC2. Additionally this included my first JavaScript to interact with the api. I am always trying to learn new things and use new tools.\n\nIf anyone has any opportunities, job search advice, questions about my background, or is willing to review my resume please reach out!!! I am trying to be a more active member of the community and create a network!\n",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1763307511.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Job-seeking post with background details and a request for opportunities/advice; lacks a substantive how-to or list.",
    "composite_score": 2.3009833081820377
  },
  {
    "score": 23,
    "title": "What's the 20/80 for Data Scientist / Data Analyst interviews (especially internships)?",
    "selftext": "Hey everyone,\n\nI'm currently working a part-time job just to cover my expenses, and I’m trying to land a Data Scientist or Data Analyst internship. My time and energy are limited, so I need to focus on the 20% that will get me 80% of the way through interviews.\n\nI already know SQL and Python are important, but I’m looking for specifics and priorities. For example:\n\nWhat exactly should I know in SQL? Are CTEs, window functions, and joins enough, or should I go deeper into performance tuning or indexing?\n\nFor Python: is it enough to be fluent with pandas, NumPy, and matplotlib, or do I also need scikit-learn, statsmodels, etc.?\n\nHow much machine learning is actually expected at the internship level?\n\nDo I need to grind DSA (Data Structures &amp; Algorithms) at all for these roles, or can I mostly ignore it?\n\nWhat kinds of projects or case studies will make my resume stand out without taking forever to build?\n\nAnd finally, how much focus should I put on communication, storytelling, and business insight?\n\nPlease don’t give me vague \"just be curious!\" advice—I need real, actionable insights from people who've done these interviews (especially non-FAANG). I’m under time pressure, so I want to work smart.\n\nThanks in advance 🙏",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1751933342.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for actionable interview guidance and priorities but does not present a clear step-by-step or list in the post itself.",
    "composite_score": 2.519286866903428
  },
  {
    "score": 20,
    "title": "job offer salary HELP",
    "selftext": "Currently, I’m a Data Scientist II at a large, legacy company that was once a market leader but has since struggled to keep up. I think I’m underpaid for the market (95k) and after 3 years of experience plus a master’s and bachelor’s from good schools, I’ve been actively applying for new roles.\n\nI applied for a Data Scientist position at a big company. The job was listed with a salary range to 140k. In my application, without much thought, I put down $125k as my expected salary, mostly because I really wanted a new job.\n\nFast-forward: I made it through the interviews! and they have offered me the Senior Data Scientist role instead of the junior. so, a level higher than the one I applied for. Great news! they offered me $133k\n\nWhile this is a raise from both my current salary and what I originally asked for, it feels low for a Senior role. Especially knowing the range is different (-170k) than the junior one (-140k). When I asked if the salary could be adjusted given the title upgrade (in the first call to notify that I got an offer), they hesitated, were kind of vague but then said no and that this was calculated based on my experience. It feels strange to accept a salary that is lower than the max for the junior position, which they thought I was overqualified for? \n\nNow I’m wondering, should I push harder and ask for more from them? I’m very grateful for the offer and the career step forward, but based on market research, this seems low for the level and scope of the role. I don’t want to seem ungrateful, but I also don’t want to sell myself short like I did in my last job. I haven’t emailed them back yet about the offer so I still have the opportunity to ask officially about a salary bump since I am being hired in as senior.\n\nAny advice? Should I go grateful or greedy? I definitely want the job regardless. Also have realized I probably shouldn’t lowball myself in future applications. ",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1751059744.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Seeking salary negotiation advice; personal discussion rather than a how-to or list.",
    "composite_score": 2.493764288229891
  },
  {
    "score": 21,
    "title": "From economist to data scientist",
    "selftext": "Essentially been a government economist for 8 years and main thing I like about it is coding and programming. Mainly in R, but some python and excel. I have an undergrad and masters in economics. \n\nI’m genuinely wanting to switch now to become a pure data scientist, but the competitive market is slightly off putting. Wondering what the transition will be like. But I’ve got decent experience both in R and python which I’m trying to build. I’d like to think my government, policy and leadership experience would give me the edge in the job market. \n\nAny thoughts? ",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1766263377.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for thoughts on transitioning careers; request for guidance rather than a delivered model or steps.",
    "composite_score": 2.596894356975625
  },
  {
    "score": 19,
    "title": "How to get an entry level data job with no experience",
    "selftext": "Hi everyone! I recently earned my masters degree in data science and am now a bit lost (as expected). I have worked in higher education for the past couple years, but nothing directly within the data world. I use excel and google sheets to analyze the data in my current job, but that’s truly the extent.\n\nCan you please give me some advice on how to break into the data industry, what titles to go for, etc?",
    "subreddit": "DataScienceJobs",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1762452273.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests advice on breaking into data field with no experience; a simple question.",
    "composite_score": 2.420074989159953
  }
]