[
  {
    "score": 1581,
    "title": "A redditor showd concern about this design. I'd say this is genius and this is why...",
    "selftext": "Look, I don’t even care if this is milk for cats, from cats, or just regular milk in feline cosplay - the point is, this packaging is brilliant.\n\nForget the chaos it causes on shelves. Forget the poor store employee trying to align \"cat torso\" with \"cat butt.\" That’s not the designer’s job. The real win here is attention. This kind of design sparks curiosity, confusion, laughter - conversation. And in today’s world, conversation is currency.\n\nThe designer behind this didn’t just think about the shelf - they thought beyond it. They thought:\n\nWill people talk about it?\n\nWill they take photos?\n\nWill it go viral?\n\n\nAnd clearly, the answer is yes. That's marketing at its finest. You don’t go viral by playing it safe with minimal labels and boring layouts. You go viral by doing something so bold and unusual that people have to stop and engage.\n\nThis is what happens when a designer understands human psychology and branding - not just product placement. Honestly? I’d hire this person in a heartbeat.",
    "subreddit": "design_critiques",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1581,
    "downs": 0,
    "created_utc": 1752342364.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.97784212698954
  },
  {
    "score": 323,
    "title": "Looking for some feedback on my logo",
    "selftext": "I'm finishing school in 3 weeks and I'm trying to get my portfolio finished, but I have a section of t-shirts without any sort of unifying theme. So, I've come up with a 'fashion label' aimed mostly at xennials called Old Skull. I can't decide which of these I like the best. I'm also looking for some overall feedback to improve the design.\n\nI included the large image as well as a thumbnail so you can see the skull easier.\n\nThanks in advance!",
    "subreddit": "design_critiques",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 323,
    "downs": 0,
    "created_utc": 1743517940.0,
    "media": null,
    "is_video": false,
    "num_comments": 141,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.32918918239814
  },
  {
    "score": 197,
    "title": "Which packaging works better? All black or all gold?",
    "selftext": "Thanks all for your feedback, I took another stab at the packaging and would like your POV on which works better.\n\n(Pls mods don’t delete I am not selling these and do not have any form of a storefront and do need design help). \n\nI chose bright vivid colors for the treats to draw attention to the fact that dog treat coloring can be made with natural colors - turmeric, spirulina, sweet potato powder.\n\nThank you so much. \n\n",
    "subreddit": "design_critiques",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 197,
    "downs": 0,
    "created_utc": 1760722312.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.952410552847772
  }
]