[
  {
    "score": 2697,
    "title": "Smart Phones Ruined it",
    "selftext": "I started travelling back in 2013. My first trip was to Thailand.\n\nBack then people still used internet cafe's to talk with people back home. In hostels, people would play cards, boardgames, or use the local desktop computer to send emails to back home. They would watch movies in the common room, or chat with each other.\n\nNow you go to a hostel, restaurant, cafe, or even a boat tour, and everyone is just sitting around staring at their phones, or video chatting with people back home. If you try to talk to them, they roll their eyes like you're bothering them.\n\nI miss the good ol days. Using the Internet for finding information, then spending your days actually travelling, meeting people.\n\nNobody is bored, nobody is lonely because we're constantly connected to our old network.\n\nThis means everyone is lonely, everyone is bored.\n\nEdit: Obviously this struck a chord.\n\nFor those younger that say \"Maybe you changed\" or \"Hostels are still super social!\" You really don't know what you missed. \n\nGet off your stupid phone. It's a digital soother. Talk to new people.",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 2697,
    "downs": 0,
    "created_utc": 1748315497.0,
    "media": null,
    "is_video": false,
    "num_comments": 332,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.73,
    "category_rationale": "Emotional critique of smartphones ruining social interaction and travel culture.",
    "composite_score": 5.3897640620890455
  },
  {
    "score": 2216,
    "title": "After two years of being a digital nomad, I’m finally ready to admit that I hate it. Here are four reasons.",
    "selftext": "1. It’s exhausting. Moving around, dealing with visa restrictions and visa runs, the language barrier, airbnbs that don’t reflect the post, restocking kitchen supplies (again), the traffic, the noise, the pollution, the crowd, the insecurity of many countries, the sly business, the unreliable wifi, the trouble of it all.\n\n2. It gets lonely. You meet great people, but they move on or you move on and you start again in a new place knowing the relationship won’t last. \n\n3. It turns out I prefer the Americanized version of whatever cuisine it is, especially Southeast Asian cuisines. \n\n4. We have it good in America. I did this DN lifestyle because of everything wrong in America. Trust me, I can list them all. But, turns out it’s worse in most countries. Our government is efficient af compared to other country’s government. We have good consumer protection laws. We have affordable, exciting tech you can actually walk around with. We have incredible produce and products from pretty much anywhere in the world. It’s safe and comfortable. I realized that my problem was my privilege, and getting out of America made me appreciate this country—we are a flawed country, but it’s a damn great country.\n\nDo you agree? Did you ever get to this point or past this point? I’m curious to hear your thoughts. As for me, I’m going back home.",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 2216,
    "downs": 0,
    "created_utc": 1677241680.0,
    "media": null,
    "is_video": false,
    "num_comments": 852,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.68,
    "category_rationale": "Explicitly presents four numbered reasons as a list.",
    "composite_score": 5.47124020869825
  },
  {
    "score": 1955,
    "title": "Violently mugged in Buenos Aires and a new understanding of survival instincts (solo female)",
    "selftext": "I’m a Canadian woman in my 30’s currently working from Buenos Aires for the next few months. The purpose of this post isn’t to focus on the decisions that preceded my mugging, such as walking alone from La Boca to San Telmo at any time of day or the brand of shoes I was wearing. Rather, I aim to shed light on something often overlooked: our body's instinctive reaction to threats.\n\nFollowing my Airbnb host's suggestion, I walked from San Telmo to La Boca and spent a few hours there exploring. Around 12:30 pm, I decided to head back. After mapping out my route at a café and memorizing it to avoid having my phone out, I walked down a quiet residential block lined with small shops that would take me in the direction of San Telmo. Briefly distracted by a mother and daughter on the right side of the street, I suddenly noticed four men quickly approaching from the left. I locked eyes with the largest one, and his menacing look confirmed that I was in immediate danger.\n\nLogically, at 5'1\" and 110 pounds, I stood no chance against these guys. But logic was out the window. I turned my back to them, clutched my sling bag tight against my chest, and began to scream as they tackled me to the ground. I continued to scream and hold tight while they hit me and tried to cover my mouth. This lasted about 15 seconds until the realization that they could easily kill me finally overpowered the adrenaline coursing through my body, and I let go.\n\nI lost my iPhone, AirPods, Adidas Gazelles (yes, they even took my shoes), a credit card, and around $20 in pesos. My glasses were shattered, and I sustained minor cuts on my neck and arms. But my body's natural response to fight (resist) as opposed to fawn (give them what they want) went against everything I thought I'd do. The reality is, it’s impossible to predict how you will react in a similar situation, and easy to apply logic in hindsight.\n\nLike me, you may find yourself in the wrong place at the wrong time. Understanding your natural response to threats could be crucial in determining whether you defuse a threatening situation or unintentionally escalate it. The next time you hear a similar story, approach that person with compassion rather than judgment (victim blaming). Their resistance likely isn't driven by some flawed logic of protecting a phone; it’s an instinctive, primal fight for survival, regardless of the safety implications.\n\nHave you ever been in a situation where your instinctive response surprised you?\n\n**Edit**: Many comments have raised questions about my Airbnb host's involvement, and I can see how my initial wording might have given the wrong impression. To provide more context, I was at a cafe with my host on the morning of the incident. I mentioned feeling well enough to explore La Boca after being sick the entire previous week. I expressed a preference for walking since it was a nice day, and he suggested a route that included a park and a museum. I had planned to take an Uber back. Unfortunately, the incident occurred while I was attempting to walk back. It truly was a case of being in the wrong place at the wrong time.",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1955,
    "downs": 0,
    "created_utc": 1703702822.0,
    "media": null,
    "is_video": false,
    "num_comments": 754,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Personal anecdote used to explain survival instincts with underlying insight.",
    "composite_score": 5.420342326266177
  },
  {
    "score": 1951,
    "title": "It finally happened; I got drugged in Colombia. I wasn’t robbed, but it was close.",
    "selftext": "What’s scary is that it was done by someone I’d known for 2–3 years. He played the long game.  Getting drugged is a risk I’ve always known exists, and I want to share it as a warning. I just never thought this person would.\n\nMe and my “friend” arrived in Medellin from Bogota, dropped our stuff at a place he lined up for us to “stay, and we started at a hookah bar in El Poblado.  We ended up in a local neighborhood in Antioquia. I’d only had a couple drinks by then and at some point, my “friend” and someone he clearly knew offered me what I thought was a blunt. I only drank water at Antioquia and didn’t have much of the blunt, and I think that saved me.\n\nOver time, instead of coming down, I got more dizzy and confused. I smoke regularly and knew this wasn’t normal. I’m aware of scopolamine, and once the confusion increased despite no alcohol, I knew what was happening.\n\nI called them out, and they started to talk very openly in Spanish about how they expected to rob me. They knew I speak decent Spanish and they still didn’t care. I was already hip to the plan even before they told me though. I let them get me into an Uber back to where we were staying (I ordered it so I knew where it was going), but on the ride home I deleted banking apps, contacted my emergency contact, and called both 123 and the U.S. Embassy emergency line. I made sure my “friend” knew authorities were involved.\n\nWhen we arrived, I refused to go inside, demanded my stuff, and stayed on the phone with the police. I told this guy to get my things and this would all go away. He got my stuff like I demanded, I grabbed my backpack with the meds I desperately needed, ordered another Uber, and went straight to a hotel.\n\nKnowing Spanish was huge here, and knowing what to do and staying calm in the moment is the only thing that saved me. The police did nothing and neither them or the clinic staff spoke any English, and the general vibe was basically: if you got drugged, it’s your fault.\n\nStay alert. Even people you think you know can surprise you. Have an action plan too so you can execute it even if you’re only half conscious.\n\nEdit: For anybody still tracking this post or who sees it later, apparently, you can put scopolamine in certain sections of a blunt and pass the blunt to the victim when it is most concentrated. So. To anybody saying, “they were smoking it too”, that’s your answer.\n\nSource: I’ve heard this from several people from who live here and are familiar with the practice. ",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 1951,
    "downs": 0,
    "created_utc": 1766954599.0,
    "media": null,
    "is_video": false,
    "num_comments": 449,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.62,
    "category_rationale": "Narrative includes concrete steps taken to respond to drugging and safety guidance.",
    "composite_score": 5.314586070218344
  },
  {
    "score": 1759,
    "title": "After returning to the US for the holidays after traveling most of the past 6 months I can earnestly say…",
    "selftext": "Edit: for all the geniuses who bring up having a western salary… THAT IS THE FUCKING POINT AS THE AUDIENCE IS OTHER DNs. Obviously my post would pertain to our experience  \n\n\nThat outside of drinkable tap water the QoL in this shit hole far lags behind what most “3rd world” countries can offer at 1/5th the cost of living.\n\nLiterally everything seems more expensive, shacks in my area are going for 400k. Anything over a 3br is essentially a mil. Everyone is angry, stressed, and seemingly unhealthy to the point it is genuinely rare I see a skinny person outside the gym.\n\nOur food tastes like shit, I walk less, and feel considerably less safe DRIVING in Chicago than walking drunk at midnight in Asia. \n\nThe dating apps that got me literally hundred of matches of friendly attractive people willing to have a conversation is replaced with people acting like they’re doing you a favor despite offering significantly less in pretty much every desirable quality. It seems like there has been significant weight gain in the average American as well, which is surprising cause food is close to my rent bill for a luxury condo over seas\n\nMy private insurance does essentially nothing outside of  major, life altering, issues.\n\nIt is rare I see anyone look happy, almost everyone seems stressed and heavily medicated. We have 100% been dumbed down and I see more homeless people here than anywhere else. \n\nIf you are thinking of leaving the US take this as your sign to run. It’s incredibly depressing to be back and I Just booked my flight b to Europe in Feb.\n\nThe future of this country seems bleak. The worst place you can live with a western income is the west ",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 1759,
    "downs": 0,
    "created_utc": 1704203373.0,
    "media": null,
    "is_video": false,
    "num_comments": 1383,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Strong emotional critique of life in America after travel.",
    "composite_score": 5.31858071287452
  },
  {
    "score": 1620,
    "title": "Man spending over a month in Medellin, Colombia kidnapped and killed two weeks into his trip after an online date.",
    "selftext": "It has been a while since a report like this was posted in this sub, so I figured it would be worth showing that this is still a significant danger in Colombia. This well known (and really well respected) man from Minnesota was killed after meeting up with a woman he met online. For all the DNs considering Medellin/Colombia in general, please keep in mind the dangers involved with online dating there. A beautiful country no doubt, but Tinder just isn’t worth it there.",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1620,
    "downs": 0,
    "created_utc": 1702529353.0,
    "media": null,
    "is_video": false,
    "num_comments": 759,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "News-style report about a murder/kidnapping incident with no analysis.",
    "composite_score": 5.370189810988911
  },
  {
    "score": 1534,
    "title": "Digital nomad life is both the dream and the trap.",
    "selftext": "I broke free from the office 2 years ago. No more suits, no more commuting, no more pretending to care about meetings that should’ve been emails.\n\nNow I work from beaches, cafés, and rented apartments. My schedule is mine. My life is quiet, flexible, mobile.\n\nAnd yet... it’s not peaceful.\n\nAlways checking visa rules. Always packing and unpacking. Always finding the next Airbnb, the next SIM card, the next stable WiFi.\n\nNo roots. No community. No home base. Just motion.\n\nI’m not complaining , I chose this. But it turns out freedom without structure is its own kind of cage.\n\nCurious how others here deal with this.\n\nDo you build “basecamps” and travel slow? Or do you just keep moving and hope something eventually feels like home again?",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1534,
    "downs": 0,
    "created_utc": 1744625655.0,
    "media": null,
    "is_video": false,
    "num_comments": 211,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Discusses trade-offs of digital-nomad life and offers perspective, not a how-to.",
    "composite_score": 5.069276310277581
  },
  {
    "score": 1524,
    "title": "What country will you never visit again?",
    "selftext": "And why?\n\nEdit:\n\nI ranked the top 10 countries based on the comments.\n\n**1. Egypt** – 72 mentions\n\nStill the runaway king. “Scam with a national anthem,” constant harassment, aggressive hustlers everywhere, even people who loved ancient Egypt say the modern experience ruined it forever.\n\n**2. India** – 35 mentions\n\nSensory overload, filth, crowds, staring, scams, stomach issues, and feeling like a walking ATM (especially bad for women). South gets slightly better reviews, but the big tourist cities kill it.\n\n**3. USA** – 32 mentions\n\nPolitics, guns, racism, car dependency, tipping culture, insane healthcare costs, and a general feeling of hostility toward foreigners right now.\n\n**4. Morocco** – 14 mentions\n\nNon-stop aggressive vendors, catcalling, men trying to “buy” female travelers, and feeling unsafe/unwelcome in many areas (especially medinas).\n\n**5. Japan** – 9 mentions\n\nNot the country itself, but the digital-nomad/expat crowd: creepy weebs, awkward gaijin bros, and subtle racism/staring that makes it isolating.\n\n**6. Australia** – 8 mentions\n\nBeautiful, but stupidly expensive and feels like “America/California 2.0 with worse exchange rates and a 20-hour flight.”\n\n**7. UAE / Dubai** – 7 mentions\n\nSlave-state vibes, fake luxury built on exploitation, soulless malls, and depressing behind-the-scenes reality.\n\n**8. Thailand** – 6 mentions\n\nOvertourism turned it into a tourist circus, constant scams, food poisoning, and sex-pat overload in certain areas.\n\n**9. Myanmar** – 6 mentions\n\nCivil war, unsafe, military checkpoints, stalking, greasy food that wrecks stomachs; most say “wait 20 years.”\n\n**10. Cambodia** – 5 mentions\n\n“Scambodia,” relentless touts, kidnapping fears in some areas, poverty that feels exploitative rather than authentic, and frequent sickness.",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1524,
    "downs": 0,
    "created_utc": 1763469476.0,
    "media": null,
    "is_video": false,
    "num_comments": 2910,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Top-10 country list with rationale presented as items.",
    "composite_score": 5.627790946402211
  },
  {
    "score": 1254,
    "title": "Three Americans have died in the past four days in Medellin",
    "selftext": "After two days of being missing, the owners of the room where Dakarai Earl Cobb, 47, was staying grew concerned and decided to enter the space to search for evidence. Upon opening the door, they found him dead.\n\nThe discovery of this American occurred after 8:00 p.m. on Monday, February 5, on 47F street with 89A avenue, in the Santa Lucía neighborhood, west of Medellín. \"The gentleman had been here for just a month, and we rented it because we were asked to as he was only staying for a month. He didn't respond anymore when leaving the room, and when we found him, he was dead,\" said the owner of the property where the American was staying.\n\nAccording to judicial investigations, several of his belongings, such as cell phones, passports, and credit cards, were not found, so progress is being made in the inquiries to clarify how the death occurred. Forensic experts from Legal Medicine are in charge of performing the autopsy to establish how this death occurred.\n\nEarl Cobb's death is the third of an American reported in four days in Medellín, following two cases in Laureles and El Poblado.\n\nOne of them is that of Anthony G. López, 29, who was found dead inside a hotel located on circular 4 with carrera 70, in the Laureles neighborhood, after this man had entered the room with a woman who left hours later. The other was that of Manley Mark Conlen, 37, which occurred on 6th street south with carrera 43A, in the La Aguacatala neighborhood, commune 14 (El Poblado), after he fell from the 17th floor of a building where he had rented an apartment through the AirBNB platform.\n\nWith these events, there have already been four deaths of foreigners under different circumstances this year in Medellín, while in all of 2023 there were 31 cases with these non-migrants, according to judicial records.\n\nHere is the news article: https://m.elcolombiano.com/medellin/tercera-muerte-de-un-extranjero-en-cuatro-dias-en-medellin-HA23675983",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1254,
    "downs": 0,
    "created_utc": 1707234260.0,
    "media": null,
    "is_video": false,
    "num_comments": 841,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "News-style report about multiple deaths of foreigners in Medellín.",
    "composite_score": 5.266299771566882
  },
  {
    "score": 1247,
    "title": "The 6 quickest and easiest ways to get EU citizenship",
    "selftext": "Being an EU citizen is something that is coveted by a lot of people since it grants you free movement in almost all of Europe. And contrary to popular belief, it's actually not too difficult to get it now.\n\nEveryone knows that getting married to an EU citizen is one of the most effective ways to get EU citizenship yourself, but that's not a very viable option for most people so here are the 6 best ways to acquire it outside of marriage from quickest onwards:\n\n**1.) Ancestry - 6-12+ months (citizenship application processing time)**\n\nIf you have eligible ancestry from certain EU countries, you could automatically qualify for citizenship after some paperwork and bureaucracy.\n\nThere are different requirements for this (including proof that your ancestors were citizens), but some of them even allow you to go as far back as your great-grandparents (or even further) whereas others only go as far back as your parents so take a look and see if you qualify:\n\n* Austria\n* Belgium\n* Bulgaria\n* Croatia\n* Cyprus\n* Czechia\n* Denmark\n* Estonia\n* Finland\n* France\n* Germany\n* Greece\n* Hungary\n* Ireland\n* Italy\n* Latvia\n* Lithuania\n* Luxembourg\n* Malta\n* Netherlands\n* Poland\n* Portugal\n* Romania\n* Slovakia\n* Slovenia\n* Spain\n* Sweden\n\nAnd then there's the EFTA countries which also grant freedom of movement in the EU:\n\n* Iceland\n* Liechtenstein\n* Norway\n* Switzerland\n\nEach one of these has its own requirements so if you think you might have provable descent from one of them, read up on it and who knows, you might just get lucky.\n\n**2.) Malta's Golden Visa program - 1 year (1 year of residency in Malta + €750k contribution)**\n\nThere are a few Golden Visa programs in Europe, but Malta is the only one that offers citizenship after just a year of residency. The catch is that you have to invest at least €750k in Malta's National Development and Social Fund.\n\nNote that this is not a real estate or business investment that would give you a financial ROI (those do exist too, but aren't as great anymore compared to the other options below), but rather more of a non-refundable donation to the country.\n\nSo in essence, you're simply buying an EU passport at a super high price.\n\nIf you want to save €150k, you could also donate a lower amount of €600k instead, but you'd have to stay in Malta for 3 years to be able to apply for citizenship. However, if you're someone who would even consider investing €600k just for a passport, what's another €150k to speed it up by 2 years?\n\nIf you'd rather not drop several hundred Gs though (like most people), then read on.\n\n**3.) Ibero-American &amp; former colony citizens - 2 years (2 years of residency in Spain)**\n\nCitizens of former Spanish colonies + Brazil can acquire EU citizenship through Spain by moving to Spain for 2 years. The easiest way to get residency in Spain for 2 years is by getting a Digital Nomad Visa.\n\nThe countries/regions that qualify for this are:\n\n* Argentina\n* Bolivia\n* Brazil\n* Chile\n* Colombia\n* Costa Rica\n* Cuba\n* Dominican Republic\n* Ecuador\n* El Salvador\n* Equatorial Guinea\n* Guatemala\n* Honduras\n* Mexico\n* Nicaragua\n* Panama\n* Paraguay\n* Peru\n* Philippines\n* Puerto Rico\\*\n* Uruguay\n* Venezuela\n\n\\*Since Puerto Rico is not a country and Puerto Ricans are simply US citizens, they instead need to prove their Puerto Rican \"citizenship\" through a document called the \"Certificado de Nacionalidad Puertorriqueña\". This comes in handy for non Puerto Rican US citizens, see below.\n\n**4.) American citizens - 3 years (1 year of residency in Puerto Rico + 2 years of residency in Spain)**\n\nThe great thing about Puerto Rico being a part of the US is that this means non-Puerto Rican US citizens can also take advantage of the exemption made for Puerto Rico and acquire Spanish citizenship after only 1 year of residency in Puerto Rico to qualify for the certificate mentioned earlier.\n\nThen all they have to do is spend 2 years in Spain for a total of only 3 years needed to acquire EU citizenship. This is a great hack for American citizens looking to speed up their path to an EU passport.\n\n*Edit: if you're serious about trying this loophole, consult with a Spanish immigration lawyer first since there is conflicting information out there about the validity of this hack.*\n\n**5.) (Theoretical) Non-US citizens who can acquire residency in the US - 3 years (1 year of residency in Puerto Rico + potential tuition fees + 2 years of residency in Spain)**\n\nTheoretically, even non-American citizens could also take advantage of the Puerto Rico loophole by acquiring US residency first, spending a year in Puerto Rico, getting the certificate needed, and then moving to Spain for 2 years.\n\nI would imagine that a student visa for a Puerto Rican university would be the easiest visa type to obtain so if you're willing to go to school for a year, including paying the international student tuition fees for it for a year, then drop out and spend 2 years in Spain, you could potentially get your EU citizenship 2 years sooner than you'd otherwise normally be able to (see below).\n\nOf course, this is merely an idea. I don't know if Puerto Rican authorities will grant the \"citizenship\" certificate to non-US citizens on a student visa, it's quite possible they wouldn't, so YMMV here.\n\n*Edit: if you're serious about trying this loophole, consult with a Spanish immigration lawyer first since there is conflicting information out there about the validity of this hack.*\n\n**6.) Everyone else - 5 years (5 years of residency in Portugal)**\n\nFor everyone else, there are several different EU countries that allow you to apply for citizenship after 5 years of residency, but I highlight Portugal here since their Digital Nomad Visa can be extended for up to 5 years, meaning you could simply stay 5 years under that easy-to-get visa and then apply for citizenship.\n\nOther countries have 10 year residency requirements for citizenship (like Spain &amp; Italy), or only allow you to extend your DNV up to 2 or 3 years, or don't even offer a DNV to begin with, so Portugal is unique and more advantageous in this regard.\n\nSo if you're serious about acquiring EU citizenship and don't qualify for any of the previous methods mentioned, then this would be your best bet.\n\n**Anyway, this was fun for me to look into. Hopefully someone got some value out of it!**\n\n*Edit: there is some contention on the topic of the Puerto Rico loophole discussed in options 4 and 5. I am by no means an expert in this, I'm merely conveying information that I have found.*\n\n*Spanish immigration lawyers say that as long as you have the certificate mentioned here, it doesn't matter if you are actually Puerto Rican or not, you still qualify.*\n\n*At the same time though, the Civil Counsel in Spain says you need to have been born in Puerto Rico (or have parents born in Puerto Rico) to qualify, regardless of whether or not you have the certificate.*\n\n*However, it's arguably in the Civil Counsel of Spain's best interest to not promote loopholes like this one so they not be telling the whole truth. The only way to really find out is to try it yourself.*",
    "subreddit": "digitalnomad",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1247,
    "downs": 0,
    "created_utc": 1736776519.0,
    "media": null,
    "is_video": false,
    "num_comments": 371,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Enumerated six ways to obtain EU citizenship with supporting details.",
    "composite_score": 5.086486055287354
  }
]