[
  {
    "score": 604,
    "title": "I Accidentally Set a $1 Daily Budget… and the Results Were Terrifying",
    "selftext": "So, picture this: It’s 2 AM, I’m half-asleep, wrapping up a campaign for a client, and I decide to tweak the ad budget. Instead of setting $100 per day, my overtired brain decides $1 is the perfect number.\n\nDid I double-check it? Of course not. I hit *Save* and passed out, dreaming of flawless ROAS and skyrocketing conversions.\n\nFast forward to the next morning:\n\n* *Impressions:* 14.\n* *Clicks:* 0.\n* *Comments from the client:* “Uh…is the campaign live?”\n\nCue my mini heart attack. I checked the dashboard, realized what I’d done, and quickly fixed it. But here’s where it gets weird those 14 impressions? One of them was from someone who DM’d the client about a bulk order.\n\nYup. A *$1 budget* somehow found the most qualified lead on the planet.\n\nNow the client won’t stop asking, “Can we try the $1 strategy again?” And honestly? I’m just trying to pretend it was all part of my master plan.\n\nSo, yeah, sometimes even your screw-ups can work out…kind of.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 604,
    "downs": 0,
    "created_utc": 1732823604.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal anecdote with a takeaway but no clear list, model, or steps.",
    "composite_score": 4.3334896024422624
  },
  {
    "score": 431,
    "title": "I've spent over $100m in Meta &amp; Google in the last 3 years - Just some useful tips",
    "selftext": "**Context**\n\nI'm the Director of Performance at a mid-size performance &amp; creative agency based in London. We're currently running across 30-40 accounts. I work across both Meta &amp; Google directly (Our team is small but mighty!), with SC, Pinterest, Bing etc sprinkled in. We work with the likes of large, £200k a week spends to £1k. I also personally have a lot of experience in B2B also.\n\n  \n**General Advice I think can make a difference**\n\n1. **Paid Advertising Alone Won’t Save Your Business**\n   * **Why Paid is Limited:**\n      * Paid advertising thrives at the bottom of the funnel, targeting people who are already familiar with your brand or actively searching for your product. Its shit for stable new customer acquisition.\n      * Relying solely on paid ads will cap your growth—paid works best as a stable support structure, not the foundation.\n   * **What Really Drives Growth:**\n      * Focus on building **brand awareness** through organic efforts and creative outreach. The founders going out and doing the ground work are what allows us to scale businesses more rapdily, paid growth is incremental and painful.\n      * This applies to businesses of all sizes—from startups spending £1,000 per week to major retailers like Holland &amp; Barrett.\n2. **Evaluate Every Step of the User Journey**\n\n   * **Understand Where Conversions Drop:**\n      * Many founders &amp; businesses overlook the importance of optimising the entire funnel. If in-platform CPA spikes, they're sitting ducks.\n      * It’s not just about driving traffic; it’s about what happens after users land on your site, the checkout, the repurchasing.\n   * **Key Areas to Review:**\n      * Conversion rates: Are website visitors turning into customers?\n      * Traffic flow: Where are users dropping off in the journey?\n   * **The Real Difference Makers:**\n      * While paid ads (e.g., Meta) can lower CPA by 20–40%, the **big wins** come from CRO (Conversion Rate Optimisation) and CRM (Customer Relationship Management) after for ssuatinable business frowth.\n\n# Platform Notes\n\n# Meta Advertising Structures\n\n1. **Campaign Structures That Work**\n   * Bottom-of-Funnel (BoF):\n      * Allocate \\~10% of your total budget.\n      * Target conversions and optimise for lower-funnel activity.\n   * Top-of-Funnel (ToF):\n      * Use the remaining budget, but still optimise for conversions (not awareness).\n      * Apply an Advantage+ Shopping Campaign (ASC) targeted toward bottom-line conversions.\n   * Pure Top-of-Funnel Awareness Campaigns:\n      * Only viable if you’re spending significant sums and can let them run long-term.\n2. **The Organic Effect**\n   * What is it?\n      * The organic effect is the correlation between your Meta ad spend and organic or direct traffic not tracked by Meta.\n      * Meta’s attribution is unreliable—monitor blended CPA instead of in-platform CPA.\n   * Key Takeaway:\n      * Look at the overall business impact (e.g., total sales, organic traffic, and blended CPA) rather than just Meta’s reported metrics. *They lie a lot.*\n3. **Campaign Types: ASC vs. CBO/ABO**\n   * Advantage+ Shopping Campaigns (ASC):\n      * Highly effective \\~70–80% of the time.\n   * CBO (Campaign Budget Optimization) and ABO (Ad Set Budget Optimization):\n      * Consider only for larger budgets (e.g., £100k/week or more).\n4. Attribution\n   * 7 day Click\n      * Currently find this to be a winner more foten than not, but it's a painful transtion.\n      * From what we can tell, 1 day view takes in any impression from the user to attribute a sale, which is a tad BS.\n\n# Google\n\n* **Brand Search &amp; Shopping:**\n   * Allocate 5–10% of the budget.\n   * Use high target CPA/ROAS for brand shopping. The algo will naturlaly gravitate to your brand terms (Y*ou can't target brand terms in shoppping for those that are new!*)\n* **Performance Max (PMAX):**\n   * Exclude brand traffic for better new customer prospecting.\n   * Use lower target ROAS for scaling.\n* **Non-Brand Search:**\n   * Foundational but challenging and expensive to optimise.\n   * Requires a significant budget for effective testing.\n* **Campaign Structures:**\n   * Single product: 2–3 campaigns max.\n   * Multiple products: Use product-split PMAX campaigns, not sure why people don't do this more often.\n\nFeel free to AMA below, the info above should be generally useful for most businesses. \n\n  \n",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 431,
    "downs": 0,
    "created_utc": 1736680962.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Explicit, enumerated tips about paid ads; a clear list of items.",
    "composite_score": 4.376180089394024
  },
  {
    "score": 301,
    "title": "Warning: Godaddy Might Be Snatching Your Domain",
    "selftext": "I recently had an idea for a business and spent hours brainstorming the perfect domain name. I used GoDaddy to check its availability, and it was still open, so I decided to come back later to purchase it. Just a few hours later, when I went to buy the domain, it was gone. My suspicions grew, so I looked up for the registrar —and it was GoDaddy.\n\nI’ve heard stories about this happening but experiencing it firsthand is something else. This is a warning to anyone using their platform: be careful when searching for domain availability on GoDaddy. They might register it themselves before you get the chance.\n\nIf you're checking domain availability, consider using safer alternatives or tools that don’t profit from snatching domains. Don’t let this happen to you—stay informed.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 301,
    "downs": 0,
    "created_utc": 1734861287.0,
    "media": null,
    "is_video": false,
    "num_comments": 172,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Warning narrative about GoDaddy; lacks actionable steps or model.",
    "composite_score": 4.3265299945215485
  },
  {
    "score": 221,
    "title": "Client paid an \"SEO expert\" $5,000. Here's what they actually did. (Spoiler: I'm furious)",
    "selftext": "Throwaway because this industry makes me want to scream sometimes.\n\nA new client came to me last month after spending $5,000 with an \"SEO agency\" for 6 months. They saw zero results and wanted me to audit what was done.\n\n**What the previous agency \"delivered\":**\n\n* 40 blog posts (all AI-generated garbage that sound like a robot wrote them)\n* 200 \"high-quality backlinks\" (literally all spam directories and PBN sites)\n* A \"comprehensive technical audit\" (it was a PDF template with their logo swapped in)\n* Monthly \"ranking reports\" (screenshots that showed literally nothing)\n\n**What they DIDN'T do:**\n\n* Fix the actual technical issues (site speed was 8+ seconds)\n* Optimize existing service pages (missing meta descriptions, weak content)\n* Do any actual keyword research (they were targeting keywords with 0 search volume)\n* Build a single legitimate relationship or real link\n\nThe kicker? This client is in a LOW competition niche. They could've ranked in 3-4 months with basic, honest work.\n\n**Red flags to watch for:**\n\n* Guaranteed rankings (nobody can guarantee this)\n* Ridiculously cheap monthly retainers (under $500/month for \"full SEO\")\n* No explanation of what they're actually doing\n* Reports that look impressive but show no real data\n* Pressure to sign long contracts immediately\n\n**What good SEO actually looks like:**\n\n* Clear explanation of strategy BEFORE you pay\n* Transparency about what they're working on\n* Reports that show real metrics (organic traffic, conversions, keyword movement)\n* Honest timelines (6-12 months for most niches)\n* They ask YOU questions about your business\n\nI'm fixing their site now and already seeing improvements after 3 weeks of actual work. It's not rocket science, it's just... doing the actual work.\n\n**To anyone shopping for SEO:** Please, please ask for case studies. Ask what their process is. If they can't explain it clearly, run.\n\nHas anyone else been burned by shady SEO agencies? I know I can't be the only one seeing this.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 221,
    "downs": 0,
    "created_utc": 1765121691.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Emotional fury about an SEO scam with warnings to others.",
    "composite_score": 3.935309652772067
  },
  {
    "score": 205,
    "title": "I've been running the same profitable campaign structure for all of my Facebook ads clients that has worked for over 2 years.",
    "selftext": "Since 2015, I have provided a variety of Facebook ad services to varying degrees. At this point I've managed over $6 million in ad spend and have managed campaigns for dozens of clients, I've consulted and audited with hundreds of businesses, and I've worked on thousands of different Facebook ad campaigns.\n\nWhat I've noticed is that people are always looking for a new Facebook ad hack or scaling strategy to try out. The problem with this is you never give yourself time to master any one strategy.\n\nIn my time of running Facebook ads, there has only been one major change to the itself platform and that was with the iOS update in 2021. Yes there have been economic changes and changes to the way people consume content or the like but those are things that only require a slight shift in strategy to stay on top of.\n\nSo when the iOS update dropped in 2021 and the results of my clients started to decline, I had to make a new campaign structure and strategy to adapt to that big change in the platform to start seeing results again. Ever since then it's been performing extremely consistent with the right optimizations and customizations for each client and audience size.\n\nThere are 3 types of campaigns in this structure:\n\n1 - Capture campaigns\n\n2 - Nurture campaigns\n\n3 - Convert campaigns\n\nCapture and nurture campaigns are essential to all business sizes, but the third convert campaign isn't necessary for smaller stores or stores with less data. In that case, the nurture/convert campaigns become 1 all together.\n\nBefore going into what each campaign consists of, I need to stress that this campaign strategy cannot work with bad products or offers. Also, all campaigns use the conversion objective optimized for purchases. No traffic campaigns, no video view campaigns, no brand awareness campaigns, etc. ALL conversion/sales.\n\nAnd I could literally talk for hours and hours on the ins and outs of this campaign structure and strategy, but for this post I am just going to be very brief to provide a general understanding. I've made a lot of old posts going into more detail on this if you're interested in learning more.\n\nCampaign 1 - Capture\n\nThese campaigns are all video ads and the main objective of these campaigns is to grow your custom audiences very quickly. So what you do is set an exclusion on all of the ad sets to exclude 3 second video views.\n\nFor every person that sees one of these ads, all they have to do is watch 3 seconds of one of the videos in order to become captured and part of your \"3 second video views\" audience\"\n\nThe beauty of setting that exclusion is you are forcing Facebook to keep on finding new people to show your ads to. Oftentimes people will convert at this level if they are impulse buyers.\n\nCampaign 2 - Nurture\n\nThese campaigns consist of a lot of different types of ads, such as video ads, carousels and single image ads. The main objective is to nurture the warm audiences you captured from your capture campaign.\n\nThe custom audiences I use in this campaign are typically as follows:\n\n1 - Website visitors\n\n2 - Social page engagement\n\n3 - Video views\n\nWhen this entire strategy is fully built out over time, the nurture campaign is the one with the highest ad spend and the highest ROAS.\n\nCampaign 3 - Convert\n\nThe convert campaign are the campaigns that you make that are focused on a very small and hot custom audience with a strong offer or call to action.\n\nAn example of the custom audiences in this campaign would be\n\n1 - 95% video views\n\n2 - Add to cart\n\n3 - Initiate checkout\n\nAs I mentioned earlier, these convert campaigns are not necessary for all ad accounts because it only reaches like 5 to 10% of your entire audience. So if you have a small store, you probably don't have enough data to utilize these campaigns with.\n\nTo conclude, my Facebook ad structure and strategy has been providing amazing results to my clients for years. It requires a lot of logical optimizations to keep it performing well, but it is well worth the time and energy when you start to see significant ROI from your ads. The key to success with this structure is making sure you have a solid product and that you are optimizing and customizing your campaigns to the feedback you are receiving from Facebook.\n\nI hope this post has helped provide some insight on what I consider to be the most effective way to structure and manage your Facebook ad campaigns today. Feel free to ask any questions as well, I'm always happy to help out. Thanks for reading!",
    "subreddit": "digital_marketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 205,
    "downs": 0,
    "created_utc": 1676072231.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.8,
    "category_rationale": "Outlined a repeatable three-campaign structure with implied steps.",
    "composite_score": 3.8231241903080972
  },
  {
    "score": 189,
    "title": "Took a roofing startup from $0 to $2.2M revenue in 18 months. Here is how I did it and why I made less than a McDonald’s cashier.",
    "selftext": "I started a full-funnel marketing agency. When I met my roofing client, it was two guys who wanted to quit their job and start their own company. They had no name, no website, nothing.  \n18 months later they hit $2.2M, with $600k profit. Meanwhile, I made less than a part-time fast-food worker.  \nHere’s what worked, and why I’m rethinking agency.\n\nI basically built a turnkey marketing department. I handle the entire lead flow + all things digital, they handle the sales and the roofs.\n\nI'm responsible for:\n\n1. Branding, Website, Landing Pages, tracking stack (calls, forms, automations)\n2. Google Ads + Meta Ads strategy, ad creatives and management\n3. CRM setup, management, automations, monitoring and training staff to use it.\n4. Full funnel analytics (Pixel, GA4, GTM, GSC) + automated setup of offline events data to Meta/Google\n5. Google Business Profile + Reputation Management + fundamental SEO setup/Link building\n6. Social media management with multiple weekly posts across FB/IG/TikTok\n7. Logo, Branding, Leaflets.\n8. I handled the first few months of the inbound lead calls, before I convinced them to hire a call center.\n\n# Outcome (18 months):\n\n**Revenue:** $0 → **$2.2 million**\n\n* **2024 (Apr–Dec):** 189 estimates - $5,124,998; 44 jobs sold = **$828k rev / $211k profit**\n* **2025 (Jan–Sep):** 404 estimates - $14,857,432; 91 jobs sold = **$1.38M rev / $317k profit**\n\n**Profit margin:** 30%  \n**Avg job:** $14–15k  \n**Close rate:** \\~22%  \n**Marketing cost:**\n\n* 2024 ad spend $30,684 + my fee $8,500 = **$39,185 total**\n* 2025 ad spend $61,871 + my fee $36,000 = **$97,871 total**\n\n**ROI:**\n\n* 2024: every $1 in marketing → **$21.1 in revenue; $6.3 in profit**\n* 2025: every $1 in marketing → **$14.1 in revenue; $4.2 in profit**\n* Marketing fees in 2025 = ad spend is 4.5% of rev + my fee came out to 2.6% of rev = **7.1% of total revenue**.\n\n**CAC/LTV** = 3.91:1  \n**Unconverted estimate value:** $13.48M in 2025 (90.7% of quoted) vs $4.3M in 2024 (83.8%).\n\n# What I did, step-by-step:\n\n**#1) High intent first - Google Ads.**\n\nThey had very limited budget to spend at first, so I focused on the people who are already searching for someone to come help them fix their roof - guaranteed high intent, bottom-of-funnel traffic = Google Search Ads. The average price per click here is \\~$60 , very pricy and hard to compete.\n\nI built out a website and dozens of landing pages to target the exact searches people were making and added dynamic text data based on searches and location like \"\\[search term\\] service in \\[location\\]\". I optimized the pages continuously by A/B testing. I tracked all interactions on landing pages, watched back every visitors session and consulted the heatmaps of common scroll/click areas. Basically, i did all i could to maximize the google ads click to conversion %. Important to note, that I originally went into agency space as a web dev/web designer and have solid background in making high conversion websites.\n\n*In the end, i got the landing* *page conversion rate to \\~21%*\n\n**#2) Fix response gap**\n\nOnce a lead comes in, its incredibly important that we are responsive. *All phone calls need to be answered, all form fills need to be called back in less than 5 minutes.*\n\nProblem = roofers/home service guys are notoriously bad at pickup up phones. They’re on roofs, driving, or quoting. But if a call isn’t answered, they don't convert and then my client sees that as a “bad lead”, which in turn looks bad on me.\n\nSo at first, I took on the role of picking up the phone calls. After five months I convinced them to sign up for a call center service. Better than nothing, but still very weak. There is no incentive for call center reps, I'm convinced that if my client just hired an in-house CSR / sales admin, our overall close rates would skyrocket and the wages would pay themselves off.\n\n**#3) Feed the algorithm**\n\nNow that we were getting lots of \"conversion\" data from landing page forms or calls - it was my priority to keep feeding the Google ads machine learning algo with more data about how these conversions are actually doing.\n\nI coached client on CRM pipelines and keeping estimates/invoice data attached to leads. I then created automations to feed all the data about qualified/disqualified leads, $ value of estimates sold/unsold, etc.\n\nThis is makes the Google ads/Meta ads targeting a lot smarter AND gave us fully transparent analytics, reporting exactly what's working and where we have leaks that need patching.\n\n**#4) Add Meta for scale**\n\nBy this point we were first for our service areas in Google Ads auction insights and because its a very specialized niche of roofing, there is simply not enough search volume and our budget outgrew what Google was willing to spend. Google local service ads were also useless, as it classifies you as a \"roofing contractor\", but 95% of those leads are not applicable for this client.\n\nWe were capped on lead volume of the high intent, bottom of the funnel traffic that Google ads brings and to increase lead flow I went on to expand to a colder audience with Meta Ads. to increase lead flow, I went to Meta Ads.\n\nHere, my strategy is much simpler - reverse engineer what works. I watched over 1200 roofing video ads. I know this number because i took notes on each one, noting the hooks, specific sentences i liked, notes on the script, visual elements, different angles/approaches, etc. I built a whole library of ideas and have been testing creatives based off that, occasionally going back to the Meta ad library and watching some more. Because we introduced Meta ads around the same time that we introduced social media posts, there was plenty of already prepared footage from the job sites for me to use.\n\nThis year, Meta ads has been the main source of leads. The quality is considerably worse (95% qualified -&gt; 50% qualified), Because we still don't have an in-house CSR, the time to call back new leads is way longer than it should be, so this artificially brings down the % of qualified meta leads. Although the price per lead currently comes out to be worse, the average ticket is equally good.\n\n**#5) Build Trust and Authority**\n\nThroughout this whole time, I was doing two other things to increase the trust and authority in the eyes of potential prospects. Hunting for Google reviews from our sold jobs &amp; getting the client to film content on job sites for social media / meta ads.\n\nI built in automations for simple review gathering from sold jobs. Every added review is massive for local reputation. If a someone is considering spending thousands of dollars for a huge job, you best believe they are gonna be searching you and your competitors up, yet many other companies don't even any form of online presence so we simply appear more trust worthy and reputable by staying on top of it.\n\nWith the filming of content - the primary usecase is for Meta ads, which are the actual money generating bit. And although we do not get direct jobs from social media posts (yet), I think it has a great impact for long term brand building &amp; adding trust when leads research us further before making a decisions. Simply by posting videos from active job sites for 9 months, we got a total of 10k subscribers &amp; 14.2m views across FB/TikTok/IG, all of which shows up very obviously when looking at branded keyword searches of the company.\n\nAll these systems now produce steady inbound calls, track every quote, and feed back performance to ads.\n\n# Future Growth\n\nCurrent bottleneck is the sales conversion, as you saw earlier from the \"Unconverted estimate value\" - only 9.3% of estimate value converts. The fastest profit lever for the client is in lifting the estimate win rate on higher ticket jobs. Our overall close rate of 22% is highly propped up by small residential repair jobs, meanwhile, there is a big loss on the higher ticker commercial jobs.\n\nThis is outside of what I can currently help with, so I pushed for an experienced roofing sales consultant to train the team and Client agreed. I want that playbook so future clients get even more from me, a full sales process that converts high-ticket work.\n\nI want to further systematize the sales journey: same-hour follow-up, better roof report/estimate process for the client, maintenance agreements for commercial job retention, etc.\n\nHowever, before I go any further with this, i had to stop and ask myself\n\n# Was it even worth it?\n\nThe company sold $2.2M of work in 18 months, and pocketed around $518k of profit.\n\nMy total take across that time = **$16.5k in 2024 + $36k in 2025 = $52.5k total revenue, about $25.5k profit for all of my labor hours put into this**.\n\nThat’s **2.3% of total revenue** for building and managing the entire lead engine, creatives, systems, data. Basically full control over their marketing engine and measurable ROI.\n\nLooking at it strictly as an agency owner, **I basically built a multi-million-dollar business acquisition channel for a client, for about the same profit as working part-time at McDonald’s.** Now I have to decide whether that was a smart long-term play or bad pricing.\n\n# So here's my question\n\nWas this the right move?\n\nOn paper, it’s a great case study:\n\n* $0 → $2.2M in 18 months\n* 14× return on ad spend\n* $4.2 of pure profit for every $1 spent on marketing/fees\n* Every lead source and dollar tracked to the cent\n\nBut in practice, I spent hundreds of hours building and running everything and cleared \\~$25k profit. Below the poverty line where I live.\n\nThis is only “worth it” if I can turn it into a repeatable offer for other roofing companies.  \nThat’s where I’m stuck.\n\nHow do you even sell something like this? Content ads into a VSL funnel targeted at roofers?\n\n* Do I pitch it as a **full-funnel service** (ads, CRM, analytics, etc.)?\n* Do I go **flat retainer, % of ad spend, % of revenue, or profit share?**\n* When do you move from “cheap case study” to proper pricing?\n* Would you have front-loaded this much work for the long game?\n\nWould love perspective from other agency owners or general business owners.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 189,
    "downs": 0,
    "created_utc": 1759861016.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.78,
    "category_rationale": "Case study with a step-by-step rundown of actions to replicate and outcomes.",
    "composite_score": 3.9351154035972526
  },
  {
    "score": 169,
    "title": "After 8 years of doing SEO, here are 7 things I wish someone told me on day one",
    "selftext": "I've been working in SEO since 2017, and looking back, there are so many things I learned the hard way. Figured I'd share some insights that might save others some headaches:\n\n1. **Google doesn't hate you, your content just isn't that good yet** \\- I spent my first year blaming algorithm updates instead of improving my actual content. Harsh truth: if you're not ranking, you're probably not the best answer for that query.\n2. **Technical SEO is like brushing your teeth** \\- It won't make you attractive by itself, but neglecting it will definitely hurt you. Fix your Core Web Vitals, mobile responsiveness, and site structure before obsessing over link building.\n3. **Backlinks from relevant sites beat backlinks from high DA sites** \\- A link from a niche blog with 1K monthly visitors in your industry is worth more than a link from a generic news site with millions of visitors.\n4. **Your competitors are probably stealing your strategy** \\- And that's fine. SEO isn't a zero-sum game. There's room for multiple winners in most niches.\n5. **Local SEO is criminally underrated** \\- If you have any local component to your business, the ROI on local SEO efforts is insane compared to competing nationally.\n6. **The best keyword tool is Reddit/Quora/Forums** \\- Paid tools are great, but real people asking real questions in your niche will show you what they actually care about (not just what has high search volume).\n7. **You'll lose rankings sometimes, and that's okay** \\- I used to panic every time I dropped 3 positions. Now I know fluctuations are normal. Focus on the trend, not daily changes.\n\nWhat's something YOU wish you knew earlier about SEO? Would love to hear what lessons others have learned!",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 169,
    "downs": 0,
    "created_utc": 1761741208.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Seven numbered SEO lessons; a curated list of items.",
    "composite_score": 3.9746607991217493
  },
  {
    "score": 157,
    "title": "The Digital Marketing Industry is in Chaos and I love It.",
    "selftext": "Every..single...day I spend most of my mornings deleting garbage b2b cold emails, spammy LinkedIn messages, lazy outreach asking me to pay for services, etc. Every channel, everywhere, is filled with the next great AI tool or agency roadmap to 100x your MRR.\n\nThe entire industry is getting flipped upside down with the rise of AI and new software automation. Everyone is now an expert. But the truth is, the majority of what you see online is fake, written through prompts by users who don't actually understand the details about which they're talking. \n\nIt's enough to make most people run away. So why do I love it? \n\nBecause what I love about the industry and the reason I have been doing the work for over 10 years has nothing to do with me and everything to do with my ability (and team) to use our combined skills to support clients. Their goals, their mission, full stop. Only then can I succeed. It's validating in so many ways.\n\nLook around online. What you'll find is self-serving, grandiose promotions of someone pushing a way for THEMSELVES to make money. Downloads, workbooks, whatever funnel you can think of - it's all designed for them to get the quick win, not actually deliver something valuable or honest. I know this because I will often take the meetings, download the workbooks, demo the software, etc. I'm about my business, so I am always checking to see what works/what doesn't.\n\nBut if your focus is entirely on supporting your clients, helping them become successful, and providing real value to their business, you can't lose. There are more tools and resources available today than ever before, but most people are using them selfishly for their own gains and not to better the end clients who need it.\n\nSo if you see the chaos and feel overwhelmed or feel like you're missing out, just know it's not real. Most people don't want to do the real work in digital marketing because it's hard, takes time, and above all requires a sincere desire to communicate and collaborate with clients. It's also thankless and probably 80% of the real work no one will care about or care to understand. It is what it is.\n\nReal digital marketing is about taking complex topics and simplifying it so clients can understand the value and strategy they pay for. It's not about SEO, PPC, SMM, or any other three-letter trend that's out there today. Those are just tools. How YOU learn and adapt those tools to reach goals for others is where the real work is.\n\nRarely, if ever, do we receive calls from clients asking for a specific service outside of web design. If we do, the client admits they don't really know; they just thought it was so for one reason or another. They simply want to generate more leads, opportunities, or solve specific problems related to time or money. \n\nIf you only care about reaching goals and solving problems, the tools don't matter because you do whatever it takes to win. There are no quick wins, shortcuts, or secret sauce that will cheat Google. It's done through details and fundamentals, working with real clients and learning about their business so you can leverage your skills to promote them.\n\nSo bring on the chaos. Because no matter how fast the industry grows, it will never matter because the people who pay for marketing will never fully understand the nuances of the industry. They (clients) will always have a problem they need solved, goals they want to reach, or new opportunities they want to generate. Clients don't pay people they don't trust, and trust is earned through reputation and hard work. They don't care about jargon, fancy terms, or shiny objects you put in front of them. \n\nMake the phone ring. Get forms filled out. Make them make more money than they pay you (and be able to prove it). If you can't do those things, then you probably have less than 6 months of run time until the money call happens and you're looking for more work.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 157,
    "downs": 0,
    "created_utc": 1757003483.0,
    "media": null,
    "is_video": false,
    "num_comments": 77,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Strong stance about industry chaos and fake marketing; venting about misuse.",
    "composite_score": 3.8722043882996626
  },
  {
    "score": 155,
    "title": "Which Instagram like bot is safest right now?",
    "selftext": "Hey everyone, I’ve seen a bunch of Instagram like bots being promoted lately but can’t tell which ones actually work anymore. I used to use a few back in the day, but since Meta’s updates, most tools trigger spam detection.\n\nDoes anyone still use an Instagram bot that automates likes without risking your account?\nIf so:\n\n- How aggressive can you set it per day?\n\n- Does it require me to download anything?\n\n- Have you noticed any drop in reach after using it?\n\nJust trying to find something safe for steady engagement boosts, not looking to massbot thousands overnight",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 155,
    "downs": 0,
    "created_utc": 1762078850.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Simple question seeking an Instagram bot recommendation; minimal content.",
    "composite_score": 3.805294873081252
  },
  {
    "score": 149,
    "title": "Digital Marketing Clients Be Like",
    "selftext": "Client: \"We want to rank #1 on Google.\"  \nMe: \"Okay, what’s your budget for SEO?\"  \nClient: \"Budget? Oh, no, I just thought you’d sprinkle some keywords and make it happen.\"\n\nOr my personal favorite:  \nClient: \"Can you run ads to get more sales?\"  \nMe: \"Sure! What's your ad budget?\"  \nClient: \"We don’t have one yet. Let’s see how it goes first.\"\n\nSometimes I think the hardest part of digital marketing isn’t the algorithms, it’s keeping a straight face in these meetings.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 149,
    "downs": 0,
    "created_utc": 1733951181.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Humorous vent about client expectations; mild frustration and judgment.",
    "composite_score": 3.789028686891927
  },
  {
    "score": 148,
    "title": "I MADE $20K FROM A SINGLE REEL (organic)",
    "selftext": "No, I am not joking. Yes, I am sharing with you the exact playbook to do the same.\n\n- I posted one reel with a simple CTA: “Comment … and I’ll send you a free resource with all the links.”\n- People commented, my agent sent an automatic DM: “I’ll send it right now, just hit follow to unlock.”\n- After they followed, my agent asked for their email address (all happening in the Instagram DMs).\n- The email gets automatically stored in my Email Marketing tool and enters my business workflows.\n\nHere are the key stats:\nFrom 5.7M views → 12.1K comments → 8.7K emails → 90 paying clients.\nTotal revenue from one single post: $19K.\n\nWhy does this work?\n\nThe free giveaway is perceived as something valuable, and it makes people take action. Moreover, teaching through educational content positions you as an expert in the field. In my case, I am selling services for job seekers, and the giveaway was a guide on the best free courses available for finance. But the application could be infinite.\n\nThis is the most powerful hack in 2025 to get leads, but it is ineffective if you don’t have a sales funnel on top of it to warm up, set, and close those leads.\n\nI can share the editable automation with whoever is interested, just drop a comment or a DM and I’ll send it to you! At the beginning it was a bit of a hustle to set up, but once you understand the structure it’s pretty easy.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 148,
    "downs": 0,
    "created_utc": 1757688804.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Sequential, replicable steps to generate revenue from a reel.",
    "composite_score": 3.8062993062585218
  },
  {
    "score": 139,
    "title": "How we helped an e-commerce clothing store grow from $20k per month to $100k per month.",
    "selftext": "Hello Redditors,\n\nIn this post, I will share our insights and case study on how we grew an e-commerce clothing brand.\n\nI will keep it as short and straightforward as possible. Hopefully, you can apply this to your e-commerce store.\n\n**THE SITUATION**\n\n70% of revenue came from returning customers.\n\nThey didn't know their target CPA numbers. When they advertised, their target CPA was $15\n\nThey didn't know their LTV numbers\n\nThey were advertising all the products that they had, and only a few were generating sales\n\nThey were testing 1-2 new ads a month, and for the most part, they ran the same creatives repeatedly for the last 3 months.\n\nThey didn't have any email flows to retain more customers, although 70% of their monthly revenue came from fan customers, which meant the products were really good.\n\n\n**WHAT DID WE DO TO GROW THIS BRAND?**\n\n\n1. We calculated all the numbers to set a clear target cost to acquire new customers\n2. Instead of advertising all the products, we found that most sales came from 5 dresses.\n\nSo, we set our focus only on those 5 dresses.\n\nYou don't need to advertise all of your products. All you need to focus on is your HERO product/offer.  This is one of the reasons why I see a lot of brands fail to figure out their Facebook ads. They try to advertise all the products. It's hard enough to figure out the best way to advertise one hero product that is responsible for most of your sales. \n\nFocus on all your ad creation attention on the HERO product/offer.\n\n3) New creatives - previously, I mentioned that they were testing 1-2 new ads a month.\n\nWell, we started our ad launch we 40 ads showcasing the dresses in multiple videos like:\n\n- dress time capsule hacks for summer  \n- 3 reasons why you will love this dress  \n- 3 reasons why I hate these dresses ( negative angles also work)\n- vlog day with my 3 favorite outfits for the summer.\n\n\n4) We simplified the ad account structure with just 2 campaigns\n\n- Campaign for women with multiple testing ad sets showcasing best-selling dresses  \n- Campaign to join their special email VIP list to grow their email list.\n\nAll the campaigns used complete BROAD targeting, no retargeting ad sets, no interests, and no lookalikes.\n\nWe let ads do the targeting.\n\nMultiple ads had a frequency close to 2.0, meaning those ads were already retargeting.\n\nI don't want to get to deep into this retargeting, targeting conversation, I have other posts about this. That explains the concept behind \"ads do the targeting\"\n\n5) Regarding the email - we built :  \n- New welcome flow -  \n- VIP Flow -  \n- Birthday flow -  \n- We miss your flow  \n- Cart abandonment flow.  \nBy building these flows, we let email and SMS focus on customer retention rather than running Facebook retargeting campaigns\n\nA month after doing this, 80% of monthly revenue came from new customers.\n\nWe grew to $ 60,000 per month, staying for three months while the brand sorted out its inventory and focused on developing new dresses for limited availability drops.\n\n**THE CURRENT SITUATION**\n\n* Currently,  this brand is doing $100k - $120k in monthly sales.\n* 60-65% of revenue comes from new customers\n* 35-40% comes from returning customers\n* The average AOV is $92.43\n* Our Cost to acquire new customers is $55\n* Our LTV is $180+ and growing\n* Every 6 weeks, we launch new dress drops planned for a year.\n* All of this is without any monthly discount campaigns, pure product.\n* We run a discount once every 4 months and generate around $280 - $300k in that period.\n* We still don't use retargeting campaigns.\n* Customer retention is being handled by email &amp; SMS.\n\n**THE NEXT STEPS**\n\n1. We are implementing a loyalty program where we will offer cashback after a certain amount of spend in the store that will be kept as store credit and can be used in the next purchase. This will incentivize people to come back and spend more, which will result in raising our LTV.\n2. Conquer new markets to grow to $300k monthly without sales campaigns. After a year, we can finally do that because we have a healthy profit margin and good customer retention.\n3. Develop new products that people love.\n\nThanks for reading.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1707539769.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Case study with insights and rationale on focusing on hero products and metrics.",
    "composite_score": 3.7823824920313562
  },
  {
    "score": 133,
    "title": "The Most Boring SEO Fix We Made This Year… Increased Traffic by 60%",
    "selftext": "We had a client come to us frustrated. They had been publishing content for over two years blogs, guides, FAQs, you name it. Nearly 300 pages on their site. But traffic was flat. Rankings were all over the place. Leads? Barely trickling in.\n\nThey thought the answer was “more content.” But when we looked under the hood, the real issue was the opposite.\n\nMost of the content was thin, overlapping, or just flat-out outdated. It wasn’t helping anyone. It wasn’t helping Google, either.\n\nSo we did something completely unsexy: we deleted almost 90 blog posts.\n\nWe merged another 40 into stronger pillar pages. Cleaned up internal links. Submitted updated sitemaps. No keyword stuffing. No backlink sprint.\n\nWithin 90 days, traffic jumped by over 60%. Their best-performing service page hit top 3 for two competitive terms they’d been chasing for a year.\n\nThe funny thing? They were hesitant at first. “Delete content?” It felt wrong. But the truth is clearing the noise made room for results.\n\nNot every SEO win comes from adding more. Sometimes, it’s about knowing what to let go of.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 133,
    "downs": 0,
    "created_utc": 1750323195.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Detailed, ordered SEO actions (delete/merge posts, pillar pages, links) to achieve traffic gains.",
    "composite_score": 3.666229443563758
  },
  {
    "score": 129,
    "title": "How To Make Your Link Building Work",
    "selftext": "Found some interesting and helpful articles here so thought I’d chime in with something of my own after seeing so much misinformation etc. Building links is probably the hardest part of SEO. There’s misinformation at every turn. The majority of large link building/buying agencies fuel a lot of this leading to business owners and other SEOs getting it wrong too.\n\n\n\nOne of THE main issues is most agencies slap links anywhere. Content will go up that’ll never have a chance in hell of ranking, or they’ll throw link inserts into dead content (a lot of the time onto sites that are also dead). This kind of link building pales in comparison to the below. \n\n\n\nI just wanted to cover off what's pretty impactful for us at the moment and chat about why it isn’t common practice, and why you should (be it for your own business, or client’s business) try for the below for more consistent results, especially in harder niches with more difficult/competitive keywords.\n\n\n\n# Get it into Ranking content\n\n\n\nThe content the link sits in should in the best world receive traffic from Google. Why? Because it's showing Google values the content/page enough to send traffic to it. If google values the page, logically we can infer that it’ll value the links on the page too. So - is the website ranking, is the content ranking, and is it receiving some traffic? If those are a tick - great. \n\n\n\nIf its just ranking for keywords, but not receiving traffic - the page is still probably valued, as Google has ranked it. But clearly not as valuable as getting traffic. It depends on your goals, budget, and competition.\n\n\n\nSO - your goal should be to secure links in ranking content (if a link insert) or to get the submitted content (which includes your link) to rank. It can be time consuming on a link by link basis, but it’ll make all the difference to your campaign (rather than throwing links up into dead content or even dead websites!)\n\n\n\n There are two main ways you can do this. \n\n# Link insert method:\n\n\n\nPretty logical. You need to insert your link into content that is indexed, ranking for keywords, and receiving traffic. A lot of agencies are known to just throw them into content doing nothing, even worse, on sites that are completely dead - so watch out for this, and, if you’re doing this yourself make sure you’re inserting them into trusted (by Google) content.\n\n  \n\n\n# New Article method:\n\n\n\nA little more difficult because, obviously, the content won’t be ranking/receiving content if its brand new - however, you can give it the best chance of succeeding and also, you’ll have full control over the content unlike when you’re doing an insert.\n\n\n\nSo - for the link within your article to get the best pull, you need to rank it should go something like this: \n\n\n\n* Write a quality article targeting a keyword the site can logically rank for (and doesn’t already rank for). It shouldn’t be super difficult. You can work with the owner to achieve this.\n* Leverage the sites current authority to support the website: during negotiation for the placement ensure internal links (again - from other ranked articles getting traffic) are pushed to your new article to give it the best chance of ranking. \n\n\n\nIf it ranks - the link will pull a lot harder than if the content was simply indexed and not ranked, if it ranks well and gets some traffic that’s even better.\n\n\n\nIn our experience - this kind of link building is way more impactful and will lead Google to trust your site/page and think of it as more of an authority.\n\n  \n\n\n# Why Isn’t this common Practice?\n\n\n\nThere are a few reasons. \n\n\n\n* It takes a lot longer to secure each placement \n* They cost a lot more (if you’re paying sites)\n* Sites are far more protective of their articles that already rank (why add do follow links to ranked content/Content thats driving traffic when changing the content could mess something up…sites don’t like it.\n* Slapping links on dead sites etc., is cheaper, and faster and why many do so. Its why many price based on DA/DR etc. A site with 0 traffic can quite easily have a DA of 80. \n\n\n\nSo - when you build links try to do your all to make them work. If you’re working with an agency, hold them to account. Just looking at inserts think of them on a scale:\n\n\n\nLevel one (links on a site with 0 traffic/ranking) Worthless\n\nLevel two (links on a site that gets real traffic from google but not the page) Better - but there are steps to take (ask for internal links etc. but really for for three and four if you can).\n\nLevel three (links on a page that ranks for real keywords on google) much better, the page is trusted\n\nLevel four (links on a page that gets traffic from Google) the best.\n\n\n\nSo many agencies do level one, and business owners do too because the site might have a high DA (means nothing) and they’re led into it thinking the site is good. Remember, DA is third party and not representative of how much Google trusts a site, which can be ascertained simply by looking at whether the site gets real traffic or not.\n\n\n\nAlso - theres a level 1.5 - which are sites that look like that have traffic, but don’t. These are favoured by agencies too but a lot of the time the traffic is spoofed.\n\n\n\nSO. If you want the building to work focus on three and better yet, four. Its what we’ve seen work very well. YES - it might cost more (both in terms of time if you’re doing them for free, or money (the more common way) but they work.\n\n  \n  \n\n\nI’m only commenting on what I’ve seen work best. Its not to say other methodologies do not work. But, if you think about it the above is quite logical. For us, that kind of link building punches harder for clients than putting up content on dead sites without trying to rank the content and get the content some real traffic flow. \n\n\n\nThis method pretty much concerns the paid way of securing links too (as that's where my experience lies and always has done). But, It can be applied to free link building methodologies its just way harder to do.\n\n\n\nAnyway - hope this was useful. \n\n  \n",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 129,
    "downs": 0,
    "created_utc": 1761922538.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explanatory guidance on best practices for link-building with reasoning.",
    "composite_score": 3.458503343634799
  },
  {
    "score": 129,
    "title": "Radical New Approach to Digital Marketing",
    "selftext": "I launched an apparel brand in 2018 with a friend and it almost failed during the first month because we were focusing our efforts on trying to reach consumers with ads in places where they weren't actively looking for our apparel. We tried Facebook and Instagram ads, Pinterest, and ran ads on Etsy to try and generate new customers for our Apparel line. While we had some sales, the cost to acquire a new customer was pretty close to our average profit per order making our advertising a wash. We were selling products, but we weren't making a profit. \n\nOur approach to spending money on ads that had no other benefit other than serving ad impressions and hoping for a buyer was getting us nowhere. It would be impossible for us to scale our brand and make a profit. \n\nThat's when we decided to shift our focus. Instead of spending money on ads, we started spending money on ads to reach targeted apparel Influencers who were interested in our type of Apparel. We ran Facebook and Instagram ads and targeted an audience who were interested in our niche but were also models, and actresses and had an interest in representing brands as a spokesperson. \n\nWe set up a \"Spokesperson\" contest and offered a $5,000 contract to the Spokesperson who created the best content for our apparel brand. Our ads were generating new Influencer sign-ups for about .34 cents each. With a small budget, we had over 10,400 Influencers sign up for the campaign. \n\nThe Spokesperson contest allowed Influencers to earn points for taking actions that helped the brand grow organically. Here's what we had the Influencers do to earn points:\n\n1. Purchase the product (at a discount) - 23% of the Influencers purchased our Apparel \n2. Create an unboxing video of the apparel when they got it\n3. Create a \"Review Video\" of them trying on and commenting on the apparel\n4. Follow us in social media\n5. Engage with our Social Media content\n6. Post their videos to their own social media channels and tag our brand in the post\n\nWe had the Influencers purchase our products on Amazon so we could grow the number of sales and generate reviews to help lift our apparel in organic search results on Amazon. This helped lower our blended cost of customer acquisition across all of our sales channels. \n\nHere are some of the benefits of running a campaign like this:\n\n**Build social media account authority** \\- The more account authority your social media accounts have, the better your content ranks in social media. For us, we wanted our content to rank on hashtags related to Yoga Apparel. We utilized \"Shoppable posts\" on Instagram so getting our Shoppable Post ranked at the top of the hashtag #YogaPants was imperative. \n\nThere are over 250k searches done an hour for that one Hashtag. When someone can purchase your product without leaving the post and it's visible to people actively looking for it, you generate a lot of sales. We generated over $34k an hour for each hour the post was ranked above the page fold on that one keyword. \n\nTo get ranked on that keyword, it took about 1500 likes and comments. Every time we launched a new \"Shoppable Post\" we would blast out a text message to our Influencers to like and comment on it. This drove our engagement up and got us ranked right away.\n\nSocial Account authority also drives more organic followers who all have high purchase intent as we are finding them on Hashtags that people looking to purchase Yoga Apparel search. As we build organic followers, our account authority gets higher and higher. \n\n**Evergreen Content** \\- Instead of paying for Ad Impressions, we pay for content creation that is always online and always driving more product discovery opportunities. Once your ad dollar is spent, you get no further benefit from it.\n\n**Build Strong Brand Affinity** \\- Ads don't drive passionate consumers of your products. But engaging social media influencers who are interested in your product category, incentivized to study your brand, create content for you and promote you for three months at a time drives very strong brand affinity. We created an active engagement automation funnel that kept our brand fully engaged with our Influencers throughout the entire campaign.\n\n**Generate Immediate Sales at a Lower CPA** \\- When we were marketing for sales, our average cost per sale was $29, when we ran the Influencer campaign and had Influencers purchase the product our cost per sale was just $3.44. We also gained a powerful brand advocate, generated evergreen content at scale, and built social media account authority.\n\nYou can use this business model to scale everything from product brands, Apps, Social Media platforms and everything in between. So, stop marketing for conversions and start acquiring brand advocates. It's the cheapest, most scalable way to build a brand that generates long-term value. Our apparel brand was acquired by one of the largest Yoga brands on the planet after just 9 months! Our campaign generated over $3M in revenue over our 3-month campaign with a tiny budget of just $30k.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 129,
    "downs": 0,
    "created_utc": 1682959489.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.9,
    "category_rationale": "Explicit influencer-campaign play-by-play with actions to execute.",
    "composite_score": 3.6909283544748464
  },
  {
    "score": 119,
    "title": "Subreddit moderation concerning AI tools",
    "selftext": "Hi everyone,\n\nAs I'm sure you've all noticed, digital marketing is turning itself inside out coming to terms with AI and how it impacts our work. Lately, I've seen a flood of AI \"tools\" being promoted that advertise AI solutions for this and that, from text to imagery, and more.\n\nFirst of all, this subreddit was created to exist as a watercooler safe space for digital marketers who don't have anyone in their company or circle of friends to discuss their professional challenges. And our 1st and most important rule is no solicitation. There are no sales pitches at the watercooler, and even actual advice is suspect the moment it's attached to *\"and this thing you can buy will solve your problems\"*.\n\nI'm happy to reconsider the above and tweak (minimally) this rule if the community has a different point of view (comment below), but for now, that's the state of things.\n\n# Now to the issue at hand\n\nI'd like to urge everyone to learn to use AI, as it's going to be an unavoidable tool in our arsenal going forward but to be weary about the deluge of tools that claim to perform miracles.\n\nThere are a handful of AIs good enough to use today (ChatGPT and Midjourney being well-known examples), as well as an absolute dumpster fire of front-end interfaces that query the aforementioned AIs via API. I've tried a dozen, and they rarely add significant value beyond what the core tools themselves do. If anything, they add a layer of obscurity on top of the query-response process, which isn't doing the user any favors.\n\nThe vast majority of these hastily cobbled tools won't exist in a year. Please consider the implications of giving your money, personal data, and work data to a platform that's only forwarding your content to a different API. Consider the implications of not having access to any of your history when the garage projects inevitably drown in the sea of indistinguishable competitors.\n\n&amp;#x200B;\n\nIn light of this, we'll take a stronger moderation approach to removing the promotion of derivative AI tools and promotion. We'll also begin to enforce a zero-tolerance approach to promotion that seeks to circumvent the automod tools, such as posts that appeal to PM for more info or mention links in bios.\n\n**This is a community for PEOPLE who share a passion and profession to talk to each other, and not a community where you're sold to.** If you'd like that, I'm sure you can find any number of digital marketing communities out there where you can read sales pitches and promos.\n\nAs always, if you have ANY comments about the above moderation direction, let me know. Please keep them on the community moderation topic, if you'd like to write a lengthy post about the direction of AI and have that discussion, do post it and PM me, we probably could use a sticky for that debate for a while.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1680080638.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Discussion of AI-tools moderation and cautious adoption with guidance.",
    "composite_score": 3.733605791416252
  },
  {
    "score": 117,
    "title": "I am worried about AI. Very worried.",
    "selftext": "A lot of people don’t really understand the tools they now wield on a daily basis. Just look at the tiny % (but millions) who lost the plot when ChatGPT5 replaced 4o.\n\nI’ve been experimenting with vibe‑coding - building apps simply by telling AI what you want - for two years now. The last six months I’ve been deep in Claude Code. It’s so good… and so bad. Here’s why - and why this applies to every AI tool out there.\n\nThese tools open new worlds for marketing and sales teams. They can write for you, create audio or video, even build apps. They can control your machine, automate admin, make you feel unstoppable. On the surface, it all looks slick, fast, seductive. And sometimes, surface‐level is all you need - a quick image, a five‑second clip, a few ideas, or a whitepaper conclusion.\n\nBut surface‐level only takes you so far.\n\nTake vibe‑coding. Describe your dream app, and the AI will “build” it. It looks polished - until you realise it’s a house of cards: broken code, missing functions, outright fabrications. Building apps is hard.\n\nSame with content or video. No tool can yet write a 3,000‑word whitepaper end‑to‑end or produce a five‑minute promo video that’s truly ready to use.\n\nThe danger? These tools, and the hype, convince people otherwise. The apps look good; the content seems right; the images look fine until you squint. The confident “Yes, that’s brilliant” AI chatbot is seductive.\n\nDon’t get me wrong, these tools are the future of work. But we’re in the early days, a powerful, confident tech most don’t fully understand. Never before have people had tools that can do so much, yet are so misunderstood.\n\n**The answer?**\n\nHard work. I think it is simple as that, which no one wants to hear in an \"AI can do you work\" world. Right now AI can't do your work. But you are AI can do way better work.\n\nLearning how to use these tools is key. Understanding context windows, memory, model strengths. Getting good at guiding them, checking outputs, and knowing when not to use them. In short, rethink how you approach work—in tandem with AI, but in control of it.\n\nHere are 4 key tips for how to approach this new world of work:\n\n1. **Prioritise AI literacy over shortcuts** \\- Learn the fundamentals - how context limits, memory and hallucinations work. Use AI as a co‑pilot, not an autopilot. This prevents complacency and keeps you sharp.\n2. **Think human first - tech second** \\- Align AI tools with real business needs and culture. Set clear goals, assess risks, provide training. Human‑machine collaboration must be strategic, not reactive.\n3. **Master the art of prompting and iteration** Experiment with prompts, refine, validate, repeat. The value lies in iterative refinement—not handing off tasks wholesale to AI.\n4. **Agents work but you got to baby sit them** Often I can have 5 or 6 agents doing different 30 min tasks. Think about that, in 30 mins I can get 3.5hrs work done (3 by agents, 30 by me). But a lot of my 30mins is working with the agents to keep them on track. But its worth it for 3hrs free work!",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.74,
    "subreddit_type": "public",
    "ups": 117,
    "downs": 0,
    "created_utc": 1756226036.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Emotional worry/critique about AI tools with stance.",
    "composite_score": 3.6475783498852374
  },
  {
    "score": 102,
    "title": "If i die tell my team to check google tag manager first",
    "selftext": "I swear 90% of my mental breakdowns come from GTM.\n\nYou think a tag is fine. It’s not. You think an event is firing. It’s lying.\n\nThe preview mode gaslights me like an ex. Everything’s fine meanwhile analytics nothing recorded.\n\nI’ll spend two hours thinking I broke the site just to find out it was one stupid trigger.\n\nAt this point I’m convinced tag debugging should count as therapy.\n\nWhat’s your most painful GTM moment? \n\nLet’s trauma bond.\n\n",
    "subreddit": "digital_marketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 102,
    "downs": 0,
    "created_utc": 1762495886.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.86,
    "category_rationale": "Rant about GTM issues with relatable frustration.",
    "composite_score": 3.5692291530650397
  },
  {
    "score": 102,
    "title": "I’ve worked with Brands like Apple &amp; Adobe For Instagram Strategies. Here’s My Insights on Instagram Growth In 2023",
    "selftext": "\n#Building A Feed Identity \n\nYou recognise your friend from a mile away because you constantly see him in the same outfits and looks. Instagram uses photo-recognition to analyse the visual identity of your content. \n\nThat’s why keeping a constantly similar content design and format will help you a lot to reach explore page faster than others. \n\nA consistent brand design posting format also helps you to differentiate from content from low quality content. \n\n#Understanding What Reels Stand for \n\nFrom an Investors perspective, Instagram in first place invested in reels because the format would bring more revenue to advertisers. \n\nI’ve analysed 4,000+ reels as my work to understand how this algorithm works. The algorithm loves short content and also informs you about Audios that trending. \n\nAnd most of the trending audios tend to be less than 15 seconds. Pointing at the algorithm loves short content easy and fast  to consume. \n\nOn Average reels after consuming 3-5 taking 1.5-3 minutes of users, the platform served an Ad. While on Tiktok the number was 6-10 TikTok videos taking 7-10 minutes of your time and then an Ad.  \n\nThat’s how I came to the conclusion of keeping reels short and being early on trending sounds. \n\n#hashtags aren’t what they mean! \n\nInstagram constantly tells on their blogs and  Adam Mosseri (CEO) through IG live that hashtags aren’t for likes. \n\nYes, Hashtags don’t derive engagement. Keywords do, how instagram structure works an average user wants to see new content around a topic. The search the keyword and scroll all the way to “Hashtags” and scroll through selected hashtags to find new content. Sometimes they even follow hashtags to keep seeing new content. \n\nThat’s how influencers and businesses end up getting reach from hashtags. This proves the hashtag count and size doesn’t matter. What matters is the structure, is the hashtag structured in a way that when someone searches: \n\nHow to Grow on Instagram? \n\nWill the hashtags show up, is it searchable and keyword friendly? If yes, use those hashtags to represent your posts. \n\n#The Instagram Engagement that matters \n\nThis Advice applies to both brands working with Instagram influencers and the others doing organic marketing. \n\nDon’t track your explore reach or how many non-followers you are reaching. **Track your Home Page reach, Here’s Why:** \n\nEvery Creator and Business have a growth phase on Instagram where you will have viral content helping you grow to a peak of your business on IG. When it stops, your engagement will fall. \n\nBecause you never kept of how your existing followers responded to your content. You were reaching lesser and lesser followers as your following grew because you were too focused on trends. \n\nThat’s for long term try to keep track of your Home reach and how your existing followers are responding to content. If it’s bad, you should revamp your content strategy. \n\nFor Brands, work with Influencers that have good Home page reach to have better results from your campaigns. \n\n#The Alt Text is a Bonus \n\nInstagram introduced Topics for reels to filter reels better but does it mean you will reach your target audience immediately? No. It’s a bonus feature to help you. \n\nThe same is with Alt text, it gives algorithm more context about your post. Some people say it’s for users with special needs. \n\nIt stands for that, but algorithm overall is going to use that information to understand the post. That’s why its good to write Alt text for your posts. \n\n#Understanding How Stories Work \n\nIt’s pretty simple to understand how Stories work and what you need to share to constantly get more views. \n\nGo to your current IG story insights, You will see a Section called “Navigation”. Here’s what it means! \n\n* Back- means the follower swiped back to see your last story or someone else's story they saw before!\n* Forward- means the follower clicked to see your next story\n* Next story- the follower moved to see someone else's story\n* Exited- means the follower left the stories.\n\nAnalyse which story has the most forwards and lesser exists, then try to create that type of stories because IG wants to keep the user on the stories tab but you made them exit. A huge mistake. \n\n#State of Instagram Photos \n\nLast week of November 2022, Instagram CEO announced they have balanced the photos reach but nothing is changed. \n\nThe state of Instagram Photos is different based on various niches. Ask yourself: What percentage of your industry is actually creating photos? There is a shift to reels and Instagram will prioritise reels as promised. While some niches I studied like UI/UX have a majority of users posting photos and consistent posters grow on IG with photos too in that niche. \n\nBut the Advice is to shift to Instagram carousels because you have a second chance of showing up on your followers home page. As Instagram previews your second slide to the follower if they skipped first time. \n\n#A Word from Previous Instagram Employee \n\nIn a recent newsletter Interview with Rachel Karten, A Designer that worked as Instagram employee mentioned that jumping on using new Instagram feature is always beneficial to grow your account. \n\nMy Advice, Instagram doesn’t regularly launch features directly linked to help you grow. \n\nBut the recent “Instagram notes” feature can be helpful to businesses because it’s more personal and you can inform your followers about new launches through notes. \n\n**\n\n*Thanks for reading. My research was based on tracking Instagram news, trends, studying reels &amp; talking to Instagram Insiders. Instagram in 2023 is still a potential marketing channel!*\n\n**You can subscribe through Link in my bio to receive Social Media Updates &amp; Algorithm Insights this week like other redditors.**",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 102,
    "downs": 0,
    "created_utc": 1673185914.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Insights on Instagram growth and algorithm dynamics.",
    "composite_score": 3.2024584794248345
  },
  {
    "score": 103,
    "title": "Free Instagram Followers in 2025 – What’s Actually Working",
    "selftext": "**2026 UPDATE(STILL WORKING):**\n\n  \nSo I’ve been experimenting a bit with Instagram growth this year and thought I’d share something that might help anyone looking for a quick start.\n\nMost of us know Instagram’s gotten way harder to grow on in 2026 – reach is down, ads are expensive, and the algorithm really pushes reels over everything else. I started testing some of the “free followers” sites floating around just to see if they actually work, and surprisingly a few of them do deliver without asking for crazy stuff like passwords.\n\nHere are the ones I tried: •\tsmmsumo – They give you 200 free followers right away, no password needed. Delivery is pretty quick too. •\tqqsumo – Similar deal, pretty simple claim process, works well if you just want to bump up your numbers a bit. •\tfollowerszeal – Their free trial worked for me, though the speed was a little slower compared to smmsumo. •\talwaysviral – Decent option, gives you a small free pack, and they have some other social platforms too. •\tqqhippo – Another one I tested, legit and easy to claim, nothing shady.\n\nNote that you can use only one ip in a day.\n\nNot saying this is going to magically blow up your account (you still need content, consistency, etc.), but if you just want a little starter push in 2026 , these are the ones that worked for me personally.\n\nAnyone else tried these or found other sites that actually deliver free followers without spammy stuff? Curious to hear what’s working for you guys this year.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 103,
    "downs": 0,
    "created_utc": 1757692889.0,
    "media": null,
    "is_video": false,
    "num_comments": 474,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.93,
    "category_rationale": "Enumerated list of sites/tools for free followers.",
    "composite_score": 4.030380144111214
  },
  {
    "score": 98,
    "title": "Is digital marketing actually a good career in 2025 or just hype?",
    "selftext": "I’ve been hearing a lot about digital marketing lately everyone seems to be talking about it like it’s the next big thing. You see ads for courses, YouTubers showing crazy income screenshots, and job posts asking for people who know “AI marketing tools.”\n\nPersonally, I find the field interesting it’s creative, analytical, and seems less monotonous than pure coding or finance roles. But at the same time, I feel it’s becoming too saturated, and AI is automating so many tasks like ad copywriting, analytics, and SEO. I genuinely want to know if people working in this field still see strong career growth, or if it’s turning into another overhyped skill that everyone is learning but few actually master. From my point of view, it’s a great skill to learn, but success probably depends on how deep you go like actually understanding human behavior, strategy, and analytics, not just using AI tools.\n\nWhat do you all think? Is digital marketing still a solid career path in 2025, or are we already past its peak?",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1762776170.0,
    "media": null,
    "is_video": false,
    "num_comments": 392,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Discussion asking for opinions on digital marketing as a career with no clear list or model.",
    "composite_score": 4.020331469785264
  },
  {
    "score": 92,
    "title": "Button text that gets +10% clicks",
    "selftext": "I post nerdy marketing insights here from time to time and here's another one.  \n\n\nThis is one is proven to get a +10% increase in CTR.\n\n\n\n**The study:**\n\nResearchers from the University of Mannheim ran a real-world experiment on a cleaning service website.\n\n\n\nThey tested 3 combinations of a headline and button text:\n\n1. The button copy repeated the same keywords used in the headline exactly\n\n2. The button copy had the “gist“ of the headline, using synonyms\n\n3. The button copy had a different text than the headline (Kutzner et al., 2024)\n\n\n\n**Here are the exact headlines and CTA’s they tested:**\n\n\n\nHeader 1: “**Dreaming** instead of cleaning”\n\nButton (Verbatim repetition): “At last, time for **dreaming**”\n\nButton (Gist repetition): “Relax now”\n\nButton (New message): “No more cleaning duties” or “A clean apartment without any stress”\n\n\n\nHeader 2: “No **stress** with cleaning”\n\nButton (Verbatim repetition): “A clean apartment without any **stress**”\n\nButton (Gist repetition): “No more cleaning duties”\n\nButton (New message): “Relax now” or “At last, time for dreaming”\n\n\n\n**What they found:**\n\nVerbatim repetition of the header words on the button led to the highest click-through rate (58-59%), compared to gist repetitions (48-51%) and new messages (42-45%).\n\n\n\n**Why?**\n\nOur brains don’t like to think.\n\nReading the same words twice, takes much less effort, than reading and processing new words.\n\nThis is called high processing fluency.\n\nOur brains mistake that ease for a good feeling and act on it.\n\nThat’s why “gist” repetition worked as well, but not as great, likely because the words weren’t identical, so they required slightly more cognitive effort to get.\n\n\n\n**Takeaway**\n\nA/B test repeating your headline key words in the button.   \n  \n  \nI've been dreaming of starting an ad psychology newsletter for a loooong time and I've finally taken the leap! \n\nI share things like what button shapes to use, what types of images work best in ads, why celebrity ads work, what works better $95 vs $97 vs $99, and more.\n\nIf you're a nerd like me and love research-based insights like this every week, search up my Ad Psychology Nerds newsletter on Google.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 92,
    "downs": 0,
    "created_utc": 1765308489.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Explicitly enumerated button text strategies and findings in a numbered format.",
    "composite_score": 3.4635579377138876
  },
  {
    "score": 93,
    "title": "I’ve spent over $10,000 on Meta ads — just sharing what’s been working for me lately (2025)",
    "selftext": "Hey folks,\n\nI don’t usually post stuff like this, but thought it might help someone. I’ve spent over $10K (personally, not managing agency clients) running Meta ads over the last year or so — mostly for small ecom brands and local businesses.\n\nI’ve made a lot of mistakes, wasted some money, but also found a few things that are really working for me now in 2025. Not claiming to be an expert, just sharing what’s been helping me lately:\n\n\n---\n\n1. Real/simple content works better than polished ads\nMost of my best-performing ads were just product videos shot on a phone — no fancy editing. Anything that looks too much like an “ad” just dies fast.\n\n\n\n\n---\n\n2. Broad targeting + good creative is working well\nI used to over-target with interests, lookalikes, etc., but recently I’m going broad and letting Meta do its thing. If your creative is on point, it finds the right people.\n\n\n\n\n---\n\n3. Retargeting with social proof = low-hanging fruit\nI always set up a retargeting ad with reviews/testimonials — works way better than I expected and it's cheap.\n\n\n\n\n---\n\n4. Landing page speed and checkout UX matters\nI didn’t care much before, but fixing some speed and checkout flow issues doubled one of my campaign ROAS.\n\n\n\n\n---\n\n5. Don’t panic early\nI’ve had ads that looked dead in the first 48 hours and then started printing results. I learned to wait and let the algo learn unless CPMs are crazy.\n\n\n\n\n---\n\nThat’s it really. Not trying to pitch anything — just figured if I can save someone else a few wasted dollars or give you an idea, it’s worth sharing.\n\nIf anyone here is testing stuff and wants to chat or trade feedback, I’m down. Always learning.\n\nCheers 🙌\n",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1750275710.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Contains enumerated actionable tips about ad practices and outcomes.",
    "composite_score": 3.4822524987986485
  },
  {
    "score": 94,
    "title": "I've managed over $6 million on Facebook ads. Here's what I've learned.",
    "selftext": "As a Facebook ads consultant with years of experience in running and managing campaigns for business owners, I’ve learned a lot over the years. From working with hundreds of businesses and managing over $6 million dollars on Facebook advertising, I’ve developed some key insights into what works and what doesn't when it comes to successful campaigns on Facebook. \n\nIn this short post, I want to share these lessons with you so that you can apply them to your own business or clients' campaigns. Whether you're just starting out or have been running Facebook ads for a while, I hope that there is something here for everyone. \n\n## The quality of your traffic matters more than quantity.\n\nHaving 100 quality clicks on an ad is much more valuable than 100,000 low-quality ones. In actually, the more low-quality traffic you send to your website, the harder it will be to have long-term results. Low-quality traffic affects your Pixel data and the conversion optimization within ads manager.\n\n## Give your ads time to optimize before turning them off\n\nSo many times with the campaigns that I manage, I'll have a brand new campaign perform poorly for a couple of days and then on day 4, the results improve drastically to make up for the poor performance days... and much more. Had I turned off the ads after a day or two out of impatience, then  I would have missed out on this great performance.\n\n## The fix for your low performing ads is MUCH more than just one single small little fix. \n\nI've made a more detailed post on this point a year or two ago, but to quickly summarize it, most people think that it's just the one small thing to fix their ads. I've had so many consulting calls where a client will show me their Facebook ad account and say \"I feel like if I just knew what targeting to do, it would fix everything\" when their ad copy is confusing, their budget is spread too thin, and the creative is low-quality. The worst part about the situation is they don't know that there are so many other problems to fix that won't be resolved by just having that one interest.\n\n## Confusing ads will waste a lot of your ad spend\n\nThe point of ads on Facebook is to grab their attention and then make an offer to the viewer. If you grab their attention, and the ad is super confusing then they are just going to skip the ad because they don't want to take the time to understand what it's about. What I try to do with the ads I make for my clients is make it where the main point of the ad can be understood within 3 seconds. This is done either with a creative that is very easy to understand or adding enough context in the headline or the top of the primary text ad copy.\n\n## Let go of any emotional attachment to ads that don't perform well\n\nLearning how to let go of ads that don't perform well has been something I've had to come to terms with in my experience managing over $6 million dollars on Facebook Ads. It's easy to get attached to your ideas and feel like you need to give them a chance, but learning when something isn't working is essential for optimizing performance. When ads don't meet their goals and objectives it's important to recognize that, come up with a plan going forward, and move on from the one that isn't delivering results. In order for us all to be successful we need to take our lumps and use whatever data we have collected from unsuccessful campaigns in order to benefit future ones.\n\nThese are just a few of the lessons that I’ve learned over the years from managing campaigns for hundreds of businesses and investing over $6 million in Facebook ads. With these key takeaways, I hope that you can apply them to your own business or clients’ campaigns to help\n\nAnd if you're still struggling, remember that this community is here to help. So if you need some extra one on one help achieving your marketing goals, I'm always happy to chat.\n\nI hope this post has been helpful in providing you with some tips and tricks for managing a successful Facebook ad campaign. Remember, it takes time to optimize your ads but if you stick with the process, I'm sure you will start seeing results!",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1675395956.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Offers learned insights about Facebook ads and how to improve performance.",
    "composite_score": 3.4801154035972526
  },
  {
    "score": 77,
    "title": "Here’s What Happened In February 2023 In Marketing &amp; Social Media (It’s changed)",
    "selftext": "#Tiktok: \n\n* Tiktok added updated policies for creators with new account enforcement system. \n* Tiktok is testing Refresh, A new feature to refresh your “For You” page algorithm. \n* Tiktok introduces 4 new ways to quickly promote your content on its platform. \n* Tiktok is launching dedicated feeds for specific topics like Food, Fashion and gaming. \n* Tiktok announced new brand safety and suitability partners. \n* Tiktok expands access to it’s research API for independent researchers. \n* Tiktok launched new type of creator fund “Creativity Program Beta”. \n\n#Instagram: \n\n* Instagram Notes are now available to users in Europe &amp; Japan. \n* Instagram expands Gifts to all creators in United States. \n* Instagram tests “Memory” prompts to increase user engagement. \n* Instagram launched WhatsApp like “Channel Broadcasts” for Creators &amp; Brands, You can join waitlist. \n* Instagram is getting rid of live shopping this month. \n* Meta is launched Paid Subscriptions for Facebook &amp; Instagram. \n* Instagram testing User location listings on reels clips. \n\n#Google:\n\n* Google Updates Search Console Video Editing Report. \n* Google announced it’s new AI Bot “Bard” in Google Paris Event. \n* New Updates to Google’s Gambling &amp; games policy. \n* Google Ads API Version 13.0 Now Available. \n* 3 new Google Analytics Updates: New Datasets, Details insights in 360 properties &amp; more.\n* Google Ads launch new CTV Advertising features. \n* Google announced sixth product reviews update for e-commerce. \n* Google updates guidance on helpful content system and discover traffic. \n* Google Ads Performance Max adds Brand exclusions, Page Feeds, Video Creation &amp; More. \n* Google search console and permissions management updated. \n\n#Meta: \n\n* Meta shared 2022 Earning Report &amp; It’s vision for 2023. \n* Meta delays setting team budgets as it plans to cut more employees. \n* Whatsapp working on new feature to transcribe audio messages to text. \n* Meta’s adds more data to “Why Am I seeing this Ad” prompts, to increase Ad Transparency. \n* Meta launched Paid Subscriptions for Facebook &amp; Instagram. \n* Meta Tests Product Promotions in IG group chats. \n* Meta Highlights how they are working on improving Facebook’s penalty system. \n* WhatsApp is also supposedly working on a newsletter feature. \n\n#Twitter: \n\n* Twitter will share Ad revenue with Twitter Blue Creators. \n* Twitter Blue expands to six new countries brings back space curations. \n* Twitter ends Co-Tweets, collaborative feature. \n* Elon wants to charge $1,000 per month to companies to retain blue checkmarks. \n* Twitter tests expanded emoji reaction options in DMs. \n* Twitter will charge developers for API access from now on. \n* Twitter tests new quick boost option for tweets. \n* Twitter Blue introduces 4,000 character tweets, says half tweet ads are coming. \n* Twitter will limit 2FA Feature to Twitter Blue Subscribers only from March 20,2023. \n* Ads for cannabis are now allowed on Twitter. \n* Elon promises more positive changes coming to Twitters Ad Platform. \n* Twitter internally cuts off access to slack for employees and also owes stack money for the service. \n\n#YouTube: \n\n* Youtube launched new Comment Filters to make creators find previous comments easier &amp; one other visualisation update. \n* Youtube will allow advertisers to place ads during videos on specific time stamps. It’s game changing! \n* Youtube CEO Susan Wojcicki Is setting down. \n* Youtube adds Feature to reply to comments with Shorts like Tiktok. \n* Youtube announced new commercial Music licensing resource for creators. \n* Podcasts are coming to Youtube Music. \n* Youtube users can now build custom radio stations. \n* Youtube expanded access to let creators dub videos in multi-languages. \n* Youtube adds more Shorts performance insights, updated chat moderation role. \n\n#Snapchat: \n\n* Snapchat added 12 Million Users in Q4 2022 but failed to meet revenue predictions. \n* Snapchat now has more than 2 million paid subscriptions. \n* Snapchat to Use Ray Tracing to Make AR lenses more realistic. \n* Snapchat rolls out new sounds feature to make content creation easier. \n\n#Pinterest: \n\n* Pinterest Announces new video collaboration with Publisher Condé Nast. \n* Pinterest shares slip on Q4 2022 revenue and weak forecast. \n* Pinterest is testing 5 Minutes length for Idea Pins. \n* Pinterest relaunches Pinterest e-learning Academy. \n* Pinterest partnered with UC Berkeley Center for a research about affects of Pinterest on consumers. \n\n#LinkedIn: \n\n*  LinkedIn Announced new Feed Features, Newsletter Scheduling &amp; One-click subscribe for newsletters. \n* LinkedIn will soon give users ability to choose their content viewing preferences on profiles. \n* LinkedIn added new Features to make newsletters grow faster &amp; easy-to-subscribe. \n\n#Marketing: \n\n* Microsoft discontinues bid modifier for audience ads. \n* Open AI launched Tutorials site + New Subscription plans for ChatGPT. \n* Amazons Ad business grew by 19% last quarter more than Google &amp; Microsoft. \n* Yahoo shutters SSP &amp; narrows focus on Ad buyers. \n* Wendy’s first to test Roku, Doordash deal around shoppable TV Ads. \n* Getty images sues stability AI for copyright infringement. \n* Twitter rival Mastodon shows declined growth despite the regular concerns about twitter. \n* Microsoft’s New Bing is planning on Bringing AI Ads soon. \n* Spotify will launch a Tiktok like feed for it’s users to get more user engagement. \n* Reddit Ads now support five new currencies: AUD, CAD, EUR, GBP, NZD. \n* Discord’s Stage Channel just got a major update. \n* Twitch now lets streamers tag channels in Stream titles. \n* Microsoft Advertising unveils lodging solutions, and adds 11 new Google imports market for Smart Campaigns. \n* Clubhouse launched new feature called “Mutuals” to make networking easy during calls. \n* Twitch launches “experimenting hub” to inform creators what they are working on. \n* Walmart Ad sales hit $2.7B as executives eye greater scale. \n\n\n***Thanks for reading. These posts are sometimes deleted due to mod hate and I also can’t link sources. If you Liked this, Consider subscribing to my weekly newsletter link in my bio.***",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1678041729.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Presents a long list of updates by platforms, organized as bullet items.",
    "composite_score": 2.993670227882302
  },
  {
    "score": 71,
    "title": "2.5 million in sales while paid ads are turned off",
    "selftext": "Before I get into the good parts of this post here's a quick disclaimer:  \n- This brand did 1.8 million the year before  \n- I do not own this brand, I was hired to build a cult-following  \n- paid ads were being ran for the first quarter of the year but not converting well\n\nThat's relevant information because not every brand can see massive success without paid ads. Most of the things I talk about in this post are pretty much useless if you do under 15k/month. Now that that's out of the way, let's talk about what I did to nearly double this brand's revenue without dumping more money into ads.\n\n**For those who don't like reading, I'll summarize what I did right here: I built a community around the brand.**\n\nSo I'll break down what I did into 5 steps:\n\n1. Obtained a shit load of user-generated content\n\nI was able to get 300 videos of people using the brand's products in under 60 days.  \nThis is easier than it seems. People pay influencers thousands to pose with their products. For a brand with a bit of traction, the value in user-generated content is to get products in front of a larger audience; Not necessarily for social proof (like it is for smaller brands). So with that being said, don't spend a lot of money on UGC content unless it's for a promotional post on a page with a large following.\n\nDon't fixate on having the prettiest videos. Give a wide variety of people the opportunity to submit content.\n\n3 ways you can get user-generated content for free/cheap are:\n\n- Use your social media channels to offer a free product in exchange for a video review  \n- Setup a review email flow, offer existing customers a chance at a full refund for a video testimonial that meets certain criteria  \n- Directly contact influencers and negotiate/hire someone with a network of influencers to do the negotiation process for you\n\n2. Created a blog\n\nI designed a blog page on the website and posted on it 1-2 times per week. I used Ai to generate in-season ideas for blog posts, then got my copywriter to do some research and come up with short blog posts that were informative and read well. P.S Just using chatgpt to pump out blog content can work but the content will never be as engaging as content written by a real person that understands the marketing angle. We also tried to add user-generated content on the blog pages as much as we could.\n\nThis is by far the easiest way to get people back onto your site without them feeling like you're trying to sell them more products. This is the base of the next 3 steps. Good blog content makes people in your niche excited to hear from you. This will boost your email open rates, allow you to post in groups that are heavily moderated against promotions, and give you a lot of niche-specific copywriting to work with.\n\n3. Created a subreddit (or any type of group)\n\nI created a subreddit for this brand, then I spent hours finding niche-relevant content. Then, I queued a whole bunch of posts. I did a mix of reposting content from tiktok, instagram, youtube, etc, and posting the site's blog posts and UGC content. Growing the community was tricky but once I got some momentum going it was almost growing itself.\n\nThere's major upside to owning a community inside of your niche. You can block your competitors from posting in your sub and post as much promotional content as you want. You can also mix content, so people have no idea if you're promoting a store, sharing a funny photo, or giving a useful recommendation. You'd honestly be shocked by the amount of traffic our weekly pinned post brought to the site.\n\n4. Discord community\n\nI used social media, Reddit, and emails to grow the community to 11 thousand members in under a year. Customers were giving design ideas, connecting with store employees, and volunteering to send content with products for FREE.\n\nThis is like a reddit community but more personal. The main difference between the discord and the reddit is that the discord is branded and the Reddit is just niche specific. This is a good place to run competitions and polls, and also just interact with customers on a personal level. You can get a tone of UGC from a discord community if you use it right.\n\n5. Email and SMS marketing\n\nI saved the best for last. Normally my posts are mainly focused on emails but I thought I'd switch it up today to truly convey what goes on behind the scenes of well-coordinated email/sms marketing.  \nThink of emails as an ongoing conversation between you and your customer. You play the role of a friend recommending things to a peer. You already know things about them, like their interests, location, and buying habits. Now use segmentation and predictive analytics to make sure relevant content gets sent to interested people. I'll leave it at that.\n\nBut before I leave I'll share some more info about this brand that may be relevant. It's a breed-specific animal brand, this brand has been around for about 4 years and has consistently grown 30-40% each year with last year being an outlier (almost doubled sales), the people in this niche are extremely passionate about their pets so this may have made it easier for me to grow a community this quickly, and the 2.5 million that I am attributing to my systems are just the sales that came from EMAIL and SMS marketing.  \nThanks so much for taking the time to read my post, Id be happy to provide more clarity on any of the subjects that I mentioned in this post.",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1716703080.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.8,
    "category_rationale": "Provides a numbered sequence of actions designed to replicate growth without paid ads.",
    "composite_score": 3.362983746814912
  },
  {
    "score": 71,
    "title": "4 years. 3 agencies. 800k followers. $50k revenue. My Honest Take.",
    "selftext": "Just putting my experience out here, I'll keep the whole thing casual - tired of seeing posts written by chatgpt.\n\nSo I started with building my own theme pages, it was a quote page, had success moved to memes, pets and finance niches. Built and grown a network of over 800k followers myself, eventually sold them. Started working as a SMM for brands, theme pages and local business in a variety of niche - finance, fitness, tech etc. \n\nWhile working as a SMM, I found out about Funnel building, dived deep into it and eventually started my first agency as a funnel building one - I now have more than 2 years of experience in building end to end funnels for my clients, helped local business, dentists , fitness coach and others to maximise their cash flow (In simple words: made their website better and helped them generate more sales)\n\nThe second one is my fav one, in the past two years I have built my own Influencer marketing agency (IMA) it's more like a talent management one (in the creators side), closed deals worth more than $30k in just past 8 months. Majority in the Australian market, a few in the US.\n\nThe third is my video editing agency, hardly 6 months back, it isn't as successful as others, still made something (and it was fun messing with edits)\n\nAnd yup every business was built upon Instagram.\n\nMy honest take? It isn't hard as people make it to be, you just have to a hell lotta consistent even if things ain't working out. \nWork hard and keep on Upskilling yourself. That's the Mantra that worked out for me!\n\nIf I had to chose one skill I would learn the first is Sales - from prospecting, outreach and negotiating. Sales is the skill that makes you THE MONEY! No matter how skilled are you, if you can't effectively sell your service out there - you can't make money. It's as simple as that.\n\nDon't shy away from asking questions (I used to ask the dumbest question - best decision ever) drop your messages",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1753980207.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Shares personal experiences and distilled lessons for building skills and business.",
    "composite_score": 3.4714939264914966
  },
  {
    "score": 72,
    "title": "Only Marketing Resources You need for Social Media Growth",
    "selftext": "\nI try to capture the best resources for marketers every week, Here’s resources I believe most of you haven’t discovered + they are officially created by the platforms. \n\n#Tiktok Free Resources \n\n1. Tiktok Keywords Library: To find what keywords are most used &amp; have highest CPM. \n2. Tiktok Insights Library: You can find insights about different audience demographics from country to country. \n3. Tiktok Ads Academy: It’s a free Academy to help you learn Tiktok Ads. \n4. Tiktok Ads Library: To find what campaigns other platforms are running. \n\n#Instagram &amp; Facebook \n\n1. Facebook Ads Library: I believe many of you know about this resource, but it is one of the best resources. \n2. Facebook Widely Viewed Content Report: This Report is launched quarterly to help you understand what’s going viral on Facebook in terms of organic content. \n3. Meta Blueprint Certifications: To Test your Advertising Skills on Meta Platforms, take certification tests to learn more about Advertising. \n4. For Beginners: Try to take the Meta Blueprint course first &amp; after that take the tests after every 2-3 months to learn more. \n\n\n#Pinterest \n\n1. Pinterest Academy: The platform relaunched its e-learning platform Pinterest Academy. Recommended for anyone interested in Pinterest marketing. \n2. Pinterest Trends: A well-known Resource to help you discover new trends across Pinterest. \n\n#LinkedIn \n\n1. LinkedIn Podcast Academy: Launched this week, To help podcasters gain more knowledge regarding Podcasting. \n2. LinkedIn Learning: It’s a famous Marketing Resource to learn more than just LinkedIn Marketing. (But it’s not free)\n3. LinkedIn Ads Blog: The platform publishes every month new infographics, insights &amp; Data to help Advertisers. \n\n#Reddit \n\n1. RedditforBusiness: The Website is filled with some useful information &amp; insights about reddit marketing. Not the best, but beneficial for starters. \n2. Adlibro - It’s an unofficial Reddit Ads library I discovered recently filled with some amazing Reddit Ads to look at for Inspiration. \n\n#Twitter \n\n1. This Week: Twitter launched eight-episode video marketing course it is called “Unskippable Video Ads Twitter Course”. \n2. Twitter’s School For Advertisers &amp; Marketers: It’s called “Twitter Flight School” filled with resources regarding Twitter Marketing. \n3. Twitter for Business: They announce new infographics, Statistics regarding NFL, March Madness &amp; other events on this free blog. \n\n#Snapchat \n\n1. Snap AI Bot: You can now Ask Snapchat AI bot for suggestions regarding Snapchat growth &amp; marketing. (Currently available for snap premium users, but will be available to all soon.) \n2. Snapchat Trends: A search engine to help you discover new trends on Snapchat. \n3. Snapchat Ads Specialist: You can schedule a call with Snap before running your Ads on the platform. \n\n\nThese are few official resources from the platforms to help you do better social media marketing. These resources are launched every once in a while like 3 resources above where launched in previous 2 weeks.\n\n**P.S. I Share Updates regarding new marketing changes, news &amp; resources every week, You can subscribe through link in my bio receive them.**",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1679242049.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Lists marketing resources and tools across platforms in a structured format.",
    "composite_score": 3.1477945362738744
  },
  {
    "score": 68,
    "title": "How I helped a small recruitment agency grow from 110 hires at 14 clients → 2,100 hires at 100+ clients (and fix their 3.5⭐ Google rating)",
    "selftext": "Hey everyone 👋\n\nI wanted to share a breakdown of what worked for one of my clients, a mid-sized recruitment agency that went from doing **\\~110 hires/year across 14 customers** to **over 2,100 hires across 100+ clients**.\n\nNo fancy ads or overnight success, just systems, consistency, and automation that quietly compounded over time.\n\nHere’s what actually moved the needle 👇\n\n# 1. Rebuilt their CRM around actions, not records\n\nMost recruitment CRMs are glorified spreadsheets. We restructured theirs to focus on *candidate movement*. visualizing bottlenecks, tracking response time per recruiter, and automating follow-ups based on inactivity.\n\n**Result:** recruiters handled 2–3× more candidates with the same workload.\n\n# 2. I've built an automated referral system\n\nWe launched a referral engine for past candidates and clients. Whenever someone got hired, they received a personalized referral link (automatically tracked).\n\n**Result:** \\~18% of new candidates came through referrals within 3 months.\n\n# 3. Introduced weekly mini-dashboards for recruiters\n\nInstead of flooding everyone with endless reports, we sent *one Slack message per week* with just three KPIs:\n\n* New candidates added\n* Interviews scheduled\n* Placement ratio\n\nresult recruiters started self-correcting without needing management to nag them.\n\n# 4. Automated client touchpoints\n\nEach time a role was filled, clients automatically received a quick feedback form and a review request. Once we collected enough testimonials, we turned them into mini case studies for the sales team. And to boost SEO we added them to a blog on the website.\n\n**Result:** credibility went way up and sales calls got a lot easier.\n\n# 4. Fixed the 3.5 star Google Reviews problem\n\nThis one was a big deal. The agency’s Google rating was **3.5 stars**, mostly from *rejected candidates* leaving angry reviews. It gave potential clients the wrong impression.\n\nWe used a tool called Reputaty.com to separate *internal feedback* from *public reviews*.\n\nHere’s how it worked:\n\n* Every candidate who finished an interview received a feedback form.\n* If they rated the experience highly (e.g. 4–5⭐), they were guided to leave a Google review.\n* If they rated it lower, their feedback stayed internal so the team could learn and improve without it tanking the public rating.\n\n**Result:** within 4 months, their Google rating jumped from **3.5 to 4.8 stars**, and they started getting more inbound leads from businesses checking their profile.\n\n# 5. Optimized inbound funnel (LinkedIn → landing page → calendar)\n\nNo ads needed. Recruiters shared weekly stories. New hires, behind-the-scenes, happy clients. Each post linked to a simple landing page with a Calendly call-to-action.\n\n**Result:** 70% of new clients now come from inbound or referrals.\n\n**6 - Connected everything into one clean system**\n\nSalesforce → ActiveCampaign → SQL → dashboards → automations. one ecosystem = zero chaos.\n\n**Takeaway:** You don’t need more leads. You need better systems, cleaner data, and smarter reputation management.\n\nHappy to answer questions about what tools or automations we used (most are low-cost or no-code).",
    "subreddit": "digital_marketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1761761936.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.78,
    "category_rationale": "Offers a stepwise breakdown of actions that led to recruitment growth and improved reputation.",
    "composite_score": 3.0103940842332273
  }
]