[
  {
    "score": 1179,
    "title": "Throwaway: Instagrams entire future depends on automation (I saw it firsthand)",
    "selftext": "Throwaway for obvious reasons. Up until 2 months ago I was on the M&amp;A (mergers &amp; acquisitions) team at Meta. I left to work for another company in the social media space, but while I was there I saw enough on the inside to understand how Instagram really thinks about growth and where they’re steering things. Figured I’d share some context because I keep seeing the same bad advice and the same people getting burned.\n\nFirst off, I can’t tell you who you should use, but I can tell you who you should avoid.\n\nPath Social, Kicksta, Upgrow, Wolfgrow. None of these are real growth solutions. They’re glorified bot farms. They recycle fake accounts from overseas, route them through the same IP pools, and hammer Instagram’s flagged API calls until your account gets flagged too. They don’t build communities, they build fake shells that eventually collapse. And yes, Meta knows. These companies have been on compliance watchlists for years.\n\nSo why are they still around? Simple: ads. Path Social in particular spends a ridiculous amount of money on ads with Meta, and that basically buys them time. Meta cashes the checks while quietly banning or throttling the accounts tied to them. It’s a double dip. They profit from the ad spend, then profit again when those same customers crawl back into official ads just to stay visible.\n\nHere’s the bigger truth. Meta doesn’t care about your follower count. They don’t care about influencers gaming the system. The company lives and dies by two numbers:\n\nAverage time on app. That’s the stat they brag about at quarterly shareholder calls. If they can say “time spent per user is up,” Wall Street is happy.\n\nAd revenue. Because that’s the entire business model.\n\nEvery algorithm tweak, every policy change, every shadowban serves those two goals. Anything that doesn’t feed into them gets killed off. That’s why 99% of these “10k followers in a week” type tools never last.\n\nNow here’s the part most people don’t see. Without breaking NDAs, I can say this much: there are exactly two companies worldwide that Meta has quietly allowed to keep operating under a controlled test umbrella. Both are small AI-driven firms. One is based in St. Louis. The other in Scottsdale, Arizona.\n\nThese companies don’t blast bots or fake engagement. They built server systems that mimic human behavior so closely that Meta can pitch the results as “increased time spent on platform” in their shareholder decks. Both price their services at $300+ a month, not because it costs that much to run, but to keep the user base small and serious. Only accounts with deeper pockets and long-term goals get in. That exclusivity keeps them safer than the mass-market tools that draw attention.\n\nThe Scottsdale company has already been acquired by Meta. Their paying users were grandfathered in and now basically run the software for free under Meta’s controlled testing. If you dig around Crunchbase you can probably figure out which company it is by looking at Meta’s recent acquisitions.\n\nThe St. Louis company is still independent, but here’s the kicker: it already has investment money from Meta and is under contract for business marketing work across the Midwest. Part of me has always wondered if companies like this are basically shells Meta sets up to experiment through, but the outright acquisition of the Scottsdale firm kind of kills that theory. (Shells aren’t really my area, so I’ll admit that part goes above my head.) Either way, it feels inevitable the St. Louis one gets folded in soon too.\n\nThis fits into the bigger roadmap. Instagram has neglected the business and influencer space for years, and now they’re correcting course. Instagram also knows it isn’t the app people get “big” on anymore. Most creators blow up on TikTok first, then spin up an Instagram that just bleeds off followers from their TikTok links. And Meta hates that. Trust me, they know exactly where they stack up in the social media hierarchy right now. I had been with them for a long time, and honestly it’s kind of hurt to watch them morph from a photo app, to a video app, to a live streaming app, and now into a business app. That shift was part of why I left. It feels washed up to me. More power to the brands and business owners who get in early — I know a lot of big-name brands are already using the St. Louis company, so good for them — but it didn’t align with my own career goals. I’m a principled man, lol.\n\nGoing into 2030, Meta is clearly steering Instagram toward being the platform for brands, influencers, and businesses. TikTok will keep dominating the “average person” space with broad organic reach. Instagram is doubling down on being the go-to platform for businesses that need precision — targeting exact demographics, warming up leads, and converting followers into paying customers.\n\nSocial media is splitting into two lanes. TikTok for reach. Instagram for revenue. And Meta is betting heavy on automation to make it happen. Not bots, not spammy junk, but AI systems that drive engagement in ways that can be tied back to sales. From an M&amp;A perspective, this isn’t about giving small creators a fair shot. It’s about building a suite of business tools Meta can sell, scale, and present to Wall Street as the future of digital advertising.\n\nSo if you’re looking at the landscape long-term, hedge your bets accordingly. Instagram is positioning itself as the business platform of the 2030s. The tools they’re rolling out for businesses are way beyond anything they’ve done before, and honestly, they’re impressive.\n\nAt the end of the day, Meta doesn’t want to fight automation. They want to own it. And once these acquisitions are fully folded in, they will.\n\nI had this posted in r/instagrammarketing within 5 days it became the top post in that subreddit, the next day that entire subreddit got banned. So take this information as you will, but there was definitely Meta intervention there. The sub had over 270k members…. ",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1179,
    "downs": 0,
    "created_utc": 1758735140.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Explains how Instagram growth works and why certain tools fail, with a central explanatory claim.",
    "composite_score": 4.8121996046049
  },
  {
    "score": 1118,
    "title": "I'm an ex-Meta ads engineer, and here's what actually drives customer acquisition",
    "selftext": "Hi everyone, I'm an ex-Meta engineer who spent 5+ years working on the ads algorithm team. And then I worked at Reddit as a Senior Engineer in their ads department as well.\n\nEdit: After leaving, I founded [Aimerce](http://aimerce.ai) to help Shopify brands fix the exact tracking and delivery issues I saw from the inside and honestly, it’s wild how many of the same patterns still show up.\n\nBased on my experience helping 120+ brands since leaving Meta, here's what actually works:\n\nI won't dive into details about idea validation or market fit—that should come before product creation. But if you already have a product in commerce or B2B, here's some underrated solutions to try to boost your rev:\n\n**Optimization**  \nFrom my time building Meta's ad delivery system, I know this is crucial. Your website needs perfect technical implementation or you're throwing money away. Key technical elements that feed into ad algorithms:\n\n* Server-side API integration (crucial since iOS 14)\n* First-party cookie implementation\n* Advanced matching parameters\n* Custom conversion events\n* Real-time event logging\n\nMost importantly: track every meaningful user interaction server-side. At Meta, we saw 3-4x better ad performance with proper server events vs client-side only.\n\n**First-Party Data Collection**  \nThis is what powers modern ad algorithms. Essential data points to collect:\n\n* User behavior patterns\n* Conversion paths\n* Time-to-conversion\n* Cart abandonment signals\n* Feature usage metrics\n\nPro tip: Log these events immediately server-side. There's a 30% data loss on average with client-side only. This means having your own first party data pixel or first party intelligence app instead of relying on third party pixels like the default you get from Meta, Google, or whatever ad platform you're using.\n\n**Algorithm Optimization**  \nHaving built these systems, here's what actually matters:\n\n* Event quality scores. These are more accurate when tracked server-side instead of a third party pixel.\n* Server-side conversion matching\n* Bidding strategy alignment\n* Creative performance signals. This one is most obvious.\n\nThe algorithm weighs server-sent signals 2-3x more than pixel data.\n\n**Email Engagement**  \nI'm a huge advocate of having a combination of paid and email marketing. When they work in tandem, you get the highest quality signals that can feed into each other for retargeting. Here's some flow that people usually miss:\n\n* abandoned cart for ecommerce\n* abandoned intent for b2b\n\nNote that abandoned cart/intent are explicitly different from abandoned checkout. At the checkout stage, you've already collected email address and have high-intent for conversion. Email marketing is going to be even more effective at the stage right before. For ecommerce, its going to be at the point of adding the cart. For B2B, it could be viewing the pricing page.\n\nMost people don't implement these flows because it often requires some manual work but if you're able to stitch user sessions across their history, you can use your cookies to understand if the visitor has shown interest in purchasing before and have a specific email flow for it! This is probably the most underrated solutions.\n\nPro Tip: Sync email engagement data back to ad platforms via server events. This improves targeting by 25-30%.\n\nThe key is quality first-party data feeding into platforms' algorithms. With proper implementation, I regularly see 2-3x ROAS improvement.\n\nWe’re seeing the same delivery issues pop up again and again especially in accounts using duplicated pixel setups or relying too heavily on GTM. At Aimerce, I've audited hundreds of Shopify brands this year alone, and it’s always the same root causes. Fix those and performance usually rebounds.\n\nMessage me if you need help with technical implementation details! I might do a dedicated post on this if there's interest!a",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1118,
    "downs": 0,
    "created_utc": 1730310267.0,
    "media": null,
    "is_video": false,
    "num_comments": 171,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Offers a structured, actionable approach to ad optimization with specific steps/tools.",
    "composite_score": 4.909094309982124
  },
  {
    "score": 1051,
    "title": "Google is quietly burying the internet",
    "selftext": "Google’s new AI Mode doesn’t just summarize the web. It sidelines it.\n\nWhat started with AI Overviews is quickly becoming a full takeover of how we interact with online information.\n\nHere’s what you need to know:\n\n↳ AI Overviews push actual links down the page AI Mode barely includes them at all.\n\n↳ Instead of sending you to websites, Google now encourages follow-up prompts inside its own tools.\n\n↳ The result: fewer clicks, less traffic, and a slow starvation of the open web.\n\n↳ AI Mode feels cleaner and more useful because it skips the clutter Google’s own algorithm helped create.\n\n↳ But it’s built on content scraped from the same sites it now sidesteps.\n\n↳ This isn’t just innovation it’s an extraction. A move to own both the question and the answer.\n\n↳ And it’s happening under the banner of “intelligence,” not search.\n\nHere’s what I think:\n\nWe’re watching a platform eat the ecosystem that made it powerful. Maybe this new way of interacting with the web is inevitable. But if search engines no longer send people to the web, the web we know won’t survive.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1051,
    "downs": 0,
    "created_utc": 1748323478.0,
    "media": null,
    "is_video": false,
    "num_comments": 154,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Assesses Google's AI Mode and its impact with analytical explanation.",
    "composite_score": 4.844681588902866
  },
  {
    "score": 407,
    "title": "What I have Learned From Spending Over $20M In Facebook Ad Spend Since 2018",
    "selftext": "Good day Redditors.\r  \n\r  \nI have written posts about how we approach advertising to drive success for our clients and our brands.\r  \n\r  \nThis post will be about a summary of learnings from spending over $20M in ad spend.\r  \n\r  \nI know it's not that much ad spend, there are people who manage this a month.\r  \n\r  \nTo be quite fair, 60% of the ad spending has come from this year.\r  \n\r  \nSo, let's start.\r  \n\r  \nI remember the early days of advertising in Meta. Back in 2018, literally anyone who had a somewhat decent product where able to generate sales.\r  \n\r  \nWhat was even more fun was that It was done with quite a few ads.\r  \n\r  \nThen all of the advertising was about \"hacking the ads manager\"\r  \n\r  \nTesting interests\r  \n\r  \nCreating lookalikes from followers, website visitors, purchases, email lists, etc.\r  \n\r  \nBack in 2018, we were able to scale a bike company brand from $20k a month to $240k a month in just 10 months.\r  \n\r  \nWe found one ad, and we tried to spend as much money as possible with that ad doing all sorts of \"hacking ads manager\" stuff.\r  \n\r  \nThis was the year when we decided to launch sales on Halloween and generated $100k in just a few days.\r  \n\r  \nOur black friday that year didn't even come close.\r  \n\r  \nFast forward to 2020.\r  \n\r  \nThis was still before IOS, I noticed that it was tough to replicate the scaling with just one ad.\r  \n\r  \nIn 2020 we started to test new ads every month, I remember this vividly.\r  \n\r  \nCreated 3 ads for that month that we wanted to test, and we hit two winners.\r  \n\r  \nOne video, one image.\r  \n\r  \nWow... So that became our benchmark, test 2 new ads every month and still do \"hacking the ads manager\" trying to push these ads via interests, lookalikes, and duplicating campaigns from abo to CBO, to CBO from abo.\r  \n\r  \nThat time literally, our team spent at least 2 hours per day in Facebook ads manager trying to figure out the newest targeting hacks by using stacking.\r  \n\r  \nWe played around with interests stacks and lookalikes stacks.\r  \n\r  \nEven combo stacks. We really thought that this is what generates the best results.\r  \n\r  \nThen....\r  \n\r  \nArmageddon happened.\r  \n\r  \nIOS 14 Mother\\*\\*\\*er.\r  \n\r  \nThis update wiped our performance across all accounts like no other.\r  \n\r  \nWe thought that this was the extinction of Facebook ads.\r  \n\r  \nEveryone was screaming Facebook ads are dead.\r  \n\r  \nClients were dropping us left and right.\r  \n\r  \nThen after a month of horrible performance and losing clients, we still had to pay our people.\r  \n\r  \nWe understand that \"Hacking Facebook ads manager\" days have come to an end.\r  \n\r  \nWe started to test fewer interests but still kept the lookalikes. :D\r  \n\r  \nThis was the time when we started to test more ads - 4 a month.\r  \n\r  \nYes, we doubled the testing.\r  \n\r  \nIt's actually funny to look back, thinking that testing 4 ads a month was actual testing.\r  \n\r  \nWe are at the end of 2021.\r  \n\r  \nTesting about 8 new ads every month for our brand and our clients.\r  \n\r  \nMainly using a stack of interests and a stack of lookalikes.\r  \n\r  \nNow it's January 2022, we signed this one client with the capacity to create ads and we were also building our in-house content department in order to scale creative testing.\r  \n\r  \nWe analyzed:\r  \n\r  \nFacebook and Instagram content - what type of content are we seeing daily?\r  \n\r  \nTurns out we were seeing content that we were interested in.\r  \n\r  \nFacebook and Instagram ads - again, most of the ads that were shown to us and that we reacted to were the stuff that we were interested in.\r  \n\r  \nInteresting...\r  \n\r  \nThis is still January 2022.\r  \n\r  \nWhat if we start researching customer psychology and customer behavior and just understand what type of content our target customer likes to see? ( I Have a post on how we approach research, so I won't describe this in detail in this post).\r  \n\r  \nLet's create ads that speak to our target customers by introducing awareness stages\r  \n\r  \nUnaware ads - ads that take an unaware audience to most aware audience.\r  \n\r  \nProblem-aware - ads that talk to people who know about their problem.\r  \n\r  \nSolution-aware ads - ads that target people who understand that they have a problem but don't know which solution to choose.\r  \n\r  \nProduct aware - ads that target people who understand their problem and also know how that is the way on how to solve their problem but don't know which brand/product to choose.\r  \n\r  \nMost aware - people who already know everything about their problem, how to solve it, what product to choose, they are just waiting for the right time to buy from you.\r  \n\r  \nSo how can we test the content?\r  \n\r  \nOne thing is creating the ads another is testing it.\r  \n\r  \nWe had this complicated ad account structure, one campaign ABO campaign to test audiences, and one CBO for scaling the best audiences with the best ads.\r  \n\r  \nWe aimed to create 20 ads.\r  \n\r  \nThere was no way we could test 20 ads and interests on the ABO level, this was like lighting money on fire.\r  \n\r  \nThen we decided to use:\r  \n\r  \nOne CBO campaign.\r  \n\r  \nUse best-performing interests and lookalike combo stack and one broad ad set ( no targeting)\r  \n\r  \nTo test how the ads messages work.\r  \n\r  \nWhy no targeting?\r  \n\r  \nWell, by doing content analysis, we were interested in testing the theory of is the algorithm capable of delivering our ads to the right customer without us doing the targeting side.\r  \n\r  \nWe launched 3 video ads that were talking about the customer problem and educating how this product will solve it.\r  \n\r  \nOn day one, we are getting sales with interest and the lookalike combo stack is winning.\r  \n\r  \nDay two combo stack still winning by a lot.\r  \n\r  \nOn day three, our broad ad set was picking up more and more sales.\r  \n\r  \nDay four, our broad ad set, took 80% of that day's spend, leaving the combo stack in the dust.\r  \n\r  \nDay 5, our combo stack dot us one sale.\r  \n\r  \nDay 6, we turned off our combo stack and started creating new broad ad sets with new ad tests.\r  \n\r  \nIt took off.\r  \n\r  \nWe immediately did this for all of our accounts.\r  \n\r  \nSame result.\r  \n\r  \nImagine spending 4 years \"hacking the ads manager\" and seeing that no targeting is producing better results for niche markets than targeting.\r  \n\r  \nThat was a real eye-opener on what Facebook ads algorithm can do.\r  \n\r  \nSince January 2022, we have been spending more and more time researching and developing the ads than the actual Facebook ad account.\r  \n\r  \nWe have measured that, on average, we spend up to 10 minutes a day optimizing the accounts, and 2-3 hours are spent on researching and analyzing the data to create a better ad.\r  \n\r  \nOne of our first steps is to test 50-100 ads in the first month to understand what messaging hits.\r  \n\r  \nBy doing this, we are able to find winning messages really fast.\r  \n\r  \nWhat previously took 6-12 months now can be done in 1-3 months\r  \n\r  \nTesting a lot of ad messages provides you with a lot of winners.\r  \n\r  \nThen creating at least 10 variations on winning ads, you can come down to 1-3 messages that spend 60-80% of your daily budget, which you can comfortably scale.\r  \n\r  \nToday.\r  \n\r  \nIf you say that ad testing does not work. You clearly haven't spent enough time researching and testing multiple ad variations.\r  \n\r  \nThe algorithm has become more and more content-oriented.\r  \n\r  \nThis is the reason we are not experiencing shit days with meta like most of brands and advertisers do.\r  \n\r  \nYes, we have a few a month, but it's nowhere near the amount that I read on this Reddit channel.\r  \n\r  \nSo, to sum up what it takes to generate good results with Facebook ads.\r  \n\r  \nDaily research 1-3 hours.\r  \n\r  \nDaily ad creation 1-2 hours.\r  \n\r  \nDaily ad optimization of 5-10 minutes.\r  \n\r  \nAds is the targeting.\r  \n\r  \nUnderstanding your customers is by far the most important thing in order to create ads that they will react to.\r  \n\r  \nContent is king - that's why it's important to input hours and hours into content creation.\r  \n\r  \nFacebook is not rewarding mediocre input anymore.\r  \n\r  \nTop brands are still scaling.\r  \n\r  \nYou can do this too.\r  \n\r  \nKeep in mind this is just about Facebook ads, I'm not talking about what happens after the click, your website, your business numbers, upsells, crossells, email flows.\r  \n\r  \nSometimes I like to think about Facebook ads as salespeople.\r  \n\r  \nWe know that big businesses have whole sales departments generating sales every minute.\r  \n\r  \nIf you only rely on one salesperson, it's going to get burnt our calling the phone 24/7.\r  \n\r  \nThe same thought process can be applied to meta.\r  \n\r  \nThe more salespeople you have out here calling the phone, and knocking on doors, the more sales you are going to get.\r  \n\r  \nFind the right salespeople.\r  \n\r  \nThanks for reading.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 407,
    "downs": 0,
    "created_utc": 1699762096.0,
    "media": null,
    "is_video": false,
    "num_comments": 157,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Shares lessons learned from large ad spend with narrative and takeaways.",
    "composite_score": 4.437488706567091
  },
  {
    "score": 375,
    "title": "I resigned on the very first day of my job as Content Writer",
    "selftext": "After countless tests, assignments and interviews, I landed on a role. I was told they’d be tracking our work with a software.\n\nI was ok with that. I started my job, in the afternoon, I got on a call with the HR. She said to me if my “idle time” as shown by the software is more than 15%, then that’ll become an issue. \n\nThe software starts counting the idle time as soon as there is no movement by the keyboard or mouse for 10 seconds.\n\nNow, I had no idea about that. Asking people to work for 8 hours and then expect them to move their mouse or keyboard 85% of the time is a very bad criteria to judge somebody’s productivity. I felt drained at the end of the day. \n\nWorking 8 hours on site is very different from working 8 hours in a remote setup. On-site you can move around, take a break for 10-15 minutes and it will be fine. But in a remote setup, you are supposed to be looking at your screen for 8 hours straight.\n\nTechniques like the Pomodoro method help employees stay focused without burning out, but in most remote jobs, such strategies aren’t even considered, let alone implemented.\n\nProductivity should be a measure of the tasks accomplished and not how much you can move your mouse. Stop treating remote employees like some machines.\n\nFelt like ranting. Sorry for the long post.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 375,
    "downs": 0,
    "created_utc": 1748584698.0,
    "media": null,
    "is_video": false,
    "num_comments": 140,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional vent about monitoring software and remote-work productivity.",
    "composite_score": 4.392297401255351
  },
  {
    "score": 253,
    "title": "I Left My 9–5 to Build My Own Digital Marketing Business, Here’s What I’ve Learned So Far",
    "selftext": "After 10+ years as a Senior Performance Marketing Manager, I made a decision that scared me and excited me at the same time — I walked away from my safe 9–5 to bet on myself.\n\nI spent years running ads that made other people millions, building automations to save teams time, and scaling strategies that turned small budgets into big results.  \nOne day I realized: I’ve been building other people’s dreams. Why not build mine?\n\nSo, I started **0aftermath dot com**. It’s just me — no big agency, no big promises — just the same work I’ve done for years:\n\n* Running paid ads that bring in real leads and sales\n* Automating processes with n8n, Zapier, Make\n* Using data, not guesses, to drive decisions that make a difference\n\nI’m not new to this work. I’m just new to doing it on my own terms.\n\nIn my first few months, the biggest lesson has been this: **Clarity beats everything**.  \nWhen you know what you’re good at — and what you’re not — you can keep things simple.  \nWhen you know what you want — freedom, impact, ownership — you’re okay taking risks that once felt impossible.\n\nI know a lot of folks here dream of going solo. Here’s my honest take so far:  \n**It’s worth it. It’s messy. It’s freeing. It’s terrifying. And I’d do it again.**\n\nIf anyone’s on the same path — let’s share notes.\n\nHere’s to more of us choosing to bet on ourselves. 🚀",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 253,
    "downs": 0,
    "created_utc": 1752586420.0,
    "media": null,
    "is_video": false,
    "num_comments": 221,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Shares personal journey and key lesson about clarity in building a business.",
    "composite_score": 4.260510203845257
  },
  {
    "score": 245,
    "title": "This is for you, Dad.",
    "selftext": "My dad was a mechanic. His hands were always stained with grease. He worked in a garage his whole life.\n\nHe never said it, but I knew he was disappointed I couldn't find a job after college. I spent most of my time in my old room, applying for jobs online. I felt useless.\n\nOne day, he came home with a secondhand laptop. It was heavy and slow.\nHe put it on my desk.\"Maybe you can learn something useful on this,\" he said. Then he went back to the garage.\n\nI started learning graphic design on that old laptop. It would overheat and the fan was loud. I watched free videos and practiced every night. I made terrible designs. But I kept going.\n\nAfter six months, I got my first freelance job. It was a logo for a small coffee shop. They paid me $150.\n\nI went to the garage to tell my dad. I showed him the design on my phone and the payment email. He wiped his hands on a rag and looked at it for a long time.\n\nHe didn't say \"well done\" or \"I'm proud of you.\" He just put his greasy hand on my shoulder and squeezed. Then he nodded and went back under a car.\n\nThat was all I needed. He passed away last year.\n\nI'm a full-time designer now. I have a fast computer. But I still have that old laptop. I keep it in my office. The fan doesn't work anymore, and the screen is dim.\n\nBut sometimes I just open it and look at it. It was the only thing he knew how to give me. It was his way of saying he believed I could find my way.\n\nI just wish he was here to see it.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 245,
    "downs": 0,
    "created_utc": 1761887561.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.7,
    "category_rationale": "Personal, heartfelt story with no instructional or analytical focus.",
    "composite_score": 4.058841903243775
  },
  {
    "score": 232,
    "title": "I reverse-engineered my competitor who ranks #1. Here's exactly what they did that I wasn't doing.",
    "selftext": "My competitor has been sitting at #1 for \"handmade silver jewelry\" (not the real keyword but similar volume) for 2 years. I've been stuck at position 8-12.\n\nI got obsessed and spent a week analyzing everything about their site. Here's what I found:\n\n**What I THOUGHT was making them rank:**\n\n* More backlinks (nope - I actually have more)\n* Longer content (nope - their pages are shorter)\n* Better technical SEO (nope - their site is actually slower)\n\n**What was ACTUALLY making them rank:**\n\n1. **Internal linking structure is insane** \\- Every product links to 3-4 related products and relevant blog posts. They have this web of connections I completely ignored.\n2. **User intent is perfect** \\- Their category pages show exactly what buyers want to see first - price ranges, style filters, real customer photos. Mine was just a grid of products.\n3. **They answer questions ON the product pages** \\- \"How to style this piece\", \"What occasions is this for\", \"Care instructions\" - all on the product page. I was sending people to separate blog posts.\n4. **Image optimization is next level** \\- Alt text that actually describes the product + keywords naturally. File names like \"silver-leaf-pendant-necklace.jpg\" not \"IMG\\_1234.jpg\" like mine.\n5. **The secret weapon: Customer photos** \\- They have a section on each product page with customer photos and reviews with keywords naturally embedded. Google LOVES this fresh, unique content.\n\n**What I changed immediately:**\n\n* Added 50+ internal links between related products\n* Rewrote product pages to include styling tips and care info\n* Renamed all image files descriptively\n* Started asking customers to submit photos\n\n**Results after 6 weeks:** Moved from position 10 to position 5 for my main keyword. Not #1 yet but I'm climbing.\n\n**The lesson:** Rankings aren't always about the obvious stuff. Sometimes it's the small UX and content decisions that make the difference.\n\nWhat's something unexpected you found when analyzing competitors?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 232,
    "downs": 0,
    "created_utc": 1765425962.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.74,
    "category_rationale": "Describes a reproducible SEO ranking method with concrete changes.",
    "composite_score": 3.9474539610402757
  },
  {
    "score": 212,
    "title": "After 15 years of experience, here are my favorite marketing tools.",
    "selftext": "**MODS - I DO NOT WORK AT ANY OF THESE COMPANIES. THIS IS A HELPFUL POST - NOT PROMOTIONAL**\n\nI run a digital marketing agency and have worked in b2b marketing for 15 years. I've been an individual contributor, Director, VP, and now a CEO. Throughout my career, I've used pretty much every saas tool you can think of. I just started using reddit for business, so I figured I'd put together a list of my favorites with the hope it helps you at some point. My gift as a newbie.  \n\n\n**Hubspot**: You can't beat the best. Hands down the best marketing automation platform and overall \"source of information\" for any marketing team. I've used Pardot, Marketo, and Act On and Hubspot is by far the best. It's a big expense, so I recommend teams that just need email marketing to go to the next tool on my list.  \n\n\n**Apollo.io:** Combine Zoominfo with Salesloft and you have Apollo. I think it's still $99/month for unlimited email credits from the contact database. It's a great email marketing tool. Has all the functionality of other sales engagement tools at a fraction of the price.  \n\n\n**Gong.io:** I know Gong is mostly a sales tool but I've used it for voice of customer research. As good as I think I am writing copy, nothing is better than taking the words right out of the customer's mouth. Much of my best content and highest-performing landing pages all started with a Gong recording.  \n\n\n**Winware.ai**: Winware is my new favorite for on-site lead capture. I've used modals, newsletter signups, and demo forms to generate leads from my content and never got above a 1% conversion rate. Winware offers visitors an incentive for providing feedback on a blog post but requires them to provide their business email address first. It's the best lead hook on my website.  \n\n\n**Session Rewind**: Think HotJar but better. I use Session Rewind to watch videos of people on my landing page. You can tell I like to have a solid mix of quant and qual data. Google Analytics can't tell me exactly what people do on my site.  \n\n\n**BigMarker**: I just started using this one for webinars and I've been really impressed. It's expensive. Way more than GotoWebinar or Zoom Webinars but I like that it's a dedicated tool and not part of a suite of products.  \n\n\n**Unsplash**: Best and cheapest stock image library I've found. I signed up for a premium account for $50/year I think and use it every time I need stock images for ads and landing pages.  \n\n\n**ChatGPT 4**: Obvious one, but seriously, if you aren't using ChatGPT 4 - NOT GPT 3 - you're behind the curve. Half of the marketers I know are using this to write all their content now. It's not perfect by any stretch but it's a must use in any marketer's toolkit. AI is going to take our jobs sooner than later anyway. Might as well lean into it.  \n\n\n**ClickUp**: My favorite project management tool. It's so much better than Monday.com. I run my entire company through ClickUp and I'm still on the free plan. Great integrations and so easy to use. I was a Monday user for a long time but the switch was worth it.  \n\n\n**Ahrefs**: I know there's a Semrush v Ahrefs debate but I'm firmly on the side of Ahrefs. It's the best tool I've used for SEO. Gives me all the information I need on my site and competitors. I have an entire SEO toolkit that I'll save for another time, but Ahrefs is a great start.  \n\n\nI tried to mix in some known and lesser-known tools in there. Hopefully, it can help some of my fellow marketers.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 212,
    "downs": 0,
    "created_utc": 1707767467.0,
    "media": null,
    "is_video": false,
    "num_comments": 148,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.8,
    "category_rationale": "List of favorite marketing tools presented as discrete items.",
    "composite_score": 4.157472737644874
  },
  {
    "score": 212,
    "title": "16 years of SEO advice in 2 minutes:",
    "selftext": "\n1. SEO always evolves, and so should you. The second you stop learning, you fall behind.\n\n2. Traffic without conversions is a vanity metric. Focus on revenue, not clicks. Money &gt; pageviews.\n\n3. The real money in SEO isn’t made by following the rules. It’s by testing what breaks them.\n\n4. Don’t blindly follow Google’s guidelines. Instead, reverse-engineer what’s already ranking.\n\n5. Most advice online is GuesSEO. Sounds smart, but doesn’t work. Test everything yourself.\n\n6. Everyone’s got AI tools now. The edge comes from knowing what to write, not just how to write.\n\n7. SEO is just the vehicle. The real skill you’re building is entrepreneurship.\n\n8. Most SEOs burn out doing $15/hour tasks. Delegate and focus on the $150/hour work that moves the needle.\n\n9. Partnerships are cheat codes. Find someone who’s strong where you’re weak. 1 + 1 = 3.\n\n10. A players hire A players. B players hire C players. Your team is only as strong as who you let in the door.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 212,
    "downs": 0,
    "created_utc": 1753160343.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Numeric list of SEO tips presented as discrete entries.",
    "composite_score": 3.9875410334989656
  },
  {
    "score": 194,
    "title": "Everything is ai written in 2024 and its giving me the ick",
    "selftext": "I read Blogs and realise they're ai written and start cringing.\n\nI see email marketing subject lines in my inbox and see They're blatantly ai.\n\nI post a job on upwork, all the responses are ai written. I even write no ai responses in the job post and they still f***ing do it.\n\nThe moment I realise a company is using ai to write stuff I just get the ick and they lose all credibility to me and I go elsewhere. \n\nIt just screams lazy, unprofessional, can't even write a few simple human words, low quality work the only word I can use to describe it is \"ew\"\n\nI'm not against ai but people need to start improving their prompts so their writing sounds human. ",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 194,
    "downs": 0,
    "created_utc": 1713470082.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional critique of AI-written content and credibility in writing with no actionable steps.",
    "composite_score": 3.986776085639485
  },
  {
    "score": 192,
    "title": "My manager brought in a \"Digital Marketing Expert\"—and it got... interesting",
    "selftext": "So, yesterday my manager brought in someone they called a \"digital marketing expert\" to evaluate the work I’ve been doing. He made a bunch of recommendations, and I’ll just share a couple of the highlights:\n\n\n\n1. **Meta ad names should be SEO-optimized** — Right now, we name our Meta (Facebook/Instagram) ads starting with our service, followed by the date, objective, etc. He suggested they should be \"SEO-optimized.\" 🤔\n\n\n\n2. **Confused Meta with meta descriptions** — He used some SEO tool and said we needed to update the \"meta descriptions\" for our Facebook and Instagram accounts. Yeah, he thought the \"meta\" in meta descriptions was referring to Meta (as in Facebook/Instagram). 🙃\n\n\n\nThere were several more suggestions that left me scratching my head, but if I listed them all, this post would get way too long.\n\n\n\nWhat do you all think? Have you encountered this kind of advice before?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 192,
    "downs": 0,
    "created_utc": 1726981998.0,
    "media": null,
    "is_video": false,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Discusses a manager's advice with analysis and insight rather than a step-by-step guide.",
    "composite_score": 4.09647910298016
  },
  {
    "score": 187,
    "title": "Facebook stopped caring about your targeting two years ago and nobody told you",
    "selftext": "I've been running ads for brands doing 100K to 300K per day and the thing that blows my mind is how many people are still out here selecting interests like it's 2019.\n\nFacebook hasn't updated their interest database in forever. All those detailed targeting options you think are precise? Half those audiences are dead engagement. People who liked a page six years ago and never opened Facebook again. And Facebook has been quietly removing targeting options for months now because they know it doesn't work anymore.\n\nThe shift everyone missed is this: Facebook went all in on AI. Their whole pitch now is \"trust the pixel, let us find your people.\" That's why Advantage Shopping campaigns exist. It's not some optional feature to test, it's the entire direction of the platform.\n\n**Here's what actually works now.**\n\nYou consolidate. Instead of running 10 campaigns with fragmented data, you run 2 or 3 and feed the pixel way more information per campaign. Broad targeting, just age and gender, and let the algorithm do the rest.\n\nI know what you're thinking. \"I tried broad and it sucked.\" Yeah, because your creative sucked.\n\nWhen you remove interest targeting, your ad has to do all the work. If your hook is generic, if your angle could apply to anyone, the algorithm has no idea who to show it to. But if your ad says \"just got out of the shower and your knee is throbbing from that tennis match last week\"—that level of specific—Facebook knows exactly who that person is.\n\n**The marketing fundamental nobody teaches.**\n\nEugene Schwartz had this framework called the Five Stages of Awareness. It goes from Unaware (don't know they have a problem) to Most Aware (know your product, just need the offer). Most people making ads have no idea where their customer sits on that spectrum.\n\nA problem aware ad looks like: \"Do you have back pain? Most Americans suffer from it and never address it until it becomes chronic.\" You're calling out the pain, agitating it, then presenting the solution.\n\nA solution aware ad is more direct: \"Hate doing dishes? Get these gloves.\" They already know the problem and want the fix.\n\nProduct aware is comparison mode: \"Other humidifiers do this wrong, ours fixed it.\" You're positioning against known alternatives.\n\nIf you can't articulate which stage you're targeting, your messaging will be confused. And confused ads don't convert, no matter how much budget you throw at them.\n\n**The research nobody wants to do.**\n\nGo to Amazon. Find similar products. Use a tool like Shulex to analyze reviews. Look at what people actually complain about. \"Poor suction\" shows up 50 times? Cool, now your ad says \"superior suction, sticks anywhere.\"\n\nGo to YouTube and TikTok. Watch videos in your niche. Read the comments. Someone says \"do you have to clean this thing constantly?\" Great, now you have an angle: \"Tired of cleaning your humidifier twice a week? Ours takes 30 seconds.\"\n\nWhen you understand your customer better than they understand themselves, you don't need interest targeting. The ad finds them because it speaks directly to their brain.\n\nMost people lose because they're copying big brands. If you copy a McDonald's style ad for your unknown burger joint, why would anyone choose you over McDonald's? You're not established. You need to leverage what makes you different, not what makes you similar.\n\nThe boring truth is this: research equals money. You can't hack your way around knowing your customer. Write down your learnings, track what works, iterate on winners. Test three variations of every concept so you're not wasting money on a single bad hook.\n\nIf your ads feel like they're talking to everyone, they're talking to nobody. Get specific, go broad on targeting, and let Facebook's AI do what it's actually good at now.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 187,
    "downs": 0,
    "created_utc": 1764210742.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Offers actionable ad-strategy guidance and a concrete approach to targeting and optimization.",
    "composite_score": 3.862942937312648
  },
  {
    "score": 177,
    "title": "My $7million Digital Marketing System Strategy",
    "selftext": "This strategy generated $7million in revenue for my clients and will probably work for you too..\n\nGonna try and keep this short and informative as much as possible\n\nI did a digital marketing project for a small medium enterprise that had a small online presence. So my job was to increase the amount of online leads they get.\n\nFirst thing i did apart from creating a social media strategy and fixing their website funnels was starting a blog for them. \n\nBasically this was a competitive industry that had very few thought leaders with authority online. I scanned the content online of competitors and realized how i can do things different. Because there was not enough thought leaders with authority, it left the end consumer uneducated about the industry.\n\nSo what i did was i built a very strong client avatar and identified the key pain points of the end consumer. I then created a content strategy (series of blog topics) that solve this problem for the consumer with information education\n\nI probably published around 10 articles each around 1000-2000 words by also looking at seo key word trends what people were searching for.\n\nOut of those 10 one of them really took off. It turned out that topic was the biggest pain point for customers and what they had been searching for online. And the article i wrote was seriously comprehensive step by step guide on how services in this industry work. I left nothing for thought, and didnt care about how long it would be because i knew the target client would value this. Article ended up around 2700 words. \n\nBecause no one in the industry wanted to reveal how their internal systems work (ie keep customer in the dark and charge what they want) we were the only people who had revealed this info it became the top search result on google rank for those specific keywords \n\nWhat made this quicker was i took the article and posted it on social media and then ran ads to that piece of content. This brought tones of traffic and increased our google rank credibility\n\nWe started getting 1000s of organic traffic every month from google alone, let alone traffic from paid ads\n\nIn the end of the article i just added a call to action related to the topic (ie find out more by speaking with our consultants)\n\nThat call to action link led to a lead capture form that gave them something in return like a quote\nThen from the quote they qualify the lead on a consultation call and close the deal\n\nThis translated to 1000s of leads and 100s of customers and millions of closed contracts over the course of few years. Each year the revenue doubled and its still bringing leads till today\n\nI just keep advertising it on social and change the creative video or post but they still lead to the same article\n\nFeel free to ask me anything!",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 177,
    "downs": 0,
    "created_utc": 1698770190.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Case-study style description of a successful strategy with reasoning, not a strict steps-only guide.",
    "composite_score": 3.9646318800523686
  },
  {
    "score": 179,
    "title": "Don’t be afraid to automate your workflow",
    "selftext": "I see alot of people being afraid to automate and not willing to give out work to some tools. I wonder why. I wanna \nshare a personal story that might be useful if you’re looking to streamline your workflow and boost your income.\n\nA while back, I was spending too much time on repetitive tasks instead of focusing on the creative and strategic aspects of my work. For context, I for my side job I create gmail accounts on demand. I began experimenting with a few automation tools to cut down on the busywork. One of the tools I stumbled upon—even though it was just one piece of the puzzle—helped streamline some account management tasks. It wasn’t a flashy, all-in-one solution, but it fit perfectly into my broader strategy of reclaiming time.\n\nI went from working 6 hours per day on my side job to 3-3,5 hrs per day just by using some automation. I found that the extra time allowed me to focus more on business growth. \nThe result? A steady, if modest, boost to my monthly revenue that really validated the approach. I’m still not making ‘steady’ job money (last month $693) but for now it’s a very nice side income.\n\nAre you using automation tools? Which? And if don’t, why not?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 179,
    "downs": 0,
    "created_utc": 1741889912.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Personal story advocating automation and its outcomes with reasoning and implications.",
    "composite_score": 3.7841514209440934
  },
  {
    "score": 176,
    "title": "5 steps to get cited in ChatGPT (AI visibility)",
    "selftext": "I'm an SEO consultant who's been obsessing over why some content gets cited in ChatGPT/Perplexity and some doesn't. Since november 2024 I’ve been manually tracking this stuff and built a framework that works pretty consistently.\n\nTested it across 200+ pages. The patterns are honestly super clear once you see them.\n\nFirst thing I check: stat density. Pages need like 3-5 statistics per 1000 words minimum. Took one article that was getting cited maybe 2 out of 10 times. Added 6 stats throughout, didn't change anything else. Now it gets cited 8/10 times.\n\nNot just \"email marketing is effective\" but like \"B2B email open rates average 21.5%, Tuesday sends perform 18% better\" … that kind of specific stuff.\n\nLLMs seem to really prioritize quantifiable info. Pages with 5+ stats get cited like 3x more in my testing.\n\nSecond thing: quote ready sentences. Your key insights gotta be able to stand alone. Bad version: \"The challenge with AI optimization is that it requires understanding how context affects processing.\" Good version: \"Context is the biggest challenge in AI optimization.\"\n\nChatGPT literally lifts standalone sentences word for word. If you bury your insights in these long complex paragraphs they're basically invisible to LLMs.\n\nPages with 5+ sentences that work as standalone quotes get cited way more .. like 3.2x from what I've tracked.\n\nThird: recency signals. So this one surprised me but content from the last few months gets cited noticeably more than older stuff even when the older content ranks better. Newer embeddings often reflect updated context, and LLMs seem to weight freshness heavier than Google does\n\nI started refreshing our top content quarterly and it made a real difference. An okay article from 2 months ago can actually beat a better article from 2 years ago just on recency alone.\n\nFourth: author credentials. Not just \"By John Smith\" but like \"By John Smith, 12 years in B2B SaaS marketing, worked with 50+ companies\" … that specific.\n\nAdded proper author bios to 15 articles and citation rate went from like 28% to 43% over 4 weeks. LLMs cite credentialed authors way more for queries that mention expertise (like \"how do SEO experts approach X\" type questions).\n\nFifth: schema markup. But only the stuff that actually works:\n\n-HowTo schema - gets you cited like 1.7x more for instructional queries\n\n-FAQ schema - works well\n\n-Speakable schema - literally zero impact, don't waste your time\n\nReal example from last month:\n\nClient's onboarding guide before:\n\n-No stats at all\n\n-Super long paragraphs\n\n-18 months old\n\n-Author listed as \"Marketing Team\"\n\n-No schema\n\n-Result: 0/10 queries cited\n\nAfter fixes:\n\n-Added 7 relevant stats\n\n-Broke key points into standalone sentences\n\n-Refreshed everything to 2025\n\n-Added credentialed author with background\n\n-Implemented HowTo schema\n\n-Result: 7/10 queries cited\n\nTook me like 3 hours total to fix. Measured results over 4 weeks.\n\nOverall results across 200+ pages I've audited:\n\n-Before framework: 12% average citation rate\n\n-After framework: 47% average citation rate\n\n-Pages hitting all 5 criteria: 83% citation rate\n\n-Overall improvement: +292%\n\nwhich sounds made up but that's what the data showed lol\n\nTracking this stuff was honestly annoying. When I started doing this, literally no tools had good AI visibility features. So I was just manually searching 50 queries in ChatGPT every week and logging everything in a spreadsheet.\n\nEventually Semrush added their GEO tracking feature (part of AI Visibility toolkit) and it was the first major tool to actually do this properly.\n\nI still manually checked results for like the first month to make sure the data was reliable and honestly Semrush was both faster and more accurate than what I was seeing when I spot checked Ahrefs later. Saves me probably 5-6 hours a week now.\n\nBut yeah if you're just starting, validate this manually with your top 10-20 queries first. Proves the concept before spending money on tools.\n\nIf you wanna try this.. Pick your top 3 pages by traffic. Run through the 5 checks. Fix whatever's missing. Track it for a month and see.\n\n13% of Google queries already trigger AI Overviews now (was like 6% early last year). Gartner's out here predicting 50% organic traffic decline by 2028. So yeah this stuff isn't really optional anymore.\n\nLet me know what you find.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 176,
    "downs": 0,
    "created_utc": 1765355504.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Explicit 5-step process to improve AI/SEO visibility for content.",
    "composite_score": 3.86601066771222
  },
  {
    "score": 176,
    "title": "7 thing I’ve learned in the last year from consulting with over 50 companies on their ads",
    "selftext": "1. Conversion tracking issues are everywhere. Most companies can’t seem to get this right without expert help. \n2. There is a huge need for GA4 &amp; GTM experts right now. \n3. Many blame their ads for issues in the business. Ads are pretty easy to get right, but getting your business right to afford running ads is very difficult. \n4. The Ad -&gt; Landing Page -&gt; sales call funnel is very difficult and expensive to make work. \n5. Don’t let google or a google rep run your ads. Ever. Still. \n6. If you need the ads to be profitable in the next 90 days or you’re going out of business, don’t run them.\n7. It does seem like people are tighter with their money right now than 1-2 years ago. ",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 176,
    "downs": 0,
    "created_utc": 1729190646.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Seven enumerated lessons learned from consulting on ads.",
    "composite_score": 3.7971996046049004
  },
  {
    "score": 166,
    "title": "What are the best free marketing courses for 2025?",
    "selftext": "I've curated a list of 100% free marketing courses. From SEO and content marketing to social media strategies, these courses will help you build the skills needed to get started with digital marketing in 2025.\n\n**Any other good courses missing from the list?**\n\n**#General Marketing Courses**\n\n1. Digital Marketing Course For Beginners (Reliablesoft)\n\n2. Fundamentals of Digital Marketing (Google)\n\n3. Digital Marketing Associate (Meta)\n\n4. Google Analytics Certification (Google)\n\n**#SEO Courses**\n\n5. Free SEO Course for Beginners (Reliablesoft)\n\n6. The One-Hour Guide to SEO (Moz)\n\n7. Free SEO training: SEO for Beginners (Yoast)\n\n8. SEO Course For Beginners (Ahrefs)\n\n**#PPC Marketing Courses**\n\n9. Google Ads Certification (Google)\n\n10. PPC Fundamentals Certification (Semrush)\n\n**#Affiliate Marketing Courses**\n\n11. Free Affiliate Marketing Course for Beginners (Reliablesoft)\n\n12. Affiliate Marketing Course (Udemy)\n\n13. Affiliate Marketing Course (Ahrefs)\n\n**#Social Media Marketing Courses**\n\n14. Social Media Mastery (Canva)\n\n15. Diploma in Social Media Strategy (Alison)\n\n16. How To Build Your Social Media Marketing Strategy (Udemy)\n\n**#Content Marketing Courses**\n\n17. Content Marketing Certification Course (Hubspot)\n\n18. Advanced Content Marketing with Brian Dean (Semrush)\n\n**#Email Marketing Courses**\n\n19. Connect Through Email (Google)\n\n20. Email Marketing Masterclass for Beginners (WishPond)",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 166,
    "downs": 0,
    "created_utc": 1738072370.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Curated list of free marketing courses, organized by category.",
    "composite_score": 3.854292096339405
  },
  {
    "score": 162,
    "title": "As someone who hires digital marketing roles...",
    "selftext": "The quality of your resume matters. I am the director of digital marketing, marketing analytics, and marketing operations for a mid-size company. I hire a hand-full of people every year and go through literally thousands of resumes per position. Our positions are fully remote and potential candidates can be anywhere in the US or Canada so we received a lot of applicants. The current digital marketing manager role I am hiring pays up to $155K and I have received 2172 resumes for the position. Of those, I have moved 13 candidates through to my hiring manager for an initial phone interview.\n\nFor context, for those familiar with it, we use Greenhouse as our HR platform. I open and look at every single resume that comes through. I can tell in about 10 seconds if someone is a hard pass for me. It doesn't mean that they might not be qualified, it just means the resume is so underwhelming that I am moving on to the next one. \n\nI understand this is my personal perspective and others will vary. That said, here is what I am looking for:\n\n* Your resume needs to stand out! I am hiring for marketing positions. If you cannot market yourself, how can I trust you managing a $5m budget?\n* If you are not good at building a resume, go to Etsy and pay $20 for a well designed resume that is aesthetically pleasing and is formatted in a way that you can highlight your experience.\n* I know not everyone agrees but use (some) color in your resume. When I am going through 30 resumes and I am getting hit with all black text only brick of text resumes one after another, they rarely catch my eye. Even better, match the color scheme (or color) to include the company's color pallet. It's a subconscious trick that will resonate with people who review a lot of resumes.\n* Keep it under 2 pages. I don't care how much experience you have, I am only looking at your last couple of positions as my focus.\n* Do not highlight your freelance experience as the focus of your resume. Since I am hiring a fully remote role, I will be concerned that you are going to be working two gigs if your resume focus is freelance work. You can include it, but don't make that a focus of your work history.\n* Absolutely list all of the platforms and tools that you have experience with. I always look at those when they are listed. If you list Google Ads, Meta Ads, Bing Ads, Marketo, Salesforce, Tableau, SEMRush, and other platforms that we use, I am going to give your resume more attention.\n* Do the small things. If I am hiring for a digital marketing manager position, indicate that you are looking for a digital marketing manager role. Don't say you are a \"digital expert\" or that you are seeking a \"senior digital role\". I want someone who identifies as seeking the role for which I am hiring.\n* If you include a cover letter, make sure it is personalized for the company and written specifically to communicate why this particular role is interesting to you and why our company seems like a good fit for you. If you are sending generic cover letters, you might as well not send it.\n* Imbed a link to your LinkedIn profile. Imbed a link to your portfolio if you have one. It's a small thing but I am more likely to look at them if I don't have to copy and paste links into my browser.\n* Lastly, for the love of all that is holy, do not write your resume or cover letter in third person. I will immediately think you are a narcissistic lunatic and hit the reject button without reading another word.\n\nHopefully this is helpful for someone. I go through a lot of resumes and most of of them are bad. If you are sending out dozens (or hundreds) of resumes and not getting any hits, change your resume. It can be as simple as downloading a resume from Etsy and sending something out with a little character. Market yourself. Happy hunting!",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 162,
    "downs": 0,
    "created_utc": 1738089733.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Resume-focused tips presented as a numbered set of recommendations.",
    "composite_score": 3.8425944005443533
  },
  {
    "score": 163,
    "title": "small truths i’ve learned running an agency.",
    "selftext": "been running an agency for a while now, long enough to realize a few things the hard way:\n\n* clients don’t pay for your hours, they pay for your reliability.\n* 6 hours booked basically means your whole day’s gone. charge accordingly.\n* “urgent” should never mean “same rate.”\n* good clients are quiet. bad clients are loud and late.\n* burnout hits harder when you own the deadlines.\n\nsome of this you only learn after losing weekends, sleep, and a few great people.\n\nbut i guess that’s the tuition for agency life.\n\nwhat’s one small truth you’ve learned the hard way?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 163,
    "downs": 0,
    "created_utc": 1761666360.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Five to seven small truths learned from running an agency presented as bullet points.",
    "composite_score": 3.823937861550798
  },
  {
    "score": 151,
    "title": "How We Organically Scaled an Ecommerce Jewelry Brand To Give $180,000 ROI Within 8 Months",
    "selftext": "Hello Redditors! I wanted to share with you guys another amazing organic growth success story. I really like sharing our organic growth achievements because I often see business owners and digital marketers getting very demotivated from all the high competition negativity in the market so I hope this post will be informative and motivating for a lot of  you who are facing the same situation.\n\n**The Client:** Jewelry Ecommerce Brand \n\n**Revenue Split Between SEO and Social Media:** 9:1\n\n**Average Order Value:** $3000\n\n**Total Revenue(6 months):** $330,000\n\n**Expenses(6 months):** Product Cost + Delivery cost + Team + Agency Fees + Packaging + Additional Costs: $150,000\n\n**Basic Business Background:**\n\nThis case study is about a family owned jewelry business that has been running for the past 15 years. Initially it was just a physical jewelry store that was being run by a middle aged couple who designed their own jewelry. The store was doing fine before covid but since past 3-4 years their sales started plummeting. Someone suggested to them that they should start selling products online under their brand name. So they contacted a local agency who developed their website and they worked on SEO and were running ads for them.\n\nAfter a few months when they did not get any results whatsoever with SEO and below average results with Ads, one of their relatives, for whom we were doing lead generation for their real estate business, referred the couple to us. The couple asked us to keep the spendings to a minimum because they had spent a lot on ads and previous agency fees. So we did some research and assured them that we can get them results by just organic marketing and later we can start running ads from the revenue that they generate from this if they like. Since they also have a physical store so we suggested optimizing their Google My Business Profile as well but they wanted us to focus on the website specifically and develop this as an ecommerce brand.\n\n**SEO Strategy** \n\nFor the initial months we started with just SEO and we weren’t really considering social media as a huge option. There are several categories when it comes to jewelry, so basically they had a huge website with several categories and subcategories like earrings, necklaces, rings, engagement rings, etc. So, it was crucial to do proper research and identify which category holds the best potential since our primary aim was to recover the owner’s previous losses and strengthen their budget. \n\nAlthough this is a very competitive business, after researching each and every category and sub category, we found that engagement rings can be a really good starting point. We generated a traffic of around 18k and 1.5 million impressions in the first 8 months on the website. Some keywords in this category had a really low KD with decent traffic and other keywords had KD’s on a slightly higher side but the volume was really good. So overall it is a really balanced category to start with for SEO.\n\nOnce we decided on the category, we audited the website for technical issues and if the website has a proper structure. For a successful SEO project, a proper website structure, good UI/UX and high quality content are extremely important pillars. \n\nAfter our technical audit, we found that several pages were missing H1 headings, several subcategories that had really good potential did not have separate pages and some spammy backlinks were made in the past 2-3 months. There were other technical issues as well but these were the major ones. So first of all our developer optimized the website properly.\n\nWe started with one sub category page at a time under the engagement rings category. Initially we targeted sub categories with lowest KD. We optimized urls for the collection pages, added content to the pages with proper keyword integration, optimized titles and meta descriptions.\n\nFor writing good and properly structured on page content, always research the top 5 ranking websites for your primary keyword. This will give you an idea about the keyword density, content structure and content length. You can also make UI/UX changes after looking at these websites. \n\nYour aim should be to post more informative content as compared to the websites that are already ranking on the top. \n\nWe optimized 6-8 collection pages per month and were posting around 4 blogs per month. We kept the number of blogs low as we felt there is enough potential in ranking for commercial keywords itself which can get us more conversion as compared to blogs. \n\nAlthough initially we thought that we might be making some paid backlinks once the business starts generating some revenue, but till now we have just stuck to making unpaid ones because we are getting good results for low KD keywords without making this extra investment. \n\nThis is a very important tip that I have included in my previous posts as well. Many people feel that since the starting of their SEO project, they need to make paid backlinks. The most important part is to do proper research, if your KD is low, your UI/UX is good and your content is well structured, you can easily rank with unpaid backlinks as well. Overall good SEO results depend on following a well planned strategy and doing deep research. So the above method might not work if you are going for a high competition keyword, but in that case you need to form a different strategy and things will work out.’\n\nFor making no follow unpaid backlinks, we use forums and websites like vocal media, medium, pinterest, postimages, scribd, pdfslide, etc. Apart from this, we set up dummy blogs on websites like wordpress, wix, tumblr, blogger, etc and posting content on these dummy blogs gives us do-follow backlinks. We also make search consoles for these websites, so most of our backlinks get indexed as well. We have used several more websites as well, but the purpose of mentioning this method in detail is that new marketers and business owners can save a lot of money in the beginning of their projects by using this.\n\n**Social Media**\n\nInitially we were not considering social media as an option, but three months later when they started generating revenue organically from SEO, we proposed some ideas that can be tested over the social media to them. Since we were working on engagement rings primarily on SEO for now, we decided to prepare our initial social media strategy around that only. \n\nBefore someone starts social media marketing, it is very important to understand the basic psychology of your potential customers or people in general who might come across your product in their feeds. People on social media either want entertainment or they want to feel some sort of personal connection with others, they want to know about others, this is the basic mindset of the majority of the population who spends time on these platforms. If you try to go against this mindset of your potential customers, it can be beneficial or even very beneficial but in the short term. But as the competition is increasing more and more, survival over social media for brands that are just promoting their products will become very hard. \n\nUsually in our social media projects we try to create a brand around the owners instead of promoting just a company. Because people can easily establish connections with other people and that is the whole purpose of social media. When it comes to jewelry and especially engagement rings, this niche can be somewhat related to couples. Considering all these factors we decided that our middle aged clients can be really good faces for the brand over social media. \n\nWe posted content around four content pillars over social media:\n\n**1) Emotional Connect**: This was a very innovative idea which I believe no jewelry brand is doing as of now on a regular basis. Usually the owners have consultation sessions with the person who wants to buy a consultation ring. So we know their entire story, like how they first met, what sort of relationship they had and based on that plus their budget our clients recommend rings to their customers. What we did is, once a sale was made, both husband and wife(our clients) would record a reel where they would describe the story of their customers and based on which ring they recommended and in the end, or in the middle of the reel, we used to display the ring as well. Our clients definitely used to ask for permission from their customers before making a reel. These types of posts were the best performing ones for us. In our social media calendar, these posts had 50% weightage.\n\n2) **Entertainment:** Even if you are getting good results, but still posting just one type of content can make you profile look less professional and also it is very important to keep experimenting. So under this type, we decided to post asmr reels of the jewelry designing process. This also worked well for us. These posts had 25% weightage in our calendar.\n\n \n\n3) **Informative:** It is very important to establish yourself as an expert in your niche. Because this establishes you as an authority in your niche and increases trust. Under this pillar, one of the owners used to make slightly technical informative reels about a jewelry that they might have recently designed. We tried to keep the content very easy to understand so it was amusing for many people. These posts had 15% weightage in our calendar.\n\n4) **Promotional:** If you are posting quality content regularly, your audience won’t mind some rare promotional posts. If the timing and offer is good, these posts can help in revenue generation as well. We used to promote our offers, new designs and best selling products through these posts. These posts had 10% weightage in our calendar.\n\nWe always try to maintain a mix of four content pillars in our social media content strategy. This gives good room for experimenting and also provides a good variety of content for the followers. The content pillars can vary depending on the business.\n\nSocial media accounted for just 10% of our total revenue but considering that we invested only 3 months on this, we feel there is huge potential in social media as well apart from SEO and in future, social media can at least account for 20-25% of our revenue. Also social media plays a huge role in brand building so we will get more direct searches on google and conversions from there as well.\n\n**The Road Ahead**\n\nWe were working with this client till April, but they discontinued the project for 2 months due to some of their personal reasons. But we have again started working on the project since July 1st week. Some of their SEO traffic went down in this time, so since we have re-started the project we have invested our time in regaining the previous amount of visitors. They were posting social media reels regularly as they made several reels in advance. Now the SEO rankings are almost back on track so we can focus on working towards new categories.\n\n \n\nWe haven’t started our ads campaigns yet and are not planning to start anytime soon because considering SEO, whatever results we have achieved till now are just from some sub categories in engagement rings. So there are some sub categories still left in engagement rings and apart from this, all the other categories are still left to explore.   The clients are really happy with the progress as their profits are much more than they used to make from their shop even before covid and still around 70-80% of the keywords are left to optimize which shows that we can achieve even more amazing results just from SEO. \n\n\n\nThankyou For Reading!",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 151,
    "downs": 0,
    "created_utc": 1722252097.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Case study with ROI-focused growth insights rather than a step-by-step guide.",
    "composite_score": 3.8139594478102605
  },
  {
    "score": 137,
    "title": "Rant: We don't need more agencies",
    "selftext": "I've seen a lot of posts on this subreddit from people who are new to the industry stating they want to start their own digital marketing agency.\n\nI'm begging you to please not do this if you have no experience in the field. \n\nThere is not a week that goes by that I don't speak with a new business prospect who has not been burned by a fly-by-night digital marketing agency.\n\nUltimately it ends up severely tainting the water for everyone else who knows what they are doing. \n\nMy advice is to work for someone reputable who knows what they're doing first and if you decide to go off on your own have a standard and more important MRR that won't require burning so many small businesses to pay the rent. \n\n/rant",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 137,
    "downs": 0,
    "created_utc": 1709061746.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Emotional critique about agencies with a warning stance.",
    "composite_score": 3.722428106408365
  },
  {
    "score": 135,
    "title": "What’s the most underrated skill in digital marketing right now?",
    "selftext": "We all love talking about SEO, paid ads, AI tools, and content hacks — but what’s that one quiet little skill that actually makes a big difference?\n\nFor me, it’s writing a solid brief ✍️. The kind that doesn’t make your designer cry or your writer ask 14 follow-up questions. A good brief is like GPS for your campaigns 🗺️.\n\nSo what’s your pick? What underrated skill deserves more love (and maybe its own holiday)? 😄",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 135,
    "downs": 0,
    "created_utc": 1750159327.0,
    "media": null,
    "is_video": false,
    "num_comments": 193,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Promotes a concept about underrated skills and why briefs matter as guidance.",
    "composite_score": 3.97493977333533
  },
  {
    "score": 130,
    "title": "I've been seeing a lot of digital marketing positions lately where you execute everything. Is this not insane?",
    "selftext": "Everything from strategy to SEO, blogs, social media, PPC/SEM, Affiliate/Influencer Marketing, Email Marketing/SMS, UX/Website.\n\nAm I crazy? I've been in marketing (not specifically just digital marketing) for almost a decade. This seems insane to me that one person would even be able to strategize and execute all of this successfully without an internal team or external agency. Key word successfully. Sure it can be done but with what return. Every company I've worked for had agencies running at least 1 (but usually more) of the above and the rest can be in house.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 130,
    "downs": 0,
    "created_utc": 1741398662.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Expresses disbelief about full-stack execution expectations and questions practicality.",
    "composite_score": 3.7823203156628926
  },
  {
    "score": 130,
    "title": "Does anyone else in marketing feel like a total fraud?",
    "selftext": "I’ve been a marketing manager for over a decade now. On paper, I should feel confident, plenty of campaigns under my belt, no bad performance reviews, nothing but positive feedback from my bosses.\n\nBut here’s the thing: I’m a generalist, not a deep specialist in any one area. I know a bit about everything, SEO, paid ads, content, social, email, branding, but I don’t feel like a true expert in any of them. Most days it feels like I’m making it up as I go along.\n\nI suffer pretty badly with imposter syndrome. My brain is constantly whispering that I’m going to get found out, that my “luck” will run out, and I’ll be exposed as someone who doesn’t really know what they’re doing. I even find myself panicking about getting fired, even though there’s no evidence that’s on the horizon.\n\nIt’s exhausting.\n\nDoes anyone else feel like this in marketing, or in any career where things are always changing and you have to wear multiple hats? How do you quiet that voice in your head and actually feel like you deserve the role you’re in?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 130,
    "downs": 0,
    "created_utc": 1755206197.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Personal account of imposter syndrome and emotional struggle.",
    "composite_score": 3.710272967473164
  },
  {
    "score": 131,
    "title": "$3,800 spent on FB ads for Dental Clinic — Here’s What Actually Worked",
    "selftext": "Hey guys, recently been working with a dental clinic from Zurich, helping them with Fb lead form ads, content marketing and CRM automation.\n\nHere's what worked, what didn’t, and why these tips might just save you some headaches and get $ fast if you work in similar niches.\n\n**Ads stats:**\n\n* Leads Generated: 166\n* Ad Spend: 3,500 CHF (\\~$3,800)\n* CPL: 21 CHF ($23) well below the $50–$285 industry average.\n* Projected Revenue: $39,000 - $59,000 (based on deal values)\n\n**What Worked Best:**\n\n**1. Reactivate Clinic Database First**  \nWe started by emailing and texting old leads of the clinic (that were considered dead 💀)\n\n* Out of 1k prospects, within 2 weeks, **15 appointments** were booked.\n\n**2. Respond to Leads in Under 5 Minutes**  \nAutomatic email and SMS to notify staff the second a lead form was submitted, and initiate a bridge call so the lead got contacted instantly. (if out of biz hours - the lead gets an email and contacted next day)'\n\n* **30-40%** more bookings\n\n**3. No Stock Content**  \nI have a video/photographer so we have shot real photos and videos of the clinic’s staff and space. Authenticity boosted trust and:\n\n* CTR improved **by 29%**.\n\n**4. Decrease No-Shows**  \nNo-shows were a big issue for this clinic, so we automated **3 reminders** for every appointment:\n\n1. 24 hours before\n2. The morning of the appointment\n3. 1 hour before\n\n* We got **30% fewer** no-shows by the end of the month.\n\n**5. Highlight Your USP**  \nThe clinic’s USP was Premium Veneers product (very few clinics in Switzerland have them) and the best price for \"All on 4\" procedures. We plastered that everywhere: ad copy, visuals, landing page, social media.\n\n* Engagement rates jumped.\n* Conversion rates **tripled** compared to generic messaging.\n\n**6. Automate Follow-Ups**  \nLeads need multiple nudges to book. We set up a CRM with **5 automated follow-ups** (I'd suggest even more) via SMS and email, ensuring no one fell through the cracks.\n\n* **35% of leads converted to appointments** (58 out of 166)\n\nFollow-ups aren’t optional. Leads forget, get busy, or lose interest—remind them.\n\nWould love to hear your thoughts! What’s worked for you when running lead gen campaigns? Happy to discuss.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 131,
    "downs": 0,
    "created_utc": 1736478204.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.93,
    "category_rationale": "Provides a reproducible sequence of actions and concrete steps that led to results.",
    "composite_score": 3.6882552759529723
  },
  {
    "score": 134,
    "title": "So you want to be your own boss and own a digital marketing agency... ",
    "selftext": "I've owned my own business for 12 years now. I started off doing freelance social media work and snowballed my way up to running a digital marketing agency that also offers Facebook, Instagram, and Google Ads.\n\n**Here's what I love about being my own boss:**\n\n1. Once I finish my daily work, which usually runs from 6:30 am to 10:30 am, my day belongs to me.\n\n2. Every day, I face the possibility of getting a $100k/year raise.\n\n3. I can comfortably provide for my family, and I get to spend time with my son every single day. Rarely does my work interfere with my time with him.\n\n4. I can work from anywhere and never have to commute. I used to live in LA and spent an average of 90 minutes a day in the car, and I hated every single second of it.\n\n5. I don't have to answer to anyone. I work with my clients, not for them. Going into meetings with this mentality has actually helped me land more deals.\n\n**Potential downsides of being your own boss:**\n\n1. You are 100% responsible for funding your and possibly your family's existence, if you have one.\n\n2. Healthcare costs. If you're like me, you're 100% responsible for your family's healthcare, and this currently costs me $3k/month.\n\n3. Every day, I face the possibility of losing a large client and taking a massive pay cut in my yearly salary. This can and will happen to nearly every entrepreneur. Those who make it may feel sorry for themselves for a few days, but they ultimately come back stronger and better than ever before.\n\n4. It's always up to you to be accountable for your time, and there's no one else responsible for motivating you and making sure you're staying on track.\n\nOver this time, I have worked with countless freelancers who, like me, have wanted to make it working from home and doing their own thing. One thing I have noticed over the years is that most act like employees and set boundaries as if they're working 9-5. I'm not saying you can't do this, but if you don't treat your clients like they're priorities, you're going to have a really hard time out here.\n\nOne thing I consistently hear from my clients is that they love how quickly I get back to them and how quickly I implement any changes they need. I feel like my sense of urgency has a lot to do with why my business has continued to grow year after year.\n\nIf you can have a sense of urgency, strong communication skills, and work your ass off, you will probably make it. I know this because most of your competition is setting boundaries with their time, and before they know it, their clients will get sick of the slow response times and lack of urgency, and they'll come to agencies like mine. We will have a much easier time keeping them by simply acting like we care.\n\nI hope this helps whoever takes the time to read. Good luck out there, fellow digital marketers.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 134,
    "downs": 0,
    "created_utc": 1718828957.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Reflective piece about entrepreneurship and being one’s own boss with insights.",
    "composite_score": 3.766995198555234
  },
  {
    "score": 129,
    "title": "Noticing a trend: marketing roles expecting full-stack execution from one person",
    "selftext": "Lately, I've been noticing more posts — and job descriptions — where brands or agencies expect a single marketer to handle *everything*.\n\nClient strategy, SEO, blogging, social media management, PPC/media buying, affiliate and influencer marketing, email/SMS campaigns, even UX and A/B testing. Hell, some of these guys even want you to create their product photos for them.\n\nAfter almost a decade in marketing, it’s clear to me that while it’s *possible* for one person to manage all of these areas at a basic level, it’s not realistic to expect high performance across the board without team or agency support.\n\nMost companies I’ve worked with understood that — they used agencies for at least one or two channels and kept others in-house.\n\nIt’s interesting to see how often \"Marketing Manager\" or \"Marketing Director\" roles now expect full-stack marketing execution. It raises real questions about long-term ROI, scalability, and employee burnout.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 129,
    "downs": 0,
    "created_utc": 1745669628.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Analytical take on hiring trends in marketing and implications for teams.",
    "composite_score": 3.6970639709946305
  },
  {
    "score": 129,
    "title": "What’s one underrated tactic in digital marketing that gave you outsized results?",
    "selftext": "Everyone talks about the big stuff: SEO, paid ads, funnels, content, etc. But sometimes it’s the small, overlooked things that make a big difference.\n\nFor example, I once saw a local business double their call volume just by optimizing their Google Business Profile categories and FAQ section. No ad spend, no fancy tools, just clarity and relevance.\n\nCurious what underrated tactics, tools, or platforms you’ve used that delivered surprising results. Especially interested in things that work in specific niches or with low budgets.\n\nLet’s build a list of marketing “hidden gems” that actually move the needle.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 129,
    "downs": 0,
    "created_utc": 1744645807.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Asks for underrated tactics and shares a concrete local example as a prompt for ideas.",
    "composite_score": 3.763613627033628
  },
  {
    "score": 128,
    "title": "6 Hard Truths About Digital Marketing You Must Know Today",
    "selftext": "Digital marketing is not easy. Here are six hard truths no one tells you:\n\n\\- Likes don’t mean sales. Followers are great, but engagement matters more.\n\n\\- SEO is a long game. No overnight success, only consistent effort.\n\n\\- Paid ads need strategy. Throwing money at ads won’t fix a bad offer.\n\n\\- Content is king, but distribution is queen. Even great content needs visibility.\n\n\\- Trends come and go. Fundamentals matter more than hype.\n\n\\- Not every platform is for you. Focus where your audience is, not everywhere.\n\nMarketing takes patience. But when done right, the rewards are huge.\n\nWhich of these truths hit more to you? Let me know in the comments!\n\n",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 128,
    "downs": 0,
    "created_utc": 1743152155.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.95,
    "category_rationale": "Six clearly enumerated hard truths about digital marketing.",
    "composite_score": 3.716844166652367
  },
  {
    "score": 125,
    "title": "What’s working in digital marketing right now?",
    "selftext": "Hey everyone!\n\nIt’s no secret that digital marketing has seen some big shifts lately, and what worked six months ago might not be as effective today. Let’s help each other out. What strategies are bringing you the best results right now? For instance:\n\nAre short-form videos still crushing it for you?  \nIs email marketing making a comeback?  \nHow are you using AI in content creation or automation?  \nWhat’s been the best ROI channel for you so far this year?\n\nWhether you’re a business owner, agency pro, or just experimenting, drop your insights!",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 125,
    "downs": 0,
    "created_utc": 1741284043.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests current marketing strategies and tips; not a structured list or steps.",
    "composite_score": 3.7532773412579585
  },
  {
    "score": 125,
    "title": "Here’s an updated list of websites every marketer should know (+ most of them are free)",
    "selftext": "\n\n1. Futurpedia - It’s an AI tools library constantly updated to help you find all tools and resources powered with AI. \n2. PrepostSEO - It’s a free SEO website with 95 tools to help with SEO &amp; content creation. \n3. Accessible Social - It’s a free Social Media Library to help entrepreneurs with basic social media marketing + to make content accessible for users with special needs. \n4. Github Library- By user “bradtravesy” on github, He created a free github library filled with all the resources needed for web design + social media content. \n5. Really Good Emails - It’s a curated library for email marketing examples &amp; to spy on your competitors campaignz \n6. Tiktok Ads Academy- Don’t buy a Tiktok course, you can join their official program for new businesses. \n7. Monday - It’s one of the most used tool by teams to work together. Pretty effective!\n8. Attentive “Text we love” - It’s a curated library to find SMS marketing examples. \n9. Gated - It’s a tool to help you prevent your email from spam and you can filter your emails better. \n10. Notifier (so) - It’s a social monitoring tool that alerts you about specific keywords you want to track on social media. \n11. Built with - To find the tools a website is using to run itself. \n12. Cloud Convert - A Tool to turn your website images into webp format for faster speed. \n13. Harvard Business Review - To get better Consumer behaviour &amp; Updated Insights on Markets.\n\n**You can join r/marketingcurated for more marketing resources.**",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 125,
    "downs": 0,
    "created_utc": 1674835278.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.95,
    "category_rationale": "Explicitly lists many marketing websites/tools in a numbered list.",
    "composite_score": 3.4234161746454035
  },
  {
    "score": 123,
    "title": "How to Efficiently Handle Social Media Content Across Multiple Platforms",
    "selftext": "Hello, community!\n\nI'm just getting started with social media management and quickly realized how tedious it is to manually edit and post the same content on Instagram, Facebook, X, LinkedIn, TikTok, YouTube, and Pinterest. Each platform requires its own format and approach. Please share what tools or services you use to automate the publishing process and save time. I would really appreciate any recommendations!",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1762388482.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.6,
    "category_rationale": "Seeks a reproducible cross-platform publishing workflow and automation tools.",
    "composite_score": 3.6651480234053286
  },
  {
    "score": 123,
    "title": "What happened in Digital Marketing &amp; Social Media last week? (A lot)",
    "selftext": "# Top 6 Updates of the Week:\n\n* TikTok Ban is getting real, US House to vote next week on crackdown bill.\n* Reddit announces new social and data toolkit for businesses, Reddit Pro.\n* Google launches privacy-focused measurement tool for marketers.\n* LinkedIn launches tools to assist in internal career progression.\n* X launches long-form articles for all premium subscribers.\n* FB, IG &amp; Threads experienced global outages on Super Tuesday, Youtube &amp; LinkedIn also experienced outages for a while.\n\n# Trending\n\n* Sam Altman says AI will handle 95% of marketing work done by agencies and creatives, do you believe the same?\n* Pinterest launches new 2024 Wedding Trends Report.\n* Telegram launches option to convert personal accounts into business, with new subscription model.\n* Anthropic launches new Claude AI-3 models: Opus, Sonnet and Haiku.\n* PETA’s nostalgic and jolly Cartoon Ad is trending but comments don’t believe it works to reach the Ad goal.\n* McDonald’s Finland creates a Mockumentary trolling Website hamburgers are actually BigMac.\n* Outsmart, US’s leading OOH Firm responds to a new report sharing roadside OOH ads are concentrated in areas with lower disposable income in England and Wales.\n* ITV’s linear ad revenue declined by 15% in 2023 due to rise in digital revenue.\n* The Ad Campaign for “The Gas Leaks Project”, parodies the shows like “Love is Blind” &amp; “Love Island” to remind consumers of Natural Gas dangers.\n* Pepsi Max officially launches its new brand identity in UK.\n* ICO considers “consent &amp; pay” cookie compliance proposal.\n\n# TikTok 🎶\n\n* TikTok expands monetization opportunities and rewards for Creators, pushing new resources too.\n* TikTok Shop listings are surfacing on Google Shopping feed.\n* TikTok launches new data portability API to comply with EU’s Digital Markets Act.\n* TikTok goes fully into Oscars vibe with #FilmTok.\n* TikTok’s new guide to reaching women on the platform with effective messaging.\n* TikTok prompts the users in United States, to call the Congress and oppose the potential ban.\n* TikTok testing new posting prompts that show up when you comment.\n\n# Instagram &amp; Threads 🗂️\n\n* Instagram launches new and imporved Direct messaging features.\n* Threads save a draft and Take a photo within app features are out now for all users.\n* IG launches a hidden game in DMs for you to play when bored.\n* Instagram testing auto-slide feature for Carousel content in the reels tab.\n* IG prompting users to create more collaboration posts.\n* Instagram events feature will be going away on March 19, 2024.\n\n# Meta 😅\n\n* Meta Engineering team highlights their changes to introduce messaging interoperability with third parties in EU.\n* Meta now offers verified subscribers to make links more engaging with images.\n* Meta provides new Tech transformations in 2024 &amp; beyond.\n* WhatsApp is testing addition of ‘Communities’ to Business App.\n* New research shows that Temu paid Meta about $2 billion in 2023 for Ads.\n* WhatsApp testing a new end-to-end encryption indicator for chats.\n* WhatsApp users to soon get greater control over Avatars.\n\n# X (Twitter) 🕹️\n\n* X experimenting with new feed UI, removing all engagement metrics.\n* X working on AI-generated content labels.\n* X’s video and voice calling features are revealing user’s IP address to each other.\n* X working on providing more advanced analytics.\n* X’s plan to launch a Youtube TV clone for Samsung &amp; Amazon Smart TVs.\n* X now allows users to hide their creator subscriptions.\n\n# Youtube 🕹️\n\n* Youtube and Comscore expand their data partnership to add YT shorts measurement.\n* Popular Science recruits Vsauce2 creators to relaunch its YT channel.\n* Youtube interview MrBeast’s Thumbnail creator on their creator insider channel.\n\n# Google 🔦\n\n* Google March Core Update is here: 4 changes to link signal.\n* Google updates search quality evaluator guidelines.\n* Google Ads Country-Level Exclusions Limited To 120 Countries.\n* Google March 2024 Spam update is also rolling out, alongside the core update.\n* Google issues search ranking penalties through manual actions.\n* Google complies with Digital Services Act, announcing new changes.\n* Google is updating Local services Ads verification progress.\n* GSC recipe rich result report adds two new properties.\n* Google now redirects Business profile websites to Google Maps.\n* Google Search People Cards going away on April 7.\n\n# Agency News\n\n* Spotify awards its global media account to a dedicated Publicis media unit, Onevibe.\n* Monkey Shoulder hires Special London as global creative agency.\n* Firehouse Subs launches creative agency review.\n* BBC Studios selects\n* as creative partner for debut US brand campaign.\n* Amp unifies Five Specialized agencies into one integrated company.\n* Uncommon Experience Studio wins Marshmallow Car Insurance (UK) account and launches first campaign.\n* Spirit of Tasmania appoints CHEP Network as new creative agency.\n* Havas Group achieves 4.4% growth for Financial Year 2023.\n* Museum of Pop Culture appoints Iris as Activation-Engagement Agency.\n* Shark Ninja appoints Horizon Next as Media AOR.\n* TBWA\\\\Chiat\\\\Day NY appoints Emily Wilcox as new CEO.\n* Independent Agencies Barkley and OKRP merge to form BarkleyOKRP.\n* Gut is launching a design practice, to show their guts in a new service.\n* Credit One Bank names Deutsch LA AOR.\n\n# Brands &amp; Ads 🏓\n\nMy Fav; Molson’s International Women’s Day  brand campaign is the best brand decision and marketing play gaining praise of everyone.\n\n* Dove and Drew Barrymore confront issues of girls getting influenced by anti-aging online content.\n* Peachaus unveils new brand campaign, building on Women’s confidence.\n* SiriusXM launches first national campaign after brand refresh, it’s about dance &amp; culture.\n* In Japan, Apple brings 80’s Manga classic to reality using iPhone.\n* Barnardco’s latest film visualises the idea of “kids living in their shell” for their charity program.\n* For Guinness’s new campaign, Jason Momoa screams “I’m Irish” and he plans to do that this whole year.\n* This Manscape Ad Campaign is for the boys and men too, but there is a difference.\n* Old Navy counts on brand nostalgia in their first TV campaign of 2024.\n* Adobe and Women’s FA Cup look to future generations.\n* South Western Railways turns insults into an Anti-abuse Ad campaign.\n* LEGO’s new Ad Campaign asks little girls to ditch perfect.\n* GambleAware’s Smoke-filled Billboard tackles gambling stigma.\n* Domino’s new Ad campaign is short and focused on comfort food and delivery trust.\n* Heinz launches World’s first ever Ketchup Insurance policy.\n* Sweaty Betty rebrands ditching their boutique branding for a bold modern look.\n* StreetEasy Campaign turns the story of buying an House in NYC into an Epic Odyssey.\n\n# AI 🤨\n\n* OpenAI responds to Elon Musk with all receipts needed.\n* Cloudflare announces firewall for AI.\n* IAS expands “Made for Advertising” AI-driven measurement and optimisation solution.\n* Salesforce Spring 2024 Release includes Einstein AI updates.\n* DiGiorno’s launch new AI microsite that offers you discounts by scanning pizza delivery damages.\n* Sam Altman rejoins the OpenAI board.\n\n# Pinterest &amp; Reddit\n\n* Pinterest shares new guide to inclusive content for marketers.\n* Reddit rolling out new AI tools to stop on-platform harassment.\n\n# Microsoft &amp; LinkedIn\n\n* Microsoft Advertising Performance Max globally available now.\n* Microsoft relaunches deep-search after the initial launch failure.\n* Microsoft Ads launch new tools to make cross-border advertising easier.\n* LinkedIn’s latest report shares most In-demand jobs on the platform.\n* LinkedIn now allows you to filter “who viewed your profile” results by Interesting viewers filter.\n* LinkedIn’s plan to start focusing again on news content and knowledge sharing.\n\n# Marketing &amp; AdTech\n\n* Linktree partners with Sephora, Urban Outfitters and more to jump into social commerce.\n* Sainsbury’s allows advertisers to create ‘branded shops’ online.\n* New Congressional Bill would set minimum royalty payment at 1 cent per stream.\n* Reckitt turns to livestreaming to sell condoms in China.\n* STV’s Pitts named as new Global group CEO.\n* Bloom appoints new executive leadership team.\n* Disney sells out Oscar’s Ad Inventory, the early sales show new brands are here.\n* Whirlpool helps singles clean up their dating profiles after finding, 91% of open singles prioritise someone that is able to do basic household chores.\n* ASA changes the style of ban on Calvin Klein’s FKA Twigs Ad + bans a new BBH Ad Spot.\n* Target to launch a paid membership program to compete with Amazon &amp; Walmart.\n* Roblox expands advertising options for brands with launch of new site.\n* KPMG fined over M&amp;C Saatchi audit failings.\n* Corona appoints Pedro Pascal the lead brand ambassador.\n* Accenture acquires The Lumery, An Australian MarTech Consultancy.\n\n**I hope this helps you to plan your week ahead, you can find sources for all headlines by searching or in the social juice newsletter.**",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1710251009.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "A curated roundup of weekly marketing and social media updates in list form.",
    "composite_score": 3.4410579377138877
  },
  {
    "score": 122,
    "title": "We’ve tested over 50 different ad hooks in the last month. Here’s 7 of the top performers we’ve seen across accounts",
    "selftext": "Hook #1: Here’s my secret to my (routine)   \n\nEven though this has been overused a lot it’s a hook that’s constantly provided the educational route for our current clients and has had the highest hook rate out of all videos.\n\n&amp;#x200B;\n\nHook #2: How I got (ideal solution or outcome) in (time frame)   \n\nMentioning a solution and a time frame sets the expectation immediately of what you should expect when using that product.\n\n&amp;#x200B;\n\nHook #3: I tested (number) (niche) techniques on (tool/idea) and this 1 is the best.  T\n\nhis has to be our best performing hook when it comes to working with B2B clients.\n\n&amp;#x200B;\n\nHook #4: Ok here's a story that I love. \n\nHere's how (brand) was able to (ideal goal) with only (Relatable Current Struggle / limitation)!  \n\nGreat intro into talking about a founder story which can bring more interest behind the brand.\n\n&amp;#x200B;\n\nHook #5: Shopping for (products) are so overwhelming for me..  \n\nProvide the audience with the problem followed by the solution.\n\n&amp;#x200B;\n\nHook #6: A lot of you guys know that few years ago I didn’t have (desired outcome), I recently discovered (brand)..  \n\nA combination of using this hook with whitelisting has worked wonders for us. \n\nBuilds further credibility when the creator has faced an issue your brand solved.\n\n&amp;#x200B;\n\nHook #7: I'm a (professional / authority) and I tried 20 different (tool / ideas) (problem they have) so you don't have to! Here’s my favourite (tool/idea)   \n\nAnother great B2B hook to show the audience. Talk about your service or tool in a scenario like this.\n\n&amp;#x200B;\n\nThat's a wrap! Would love to know what ad hooks are working for others!",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 122,
    "downs": 0,
    "created_utc": 1679365259.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Presents seven top‑performing ad hooks as a list with explanations.",
    "composite_score": 3.3456014540185106
  },
  {
    "score": 120,
    "title": "Does anyone else work in digital marketing or social media feel a little strange these days?",
    "selftext": "I have a few years of experience in digital marketing, primarily in content strategy and social media management. Additionally, I've been having this weird feeling lately that the work is beginning to feel meaningless.\n\nWeekly tasks include producing more content, chasing the algorithm, posting at \"optimal times,\" monitoring engagement rates that hardly change, and staying \"on trend\" while attempting to be genuine at the same time. I've seen results, and I'm good at it. However, I've also been feeling increasingly cut off from the reasons behind everything.\n\nIt’s hard to know what’s real anymore. Even the content that *works* often feels manufactured. And when I try to do something different, the numbers drop and stakeholders panic.\n\nI guess I’m just wondering… is anyone else in digital marketing feeling this? Like you’re doing all the right things, but it’s starting to feel repetitive, or like it’s missing heart? If you’ve found ways to bring meaning or energy back into this work, I’d love to hear how.\n\nThese days, it's difficult to tell what is real. Even effective content frequently comes across as fake. Additionally, stakeholders become alarmed and the numbers decline whenever I attempt to do something different.\n\nI suppose I'm just curious if anyone else in the field of digital marketing is experiencing this. Like you're doing everything correctly, but it's becoming monotonous, or like something's lacking? I'd be interested in knowing how you've managed to infuse this work with meaning or vitality.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1753164507.0,
    "media": null,
    "is_video": false,
    "num_comments": 89,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Emotional vent about meaninglessness and burnout in digital marketing.",
    "composite_score": 3.809906625036113
  },
  {
    "score": 120,
    "title": "How do you generate B2B leads without paid ads?",
    "selftext": "Hi folks. I've been trying to sell a B2B SaaS tool for a couple years mainly through:\n\n1. Writing how-to posts for their blog.\n2. Creating PDF templates for their templates page.\n3. Optimizing their website copy, like landing and product pages and case studies. \n\nTheir sales have been dropping for the past several months and they're not happy. \n\nI've consistently recommended paid ads but they don't have the budget/interest. \n\nCould anyone please share their best inbound methods that work? \n\nThanks very much for your time :) ",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1740736199.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.58,
    "category_rationale": "Asks for inbound methods to generate B2B leads; seeks actionable steps.",
    "composite_score": 3.7685307329026907
  },
  {
    "score": 112,
    "title": "Took a roofing startup from $0 to $2.2M revenue in 18 months. Here is how I did it and why I made less than a McDonald’s cashier.",
    "selftext": "I started a full-funnel marketing agency. When I met my roofing client, it was two guys who wanted to quit their job and start their own company. They had no name, no website, nothing.  \n18 months later they hit $2.2M, with $600k profit. Meanwhile, I made less than a part-time fast-food worker.  \nHere’s what worked, and why I’m rethinking agency.\n\nI basically built a turnkey marketing department. I handle the entire lead flow + all things digital, they handle the sales and the roofs.\n\nI'm responsible for:\n\n1. Branding, Website, Landing Pages, tracking stack (calls, forms, automations)\n2. Google Ads + Meta Ads strategy, ad creatives and management\n3. CRM setup, management, automations, monitoring and training staff to use it.\n4. Full funnel analytics (Pixel, GA4, GTM, GSC) + automated setup of offline events data to Meta/Google\n5. Google Business Profile + Reputation Management + fundamental SEO setup/Link building\n6. Social media management with multiple weekly posts across FB/IG/TikTok\n7. Logo, Branding, Leaflets.\n8. I handled the first few months of the inbound lead calls, before I convinced them to hire a call center.\n\n# Outcome (18 months):\n\n**Revenue:** $0 → **$2.2 million**\n\n* **2024 (Apr–Dec):** 189 estimates - $5,124,998; 44 jobs sold = **$828k rev / $211k profit**\n* **2025 (Jan–Sep):** 404 estimates - $14,857,432; 91 jobs sold = **$1.38M rev / $317k profit**\n\n**Profit margin:** 30%  \n**Avg job:** $14–15k  \n**Close rate:** \\~22%  \n**Marketing cost:**\n\n* 2024 ad spend $30,684 + my fee $8,500 = **$39,185 total**\n* 2025 ad spend $61,871 + my fee $36,000 = **$97,871 total**\n\n**ROI:**\n\n* 2024: every $1 in marketing → **$21.1 in revenue; $6.3 in profit**\n* 2025: every $1 in marketing → **$14.1 in revenue; $4.2 in profit**\n* Marketing fees in 2025 = ad spend is 4.5% of rev + my fee came out to 2.6% of rev = **7.1% of total revenue**.\n\n**CAC/LTV** = 3.91:1  \n**Unconverted estimate value:** $13.48M in 2025 (90.7% of quoted) vs $4.3M in 2024 (83.8%).\n\n# What I did, step-by-step:\n\n**#1) High intent first - Google Ads.**\n\nThey had very limited budget to spend at first, so I focused on the people who are already searching for someone to come help them fix their roof - guaranteed high intent, bottom-of-funnel traffic = Google Search Ads. The average price per click here is \\~$60 , very pricy and hard to compete.\n\nI built out a website and dozens of landing pages to target the exact searches people were making and added dynamic text data based on searches and location like \"\\[search term\\] service in \\[location\\]\". I optimized the pages continuously by A/B testing. I tracked all interactions on landing pages, watched back every visitors session and consulted the heatmaps of common scroll/click areas. Basically, i did all i could to maximize the google ads click to conversion %. Important to note, that I originally went into agency space as a web dev/web designer and have solid background in making high conversion websites.\n\n*In the end, i got the landing* *page conversion rate to \\~21%*\n\n**#2) Fix response gap**\n\nOnce a lead comes in, its incredibly important that we are responsive. *All phone calls need to be answered, all form fills need to be called back in less than 5 minutes.*\n\nProblem = roofers/home service guys are notoriously bad at pickup up phones. They’re on roofs, driving, or quoting. But if a call isn’t answered, they don't convert and then my client sees that as a “bad lead”, which in turn looks bad on me.\n\nSo at first, I took on the role of picking up the phone calls. After five months I convinced them to sign up for a call center service. Better than nothing, but still very weak. There is no incentive for call center reps, I'm convinced that if my client just hired an in-house CSR / sales admin, our overall close rates would skyrocket and the wages would pay themselves off.\n\n**#3) Feed the algorithm**\n\nNow that we were getting lots of \"conversion\" data from landing page forms or calls - it was my priority to keep feeding the Google ads machine learning algo with more data about how these conversions are actually doing.\n\nI coached client on CRM pipelines and keeping estimates/invoice data attached to leads. I then created automations to feed all the data about qualified/disqualified leads, $ value of estimates sold/unsold, etc.\n\nThis is makes the Google ads/Meta ads targeting a lot smarter AND gave us fully transparent analytics, reporting exactly what's working and where we have leaks that need patching.\n\n**#4) Add Meta for scale**\n\nBy this point we were first for our service areas in Google Ads auction insights and because its a very specialized niche of roofing, there is simply not enough search volume and our budget outgrew what Google was willing to spend. Google local service ads were also useless, as it classifies you as a \"roofing contractor\", but 95% of those leads are not applicable for this client.\n\nWe were capped on lead volume of the high intent, bottom of the funnel traffic that Google ads brings and to increase lead flow I went on to expand to a colder audience with Meta Ads. to increase lead flow, I went to Meta Ads.\n\nHere, my strategy is much simpler - reverse engineer what works. I watched over 1200 roofing video ads. I know this number because i took notes on each one, noting the hooks, specific sentences i liked, notes on the script, visual elements, different angles/approaches, etc. I built a whole library of ideas and have been testing creatives based off that, occasionally going back to the Meta ad library and watching some more. Because we introduced Meta ads around the same time that we introduced social media posts, there was plenty of already prepared footage from the job sites for me to use.\n\nThis year, Meta ads has been the main source of leads. The quality is considerably worse (95% qualified -&gt; 50% qualified), Because we still don't have an in-house CSR, the time to call back new leads is way longer than it should be, so this artificially brings down the % of qualified meta leads. Although the price per lead currently comes out to be worse, the average ticket is equally good.\n\n**#5) Build Trust and Authority**\n\nThroughout this whole time, I was doing two other things to increase the trust and authority in the eyes of potential prospects. Hunting for Google reviews from our sold jobs &amp; getting the client to film content on job sites for social media / meta ads.\n\nI built in automations for simple review gathering from sold jobs. Every added review is massive for local reputation. If a someone is considering spending thousands of dollars for a huge job, you best believe they are gonna be searching you and your competitors up, yet many other companies don't even any form of online presence so we simply appear more trust worthy and reputable by staying on top of it.\n\nWith the filming of content - the primary usecase is for Meta ads, which are the actual money generating bit. And although we do not get direct jobs from social media posts (yet), I think it has a great impact for long term brand building &amp; adding trust when leads research us further before making a decisions. Simply by posting videos from active job sites for 9 months, we got a total of 10k subscribers &amp; 14.2m views across FB/TikTok/IG, all of which shows up very obviously when looking at branded keyword searches of the company.\n\nAll these systems now produce steady inbound calls, track every quote, and feed back performance to ads.\n\n# Future Growth\n\nCurrent bottleneck is the sales conversion, as you saw earlier from the \"Unconverted estimate value\" - only 9.3% of estimate value converts. The fastest profit lever for the client is in lifting the estimate win rate on higher ticket jobs. Our overall close rate of 22% is highly propped up by small residential repair jobs, meanwhile, there is a big loss on the higher ticker commercial jobs.\n\nThis is outside of what I can currently help with, so I pushed for an experienced roofing sales consultant to train the team and Client agreed. I want that playbook so future clients get even more from me, a full sales process that converts high-ticket work.\n\nI want to further systematize the sales journey: same-hour follow-up, better roof report/estimate process for the client, maintenance agreements for commercial job retention, etc.\n\nHowever, before I go any further with this, i had to stop and ask myself\n\n# Was it even worth it?\n\nThe company sold $2.2M of work in 18 months, and pocketed around $518k of profit.\n\nMy total take across that time = **$16.5k in 2024 + $36k in 2025 = $52.5k total revenue, about $25.5k profit for all of my labor hours put into this**.\n\nThat’s **2.3% of total revenue** for building and managing the entire lead engine, creatives, systems, data. Basically full control over their marketing engine and measurable ROI.\n\nLooking at it strictly as an agency owner, **I basically built a multi-million-dollar business acquisition channel for a client, for about the same profit as working part-time at McDonald’s.** Now I have to decide whether that was a smart long-term play or bad pricing.\n\n# So here's my question\n\nWas this the right move?\n\nOn paper, it’s a great case study:\n\n* $0 → $2.2M in 18 months\n* 14× return on ad spend\n* $4.2 of pure profit for every $1 spent on marketing/fees\n* Every lead source and dollar tracked to the cent\n\nBut in practice, I spent hundreds of hours building and running everything and cleared \\~$25k profit. Below the poverty line where I live.\n\nThis is only “worth it” if I can turn it into a repeatable offer for other roofing companies.  \nThat’s where I’m stuck.\n\nHow do you even sell something like this? Content ads into a VSL funnel targeted at roofers?\n\n* Do I pitch it as a **full-funnel service** (ads, CRM, analytics, etc.)?\n* Do I go **flat retainer, % of ad spend, % of revenue, or profit share?**\n* When do you move from “cheap case study” to proper pricing?\n* Would you have front-loaded this much work for the long game?\n\nWould love perspective from other agency owners or general business owners.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 112,
    "downs": 0,
    "created_utc": 1759859530.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Shares a detailed case study with what worked and lessons learned.",
    "composite_score": 3.620759788230542
  },
  {
    "score": 115,
    "title": "Need urgent SEO advice – My job is at risk",
    "selftext": "Hi everyone,\nI’m just starting out in SEO and I really need your advice. I recently joined a digital marketing agency as a fresher, and my manager has given me a blogging website to handle. The problem is, the site has 0 traffic, 2 authority, 700 backlinks – everything is from scratch.\n\nMy manager told me that if I can’t show some results within 30 days, I might get terminated. I know SEO usually takes time, but I need to show at least some visible progress (Google Search Console impressions, clicks, keyword rankings, traffic, anything).\n\nI’m a beginner, but I’m ready to learn and put in all the work. If needed, I can even share the website link so you can check and guide me better.\n\nWhat’s the best step-by-step approach for the first 30 days to get some quick wins?\n\t•\tOn-page optimizations?\n\t•\tContent strategy?\n\t•\tTechnical SEO basics?\n\t•\tAny safe off-page tactics for fast results?\n\nPlease, I don’t want to lose this job. Any help, resources, or advice would mean a lot 🙏",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 115,
    "downs": 0,
    "created_utc": 1758877534.0,
    "media": null,
    "is_video": false,
    "num_comments": 332,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.93,
    "category_rationale": "Asks for a step-by-step 30-day SEO plan.",
    "composite_score": 4.060680105980079
  },
  {
    "score": 114,
    "title": "Why do people not use landing pages?",
    "selftext": "Hey fellas, bit of background, I've recently started my own landing page agency HOWEVER THIS IS NOT AN AD (I won't link any of shit) and am trying to better understand the kind of situations my ideal customer is in.\n\nBasically my question is \"Why do people not bother making landing pages when they have $50k+ Ad spend behind a product\". I see it literally everyday, big ecom stores sending a shit load of traffic to just a default Shopify product page. Is it because its too hard too design? You can't quantify it? Don't know anyone that can do it?\n\nWould love yalls answers.\n\nCheers,  \nMac",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1720062697.0,
    "media": null,
    "is_video": false,
    "num_comments": 117,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Simple question about why people don’t use landing pages; lacks substance.",
    "composite_score": 3.7641388440066748
  },
  {
    "score": 114,
    "title": "Where are all the info-product entrepreneurs?",
    "selftext": "Really, where is everyone? Where to they hang out?  \n  \nI want to gather around experienced info-product creators like me, with legitimate businesses. \n\nI have had great results in the past 6 years at making info-products sell with both clients and co-founders.\n\nBut here on reddit I fell kind of lonely, because it's all about saas (which is a business model I have a side project as well).\n\nIt seems like all serious entrepreneurs or reddit are only talking about saas, and the few talking about info are on 'get rich quick' schemes and affiliate marketing bullshit.\n\nAm I missing something?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1714853328.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Seeks community and discussion, no actionable steps or list.",
    "composite_score": 3.604227836017593
  },
  {
    "score": 112,
    "title": "How I landed a job in under 15 applications (with specific tips)",
    "selftext": "About me: I’m not a job hunting god or a career guru but I found some strategies that worked for me.\n\nI’m ~3.5 years out of college. I spent my first few years at a local startup, then just got a job at a mid-sized B2B company as a Digital Marketing Specialist. My salary went from under $40k to just over double that in my most recent move. I landed this job in under 15 applications. \n\nI know I’m lucky too, but I think these strategies made a real difference.\n\nTip 0 – Applications: Apply to roles where you meet around 60% of the requirements. You don’t have to tick every box, but hit at least one or two core responsibilities. It can’t hurt you. The key is to only apply if it’s a good career move, whether or not you feel “good enough” on paper.\n\n\n\nTip 1 – Cover Letters: They absolutely read your cover letter, so make one. In it, outline what you can do in general, but highlight a key pain point you can solve. Emphasise what you specialise in so you stand out from the hundreds of “I can do everything” applications. If you’re feeling honest, you can mention what you have little experience in but want to learn — it worked for me. \n\nKey Tip: Solve a pain point and emphasise a unique niche or skill.\n\n\n\nTip 2 – Video or Take-Home Tasks:\nDon’t take them too seriously. In my experience, I’ve done 3 out of 13 and never made it to interview.\n\nThese kinds of companies are usually looking for a certain type of personality or vibe. Make of that what you will.\n\nYou can’t write a full marketing campaign for a company you don’t even know yet — treat it as a yellow flag.\n\nKey Tip: Don’t overinvest in companies that are screening for vibes.\n\n\n\nTip 3 – Screening Calls:\nI’m not great at them. My one success was when I’d forgotten which company was calling, but later heard the hiring manager insisted I be booked for an interview because of my excellent application. Honestly, they don’t matter much if the hiring manager already likes you.\n\nMy tips: Be as generic as you can, especially with HR. Say you’re excited for new challenges, you work well with others, and answer “yes” to anything reasonable.\n\nDon’t get overly technical. If you start talking about PPC, ABM, or lead gen without being asked, you’re doing it wrong. Keep it short, friendly, and straightforward. Maybe even be accommodating — ask questions about the work setup or team.\n\nExtra Tip: Don’t lie about your work history, background, or employment status. If they reach a touchy subject, answer briefly, confidently, and then steer the conversation back.\n\nKey Tip: HR screening calls are for ticking boxes, not testing your expertise.\n\n\n\nTip 4 – Interviews (Part 1): Pick the right stories\nEveryone knows the STAR method, but the real trick is picking the right stories to tell.\n\nAim for 2 “hero stories” that fit into one (or more) of these categories:\n– Solved a major problem\n– Generated new business\n– Went viral\n\n“Increase in engagement” only works if it leads to something bigger — more revenue, more meetings, more form submissions. Otherwise, pick a different story.\n\nKey Tip: Pick stories that prove real business impact, not just activity.\n\n\n\nTip 4 – Interviews (Part 2):Be human. \nTalk about where you have room to grow and how the company you’re applying to is the perfect fit. For example: “I think I can grow with the company because of the team, the budget, and your expertise in [X].”\n\nShow tactical vulnerability — frame your flaws as strengths in disguise:\n– You’re slow because you’re careful.\n– You overexplain because you care.\n– You don’t plan too far ahead because you like to test first.\n\nBe ready to explain how you fix things when they go wrong. Don’t panic , describe what the best version of you would do. And if the right answer is to cut your losses and try something else, say so\n\nKey Tip: Employers love growth and self-awareness. Convince them you’ll thrive in the role.\n\n\n\nTip 4 – Interviews (Part 3): Know your audience.\n– Marketing managers will nerd out on details. Be ready to explain how you set up, measure, and optimise campaigns.\n\n– Hiring managers care more about business problems than marketing jargon. Focus on how you solve problems. Ask questions like: “What’s the biggest bottleneck to revenue?” or “What would success look like in this role?”\n\nKey Tip: Tailor your answers to the person in front of you; technical depth for marketing managers, business outcomes for hiring managers.\n\n\nTip 5 – Negotiation:\nWhen you get the callback, don’t be scared to ask for compensation based on commute, hours, or work setup. I asked for $2k above my original expectations to cover daily parking and commute costs and ended up getting $5k extra.\n\nMaybe this only works if you’re lucky, but the right employer will try to accommodate something that would otherwise burden you.\n\nKey Tip: Reasonable, specific requests are easier to say yes to.\n\n\nTip 6 – Social Media:\nDon’t post or react to negative job-hunting or employer content on social media. People can see your reactions, and it won’t make you look like a winner.\n\nEspecially avoid reacting to posts about how employers should give you a chance, pay you more, or provide training. It will come off whiny and sad. Reddit (or anon spaces) is the better place for that.\n\nKey Tip: Keep your online presence neutral or positive, be careful of interactions. \n\nBonus Tip – ChatGPT:\nUse ChatGPT if it helps, but don’t just copy-paste. You should be spending just as much time tailoring your applications to the specific job and to your lived experience and preferences\n\nMy stats\n13 apps,  2 takehome (1 ignored), 3 screen calls, 1 interview and 1 offer. \n\nI could have done better or got more interviews if I applied all my tips but I really only learnt at the end. Good luck folks. ",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 112,
    "downs": 0,
    "created_utc": 1755329475.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.86,
    "category_rationale": "Contains numbered tips/steps for job application process.",
    "composite_score": 3.382638434811382
  },
  {
    "score": 111,
    "title": "SEO is old news? Now there’s AIO, GEO, AEO wtf is going on",
    "selftext": "Everyone’s talking about SEO, AIO, GEO, and AEO lately  and honestly, it’s getting hard to keep up. From what I’ve seen, SEO is still big, but AIO (optimizing content for AI tools) and GEO (ranking inside AI search engines) are catching fire. AEO seems focused on making content that directly answers user queries maybe the next level of SEO\n\nSEO for ranking on Google, AIO for AI responses, GEO for visibility in AI platforms, AEO for featured/voice answers. But in real projects, the lines blur.\n\nWhat are you using right now  or planning to use? Which one’s actually getting results in 2025? Curious what others think is trending or overhyped\n\n",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1750329462.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Primarily a discussion request about SEO/AI topics rather than a structured model or list.",
    "composite_score": 3.715960532109506
  },
  {
    "score": 107,
    "title": "Looking for high ROI lead gen channels beyond paid ads and lists",
    "selftext": "I've hit a wall with traditional paidd acquisition. My CAC is way too high and it's not worth the few leads we're getting. We tried Google and Meta, but optimized funnels and retargeting aren't hitting.\n\nBuying leads has been even worse. Emails keep bouncing, info is outdated and irrelevant contacts. Just wasting my time here and starting to get nervous.\n\nWhat I'm trying to do now is build a clean and reliable pipeline. Best would be something based on first-party/real-time data. I can do outreach but it has to be personalized and scalable.\n\nPlease let me know if you had a similar experience and what worked for you.\n\nEdit: I work at a boutique marketing agency. We provide B2B marketing services for our clients like blog creation, off-page SEO, and email marketing campaigns. ",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1744105643.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests experiences and insights rather than a step-by-step guide or model.",
    "composite_score": 3.5416632140080777
  },
  {
    "score": 106,
    "title": "Went from 300 views to 34k by fixing these 6 mistakes",
    "selftext": "I've been absolutely consumed by short form video for the past two years. Like might legitimately need help levels of consumed. I'm talking 12 hour days studying viral content, testing hooks, rewriting scripts, trying different editing styles, the whole thing.\n\nWhy? Because I'm convinced short form runs the future of everything. Marketing, growing audiences, selling products, generating opportunities, it all comes down to whether you can hold someone's attention for 30 seconds.\n\nBut here's what almost broke me: despite grinding every single day, nothing was hitting. I'd pour 6 hours into a video just to watch it die at 300 views. Tried every method from every expert. Purchased courses. Applied \"proven strategies.\" Still trapped.\n\nI was genuinely starting to believe some people just naturally get it and I don't. Like maybe I missed the viral gene or something.\n\nThen I had this moment where it hit me, I'm working hard, but I'm working blind. I don't actually know what's broken. I'm just guessing and hoping.\n\nSo I stopped trying to crack some hidden viral code and started measuring actual numbers. Analyzed my last 50 videos frame by frame, tracked every single drop off point, and found 6 patterns that kept killing my retention:\n\n1. **Broad openers get ignored completely.** \"Wait until you see this...\" gets scrolled every time. But \"Doing 100 squats daily made my knees sound weird\" stops the scroll dead. Specificity beats mystery.\n\n2. **Second 5 determines if they watch.** Most viewers drop between 4-7 seconds if you haven't demonstrated it's worth continuing. I was building suspense like an idiot. Now I hit them with my strongest visual or number right at second 5. That's your actual hook.\n\n3. **Any gap over 1 second murders retention.** Genuinely tracked this, anything beyond 1.2 seconds and people think the video froze. What feels like good pacing to you reads as \"boring\" to someone scrolling. Cut way tighter than feels normal.\n\n4. **Constant visual shifts are critical.** If your footage remains static for more than 3 seconds, people zone out. I started switching camera angles, adding b roll, moving text placement, anything to create visual difference. Went from losing 50% at the midpoint to keeping 70%.\n\n5. **Rewatch rate is way more important than most think.** Content people watch twice gets pushed significantly harder. Started including quick text that's easy to miss, faster cuts, small details you catch on second viewing. Rewatch rate went from 8% to 31% and views exploded.\n\n6. **Poor lighting destroys trust before you even start.** Your content could be exceptional but if lighting looks amateur, people scroll without thinking. Everyone's feed is too polished now for bad lighting to work. Quality lighting establishes credibility instantly. Terrible lighting triggers instant scrolls.\n\nHonestly the biggest shift was stopping the guessing game and actually measuring what was happening second by second.\n\nFound a tool that doesn't just show where people drop off, it actually tells you why and how to fix it. That's when things actually changed. Went from 300 average views to 15k in like 3 weeks.\n\nPlatform analytics show you people are leaving. This shows you the exact moment, why it's happening, and what to change next video.\n\nIf you're posting consistently but can't break 1k views, it's not your content that sucks, you just don't know what's actually working vs what you think is working.\n\nLook, I'm sharing this because figuring out the algorithm was genuinely one of the hardest things I've done. I really wish someone had just sat down with me back then and explained exactly what I needed to fix. Would've saved me months of frustration and self doubt. So I'm doing that now for whoever needs to hear it.\n\nEDIT: For those asking what tool I used, it's TikAlyzer (also works on Reels/Shorts). Not affiliated, just putting it here so we can skip the DM marathon haha",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 106,
    "downs": 0,
    "created_utc": 1764935405.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Enumerates 6 concrete mistakes/patterns that improved performance.",
    "composite_score": 3.3327476956940063
  },
  {
    "score": 104,
    "title": "Advice for young/new professionals: Pivot to AI NOW",
    "selftext": "I got lucky after graduating from college in 2007 or so in that I was working in media and as social media started becoming the \"new thing\" they were just handing the keys to the new guys on staff. It was a field that essentially didn't exist and then did, and it completely changed my future. I've been working professionally in digital ever since, and it's opened significant doors for me consistently over the past 15 years or so. \n\nI say all that to say that I feel like AI is at a similar place now. If young professionals can get a good understanding of AI tools and how to use them now, it will position them well for the future. Instead of bemoaning the tech and coming potentialities, learn how to use them and leverage them for results and you'll be highly sought after.\n\nEDIT: Wow, a lot of hate for AI here. If you're working in digital and you don't see AI is the future -- and the NEAR future -- you're doomed...",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 104,
    "downs": 0,
    "created_utc": 1679664825.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Presents a mental model/strategy about pivoting to AI for career prospects.",
    "composite_score": 3.4111759730553475
  },
  {
    "score": 102,
    "title": "digital marketing feels tougher than ever",
    "selftext": "i’ve been running an agency for about 10 years now, mostly professional services clients. lately though, the job feels harder than it used to.\n\nrespect for the craft is basically gone. you can spend years learning seo, design, dev, content, investing thousands into tools and testing strategies… but at the end of the day, most people only care about “more leads.” doesn’t matter how much thought or skill went into it.\n\nthe ai noise doesn’t help. every conversation ends up with “why not just use chatgpt?” and whether the outputs are good or not doesn’t even matter. the perception is that anyone can do what we do with a couple prompts.\n\nsales is rough too. if you get too detailed, people think you’re scamming with jargon. if you keep it simple, they assume you don’t know what you’re talking about. feels like you can’t win either way.\n\njob creep is real. companies post “marketing” roles that are really six jobs in one—social, ppc, strategy, design, analytics, even web dev.\n\nand then there’s the noise from all the talkers. the amount of gurus spamming ebooks, robocalls, “ai hacks” and promises of 10x growth has made the market so flooded that it’s tough for actual doers to stand out.\n\ni don’t want to sound bitter, i still enjoy the work, but it feels different than it used to. anyone else noticing the same?\n\nedit: someone asked how we’re handling content scale without losing our minds been leaning on canva and feedblast ai to pump out variations quickly. honestly wouldn’t keep pace otherwise.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 102,
    "downs": 0,
    "created_utc": 1757200772.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Emotional frustration about the marketing field and AI noise.",
    "composite_score": 3.595774652541418
  },
  {
    "score": 100,
    "title": "I'm not a fan of the current state of digital marketing",
    "selftext": "I've been working in digital marketing for more than 13 years now. It's been obviously quite a dynamic field with lots of changes happening over the years. However until AI era these changes have been not that frequent, somehow expected and made sense. I feel nowadays with the AI vibe it's become extremely overwhelming: there are new ai tools being launched and marketed constantly by start ups, big publisher come up with ai solutions pushing everyone to use (and tbh these solutions are not great, plus some of them just taking the management control away), creativity is somehow now being delegated to ai, and on top of everything all these ai tools/agents to be set up needs time wich is always scarce.\n\nI agree there are definitely positives from using ai tools especially when it comes to automation, research (if accurate), ideation, learning how to, but still everything seems to about ai these days and somehow the magic of marketing and the importance of human touch in it are perishing away. \n\nWhat are people's honest thoughts on this current state? Or am I just being a dinosaur and fighting the change ? 😂",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 100,
    "downs": 0,
    "created_utc": 1756546702.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Offers opinion on AI impact with balanced arguments; requests thoughts.",
    "composite_score": 3.7108853005824916
  },
  {
    "score": 99,
    "title": "Can y'all stop? TW: Rant",
    "selftext": "I'm getting really effing sick of seeing the constant, multiple daily posts here about \"breaking into digital marketing\" or \"how do I learn it\" or \"I want to start my own agency with 1 year XP.\"\n\nI hate to break it to some of you, but you're all too late to the party. \n\nYou need real-life, hands-on experience over many years to even compete. You can't just take one course and learn this trade. When you take the short and easy road, you're giving this industry, your peers and yourself a bad name.\n\nThose of us who actually live and breathe digital marketing (and are damn good at it) have been in it for 10+ years. We are the ones getting clients, hustling for leads, optimizing our content and generating positive results for clients...all because we are MARKETERS.\n\nI swear, if I see one more post about how you \"can't find leads or clients even though you're an (insert specialty here) marketer\", I'm going to scream.\n\nGet real. \n\nYou're not equipped to compete until you've put in the work, not just having taken a free course or watched one YouTube video...or asked this reddit community \"how to\", when you know damn well the answer isn't going to be \"you can self-teach this shit.\"\n\nJust stop.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.73,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1710428605.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Explicit rant about newbies and posts, complaining.",
    "composite_score": 3.5147492256217836
  },
  {
    "score": 100,
    "title": "I have gained over 1 Million followers organically  how can I find a job in this field?",
    "selftext": "As the title states I have grown my own social media brand to over 1.2M (Instagram) 725K (TikTok) and 60k (YouTube). The niche I run is motivational and although it is a faceless page nothing is reposted and it's all original creating \"edits\" on some of my favourite athletes and movies. With this I have a lot of experience with editing videos, photoshop, web design etc.\n\nThis leaves me with my question of, with this experience is it possible or probable I can find a job in this feild? And what things can I do to increase my chances? I am a first year business university student (meaning 3 years or so to go) with no experience in a corporate environment.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 100,
    "downs": 0,
    "created_utc": 1718932790.0,
    "media": null,
    "is_video": false,
    "num_comments": 145,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asks for career guidance; not a list or model.",
    "composite_score": 3.806497801674861
  },
  {
    "score": 98,
    "title": "Best influencer marketing agency for large, national campaigns?\n",
    "selftext": "I’m going to be overseeing advertising for 5-6 brands owned by a larger company. I was primarily doing paid marketing before and haven’t had to touch sustained influencer campaigns for about 7-8 years save for some one-offs to promote some product launches. \n\nThe ecosystem has changed a lot it seems and I need influencer agency I can trust. Full disclosure: I hated, hated, hated dealing influencer marketing 8 years ago as I was having to deal with influencers 1:1 and the ROI was never worth it for how much work I had to put in.\n\nI’m hoping things have changed and that an agency can handle most of the legwork.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1717896363.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Seeks recommendations for an influencer marketing agency; not a list, steps, or analysis.",
    "composite_score": 3.6197108197893715
  },
  {
    "score": 99,
    "title": "Here's what happened in digital marketing and advertising recently",
    "selftext": "\n\n#  Top 6 Updates of the Week: \n\n&amp;#x200B;\n\n* Google delays Third Party Cookie Deprecation, for the third time. \n* TikTok US Ban bill was passed, Bytedance denies the rumour of selling the platform. TT’s current plan to challenge the bill.\n* Youtube now plans to Show you ads when you pause videos.\n* Snapchat’s Q1 Earnings Report shows strong user and revenue growth. \n* Meta’s posted strong Q1 Earning Results, 27% ad revenue increase, compared to 4% increase in Q1’23. \n* Pinterest shares Summer 2024 Travel Trends. \n\n# Trending\n\n* The Guardian’s big step toward privacy, “reject all cookies” option is here. \n* Hubspot launches Spotlight, service hub, content hub and more updates. \n* Tesla fired everyone on the newly formed marketing team. \n* IAB Europe publishes final version of Retail Media Measurement Standards. \n* Miu Miu named Hottest Brand of Q1 2024 by Lyst. \n* Youtube’s Ad revenue rose 21% to $8.1bn in Q1 2024.  \n* GumGum merges Playground xyz APAC Media Business. \n* WPP blames loss of Pfizer account and tech client cute for 1.6% revenue decline in Q1. \n* IAS achieves MRC Accreditation for sophisticated invalid traffic in the CTV Environment. \n\n# TikTok 🎶 \n\n* TikTok shuts down user rewards programme for its Lite App. \n* TikTok testing a new feature allowing business to insert product links in videos. \n* TikTok is testing an authorisation code for creators to share access marketplace with Talent Managers. \n\n# Instagram &amp; Threads 🗂️ \n\n&amp;#x200B;\n\n* Instagram launches new promotional features to help creators with paid subscriptions. \n* Threads expands access to Hidden Words feature and Post Notification Controls. \n* Instagram working on an improved DM experience with new profile UI.  \n* Threads launches live test of Auto Post Archiving, ignoring the backlash. \n* Threads (28M) estimated to have more daily active users than Twitter (22M). \n\n# Meta 😅\n\n* Meta AI integrates Google search results in the AI chat. \n* Meta’s fundraising tools are going away on July 1st in European Economic Area. \n* Meta prompting Instagram creators to add their Facebook page to Bio. \n* WhatsApp working on an In-app dialler, allowing users to make quick calls.\n\n# X (Twitter) 🕹️\n\n&amp;#x200B;\n\n* X showcases their Connected TV App. \n* X removes the “hide your checkmark” for all users. \n* New features launched for X Communities: Explore page, topics and more. \n* X working on video spaces for the web app. \n* X simplifies Ad Creation and targeting process with new AI update. \n\n# Youtube 🕹️\n\n&amp;#x200B;\n\n* YouTube reverts back the controversial video player UI on desktop. \n* Youtube announces an update to Test and Compare, Likes on Super Chat and more. \n\n# Google 🔦 \n\n&amp;#x200B;\n\n* Google March 2024 core update is finally complete. \n* Google Search revenue increased 14% YoY, reaching $46 Billion in Q1. \n* Sundar Pichai, Google CEO says AI overviews are increasing Search Usage . \n* Google Publisher Center to stop allowing you to add publications. \n* Google DeepMind RecurrentGemma Beats Transformer Models.\n\n# Agency News \n\n&amp;#x200B;\n\n* Firehouse Subs appoints Orchard to lead Creative and PHD to handle Media. \n* Reckitt hires McCann Content Studio UK to run social and influencer account. \n* Interpublic announces Q1 2024 results, posting 1.3% net revenue increase from Q1 2023. \n* Ogilvy launches health influencer marketing offering. \n* BarkleyOKRP appointed as AOR by Hormel Food’s Applegate. \n* Aquila Power Catamarans appoints Spark as its first Creative &amp; Brand Strategy Agency. \n* GroupM introduces “New Buyer Identifier” Data for CPG Clients. \n* David Yurman appoints PHD as Global Media Agency of Record. \n\n# AI 🤨\n\n&amp;#x200B;\n\n* Coca Cola announces 5-year long AI partnership with Microsoft. \n* Adobe introduces Firefly Image 3 foundation model, currently available in Photoshop. \n* Microsoft launches a new Tiny LLM. \n* Perplexity AI launches Enterprise Pro. \n* Synthesia AI’s video avatars have emotions now. \n* Apple acquires Datakalab, French AI startup. \n* Elon Musk’s xAI is close to securing $6 Billion from investors. \n* UK probes Amazon and Microsoft over AI partnerships with Mistral, Anthropic and Inflection. \n\n# Reddit &amp; Pinterest\n\n* Reddit announces major UI update to its mobile app. \n* Reddit’s new ad product: Dynamic Product Ads. \n* Pinterest brings back the option to claim your Instagram account on the platform. \n\n# Microsoft &amp; LinkedIn\n\n&amp;#x200B;\n\n* Microsoft Bing Ads Revenue was up 12% from Q1’23 in Q1 2024 . \n* 4 key takeaways from Microsoft’s earnings call. \n* LinkedIn now has a new custom button option ‘subscribe to newsletter’.\n* LinkedIn reports record breaking engagement levels with 11% increase in sessions. \n\n# Marketing &amp; AdTech \n\n* Deezer and Global sign an exclusive ad sales deal. \n* Revolut plans to join advertising business by monetising customer data. \n* Sky Media improves Search Behaviour targeting through Captify partnership. \n* AdWanted launches Audiolab, A cross-platform digital audio measurement tool. \n* Judge suggests New FTC “Click to Cancel” Study. \n* Comcast’s Q1 earnings beat analyst expectations but the company lost broadband customers in Q1.  \n* Substack rival Ghost confirms plans to join Fediverse in 2024. \n* Publishers betting on events and franchises are winning more in terms of ad revenue. \n* ASDA partners with Diageo to introduce In-store Digital screens. \n\n**I hope this helps to plan your week ahead.**",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1714490860.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Digest-style post with a numbered list of weekly updates.",
    "composite_score": 3.3930149978319903
  },
  {
    "score": 98,
    "title": "What skills landed you more money?",
    "selftext": "I’m currently working at a marketing agency doing SEO &amp; Analytics. To be transparent, I’m good at my job but I make only 45K. I have two years of experience. I’ve tried job hopping for a higher salary (even just 55-65K would make me happy) but it’s so competitive. I’ve applied to +100 that I’m qualified for and I still get chose over more qualified candidates. \n\nIt’s exhausting. So many recruiters always reach out to me on Linkedin. I interview, they tell me I seem like a really great fit, then they still choose someone else over me. \n\nWhat skills (&amp; how long) did it take you to finally make a more reasonable salary? \n\nI was thinking of pivoting over to data analytics or marketing analytics and have been looking into masters degrees &amp; online certs for it, but the starting salary still seems so low. I don’t want to invest a lot of time and money for something just to make 50K the rest of my life.\n\nI’m 25 and feel like I make so little for the experience and education I have. \n\nI live in Upstate NY if that helps.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1691953699.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks about skills and salary progression, i.e., career-advice question.",
    "composite_score": 3.6794487402427705
  },
  {
    "score": 96,
    "title": "Hey everyone, sharing some free tools I’ve found really useful for digital marketing!",
    "selftext": "Thought I’d share a few tools that have been super helpful for me in the past few years. Most of them are free or have solid free plans. If you’re looking to improve your marketing without spending a lot, these might be worth checking out:\n\n\n**Analytics and Monitoring**\n\n1. **Google Analytics**: Great for tracking user behavior, conversions, and optimising your site.\n2. **Google Search Console**: Helps you keep an eye on how your site performs in Google search results.\n3. **Microsoft Clarity**: Offers insights into user behavior with features like heatmaps and session recordings. Free to use.\n\n\n**Keyword Research and Planning**\n\n1. **Google Keyword Planner**: Useful for researching and planning keywords for Google Ads.\n2. **Keywords Everywhere**: Good for keyword research with limited free usage. Full features require a subscription.\n\n\n\n**Trends and Insights**\n\n1. **Google Trends**: Explore trending topics and search interest by country. Totally free.\n\n\n\n**Website SEO and Audits**\n\n1. **Screaming Frog SEO Spider**: Handy for SEO audits. Free for crawling up to 500 links. Paid plans have more features.\n2. **SEO Review Tools**: Free backlink checker.\n3. **xml-sitemaps.com**: Create a free sitemap for up to 500 pages.\n\n\n\n**Design and Content Creation**\n\n1. **Canva**: A design tool with a free tier that offers lots of templates and design elements. Premium features are available if you need more.\n\n\n\n**Project Management and Organisation**\n\n1. **Trello**: Useful for organising content and tasks. The free plan is pretty solid.\n\n\n\n**Email Marketing**\n\n1. **Mailchimp**: Lets you create, send, and track emails for free with some limits.\n2. **Brevo**: Allows up to 300 emails per day for free, with more features in paid plans.\n\n\n\n**CRM**\n\n1. **HubSpot CRM**: Manage customer data for free. Extra features are available in paid plans.\n\n\n\n**URL Shortening**\n\n1. **Bitly**: Shorten URLs for free with basic features. Advanced options are in paid plans.\n\n\n\nHope this helps some of you! If you have any other free tools you love, feel free to drop them here.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1724068992.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.95,
    "category_rationale": "Explicitly lists multiple free marketing tools across categories.",
    "composite_score": 3.520320663234103
  },
  {
    "score": 96,
    "title": "is it too Late to Start a Career in Digital Marketing at 26?",
    "selftext": "so I'm 26F an English literature graduate, I've been working at a holding as an administrative assistant for 7 years now.\n\ni figured out i don't like it anymore (it's late i know) and i wanted to find something more like me, something i could enjoy doing.\n\nso i found Digital Marketing and i started my self learning journey 2 months ago. but I'm uncertain if im going the right way, or if I'm doing this correctly.\n\ni did 2 courses on Coursera on the fundamentals of digital marketing and attracting customers.\n\nCurrently doing Hubspot Social Media Marketing Course.\n\ni need to get my hands on some actual experience, not just courses and readings.\nwhat do i need to get accepted at an agency as an intern or an assistant?\n\nI'm very curious, i learn quickly, bilingual, passionate about research and social media.\n\ni even have a youtube channel for my cats (as a hobby)\n\ni could use some advice on what to do next? \n\nthanks in advance",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1711892100.0,
    "media": null,
    "is_video": false,
    "num_comments": 207,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": " asks for guidance on starting a digital marketing career at 26; general career-question.",
    "composite_score": 3.8283034017476254
  },
  {
    "score": 95,
    "title": "Digital marketing advice/help/question ? ",
    "selftext": "i there ! I’m a (32f) with no experience in digital marketing…I work in healthcare and I have been in that field since I was 22. Im really interested in Digital marketing and I would love for a career change . I have some experience in graphic design. I would like to create emails …I’m all over the place with the idea but that’s because I don’t know where to start and I want to make sure I’m productive with my time . Any advice on how to achieve this? Where do I start ? Go back to school? Take Online courses ? What was your experience in changing careers or taking on a new career with no experience …or even being a digital marketer. I would appreciate honest feedback…TY !",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1727879115.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Career-change question seeking practical starting points in digital marketing.",
    "composite_score": 3.4968052552147064
  },
  {
    "score": 96,
    "title": "Lately it feels like digital marketing is less about creativity and more about plumbing",
    "selftext": "Between ad platforms, CRMs, enrichment tools, spreadsheets, and random automations, half my time goes into just making sure data isn’t broken before a campaign even launches. By the time targeting is “clean,” the moment you wanted to act on is already gone.  \nWhat’s been frustrating is that most tools still feel very siloed especially with tools, one tool for data, one for automation, one for research, one for outreach. You end up duct taping everything together and hoping nothing breaks mid-campaign.  \n  \nI’ve been experimenting with using Clay more as a backend system rather than a “lead gen tool.” Pulling data from multiple sources, layering in signals, doing lightweight research, then handing clean segments to whatever channel I’m using, defo a learning curve to it but I feel like it has a lot of potential and seen it mentioned everywhere.  \n  \nCurious how others here are handling this. Are you still running mostly manual setups, or have you found a way to make campaigns less fragile without turning into a full-time ops person?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1767376479.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Offers analysis of tooling complexity and suggests a backend approach; seeks community input.",
    "composite_score": 3.3929830746773475
  },
  {
    "score": 93,
    "title": "SEO in 2025",
    "selftext": "SEO in 2025: It’s Not Dead, Just Different\n\nSEO isn’t what it used to be, and that’s not a bad thing. With AI Overviews taking over Google, the rise of zero-click searches, and people turning to Reddit, Quora, and even TikTok for answers, it’s time to rethink how we approach search.\n\n🔸 AI-driven summaries are changing what shows up in SERPs  \n🔸 Answer Engine Optimization (AEO) is becoming a real thing (hello, ChatGPT and Perplexity)  \n🔸 Community-based content (like Reddit, Quora posts!) is ranking higher  \n🔸 SEO is shifting from traffic-focused to conversion-focused  \n🔸 Google now favors first-hand experience and content that shows real expertise\n\n If you're still only optimizing for keywords and backlinks, you're playing an outdated game.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1745149383.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Educational piece outlining SEO shifts and strategic implications for 2025.",
    "composite_score": 3.506676782567557
  },
  {
    "score": 93,
    "title": "I analyzed 100 UGC videos that went viral in 2024 - here's what worked and thoughts on 2025",
    "selftext": "Hey everyone, I've been running UGC campaigns for the past 3 years and noticed some major shifts in what's working. Spent the last couple weeks analyzing our top 100 performing videos from 2024 (across fashion, beauty, and SaaS) and thought some of you might find this interesting (might be obvious to others, figured I'd share anyways).\n\nQuick methodology note - I only looked at videos that hit &gt;100k views and had at least 2% engagement. All were organic posts, no paid promotion.\n\nThe biggest surprise to me is that length doesn't really matter anymore. In 2023 everyone said \"keep it under 30 seconds!\" but our best performing videos averaged 1:47. People are actually watching longer UGC if (big if) it's actually useful.\n\nHere's what seemed to work consistently:\n\n* \"Behind the scenes\" style content crushed traditional testimonials. Videos showing real usage/implementation got 3x more engagement than straight reviews\n* Raw, imperfect footage &gt; polished content. Videos with minor mistakes or bloopers actually performed better\n* Specific numbers/results &gt; generic claims. \"I saved $436 last month\" performed way better than \"I saved money\"\n\nThe biggest change in trend I've seen is that lower production quality videos often outperformed professional ones. Seems like people are getting suspicious of overly polished content.\n\nBig pain points we faced:\n\n* Coordinating with creators is getting harder and more expensive\n* Turnaround times killed several campaigns\n* Keeping messaging consistent across multiple creators was a nightmare\n\nLooking at 2025, I'm seeing a few emerging trends:\n\n* More focus on process/implementation videos\n* Growing demand for quick-turnaround content\n* Audiences wanting more authentic, less scripted material\n* Rising creator costs (saw 40% increase in rates last year on average)\n\nCurious what trends you all are seeing? Also, any tips for managing creator coordination? That's been our biggest headache lately.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1736790600.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.88,
    "category_rationale": "Data-driven analysis of what makes UGC ads successful and practical insights.",
    "composite_score": 3.3176878449276606
  },
  {
    "score": 93,
    "title": "How to get started in digital marketing",
    "selftext": "Hey there! I was laid off from a tech job (non-technical role) a couple months ago. I’m still job hunting for a similar position but also looking into alternative career paths and a friend mentioned digital marketing. Every time I see people talk about it, they’re just trying to sell a course. If you are self-taught, what steps did you make to get started, what worked, what didn’t work, etc..\n\nAlso, in general, how do you make an income off of being a self-taught digital marketer?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1710988555.0,
    "media": null,
    "is_video": false,
    "num_comments": 191,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question-based post about how to start in digital marketing; not a step-by-step.",
    "composite_score": 3.812278467951473
  },
  {
    "score": 92,
    "title": "Facebook Ads Stop Working After 2 Weeks Of 2,5-3 ROAS",
    "selftext": "Hey guys ,\n\ni don't know if that is normal Facebook ads game or do i have some problem, but i have multiple creatives that are performing well for 2 weeks and then they die. When i run them, i try to scale them, next time i don't touch anything and the result is always the same.  \nWhen I relaunch ads with different interest, creatives  always perform well again for 10-14 days and then they just stop. I always have the same problem: I can't run a profitable adset for over a month without turning it off. Is that normal or not?\n\nThanks in advance!",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 92,
    "downs": 0,
    "created_utc": 1744822518.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question about Facebook ads performance with no actionable steps or model.",
    "composite_score": 3.4345619642250442
  },
  {
    "score": 90,
    "title": "We Created A Hybrid SEO Viral Strategy That Actually Works (Real Case Study Insights) ",
    "selftext": "I've been holding off on sharing this for a while, but after seeing the results across multiple clients, I think it's time to break down what's actually working in the SEO-viral content space right now.\n\n\nOver the past year, we've been experimenting with different approaches to merge SEO and viral strategies. What I'm seeing work incredibly well is what I call the \"Echo Strategy\" - where your viral content feeds your SEO, and your SEO research informs your viral content. \n\nHere's what I mean:\n\nOver the past few years the game has shifted dramatically. Traditional SEO isn't dead (far from it!), but it's evolved. What we're seeing work is using SEO insights to create what I call \"discoverable virality.\" For example, one of our clients took their top-performing SEO keywords and turned them into TikTok series - suddenly their Google rankings improved because of all the social signals and backlinks from people sharing and discussing their content. It's like a beautiful feedback loop.\n\n\nHere's what's fascinating about the current situation:\n\n- Google is now heavily weighing user experience signals from social media\n\n- Viral social content often becomes featured snippets in search results\n\n- The most successful brands are treating their social media descriptions and captions as mini-SEO opportunities\n\n\n\nBut here's the real strategy that's working for us:\n\n1. Use SEO as your foundation: Research keywords and topics people are actually searching for. This is your content backbone.\n\n\n2. Turn those SEO insights into social-first content: If people are searching for \"how to create AI prompts,\" create a punchy reel about it. The search intent tells you people want this info - now give it to them in an engaging format.\n\n\n3. Create what I call \"SEO-viral hybrid content\": This is content specifically designed to both rank and share well. Think comprehensive guides broken down into shareable chunks, or viral social posts that link back to detailed blog content.\n\n\nWhat's really interesting is how the platforms are converging. We're seeing Instagram posts ranking in Google searches, YouTube Shorts becoming major search destinations, and TikToks appearing in Google's video carousel. It's not about choosing one lane anymore - it's about making your content work harder across all platforms.\n\n\nHere's a practical example: One of our clients in the tech space took their top-performing blog post about AI tools and turned it into:\n\n- A series of short-form videos\n\n- An infographic that went viral on LinkedIn\n\n- Multiple tweet threads\n\n- A downloadable checklist\n\nThe result? Their search rankings actually improved because of the social signals, while their social reach expanded because the content was backed by solid SEO research showing what people actually wanted to know.\n\nOne of our most successful cases was with a skincare brand that was struggling to break through in both areas separately. When we implemented this strategy, their organic traffic increased by 312% in just 6 months.\n\nThis is how the strategy can be practically implemented - Use SEO to figure out what people want, then create viral-worthy content that answers those queries in the most engaging way possible. It's not SEO vs. viral anymore - it's SEO-informed viral content.\n\nPro tip: Keep a \"viral triggers\" spreadsheet where you track which elements of your content tend to go viral. Then make sure these elements are baked into your SEO-optimized content. We've found this creates a much higher success rate than treating them as separate strategies.\n\nThe most crucial lesson we've learned through all of this experimentation is surprisingly simple: Before implementing any part of this strategy, we always ask ourselves and our clients one fundamental question: \"If this content appeared in your feed and it wasn't your brand, would you watch/read it?'\n\n\nWould love to hear your inputs and what specific aspects of SEO you're struggling with. \n\nThanks for reading!\n\n",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 90,
    "downs": 0,
    "created_utc": 1736423267.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Provides a reproducible sequence of steps to implement an SEO-viral strategy.",
    "composite_score": 3.6059659376897213
  },
  {
    "score": 87,
    "title": "I feel overwhelmed by AI",
    "selftext": "I've been working in marketing (in particular web, email, and digital) for the past 10 years (I'm 30 now). I've always been the tech person who people ask when they're struggling with software / digital marketing platforms, and yet I feel completely overwhelmed (frankly even scared) by AI. \n\nI don't even know where to start (i.e where to improve my skills and knowledge of it). Every day, there seems to be a new AI software that basically makes a marketer's role redundant. I don't know where to get a head-start so that when the eventual next round of redundancies occur I feel protected.\n\nIs anyone else feeling this way at the moment? Do you have any advice?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 87,
    "downs": 0,
    "created_utc": 1742313521.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.66,
    "category_rationale": "Emotional expression of being overwhelmed by AI and fear of redundancy.",
    "composite_score": 3.6310276656461404
  },
  {
    "score": 89,
    "title": "my personal picks for digital marketing tools in 2024",
    "selftext": "\rThought I'd share a mix of some staples and a few surprises that are reshaping my strategy in 2024. This isn't an exhaustive list, but these are the tools I've personally found impactful.\r  \n\r  \n*Jasper*: An oldie but goodie for long-form content. The language versatility and the writing assistant feature are top-notch.\r  \n\r  \n*Canva*: For visuals, Canva remains a reliable friend. Quick, efficient, and user-friendly.\r  \n\r  \n*ChatGPT-4*: Yes, an AI for writing assistance. It's like having a brainstorming partner who never sleeps. Great for generating quick content ideas or overcoming writer's block.\r  \n\r  \n*Boost App Social*: I recently started using this for Instagram and TikTok marketing. It's quite efficient with AI-driven suggestions for captions and hashtags, and the story templates are visually appealing. \r  \n\r  \n*Mailchimp*: For email marketing, I'm still loyal to Mailchimp. It's straightforward and gets the job done.\r  \n\r  \n*SEMRush*: An all-in-one for digital marketing, great for everything from keyword research to market analysis.\r  \n\r  \nWhat I love about these tools is how they simplify complex tasks and provide insights that we might miss. They don't replace the human touch but enhance our creativity and efficiency.\r\n\nWould love to hear what tools you're using and any you think should be on this list!",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1700030267.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "List of digital marketing tools with brief descriptions.",
    "composite_score": 3.5462275116073343
  },
  {
    "score": 88,
    "title": "I was exhausted from posting on Facebook and Instagram. So I made an app that does it for me.",
    "selftext": "Hi everyone,\n\nLast year I helped a friend grow her restaurant in Sydney. I noticed she spent far too much time posting on social media. It was exhausting.\n\nI have been obsessed with building tech stuff since a young age. And I wanted to build something that makes social posting not only easy but fun.\n\nSo I spent the last 18 months coding, and the end result was an app that automates a large part of this process. It is called Amazely.\n\nBasically, all you need to do is upload photos of the business. Amazely uses AI to learn about the business, understand what each photo is about. It will then craft contents automatically and propose a month-by-month posting schedule for the business owner to approve. Upon approval, it will post to FB&amp;IG automatically.\n\nObviously, this cannot and will not replace humans. The goal is to take the tedious part away from managing social media so marketers can spend time on other activities.\n\nWhat do you think of the idea ? I made a 50 seconds demo so if anyone wants to see this in action, let me know.\n\nCheers.",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 88,
    "downs": 0,
    "created_utc": 1701823844.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Description of a new app idea; no actionable steps or model.",
    "composite_score": 3.5485514367051407
  },
  {
    "score": 46,
    "title": "Anyone else dealing with campaigns that were optimized but performance still declined?",
    "selftext": "We were running a campaign for a consumer goods brand and everything seemed right. Targeting was precise, bidding was tuned, and the channel mix was carefully chosen. The first weeks went smoothly, but by week seven performance just fell off. We looked at the numbers and realized the audience was not reacting to the creative anymore. It feels like fatigue is setting in quicker than ever and the old playbooks do not stretch as far as they used to. I would love to know how other marketing teams keep campaigns fresh without constantly spending more on new content. Do you have a framework that actually works?",
    "subreddit": "DigitalMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1756403231.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for a framework to keep campaigns fresh; primarily a question about strategies.",
    "composite_score": 2.941569534089136
  }
]