[
  {
    "score": 1559,
    "title": "$8,873.16 in Additional Sales. Upsells Guide",
    "selftext": "Now that **2023** is behind us, I wanted to pull up our website analytics and provide some value to help out new website owners who are just starting out— the same way this subreddit helped me in 2022 when I began my e-commerce journey.\n\nOnce your website is up and running, and you're getting your first sales, congrats! That's a big milestone. It only gets easier from here. The main thing is not to stop, the positive momentum is on your side.\n\nThe next thing, IMO, you need to focus on is your upsells, increasing your **AOV** (average order value). Our AOV was [$176.40](https://ibb.co/SQJgtJY) in **2022**, and now it’s [$203.00](https://ibb.co/WgjXWCq). Having upsell funnels is the leverage in business everyone talks about. Spend 2-4 days setting them up and get paid dividends indefinitely (assuming that you stay in the same business).\n\nThink of upsells like this: A portion of your clients would **definitely** spend more $ with you, but by not offering anything else, you’re leaving money on the table. The better your offer and the more relevant your upsells are, the bigger that portion of clients will grow.\n\nTo make your upsell funnel effective, you need to:\n\n* put it in front of their faces, and\n* make it easy for them. The less friction, the better.\n\nI think it’s the easiest, yet not widely used way to increase your revenue, because the easiest clients to sell to are the ones who have already bought/about to buy from you.\n\nThere are two types of upsells when it comes to Shopify’s buying funnels: pre-purchase and post-purchase.\n\n[**Pre-Purchase**](https://ibb.co/cbvCYmQ): To see a quick example, add [this](https://www.alltimemats.com/products/luxurious-black-red-floor-mats-custom-made) product to your cart . This is where you’d offer your clients the opportunity to purchase related products for an incentive, or if you have a one-product store, you could upsell them on extended warranties, faster shipping, customized logos, etc. It took us a couple of days to set everything up in January of 2022, and the work we did then pays dividends to this day.\n\n**Your Pre-Purchase Offer**\n\nFor example: “Add 1 more product for 10% Off”, and 2nd products for 13% off. The goal here is to increase their order size with an Attractive Incentive. We have a 3-tier discount system: 1. Free Shipping, 2. Free Shipping + 10% Off, 3. Free Shipping + 13% Off. The app we use has no limits regarding the tier system. See what works best for you.\n\nQuick principles when it comes to a pre-purchase upsell funnel:\n\n1. Attractive incentive (tier discount system)\n2. Offer a relatable upsell product. For example: If your client bought a red T-shirt, offer them red shorts, shoes, etc.\n3. Ensure a friction-free process. This is where the app you use will matter the most; one click and that’s it—their 10% discount unlocked and your AOV has gone up.\n4. It needs to make sense. Answer this question: “Why would I want to buy this upsell product if I have this in my cart already?”5. Add an attractive message and make it visible.\n\n[Post-Purchase Funnel](https://ibb.co/DCf6vhW). This step has two subsections: **Post-buy** and **Thank you page**.\n\nPost-buy: what do your clients see right after ordering? Ours see offers on the products they chose not to buy with a better discount. At the moment, we offer a 13% pre-purchase max; post-purchase it’s 15-20%. It’s your take it or leave it offer.\n\n**Post-Purchase** upsells principles:\n\n1. 1-click-buy is a must here (you need an app that will allow your clients to upsell them with the payment information they already entered).\n2. Slightly higher offer. Remember, it’s your take it or leave it offer.\n3. Make your upsell funnels relatable. Red T-Shirt added to cart -&gt; no pre-purchase upsells added -&gt; Purchase -&gt; Red Shorts, Red Shoes with a higher discount than they'd get pre-purchase.\n\n**Thank You page**: What do your clients see when they click “view order” in their order confirmation email? This is another place that you can turn into an upsell funnel. On the Thank You page, our clients see the upsells from the post-purchase page, with the same offer. The app we use creates an automatic discount code that lasts 10 minutes only and creates a pop-up banner, asking a client if they want to be taken to our products page and take advantage of this deal.\n\nThere's more to unpack but these are the main principles and thinking processes that allowed us to increase our AOV by 15%. \n\nI’m sure if you dedicate a couple of days into creating, and then taking your clients on an upsell journey, you will see a disproportionate return on your time and will win greatly in the long run.\n\nIf you're already using an upsell app, let me know how your results have been if you wanted to add anything to the info provided.\n\nHope you gained value out of this post\n\n\\-DS",
    "subreddit": "dropship",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1559,
    "downs": 0,
    "created_utc": 1707941588.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6143359387655645
  },
  {
    "score": 530,
    "title": "I Accidentally Set a $1 Daily Budget… and the Results Were Terrifying",
    "selftext": "So, picture this: It’s 2 AM, I’m half-asleep, wrapping up a campaign for a client, and I decide to tweak the ad budget. Instead of setting $100 per day, my overtired brain decides $1 is the perfect number.\n\nDid I double-check it? Of course not. I hit *Save* and passed out, dreaming of flawless ROAS and skyrocketing conversions.\n\nFast forward to the next morning:\n\n* *Impressions:* 14.\n* *Clicks:* 0.\n* *Comments from the client:* “Uh…is the campaign live?”\n\nCue my mini heart attack. I checked the dashboard, realized what I’d done, and quickly fixed it. But here’s where it gets weird those 14 impressions? One of them was from someone who DM’d the client about a bulk order.\n\nYup. A *$1 budget* somehow found the most qualified lead on the planet.\n\nNow the client won’t stop asking, “Can we try the $1 strategy again?” And honestly? I’m just trying to pretend it was all part of my master plan.\n\nSo, yeah, sometimes even your screw-ups can work out…kind of.",
    "subreddit": "dropship",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 530,
    "downs": 0,
    "created_utc": 1733163182.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.275192561095726
  },
  {
    "score": 519,
    "title": "You can use this strategy to make $5k a day.",
    "selftext": "Facebook Ads Fact:\n\n1/ 70% of people watch your ads while the sound is turned off.\n \nIf you’re not adding captions to your ads then you aren’t able to communicate with those people.\n \nSo make sure whenever you’re making an ad-creative, Add a caption to it.\n\n2/ Facebook Ads Dimensions to keep in mind.\n\nSingle Video Ads → 4X5\nSingle Image Ads→ 1x1\nStory Format Ads→  9X16\n\n3/ 80% of people don’t even watch 3 seconds of your ad.\n\nYou need a pattern interrupt to get someone to watch it.\n\ne.g.:-\n\n\"Discovering THIS has been an absolute game changer\"\n\n&gt;Did You Know? [STATISTIC/FACT].\n\n\"I can't believe what I did until I did THIS.\"\n\n4/ Follow the rule of 3-5.\n \n&gt;&gt; Never have more than 3-5 Active Campaigns.\n&gt;&gt; Never have more than 3-5 Active Ad-sets in each campaign.\n&gt;&gt; Never have more than 3-5 Active Ads in each Ad-set.\n \nThis rule will help you scale a lot.\n\n5/ 90% of people see your landing page on mobile.\n\nMake sure to build your landing page in mobile view first.\n\nOtherwise, you’ll be just wasting money redirecting people to that landing page.\n\n6/ People HATE seeing ads.\n \nSo, Instead, make your ads fun &amp; engaging:\n \n- Add humor &amp; memes\n- Tell stories\n- Make ads as you talk in real life\n \nEven if they buy your product or not, they should feel like it was a good use of their time to watch the ads.\n\n7/ Once you’re done creating your campaign.\n\n&gt;&gt; Go through campaign, Ad-set, Ads again\n&gt;&gt; Check Budget, Location, Targeting\n&gt;&gt; Check Headline, Primary text, UTM Parameter &amp; Links\n\nEven a single mistake can ruin your whole campaign, Double-check everything.\n\n8/ Elements that make a great ad:\n\n• 4:5 aspect ratio\n• Add subtitles\n• Bright Lighting\n• Compelling graphic\n• Right Text\n\nMake your video engaging &amp; worth viewer’s time\n\nEven if they buy product or not, they should feel like it was a good use of their time to watch the video\n\n9/ Never start from scratch, Use different frameworks for creating ads.\n\n- Pain, agitate, solve\n- Hook, educate, sell\n- Attention, interest, desire, action\n\nFrameworks will allow you to churn out creatives really fast &amp; you’ll never run out of creative ideas\n\n10/ Create a personal swipe file:\n \nWhenever you see a great\n \n&gt;&gt; landing page\n&gt;&gt; Ad\n&gt;&gt; Ad-Copy\n&gt;&gt; Advertorial\n \nSave it in your swipe file.\n \nSo whenever you’re creating for yourself, You’ll have 100’s of inspiration\n\n11/ Remove the fear of losing money.\n\nIf you want to scale you’ll lose money initially.\n\nIn testing new Audiences, Creatives &amp; Landing pages.\n\nBut those tests will allow you to scale.\n\nIt’s like you’re investing for future returns.",
    "subreddit": "dropship",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 519,
    "downs": 0,
    "created_utc": 1723230164.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.233395141943204
  },
  {
    "score": 485,
    "title": "NEED HELP JUST RANDOMLY GOT 600 SALES",
    "selftext": "so basicallyi run a tiktok shop,  I sent a few free phone cases out to ppl to make vids, and one of the vids got 600k views. Problem is i was just ordering them on aliexpress for 3$ to the  customers house and selling them for 11.99 (20% comission to creators). now i stayed up all night filling out orders and im not even halfway there and at this point its impossible to keep track of them all.  \n\nI tried linking my product to a shopify shop and i did successfully so now all my new orders go into shopify but i still have like 380 orders sitting here.  I tried using AutoDH to automate the shipping in Shopify and then Shopify will fill it out on tiktok and it worked. for one order.  100$ later and countless hours with shopify/autods tech support and i dont think im going to get this to work. Is there an easier way to get there backed up orders shipped and also to automate new ones? \n\nplease help i didnt expect this (i will give someone 10% of all future cases sold if they set me up with a good automation) ily heros\n\n\nedit: i hired a chinese lady for 1$ an order to find me a supplier and fill out all future orders. she will also do all my built up orders for me.  the supplier is about 1.50 more expensive im not sure how but i raised my price 4$ on my tiktok shop and im still getting orders.  i also messed up all the settings i think trying to automate it myself so im going to have to fix that. \n\nedit edit: used an affiliate outreach bot called ttinit that got me the viral vid. ",
    "subreddit": "dropship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 485,
    "downs": 0,
    "created_utc": 1742072059.0,
    "media": null,
    "is_video": false,
    "num_comments": 164,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.5153782413692465
  },
  {
    "score": 400,
    "title": "How I crushed Q4 on my Etsy dropshipping store",
    "selftext": "I'll give some high-level details on how it worked for me because I'm seeing a lot of frustrated people out here.\n\n[YTD Sales](https://imgur.com/a/hMR5tcw) \n\n[Q4 sales](https://imgur.com/a/64osaTu)\n\n1. Focus on the big idea. I started my store in October of 2022 with a strong concept for a BRAND, not a winning product. I design really dumb novelty t-shirts in a specific theme and target only that niche. If you are searching for a trending product it's already too late. My niche has infinite vertical scale potential because it’s focusing on a subject, not one product. I'm trying to pump out hundreds of designs next year before Q4 2024.\n\n2. SEO. I went hard on strong copywriting and good imagery. I figured I could dominate my niche on the platform if I could get my stuff placed in search results by the algorithm. Play the long game of writing good SEO. I now rank #1 or first page results organically across the niche. I use mockups but they are GOOD mockups with eye-catching thumbnails. Had a low daily ad budget during the holiday because I didn't need it. \n\n3. Throughout the year I kept uploading new designs. Also Made variants of the best sellers, rinse &amp; repeat.  \n4. Offered customization products to boost customer service requests. This usually leads to them leaving a positive review for my store because I'm super responsive and nice to people when they have requests.\n\n5. Always have an active discount offer and free shipping. Do not sleep on abandoned cart discount flows etc...\n\nOverall, people need to feel a connection to your product and trust the source... especially if you are selling random crap on the internet. It took a while for it to ramp up in the search results but once a few sales came in, Etsy promoted my seasonal holiday stuff and it did well. Not life-changing money but it did offset expenses this year. Looking to continue to grow this thing and squash my margins.",
    "subreddit": "dropship",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 400,
    "downs": 0,
    "created_utc": 1703016875.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.366780020448064
  },
  {
    "score": 389,
    "title": "[Detailed guide] How I made $11K in profit with a print on demand product ",
    "selftext": "If you think print on demand is saturated, please read on.\n\nI will describe in detail how I generated over $11K in profit with a method that eventually ended up becoming more than a side hustle.\n\nAt the time I was still working a 9 to 5 and life was tough. Money was always short at the end of the month, and I had to resort to all sorts of tactics to come up with some extra income to pay the bills. It was exhausting, to say the least.\n\nOne day I was exchanging ideas with a guy on how to come up with more money and he taught me a cool trick. In a nutshell, it involves coming up with a very basic design to print on a T-shirt where what you use as the design is given to you by the very own people you are going to sell the shirts to. In other words, people tell you what they would like to see on the design (sort of) and all you do is make a design with that and sell it to them printed on a shirt.\n\nSo, how does it work?\n\nYou start off by making a simple post on social media. I like to use Facebook for that, because people on there seem to have more time to interact with content. At the time I didn't have a large following, so I created a new Facebook page around a certain profession. You don't have to necessarily do this for a profession, a hobby like fishing or knitting will work equally well. This works for almost every niche (a niche is a group of people who are passionate about a certain topic or interest).\n\nYou will understand why it had to be a Facebook page and not my personal profile in a minute. This method works best with people who are passionate about a hobby, profession, or even a life event (pregnancy, engagement, wedding, etc.). I recently did this for one of my niches (drummers), so I'll use that as an example. I'm a drummer myself, so it made sense I went with that. If you need inspiration for choosing a niche, there are various free guides available online.\n\nThe post I made on my Facebook page was a very short line of text: “You know you are a drummer if… (comment below)” OR \"Drummers never die, they... (comment below)\" etc.\n\nYou'll want to find a phrase about anything that characterises people in that niche. How do you come up with these phrases in the first place? Just search Google images for \"Funny NICHE shirts\" (e.g. Funny Drummer shirts) and look for any designs that say something about those people in general, like the 2 examples above. You may not find designs like that for every niche, but if you research popular ones like fishing, nurses, cats, etc. I'm sure you'll come across a few that may fit the criteria. The 2 phrases I mentioned above can be adapted to any niche and I'm sure you'll be able to uncover more phrases out there.\n\nThat's it. All of this may sound stupid, but if people are really passionate about their profession or hobby, they are going to leave funny comments on your post. If you don't have a large following on social media to leave the post on, you can invest $5 to $10 to promote that post so that it reaches a large audience. If you want to use Facebook ads, boost that post. I did pay around $15 when I did this and that’s why I used a Facebook page.\n\nHere's how that works:\n\n1. Publish the post on your Facebook page\n2. Click the \"Create ad\" button below the image\n3. Let AI do the heavy lifting to reach the right audience. Make sure to set your target countries (by default only the country you're in is shown)\n4. Set a budget of up to $15\n5. Click Publish\n\nThis can work equally well on Instagram or any other social network for that matter. But I have only tested it on Facebook. Wait until you have a large number of comments (I was able to gather over 80 comments with roughly $15 spent on a post boost). If you have a very large page or profile, you don't even have to spend anything on advertising. The goal is to have as many comments as possible, with the least amount of money spent.\n\nWhat you will see is that some of the comments will get many likes or replies from others who see them. That's an indicator of relevance/popularity. So what you do is copy all those comments and paste them in a spreadsheet and sort them by relevance (number of reactions).\n\nTake the 10 most popular comments and put them aside. You are going to work on them later. If you only have a high number of reactions on one or two comments, use your common sense to pick the remaining 9 or 8 that seem most funny or relevant to you.\n\nNow you are going to make a shirt design using Canva (you can also hire someone on Fiverr). I don’t have many design skills so I hired someone for $5. The design is simply going to be (in my case): \"You know you are a drummer if… (list the most relevant comments you gathered)\".\n\nOnce you have the design file, you can go to a free website (there are many out there - I could mention some in here, but I'm not sure if that's allowed) and upload it to a simple T-shirt, mug, tote bag, etc. I'll post an image of how the shirt design turned out in the comments.\n\nThis is how the whole print on demand process works:\n\nThese websites let you upload your newly created design files to a product page that is fully developed and ready to go. You literally only have to upload your design file, choose the product types and price you want to sell the items for, select the color options you want to make available to your customers and create a short description for your products. That’s it. From that moment onwards, you have a beautiful landing page where customers can buy from.\n\nOnce a customer lands on the product page and buys an item, the website collects the payment, deducts their product cost and pays you the difference. That’s your profit. They take care of the printing, shipping and customer service for you.\n\nThis business model is called print on demand, because the items only get printed after a customer places an order. If you don’t want to use those websites, you can also sell apparel using your own online store. Many sellers also choose marketplaces.\n\nNow you need to promote that shirt. In my case, I used Facebook ads and created a simple sales campaign with a $10 daily spend. 2 ad sets, 1 interest in each, $5/day per ad set. The ad image was a simple mock-up image of the shirt.\n\nOf course there are no guarantees, but I was able to generate 4 sales within the first 24 hours, which allowed me to pay for the first day of advertising, leaving a nice profit for the second and third. And so on. From there things kind of snowballed and I gradually spent more money on advertising, making back more than I was spending. Eventually I reached $22K in sales, of which $5K was ad spend. After subtracting around $6K in product costs, that left me with $11K profit. I stopped there because of diminishing returns at that stage.\n\nI have since replicated this method many times. It's a question of trial and error, there are some hobbies or professions this works well with and others it does not. But then again, it also depends on how much you are willing to invest upfront to gather the initial feedback/comments.\n\nObviously you can use any other ad platform that works best for you, what I wanted to show you was the method used to sell people products they connect with at an emotional level.\n\nThe method I described  is just one of many I use to make good money from print on demand and it has been a great way to make a few bucks here and there for the last 11 years and I still use it. Happy to answer any specific questions in the comments.\n\n",
    "subreddit": "dropship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 389,
    "downs": 0,
    "created_utc": 1720192349.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.332483219379085
  },
  {
    "score": 386,
    "title": "Made my first $500 in sales",
    "selftext": "I don't see many posts like these, so I thought I would share this for inspirational purposes. I would post a screenshot, but it looks like this sub doesn't allow it. \r\n\r\nDropshipping works. You just have to put the work in. I've been working on this everyday. No it's not 50k in sales, but I'm sharing my hard earned milestone to show you realistic success. I am far from profitable, but tracking my progress is what keeps me going. I am on the road to my first 1k in sales and I will update everyone when I get there.\r\n\r\nGood luck to everyone's journeys! I am far from being a 'guru' or expert, but I am open to share everything I've learned so far, so lemme know if you have any questions!",
    "subreddit": "dropship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 386,
    "downs": 0,
    "created_utc": 1707338991.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.3813466128467935
  },
  {
    "score": 319,
    "title": "Tiktok dropshipping is a moneyprinter",
    "selftext": "Tiktok is printing money right now.\n\nJust when I thought dropshipping was getting difficult, Tiktok shop became the thing.\n\nand this method that I am going to inform you about is absolutely insanely easy you just need to find yourself a good product that you can dropship.\n\n1. consumable products are actually the best, like so easy to sell because you can easily contact a creator and have him do a promotion to your product and try it.\n\n  \nShilajit, beauty oils have done very very well.\n\nI am now exploring a big opportunity with multiple cooking creators for food products.\n\nif you are dropshipping get into tiktok",
    "subreddit": "dropship",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 319,
    "downs": 0,
    "created_utc": 1752436455.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.198863227290218
  },
  {
    "score": 317,
    "title": "Here’s how I verify if a supplier from China is legit in under 10 minutes",
    "selftext": "I’ve been burned before (fake MOQ, fake certificates, middlemen pretending to be factories). Over time I came up with a 10-minute filter I run *every single supplier through* before I even bother chatting with them. Sharing in case it saves someone here headaches:\n\n1. **Check the factory address** – if there’s no physical factory location listed, they’re almost always just middlemen. A legit supplier will proudly list their booth, showroom, or factory address.\n2. **Cross-verify on multiple platforms** – don’t just trust Alibaba. Plug their company name into Google, 1688, or even social media. If nothing consistent shows up, red flag.\n3. **Look at product depth** – a true factory specializes. If they’re selling yoga mats, dog leashes, and LED lights all in one store, they’re reselling, not producing.\n4. **Certificates &amp; business license** – request it. A real supplier won’t hesitate. Middlemen usually stall or send blurry docs.\n5. **MOQ &amp; pricing logic** – factories have minimums that make sense. If someone offers 2 pcs at “factory price,” they’re not a factory.\n6. **Sample policy** – always ask for a sample before committing to any MOQ. Factories expect this. Middlemen often dodge, delay, or send you something low-quality.\n\nI run this whole checklist in under 10 minutes now. Saves me hours of back-and-forth with people who don’t actually control production.\n\nHappy to answer questions or share more.",
    "subreddit": "dropship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 317,
    "downs": 0,
    "created_utc": 1755616632.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.126502745176254
  },
  {
    "score": 304,
    "title": "$1k / day milestone in 2 months",
    "selftext": "My first $1k day since I started my store back in Feb… it took a lot of work, learning, trial and error and so many ups and downs… days i thought i would get rich and days i thought to myself this aint never gonna work and almost call it quits…. I didn’t know i was bipolar until i started dropshipping. Anyway, my net profit is at around 25% after all the expenses including ad spent. Everytime i try to scale my campaign it went to shits… i tried duplicating ad sets and doubling the budget, both didnt work for me. And recently, I’ve been increasing budget by 10% carefully every 2 days, trying to scale slowly and it seems to be working. Hopefully one day i’ll reach $10-20k days. Just very grateful at the moment and wanted to share. Thanks for reading and have a good day or night wherever you are.",
    "subreddit": "dropship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 304,
    "downs": 0,
    "created_utc": 1680410808.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.212685706479909
  },
  {
    "score": 295,
    "title": "Made $14k this week dropshipping",
    "selftext": "I see a lot of people claiming big numbers on here but who knows if anyone here is actually doing anything. Is this enough to make me a guru? My best tip is to not launch a drop shipping store until you are sure that EVERY part of it is perfect. Store, product page, ads. Otherwise, it won’t work. Been hitting a few thousand per month regularly but this is an all time high for me. But don’t get too hype, it’s around ~35% profit margin. But still quite good for basically 1 day of set up and then just scaling. \n\nProof- https://postimg.cc/SY9bx3gS\n\nAlso, unless you’re organic dropshipping, don’t expect to hit these numbers with just a $500-$2k budget. Scaling ads and fulfilling orders costs $$$. Not saying you can dropship with that much, but you really have to play it safe",
    "subreddit": "dropship",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 295,
    "downs": 0,
    "created_utc": 1714193116.0,
    "media": null,
    "is_video": false,
    "num_comments": 186,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.267212514327189
  },
  {
    "score": 282,
    "title": "$0-$1000/Day in 4 Simple Steps",
    "selftext": "This may sound like a dream for a lot of you beginners but trust me it is much more easily attainable than you think, however before I dive into that, let me share what most drop shippers think they need to do in order to build a successful store and why they fail.\n\nHere’s what most drop shippers think they need to do:\n\n&amp;#x200B;\n\n* **· Find a unique new product to sell**\n* **· Find the perfect niche from the start**\n* **· Build a “Dropshipping” Store**\n* **· Launching Facebook ads will bring sales right away**\n\n&amp;#x200B;\n\nTHESE ARE THE EXACT THINGS YOU WANT TO AVOID\n\nConfused? Let me explain\n\n  \n\n* **Product Research**\n\nYou don’t need to find a new unique product to sell, you don’t have to reinvent the wheel when it comes to finding winning products.\n\nFind products that are already selling and are showing potential, you need to look for demand for the product in the market, as this will give you proof that people want to buy that product which means when you start selling it, there is a very high chance you’ll find success with it.\n\n  \n\n* **Finding the Perfect Niche from the Start**\n\nWhen you are doing product research, do not limit yourself to any specific niche and quite honestly you don’t even want to focus on the artist.\n\nThe reason why I don’t recommend you put a lot of focus on the niche at the start is that when you are first starting out and just getting into product research, you should be focused on first finding a winning product, when you limit yourself with a niche right away, you limit the potential of finding a winning product.\n\n   \n\nDo product research market-wide across all niches and once you have a winning product then double down into the niche of that product.\n\n  \n\n* **Don’t Build a “Dropshipping” Store**\n\nYou might be thinking I’m crazy to say you shouldn’t build a dropshipping store, but here is what I mean:\n\nYou want to focus on building your store to be portrayed as a real brand and not a dropshipping store, if you build your store just like another dropshipping store, guess what? Your potential customers will realize you are dropshipping and not buy from you because customers have become smart and recognize a dropshipping store when they see one.\n\nYou have to focus on building a store with a brand persona, that looks like a real brand and connects with the potential customers on a personal level which will help build trust and trust = sales.\n\n&amp;#x200B;\n\n* **Launching ads with no purpose and strategy**\n\nYou can’t just launch some ads and expect to get sales, you need to have a proper marketing plan and strategy. Each of your ads should have a set purpose.\n\nStart by launching testing ads and while testing, don’t jump from one product to another quickly. You need to give each product enough testing time.\n\n  \n\n* **Most people run ads for just 1-2 days and from the result of 1-2 days they decide if they should kill the product and move on or continue**\n\nThe result of this strategy is they keep jumping from 1 product to another in an amount of 2 days without even properly testing any of them and they keep jumping from one product to another in the hope of the next one being the winning product which is completely the wrong way.\n\nIn this process of rushing and testing these multiple products without any results, they end up losing money which leads to them not seeing any results and them getting discouraged, disheartened, and they start to give up on dropshipping without putting any actual effort into properly testing a single product.\n\n  \n\n* **Remember you need to treat dropshipping like a real business and do each things properly, from product research to store design to marketing**\n\nI hope this helped you, if you have any questions feel free to leave them in the comments below and I’d be happy to help\n\nWish you all the best.",
    "subreddit": "dropship",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 282,
    "downs": 0,
    "created_utc": 1681122696.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1433503623241394
  },
  {
    "score": 272,
    "title": "You don’t need a $5k course to learn FB ads.⭐️",
    "selftext": "You don’t need a $5000 course to learn Facebook Ads.\n\nI have 5x the growth of several companies with it.\n\nHere’s everything you need to know to crush FB Ads:\n\n1/ Follow the rule of 3-5.\n \n&gt;&gt; Never have more than 3-5 Active Campaigns.\n&gt;&gt; Never have more than 3-5 Active Ad-sets in each campaign.\n&gt;&gt; Never have more than 3-5 Active Ads in each Ad-set.\n \nThis rule will help you scale a lot.\n\n\n2/ Your Ads should answer, \"What, exactly, will customers achieve?\"\n\nIt's not: \"Buy shampoo for hair fall.\"\n\nIt's: \"Say goodbye to hairfall in just 7 days &amp; get silky smooth hair.\"\n\nOutcome clarity is critical.\n\n3/ People love free.\n\nSo instead of saying: “Get A, B for $45 + $4.99 for shipping”.\n\nYou should say: “Get A for $45 &amp; We’ll include B &amp; free shipping if you order right now.”\n\nSimple yet very effective.\n\n4/ Never start from scratch, Use different frameworks for creating ads.\n \n- Pain, agitate, solve\n- Hook, educate, sell\n- Attention, interest, desire, action\n \nFrameworks will allow you to churn out creatives really fast &amp; you’ll never run out of creative ideas\n\n5/ Create a personal swipe file:\n \nWhenever you see a great\n \n&gt;&gt; landing page\n&gt;&gt; Ad\n&gt;&gt; Ad-Copy\n&gt;&gt; Advertorial\n \nSave it in your swipe file.\n \nSo whenever you’re creating for yourself, You’ll have 100’s of inspiration\n\n6/ Elements that make a great ad:\n\n• 4:5 aspect ratio\n• Add subtitles\n• Bright Lighting\n• Compelling graphic\n• Right Text\n\nMake your video engaging &amp; worth viewer’s time\n\n7/ Once you’re done creating your campaign.\n\n&gt;&gt; Go through campaign, Ad-set, Ads again\n&gt;&gt; Check Budget, Location, Targeting\n&gt;&gt; Check Headline, Primary text, UTM Parameter &amp; Links\n\nEven a single mistake can ruin your whole campaign, Double-check everything.\n\n8/ 80% of people don’t even watch 3 seconds of your ad.\n \nYou need a pattern interrupt to get someone to watch it.\n \ne.g.:-\n \n\"Discovering THIS has been an absolute game changer\"\n \n&gt;Did You Know? [STATISTIC/FACT].\n \n\"I can't believe what I did until I did THIS.\n\n9/ Create 5 different ads from single ad\n \n&gt;&gt; Take your best performing creative \n&gt;&gt; Note 5 different sales angle your audience resonates with\n&gt;&gt; keep ad same, Just change first 4-5 seconds in creative\n \nYou don't need new creatives, Utilise your assets wisely\n\n10/ Never create ads based upon what you product is made of.\n\nAlways create ads based on problems your product solves.\n\nOutcome clarity is critical.\n\n11/ 70% of people watch your ads while the sound is turned off.\n \nIf you’re not adding captions to your ads then you aren’t able to communicate with those people.\n \nSo make sure whenever you’re making an ad-creative, Add a caption to it.\n\n12/ The ultimate hack to Facebook Ad is *Testing*.\n\n• You Test 10 ads, 9 are meh, 1 scales your Ad-Account\n\n• You try 10 different hooks, 9 don’t work, 1 scales your Account\n\n• You get creative from 10 different UGC creators, 9 you never see again, 1 creates all creatives\n\nSuccess with ads is more random than it seems. Test More.",
    "subreddit": "dropship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 272,
    "downs": 0,
    "created_utc": 1726067635.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.916843493957892
  },
  {
    "score": 258,
    "title": "Here are 10 Million-Dollar Shopify stores you can copy (Complete Breakdowns)",
    "selftext": "I used [myip.ms](http://myip.ms) to find extremely successful Shopify stores, all doing over $1 Million yearly.\n\nI also used a ton of other tools to completely break down their marketing strategies.\n\n1. HobbyCo - [https://dsweekly.com/brand-reviews/hobbyco-brand-review/](https://dsweekly.com/brand-reviews/hobbyco-brand-review/)\n2. Cult Gaia - [https://dsweekly.com/brand-reviews/cult-gaia-brand-review/](https://dsweekly.com/brand-reviews/cult-gaia-brand-review/)\n3. Cratejoy - [https://dsweekly.com/brand-reviews/cratejoy-review/](https://dsweekly.com/brand-reviews/cratejoy-review/)\n4. Orange Monkie - [https://dsweekly.com/brand-reviews/orange-monkie-brand-review/](https://dsweekly.com/brand-reviews/orange-monkie-brand-review/)\n5. Lazy Oaf - [https://dsweekly.com/brand-reviews/lazy-oaf-brand-review/](https://dsweekly.com/brand-reviews/lazy-oaf-brand-review/)\n6. Arrae - [https://dsweekly.com/brand-reviews/arrae-brand-review/](https://dsweekly.com/brand-reviews/arrae-brand-review/)\n7. Dovetail Workwear - [https://dsweekly.com/brand-reviews/dovetail-workwear-brand-review/](https://dsweekly.com/brand-reviews/dovetail-workwear-brand-review/)\n8. Brillia - [https://dsweekly.com/brand-reviews/brillia-brand-review/](https://dsweekly.com/brand-reviews/brillia-brand-review/)\n9. Tocco Toscano - [https://dsweekly.com/brand-reviews/tocco-toscano-brand-review/](https://dsweekly.com/brand-reviews/tocco-toscano-brand-review/)\n10. Moxi Skates - [https://dsweekly.com/brand-reviews/moxi-skates-brand-review/](https://dsweekly.com/brand-reviews/moxi-skates-brand-review/)\n\nI really think learning from what these guys are doing can help you beginners out there make decisions more easily. Simply copy their strategies, improve on them, and use the knowledge to make your own dropshipping store succeed.",
    "subreddit": "dropship",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 258,
    "downs": 0,
    "created_utc": 1727084769.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9278337862563895
  },
  {
    "score": 249,
    "title": "The average SEO plan costs $2,819 per month. How to do SEO for your Dropshipping site for $0 AND better than 90% of SEO “experts”.",
    "selftext": "I’m sick of SEO companies making a bad name for the industry. There’s a lot of good companies out there but there are also a bunch of companies that don’t know what they’re doing. So, I want to give you all the basics of SEO as a DIY guide.\n\nI am going to take a random e-commerce site and show you how to target over $10,000 each month using ONLY SEO with a grand total cost of $0. Wait till the end to see how I get to the $10,000 number, more precisely: $10,252.\n\nI wrote in my first post about the importance of keyword analysis, and in my last post about the 4 principles of SEO. Today, I want to show you step by step exactly what you can do to transform your site without spending a single penny.\n\n\\*\\*Is SEO still important for e-commerce sites?\\*\\*There are roughly \\~50 Billion google searches happening every month, just in the USA. Out of that, 10% of searches are transactional. People searching to buy something.\n\nThat means each month you get **5 billion searches** on someone wanting to buy something through Google. I do think this is declining in power. However, there is nothing better than a customer specifically looking to buy your product.\n\nThis guide will focus first on Keyword Analysis, to Technical SEO, to backlinks, and finally ending on content. Just these 4 sections and **bam** you’re an expert.\n\n# 1st section: Keyword Analysis Like a Boss.\n\nI like to call my Keyword Analysis Process the **ABC process. A**ssociated, **B**road, **C**ompetitor.\n\nBroad: Capturing general keywords relevant to your product.\n\nCompetitor: Analyzing and leveraging the keywords your competitors are successfully using.\n\nAssociated: Identifying related keywords that resonate with your target audience's interests and searches.\n\nLet’s start with how to find keywords, period. There are a few online tools that help with keyword analysis, like Ahrefs, MOZ, &amp; SEMRush. I’m using SEMRush because it’s honestly what I’m used to (not sponsored or affiliated). It’s expensive but you can use a 7 day free trial.\n\nSo, our random shopify site sells drumrolls please … stainless steel straws (love the alliteration!). Go to the keyword magic tool in SEMRush and type in stainless steel straws. I like to select **Broad** Match.\n\n**Broad**\n\nHere focus on 2 things: Volume and KD% (KD means difficulty – the lower the easier). This is the Broad part of the Keyword strategy.\n\nAssuming you are a pretty new site, I would find the keywords with high enough volume but low difficultly (no…duh!). “Stainless steel straws” gets 1,300 searches and has a difficulty of 27% (anything under 30 is considered easy). So, this keyword is great- Lots of searches directly related to our product and an easy rating. I’m going to save this.\n\nNext one that catches my eye is “stainless steel metal drinking straws” 210 searches and 23% difficulty. Then there is “stainless steel straws made in usa” 70 searches and 18% difficulty.\n\n**Why would we even target such low volume terms?** We want to cast a wide net. We don’t want to focus on only one keyword, but multiple that can work out. A rising tide lifts all boats, and the same applies to Google. Once a few of your keywords start ranking, other keywords go up as well (sometimes).\n\n**Competitor**\n\nOk so we have a few keywords. Now lets move onto the **Competitor** part of the process. I checked out some of our competitors who are already ranking high for “Stainless steel straw”. To analyze the competitor further I got to Domain Overview and input their URL. One of these competitors gets 15K visits per month through SEO (let’s catch them!).\n\nTo see all the keywords that your competitor is ranking for- go to Organic Research and type in the domain. One of the keywords they are ranking for is “how to clean a straw” (1,900 searches and 34% difficulty). This is a straightforward blog post that we can write and try to compete.\n\nAnother competitor is ranking for “stainless steel drinking straws” (210 searches and 16% difficulty), and metal straw (1,300 searches at 29% difficulty).\n\n**Associated**\n\nThe next way to find a keyword is to look for **Associated** keywords. These are keywords not DIRECTLY related to your product, but could be useful for your potential customer. For example, if someone is looking for stainless steel straws, maybe they are people who are trying to live plastic free lives.\n\nSo I would search plastic free on keyword magic tool. From here I see a few easy to rank keywords such as “plastic free deodorant” (880 searches and 11% difficulty). Creating a blog on this is a great option ranking different plastic free deodorant options could work.\n\nTo summarize the keyword strategy, it's as simple as ABC: **A**ssociated, **B**road, &amp; **C**ompetitor. There we have it; these three strategies should get you all the keywords you could need.\n\nIdeally you do this each month, but since we only have the free trial for 7 days- let’s try to do a lot of these in bulk. Keep doing this until you either have 25 keywords or 20,000 in solid volume to rank for.\n\nTo add a bit more accuracy you need Google Keyword Planner and you need to actually Google some of these keywords. You get access to Google Keyword Planner if you are doing any $ amount in Google Ads. It gives a better estimate on Search Volume. Also to get a better estimate of difficulty, actually see the results in the first page and see the Domain Authority of all those websites using a tool like Mozbar. If the first ten organic results have any domains with a Domain Authority under 22, that might be a good one to win. Please note- domain authority is not a real score that Google looks at but rather something created by these companies based on their internal rankings.\n\n*Congratulations-* You are officially a Keyword Connoisseur.\n\n***Total Cost so far:*** $0.\n\n# 2nd section: Master Technical SEO\n\nI will go through this one quick. Technical SEO is making sure that your site is working well for Google to crawl, and is following the general rules that most websites should follow. Go to SEMRush and click on Site Audit. From there, Create Project. Then enter your URL. Feel free to max out the number of pages crawled. Then we wait for the audit to complete.\n\nWhile we wait, let’s confirm that Google can crawl your site. Go to Google Search Console to see all your indexed pages. Some of these pages won’t be indexed as per our own instructions; but ideally your important pages should show up here. If not, which is becoming more and more common, see why Google hasn't indexed them and you might need to request Google to index the page.\n\nSecond, Speed: Make sure your pages load fast without messing up your store vision. Check the speed score on the Shopify admin page. You can use other tools like Page Speed Insights (From Google).\n\nOk by now our Site Audit on SEMRush should be complete. Most Shopify sites will have some errors and warnings. The ones to focus on for me are: Duplicate Content, broken links that point to pages that don’t exist anymore, any sort of error page, and there should be exactly 1 H1 per page.\n\nThere are many more that we can jump into- I would take a look at the why and how to fix it link that shows up on SEMRush. But don’t stress too much on this. Also look to run your site through another free site audit tool just to get a more well rounded view.\n\nCongratulations – You now made sure that your site has passed the Technical SEO Test.\n\n***Total Cost so far:*** $0 + $0 = $0. 2/4 DONE.\n\n# 3rd Section: Backlinks for Free\n\nThis is the most time consuming one to do for free. **Firstly, what is a backlink?** A backlink is like an endorsement from another website. It's a link that goes from their site to yours. This was Googles secret sauce in how to rank sites, that helped it beat its competitors in the 90s.\n\nThe best kind of backlink you can get is one which is from a high quality site which is specifically in your niche. This is the gold standard. Here are some techniques to try to get them:\n\n**Content:** Create something which those sites will want to reference. For example, a research study or an amazing infographic. Do a research study by asking a few of your last buyers certain questions for a coupon.  \n\n**Competitors:** See what backlinks your competitors are getting by inputting their domain in SEMRush under Backlink analytics. Now we try to take these away muhahaha (mojo jojo voice). Use the skyscraper technique (google this) as one way to do it. Or look for broken links and have the backlinks come to yours instead. \n\n**Contact:** Reach out to those sites in your niche and try to see if you can send them your product and have them review it/provide feedback. You can also ask them if its ok for you to guest post on their site on a topic which you are an expert on. In that guest post you can link to your site (by asking them of course). How to find their contact details: SEMRush's linkbuilding tool. \n\nIn reality though, the only C that matters in backlinks is **Cash.** Even if we do all the things, a large portion of site owners will require payment for any sort of backlink. It's a harsh reality in SEO. So here are some other things that can be done for free by you the business owner:\n\nIf you have a specific business location, get a Google Business Profile for your business. Many other sites scrape Google Business Profiles which can get you more links for free.\n\nFor Shopify Sites one easy backlink is to post on the Shopify Community. You can just post on Store Feedbacks and link your URL to get feedback on your site. This gives you a link from Shopify (though it is a nofollow link, but it \"might\" have some value). Make sure that in your post you very clearly post a URL to your site.\n\nThe next strategy is more basic. Find a list of social media sites and create a profile on those sites. Usually, most of them allow you to add a URL to your profile. Adding a Trustpilot page, BBB page, Yelp page and other directory pages might help (mostly low value though). Honestly, you can even ask Chat GPT for a list of 50 free sites to get backlinks.\n\nThis is the only thing in SEO I wouldn’t mind outsourcing. The way I would outsource this is find a \"backlink outreach expert\" on upwork and have them reach out to sites specifically in your niche and then keep a separate budget ($100 per link as an example) to entice those site owners to allow you to do a guest post. \n\nThere’s a lot more to backlinks that we can get into, but your site can rank high for most easy keywords even without the best backlink profile (in my opinion).\n\n**Total Cost so far:** Still $0 (kinda).\n\n# 4th section: Content for $0\n\nWe have our list of keywords. We have made sure our site hasn’t made any faux pas through technical SEO. Now how do we actually rank for these keywords. First step – SEO Optimized content.\n\nWe do this by creating pages, blogs, or updating product pages to target that specific keyword. In our arsenal we have:\n\nTitle, Meta descriptions, URLs, Headers, Alt tags, Image URLs, and paragraph content that we can update to specifically target that keyword.\n\nSo this is where a little more art comes into place. There’s no exact right answer, but what we need to understand is that each keyword you have selected should be targeted somewhere specifically.For example, “stainless steel straws made in USA” can be targeted in a new page. So from the title, to the header, to the image alt tags, and to the paragraphs we can try to incorporate this keyword. Make sure your content is human readable + high quality.\n\nFor the “plastic free deodorant” keyword, we can create a blog that lists out the 5 best plastic free deodorants (that actually make you smell like something other than coconuts). This can be a fully informational high quality content piece that anyone looking to buy a plastic free deodorant should know about. While creating content pieces go into semrush and see if there are any other smaller volume keywords which can be subsections. Under the keyword magic tool input “plastic free deodorant” and check on broad match. A couple that stand out are: “best plastic free deodorant” (110 volume &amp; 13% KD), “tom’s plastic free deodorant” (70 volume and 7% KD), and “old spice plastic-free deodorant” (70 volume and 24% KD).Two more concepts to understand here:\n\n1. Don't stuff the keyword like \"Stainless steel straws made in USA\" all over the page. Google looks at Semantic Relevancy, which is just a fancy way of saying use other words that make sense for this specific keyword. So, using related words (even if we are not targeting those specifically) can help Google understand EXACTLY what this page is about. The more clarity Google has, the better. Using words like \"American made straws\" or \"local manufactured stainless steel straws\" will help Google by giving it more context about what this page is really about.\n2. Use Entity Salience in your content, which takes this one step further by providing relevant entities (like people, places, organizations, concepts) that can be incorporated in your content. So if our keyword is \"stainless steel straws\" a relevant concept is sustainability or plastic pollution. Basically, entity salience is a more specific entity (think \"George Washington\" or \"freedom\") which can be part of the content as well.\n\nIn writing the content: The best use case for ChatGPT is to find a full outline of the article when you’re stuck. I prompt ChatGPT with something like this: You are a world class content writer from here on. Your style is to be informative and journalistic while being entertaining as well. Help me create an outline for an article on plastic free deodorant. Some keywords we are targeting are best plastic free deodorant, toms plastic free deodorant, and old spice plastic-free deodorant.\n\nI wouldn’t use ChatGPT output content because I’ve seen Google Not index certain pages if they have too much AI content. Also, honestly ChatGPT is the worst writer. It’s not easy to read and it’s obvious to anyone reading that this has come from ChatGPT (I see you all those Linkedin messages!).\n\nVoila. You are an expert on all things SEO. The King of SEO. \n\n**Total Cost for all SEO:** $0. wow\n\n**Why even go through all this effort?**\n\n# Monthly potential value of doing all this for your Shopify Site?\n\nEven for a small product like stainless steel straws with an average order size of $25, we can get to over $10,000 in monthly revenue JUST from Organic SEO. With just 27 keywords and some average conversion rates we are getting $10,252 in monthly value. PS- all the keywords are easy for us to rank for. These are a few of them:\n\n&amp;#x200B;\n\n|Keyword|Search Volume|% View|Conversion %|Customers|\n|:-|:-|:-|:-|:-|\n|straws|12,100|25%|3%|91|\n|metal straw|4,400|35%|5%|77|\n|water bottle with straw|8,100|40%|1%|32|\n|metal water bottles|6,600|40%|1%|26|\n|metal straw|1,300|40%|5%|26|\n|stainless steel straws|1,300|40%|5%|26|\n|stainless steel water bottles|5,400|40%|1%|22|\n|drinking straws|1,300|40%|3%|16|\n|drink from a straw|1,000|40%|3%|12|\n|glass drinking straws|1,000|40%|3%|12|\n|stainless steel straw|590|40%|5%|12|\n|non disposable drinking straws|480|40%|5%|10|\n|metal drinking straw|390|40%|5%|8|\n|cleaning a straw|1,900|35%|1%|7|\n|stainless steel cup straw|260|40%|5%|5|\n|bar straws|210|40%|5%|4|\n|stainless steel drinking straw|210|40%|5%|4|\n|stainless steel metal drinking straws|210|40%|5%|4|\n|home bar signs|1,000|40%|1%|4|\n|metal drink straws|110|40%|5%|2|\n|metal reusable straw|110|40%|5%|2|\n|reusable metal straw|110|40%|5%|2|\n|are metal straws safe|140|40%|3%|2|\n|reusable stainless steel straws|70|40%|5%|1|\n|stainless steel straws made in usa|70|40%|5%|1|\n|stainless steel reusable straws|50|40%|5%|1|\n|are stainless steel straws safe|50|40%|3%|1|\n\nPaying Customers per month with SEO:\t410\n\nCustomer Lifetime Value: $25\n\nMonthly Value: $10,252\n\nPlease cancel your SEMRush account *btw.*\n\n**PS- I wish I didn't have to input all those columns and rows, it really was a pain.** *But worth it for all you beautiful people.*\n\nPPS - I know these conversion rates and view rates are not 100% guaranteed. These are my assumptions and can be on the optimistic side for certain keywords. Before you come in trying to son me on these, I'd just like to say: You're right. My bad. Good night. Please comment \"wow\" if you found any of this useful at all.",
    "subreddit": "dropship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 249,
    "downs": 0,
    "created_utc": 1705515499.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.049601438732266
  },
  {
    "score": 240,
    "title": "Got my first organic today. I know it’s not a lot but it’s enough to tell me there’s room to scale… also wanted to give a big f*** you to this sub in general.",
    "selftext": "Apologies for the rant but, Its a disgrace and I can say full heartedly, I received NOTHING from this community; and to me, it’s a disgrace to Reddit. There’s no value to be found here except garbage course snake oil salesmen, and people who will project their lack of knowledge through arrogance. Anyone who reads this, I hope it offers you the slightest bit of integrity to be found in this cesspool, and also the tiniest bit of real information. Don’t take the time to ask questions here, and don’t expect answers. You won’t find answers, because based upon my experience, this community doesn’t know. You either don’t get anything of even the most menial value, or you won’t get any response at all, it all depends on how easy a target you are. If I’m being honest, I found more value in the people who are transparent with not knowing much, than I did anywhere else. \n\nIf you’ve read this and you have genuine questions, I’ll try my best to respond and be completely transparent and straightforward about my knowledge. It’s an extensive process, and although I’ll never claim to be a guru or entice people with 2016 drop shipping analytics, I’ll provide anyone with anything that I have to offer and all of the things I spent hours troubleshooting.",
    "subreddit": "dropship",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 240,
    "downs": 0,
    "created_utc": 1717304398.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.01606203607084
  },
  {
    "score": 238,
    "title": "$75K+ Generated at 3.50+ ROAS in One Month",
    "selftext": "I Took this project in October and 1st store of the client failed. then the client made a Christmas base store and in the whole of November month, we got $75k+ Sales with a 20%+ profit margin.\n\nHere is a complete step-by-step funnel breakdown from TOF, MOF, and BOF that I used to acquire this result and you can put it into play today.\n\n🌟Niche: Christmas Products\n\n📈 Ad Spend:\n\nTotal Ad Spend: $20,000+ (FB &amp; TikTok)\n\n💸 Revenue: $75,000+\n\n🚀 ROAS: 3.75+\n\nProfit: 35+%\n\n🗓️ Timeframe: Nov 1, 2023 - Nov 30, 2023\n\n🌍 Country-wise Sales Distribution:\n\nThe majority of sales came from USA, UK, and Canada\n\n🎅 Cold Targeting on Facebook &amp; Tiktok\n\nRan separate campaigns for each product $20 per day per adset (CBO $50 per day ), just like Santa has a gift for every child. Two ads per adset.\n\nRan For 3 Days then analyzed the metrics. After 3 days getting the winning ads Creative. killed the not performing ads creative. and ran the ads for 7 days. Then analyze the metrics for potential products that can perform well. Created new Campaigns for that specific product only.\n\n🎯 Campaign Setup:\n\nCold Targeting:\n\nAdset 1 &gt; Interest 1 &gt; Winning Ads 2\n\nAdset 2 &gt; Interest 2 &gt; Winning Ads 2\n\nAdset 3 &gt; Interest 3 &gt; Winning Ads 2\n\nAdset 4 &gt; Interest 4 &gt; Winning Ads 2\n\nAdset 5 &gt; Interest 5 &gt; Winning Ads 2\n\nAfter getting the winning audiences then launch ads for warm audiences.\n\nWarm Targeting:\n\nAdset 1 &gt; Winning Interest 1 &gt; Winning Ads 2\n\nAdset 2 &gt; Winning Interest 2 &gt; Winning Ads 2\n\nAdset 3 &gt; Winning Interest 3 &gt; Winning Ads 2\n\n🎁 MOF (Middle of Funnel):\n\nCreated custom audiences and prepared for retargeting. Utilize Page Views (PV), Link Clicks (LC), View Content (VC), Add to Cart (ATC), and Video Views (VV) at 75% and 95%.\n\nRetargeting:\n\nAdset 2 &gt; Retargeting &gt; Winning Ads 2\n\n&amp;#x200B;\n\nLLA:\n\nSuper 6 LLA Combined Ads (This strategy will only work if you’re spending around $100+ a day, even so, it will require constant monitoring to make sure things go to plan)\n\nAfter that, I scaled both ways vertically way and horizontally both ways after getting the winning creatives and winning interest. then scaled the Supper LLA too.\n\nAppreciate you taking the time out to read and hope you found this valuable. Let me know if you have any questions.\"",
    "subreddit": "dropship",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 238,
    "downs": 0,
    "created_utc": 1707046614.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.0694145705975275
  },
  {
    "score": 232,
    "title": "Update on my TikTok shop: I got banned!",
    "selftext": "You guys might remember my posts from December where I gained over $1k in sales via TikTok shop using SEO, and no promo or ads. \n\n[1st post 24 days ago, ($400+ in sales)](https://www.reddit.com/r/dropship/s/Teslw3VJSs)\n\n[2nd post, $1k+ in sales](https://www.reddit.com/r/dropship/s/Sps7mdA1CM)\n\nSo i ended the year at over $2k in [sales](https://ibb.co/C8v6Y7P). And a few days ago I got banned. My store was doing pretty well. Was averaging 4-5 orders a day sometimes more. \n\nIt was only a matter of time before I got banned, so I’m not upset, TikTok doesnt like dropshippers, I was aware of that. And honestly my shop was running on hopes and prayers lol. They didn’t give me a [specific reason](https://ibb.co/LYZs8t3) but I’m assuming it has to do with late dispatches.\n\nTikTok wants you to ship out an order within 3 days. Obviously with drop shipping that’s kinda sorta impossible. So if you don’t ship within 3 days it becomes a “late dispatch” order, which just means it shipped late. \n\nMy orders usually shipped within 3-5 days tho, and is delivered within 10. Which imo isn’t that bad.\n\nBut anyway, I had a good run and this isn’t the end. I created multiple TikTok shop stores prior to getting banned because I knew i would get banned at some point 🤷🏾‍♂️ lol. So I’m not stressing, I learned a lot of now i know what not to do next time! Plus I was gonna [shut down my store soon anyway](https://ibb.co/cwLdXN9), I wanted to focus on a different niche or a 1 product store.\n\nBut yeah. Rip to my store lol.",
    "subreddit": "dropship",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 232,
    "downs": 0,
    "created_utc": 1704833338.0,
    "media": null,
    "is_video": false,
    "num_comments": 229,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.223219839034815
  },
  {
    "score": 219,
    "title": "TikTok Shop Dropshipping Guide",
    "selftext": "Hey guys, like many others in this sub i've been in the ecommerce space for a while (the better part of ten years). I've done basically every form of dropshipping on every platform. For the past year or so, I've been focused on dropshipping on TikTok and scaling that, so I thought i'd share what I've learnt:\n\n1. **Product**: Amazon. I hire a VA to find products on Amazon and list them on TikTok shop. This means household, brand names. You're allowed to do this on TikTok Shop. Also, it doesn't have to be brand names, but it helps get organic search sales. \n\n2. **Marketing**: UGC ads always do the best. I've been using AI to make UGC ads so I can test which creatives work the best quickly, and I don't have to wait for turnaround time on ad creatives. I use [bestads.ai](http://bestads.ai) as that one seems to work the best for me. I take these ads and post them on the tiktok account, and also run ads with them. can be used anywhere, not just tiktok. I also do send the occasional affiliate package out, but only if it's somebody really big. I don't waste time with small creators because it's an absolute and hasn't converted for me.\n\n3. **Fulfillment**: Like I said it's all on Amazon, but unfortunately TikTok shop doesn't recognize Amazon tracking links, so you're going to have to use a third party platform like [tracktaco.com](http://tracktaco.com) to finesse that part of it. \n\nLet me know if you have any questions, about my experience with tiktok shop, any other platform, or anything really\n\n",
    "subreddit": "dropship",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 219,
    "downs": 0,
    "created_utc": 1724878482.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.0195385406876945
  },
  {
    "score": 222,
    "title": "My store has turned over £2K in 3 days, should I feel worried?",
    "selftext": "Hi all,  \n\n\nVery bizarre post and I'm not trying to brag, I've found a great product on Aliexpress that is trending all over TikTok, I've setup a Google shopping add and there is little stock on Amazon and other U.K retailers so I'm gathering some traction.\n\nI'm worried because it's CNY (Chinese new year), customers will start requesting returns unless their orders are shipped ASAP, although the product has 5 star reviews and said shipping times are fast.  \n\n\nNo idea why I'm feeling anxious, should I be just embracing that my store has started to pick up?  \n\n\nThanks\n\n&amp;#x200B;",
    "subreddit": "dropship",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 222,
    "downs": 0,
    "created_utc": 1708035906.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.963711659188556
  },
  {
    "score": 213,
    "title": "Store shut down at $30M in sales",
    "selftext": "Our store got hit with an onslaught of fake DMCA claims and Shopify shut our store down after 2 years and $30 million in sales. Our legal team was able to get it resolved, but now the issue is payment processing. Neither Shopify payments (or stripe) will approve me or my partner. The ban must be tied to our social or EIN because they're fine with the business and business model. Anyone know of any other reliable processors?\n\n\\--\n\n**Update**: Getting a lot of DMs. If you're reading this in a similar situation - seems the biggest players are Shopify Payments, Stripe, Auth.net and resellers of Maverick Payments. Maverick appears to be the go-to when all else fails. High chance of approval but also a high chance of a 10% (or so) reserve. We have a few calls scheduled next week.",
    "subreddit": "dropship",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 213,
    "downs": 0,
    "created_utc": 1710599368.0,
    "media": null,
    "is_video": false,
    "num_comments": 153,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1216741337674225
  },
  {
    "score": 196,
    "title": "YouTube isn’t teaching you anything - it’s making you weaker while gurus get richer",
    "selftext": "I don’t waste my time watching YouTube videos - total waste. People sit there, thinking they’re learning - wrong. They try, they fail, they watch another video - then another. Scrolling - hoping for the \"magic answer\" - but let me tell you - there is none. Just wasted time. You don’t win by watching - you win by doing. That’s the difference.  \n  \nAnd these so-called gurus? They don’t care if you win. They slap affiliate links everywhere - push their own software - hype their garbage courses. They are the only winners. You? Still the same - maybe thousands of dollars poorer. They don’t do dropshipping - they fake their numbers. Real e-com players don’t waste hours making videos - they’re too busy making money.  \n  \nMost of you will keep watching. Keep waiting. Keep hoping. But the ones who get it? They’ll shut the shit videos off - and they’ll start. Those are the ones who actually make it.",
    "subreddit": "dropship",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 196,
    "downs": 0,
    "created_utc": 1740829724.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.0051625687407055
  },
  {
    "score": 195,
    "title": "How to make $3k in a day.",
    "selftext": "If you want your Shopify store to generate $3000 per day in sales..\n\nYou don’t need product awareness, \n\nYou need problem awareness ads,\n\nProduct awareness is just talking about the solution to a problem, \n\nBut, a big portion of your potential cold audience doesn’t even know they have a problem or pain that your product solves,\n\nEducate them on their own problems - make them aware,\n\nStop obsessing over the product,\n\nFocus on the customer and their problems,\n\nThat’s how you increase your Shopify sales! 🚀",
    "subreddit": "dropship",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 195,
    "downs": 0,
    "created_utc": 1723098520.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7479955298776035
  },
  {
    "score": 186,
    "title": "How I made $0 in my first 2 years of dropshipping",
    "selftext": "So I jumped on the dropshipping wave pretty early (around late 2017) and for the first 2 years of my dropshipping and e-com journey, I made $0 and lost alot of money from set up costs to adspend.\n\nThen I started realizing and recognizing a fact! this is not for the lazy.\n\nIF you're lazy and make a store with AI expecting people to buy from you just because you put in some adspend, well then give up on your dreams and go work at McDonald's.\n\nYou need to make engaging content, you need to give people a reason to purchase your products, and sometimes you even need to build and manage a community (if you're running a subscription business). You will never succeed in anything if you're not passionate about it and don't treat it like a real business.",
    "subreddit": "dropship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 186,
    "downs": 0,
    "created_utc": 1742649937.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9829772230562828
  },
  {
    "score": 182,
    "title": "How I pushed 1.2 million in sales last November",
    "selftext": "The most lucrative month in e-commerce starts in a couple of days. There is no greater time than now to double down on marketing. Hopefully, this post inspires you to try something new with your marketing this  Q4.\n\n  \nBefore I get into the good parts of this post here's a quick disclaimer:  \n\\- The 1.2 million that I am referring to in the titles comes from 2 brands that I do not own. However, the 1.2m is from sales that are directly attributed to the marketing channels that I manage.  \n\\- The marketing structures that I used for both brands are almost identical. This is why I grouped them together for the sake of this post  \n\\- I do not manage paid ads but they were running on both of these sites in addition to the marketing that I will mention below\n\n  \nAnother disclaimer, this post has a large focus on backend marketing. The larger the brand, the more important the backend marketing is. So, if you’re currently doing less than 15k/month, I’d recommend putting less effort into the things I speak about below and putting more effort into things like media buying, social media growth, influencer campaigns, etc. In a nutshell, what you probably need is more front-end traffic. \n\n  \nNow let's break down how you can easily do over 50% of your sales in the month of November with back-end marketing. I managed Email/SMS marketing, Reddit Marketing, and Website optimization for these brands. I have already made a post about how I pushed millions with Reddit marketing, so this post will focus on the Email and SMS.\n\n  \nHow I run effective Email and SMS marketing in November\n\n  \n**Week 1 -** This is the ramp-up week. You want to change your marketing from friendly and informational to cut-throat and urgent. The first thing I do is create a new email/SMS pop-out for the brands. Keep the text simple, something like “Do you want 10%? – subscribe to our mailing list for exclusive Black Friday Deals” works better than more wordy pop-outs. Next, I update the automated flows, I add timers (This can be done easily using sites like Sendtric for HTML timers) to the abandoned cart emails and add a BFCM month banner to all of the emails. This adds urgency and makes them feel like they are getting a good deal regardless of when they buy during the month. You can also butter up VIP customers with an early access sale at this time. It’s also a really good idea to add a free gift to orders during this week, it doesn’t have to be big. You just want to be in your customers' good books if you want to convert these guys twice in a 30-day period.\n\n  \n**Week 2** \\- This is the inspiration week. The goal of this week is to get customers to visualize receiving your product(s). Pick out the products that you want to push and embed them into an email that put customers in a buying mood. Here are some examples, “Best Christmas Gift Ideas” (followed with reviews that showcase people holding the product by festive decorations), Black Friday Favorites (followed with some type of scarcity like “these products fly off our shelves every year around this time, secure yours before we sell out”), or some type seasonal blog post style email which features a use case for your product at this specific time of year (Ex. Baking niche- holiday recipe, Pet niche – “My dog became the star of my Christmas party” followed with a stupid story, Fitness Niche- “5 ways to stay lean during the holidays”, etc.) If you have a large American customer base, this is also a good time to send out a Veterans Day email.\n\n  \n**Week 3 –** This is the week to build hype. If you want to do a promo, now is a good time to do a free shipping promo in an email that talks about stock being low on Best-sellers. Make it seem like there is an opportunity to buy things at full price with free shipping. Customers should feel like if they don’t buy now, they might not be able to get it at all. At this point, you should have generated 30-40% of the sales that you will generate in the month of November.\n\n  \n**Week 4 –** This is where shit gets crazy. Let customers know that Cyber Week is here and there will be no better time to buy from your site. I like to run 1 product promos all week, these promos do very well on SMS channels as well. Do an aggressive discount on different products multiple times this week. Make sure there's a short time window to be able to get the discount. This keeps customers on their toes and it builds anticipation. People will be waiting for the item that they’ve been eyeing to go on sale. Avoid heavily discounting your best sellers at this time. I like to send 2 versions of a Happy Thanksgiving email. Version 1 is just a general happy Thanksgiving email that goes out to people who haven’t made a purchase on your site. Version 2 is Happy Thanksgiving + early access to the Black Friday Sale. (If your email list is under 15k I’d suggest sending this to all buyers, If your email list is larger than 15k I’d suggest sending this to people who have purchased 2 or more times)\n\n  \n**BFCM**\\- Black Friday and Cyber Monday are really just 5 emails and 2 SMS campaigns. Email 1 – Black Friday Sale Announcement, Email 2 – Last chance to redeem Black Friday Sale, Email 3 Cyber Monday Sale, Email 4 – Last chance to get Cyber Monday deal, Email 5 (optional) – Cyber Week Sale. When I run sales for Black Friday, I focus on bulk discounting (ex. Save $50 on orders over $200). Try to at least double your average order value. I focus on convincing the people with the extra funds to spend as much as possible during this weekend. Cyber Monday is for everyone else who may just want 1 or 2 specific things at a better rate. I've found that it is extremely hard to get people to place huge orders after they’ve already bought the things that they really want. This is why I always do bulk discounting first.\n\n  \n**Bonus-** This email is often the most profitable email of the entire year. After all the sales are done, write a plain text “Thank you” email from the “CEO”. I made a whole post about why this email has the potential to be the most lucrative email of the entire year. If done correctly this email will EASILY outperform any of the sales emails you sent during November. 350k of the 1.2 million I mentioned earlier came from this 1 email.\n\n  \nEmail and SMS Revenue Breakdown  \nBrand 1:  \nEmail Revenue: 332k  \nSMS Revenue: 56k  \nBrand 2  \nEmail Revenue: 667k  \nSMS Revenue: 140k  \n During November, it is very possible to do over half of your sales from existing customers. Around this time of year media buying becomes more competitive. If you have an existing customer base, doubling down on the backend stuff will be more profitable than looking to acquire new customers at this time of year.\n\n  \nThanks so much for taking the time to read my post, Id be happy to provide more clarity on any of the subjects that I mentioned in this post. I wanted to keep this post a bit shorter but I didn’t want to be too general/vague. I apologize for the length and if I rambled a bit on certain points.",
    "subreddit": "dropship",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 182,
    "downs": 0,
    "created_utc": 1698563953.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.801557346618101
  },
  {
    "score": 179,
    "title": "AliExpress Dropshipping is Faster Than Ever Before",
    "selftext": "I have 4 ecommerce stores that I built and run, with 3 of them being dropshipping from AliExpress.\n\nTwo of the four make over 5 figures per month, one of the four just started bringing in sales and is doing 4 figures per month but will eventually hit 5 figures per month, and the last one I just started building 2 weeks ago.\n\nI would estimate that more than 95% of my issues across all stores have been with shipping speed from AliExpress. 5% with bad quality/wrong item, etc.\n\nAliExpress recently revamped its seller requirements and are forcing all stores/sellers on the platform to ship within 2 days.\n\nAs I track all orders/shipments across all my stores I am extremely impressed with their improved shipping speed.\n\nMost of the orders I place now arrive in 5-7 business days.\n\nThat means the customer places an order on Monday, and it arrives to them the following Monday-Wednesday.\n\nYou still have to find great suppliers on AliExpress and create relationships that are mutually beneficial (basically giving them many orders). Then, you let them know that you are a dropshipper and require fast shipping speeds for regular business, and they will put your orders as a priority.\n\nI can now advertise 5-7 business days delivery which is pretty reasonable for most shoppers.",
    "subreddit": "dropship",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 179,
    "downs": 0,
    "created_utc": 1712848567.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9655901024020808
  },
  {
    "score": 177,
    "title": "I'm not a dropshipper, but...",
    "selftext": "I don't get it. Why do people buy stuff from random no-name websites when there are trustable big dogs already? Etsy, Ebay, Amazon, Walmart, etc. I saw some dude's cringe \"grind harder\" post and checked the sub out for other gold. But I just don't get exactly what it is you all bring to the table. \n\nNever in my life would I go to some random ass website and - well one time I did buy a sick hoodie from vapor95. But other than that. This is gonna sound like an ad for them now, but no seriously, they sell unique designs and such, the websites I see you all linking sell... sunset lamps? Random furniture? Other incredibly generic garbage? And piss poor brand identity too. \n\nOr do all those dropshippers die and the unique ones live? \n\nI don't know what my question is anymore. I just don't get it. Sounds like a good way to put 3,000 in to sell a few stuff and be net -2,850.",
    "subreddit": "dropship",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 177,
    "downs": 0,
    "created_utc": 1706245137.0,
    "media": null,
    "is_video": false,
    "num_comments": 113,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9838724279771305
  },
  {
    "score": 181,
    "title": "How do you guys fulfill TikTok shop orders with out going broke? Their payout takes entirely too long..",
    "selftext": "I’ve had almost 200 orders since starting my shop in December. It’s a struggle fulfilling orders sometimes because TikTok takes 8 days after delivery to pay me out. So I’m spending out of pocket for every order. I’ve been doing around 4-5 orders a day. Which is $50-$70 I have to spend a day, or $300-$500 I spend a week fulfilling orders.\n\nI work a pretty shit job lol, pay is ok, but I mean have still have to take care of myself. And $300 a week is steep lol.\n\nI’ve seen some stores sell thousands of items a day with drop shipping on TikTok shop. Do you guys use capital on hand, credit card, or what?",
    "subreddit": "dropship",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 181,
    "downs": 0,
    "created_utc": 1704399567.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.008707035812957
  },
  {
    "score": 167,
    "title": "If you are not selling on TikTok shop you are missing out",
    "selftext": "TikTok shop is where the action is at in 2023. The barrier to entry is still somewhat high due to it being restricted to UK and US sellers however there is still a good amount of Asian sellers getting around this using black hat methods.  \nTikTok is currently pushing at full speed and has been giving sellers and buyers a huge incentive to buy and sell on the platform by covering costs for discounts and selling fees. TikTok has also changed their algo and is pushing TikTok shop heavy to users.  \nTikTok shop is still at the infant stage but I can see things becoming competitive.  \nIf you have questions drop them below and I will answer them.",
    "subreddit": "dropship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 167,
    "downs": 0,
    "created_utc": 1697152737.0,
    "media": null,
    "is_video": false,
    "num_comments": 300,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.184592529522784
  },
  {
    "score": 166,
    "title": "Step by step guide to get started",
    "selftext": "I've been researching and working on dropshipping, acquiring knowledge and a detailed understanding of how things work and what I need to do once I'm in the middle of it, but I still struggle to understand what to start with. My budget is tight. 100$ max. I can reinvest everything I make for a month or so but that's all I have to start with. \n\nWhere do I get started practically and how do I spend my money in the right place to get into it?\n\nP.s: I do plan to do organic marketing until I can push out a handful of sales enough to reinvest back and try for better strategies",
    "subreddit": "dropship",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 166,
    "downs": 0,
    "created_utc": 1675723823.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.983929720117895
  },
  {
    "score": 157,
    "title": "How I Started My eBay Dropshipping Business in 10 Minutes Using These 7 Steps",
    "selftext": "I've been dropshipping on eBay for seven years and have scaled my business to selling hundreds of thousands of products to date. I'm making this post because I've noticed many newcomers tend to overcomplicate the process.\n\nI still remember the first day I started dropshipping. It was 7 years ago, during the Christmas season, late at night around 2 AM, snow falling outside. Completely broke while working my security job, I pulled out my smartphone and watched a YouTube video about dropshipping on eBay. I thought, \"This will never work. Who would buy the item on eBay when they can get it cheaper on Amazon?\" Despite my doubts, I gave it a shot. I created my eBay account, saw another person selling a snow globe, searched for it on Amazon, found it, took screenshots of the image, copied the title, and listed it at a higher price on eBay.\n\nThe next day, during my night shift, I received a notification that the snow globe I had listed had sold. My mind was blown. I went home, logged onto my computer, went to Amazon, purchased the item, and shipped it directly to the customer's address. I had just made $10. Mind blown.\n\nHere are the 7 steps I used to make my first sale:\n\n**Step 1:**  \nCreate an eBay account.\n\n**Step 2:**  \nVisit Amazon and find a product you think will sell well, such as a snow globe.\n\n**Step 3:**  \nCreate a listing on eBay.\n\n**Step 4:**  \nCopy the title, description, and images from Amazon and paste them into your eBay listing. If the price on Amazon is $10, list it on eBay for $20. Make slight changes to the title to make it unique.\n\n**Step 5:**  \nOffer free shipping and free returns.\n\n**Step 6:**  \nList the item for sale.\n\n**Step 7:**  \nRepeat the process until you reach 10,000 listings.\n\nThat's it. That's all I did, and I kept repeating it over and over. There's no need to overcomplicate things. While there are ways to optimize the process, increase sales, and boost profitability, this is where it starts.\n\n  \n**P.S**: I did get lucky that the first item I ever listed sold, which sparked a seven-year journey. However, over the years, if executed correctly, the 7 steps outlined above have worked on every single account I've created, as well as for my friends, family, and community. **If you're not lucky, make your own luck.**",
    "subreddit": "dropship",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 157,
    "downs": 0,
    "created_utc": 1718072923.0,
    "media": null,
    "is_video": false,
    "num_comments": 147,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.876287944651901
  },
  {
    "score": 161,
    "title": "Not Your Money",
    "selftext": "Today I wanted to share some advice that I hope doesn't fall on deaf ears in this sub: it's not your money.\n\nWhat do I mean by this? Let me break it down for you, follow-along on this journey:\n\n* You build an online store.\n* You add products to the store.\n* You advertise the products, organically and via paid ads.\n* Customer finds your brand or product(s).\n* Customer pays for the item(s).\n* You receive an orgasm-inducing/dopamine-flooding notification from Shopify (or your payment platform) that a sale has been made. The \"KA-CHING\" sound effect makes you feel a rush of pure adrenaline and joy through your whole body.\n* You screenshot everything and run to Reddit to satisfy your ego. You just want to \"inspire\" and \"motivate\" others who are trying to make their dreams come true... Right. 🙄🤡\n* You process the fulfillment request.\n* The supplier receives the request.\n* Supplier ships item(s) to customer.\n* You see the payout hit your bank account. You start thinking about how to continue scaling your business (ads, products, tools, etc.). In your head, that money is already spent.\n* You don't worry or think about a potential return or chargeback.\n* Days go by. You already forgot you made this sale.\n* Customer (finally) receives the item(s). If all is good, you don't hear from the customer again until they buy something in the future. If there is a problem, they start blowing-up your e-mail and chat, social media, etc.\n* God forbid you have to give someone a refund, right?..\n\n--\n\nI say all that to say this: it's not your money until the customer's return period has passed. Just because you made the sale, or the payout clears and hits your bank account, doesn't mean that it's your money to cash out or spend.\n\nBe smart. Be patient. Think long-term. You are building a business, and earning trust, and establishing your reputation. Do things the right way.\n\nDropshipping is not a business model, it is a fulfillment method. It is not a \"get-rich-quick\" scheme.",
    "subreddit": "dropship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 161,
    "downs": 0,
    "created_utc": 1724960665.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6887719844815745
  },
  {
    "score": 155,
    "title": "Here are 8 Million-Dollar Clothing Shopify brands you can copy (Complete Breakdowns)",
    "selftext": "I did a post like this a while back and I'm so happy that 480k of you guys found it useful. \n\nHere's another one, this time focusing on only clothing brands. If you have a clothing eCommerce brand, this is for you.\n\n  \n1. Unique Vintage ($22.8M annual revenue) - [https://dsweekly.com/brand-reviews/unique-vintage-brand-review/](https://dsweekly.com/brand-reviews/unique-vintage-brand-review/)\n\n2. Bamba Swimwear ($5M annual revenue) - [https://dsweekly.com/brand-reviews/bamba-swimwear-brand-review/](https://dsweekly.com/brand-reviews/bamba-swimwear-brand-review/)\n\n3. Berthie ($4.5M annual revenue) - [https://dsweekly.com/brand-reviews/berthie-brand-review/](https://dsweekly.com/brand-reviews/berthie-brand-review/)\n\n4. Little Bipsy ($6.2M annual revenue) - [https://dsweekly.com/brand-reviews/little-bipsy-brand-review/](https://dsweekly.com/brand-reviews/little-bipsy-brand-review/)\n\n5. Cult Gaia ($5M annual revenue) - [https://dsweekly.com/brand-reviews/cult-gaia-brand-review/](https://dsweekly.com/brand-reviews/cult-gaia-brand-review/)\n\n6. Lazy Oaf ($5.3M annual revenue) - [https://dsweekly.com/brand-reviews/lazy-oaf-brand-review/](https://dsweekly.com/brand-reviews/lazy-oaf-brand-review/)\n\n7. Tocco Toscano ($5M annual revenue) - [https://dsweekly.com/brand-reviews/tocco-toscano-brand-review/](https://dsweekly.com/brand-reviews/tocco-toscano-brand-review/)\n\n8. Taka Original ($1.49M annual revenue) - [https://dsweekly.com/brand-reviews/taka-original-brand-review/](https://dsweekly.com/brand-reviews/taka-original-brand-review/)",
    "subreddit": "dropship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 155,
    "downs": 0,
    "created_utc": 1730111351.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6270946026904802
  },
  {
    "score": 154,
    "title": "Starting May 2nd, 2025 their will be a minimum 30% import fee on all orders under $800 coming from China",
    "selftext": "Trump administration is ending the de minimis tariff exemption. This policy let orders valued under $800 go through customs duty free.This is obviously going to affect dropshipping. \n\nWhat’s everyone’s plan now that your product will be at a minimum\n30% more expensive to import?\n\nEDIT: it is actually a $100 PER ITEM or 125% fee on all orders $800 or less! He made it worse yesterday lmao\n\n[link to official WhiteHouse.gov announcement](https://www.whitehouse.gov/presidential-actions/2025/04/modifying-reciprocal-tariff-rates-to-reflect-trading-partner-retaliation-and-alignment/)",
    "subreddit": "dropship",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 154,
    "downs": 0,
    "created_utc": 1744388450.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.840080923792075
  },
  {
    "score": 146,
    "title": "My First Drop-shipping Journey in 2025",
    "selftext": "Hello everyone!\n\nI've just launched my very first drop-shipping store, and I'm excited to share my journey with you. My niche is pet supplies.\n\nHere's the plan I've got so far:\n\n**Marketing Strategy:**\n\n\\- Running Google Search campaigns with a daily budget of $10 for testing.\n\n\\- My goal is to achieve a conversion rate of &gt;3%.\n\n\\- Total testing budget: $300 for this store.\n\n\\- Targeting regions: US, UK, Canada, Australia, and all European countries.\n\n**Setup Status:**\n\n\\- Store is live and connected to domain\n\n\\- I've integrated Google Analytics and a Facebook Pixel for tracking already.\n\nNow i'm currently optimizing the store by adding more images, after that I will begin the ads campaign\n\n**Product Details:**\n\nSelling price: \\~**$118**\n\nProduct cost: \\~**$40**\n\nShipping cost: \\~**$9**\n\nRevenue per sale: **\\~$70**\n\nAfter accounting for ads (assuming \\~$30/sale), I'm aiming for $40 profit per sale. (I've experiences running meta ads but this time i let other friend running google ads for me so i don't know if this number is realistic)\n\nThis is my first attempt, so I know there's a lot to learn along the way. I'll keep updating the results.\n\nWish me luck! if you have tips for a beginner like me i'd love to hear.\n\n**Update (8 Jan):**\n\n* The campaign has gone live with a $10 daily budget.\n* I've added the shipping cost to the pricing to offer free shipping. The selling price is now $129.9 + tax, which makes the total quite high. Since I'm just testing if I can sell the product, I've decided to set the price at $119.9 with free shipping. The profit per sale is now around $50. With an expected $20 ad cost per sale, the real profit I'll take home is about $30 per sale.\n\n**Update (13 Jan):**  \nI used a demonstration product featuring a video from YouTube, but unfortunately, it was reported for copyright violation, and the platform removed my product. Despite several back-and-forth conversations, I'm unable to sell that product anymore, which is quite frustrating.\n\nSince it was the weekend, I couldn't take immediate action. Today, I searched for the same product on AliExpress and re-imported it to our store. The process is now complete, and I've relaunched the ad campaign.",
    "subreddit": "dropship",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 146,
    "downs": 0,
    "created_utc": 1736138137.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.826478764808404
  }
]