[
  {
    "score": 4555,
    "title": "Donald Trump Ruined My Business",
    "selftext": "I’m an Amazon seller. I sell toys. My best selling product is made of steel and sourced from China. The U.S. doesn’t have a domestic toy market. Even with 200% tariffs it would still be cheaper for me to source from China instead of producing in the U.S. \n\nMy product was loaded onto the boat March 1st and I expected to pay 25% (Section 301 tariffs) + an additional 10% China tariff, and a 3% duty. The boat departed a day after Trump announced the additional 10% China tariffs(so now 20% or 48% total). My inventory still hasn’t arrived so who even knows how much I’ll be paying when it finally hits the port. \n\nIf I order again I will be paying 82% in tariffs(additional 34% tariffs from liberation day) My Chinese competitors frequently undervalue their shipments so it doesn’t affect them anywhere near as much as me. \n\nI wonder how much of these tariffs i can claw back by pretending the Gulf of Mexico is called the Gulf of America. \n\nEven those MAGA hats are made in China. \n\nI don’t think any American teens are salivating at the thought of working in a coal mine or a sweatshop making shirts/shoes. \n\nNo smart business man is going to invest millions of dollars into the U.S. when our president has a bi polar economic policy changing his mind on tariffs every other week. \n\nI guess this is what we get for electing someone who got a small loan of a billion dollars from his dad and still filed for bankruptcy 7 times. \n\nI really feel bad for the lower class who now has to deal with the biggest tax hike in history. What happened to no taxation without representation? \n\nI truly hate to get political but I’m near certain I’m going out of business. \n\nSorry for the rant. \n\nEdit: On top of a 20% China tariff, Trump added a 34% “reciprocal” tariff, and he is now threatening an additional 50% tariff. 104% in total. ",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 4555,
    "downs": 0,
    "created_utc": 1743782802.0,
    "media": null,
    "is_video": false,
    "num_comments": 623,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Emotional critique of tariffs and Trump; primarily a vent rather than actionable guidance.",
    "composite_score": 5.761176010248275
  },
  {
    "score": 861,
    "title": "The world is broke right now",
    "selftext": "This year I have been pulling my hair out trying to figure out why I have so many abandoned carts and checkouts. \n\nI have tried absolutely everything you can think of to try to get my CVR up. From small optimizations to complete website rebuilds to buying expensive CROs from experts. I bet there is nothing you can think of that I haven't tried. \n\nSure, all of this did help me a little bit with my conversions, but it didn't bring me back anywhere close to where I once was. \n\nThen this morning I had the randomest urge to go through all my orders one by one. I noticed something interesting - at least a third of all orders, if not half, had multiple payment attempts. And most abandoned checkouts had failed payment attempts. My Stripe account allows me to see why these transactions didn't go through, and nearly ALL of them failed due to insufficient funds.\n\n(I sell a relatively higher ticket item so this may not be the case for you.)\n\nThis was an eye opening moment. I felt bad for the world, man. We spend all our time trying to squeeze as much money as possible out of our customers, when many of them are literally giving us their last dollars. Maybe they have really stressful lives and retail therapy provides them some relief and distraction.\n\nAs a result of this new insight, I am going to focus less on my conversion rate and more on taking better care of my existing customers. \n\nThank you for reading.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 861,
    "downs": 0,
    "created_utc": 1744428823.0,
    "media": null,
    "is_video": false,
    "num_comments": 152,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Offers a mental model about customer behavior and a pivot in strategy with reasoning.",
    "composite_score": 4.7553529812335125
  },
  {
    "score": 787,
    "title": "Tariffs = Layoffs",
    "selftext": "Spent my day laying off people who had been here for 20+ years., including most of our manufacturing folks. Uncertainty means saving your pennies for a rainy day, not investing in the future.  Unless you are completely naive, I just don't get how you think we would ever consider doing more in the US. Our international customers are leaving us because of the tariff wars and our US customers can afford the high interest rates. \n\nSorry... had to vent somewhere. Its been a day of ruining peoples lives. So not fun.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 787,
    "downs": 0,
    "created_utc": 1744663683.0,
    "media": null,
    "is_video": false,
    "num_comments": 140,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.73,
    "category_rationale": "Venting about layoffs and tariff impacts; emotional stance dominates.",
    "composite_score": 4.668635773817245
  },
  {
    "score": 653,
    "title": "My store just got hit with the dumbest fraud attempt ever and I’m actually crying 😭",
    "selftext": "Bro I can’t make this up. Someone placed a $300 order, fine whatever. Then immediately emails me like.\n\nHello dear, I am traveling. Please ship to my friend at a different address. Do not ask questions.\n\nLike sir I am asking questions. I’m asking many questions.\n\nAnd the friend’s address was literally a random empty parking lot. I google mapped it. It’s just asphalt and sadness.\n\nI’m honestly convinced fraudsters aren’t even trying anymore. It’s like they’re speedrunning stupidity.\n\nPls tell me I’m not the only one getting hit with clown level fraud lately.  \nWhat’s the stupidest attempt you’ve ever seen?\n\n",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 653,
    "downs": 0,
    "created_utc": 1764826348.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Humorous recount of fraud attempt with a question; mainly a vent about scams.",
    "composite_score": 4.595530304043966
  },
  {
    "score": 586,
    "title": "Watching my Gen Z gf shop online has made me realize I’ve been lacking in so many areas",
    "selftext": "So I’m in my 30s and my current strategy for my Ecom brands was just to purely focus on ads and use generic content to try and push my products as much as possible.\n\nThis comes from my “direct response” mindset that I’ve grown up with due to working with offline media/ads and strictly FB for the past 7 years or so.\n\nBut the way my gf was shopping online made me realize how much of a dinosaur I’ve been in terms of my marketing strategy.\n\nI’m sure a lot of you already know how Gen z shops, but she would literally have both the Ecom website and TikTok open at the same time, and any time she saw a product she was even remotely interested in, she would search for the product on TikTok and just scroll through 10+ videos before making a decision.\n\nOnce she made a decision on what she wanted, she would bookmark the page and then tell me that she’s gonna buy it in a couple weeks when her budget allows.\n\nSo what does this mean for me, as a marketer?\n\nA few things:\n\n1. I need to focus more on organic content generation. I’ve been using all of my UGCs and my own content strictly for ads without even thinking about the organic/social side. I literally have IG and FB accounts with tens of thousands of followers and 0 posts (stupid, I know). So my goal now is to pump out as much content as possible showing the product off in every way, especially with addressing all concerns and objections a customer may have regarding the product.\n\n2. Rework my naming conventions. This one may seem like a non-issue, but from what I’ve seen, my gf literally searched the exact product name every time. This means if my naming conventions are too generic, it’s possible the search on TikTok may show results of my direct competitors (which I don’t necessarily want). \n\n3. Think with a long term, multi-touchpoint perspective. Gen z, and most people in general, struggle with their budgeting and finances. Which means the “direct response” approach, although still viable, isn’t the be-all, end-all that it used to be. I need to think of ways to address concerns with price points, offer more ways to pay (especially with buy now, pay later methods), and stay at the forefront of their minds for at least a few weeks to a few months so that when they are able to buy, I’ll be there ready.\n\nI know these things are very simple and almost no-brainer concepts, but I’ve been so caught up in my daily ROAS and ROI that I’ve completely neglected to think about how people actually buy nowadays, especially with my market being majorly Gen Z.\n\nAnyway, if anything, I hope you guys take this post as a wake up call to actually observe people in your market shop online. Not just through heat maps and tracking software, but literally sitting down beside them and watching what they do, even seeing the types of things they say to themselves to rationalize a (future) purchase. ",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 586,
    "downs": 0,
    "created_utc": 1733083632.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.66,
    "category_rationale": "Enumerated marketing strategy items presented as distinct tips to apply.",
    "composite_score": 4.436544897388011
  },
  {
    "score": 518,
    "title": "Just got my actual tariff bill (USA)",
    "selftext": "Feels like the other shoe has dropped. I just got my tariff bill back from my shipping company. My effective tariff load for my April 2025 shipment is 176.5%. For comparison, when my order was delivered in November 2023, the effective tariff load was 31.5%\n\n# 📦 Tariff Comparison: Nov 2023 vs. Apr 2025 Shipment (Straw Hats from China)\n\n|Line|HTS/Reason|**Nov 2023 Rate**|**Apr 2025 Rate**|\n|:-|:-|:-|:-|\n|1|**9903.88.03** – Section 301 Tariff|25%|25%|\n|2|**9903.01.24** – EO China Duty|—|20%|\n|3|**9903.01.63** – Reciprocal Tariff|—|125%|\n|4|**6504.00.3000** – Base duty on straw hats|\\~$0.40/doz + 6%|\\~$0.40/doz + 6%|\n||**Total Effective Tariff Load**|\\~31.5%|\\~176.5%|\n\nEDITED on May 14, after receiving an updated entry summary from my customs broker. According to them, I can expect a refund for what I paid last week. New effective tariff load is now 61% (still nearly double what it was in November '23)\n\n### 📦 Tariff Comparison: Nov 2023 vs. Apr 2025 (Initial) vs. Apr 2025 (Adjusted in May)\n\n| Line | HTS/Reason                                | **Nov 2023 Rate** | **Apr 2025 Initial** | **Apr 2025 (Adjusted in May)** |\n|------|--------------------------------------------|-------------------|-----------------------|-------------------------------|\n| 1    | **9903.88.03** – Section 301 Tariff        | 25%               | 25%                  | 25%                          |\n| 2    | **9903.01.24** – EO China Duty             | —                 | 20%                  | 20%                          |\n| 3    | **9903.01.63 / 9903.01.25** – Reciprocal   | —                 | 125%                 | **10%**                      |\n| 4    | **6504.00.3000** – Base duty on hats       | ~6%               | ~6%                  | ~6%                          |\n|      | **Total Effective Tariff Load**            | ~31.5%            | ~176.5%              | **~61%**                     |\n\n---",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 518,
    "downs": 0,
    "created_utc": 1746579263.0,
    "media": null,
    "is_video": false,
    "num_comments": 391,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Data-driven tariff analysis with explained changes and implications.",
    "composite_score": 4.724310391358687
  },
  {
    "score": 465,
    "title": "My store doing well but fraud is lowkey killing my soul",
    "selftext": "So my lil online store finally started making real money this year. Sales going up, traffic solid, I was actually starting to feel proud.\n\nThen outta nowhere boom. Random chargebacks.  \nPeople saying never ordered this. Didn’t authorize. Bro you literally confirmed shipping, tracked it, signed for it. Like what.\n\nNow every new order I’m half excited, half terrified it’s another fake one. Feels like I’m playing roulette with my own income.\n\nDoes anyone actually have a real system for spotting fake orders before they blow up.\n\nOr is this just part of the ecommerce struggle now?\n\n",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 465,
    "downs": 0,
    "created_utc": 1762434033.0,
    "media": null,
    "is_video": false,
    "num_comments": 89,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.62,
    "category_rationale": "Emotional complaint about chargebacks and fraud; seeks a system but voice remains venting.",
    "composite_score": 4.3880071714096625
  },
  {
    "score": 272,
    "title": "How A Moron Entrepreneur Drove 400K in Sales With Press",
    "selftext": "I've been running Mantry.com for 10+ years (I say this for context not as spam) and suck at a lot of aspects of the business.  One things I have been wildly lucky / successful at is press. We've been featured in Oprah, The Today Show (Three Times), Good Morning America ect. ect.\n\nPeople on Reddit have helped me a lot. So I wanted to share what I do and maybe it will work for you.\n\n1. HOW TO INSTANTLY FIND PEOPLE WHO COVER YOUR TOPIC: In our case Google search \"Father's Day Gift Guide\" then click tools &gt; anytime &gt; custom range and choose the month before Father's Day the year before.  You will now get every gift guide written from that year, if you click news or images you will get more long tail blogs. Do this for anything if you make coffee mugs or a meditation app search \"Best coffee mugs\" and follow the process.\n2. CONTACT ONLY THOSE AUTHORS: Reach out to the writers of these blogs. DM is easiest as just google \\[Author Name\\] instagram or twitter will produce their social accounts. For email you can either guess or if you have any email from the news outlet they all use the same format ie [First.Last@nbcuni.com](mailto:First.Last@nbcuni.com)\n3. KEEP YOUR EMAIL TO ONE SENTENCE - One sentence, the email has to be brief and appear handwritten or you are dead on arrival. I write the same thing \"Saw your post on \\_\\_\\_ sending a tip for any Valentine's Day Gift Guides! If included I'll have the social team re-share it!\n4. Offer to re-share it - Writer are in the eyeballs game and if you have any type of following it's just more traffic which will make them look good.\n5. SELF DEPRECATING SUBJECT LINE - The #1 most effective subject line we have ever used by far is \"Mediocre Gift For Him\", we then add Christmas, Father's Day, Valentine's Day, Grilling ect. like \"Mediocre Christmas Gift For Him\"  - Nobody likes sale-sy stuff and it makes you seem human.\n6. FOLLOW UP - People don't do this, if you don't get a reply write these words and hit send \"Following up!\" - That's it. 50% + of opportunities happen on the follow up.\n\nThis is not a slow and steady thing. Book off 1 day every 3 months, drink a tonne of coffee and reach out to as many people as possible in 10 hours, follow up 3 days later and forget about it.  I watch motivational movies in the background while I do it to stay sane.\n\nPS: Focus on the Big Dogs! One appearance on the today show drove 24K in a day! Your product is good enough I promise.  News needs to talk about the new things constantly.\n\nThank you!",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 272,
    "downs": 0,
    "created_utc": 1675087635.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.84,
    "category_rationale": "Step-by-step sequence to secure press coverage and repeatable outreach.",
    "composite_score": 4.15090398311584
  },
  {
    "score": 252,
    "title": "This administration is killing me",
    "selftext": "I started a small business four years ago. I worked my ass off, holding down a full time job and building my business to be my sole source of income as of this year. My business is in an industry where 90% of products are made in China and the rollercoaster of tariffs have taken a huge toll on my mental health and my financial well-being. I even tried to diversify suppliers by working with manufacturers in other countries like Brazil. As of September, products from Brazil are charged 50% tariffs. \n\nI don't know what to do. The job market is cooked, it feels like my business could be under water at any moment with Trump's knee jerk tariff implementations. Now he's talking about 100% tariffs on China starting next month. \n\nHow the fuck is the government allowed to do this shit to it's people? How is this real life? This year has taken time off of my life. It's taken happiness away from me. I had a thriving business and felt like I finally achieved my dreams just months ago. I fantasize about killing myself and sending a farewell note to every senator telling them that trump did this. And I know I'm not alone here. I know that so many people are struggling because of this egomaniacal, narcissistic clown's inability to govern and give an actual fuck about anyone outside of his billionaire posse. \n\nI hate him. I hate our country. I hate this timeline. Someone help",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 252,
    "downs": 0,
    "created_utc": 1760202825.0,
    "media": null,
    "is_video": false,
    "num_comments": 133,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.74,
    "category_rationale": "Extreme political frustration about tariffs and government; emotional rants.",
    "composite_score": 4.126672920358222
  },
  {
    "score": 216,
    "title": "Anyone else completely despise the \"Shop\" App and process?",
    "selftext": "Have purchased a few items here and there from online vendors that use the \"Shop\" platform and app. This platform adds NOTHING positive to the customer experience....Nothing is more infuriating than receiving an email that my order has shipped, WITHOUT the tracking information included in the email. In order to view the tracking information, I need to download and install the Shop app ($6.77 on the app store). This is insane.",
    "subreddit": "ecommerce",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 216,
    "downs": 0,
    "created_utc": 1724341337.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.58,
    "category_rationale": "Short, strong complaint about Shop app UX; minimal substance.",
    "composite_score": 4.18302203302576
  },
  {
    "score": 185,
    "title": "Feels like I'm working 24/7",
    "selftext": "Hey guys, so I've been running an e-commerce business doing $1.5M in revenue annually and I just find myself spending a lot of time on mundane tasks like:\n\n* responding to customer tickets and IG messages\n* updating product information\n* collecting invoices and receipts for my accountant\n* forwarding order information to my 3PL\n* etc. etc.\n\nAre you guys busy with similar tasks or am I the only one?",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 185,
    "downs": 0,
    "created_utc": 1720462455.0,
    "media": null,
    "is_video": false,
    "num_comments": 212,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.74,
    "category_rationale": "Strong emotional vent about being busy and overworked with routine tasks, with no actionable steps.",
    "composite_score": 4.153702745937285
  },
  {
    "score": 172,
    "title": "How do people get photos done of their product for their e-commerce site?",
    "selftext": "Hey everyone. I have a journal I am in the middle of setting up for sale, almost done getting made. \n\nI am at the stage now setting up my shopify store. \n\nHow do all these companies, like lets say Journals, get professional photos done of the product for display? \n\nDo I just take normal pictures of it with my phone, and send them to graphic designers? I am kinda lost here lol. \n\nAny help would be great!",
    "subreddit": "ecommerce",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 172,
    "downs": 0,
    "created_utc": 1676392898.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Primarily a how-to question seeking advice on product photography; not a list/guide.",
    "composite_score": 3.9197075331890234
  },
  {
    "score": 156,
    "title": "Getting buried under order fulfillment and I don't know what to do",
    "selftext": "\n\nWhen I launched my shopify store I was doing maybe 10 orders a week and it was totally manageable, just pack everything up after dinner and drop it at the post office the next morning. Now I'm at like 150 orders a week and I'm drowning.\n\nMy garage is basically a warehouse now with inventory everywhere, I'm spending 4 or 5 hours every single day just on packing and shipping, and I've started making mistakes because I'm rushing. Wrong items, wrong addresses, forgot to include inserts, you name it. Had three chargebacks last month from shipping errors alone.\n\nThe worst part is I should be excited about the growth but instead I just feel stressed all the time. I barely have time to actually work on the business anymore because I'm too busy working in it. Has anyone else hit this weird spot where you're too big to do everything yourself but it feels too early to figure out what comes next?",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 156,
    "downs": 0,
    "created_utc": 1766427087.0,
    "media": null,
    "is_video": false,
    "num_comments": 173,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Dominant emotion venting about growth and workload; asks for others' experiences; lacks a concrete procedure.",
    "composite_score": 4.0136742765505335
  },
  {
    "score": 155,
    "title": "The easiest way too increase revenue by 15%",
    "selftext": "I've personally set up email flows for at least 50 brands. I am going to share how I set up email automation for brands that do 30k-150k per month. Brands doing less than 30k a month often don't need all of these emails, they can focus on abandoned cart, welcome series and browse abonnement. Brands doing more than 150k a month will need more in-depth flow work but I can expand on that in another post.\n\nHere's the breakdown:\n\n**Welcome Series** **(6-10 emails)**\n\n\n\n1. Thanks for signing up\n2. Discount reminder\n3. Welcome to the family (buyers)\n4. Join our rewards point program (If applicable) (buyers)\n5. Learn about the brand (non-buyers)\n6. Social proof + Follow us on social (non-buyers)\n7. Last Chance to use gift (non-buyers)\n8. Discount reminder (non-buyers)\n\n**Post Purchase (Broken into multiple flows)**\n\n\n\n1. Thanks &amp; welcome to the brand (1x)\n2. Gift as a token of appreciation(1x)\n3. Gift Reminder(1x)\n4. Congratulate them on their decision to buy again + show appreciation (2x)\n5. Gift Reminder (if applicable) (2x)\n6. Review Request (2x)\n7. VIP STATUS Achieved (3x)\n8. Gift Reminder (if applicable) (3x)\n9. Referral/Points/Ambassador Program (if applicable) (3x)\n\n**Browse Abandonment (3-5 Emails)**\n\n\n\n1. Saw something you liked?\n2. Still interested?\n3. Social Proof + Possible Discount\n4. Discount Reminder (If applicable)\n\n**Abandoned Cart (5-8 emails) (custom abandon cart flows for specific products if necessary)**\n\n\n\n1. Looks like you left this behind\n2. Still interested?\n3. Stock running low\n4. Social proof\n5. Educational emails about why customers should buy from you (If applicable)\n6. Discount\n7. Reminder\n\n**Sunset Flow (2-3 Emails)**\n\n\n\n1. Ask unengaged subscribers if they are still interested\n2. Final opt out opportunity\n\n**Customer Winback (3-5 emails)**\n\n\n\n1. Check out what’s new\n2. Showcase positive recent customer buying experience\n3. Discount\n4. Reminder\n\n**Customer Review**\n\n\n\n1. Offer discount for review\n2. Discount delivery + customer appreciation\n\n**Special Flows**\n\n\n\n1. Cross Sell (Used when you have a common upsell with one of your hot products)\n2. Affiliate Program flow (used if you have ambassador or affiliate programs setup)\n3. Rewards point flow (breaks down and encourages reward points systems such as smile io)\n4. Replenishment reminder (for stores with consumable products)\n\nThis is relatively simple work, but it is time-consuming and will probably take at least a few days to complete. But no need to worry, you don't have to go all out. Simply turning on some of the Klaviyo default flows and editing them so that they're onbrand will easily boost your revenue by at least 5%. Dont be discouraged to dedicate a couple days into your back-end automated marketing. These sales add up, the earlier you set these emails up, the more money you'll make in the long run.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 155,
    "downs": 0,
    "created_utc": 1713671315.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.86,
    "category_rationale": "Provides a reproducible sequence of email flows to increase revenue; steps and outcomes.",
    "composite_score": 3.7908059431015837
  },
  {
    "score": 154,
    "title": "10 Years, 100K in Burnt Ad Money = Discovering One Awesome Referral Trick",
    "selftext": "I've been running a Food Subscription Box for 10+ years and SUCK at paid ads so I test a lot of ways to find new customers. One thing I never cracked for years was referral programs.  I signed up for a couple apps that did the whole \"refer a fried and get 15% off\" thing but it never really did anything.  That's when I stumbled on this double edge solution, hopefully it works for you.\n\nALL I DO is reach out to any customer who has been subscribed for 1 year and write this exact email:\n\n\\---\n\nHi \\_\\_\\_,\n\nI'm a founder, thank you for being a subscriber for a year, if there is anyone you know who would love \\[Your Company\\], I would be happy to send them a \\[Your Product\\] (on us of course).\n\n\\---\n\nThat's it. The Result:\n\n1. A massive flow of new subscribers (we add an insert into the free box with a 10% off coupon too).\n2. It makes existing loyal subscribers feel acknowledged and improves our churn rate (acts as a loyalty program).\n3. The only cost is the cost of one box but the perceived value is $85.\n4. The email opens a dialogue with existing customers where they can mention feedback or any issues etc.\n\n\\*\\*Note\\*\\* - A very important line is \"if there is anyone you know who would LOVE  \\[Your Company\\]\" It really makes them think of who would ENJOY the service so it's a scorching hot lead.\n\nIT IS INSANE HOW SIMPLE THIS IS - I don't know anyone else that does this as a \"referral program\" and it is so easy and effective.  It took me about 6 years to figure it out so try it!\n\nWorst case scenario, your existing customer is happy, best case you get a new customer. No SAS costs, widgets, code or anything.  Just one personal email at a time.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 154,
    "downs": 0,
    "created_utc": 1676829533.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Describes a repeatable referral tactic with exact email and results; a reproducible method.",
    "composite_score": 3.5718017025063102
  },
  {
    "score": 152,
    "title": "Amazon must face US nationwide class action over third-party sales",
    "selftext": "From the Reuters [article](https://www.reuters.com/legal/government/amazon-must-face-us-nationwide-class-action-over-third-party-sales-2025-09-02/):\n\n&gt;The class includes buyers in the United States who purchased five or more new goods from third-party sellers on Amazon since May 26, 2017.\n\n&gt;The consumers’ 2021 lawsuit said Amazon violated antitrust law by restricting third-party sellers from offering their products for lower prices elsewhere on rival platforms while they are also for sale on Amazon.\n\n&gt;Amazon’s policies have allowed the company to impose inflated fees on sellers, causing shoppers to pay higher prices for purchases, the lawsuit said.\n\n&gt;Amazon has denied any wrongdoing. It has already appealed Chun’s class certification order, which was first issued under seal on Aug. 6.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 152,
    "downs": 0,
    "created_utc": 1756844042.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "News excerpt linking to external article; no actionable guidance.",
    "composite_score": 3.6789484007565423
  },
  {
    "score": 149,
    "title": "How are you dealing with  new tariffs?",
    "selftext": "Today Trump announced an additional 34% tariff on China bringing the total to 54%. He will likely do another 25% tariff for buying Venezuelan oil. How are you guys dealing with this? If I don’t raise my prices by at least 20-33% most of my items I will now be selling at a loss. I’m an Amazon seller and before these tariffs came into play I made a list of the top 100 sellers in my category and wrote down their prices and units sold last month. \n\nOnly 3/100 of my competitors have raised their prices so far. \n\nI think I’m going to go out of business in all likelihood. I would appreciate any ideas. ",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 149,
    "downs": 0,
    "created_utc": 1743649239.0,
    "media": null,
    "is_video": false,
    "num_comments": 289,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Discussion seeking ideas about tariffs; not a step-by-step guide or model.",
    "composite_score": 4.044790258005159
  },
  {
    "score": 146,
    "title": "For those of you who have started your own brand and are struggling, here's a tip to kick things off.",
    "selftext": "I've run through everybody in our niche so I don't mind sharing a tip that worked for us when we were just getting started. \n\n1) Go to cratejoy.com\n\n2) Look for subscription boxes that fit your niche/products\n\n3) Google the name of the subscription box company and find their contact info. Email them about distributor partnerships (AKA them including your items in their monthly/quarterly boxes). Keep the email short and sweet but be very direct about what you offer. \n\nThese companies need a ton of fresh products to keep their monthly customers happy so they've always got their eyes open for new items that fit their brand(s).\n\nBUT, you've got to make sure you can handle volume. We tried this when we first got started and almost immediately got a reply back from one of the companies we reached out to saying something along the lines of \"We really liked X, Y, Z on your website and feel they'd work with our brand. If you can offer these items to us at XX% discount and can produce 5,000 pieces in 30 days then we'd love to work with you, after we test out some samples first!\"\n\nAfter everything was said and done with that massive order at a huge discount, my wife and I collectively earned what worked out to be about $2-$3/hr. It was a lot of work for such a small reward. But guess what? We now had thousands of people who had our products in their home. Our logo and our brand were right there in front of all of these people and it was an AMAZING way to get the ball rolling!\n\nOn top of that, it's a great way to get you to start thinking outside the box (pun) of \"I can only get sales through social media/paid ads/organic SEO\" because it seems like that's what a lot of you guys are hung up on. And right now is a great time to think outside the box considering how fucked up the market has been.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 146,
    "downs": 0,
    "created_utc": 1681591693.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Outlines a concrete, repeatable outreach strategy with steps to pursue distributor partnerships.",
    "composite_score": 3.5118773260761387
  },
  {
    "score": 147,
    "title": "Bank of America business account rejected after 2 months of back and forth",
    "selftext": "This is mostly a vent but also looking for advice. Applied for a BOA business checking account in october and they kept asking for more documents. First it was just EIN and articles of incorporation which I sent. Then they wanted proof of business address so I sent my home lease and still rejected. I run an online consulting business from home, i dont have clients coming to my office or anything. Tried explaining this and they said I need either a commercial lease agreement or utility bills showing the business name at a commercial address. My LLC has been operating for 3 years, I have tax returns, client contracts, everything. just dont have a physical storefront because I literally dont need one. considering just trying a different bank at this point but dont want to waste another 2 months",
    "subreddit": "ecommerce",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 147,
    "downs": 0,
    "created_utc": 1766764869.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Vent about a bank account rejection; emotional frame with request for advice.",
    "composite_score": 3.6359435974744514
  },
  {
    "score": 145,
    "title": "E-commerce: The Get-Rich-Quick Scheme That Stole My Sleep",
    "selftext": "I started my e-commerce store thinking, “I’m going to sell amazing products, make passive income, and sip mojitos on a beach.”\n\nReality check:\n\n* My “passive income” is me actively arguing with a supplier at 2 AM.\n* That “amazing product” I sold? Customer returned it because “the shade of blue wasn’t blue enough.”\n* Shipping costs? Let’s just say my profits are currently on a romantic getaway with DHL.\n\nAnd don’t even get me started on abandoned carts. It’s like customers came over, trashed the place, and left without even saying goodbye.\n\nBut hey, who needs sleep when you’ve got dreams, right? 😅 Anyone else feel like their e-commerce journey is a never-ending rollercoaster? 🎢",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 145,
    "downs": 0,
    "created_utc": 1733398598.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Humorous but clearly a vent about the struggles of e-commerce and lack of sleep.",
    "composite_score": 3.7935142858446653
  },
  {
    "score": 145,
    "title": "Trustpilot isn’t a review site, it’s a protection racket for fake reviews",
    "selftext": "After weeks of back and forth, I’ve come to one conclusion. Trustpilot is not a review platform. It’s a pay-to-protect extortion racket disguised as one.\n\nThey let unverified users post fake, aggressive, reputation-damaging reviews with no proof, no customer record, no order history, nothing. Even when you flag them and clearly show that they violate multiple of Trustpilot’s own written policies, they ignore it. You get brushed off with the same generic reply every time. “Each review is assessed individually.” That’s it. No explanation. No action. Nothing.\n\nBut if you’re a business? Suddenly the rules change. Say one wrong word in a reply and they’ll flag your account. Accidentally break some hidden policy and they’ll threaten to suspend your profile. You’re punished instantly, while trolls and fake reviewers get a free pass.\n\nI had a reviewer post something that was so clearly defamatory it got removed. Then they came back and posted the exact same thing, reworded just enough to slip through. I flagged it again, explained it, and even pointed out that it broke five of Trustpilot’s policies. They refused to take it down. Pretended it was different. Told me nothing could be done.\n\nThey’ve created a system where reviewers can keep posting damaging content until one version sticks. Meanwhile, as a business owner, you’re powerless unless you pay. That’s the entire game. Let the damage happen, then upsell you on “reputation management tools” and premium features that supposedly give you more control. It’s extortion dressed up as customer service.\n\nIt’s not just incompetence. It’s deliberate. They know exactly what they’re doing.\nThey want bad reviews to stay up because it pressures businesses to pay.\nThey ignore violations unless you're a top-tier paying customer.\nThey’ve built a platform that weaponises fake reviews to sell protection from the mess they refuse to clean up.\n\nThis is happening to thousands of businesses. Some don’t have the time or energy to fight back. Others just give up and pay. That’s what Trustpilot counts on.\n\nI’ve filed a GDPR complaint, demanded access to internal moderation logs, and I’m going to keep posting about this every time they ignore another valid report. If you’re dealing with something similar, speak up. Don’t let them bury this behind polished marketing and empty “integrity” statements.\n\nTrustpilot is broken by design. And they’re profiting from it.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 145,
    "downs": 0,
    "created_utc": 1757998262.0,
    "media": null,
    "is_video": false,
    "num_comments": 192,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional critique and condemnation of Trustpilot with no actionable steps.",
    "composite_score": 4.042131510288324
  },
  {
    "score": 145,
    "title": "I tried Temu as a consumer, I couldn't do it. here is my story",
    "selftext": "I was searching for hobby storage containers online and I saw a Temu item. I have never explored the world of Temu before, but I thought I would check it out. What I quickly learned was this app focuses on the extreme gamification of the shopping experience. I spent about 10 to 15 minutes of my initial session spinning prize wheels, navigating 'choose your free item rewards' and the extreme lack of detail (and no bananas for scale) in their PDPs made me so skeptical of what I would receive I had a hard time selecting items. After spending that 10-15 minutes in that experience and not understanding what I was actually winning or getting from a product standpoint, I gave up, uninstalled. \n\nWhat am I missing out on, is Temu offering good products at a good price? The amount of razzle dazzle, sparkle, wow!, gamification across the experience made me feel like they are selling the experience of buying stuff rather than selling you quality products at a fair price. Maybe that is their niche, I cannot speak to the quality of goods, I couldn't justify spending another 20 minutes on the app to get through the flow to get the one item I originally went there for. \n\nWhat was your experience?",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 145,
    "downs": 0,
    "created_utc": 1726667530.0,
    "media": null,
    "is_video": false,
    "num_comments": 373,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal experience with Temu and a question; no clear category.",
    "composite_score": 4.133288656884678
  },
  {
    "score": 144,
    "title": "What I learnt from sourcing e-commerce products from China.",
    "selftext": "DISCLAIMER: The intention of this to increase cautiousness and practice best practices between the entrepreneurs that are importing from China. \n\nSo I have been running an e-commerce store for a very long time, not a drop-shipping particularly but we would order the products in bulk to the country and then ship from there (For faster shipping).I wanted to do drop-shipping but then it halted back in 2019, right after the COVID and ePacket was banned &gt;!(ePacket is a shipping agreement between US and China to reduce shipping times, it uses passenger planes to carry the parcel, hence faster shipping)!&lt;.\n\nAnyway getting back to the point, We were selling jewellery in the United States, firstly we used to just order from Aliexpress (a bunch of 500 every week) to our warehouse, do the quality check and then we would ship it from there. However the price per item was $7.80 and it was selling for $25.99 with a good profit margin.\n\nWe decided to scale that store (I shared the scaling strategy in a different blog post) by going to a supplier and ordering 10K since Q4 was coming up and we were trying to scale up, the item was selling like a hot dog. We posted a few Request For Quotation on Alibaba and got some quotations and here are my learnings.\n\n* **You will get the same product for less.**\n\nThe item we were getting for $7.80 was available for as low as $4.00 if we ordered in bulk, and as high as $10, so it varies. If you order $10K units then it will be available for $2.00. The more volume you ask for the lesser the cost will be - I mean it's normal, but the cost can go very low. I mean compare $7.80 to $2.00\n\n* **You will have to do your own quality check.**\n\nAlibaba is not like Amazon where they do the quality check for you, you will have to do your quality check before you ship the items to your customers. We ordered 10K and got around 300 defective items from the supply. (either they were broken, or of a bad quality). And then you have to send them to the supplier, the supplier will usually ask you to send the items back but it's not worth the time. So make sure that you order at least 10% more of what you need.\n\n* **Plan your shipments accordingly and choose the correct method**\n\nUnrelated to the store, we saw a great kitchen product that we thought could do really good in the American market, but the problem? It was 1.2Kgs. It was a really large item made out of stainless steel. We wanted it faster but AIR CARGO was expensive (it was charging $2000) as we did not have time since Q4 was already around the corner, however the affordable option was ship containers but the transit time was 1 month. So make sure if you plan to order large items, do it beforehand and make sure you choose the right shipping service to save costs.\n\n* **Trust your negotiation skills.**\n\nYou got to trust your negotiations skills and don't be shy when negotiating with your suppliers, we got down the per product cost from $6 to $4.80. While it may not seem a lot but it saved around $3500 per order. So negotiation works! I mean just like any other business.\n\n* **Never ditch a supplier too early.**\n\nIf you find a better price somewhere then don't move your orders at once, we got a supplier that was giving the exact same product for almost 20% less, and ordered 500 units from them. Most of the units were defective, so always maintain multiple suppliers until you do the quality check of both of the suppliers.\n\n* **Have multiple modes of communication**\n\nIf you're using Alibaba chat to communicate with your suppliers then make sure you have their emails and WhatsApp, WeChat or anything they use because they will go offline without prior notice.\n\n* **You will get free FedEX/UPS shipping**\n\nDon't hesitate to ask for premium shipping if you maintain a good relationship, the supplier we had used to send the items using ePacket which used to take 10-14 days, talked to the supplier and he offered a premium FedEX shipping for large orders which delivered the order in 4-5 days max (to California)\n\n* **Always use AliBaba Payment Gateway**\n\nNever use PayPal, or WeChat or anything else to send the funds, it's just not worth the hassle. Even though you have the escrow services at place. I would just avoid PayPal or anything and just go with Alibaba's gateway. It is seamless and has a great grievance redressal system.\n\n* **Product Sourcing Agents are great but be careful**\n\nThere are a lot of product sourcing agents are great, they will get in touch directly with the manufacturer for you and can get any type of customisation done for you and can get you better prices. But be careful and use a better sourcing agent.\n\nI guess that was it. I will edit this post if I find more points to address.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 144,
    "downs": 0,
    "created_utc": 1695312496.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.62,
    "category_rationale": "Bullet list of concrete lessons learned about sourcing from China.",
    "composite_score": 3.903868002234975
  },
  {
    "score": 141,
    "title": "No, you are not getting a refund because your package was \"stolen\"",
    "selftext": "I work customer service for an online retailer. We send expensive items, via UPS. There is almost always a photo of the delivery and signature tracking. \n\nI am so goddamned tired of people messaging us saying that they can't find their package, and just right off the bat saying that they want a refund. \n\nLook, I get it, it sucks your package was stolen. But I have proof of delivery with a literal photo of your house and a signature. I'm not just sending you $500 like \"oh well, guess that's lost forever\". \n\nPorch piracy is a genuine and very real problem in this industry, but giving people refunds for things that were *allegedly* stolen off the porch has created this sense of entitlement and a lot of people just say it was stolen thinking they can get free stuff. \n\nImagine if brick and mortar stores did that. You buy something, walk out into the parking lot, and someone robs you and runs off with your purchase. You then walk back into the store, say you got robbed and the store just...give you back your money? No, that's not how this works. ",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 141,
    "downs": 0,
    "created_utc": 1700348001.0,
    "media": null,
    "is_video": false,
    "num_comments": 221,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Vent about customers refund requests and porch theft with moralizing tone.",
    "composite_score": 4.000464831608376
  },
  {
    "score": 134,
    "title": "Mid-career exec trying to exit the rat race via e-commerce - need practical learning sources",
    "selftext": "Hey all,\n\nI’m in my early 40s, currently a senior executive in a traditional industry. On paper things are “successful,” but in reality I’m tired of building other people’s businesses and having my calendar dictated to me.\n\nBefore corporate life fully took over, I had a very misspent youth in web design and early internet projects - so I’m not allergic to tech, funnels, or learning fast. What I am fed up with is the rat race and the idea that this is just how the next 25 years are supposed to look.\n\nOver the next 2 years, my goal is to transition from making other people money to working for myself through e-commerce.\n\nA few caveats:\n\n\t•\tI don’t want a mentor or a high-ticket guru\n\t•\tI’m not a procrastinator. When I decide, I move fast\n\t•\tI learn best from specific, actionable sources, not vague motivation\n\t•\tI’m happy to test, fail, iterate, and burn cash on ads if the learning is real\n\t•\tI’m not trying to “get rich quick,” I’m trying to build leverage\n\nWhat I’m looking for from this community is the best practical learning resources to start an e-commerce journey in 2025? For example:\n\n\t•\tYouTube channels that go beyond surface-level fluff\n\t•\tCourses that are genuinely tactical (not inspirational sales funnels)\n\t•\tFrameworks or playbooks you wish you’d had at the start\n\nIf you were starting again today (with discipline, capital, and urgency) where would you start learning first?\n\nAppreciate any no-BS guidance. \n\nCheers 👍🏼",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 134,
    "downs": 0,
    "created_utc": 1767450434.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Asks for practical learning resources; primarily a request rather than content.",
    "composite_score": 3.855651365793781
  },
  {
    "score": 126,
    "title": "US and China Agree to Lower Tariffs",
    "selftext": "It amazes me that at that level of government they could come out with such an unthought out, half-baked plan knowing the ramifications it would have on American businesses who would have had to run out of stock, lay off staff or in the worst case close down. And then they just roll them back...\n\n[https://edition.cnn.com/2025/05/12/business/us-china-trade-deal-announcement-intl-hnk](https://edition.cnn.com/2025/05/12/business/us-china-trade-deal-announcement-intl-hnk)",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 126,
    "downs": 0,
    "created_utc": 1747035634.0,
    "media": null,
    "is_video": false,
    "num_comments": 119,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "News share with minimal analysis; no substantive guidance.",
    "composite_score": 3.810894343979769
  },
  {
    "score": 122,
    "title": "Made a change that'll save my company $150k+ over the next 12 months, only get a $10k raise. Does that seem fair? Am I getting shafted?",
    "selftext": "I work for a fitness equipment manufacturer as an eCommerce manager for the past 4 years. I've been asking for a raise for almost 3 years with no movement. \n\nLast month, despite heavy pushback from my boss, I implemented a small change in our operations: switched us from a 3rd-party warranty provider (\"Mulberry\") to self-managing warranties in house using another Shopify app (\"Umbrella\"), which lets us keep 100% of warranty revenue instead of giving away 80% of it. I ran the numbers, and based on the last 3 weeks since launch, the difference is projected to save us $150k+ over the next 12 months because our products get virtually no claims... and the claims we do get are for small, cheap components with high markups. \n\nMy boss is obviously thrilled and finally, albeit begrudgingly agreed to give me a raise… $10k/year.\n\nOn paper, that’s about 6.6% of the savings I directly generated. No bonus, no commission, no profit-sharing. no adjustment for prior years inflation. just that $10k.\n\nI’m grateful for the bump, but can’t help wondering… is this normal? I feel like after 3 years I should have gotten that anyway (my salary is $80k; now $90k) and I'm literally bringing in more than my entire salary with this one change... but the job market is tough and I don't want to leave if it's even worth out there (grass is always greener). \n\nWould love to hear how others have handled situations where they directly make the company a huge amount of money but see only a fraction of the value in their own pay and whether I am as underpaid as I feel. ",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 122,
    "downs": 0,
    "created_utc": 1754855060.0,
    "media": null,
    "is_video": false,
    "num_comments": 276,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.46,
    "category_rationale": "Personal career question and reflection; lacks clear structure or steps.",
    "composite_score": 3.9036449959716224
  },
  {
    "score": 116,
    "title": "10 Years Of Pain, The One Thing That Works...",
    "selftext": "Ok this is a little niche so I am including that I am a founder at Mantry.com and after 10 years here is what worked for us.  This is not spam, I just think when people don't include what they do they bring zero credibility.  I've actually wasted hundreds of thousands of dollars on marketing ideas and this is free and works.\n\nBefore you even DARE hire an agency, install some expensive referral widget or sign up for an affiliate program do these two actions:\n\n1. Export your entire customer list and line by line, google everyone who has ever bought your product.\n2. Send anyone who looks like a leader in ANY space a personal email and ask them if they would ever consider sharing a message with their followers. ALWAYS include the caveat, \"no worries whatsoever if you can't we're just trying to grow the old-fashioned way\"\n\nThat's it.\n\nYou will be shocked at how many existing customers have built-in influence. I'm not talking just about social media, maybe they are prominent realtors or run their own companies, we've been lucky to discover prominent athletes for example.\n\nPeople with real influence, you probably can't afford.  Many people with fake influence you also probably can't afford. The loophole is that the majority of people with real influence have integrity.  If someone already uses your product they will strongly consider helping you out I guarantee it.\n\nDon't be shy, that's the power of asking nicely and not being lame and pushy.\n\nDo it! It's free.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 116,
    "downs": 0,
    "created_utc": 1676062905.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.77,
    "category_rationale": "Two explicit actions presented as a reproducible approach to growth.",
    "composite_score": 3.5527198839212994
  },
  {
    "score": 114,
    "title": "spent $12K on a product photoshoot. got worse conversion rates... got any ideas???",
    "selftext": "So this is embarrassing to admit, but here goes. We run a DTC fashion brand (won't name it for obvious reasons). Last year we raised a seed round and decided to \"do things right\" for once. That meant hiring a proper photographer, booking models, renting a studio, the whole professional setup. Total spend was $12,347 for one collection (about 40 pieces).\n\nWe A/B tested the new \"professional\" photos against our old ghetto setup where we literally just hung clothes on hangers against a white wall and photographed them with an iPhone.\n\n\\- Old setup (iPhone + white wall): 3.2% conversion rate\n\n\\- New setup ($12K professional): 2.7% conversion rate\n\nWe lost 15% of our conversion rate after spending five figures. And after some very intense discussions we've identified 3 reasons for this happening:\n\n1. The professional shots were too polished. They didn't look real. They looked like ads, so people's brains just... ignored them.\n\n2. The models were too perfect. Our customers couldn't relate. They wanted to see what the clothes actually looked like on normal people.\n\n3. Lighting was too perfect. Made the fabric look different than it actually was. We got more returns.\n\nThe iPhone shots were scrappy, but they were real. You could see the actual texture of the fabric. The lighting showed the true color. No deceptive angles (which is the most important factor in ecom). We can't even reuse most of those $12K photos because they're seasonal. So that money is just... gone. Now we're stuck between wanting professional looking visuals (because we're trying to raise a Series A and need to look legit) and knowing that our scrappy setup actually converts better. Any ideas about the path forward?",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1764344901.0,
    "media": null,
    "is_video": false,
    "num_comments": 166,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.6,
    "category_rationale": "Enumerated breakdown of why professional photography damaged conversions.",
    "composite_score": 3.8845560759274034
  },
  {
    "score": 112,
    "title": "Tried comic-style ads on a \"dead\" product and was surprised by the results",
    "selftext": "Been in ecom for a bit, and recently tested something different I thought was worth sharing.\n\nI took a product that had been around forever — super saturated — but instead of dropping it, I reframed it with a new emotional angle and built a simple one-product store.\n\nThe twist: I used GPT-4o to generate comic-style image ads. Just 2–3 frames that tell a quick story.\n\nTo my surprise, the ads started pulling solid numbers — low CPMs, good CTR, and we're now doing around $2k/day. Way better than I expected, especially for a static image format.\n\nStill early, but curious if anyone else has seen success trying more “unusual” ad creatives like this? Would love to hear what’s working for others right now.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 112,
    "downs": 0,
    "created_utc": 1745359530.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares an experimental approach and its results with the takeaway insights.",
    "composite_score": 3.496260325562913
  },
  {
    "score": 114,
    "title": "What Happened When I Stopped Automating Emails After 8 Years.",
    "selftext": "Entrepreneurs are obsessed with automated email flows. People think they are one Klaviyo or Mailchimp abandoned cart email from 5xing revenue.  I blame Tim Ferris for convincing everyone that if they automated everything they could spend 80 hours in a hammock doom scrolling.\n\nTHE TRUTH IS THE SECOND A CUSTOMER SENSES AN AUTOMATED EMAIL YOU ARE DEAD IN THE WATER.\n\nIf you don't care, they don't care. Nobody needs your product unless you are water, nutrients or shelter. People will buy from your company because they trust you, see some value and most of all LIKE you or your company.\n\nI'm an idiot but miraculously had the stroke of insight to stop automating emails and begin personally emailing customers about 1.5 years ago and the conversion rate has skyrocketed. We would have like 8 abandon carts a day and I was sending automated emails. Why? Now, especially for sales emails to past customers I include a personal note from me the founder, I mention something about a newsworthy event, I use their name if it's obvious in the email address or mention a sports team based on their address if I have it.\n\nImagine the difference between these two emails:\n\n\\---\n\n1. Hi! We noticed you bought last year, need any \\_\\_\\_\\_, can we help with anything?\n\nvs.\n\n2) Hi Steve! We're not nominated for an Oscar tonight but we still have great \\_\\_\\_. I just wanted to check in and see if you enjoyed the \\_\\_\\_\\_. We're offering 10% off to past customers because we loved them and really want Michigan to beat Ohio State this weekend.\n\nI'm the founder if you need anything or want to tear apart the product so I can learn.\n\n\\---\n\nThat's the difference of about a 4x increase in conversion rate.\n\nConclusion:\n\nIf you are sitting there thinking you don't have time for this, you are in business and nothing drives your business forward like sales. I guarantee if you write 10 cold emails right now to past customers that are genuine you will drive 1 sale or at least receive scathing feedback about how to improve your product. Not selling your product causes more stress and pain and frustration than anything else.\n\nSTOP AUTOMATING EVERYTHING, YOU DON'T EVEN DO 50K IN SALES A YEAR.\n\nPS: Newsletters are great for valuable content, send some hot sauce recommendations or link to a blog post you wrote but PERSONALLY write the APE emails (Abandon Carts, Pop-Up Captures &amp; Expired CC Cards)\n\nIf you don't agree, COME AT ME BRO!",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1678749208.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Personal experience explaining why stopping automation and emailing customers improves conversions with reasoning.",
    "composite_score": 3.6793640885692462
  },
  {
    "score": 110,
    "title": "Our D2C Sold into Target Stores. The Story &amp; Lessons. ",
    "selftext": "Thought I'd share some feedback here as our brand sold a product into Target. From past jobs I had, I knew that dealing with big box retailers was a challenge for many reasons, but as a business owner the feeling is different as it affects your own pocket. We are a 4 year old ecommerce brand that has gone from $0 - $9m in 4 years. I lived in China for about 15 years so this didn't exactly happen by chance, but has been a blessing after Covid killed another business I had.\n\n**THE DEAL**\n\nThe program was for an $80 retail electronic item to be sold to all 1800 Target stores. We did not deal with Target directly but did have meetings with the buyer. We dealt with an agency that takes a 5% commission. Apparently Target prefers dealing with these agencies rather than dealing with individual brands likely to reduce the points of contact and ideally have someone that knows the intricacies of their business and can explain it to the brand, which didn't happen in our case. The agency we worked with had a rather green employee on our account which lead to a lot of problems later on.  I won't mention their name publicly, but they are bad, and we are not paying them.\n\nOur sale price was quite good, around $45 on a $80 item. This was an excellent margin for us. As a D2C brand, our CAC is around $25 to run ads to find a customer, so this was a healthy margin for a retail deal. We knew there would be some chargebacks and such, but we were happy with the initial sale price.\n\n**PROJECTIONS**\n\nTarget predicted they would buy around 34,000 units. This was to be around a $1.5m deal. We were a $7m company at the time, so this was a significant deal for us, and one that I was super excited about.\n\nWe saw rather quickly that their projections were way off. We were not given a lot of shelf space only allowing for about 3-5 units per store. We were on the high end of pricing in this category and our brand isn't super famous. Perhaps our packaging wasn't great for retail either. Whatever the reason, once you are in the store it is too late to make running changes and it wasn't going well.\n\nThroughout the journey, as cautious entrepreneurs, we wanted to understand what the down side would be. What would happen if Target over ordered and was left with a ton of stock? Our agent lead us to believe that \"RTV\" (return to vendor) was an option, which we later found to be.. wrong. This is our fault for not knowing exactly how much it would cost to get units back to us from the very start.\n\n**RTV = RETURN TO VENDOR**\n\nThis is one of the most important lessons when dealing with big box retailers. This has to be negotiated up front, which our agent didn't do for us. We knew that the returns that were \"defective\" would be trashed, but thought that if Target over ordered we would be able to get the extra units back. This is not the case. If you do not negotiate this, Target will either sell your units to another discounter or throw your product into a landfill, neither of which you will be able to control or even be told about.\n\n**RETURN RATE**\n\nThis was another area we grossly underestimated. As a D2C brand, our Shopify returns are under 1%. Our Amazon returns are under 3.5%.  We have sold to QVC which had a 6% return rate. Target came in around 16%. I have no idea why it was this high as you will not get any insight into the returns. If any of the boxes get bumped, or returned with torn packaging, you can assume these will be trashed. We had no insight into the oddly high return rate, but our production is all from the same batch, so it had to do with this particular sales channel, not the actual product itself. I think they had trouble selling units and just randomly put a percentage onto this list. Returning online is a lot simpler than going back to a store, so it does not make sense to us that this would be so high.\n\n**OVER ORDERING**\n\nTarget wants all of the upside, and doesn't care about your down side. We actually cancelled one of their orders for 10k pieces as we saw the projections weren't being met and we \\*thought\\* this would lead to overages coming back to our warehouse. Little did we know, overages will actually be thrown into a landfill somewhere, which you will be paying for.\n\n**DISCOUNTING**\n\nNot only will you have no insight into the return rate, Target will run random discounts online. This hurt us as we made the mistake of not separating our Amz SKU from the Target SKU. They ran a surprise online discount over labor day which essentially sent our amazon listing into \"no buy box\" status as we weren't the low price anymore. We lost six figures over holiday weekend sales as a result of this.\n\n**THE END OF THE PROGRAM**\n\nAt the end of the program, Target will want you to pay for highly discounting the items. We told them that we would prefer to get the units back. We have no issue selling through our D2C channels so selling at 60%, 80% off is not something we wanted them to do. It was at this point that they told us RTV was not an option, and it would cost us hundreds of thousands of dollars to get our stock back. This was different than our agent lead us to believe when they wanted all of the up side of selling inventory. We ended up basically paying Target to throw away 5000 perfectly excellent units into a landfill. They won't tell you where these units go. I think they probably just don't want publicity for being wasteful. They won't send the units back to you though unless this was negotiated up front.\n\nAt the end of the program, we basically agreed to pay nearly $100,000 out of the deal to Target for them to throw away our product. Originally they wanted somewhere around $240,000 but we were able to negotiate this down. The total number of units ordered was around 20,000 pieces which was way off of the original estimate, but they only sold through maybe 15,000 of those pieces.\n\n**THE AFTERMATH**\n\nAfter agreeing to the $100k going back to Target, we did get in writing from them that this would signal the end of the program. However, due to Target having so many different departments that do not communicate with each other, we still get hit up by different audits showing that they want another $5k, or $30k, or $12k, for random discounts or chargebacks. We then have to explain to them that we have already terminated the program and were told nothing else was due. We won't pay anything else but who knows if they will continue to chase us for this. We have written confirmation from the buyer that there is nothing else due so we will stick to that.\n\n**CONCLUSION**\n\nI love being a D2C brand. I like owning the customers and marketing to them directly. I like that we are able to offer a better service or support than retailers ever could. We probably still made a little bit of money off of the deal, but not much. Our agent was horrible. We made mistakes in that we didn't push the agent early on to give us certain answers. Payment terms with retailers are bad. They will pay you 60 days after delivery and still take out 2%. They will nickel and dime you for everything.\n\nWould I do it again? Actually, yes..  But I would get certain things in writing next time. First, its only worth it if the margin is excellent. Second, I'd understand the downside of stock overages a bit better. Third, I'd work with a better agent that knows the buyer a bit better. Retail deals are tempting because we currently run ads to find 1 customer at a time. We do this successfully, but being able to sell 5000, 10,000 or 30,000 pieces at a time is hard to turn down.\n\nShould you ever bring your D2C brand to a big box retailer, thoroughly understand defect calculation, where defects go, how stock is ordered, where stock overages go, how and when they discount and who is responsible for this. Hope this helps someone else when they think about going to the giant retailers. It's not as sexy as it may appear to be.\n\n\\*\\*EDIT BELOW\\*\\*\n\n[**TARGET.COM**](http://TARGET.COM)\n\nBasically worthless. No pull. We spend hundreds of thousands of dollars a month in online advertising and everyone still went to Amazon to purchase our product, which was much better for us. Target charged a 6% \"digital accrual\" fee on online sales which is kind of bogus as they don't advertise your product for you and as a D2C brand we do a lot more online promoting than the tired big box brands they had in store that basically don't need to advertise. There are perhaps some \"Target Circle\" customers, but the majority of Americans are Amazon users and the Target website does not move the needle.\n\n**SLOTTING FEE**\n\nYou will be charged to have your product on the shelves. In our case it was $20,000 for the year long program. However, we were able to negotiate that this would be spend on online ads instead of a straight fee. We used Citrus Ads to run on the [target.com](http://target.com) platform.  Again, the website has no pull but this spend for us is quite minimal compared to the ads we run on other platforms so we were ok with it.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 110,
    "downs": 0,
    "created_utc": 1734741455.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Narrative with lessons learned about selling into Target rather than a step-by-step process.",
    "composite_score": 3.4079592313383107
  },
  {
    "score": 109,
    "title": "2.5 million in sales while paid ads are turned off",
    "selftext": "Before I get into the good parts of this post here's a quick disclaimer:\n\n\\- This brand did 1.8 million the year before\n\n\\- I do not own this brand, I was hired to build a cult-following\n\n\\- paid ads were being ran for the first quarter of the year but not converting well\n\nThat's relevant information because not every brand can see massive success without paid ads.  Most of the things I talk about in this post are pretty much useless if you do under 15k/month. Now that that's out of the way, let's talk about what I did to nearly double this brand's revenue without dumping more money into ads.\n\n**For those who don't like reading, I'll summarize what I did right here: I built a community around the brand.**\n\nSo I'll break down what I did into 5 steps:\n\n*1. Obtained a shit load of user-generated content*\n\nI was able to get 300 videos of people using the brand's products in under 60 days.\n\nThis is easier than it seems. People pay influencers thousands to pose with their products. For a brand with a bit of traction, the value in user-generated content is to get products in front of a larger audience; Not necessarily for social proof (like it is for smaller brands).  So with that being said, don't spend a lot of money on UGC content unless it's for a promotional post on a page with a large following.\n\nDon't fixate on having the prettiest videos. Give a wide variety of people the opportunity to submit content.\n\n3 ways you can get user-generated content for free/cheap are.\n\n\\- Use your social media channels to offer a free product in exchange for a video review\n\n\\- Setup a review email flow, offer existing customers a chance at a full refund for a video testimonial that meets certain criteria\n\n\\- Directly contact influencers and negotiate/hire someone with a network of influencers to do the negotiation process for you\n\n*2. Created a blog*\n\nI designed a blog page on the website and posted on it 1-2 times per week. I used Ai to generate in-season ideas for blog posts, then got my copywriter to do some research and come up with short blog posts that were informative and read well. P.S just using chatgpt to pump out blog content can work but the content will never be as engaging as content written by a real person that understands the marketing angle. We also tried to add user-generated content on the blog pages as much as we could.\n\nThis is by far the easiest way to get people back onto your site without them feeling like you're trying to sell them more products. This is the base of the next 3 steps. Good blog content makes people in your niche excited to hear from you. This will boost your email open rates, allow you to post in groups that are heavily moderated against promotions, and give you a lot of niche-specific copywriting to work with.\n\n*3. Created a subreddit (or any type of group)*\n\nI created a subreddit for this brand, then I spent hours finding niche-relevant content. Then, I queued a whole bunch of posts. I did a mix of reposting content from tiktok, instagram, youtube, etc, and posting the site's blog posts and UGC content. Growing the community was tricky but once I got some momentum going it was almost growing itself.  \n\nThere's major upside to owning a community inside of your niche. You can block your competitors from posting in your sub and post as much promotional content as you want. You can also mix content, so people have no idea if you're promoting a store, sharing a funny photo, or giving a useful recommendation. You'd honestly be shocked by the amount of traffic our weekly pinned post brought to the site.\n\n*4. Discord community*\n\nI used social media, Reddit, and emails to grow the community to 11 thousand members in under a year.  Customers were giving design ideas, connecting with store employees, and volunteering to send content with products for FREE. \n\nThis is like a reddit community but more personal. The main difference between the discord and the reddit is that the discord is branded and the Reddit is just niche specific. This is a good place to run competitions and polls, and also just interact with customers on a personal level. You can get a tone of UGC from a discord community if you use it right.\n\n*5. Email and SMS marketing*\n\nI saved the best for last. Normally my posts are mainly focused on emails but I thought I'd switch it up today to truly convey what goes on behind the scenes of well-coordinated email/sms marketing.\n\nThink of emails as an ongoing conversation between you and your customer. You play the role of a friend recommending things to a peer. You already know things about them, like their interests, location, and buying habits. Now use segmentation and predictive analytics to make sure relevant content gets sent to interested people. I'll leave it at that.\n\nBut before I leave  I'll share some more info about this brand that may be relevant. It's a breed-specific animal brand,  this brand has been around for about 4 years and has consistently grown 30-40% each year with last year being an outlier (almost doubled sales), the people in this niche are extremely passionate about their pets so this may have made it easier for me to grow a community this quickly, and the 2.5 million that I am attributing to my systems are just the sales that came from EMAIL and SMS marketing. \n\n&amp;#x200B;\n\nThanks so much for taking the time to read my post, Id be happy to provide more clarity on any of the subjects that I mentioned in this post.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 109,
    "downs": 0,
    "created_utc": 1683955229.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Clear 5-step breakdown detailing actions to increase revenue without ads.",
    "composite_score": 3.690349363479653
  },
  {
    "score": 105,
    "title": "Trustpilot has become a disgrace",
    "selftext": "Trustpilot - shady company.\nHave found out they’re deleting legitimate positive reviews from customers from company trustpilot profiles.\nThen using drops in scores to coerce those companies to take out paid plans to improve their scores.\n\nHow is this defensible? What a vicious, manipulative business tactic. They need investigating!\n\nDo not use this company\n\nDo not trust this company\n\nDo not give this company any of your money",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 105,
    "downs": 0,
    "created_utc": 1731503155.0,
    "media": null,
    "is_video": false,
    "num_comments": 104,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Emotional critique of Trustpilot with strong moral judgment.",
    "composite_score": 3.7709005147997394
  },
  {
    "score": 101,
    "title": "Business Regret",
    "selftext": "Ecom founder of 15+ years. Over $100M gross revenue. \n\n2012/2014 $7-10M a year very profitable\n\n2015-2018 a slow decline. 4-5% net margin in 3-5 a year. \n\nThen we discovered influencers marketing in 2019 and started growing again at great profit. Then 2020 came and we grew 100% but spent way too much in influencers and ads and didn’t make any money.\n\nNo the business is basically a zero, I’ve got a great nest egg. I’ve landed a new role working for an aggregator.\n\nBut I’m depressed that I didn’t monetize the greatest ecommerce opportunity in my life in 2020. I never would have expected we would have gone to complete zero after being in business for so long.\n\nEntrepreneurship is tough! \n\nLooking backing I know exactly where I screwed up but couldn’t see it at the time.\n",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 101,
    "downs": 0,
    "created_utc": 1753069016.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Reflective story with lessons about influencer marketing and monetization mistakes.",
    "composite_score": 3.755139393503627
  },
  {
    "score": 103,
    "title": "Almost went out of business from scaling too fast",
    "selftext": "At the beginning of this year, my Shopify store went from $2k to $10k in just 3 weeks. I was hyped cause it finally felt like things were working.\n\nSo I pushed ad spend and kept going, expecting cash to follow. But I didn’t realize how quickly it could dry up.. Between delayed payouts, daily ad spend, and more unexpected refunds, I had less than $1,000 in my bank account just 2 weeks later. So basically sales was great but somehow I was broke.\n\nThankfully I was able to borrow money from my parents to keep my store going.\n\nThat’s when I realized just looking at monthly, traditional financial statements isn't enough. You need to map out your cash week by week and actually forecast what’s coming in and going out.\n\nHere’s what I’ve been doing since then so I don’t have to go through that again:\n\n1. Using 13-week CF forecast model\n\nSo I learned that financial statements aren’t all that helpful when you’re dealing with serious cash issues. For me, what actually helped was setting up a 13-week cash flow forecast model. \n\nWhy 13? Cause that feels manageable, not too far out, but enough to see when things might get tight. You can go beyond that to 26 weeks if you want, but 13 is more than enough and most accurate for most of us.\n\n2. Planning for different cash flow scenarios\n\nOnce I had the 13-week forecast set up, the next step was using it to plan ahead and avoid getting caught off guard.\n\na. For big decisions\n\nI run three versions of the forecast:\n\n* A best-case version where things slightly outperform (110% of expectations)\n* A base-case (100% of expectations)\n* And a worst-case with a drop in revenue or spike in costs (70% of expectations)\n\nThis helps me stay grounded and not build my entire month around everything going perfectly.\n\nb. For monthly what-ifs\n\nEach month, I tweak a few key assumptions to see how much room I really have. Things like:\n\n* What if product cost goes up 10% next month?\n* What if I push a payout back by 2 weeks?\n* What if I reallocate part of my Meta budget to TikTok and it underperforms?\n\nc. For quarterly stress test\n\nEvery quarter, I run through a few worst-case situations. Stuff like:\n\n* Revenue suddenly dropping 40%\n* Ad costs doubling overnight\n* My supplier going quiet for 30–60 days\n\nThese aren’t fun to look at, but they help me figure out how long I could last if things go south.\n\nNow I’m sitting at about $10k to $15k per month. I know that’s not a crazy number, but it feels a lot more stable now that I actually understand my cash flow and I don’t wake up stressed about whether I can cover next bills.\n\nI’m still trying to get better at planning ahead and making smarter decisions. If you’ve got your own way of managing cash or finances in general, I’d love to hear what you do.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 103,
    "downs": 0,
    "created_utc": 1751293351.0,
    "media": null,
    "is_video": false,
    "num_comments": 77,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Explicit 2-step plan and 13-week forecasts; stepwise approach to cash flow management.",
    "composite_score": 3.66058064064402
  },
  {
    "score": 100,
    "title": "US business bank accounts how strict are address requirements these days?",
    "selftext": "I’ve been reading more and more about banks cracking down on virtual addresses, PO boxes, and mail forwarding services. Apparently, some accounts are getting flagged or even shut down after review especially if the address doesn't match up with a real commercial space.  \n  \nI’m in the process of expanding my business into the US and trying to set up a business bank account remotely. To avoid any headaches down the road, I’m now considering using a service that provides a legit commercial lease for a US office address rather than just a virtual mailbox. Also looking into options for getting a physical US sim card to meet the verification requirements some banks and platforms are asking for.  \n  \nIt seems like more banks are tightening up KYC rules, especially with foreign-owned LLCs. I’d rather set things up right from the start than have to redo everything a few months in.  \n  \nAnyone here dealt with this recently? Did you run into any issues with your address? Or find a workaround that actually passed compliance checks?  \n  \nWould really appreciate any insights before I commit to something that ends up being a red flag.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 100,
    "downs": 0,
    "created_utc": 1749207072.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Simple question about bank addresses; lacks substantive content.",
    "composite_score": 3.5125608323037705
  },
  {
    "score": 98,
    "title": "What’s the most frustrating part of running your store on Shopify?",
    "selftext": "Not here to rant, but curious if others feel the same.\n\nI’ve been running my store on Shopify for a while, and honestly, the marketing side is what drains me most - not the sales.\n\nBetween juggling apps for SEO, email, and analytics, I feel like I’m spending more time fixing integrations than anything else. Also, those transaction fees add up fast if you’re not on Shopify Payments.\n\nWhat’s been the hardest or most annoying part for you - marketing or otherwise?  \n",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1759948612.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question about frustrations running a Shopify store; primarily a prompt for discussion.",
    "composite_score": 3.82618082412539
  },
  {
    "score": 97,
    "title": "Frustrated with how many Americans are rejecting parcels due to customs fees.",
    "selftext": "I do most my business in Europe and the UK. I get people rejecting parcels due to taxes sometimes in Europe but its not that common. When it happens, people are mostly reasonable about it.\n\nWith the US, since this mess started it’s ridiculous how many people are rejecting parcels. Even when they are warned before hand, and i personally let them know before hand before i ship.\n\nWhile i refund them minus shipping fees, it is still really annoying.\n\nMy concern is offering DDP will just nuke my sales because i cant have a competitive price. Adding €40 / $40 to shipping cost will seem way expensive compared to competitors too(obviously with DDU).\n\nIts frustrating because its literally been more than 50% of orders to the US since august resulting in this situation. Its making be quite bitter about US citizens to he honest. Especially because already i have had several very rude people call me a scammer and use profanity over it too.",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 97,
    "downs": 0,
    "created_utc": 1761720901.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Emotional frustration about customs fees and customer reactions; venting tone.",
    "composite_score": 3.6501446880450805
  },
  {
    "score": 95,
    "title": "Witnessed my first “Viral” sales campaign on a new ecommerce store with an influencer - $50k+ in 4 days. Made me think about using Affiliates…",
    "selftext": "I run my own e-commerce store and also build Shopify websites for people. I built a website for a client and three weeks ago, they had an influencer with a very decent sized following on YouTube/Rumble act as an affiliate (taking a cut) and promoted them on his live. They did $15k in sales on that first night, and another $26k sales sales the following day, and then consistent sales in the thousands per day since. \n\nI have never tried this with my business, but it really got me thinking that I need to attempt this type of marketing. Even if they take a cut, it would be worth it. \n\nFor the tech stack, they were running on Shopify basic (which held up just fine with all of the traffic) and it was wild to see the live feed on their dashboard. Always someone at the checkout and purchasing (especially on day 2). \n\nI just thought I’d throw this out there, if anyone has ever tried this type of marketing, or if you haven’t, it may be worthwhile to check it out. \n\nDoes anyone have any cool experiences like this? Would love to hear about it. \n\nNiche FYI is candles",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1745418309.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Narrative about a viral influencer campaign and reflections on affiliates; offers insight but not steps.",
    "composite_score": 3.5635563210885364
  },
  {
    "score": 93,
    "title": "First order from a stranger!!!!",
    "selftext": "Hi all, I’ve been lurking here for months. My partner and I have been doing everything for our brand ourselves &amp; we launched our niche products on 14th December. We have been figuring out meta ads &amp; doing a few tests. Except all the orders from friends &amp; family, we finally got our first order from a stranger today. It’s sooo sooo exciting and really boosts our confidence in our product &amp; website!\n\nUPDATE: we have 10 organic orders now! :)",
    "subreddit": "ecommerce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1702900648.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Personal milestone update without a list, model, or steps.",
    "composite_score": 3.5651128557677074
  }
]