[
  {
    "score": 131,
    "title": "Bad Ed tech companies",
    "selftext": "Is there a thread where we compile really bad Ed tech companies? I’m thinking about companies that are both bad for teachers/ students in that they provide a suboptimal experience and companies that are also horribly run and bad for their employees. \n\nIf it doesn’t already exist, can we start it here? I feel like there are many pompous opportunists (looking at you, Silicon Valley) who jump into Ed tech thinking they know teachers better than they know themselves and end up creating “solutions” for problems that didn’t exist.",
    "subreddit": "edtech",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 131,
    "downs": 0,
    "created_utc": 1742256990.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A request to start a thread compiling bad edtech companies; lacks substantive content to fit other categories.",
    "composite_score": 3.8199808573977085
  },
  {
    "score": 123,
    "title": "I’ve Taught Over 500 Students Online — Here’s What Actually Keeps Them Engaged (Not Just Grades)",
    "selftext": "After running online courses and workshops for the past 2 years, I’ve found some surprising things about keeping students engaged. Thought I’d share what’s worked:\n\n* **Shorter videos = better learning.** Even advanced students prefer 5–8 min chunks.\n* **Peer accountability &gt; grades.** Weekly check-ins with group members kept more people finishing.\n* **Gamification works… if subtle.** A progress tracker and \"streak\" feature helped motivate without feeling childish.\n* **Students love context.** Real-world examples beat textbook theory every time.\n\nCurious how others approach this — especially if you’re running online courses, bootcamps, or cohort-based education.",
    "subreddit": "edtech",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1748513425.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Enumerates multiple actionable items about what keeps online students engaged.",
    "composite_score": 3.5659966743221885
  },
  {
    "score": 93,
    "title": "Professor accused me of using AI for my thesis, technology actually saved me",
    "selftext": "Worst week of my academic life just happened. Submitted my senior thesis that I'd been working on since September. Three days later get an email to meet with academic integrity committee. My stomach just dropped.\n\nProfessor was convinced my writing was ai generated because it was \"too consistent\" and \"lacked typical student errors\". I'm just a decent writer who actually uses grammarly and proofreads. Tried explaining but they weren't buying it.\n\nThankfully I document everything obsessively. Had all my research notes, rough drafts, revision history in google docs. But what really helped was running my own work through GPTZero which showed it was human written. The irony of using ai detection to prove I didn't use ai wasn't lost on anyone.\n\nCommittee apologized but damage was done. Now I screenshot everything, save multiple drafts, and honestly considering recording myself writing. This guilty until proven innocent approach is getting out of hand but at least there are tools to defend yourself.",
    "subreddit": "edtech",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1759867819.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Shares a personal experience with AI detection and the reasoning behind defenses, offering insights.",
    "composite_score": 3.5276128557677078
  },
  {
    "score": 90,
    "title": "Have a new AI app for education? Read the rules or GTFO",
    "selftext": "The number of AI snake oil sales pitches we have on /r/edtech is unreal. *We. don't. want. it.*  \n\nThe overwhelming majority of these so-called \"products\" have no guardrails for protecting student data and therefore run afoul of laws regarding minors and their data. The ignorance is astounding — I suppose because AI didn't explain the market to the uninformed trying to make a buck off our schools. \n\nIf you have a product, know that we have a **no self-promotion** rule here. It's literally Rule #1. You want us to read your post, but you don't want to read our rules.   \nIf you have a product, post in the Developers thread. We've created this place for these types of posts, discussions, etc.  \nDo not create a post pitching your product. *We. don't. want. it.*\n\nIf your post's content is AI-generated, for sure, *we. don't. want. it*.  \n(At the very least you could try to remove the bold text from the AI generated trash you're slinging. You know, in an attempt to be authentic.)  \n\nIf you started your product with a notion like \"gee, this AI engine is pretty neat. I wonder how I can use this tool in a {school} setting. Now, let's go think of a problem AI can use.\" just know that *we. don't. want. it.*\n\nHave a video that uses stock footage and an AI-voiceover?  \nYou already know how that's going to go over. *we. don't. want. it.*\n\nAI is doing great things in a lot of industries, but by-and-large the majority of AI drivel in education are half-baked ideas wrapped up based an *assumptions* of what education needs.  \nFind the problem first. (*by actually talking with real schools*) Consider all the ways to solve that problem. If AI is it, so be it. Maybe there are other, better ways to tackle the problem. Are you going to be a problem solver? Then solve problems. But don't just sit around an imagine what problems schools must have, build a solution to your imaginary problem, then come to our community asking how to get schools to buy your imaginary solution. Why? Because *we. don't. want. it.*  \n\nDo not misunderstand the purpose of this post. We are not luddites. We are merely tired of non-educators pushing education \"solutions\" based on their imaginations.",
    "subreddit": "edtech",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 90,
    "downs": 0,
    "created_utc": 1743188915.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Expresses strong frustration with AI product pitches and rule-enforcement in the community.",
    "composite_score": 3.4571926427047375
  },
  {
    "score": 88,
    "title": "Disappointed In The Shift to AI infecting the Edtech World",
    "selftext": "I understand AI has the potential to change the way we teach and in the future the way students learn but almost all of my districts Edtech PD offerings now focus on AI. I remember when we were getting excited for things like Edpuzzle, Flipgrid, Classcraft and the list goes on and on. All of which were used by teachers AND students.\n\nUnless I'm out of touch with some new AI option on the edtech landscape, I've yet to be shown an actual AI tool meant to be used BY students. So what's the point? We can talk all about appropriate AI use for students, but there are still very few, if any, actual safe AI out there for teachers to put into the hands of kids. Why focus on all these useless tools that I cannot give my learners? \n\nI just want to go back to actual tools I could put in my kid's hands again to engage them in new ways instead of another 8 PDs all about how I as a teacher could us AI. \n\n  \nDoes anyone else see this happening in their districts too? ",
    "subreddit": "edtech",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 88,
    "downs": 0,
    "created_utc": 1747541318.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.58,
    "category_rationale": "Vent about AI-focused PDs and the perceived mismatch with actual classroom tools.",
    "composite_score": 3.572479993636856
  },
  {
    "score": 80,
    "title": "EdTech is booming, but are we actually solving real problems?",
    "selftext": "I’ve been following the EdTech space closely over the past couple of years - as both an educator and a tech enthusiast - and I keep coming back to one question:\n\nAre most EdTech startups actually helping students *learn better*… or are we just building shinier ways to deliver the same old stuff?\n\nDon’t get me wrong, platforms like AI tutors, auto-grading tools, and LMS dashboards are super impressive. But sometimes it feels like we're optimizing for admin convenience and investor decks, not deep learning.\n\nWhere’s the focus on motivation? On building curiosity? On helping learners *struggle productively* instead of just gamifying everything to boost retention?\n\nCurious to hear from other educators, students, devs in the space -\n\n* What’s an EdTech tool that actually made a difference in how you learned or taught?\n* And what’s something you wish existed but still haven’t seen built?\n\nLet’s talk about the *real* potential of EdTech- not just the flashy stuff.",
    "subreddit": "edtech",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 80,
    "downs": 0,
    "created_utc": 1751913306.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Offers a critical, model-based view on whether EdTech solves real learning problems with inviting questions.",
    "composite_score": 3.5701968966221247
  },
  {
    "score": 79,
    "title": "teaching kids programming (tools and approaches that helped)",
    "selftext": "been helping my kid learn to code and figured i'd share what's actually been useful vs what sounded good but flopped. lot of conflicting advice out there so here's the practical stuff that worked (at least in my case)\n\nwhy block coding first matters\n\ndon't skip this even if it seems too simple. scratch and scratch jr aren't just toys, they teach actual logic without syntax overload. concepts like sequencing, loops, conditionals all make sense visually before you add typing into the mix.\n\nmy kid was building interactive projects within a couple weeks, which kept motivation high. when we eventually moved to python the logic was already there, just had to learn the syntax.\n\nthe fundamentals you can't skip\n\n\\- sequencing (order of operations)\n\n\\- loops (for, while)\n\n\\- conditionals (if/then/else)\n\n\\- variables (storing and changing data)\n\n\\- functions (reusing code blocks)\n\nthese concepts carry over to every language. spend way more time here than you think you need to. if they understand the why behind code structure, learning new languages later is just learning new syntax.\n\nproject based learning vs tutorials\n\ntutorials are fine for the first few sessions to understand how stuff works. after that if you're just having them copy code they'll zone out.\n\nlet them build what they want. break it into tiny achievable pieces. each session should have visible progress, even if it's small. way more engaging than following some 40 minute tutorial they don't care about.\n\n1:1 attention vs group classes\n\ntried both, 1:1 made way more difference for us. in group settings kids either fall behind and get frustrated, or they're bored waiting for others to catch up. individualized feedback when code breaks matters a lot, because if they have to wait days to figure out why something didn't work they've already lost interest.\n\ntools by age and skill level\n\nfor ages 5-8:\n\n\\- scratch jr (visual, simple, free)\n\n\\- code.org basic courses (gamified, structured)\n\n\\- tynker junior (subscription but very kid friendly)\n\nfor ages 9-12:\n\n\\- scratch (more complex projects, huge community)\n\n\\- blockly (bridges to real code)\n\n\\- minecraft education edition (coding within something they already like)\n\n\\- early python with turtle graphics (visual output helps)\n\nfor ages 13+:\n\n\\- python (most versatile beginner language)\n\n\\- javascript for web stuff (immediate visual results)\n\n\\- processing or p5.js for visual/creative coding\n\n\\- unity if they want game development\n\nplatforms with structure and instructors\n\nif you can't or don't want to teach it yourself:\n\n\\- khan academy (free, self paced, covers fundamentals well)\n\n\\- code.org (free, structured curriculum)\n\n\\- codeyoung or code ninjas (live instruction, 1:1 or small groups)\n\n\\- outschool (individual classes on specific topics)\n\n\\- codecademy (older kids, text heavy but thorough)\n\nwhat didn't work for us\n\n\\- hour long sessions, attention span maxes out around 30-40 mins\n\n\\- expecting self teaching from youtube, needs real interaction\n\n\\- jumping to python without block coding first, too abstract\n\n\\- forcing \"\"educational\"\" projects instead of letting them build what interests them\n\npractical tips that helped\n\nkeep sessions short and frequent rather than long and occasional. 30 mins three times a week beats 90 mins once a week.\n\ncelebrate bugs as learning opportunities. debugging teaches way more than code that works first try.\n\nconnect coding to their interests. if they like sports, code a scoring system. if they like art, use processing. makes it relevant instead of abstract.\n\ndon't worry about teaching \"\"correctly\"\", half the time you're figuring it out together and that's fine. shows them that learning is a process, not just knowing everything upfront.\n\nprogression path that made sense\n\nblock coding (2-3 months) to understand logic without syntax stress, then transition to text based with something visual like python turtle graphics so there's still immediate feedback, then move to actual projects they care about once fundamentals are solid.\n\nPlease always make sure each step builds confidence before adding complexity, DO NOT overwhelm your child. if they're struggling at any stage, go back and spend more time there. No rush.\n\nanyone else teaching kids to code? what tools or approaches worked or completely failed for you?",
    "subreddit": "edtech",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1766067161.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Provides a practical, itemized guide of tools and approaches that helped teach programming.",
    "composite_score": 3.2732262395435967
  },
  {
    "score": 72,
    "title": "'member Prezi?",
    "selftext": "Feeling nostalgic, and I just wanted to remember how freaking cool Prezi was when it first came out (or at least, when I was first using it). The zooming transitions were like \"Wooow.\" You had to think in three dimensions when designing them - which was so challenging for me, but I did it anyway and felt really accomplished. Gosh; I miss... 2012? 2014? When was that exactly?\n\nDid you like Prezi? Which techs do you miss \"when they were new?\"",
    "subreddit": "edtech",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1710279323.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A nostalgia/nostalgic question about Prezi and old tech, not a substantive theory or list.",
    "composite_score": 3.3215047421999495
  },
  {
    "score": 54,
    "title": "Is the \"AI Personal Tutor\" dream a trap? Need a gut check",
    "selftext": "Alright Reddit, I need some outside perspective.\n\nMy day job is building AI for personalized learning, and I'm genuinely stuck on whether we're heading for a utopia or a disaster.\n\nThe dream we're sold is amazing, right? A world where every learner gets a perfect, patient tutor. The person totally lost in a subject gets help until it clicks, and the person who's miles ahead gets pushed so they don't get bored. No more one-size-fits-all education.\n\nBut the flip side is what keeps me up at night.\n\nAre we just engineering the struggle out of learning? That struggle is where you build resilience and actual critical thinking. Are we just making a super-crutch that stops people from learning how to learn on their own?\n\nAnd the biggest fear: is this just another luxury for wealthy schools, making the education gap even wider?\n\nI'm not trying to sell anything. I'm just a founder trying to make sure the thing I'm building does more good than harm.\n\nSo, where do you think the line is? **What makes an AI tool a genuine help vs. a harmful crutch?**",
    "subreddit": "edtech",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1757697048.0,
    "media": null,
    "is_video": false,
    "num_comments": 116,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Discusses the potential and risks of AI personal tutors and asks for criteria to distinguish helpful vs harmful.",
    "composite_score": 3.456955620367325
  },
  {
    "score": 52,
    "title": "Remember when edutaintment software for kids was huge? Reader Rabbit. Carmen Sandiego. Jumpstart?",
    "selftext": "Do you remember back in the 90s and early 2000s when \"edutatinment\" software (by that I specifically mean educational software for kids) was huge?\n\nMy kids used Jumpstart, Starfall, Webkinz, Club Penguin... so many great software titles and online communities where education was part of the fun.\n\nThen all of a sudden... they disappeared. I always wondered about it, so I did some reading and was shocked to find out ONE GUY destroyed the entire industry: Kevin \"Mr. Wonderful\" O'Leary.\n\nI made a short video about it: https://www.youtube.com/watch?v=clBWy_kTebk\n\nNow when you google edutainment, its mostly adult vocational/job training stuff and an entirely different market.\n\nThere are a few players who still make kids entertainment, but its like millions of dollars of revenue instead of billions. Esports veteran Doublelift often laments the death of Club Penguin.\n\nDo you think this market could come back?\n\nHas the internet changed in ways to make it no longer viable?\n\nWhat do you think?\n\nPersonally, I miss it and think everything we've learned about online learning (especially post-Covid) could help us make some pretty spectacular learning software/games.",
    "subreddit": "edtech",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1741161782.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.56,
    "category_rationale": "Nostalgic reflection and a question about market revival, not a substantive post.",
    "composite_score": 3.150745873936808
  },
  {
    "score": 41,
    "title": "I tried to break into tech industry...so I completed 11 professional certificates from Coursera ( from Google/IBM/Unilever)",
    "selftext": "Between 2021 and 2024 I have completed 11 programs. \n\nI took (in that order):\n- Google: \n * Project management \n * Data analytics \n * Digital marketing and E-commerce \n * UX Design \n * Business Intelligence \n * Advance data analytics \n\n- IBM:\n * IT project manager\n * Project manager\n * IT Scrum Master\n * Product manager \n\n- Unilever :\n *Digital marketing analyst \n\nI also took courses from Mind the product in product management including :\n* Product analytics\n* Product-led \n* AI for product management\n\nI really enjoyed learning these programs, they contain a lot of information, they are very well structured and Coursera is a great platform.\n\nNow, regarding the outcome on the job market all I can say is that all these didn't help me to get a single job offer. I managed to get a single physical interview in 3 years.\n\nI have a degree in business.\nTo add more context I'm part of minority in France (I'm Arab).\n\nI'm wondering what should I do now, obviously these programs are not the solution to my situation.\nWhat should I try now? A micromaster? A bootcamp ? A university certificate? A master degree (I can't afford it btw)?\n\nIt's hard to get reliable information...\n\n",
    "subreddit": "edtech",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1713347159.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal narrative seeking career guidance rather than a how-to or list.",
    "composite_score": 3.149824915589722
  },
  {
    "score": 43,
    "title": "Troubling Trend in EdTech Subscriptions",
    "selftext": "Hey all! I’m a tech director of a public school district in a semi-rural area of the US. We have about 250 students and roughly 40 teachers/learning staff. We do not receive significant public or private funding, but we’ve managed to get by. We made the move to 1:1 several years ago but Covid saw an explosion of new edtech on the market making use of all the federal funding. I think that’s really where the problem started. Since Covid-times, subscription costs are going through the roof and apps we’ve used for years we are now having to drop because we simply can’t afford them. I’m not talking about 3-5% annual YoY increases (which I actually expect), I’m talking about 3x the cost increases. When pressing vendors they’re saying “new features” are the cause, but we didn’t ask for them. Instead of gating the new features behind paywalls, they just force everyone to pay to adopt them. Our only recourse has been to not renew - but then the students and teachers suffer. \n\nProbably screaming into the void, but is everyone seeing these massive increases? Are vendors even listening and/or in tune to the financial state of public schools in this country?",
    "subreddit": "edtech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1725196607.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Emotional critique of rising EdTech costs with a request for discussion.",
    "composite_score": 3.1654866986613253
  },
  {
    "score": 41,
    "title": "Don’t you think schools should teach a subject on AI — how to use it correctly and ethically?",
    "selftext": "With how fast AI is evolving, it feels like students should be learning how to *actually use* tools like ChatGPT, image generators, coding assistants, etc.\n\nNot just for fun or cheating, but for things like research, brainstorming, project planning, and even creative writing.  \nAlso, how to avoid misinformation, use AI responsibly, and understand the limits of it.\n\nCurious what others think — should this be a proper subject in schools, or at least part of digital literacy?",
    "subreddit": "edtech",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1744714801.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Advocates for AI literacy with rationale about usage and ethics.",
    "composite_score": 3.187673835766528
  },
  {
    "score": 35,
    "title": "Is EdTech narrowing what education can be?",
    "selftext": "First-time poster here. I work in online learning and have been reflecting on how much of EdTech, especially platforms and automation, seems to narrow, rather than expand, our sense of what education could be.\n\nToo often, tools prioritise efficiency, standardisation, and surveillance over dialogue, autonomy, and imagination. Are we shaping technology to serve learning, or letting it shape learning to serve the system?\n\nI'd be interested to hear how others are navigating these tensions - what's working, what isn't, and where the real opportunities for change might lie.",
    "subreddit": "edtech",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1750188929.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Critical reflection on EdTech's impact and a prompt for discussion.",
    "composite_score": 3.0719231194550805
  },
  {
    "score": 33,
    "title": "Is Duolingo actually useful for learning a language, or is it just super engaging?",
    "selftext": "Since my college days, Duolingo has always been super popular. But even back then, I had this doubt — is Duolingo really *effective* for actually learning a language (like being able to speak and write properly)? Or is it just one of the most *engaging* apps out there, cleverly designed like a game but for education?\n\nRecently, I decided to seriously try it out for a few weeks. And honestly, it *is* insanely engaging.  \nBetween the streaks, friend leaderboards, scorecards, energy system, mobile widgets showing your streaks, notifications, and all that stuff — it keeps pulling you back.\n\nEven their marketing doesn’t feel like typical \"edtech\" marketing — it’s way more organic and fun.\n\nBut despite using it regularly, I still can't figure out:  \nAre people really learning languages deeply through Duolingo? Or are we all just staying engaged because of the app’s game-like features?\n\nWould love to hear your thoughts — if you’ve used Duolingo for a while, did it actually help you *speak/write* a new language confidently?",
    "subreddit": "edtech",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1745830318.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Evaluates language-learning effectiveness and asks for evidence from users.",
    "composite_score": 3.0338707153506603
  },
  {
    "score": 34,
    "title": "I create web apps for teachers for free. If you have an idea of something you’d like, comment it and I’ll make it for you",
    "selftext": "Mostly title\n\nEdit: I made a mistake in my original post regarding the apps being open source. Please see my follow-up clarification below. Thank you!\n\nI started creating educational software about a year ago and I was going to sell it, but as I got closer to getting my teaching certificate I saw just how much money teachers usually have to spend for resources and software they use in their class. Now I am going to teach and make software on the side, but put it all out for teachers to use: free and open source. \n\nI started a “non-profit” (quotation marks because I don’t have any filing) called [Teaching for Tomorrow](https://www.teaching4tomorrow.org) where I have been creating web apps and teaching educators about AI. Now I want to make some more stuff. \n\nIf you have ever had an idea like, “oh I wish I had that.” I would love to know what “that” is. Give me your ideas and I will turn them into actual web apps that you can use for free and open source. You can check out the website to try out the newest one, Aurora, a lesson designer that uses GPT calls and a script I made to create pretty slideshow presentations at the click of a button. ",
    "subreddit": "edtech",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1717707938.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Brief proposal to build free, open-source educational apps; not a how-to.",
    "composite_score": 3.0817493890973977
  },
  {
    "score": 35,
    "title": "7 must-have Chrome Extensions for Teachers in 2023",
    "selftext": "Hey educators,\n\nI'm always looking for tools to make our classroom life easier. And today, I'm excited to share my top 7 favorite Chrome extensions that have been game-changers for every teacher. Whether you're looking to streamline your grading process, improve your written communication, or get more organized, these extensions are worth a shot.\n\n1. [Grammarly](https://chrome.google.com/webstore/detail/grammarly-grammar-checker/kbfnbcaeplbcioakkpcpgfkobkghlhen): This proofreading tool will help you write error-free emails, assignments, and more.\n2. [Grading Assistant](https://chrome.google.com/webstore/detail/grading-assistant-transfe/nlgjbkohnabomkgcfgihkacllbbdfoca): Say goodbye to manual grading and hello to time-saving efficiency. This extension easily transfers and scales grades from multiple edtech platforms to your gradebook.\n3. [Screencastify](https://chrome.google.com/webstore/detail/screencastify-screen-vide/mmeijimgabbpbgpdklnllpncmdofkcpn): This extension is the perfect solution for teachers looking to create engaging instructional videos, capture important lessons, or record presentations. It's easy to use and offers a range of customizable features to help you easily create high-quality videos.\n4. [Smallpdf](https://chrome.google.com/webstore/detail/smallpdf-edit-compress-an/ohfgljdgelakfkefopgklcohadegdpjf?hl=en): This extension is your go-to tool for all PDF-related tasks. Whether you need to compress a large PDF file, merge multiple files into one, or convert a document to a PDF, Smallpdf has got you covered. With its user-friendly interface and reliable performance, you'll wonder how you ever managed without it.\n5. [Workona Tab Manager](https://chrome.google.com/webstore/detail/workona-tab-manager/ailcmbgekjpnablpdkmaaccecekgdhlh): Teachers often have many tabs open at once, and keeping track of them can be challenging. Workona Tab Manager makes it easy to keep your tabs organized and saves your work for later, so you never have to worry about losing an important tab again.\n6. [Todoist](https://chrome.google.com/webstore/detail/todoist-for-chrome/jldhpllghnbhlbpcmnajkpdmadaolakh): This to-do list app helps you stay on top of your tasks and never miss a deadline again. With its easy-to-use interface, you can add, prioritize, and complete tasks with just a few clicks. Whether you're managing a lesson plan or a personal to-do list, Todoist is the perfect tool to keep you organized and on track.\n7. [Equatio](https://chrome.google.com/webstore/detail/equatio-math-made-digital/hjngolefdpdnooamgdldlkjgmdcmcjnc): This extension makes creating mathematical equations and formulas easier. Whether you're teaching a math lesson or need to create a formula for your work, Equatio makes it simple and intuitive. With its drag-and-drop interface and intuitive tools, you'll be able to create complex equations in no time.\n\nThese extensions have been a lifesaver for me, and I'm confident they'll make a difference for you too. Tell me in the comments which ones you try and how they work!",
    "subreddit": "edtech",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1675358883.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.95,
    "category_rationale": "List of seven Chrome extensions presented as must-have tools.",
    "composite_score": 2.6463515207744157
  },
  {
    "score": 30,
    "title": "Does Gamification Actually Work for Students?",
    "selftext": "Hey everyone!\n\nI’ve been exploring **gamification in education** and wondering—does it actually improve student engagement and learning outcomes? Have you seen measurable success with leaderboards, badges, or game-based challenges?\n\nAlso, if you’ve implemented gamification in your **institution** (or know of good examples), what worked well? Any pitfalls to avoid? I’d love to hear practical insights on how to integrate it effectively.\n\nLooking forward to your thoughts!",
    "subreddit": "edtech",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1743074250.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Discusses gamification effectiveness and asks for practical lessons.",
    "composite_score": 3.036543038581395
  },
  {
    "score": 31,
    "title": "Is ISTE worth attending just for the expo hall?",
    "selftext": "I’m currently a cyber charter teacher. I spent several years before that in a traditional brick-and-mortar public school before transitioning to cyber teaching, and while I like what I do, I’m starting to think ahead about career growth over the next few years. I want to stay in education, but I’m not looking to go back to the classroom. I’m more interested in exploring roles in ed-tech and seeing what opportunities might align with my skill set.\n\nOne thing I noticed is that ISTE will be in Orlando this summer, and since Florida is already a favorite vacation spot for myself and my family, I could potentially combine it with a summer trip and fly down there during the week of the convention. I’m not planning on doing the conference sessions, especially since I’m not attending on a school district’s dime. I would be attending on my own. I’m just thinking about visiting the expo hall and getting a feel for the companies and job possibilities in the ed-tech space.\n\nIn my situation, do you think it is worth attending just for the expo hall? Would walking the floor, talking to company reps, and seeing what’s out there be helpful for someone exploring a potential career shift into ed-tech? I think expo hall access is free, so I’m wondering if it’s a worthwhile way to start gathering information before doing deeper research into the specific roles that might match my background. Or are there other Edtech career fairs that you may recommend over this? \n\nI’m just trying to piece together where to go next when considering a career pivot from teaching.",
    "subreddit": "edtech",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1764012585.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Career-exploration question about ISTE expo hall value; lacks a structured guide.",
    "composite_score": 2.8645267787963204
  },
  {
    "score": 30,
    "title": "EdTech Saas Exit Plan for Older People",
    "selftext": "I'm worn out, y'all. My background is in K-12 education and libraries, and since moving into ed-tech, I've worked at a few of the biggest companies in those markets. I'm currently working sales, which in itself is exhausting work, but I think I'm also just worn out by the company culture that can be ubiquitous in this industry. We're all just SO HAPPY to be doing such MEANINGFUL WORK each day, you know? But behind the scenes, everyone is working way more than 40 hours per week and it's for much less than you'd be making outside of the education world. However, there are so many people desperate to get out of teaching that they know they could replace you in seconds, so you just suck it up and accept the pennies they're offering. Meanwhile Marketing is angry with us because we're not liking and sharing their social media posts enough via our private accounts, and the Recruitment team is demanding that each and every one of us review the company positively on GlassDoor \\*right.now\\*. Yeah... we're so happy! \n\nAnyway, things are coming to a head and I feel like my years of customer service and sales work are coming to an end and I just want a job with no human interaction. I just want 8 hours of work in front of me each morning, and I just want people to leave me alone while I do it. Maybe it's also the company retreat coming up where last year we had a citywide scavenger hunt. (mandatory fun) Guys, I'm 50, not 20. My knees hurt and I'm tired. \n\nCan anyone relate? Does anyone have an exit plan for themselves? I've been looking around, and although I have like 30 years of experience, it seems like the job that I would want would mean I'd be making maybe $20 an hour if that. Is that my fate? Is there anything else? I'm too young to retire, but god I don't know if I can handle anything related to anything that I've been doing these past three decades any longer. ",
    "subreddit": "edtech",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1752880108.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Emotional vent about EdTech culture and burnout.",
    "composite_score": 2.8190861545234096
  },
  {
    "score": 29,
    "title": "How do you approach building EdTech when the user base doesn’t want more EdTech?",
    "selftext": "EDIT: I am so glad I reached out to this community for advice! Y’all’s advice has been very constructive and uplifting.  I’ve learned many things from you all and have many lessons learned to take back.  I will make sure to keep you all posted on the progress, have a great summer! :)\n\nI’m building a tool to help teachers analyze student writing by surfacing patterns in argument structure and potentially identifying signs of shallow understanding. I shared a bit of it with the user community, not to promote it, just to ask what they’d actually want from a tool like this.\n\nThe feedback was… intense. Some helpful. Most were hostile. And a recurring theme was this: “EdTech isn’t the problem. Time, pay, class sizes, burnout that’s the problem.”\n\nI get it. Teachers have been burned by flashy tools that don’t actually reduce their workload or respect their expertise. But I still believe there’s value in building with educators if you do it transparently and with empathy.\n\nSo I’d love to hear from this community:\n\t•\tHow do you navigate early feedback from user groups that feel overburdened or hostile to the category you’re building in?\n\t•\tHow do you stay grounded in real needs, not just product ideas?\n\t•\tHave you ever turned a skeptical community into a helpful one?\n\nNot trying to pitch anything here, just trying to build with more awareness and avoid being another “solution” to a problem no one asked to be solved.",
    "subreddit": "edtech",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1749552863.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Discussion seeking advice and lessons learned; lacks a clear list, model, or steps.",
    "composite_score": 3.018696879911484
  },
  {
    "score": 26,
    "title": "Media literacy",
    "selftext": "4 states have passed media literacy requirements in the past 1.5 years. Most media literacy curricula are from a pre-internet age. They don't prepare kids for the age of TikTok and Twitter. We're building an EdTech product to integrate media literacy into social studies and ELA. We focus on building the learner's autonomy over media exposure and meaning construction. Two questions.\n\n1. What's the hardest part of teaching media literacy today?\n2. What, if anything, do you want in a software tool that helps you teach media literacy?",
    "subreddit": "edtech",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1709076818.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Questions seeking input on media literacy without an explicit step-by-step framework.",
    "composite_score": 2.7515882248481245
  },
  {
    "score": 27,
    "title": "Is ChatGPT banned at work but would actually be useful?",
    "selftext": "I'm investigating the demand for generative AI services like ChatGPT in heavily-regulated industries like education, where they might well be banned on security/privacy grounds.\n\nDo you see much demand from education workers? Are they missing out due to a potential ban?\n\n(Disclaimer: I work at a company building encrypted and eyes-off gen AI tools, and we're trying to understand potential pain points)",
    "subreddit": "edtech",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1707917539.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Exploratory question about demand for ChatGPT in regulated environments; no guidance/steps.",
    "composite_score": 2.9402786500300127
  },
  {
    "score": 28,
    "title": "Teacher looking to transition to edtech - any suggestions?",
    "selftext": "I’ve been teaching for about 10 years now in a variety of different schools and subjects (primarily ELA and History). I am looking for a change that would take me out of the classroom and allow support the capacity building of teachers, even tangentially. I think edtech would allow me to use many of the tools I have honed as a teacher. Do you all have any suggestions about how to make the transition? Specific type of roles to look at? I see career coaches that advertise  that they specifically support transitioning teachers, is this worth the money or is there a better place to spend money to make myself more marketable(without going to graduate school)? Any suggestions would be much appreciated.",
    "subreddit": "edtech",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1680258969.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Career-transition question; asks for suggestions rather than a how-to process.",
    "composite_score": 3.056473623090778
  },
  {
    "score": 25,
    "title": "Lesson Plan Generator for teachers!!",
    "selftext": "**Exciting news for all educators!**  \nWe've made a tool to make lesson planning more seamless and effective for all educators.\n\n# [Lesson Plan Generator](https://lesson-plan-generator.vercel.app/).\n\nIt is simple to use, aligned with 5 step lesson planning approach and allows for customization according to the needs of the curriculum.\n\n&gt;Simply select the grade, subject, and Bloom verb. Briefly describe the topic you want to cover. And, done.  \nThe Lesson Plan Generator will give you a lesson plan with a **clear Objective** for the class, an **interesting intro**, **engaging activities**, and **scaffolded questions** for students to practice.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/m1sa5rawq9va1.png?width=2880&amp;format=png&amp;auto=webp&amp;s=ee3627faffb586bb5112a46851487133f3f65af7",
    "subreddit": "edtech",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1682096491.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Promotional post describes a repeatable sequence to generate a lesson plan (select inputs, produce plan).",
    "composite_score": 2.697697808659955
  },
  {
    "score": 25,
    "title": "Most Innovative (Ed)Tech 2023",
    "selftext": "Hello everyone, I am working at a university in the sector of digital education / e-learning. We are always looking for innovation in technology that can be used in teaching and learning.\n\nSince it's the end of the year and we still have a small budget that can be spent on innovative technology (4 - 5K), I wanted to ask the community:\n\n- What is the most innovative piece of technology (hardware or software) that you saw this year? \n\n- It can be technology that fits in the sector of new work, hybrid learning, digital learning, immersive technologies, Productivity...\n\nWr are already working with the VR Headsets, AR Headsets, ChatGPT, The Remarkable, Boox Devices and so on. So I would be highly interested in your ideas that would fit in this kind of sector of innovative tools. :)\n\nThanks in advance!",
    "subreddit": "edtech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1703194532.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Request for innovative EdTech ideas; no actionable steps or model.",
    "composite_score": 2.8043501484472326
  },
  {
    "score": 25,
    "title": "Discussion: The 'Close Screens, Open Minds' movement wants tech out of classrooms. A valid concern, or a step backward for education?",
    "selftext": "We've been watching the \"Close Screens, Open Minds\" movement get more press lately, especially with people like Hugh Grant backing it. It's got us thinking, and we wanted to use this space as a bit of a sounding board.\n\nOn one hand, you see the headlines about screen addiction and the concerns from child psychologists, and you can't just dismiss them. We all know the tightrope we walk between creating engaging tools and contributing to digital fatigue.\n\nBut on the other hand, the call to completely remove tech from classrooms feels like a massive step backwards. We're all in this space because we believe tech can unlock incredible learning opportunities and prepare kids for the world they'll *actually* live in.\n\nSo, what’s the real talk here? Is this a moral panic from people who don't grasp what modern education demands, or are there hard truths in their criticism that we, as creators, need to properly address?\n\nWhat's your take?\n\n* Where do you personally draw the line between useful tech and digital overload in a school?\n* Isn't it on us to be leading the charge on digital wellness? What does that even look like in practice?\n* How do we get better at showing skeptical parents that a tablet in the classroom isn't just a glorified YouTube machine?\n\nGenuinely curious to hear what this community thinks.",
    "subreddit": "edtech",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1756201492.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Discussion prompts about tech use in classrooms; no structured guidance.",
    "composite_score": 2.7756552300503117
  }
]