[
  {
    "score": 160,
    "title": "Really impressed with CloudHQ's suite of tools!",
    "selftext": "I do marketing for a living and I have worked for enterprise-level companies using platforms like Eloqua, Marketo, Hubspot, etc. So, point being, I have worked with some of the top-of-the-line tools out there.\n\nI lead a small dinner group and wanted to send out some communications from my personal email, so I went in search of a tool that could do some basic email marketing-like functions (templates, merge tags, integrations with other platforms, etc.) I ended up finding CloudHQ (https://www.cloudhq.net). They have many different \"apps\" for various email productivity functions for Gmail and other mail platforms (some examples are backing up emails to a spreadsheet, email tracking, etc). I have been using their Gmail templates app for nearly two years now and have consistently been impressed with the functionality. There is a very large selection of pre-built templates, or you can also build your own using their WYSIWYG builder. The email tracking works flawlessly. And I am able to do some rudimentary customization as well with their merge tags. They also have built-in integrations with MailChimp and Hubspot, allowing you to directly import them into Gmail. \n\nI have been pleasantly surprised to find such a powerful platform out there that is fairly inexpensive, especially given the value it provides, and I just wanted to share my discovery with this community!",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 160,
    "downs": 0,
    "created_utc": 1716949723.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.371874896038978
  },
  {
    "score": 136,
    "title": "How do you respond when people say email marketing is dead?",
    "selftext": "I've heard from some people that email marketing is dead, but I'm not fully convinced. I also read somewhere that businesses should expect email marketing to bring in at least a third of their total sales. If businesses do reach this goal, I’d like to know how they are doing it so maybe we can learn from them, and I can finally say to those who doubt it that email marketing is not dead.\n\nWhat has been your experience with email marketing lately? Is it still a valuable channel for your business?",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 136,
    "downs": 0,
    "created_utc": 1713874341.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8314697927781904
  },
  {
    "score": 120,
    "title": "What I wish someone told me when I started email marketing",
    "selftext": "I've been writing copy professionally for about 5 years now, and I wanted to share some thoughts for anyone getting into this field or considering it.\n\n1. It's not about being clever, it's about being clear. When I started, I thought good copy meant witty wordplay and creative turns of phrase. Sometimes that works, but most of the time, simple and direct beats clever every time. Your reader shouldn't have to work to understand what you're saying. \n\n2. You're solving problems, not writing literature. The best copy addresses a specific pain point or desire. Before you write a single word, understand what problem your audience has and how your product/service solves it. Everything else flows from there.\n\n3. Features tell, benefits sell. This is copywriting 101, but it took me way too long to really internalize it. Nobody cares that your blender has a 1200-watt motor (feature). They care that it pulverizes frozen fruit into silky smoothies in 30 seconds (benefit).\n\n4. The headline does 80% of the work. If your headline doesn't hook someone, they're not reading the rest. I usually spend half my time on headlines alone. Test multiple versions. Make it specific, make it compelling, make it about the reader.\n\n5. Read your copy out loud. If it sounds awkward or robotic when spoken, it'll read that way too. Good copy has rhythm and flow, even in B2B contexts.\n\n6. Steal like an artist. Keep a swipe file of ads, emails, and landing pages that made you stop and pay attention. Study what works. You're not copying—you're learning structure, psychology, and what resonates.\n\nThis is basic stuff, maybe a quick checklist if you are stuck in your journey.\n\nAnyone else have lessons they learned the hard way? \n\n  \nTLDR; write like a 3rd grader, point out one pain point, answer wiifm quickly, headline is 80% of the work, read your copy out loud, steal ideas from swipe files.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1763534992.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6151771686248555
  },
  {
    "score": 105,
    "title": "I created a subreddit about email marketing tutorials",
    "selftext": "I recently created a dedicated subreddit focused entirely on email marketing tutorials. It's a space where enthusiasts and professionals alike can come together to share insights, tips, and best practices. Whether you're new to email marketing or a seasoned expert, you'll find valuable content and discussions here. My goal is to build a community where we can all learn from each other and stay updated on the latest trends and strategies. Join us to elevate your email marketing game and connect with like-minded individuals!\n\n[***click here to start free trail of Constant Contact (Email Marketing Tool)***](https://webhostingpromo.com/reddit/ConstantContact)",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 105,
    "downs": 0,
    "created_utc": 1723825365.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.22280586526477
  },
  {
    "score": 96,
    "title": "Things I would never do after sending millions of cold emails.",
    "selftext": "After I've been doing this for quite some time, I decided to give you guys some tips on copies. This is not some kind of self-promotion, just genuine free tips. \n\n**Beginner tips**  \n\n\n1. Do not include words related to money, free, fast, urgency ctas, and percentages with numbers. \n2.  Keep emails breef: Aim for less than 50 words in your emails for a 43% boost in response rate. \n3. DO not include numbers in the subject line (unless you know what you are doing)\n4. Better response rates Wednesdays and Thursdays use that to your advantage\n5. Limit questions, only one question per email\n6. First email is about engagement and **NOT SALES**\n7. Remember to warm up your emails properly\n8. Use easy-to-understand language, unless you speak with a C-level from larger companies.\n9. Adding a P.S. can lead to increase in reply rate if used with personalization.\n10. Keep reading time short, around 15 seconds is optimal\n11. **DO NOT TRACK OPEN RATE. -Why?** There is a code included in tracking open rate, and its not even that important compared to reply rate.\n12. Do not include your website name/link, if you send a lot. Your website will get spam penalized. Which will mean, that anyone sending emails containing your website name = spam\n\n**Advanced tips**\n\n1. The more you use personalization the better, include something about their business numbers, It's incredible how much you can find if you are not lazy.\n2. Remember to use Spintax for each sentence if you are sending a lot of emails (2k emails per day)+ add the spintax by 1 for each 10k per email you send per day. Starting at 2k email. Example (2k email --&gt; 1 spintax --&gt; 12k email per day --&gt; 2 spintax... and so on) \n3. Do A-B-C Testing all the time, that is the only way to improve your reply rate. To begin with make the differences between the ABC a lot, then next month narrow it down, and keep doing that.\n4. Include a phone number at the bottom, but only if you have at least 4-5, so you can spintax those as well. \n5. Keep a detailed document, where you keep track of your analytics of your copies, if you don't do this, you are still considered a beginner. One of the biggest mistakes I see if someone who just rolls out with different copies each month, and before they know it, they use the same copy they did a year ago, because they don't keep track.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1700762081.0,
    "media": null,
    "is_video": false,
    "num_comments": 111,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7163807456013354
  },
  {
    "score": 83,
    "title": "Screw it! Email Love Pro has been discontinued, and all of the features are now available for FREE.",
    "selftext": "If you're not familiar with Email Love, we're an email inspiration website that also has analytics and reports by category and brand. We launched in June, and we were charging $19 per month for full access to the site.   \n  \nAfter running the numbers and chatting with our AI overlords about it, I realized our conversion rate was 0.24%. That tells me this just isn't something our larger audience is willing to pay for. We have 40,000 people visiting the site every month, and only a handful converted to paid customers. THANK YOU to those people. I appreciate you so much, and I'm emailing you all personally.  \n  \nYes, we could invest more money into it, try to figure out why people weren't buying, and I think over time we could have built it into a $10K MRR product. But it would take years to get there.  \n  \nThe other option? Make it free, grow our community, and focus on what's actually working, which is the Email Love Figma Plugin.  \n  \nSo Email Love Trends, Journeys, and Brand Insights are now all available for free. You do need to sign up for an account, but after that, it's all ungated.  \n  \nMy only ask: Use it. Enjoy it. Share it with your mates. We'll continue to add new brands, curate the very best emails, and add in-depth journeys and analysis.  \n  \nHope you find this useful!   \nAndy",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 83,
    "downs": 0,
    "created_utc": 1762381719.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4905643741108494
  },
  {
    "score": 71,
    "title": "The pricing for Email Verification is a scam...",
    "selftext": "Pretty much every Email Verifier in the market is extremely over priced relative to what they are actually doing. \n\nRanging from $25-$75 to validate a simple 10k email list \n\n&amp;#x200B;\n\nSo I did something about it.\n\n&amp;#x200B;\n\nI was able to create a in-house tool for my agency that could validate more than 100k emails for less than $1 dollar using server-less cloud infrastructure. And the results are comparable to never bounce and Million verifier. I've been sitting on this tool for a couple months now.\n\n&amp;#x200B;\n\nAnd decide to release it completely for free.\n\n&amp;#x200B;\n\nNo Payment, No Pricing, No catch. Just a side project.\n\nLiterally a Free unlimited email verifier.\n\n&amp;#x200B;\n\nThis is just a big fuck you to all those email validators for charging those ridiculous prices.  Have Fun!  \n\n\n[www.lumrid.com](https://www.lumrid.com)",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1710854148.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4790750058705933
  },
  {
    "score": 67,
    "title": "Tried something weird with AI videos in my emails and it actually worked",
    "selftext": "I run a small tool and send many emails every week , onboarding stuff, feature updates, etc. Open rates were fine, but barely anyone clicked through, especially when it was just text or screenshots. One day, I got lazy to film myself explaining a feature update, so I used HeyGen to make a short talking-head video of “me” explaining it. I just typed the script, it spit out a video, and I dropped a screenshot with a fake play button in the email linking to the full video. I didn’t think much of it. \n\nWeirdly, the email got almost double the clicks compared to usual. Nobody replied, saying, “Why is your face weird?” So I guess it passed as normal. Been doing it occasionally since then, when I’m too tired to get on camera. Not saying it’s a miracle fix, but for me, it’s been a decent workaround to not having to film myself all the time. Anyone else try stuff like this?\n",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1747364326.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1452333733953735
  },
  {
    "score": 64,
    "title": "Can we add a \"NO COLD EMAIL\" policy to this sub?",
    "selftext": "Seems like every day there's a bunch of noob questions about cold email popping up here lately.\n\nAnd somebody always has to respond referring them to r/coldemail \n\nSince email marketing refers to emailing opted-in contacts (and none of the email marketing platforms allow cold email), could we spell it out for people with a banner when creating a new post?\n\nMight raise the quality of discussion here.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1727442894.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2171703265817992
  },
  {
    "score": 63,
    "title": "Why are my Cold Emails Landing in spam -The guy who sends 100k mails/per day.",
    "selftext": "I see this over and over again: people trying to send 50k emails per day, or even 100k emails per day. “Oh yeah, but I have my SPF, DKIM, and DMARC set up.” And the next thing I see is that they are sending this from either one email account or just a few, along with other beginner mistakes.\n\nI mean, come on guys, did you really think you could have a few email accounts, pay maybe $20/month for them, and send 100k emails per day, expecting them all to land in people’s inboxes? If this were possible, everyone could start some kind of troll business and bulk spam emails at the lowest cost possible because some people out there might actually say yes. Not trying to be an a\\*\\*hole but really just think about it. \n\nIf you really plan on sending this volume (which is possible), you need at least 2k+ email accounts. We’re talking about cold email, by the way. Email marketing, where clients have opted in, uses an entirely different setup with dedicated servers, so that setup is easier. But for cold email, this is not the right way. The correct way requires a much higher budget and a more technical setup to work.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1723306547.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2122406013437184
  },
  {
    "score": 58,
    "title": "Before you start cold email marketing in 2024",
    "selftext": "Cold emailing has changed a lot, and major updates are set to roll out in February 2024 for people using Google.\n\nFirstly, configuring DKIM, SPF, and DMARC is no longer just recommended; it's a mandatory procedure. Failing to do so will result in your IP being blacklisted right from the start.\n\nSecondly, including an unsubscribe button is now a requirement. While this may lead to lower response rates, it is now also mandatory. Despite sending out millions of cold emails with automated systems, the addition of an unsubscribe button makes it clear to recipients that the email is part of a bulk distribution.\n\nLastly, a more **scary** requirement is that your spam rate must be below 0.3%. This means that out of 1000 emails, if more than 3 are marked as spam, well then welcome to the list bud. It's worth noting that this rule applies primarily to personal emails, but many businesses target individuals and smaller businesses that doesn't have business emails.\n\nBest of luck out there, everyone.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1705426287.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2065328585592803
  },
  {
    "score": 57,
    "title": "Is Email Marketing Worth It?",
    "selftext": "Ive been in the content and copy field for about a few years now. 24 years old. Now i want to upgrade my skills. I was facing a hard choice between meta ads, SEO (since it has some relation to content) and email marketing to learn as a skill and offer it to clients\n\nIve been learning about email deliverbaility like DKIM, DMARC, SPF. Now theres email design, lead segmentation,email copy\n\nThe question: is it worth it? as in is email markeitng worth it compared to other marketing segments based on the time invested. i was thinking of going into email marketing for ecom brands (thought of saas too)",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1760509403.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4826694678399046
  },
  {
    "score": 54,
    "title": "Email marketing outsourced",
    "selftext": "Hey EmailMarketing,\n\nI'm David, co-founder of [Hedgehog.email](http://Hedgehog.email), and I'm reaching out to get some honest feedback from this knowledgeable community. We've been working on creating a seamless, professional email design service, and I'm curious about what features or aspects you find most valuable in such services.\n\nWhat are some pain points you've experienced with email design services? Are there specific features, like unlimited revisions or integrations with platforms like Klaviyo etc that you consider essential?\n\nWould the pricing something you consider for your brand?\n\nI'd love to hear your thoughts and experiences to help us improve our offering!",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1719883111.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.121102148015371
  },
  {
    "score": 49,
    "title": "I figured out why my emails were going to Gmail Promotions",
    "selftext": "My company uses Klaviyo to send out emails for marketing purposes, and I manage a separate email list for our blog and newsletter subscribers. For a lot of reasons my content is specifically not branded and rarely feels salesy (this becomes important later).\n\n**Mid January I saw my open rates drop by nearly 50%**, while my marketing counterparts emails remained unchanged. This drop was almost completely attributed to Gmail accounts, which are 50% of my list.\n\n**I dug deep into this community for answers**, all of you had so many great ideas but I couldn't seem to get my emails out of promotions.\n\n**Some of the advice I found here and tried (thank you):**\n\n* [https://litmus.com/gmail-tabs](https://litmus.com/gmail-tabs) and [https://www.mail-tester.com/](https://www.mail-tester.com/)\n* ensured my sending domain matched my website domain\n* personalization\n* no broken links, added alt tags, and balanced text vs images.\n* kept email size under Gmails clipping 102kb for desktop and less for mobile.\n* avoided spammy words.\n\nI continued to use variations of the advice given, almost to the point where I was testing emails with nearly no content whatsoever and **I was still ending up in promotions.**\n\n&amp;#x200B;\n\nThen it occurred to me: **The sender name in Klaviyo was the name of my blog**, The Driven. **That didn't include my company's name or domain**.\n\n**I made that change and am now making the Gmail Inbox consistently**. The blog is The Driven, [https://www.mdriveformen.com/pages/the-driven](https://www.mdriveformen.com/pages/the-driven) and the domain is [www.mdriveformen.com](https://www.mdriveformen.com) and I needed to include that keyword to avoid promotions. See below.\n\nsender \"The Driven\" ----Promotions\n\nsender \"Mdrive\"----Inbox\n\nsender \"The Driven by Mdrive\"----Inbox\n\n&amp;#x200B;\n\n**TLDR: If your emails are going to spam, make sure your sender name and email address match.**",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1675793510.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2028619326958863
  },
  {
    "score": 52,
    "title": "Feb. 2024 update for Cold Email Marketing - What to look out for",
    "selftext": "Some updates regarding the update for Feb 2024.\n\nIt is essential to implement SPF, DKIM, and DMARC for sender authentication.\n\nThe update on unsubscribe has been postponed to June 2024, making it recommended but not mandatory.\n\n\n\n* Starting in April 2024, Google will progressively reject a percentage of non-compliant email traffic. If 75% of a sender's traffic complies with Google's requirements, rejection will begin for the remaining 25% with compliance issues.\n* Bulk sending email accounts that reach a 0.3% spam score for private emails will be marked as spam. This poses a challenge for those who send 5000 or more emails daily to Gmail accounts, particularly impacting cold email marketers.\n* For bulk senders, especially those sending over 500,000 emails monthly, these updates will significantly influence their strategy. Notably, the rejection rate increases by 34% when including an \"unsubscribe link\" in the email copy. This decrease in positive responses can be attributed to the perception of generic emails, undermining personalized communication.\n* The 0.3% spam rate presents a challenge for industries targeting private emails, affecting both B2C and smaller B2B businesses. Many smaller businesses, lacking a dedicated business email, may use personal emails.\n\nDespite the potential challenges, successful email marketers will adapt to these changes, while those unable to handle them may be scared to continue. Good luck, and remember that good email marketers overcome challenges, and updates like these filter out those who can't navigate the complexities of cold email marketing.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1706531287.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.501942753848292
  },
  {
    "score": 47,
    "title": "Best email marketing platforms for creators and small businesses in 2025",
    "selftext": "I’ve been trying out a bunch of email marketing tools this year, and honestly, most of them feel like they’re made for big teams with complex funnels. I’m looking for something clean, aesthetic, and not built like Salesforce.  \nWould love to hear what others are using — especially creators, solopreneurs, and small teams.  \nBonus points if it handles automations, has great templates, and doesn't feel like it was built in 2009.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1747123062.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.328357097241075
  },
  {
    "score": 42,
    "title": "Has anyone found an AI marketing tool that actually improves email performance?",
    "selftext": "**update:** appreciate the replies! I tried [**Klaviyo**](https://outreddit.click/klaviyo) and it adjusts send times and subject lines automatically based on engagement trends. early signs are good, the last couple of campaigns had slightly higher open rates and fewer bounces. still testing, but it seems to be learning fast!\n\nbeen testing a few AI tools lately that claim to boost email engagement, but most just tweak subject lines or give vague suggestions. What I’m really looking for is something that uses behavior data, like predicting when someone’s most likely to open or what kind of content they’ll click on.\n\nanyone here who’s used a tool that actually personalizes based on how people interact with past emails? if yes, did you see noticeable results? like higher open rates, clickthroughs, fewer unsubscribes\n\nalso curious whether it’s better to let the AI fully automate send times and recommendations or just use it as a guide for manual edits.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1762605266.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.183566495593843
  },
  {
    "score": 41,
    "title": "$70K/mo With Email Marketing Down to $0 in 2024/25",
    "selftext": "A pretty significant income stream of our business virtually vaporized over the last 9 months. Revenue started to decline pretty heavily in Sept 2024, and by December 2024 the revenue generated with email did not cover the infrastructure costs of sending.\n\nThis was an arm of our business built solely on affiliate marketing. Super targeted lists. Great buying customers, a flourishing business with great activity and margins for over a decade.\n\nThere's obviously some overarching issues with Yahoo, Verizon, etc but even the Gmail, Microsoft and smaller cable domain contacts aren't buying.\n\nWe've tested new domains, new IPs, new ESPs, and everything is leading to 0 sales. With ESP and sending costs exploding, it's starting dwindle our hopes.\n\nWe are starting to suspect AI is beginning to play a huge role in inbox delivery.\n\nAny others in the affiliate marketing business seeing similar trends? Anything working for you? Any tests you would recommend?\n\nWe have been fighting to revive this arm of our business, but it's starting to look like throwing in the towel is a real possibility.\n\nAny thoughts are appreciated.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1748274343.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2521679027504864
  },
  {
    "score": 44,
    "title": "How is email marketing so expensive?",
    "selftext": "Hello. Sorry for the offtopic. I need you guys to help me understand how is email marketing so expensive for (what I think is) such a  simple service. Let's say you start your startup and you're adding leads. It's not hard to get 10,000 leads while trying things out, it's not a lot of users.\n\nAny platform like ConvertKit, ActiveCampaign, Beehiiv, etc will charge you anywhere ~$1,500/yr.\n\nIf you're sending ~4 emails per month to these subscribers (1 per week) you're in 40K emails per month, which with AWS SES or some low-level transactional service is less than $5.\n\nSo I don't understand. Why the overhead? In my mind email is CHEAP. Are we paying for their automations? The drag and drop email designers?\n\nThanks in advance.\n\nEdit 1: clarification, I'm just 100% honestly wondering what are the market dynamics. Not trying to sound like a D&amp;*ck or anything. My neutral statement would be: \"if the market is so big, and the technology has advanced so much, why costs haven't come down?\"\n\n\nEdit 2: Now I'm realizing most email services are charging based on \"contacts\". So they're associating an underlying high value to each contact when in reality it might not be that way.\n\nEdit 3: is there any such service that charges for ACTUAL usage? per-email, instead of per-contact? I might have 10K leads and not spam them all the time, they come and go in my service in a seasonal basis for example.\n\nEdit 4: Sendgrid marketing is 1/4th cheaper than the alternatives. It's not good enough?",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1729677856.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2864578763615846
  },
  {
    "score": 41,
    "title": "Email Marketing Agency: Worth it?",
    "selftext": "I'm looking at email marketing agencies and I see many who claim to get you to $30k+/mo with big names on their sites...\n\nPlus, crazy email designs that honestly I can never imagine doing myself....\n\nNow I know businesses hype everything up to get your businesss... \n\nSo my question is:\n\nAfter their fees, is the ROI much higher than just doing it yourself?\n\nTo then be **worth** skipping the learning curve + time of running it yourself...\n\nIf yes, **what** **green/red flags** should I watch out for when picking one?\n\n",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1758561611.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2053872251982947
  },
  {
    "score": 39,
    "title": "Need Help with Email Deliverability Issues (Amazon SES + Sendy) – Everything Going to Spam",
    "selftext": "Hi everyone,\n\nI’m struggling with email deliverability issues and could really use some advice. Here’s my current setup and what I’ve tried so far:\n\nPlatform: I’m using Amazon SES and Sendy.co to send emails to a list of ~40k contacts.\n\nAudience: Most of my subscribers are B2B, primarily Outlook (Office 365) users.\n\nInitial Setup: Initially, emails were landing in the inbox, but recently everything is going to spam.\n\n\n\nWhat I’ve Tried:\n\nCustom \"From\" Domain: I didn’t have this initially, but after the spam issue, I set it up. No improvement.\n\nSubdomain: I switched to using a subdomain for sending emails. Still going to spam.\n\nFlodesk: I tried switching to Flodesk as an alternative, but even those emails are landing in spam.\n\n\n\nI’m at a loss for what to do next. Here are some specific questions I have:\n\nHow can I debug why my emails are going to spam? Are there specific tools or steps I should take to identify the root cause?\n\nAre there any common pitfalls with Amazon SES + Sendy that I might be missing?\n\nCould the issue be with my domain reputation or authentication (SPF, DKIM, DMARC)? I’ve set these up, but maybe I missed something.\n\nAre there any best practices for sending to Outlook/Office 365 users specifically?\n\nAny advice, tools, or resources would be greatly appreciated. I’m happy to provide more details if needed. Thanks in advance!\n\nTL;DR: Using Amazon SES + Sendy to send emails to 40k B2B contacts (mostly Outlook users). Emails are going to spam despite setting up custom \"From\" domain, subdomain, and trying Flodesk. Need help debugging and fixing deliverability issues.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1742309962.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0329239093367586
  },
  {
    "score": 37,
    "title": "How is email marketing in 2025?",
    "selftext": "I've heard a lot of marketers say email marketing doesn't work well (or is dead), especially for selling products to B2C. Now I’m wondering if it is still effective for selling to other businesses (B2B).\n\nI’ve seen some companies still using email marketing to generate leads and close deals because I get a lot of their marketing emails in my inbox like every day. But then, a lot of it is just GPT-generated emails or spam or goes into the promotional folders. Sometimes I don’t even notice it and just unsubscribe without ever reading most of them, so it made me wonder how it is, especially now in 2025.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1738691777.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2234192131365944
  },
  {
    "score": 35,
    "title": "Convertkit free trial?",
    "selftext": "Now, I have established Instagram and YouTube traffic sources but still I want to use convertkit, but before paying the full price I want to test out it's free trial, so that I can figure out how much it's valuable for me. If you know how to get convertkit extended free trial offer then please also let me know.\n\n👉 Edit: I actually found a Reddit post that explains working way to [get their 30 day free trial](https://www.reddit.com/r/WorkingCouponAndPromo/s/9jK8yyDkHI). \nI hope it's helps you to",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1759035154.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2814554333996724
  },
  {
    "score": 37,
    "title": "Is cold emailing dead?",
    "selftext": "Every day I receive emails from people who want me to use their tool or services to increase followers or impressions, improve SEO, etc. They have a very particular and very insistent approach strategy.\n\nI haven't sent that kind of cold email for years because I doubt they are effective. What do you think? It automatically makes me think badly of their business, tbh. Same with the LinkedIn messages.\n\n[ ](https://www.reddit.com/r/marketing/comments/161f1y8/is_cold_emailing_dead/)",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1697696288.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1785380529699285
  },
  {
    "score": 34,
    "title": "How are you verifying emails before sending campaigns??",
    "selftext": "Had a situation last week that made me rethink our whole approach to list hygiene. We pulled what should’ve been a “clean” segment for a product announcement, ran enrichment, and everything looked fine… then the presend check flagged a chunk of emails as risky. We sent anyway because timing and our bounce rate was brutal, so now I’m revisiting how we verify email addresses before a send, and I’m curious what others are doing in practice:\n\n• what’s catching risky or invalid emails for you?  \n• are you verifying the whole list upfront, or relying on a pres⁤end verification step?  \n• do you reverify older segments before bigger sends, or only net new contacts?  \n• has improving verification meaningfully changed your bou⁤nce rate or inbox placement?\n\nTIA - open to tool recommendations but hoping they come with some real results.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1765492849.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.102946960191063
  },
  {
    "score": 37,
    "title": "The best-performing emails I’ve sent weren’t trying to sell they were just trying to help",
    "selftext": "Lately I’ve been thinking a lot about how marketing especially email and newsletters is shifting away from just “selling something” to actually providing *value* through education and utility. It’s no longer about *what* the product is, but *how* to use it, *why* it’s useful, and *where* it fits into someone’s life.\n\nI don’t mean just throwing out buzzwords like “value-driven marketing.” I mean **actually giving your audience something they can use**, even if they don’t buy anything right away.\n\nTake Notion, for example. Their emails rarely scream “buy this feature” or “upgrade now.” Instead, they’re packed with templates, use cases (“how freelancers track client work,” “how teams organise projects in Q1”), and community examples. By the time someone upgrades, it’s because they’ve already *seen* how it solves a problem.\n\nOr Duolingo while their brand is cheeky and light-hearted, their emails don’t just say “Buy Super Duolingo.” They constantly highlight streak tips, time-based challenges, or new features you can try *today* that keep you coming back. They show you how to use the app better, not just to *spend* more.\n\nEven Apple does this in a subtle way. Ever notice how their product release emails often feel like mini-guides? “Here’s how the new iPhone camera helps you shoot better night photos,” or “How the new AirPods adapt to your environment.” They're not just listing specs they’re painting a picture of use.\n\nWhen I build email campaigns, I find that the best performing ones usually aren’t the loudest. It’s the ones that lean into *helping*. The ones that act like:  \n➡️ A tip from a friend  \n➡️ A shortcut you didn’t know you needed  \n➡️ A “did you know this works better if…” moment\n\nInstead of “20% off now,” it’s:  \n🛠 Here’s how to get more out of what you already have  \n🌟 Here’s a feature you might’ve missed that could save you time  \n🚀 Here’s a way to use this tool that you haven’t thought of yet\n\nAnd yeah when people *trust* that you’re not just here to sell, that’s when they *buy*. Because they’re not being sold to they’re being helped.\n\nI think the future of email marketing looks more like a helpful guide than a billboard. And honestly? It’s a lot more fun to build, too.\n\nCurious to hear how others are approaching this are you seeing the same shift?",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1743697207.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.895329226144651
  },
  {
    "score": 35,
    "title": "Lessons from doing email marketing for a 1.7b company (12 month test)",
    "selftext": "Last year I was advising the marketing team of a 1.7b company in the restaurant tech space.  \n\n\nOur challenge was to drive deeper engagement from their newsletter, drive more revenue expansion/adoption of new features, and improve deliverability.  \n\n\nHere are some of the takeaways that had the biggest impact…  \n\n\n1) Many people use newsletters as product updates, team updates, use cases, new content releases, and PR pieces…. It’s a lot. And as your email list continues to grow as your brand scales, I find larger and larger groups of readers disconnect because they don’t have a clear expectation of what they will receive. Instead, I recommended this team segment on intake and give people the option to receive just the bits they are interested in and nothing more. Early split testing seems to be showing a strong increase in CTR for this new approach  \n\n\n2) We reduced CTAs in emails (coinciding with more focused content per step above) to 1-2 CTAs in all emails (they were averaging nearly 5). CTR rate went from &lt;1% -&gt; \\~2.5%.  \n\n\n3) We looked over engagement reports from 12 months of email campaigns and lasered in on a few trends: readers loved reading use cases and readers tended to engage more where there was a clear match between expectation (subject line) and reality (body content). While bold or authoritative lines like “Why tipping culture is changing the restaurant industry in 2022” may pique interest, they are unclear on exactly where it is headed. Is the content about positioning? About tech? An email that got better engagement was “How to increase tips for your restaurant by 18% through pre-selection”. Even if the reader isn’t familiar with the word “pre-selection” or that the email is about using a certain tech tool, they see a specific benefit and it frames it around their restaurant.  \n\n\n4) Only about half of their emails passed the “skim test”. Moving forward we made sure we properly used bolding and headers, and that a reader could ascertain the theme of what the email was about in 3-5 seconds.  \n\n\n5) We moved away from the standard blocky layout of their emails and blended images and text together in a more visually aesthetic layout with high-end professional imagery. This made the emails far more distinctive.  \n\n\n6) A huge signal from a lot of major inboxes that determines primary inbox placement is around response rate. Inbox algos know that non-personal mail (promotional) almost always has a reply rate of &lt;5% while personal mail to family and friends has a reply rate of \\~89%. By proactively asking for replies (to specific questions, not general), we can work to get better sending domain authority over time.  \n\n\n7) We set clear expectations around when the newsletter was going out and included this on opt-in. I now do this for all newsletters I run personally as well and it made a huge difference. If people know they will get one email a week, on Friday, at 7AM PST and it will talk about X, your chances of engagement go way up.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1688657104.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.142351429735146
  },
  {
    "score": 35,
    "title": "Why are big brands removing greetings from their emails?",
    "selftext": "I got newsletters from ConvertFlow and Neil Patel today, and there were no greetings. They didn’t start with “Hi.” I checked a few older ones too, and they were all the same. The copy starts with value straight away.\n\nIt made me think, why are they doing this? There must be a reason. We’re all told that personalisation is the key, and they already know my name. We’ve all run email campaigns with “Hi there” in the past because we didn’t have the person’s name, but this feels different.\n\nI read a few articles about it, and apparently, like everything that’s overused, name tokens are starting to lose their power, or at least that’s what these companies seem to think. Just saying “Hi John” doesn’t mean much to the reader anymore. Especially on mobile, email marketers need to jump to value straight away to grab attention and move readers towards engagement, clicks, and replies.\n\nIf you want to test it yourself, try running two versions of your next email:\n\n* Version A: starts with “Hi {{First Name}}”\n* Version B: goes straight into the value or idea\n\nSee which one drives more clicks or replies.\n\nObviously, this is a new approach, and it may not work for everyone. But jumping straight to the value might become the new normal. People can take a quick look and decide whether they want to read more or not.\n\nCan we use the “no greeting, straight to value” approach in our email campaigns too? What are your thoughts on this?",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1760727357.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0926814166080745
  },
  {
    "score": 33,
    "title": "New to email marketing",
    "selftext": "Hi all,\n\nI have recently been hired as product communications manager for a fintech startup. My primary role is to look after emails, APNs and WhatsApp strategy. \n\nI’ve never worked in a role like this before. Hence I’m here to learn from the absolute ABCs.\n\nOur emails are tanking REALLY BAD. And I’ve been asked to do an overhaul of the current strategy that is in place. \n\nPlease guide me towards any kind of content that can help me build this skill from scratch. Books, podcasts, influencers, videos, blogs, ANYTHING. \n\nI am just very curious to learn and hopefully do something good for the company I work for. ",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1749663934.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.073205255285349
  },
  {
    "score": 35,
    "title": "Acquired a business, 1 million plus emails, how to go forward?",
    "selftext": "OK, long story short, I acquired a business that was closed down about 18 months ago, I've relaunched the business because there was nothing wrong with it, it was just badly managed. Part of the asset pool was approximately 1 million emails, these can be segmented in to paying customers, newsletter opt ins and then some smaller gravity form entries.\n\nIs there a way I can email these once to just get them to re-double opt in? As I don't have access to the original email marketing platform the previous company was using. \n\nI've put the entire list through Neverbounce and now its ready to go, but because of the sheer amount, not sure the best way forward.\n\nCould I setup my own server/SMTP and send the initial email myself, then afterwards move anyone who opts in/engages to Brevo or something?\n\nThanks!",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1749558331.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0130594707062306
  },
  {
    "score": 31,
    "title": "Sent 'we miss you' emails to people who bought stuff yesterday. I'm an idiot",
    "selftext": "So this happened about 3 months ago and I'm still cringing about it.\n\nI set up what I thought was a smart win-back sequence for inactive subscribers. You know the drill - if someone hasn't opened an email in 60 days, hit them with a 3-email series to try and re-engage them.\n\nSeemed foolproof. Except I messed up the trigger conditions.\n\nInstead of checking \"hasn't opened in 60 days AND hasn't engaged recently,\" I just set it to \"hasn't opened in 60 days.\" Period.\n\nSo what happened? People who had been inactive for 60+ days but then opened my newsletter or clicked a link got IMMEDIATELY thrown into the win-back sequence. They'd open Monday's newsletter, then get a \"We miss you!\" email on Tuesday asking why they never engage.\n\nFor two weeks.\n\nI didn't catch it until someone replied asking if I was having a mental breakdown. Then I checked and realized I had sent \"Hey stranger, come back to us!\" emails to people who had literally just bought something or clicked a link the day before.\n\nGot about 30 confused/annoyed replies and had to send an apology email explaining the \"technical issue.\" Lost maybe 50 subscribers who probably thought I was incompetent (fair).\n\nAnyone else have automation fails that made them want to hide under a rock?",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1748093265.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.948710605679737
  },
  {
    "score": 32,
    "title": "Why can't I stop getting emails from certain companies even when I unsub",
    "selftext": "I’ve noticed some companies just will not let go, no matter how many times I hit “unsubscribe.” I’ve clicked the link, confirmed it, and in some cases even emailed their support to stop contacting me, but the emails keep rolling in.\n\nIt makes me wonder if the unsubscribe button is just a placebo at this point. Some of them just switch me from “promotions” to “updates” or start emailing from slightly different addresses. It feels like playing whack-a-mole with my inbox.\n\nIs this just shady marketing tactics, or are they allowed to do this legally? Has anyone actually found a way to stop it completely without changing your main email address?",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1756813130.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.954712938827366
  },
  {
    "score": 30,
    "title": "How are you guys finding jobs?  ",
    "selftext": "I’m not sure if I’m allowed to post a question like this, and if not, feel free to remove it. Just wanted a little advice on the job market in the Email Marketing space. \n\n I’m genuinely asking, because I feel the market is so over saturated that it seems impossible to find an email marketing job. What was your process to finding a job?\n\nMy last 2 jobs were remote email marketing specialist roles. In both jobs, the company decided to scale back and restructure, causing many lay offs. \n\nI was earning $80k-$90k per year with average benefits. Now I’m struggling to find anything within my field that happens to include those benefits, and it’s been difficult to maintain my life (rent, insurances, maintenance, health, basics). For reference, I live in CA and can’t afford a large move atm. \n\nI am skilled in email marketing, segmentation, copywriting, design, and tools such as figma and Klaviyo.\n\n I’m not sure what to do, as I’ve been unemployed for 7 months now— any advice would be appreciated.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1718651939.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.001253492142678
  },
  {
    "score": 31,
    "title": "I built a product for email marketers that made $500 in a month using 3 no-code free tools",
    "selftext": "It was its first full month. It's not a lot, I know. As an email marketer, I charge $150 per hour. But making money with a product rather than a service feels nice.\n\n**What did I build?**\n\nSomething I use every day for my job, but instead of a dump with random notes, I created a nice-looking and organized database.\n\nEssentially, I collect email marketing sequences from successful companies to see how often they send emails, how many, using what ESPs, if they use double opt-in, offer discounts/lead magnets, etc.\n\nSo when I get a new client from a space I've never worked before in, say, fintech SaaS, I can go there, get an idea of what other players are doing, and put together a first version of the basic email flows pretty quickly.\n\n**How did I build it?**\n\nThe whole setup is pretty basic, as you can imagine. Everything under a free plan:\n\n\\- Airtable to build the database of content and users\n\n\\- Softr for the web app\n\n\\- Zapier to send welcome/trial emails through Gmail (lol)\n\n**How did I get visitors/customers?**\n\n\\- Personal network. This one was definitely huge. Some people who know me and my work as an email marketer bought the product without blinking.\n\n\\- Newsletters. Related to the previous, two people I know run newsletters focused on SaaS and e-commerce, respectively, which are perfect target audiences for my product. They included a mention, which led to 1/3 of the sales.\n\n\\- Reddit. I shared the project and a couple of email marketing posts that got a fair amount of attention. I even got a couple of DMs from people interested in hiring me as a consultant. \n\nSome March stats:\n\n\\- Content: 82 new emails (206 total)\n\n\\- Traffic: 1.1k\n\n\\- Sales: €416\n\n\\- Expenses: €0\n\n**Lessons learned?**\n\n\\- I think one of the major wins was to build a very scrappy first version and start showing it to people who gave me some amazing feedback.\n\n\\- Test everything 100 times. As someone with a non-technical background, even using no-code tools felt like a challenge. Zaps returned errors all the time, Softr logic too,... took me a while to put all the pieces of the puzzle together.\n\n**Bonus**\n\nToday I'm [launching at Product Hunt](https://www.producthunt.com/posts/send-good-emails). I'd love it if you could take a moment to upvote the project there! I included a special launch-day discount in case you're interested in giving it a try.\n\nOverall, the results were amazing for the first full month live. Way more than I expected.\n\nFeel free to AMA.",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1712054996.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9327249674798592
  },
  {
    "score": 29,
    "title": "I have an email list of 50k+ that I've never emailed, and I want to start a newsletter now. Please help!!!",
    "selftext": "So I have a somewhat decent presence on Tiktok/IG (150k+ followers) and have been providing free digital downloads for 2-3 years now which has built me an email list of 55k+ people that are engaged with my products and recognise me. I have now built a website with products on it and want to start using my email list as a newsletter. I designed a beautiful first newsletter on FloDesk (double opt-in style) to rebuild a high quality email list and warm up my domain, however, even when I send the test email to my own personal emails, it is going to spam.\n\nAfter tweaking a few things, the email no longer goes in to spam but it is filtered into promotional by Gmail. Some of my favourite newsletters that I barely even engage with, but are sent to me weekly, make their way in to my primary inbox. How can I achieve this?\n\n  \nAny and all advice is appreciated - thanks guys!",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1761523312.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.130211241711606
  },
  {
    "score": 27,
    "title": "Is it just me or are email marketing platforms getting outrageously priced?",
    "selftext": "Idk maybe I just don’t need all the bells and whistles, but I feel like these companies want a gold bar every month. \n\nI have autoresponders set up and I send simple email campaigns once or twice a month, and run a few seasonal promotions, so I just need a basic email marketing software. \n\nAny suggestions? I’ve tried Mailchimp, Klaviyo, and Brevo and I just don’t feel like what I use it for warrants the cost. ",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1754953544.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0417738912077077
  },
  {
    "score": 28,
    "title": "What’s the One Email Marketing Strategy That Skyrocketed Your ROI in 2024?",
    "selftext": "Email marketing is still going strong in 2024, despite all the noise around social media. With inboxes becoming more personal than ever, I’m curious—what’s the ONE email strategy that’s given you the best returns this year?\n\nFor me, I’ve found that segmenting based on customer behavior combined with personalized subject lines has driven open rates and conversions through the roof. I’m always looking to learn more, so what’s working best for you? Are you seeing success with A/B testing, automation, or something totally different?\n\nLet’s swap notes and see what’s really working in the inbox!",
    "subreddit": "Emailmarketing",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1727367170.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8384770135700657
  }
]