[
  {
    "score": 1510,
    "title": "My employee quit and took all the knowledge with her because I never built proper training materials",
    "selftext": "This just happened last week and I'm still processing how badly I screwed this up. I had an operations manager who knew everything about how we run things. Client onboarding process, how to handle edge cases, all the workflows, everything. She'd been with me for 3 years. She gave two weeks notice. Very professional, nothing dramatic. Just got a better opportunity. During those two weeks I realized we had ZERO training materials. Nothing written down. No videos. No knowledge base. Just her brain. We tried to do knowledge transfer. She wrote some notes. We recorded a few Zoom calls where she explained things. But you can't download 3 years of knowledge in two weeks. She left. And now everything takes 3x longer because nobody knows how she did things. We're figuring it out but it's painful. Clients are asking \"\"why is this taking so long now?\"\" and I have to explain that the person who knew how to do it quickly doesn't work here anymore. The worst part: This was completely preventable. I knew for 3 years that all this knowledge was only in one person's head. I knew I should be documenting things. I just never made it a priority because it felt like busywork compared to actually running the business. Now I'm trying to build training materials from scratch while also trying to keep operations running and it's a nightmare. Creating a knowledge base from nothing while you're already overwhelmed is way harder than building it incrementally over time. I'm spending 15-20 hours this week creating training materials I should have created over the past 3 years. Time is everything right now so I'm using notion for process docs, gamma for visual guides, claude to help draft things faster - basically whatever lets me create something that looks presentable without taking forever. Can't afford to spend days perfecting each document when I need dozens of them immediately. If you have people on your team who know critical things: Document that knowledge NOW. Before they leave. Before they get sick. Before something happens that makes you wish you had done this earlier. Learn from my expensive mistake.\"",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1510,
    "downs": 0,
    "created_utc": 1765428946.0,
    "media": null,
    "is_video": false,
    "num_comments": 376,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Personal anecdote highlighting the need to document knowledge and create training materials to prevent loss when staff leave.",
    "composite_score": 5.187435139441922
  },
  {
    "score": 937,
    "title": "Just sold my startup for $15 Million USD",
    "selftext": "Hi everyone, excited to share that I recently sold my startup for a very big amount and I personally made $15 Million. I had never even seen a million in a bank account and right now there are 15 of them.\n\nThe entire process took over 5 months but everything is finally complete and we have money in our banks. There were a total of 3 investors and me and my cofounder built the entire thing with our team of 3 SDEs.\n\nI have signed an NDA so shouldn't really be telling the amount. My startup was in the fitness space.\n\nThat's all I can tell for now.\n\n&amp;#x200B;\n\nI would love to connect with other entrepreneurs like myself who have any doubts. Just comment down below.\n\n&amp;#x200B;\n\nWould love to reply to you.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 937,
    "downs": 0,
    "created_utc": 1710217576.0,
    "media": null,
    "is_video": false,
    "num_comments": 208,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Simple success announcement with minimal content and a call to connect; no actionable guidance.",
    "composite_score": 4.747275981434592
  },
  {
    "score": 895,
    "title": "How I Made $45K on the Side with AI Characters (While Still Working a 9–5)",
    "selftext": "So yeah, I made around $45,000 last year creating and running a couple of AI characters online. And no, I’m not some social media guru or full-time content creator—I’m a software dev who just got curious and decided to mess around.\n\nI didn’t think it would go anywhere at first. It started as a random side project, just something fun to work on after hours. But after a few months of testing things out, it actually started to grow—and turn into real income.\n\n⸻\n\nWhere It Started\n\nOne night I came across an AI influencer on Instagram. I figured it was just a model with heavy filters, but nope—fully generated, and honestly pretty impressive.\n\nI got hooked. Spent a few hours scrolling, then the next few nights going down the rabbit hole. Watched some YouTube tutorials, fired up Stable Diffusion, and started experimenting.\n\nThe images were rough at first. A lot of weird hands, blurry eyes, and deleted posts. But I wasn’t trying to go viral or perfect anything—I just wanted to build something that felt cool.\n\nEventually, I created my first character, Lina. Then came Sasha. I gave them loose storylines and slightly different vibes to keep things interesting. They weren’t super deep characters or anything, but enough to keep people curious and coming back.\n\n⸻\n\nTools I Used\n\nI didn’t overthink it. Here’s the basic stack I used: • Fooocus (RunDiffusion at first, then locally) • Juggernaut V9, Lyuyang Mix • Photoshop and Topaz for cleanup • ChatGPT/GPT-4 for captions and responses • Patreon and Fanvue for monetization\n\nNothing super technical. Honestly, if you can Google and experiment, you can figure this out.\n\n⸻\n\nWhat Worked\n\nPosting consistently was the main thing. I didn’t try to game the algorithm or spam reels—I just focused on solid visuals, decent captions, and showing up often enough for people to notice.\n\nAlso, once I started offering private content behind a paywall (nothing explicit—just more personal/curated stuff), I saw a big shift. That’s when the income really started rolling in.\n\nFanvue did better than Patreon, but both had their place. I also brought on someone part-time to help with chatting and replies, which made a surprising difference.\n\n⸻\n\nThe Earnings\n\nHere’s what it looked like over the year: • Lina on Fanvue: $18,790 • Lina on Patreon: $10,580 • Sasha on Fanvue: $12,880 • Sasha on Patreon: $4,900\n\nTotal: \\~$47,000\n\nAll while working my regular dev job. Honestly, it was kind of surreal.\n\n⸻\n\nWould I Recommend It?\n\nIf you’re even a little bit curious, I’d say go for it. It’s fun, weirdly satisfying, and there’s real potential here if you stick with it.\n\nYou don’t need to be a designer or know AI inside-out. You just need to be curious, willing to experiment, and okay with posting cringe until you figure out what works.\n\nLet me know if you’re thinking about starting something like this or already have—I’m happy to answer questions or talk shop in the comments.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 895,
    "downs": 0,
    "created_utc": 1744118954.0,
    "media": null,
    "is_video": false,
    "num_comments": 195,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Personal side-income story with a practical side-income approach and tools, offering guidance but not a formal step-by-step.",
    "composite_score": 4.8109360453403625
  },
  {
    "score": 737,
    "title": "I tested Reddit content marketing for a year got insane (6 figures $) results",
    "selftext": "So I've been on this god forsaken platform for 15 years, ever since I'm a pimple-faced shit-eating teenager. Back in 2009, Reddit's got nothing but memes and cat pictures. For better or worse, times a changed.\n\nHere's the truth: Reddit is the best platform for business owners to test new offers, it’s the easiest way to reach hundreds and thousands of impressions for free.\n\nUnlike social media, Reddit operates without the unpredictable, black-box algorithms that runs the other platforms. Instead of chasing elusive virality, you can connect directly with niche communities, talk to your customers directly to get real actionable feedback. Let’s put all that aside for now, and I’ll walk you through exactly how to find your first client on Reddit.\n\nI'll walk you step by step on how to stop being a lurker and start posting like a pro on this platform, where average well performing post will get you 100K+ plus impressions and hundreds of leads.\n\nBut you need to know how and where to write engaging content that people loves to read first:\n\n1. Find the relevant subreddit with your target audience via tools like gummy search.\n2. Spend one to two weeks visiting the subreddit every day. Sort by “New”, and look for patterns in posts, usually people will post about the same things.\n3. Spend all of your time on perfecting the post title, be punchy and follow similar formats BUT be unique. This is one chance to make your offer stand out.\n4. DO NOT sell in the post content, keep it very short. Tell a story or speak your truth.\n5. Reply between posts, use sarcasm and be funny.\n\nOK, so how do you use Reddit as a lead-gen machine?\n\nUse Reddit as the top of the funnel, work in keywords that are relevant to your product or services. Don’t forget to add links to your profile, this is how people will find out more about you and your offer. I would directly add any buy links and social media links here if you have any.\n\nDon’t be afraid to delete posts that are not working, and make sure you don’t stack too many similar posts together. People WILL check your post history (it’s usually the first thing they do) and they’ll dismiss you if your post history seems spammy.\n\nI would sprinkle in non business types of posts throughout, what are your interests? There’s most likely already a subreddit for that and just comment/post in it occasionally. I recommend 1 business post for every 3-4 interest posts would be a good ratio.\n\nMy goal is to test one new tactic per quarter and reuse the ones that already works. You should try these out and make them your own.\n\nStrategy breakdown\n\nSpend **30 days** exploring and consuming content in target subreddits.\n\nThen, Post weekly to engage your audience, allow **additional 30-60** days of progress:\n\n1. **Automoderator deleting your post:** Check the automod comment, make sure you aren’t using banned keywords.\n2. **Moderators deleting your post (rules):** Check the deletion reason, usually because you’ve broke some rule or people being jerks reporting your content. Either way, bend the knee and try again.\n3. **No engagement (test post time, post title):** Try different post times, sort by top post in a subreddit for the week and look at when they were posted. Then spend time iterating on the post title, a catchy title is really important.\n4. **Downvotes or negative comments (test post content):** This step is key: refine your posts, tell better stories, stay patient, and engage in the comments. Use all negative signal as learning.\n5. **Viral 150K+ post with hundreds of comments:** You should get here within 90s days if you iterated and tested everything above.\n\nGoogle❤️ Reddit\n\nI'm an avid hockey fan and my team is the Toronto Maple Leafs, if you search for one of our player (last name Matthews) on Google, you'll see a picture of his mug as the top result, but something is off.\n\nSome genius recently went viral on Reddit (in r/leafs) with a photoshopped image of him with fake hair.\n\nGoogle placed it front and centre on the results page (for real, just search \"matthews\"). The Reddit post with 1.5K upvotes is a meme titled “Auston Matthews has returned from Europe after receiving treatment for his undisclosed upper-body issue”.\n\nThis confirms that Reddit is great for SERP results and a well performing post can get your brand to the top of Google search results with any keyword (in the post title).\n\nI’m actively exploring ways to leverage this to help product companies market their products and get boosted on Google search results. It’s super powerful.\n\n# But does Reddit ACTUALLY sell? The answer is YES.\n\nLet me tell you the story of how I came across a comment late 2023 while looking up how to make a custom engagement ring. I search Google for “jeweller recommendation canada reddit”, the post was the second result on the first SERP. After reading a few comments, I decided to reach out to the blacksmith. A few month later I got the ring in the mail and used it to propose to my girlfriend, we couldn’t be happier.\n\n$5,000+ purchase decision made based on:\n\n* A top Google result\n* Reddit comments and review, validating the seller\n\nBy this point you HAVE to purposefully provide a bad experience for me to look for an alternative. Reddit + Google search results + Community review = WIN\n\nOK but what actual results do you have to show for all this?\n\nCheck my post history. I've got multiple near top voted posts of all time in this sub, and those posts got me hundreds of leads and booked dozens of calls with prospects. I ended up closing multiple clients last year directly from those posts I made.\n\nSo how do I start?\n\nFor the next 90 days, just post about what you do, where you want to go, how you going to achieve it. It won't take you a long time trust me I've been there.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 737,
    "downs": 0,
    "created_utc": 1736220418.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Clear, step-by-step guide to Reddit content marketing.",
    "composite_score": 4.589620288622891
  },
  {
    "score": 636,
    "title": "I Launched 39 Startups Until One Made Me Millions. This Is What I Wish I Knew.",
    "selftext": "**Most “founders” never launch anything.** \n\n\n\nThey build a project for months, never complete it and eventually scrap the product. Or launch it and get no customers.\n\n\n\n**Startups are truthfully a numbers game.** Even the best founders have hit rates under 10%. Just look at founders like Peter Levels.\n\n\n\nSo how do you maximize your chances of success, the honest answer is to increase the number of startups you launch.\n\n\n\nI’m going to get hate for this: but you should NOT spend hundreds of hours building a product… until you know for certain that there is demand.\n\n\n\nYou should launch with just a landing page.\n\n\n\nWrite a one pager on what you will build, and use a completely free UI library like Magic UI to build a landing page.\n\n\n\nIt should take you under a day.\n\n\n\nThen what do you do?\n\n\n\nAdd a stripe checkout button and/or a book a demo button.\n\n\n\nAnd then launch. Post everywhere about it(Reddit, X, LinkedIn, etc) and message anyone  on the internet who has ever mentioned having the problem you are solving.\n\n\n\nLaunch and dedicate yourself to marketing and sales for 1 week straight.\n\n\n\nIf you can’t get signups or demo requests within 1 week of marketing it 24/7... KILL IT and START OVER.\n\n\n\nMost “startups” are not winners. And there are only THREE reasons why someone will not pay you, either:\n\n1. They don’t actually have the problem.\n2. They aren’t willing to pay to solve the problem.\n3. They don’t think your product is good enough to try and pay for.\n\n\n\nIf people do sign up and check out with a stripe link you simply come clean with a paraphrased version of:\n\n\n\n“I actually haven’t finished the product yet, but I’d love to talk to you about the problem you’re facing. I put a sign up link on the website to see if anyone would actually care about my product enough to pay for it”\n\n\n\nThen you refund the customer.\n\n\n\n**This is where I’m going to get hate:**\n\n\n\n1. It is not unethical to advertise a product you have not finished building.\n2. It is not unethical to put a checkout link and collect payments for an unfinished product to test demand… as long as you simply refund “customers”.\n\n\n\nWhen you do eventually get sign ups or demo requests, the demand is proven. Only then do you invest 2 weeks in building a real product.\n\n\n\nDo not waste hundreds of hours of your valuable time building products no one cares about.\n\n\n\nTest demand with a landing page and check out link/demo request link.\n\nIf demand is proven: build it.\n\nIf demand isn’t proven: start over with a new idea.\n\n\n\nRepeat.\n\n\n\nYou will get a hit if you do this… eventually.\n\n\n\nThis is personally how I tested 39 different startups… and killed 37 of them with little to no revenue to show for it.\n\n\n\nFor context: Of the 2 startups that DID get traction from this strategy:\n\n1. One went on to hit $50M+ in GMV\n2. [Rivin.ai](http://Rivin.ai) went on to raise an investment from Jason Calacanis and works with multi-billion dollar e-commerce brands to analyze Walmart sales data.\n\n\n\nStop wasting your time building products no one cares about. Validate. Build. Sell. Repeat.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 636,
    "downs": 0,
    "created_utc": 1751587499.0,
    "media": null,
    "is_video": false,
    "num_comments": 201,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Prescriptive startup-launch playbook with concrete steps and decision points.",
    "composite_score": 4.676815117058662
  },
  {
    "score": 598,
    "title": "I wasted 6 months \"building systems\" when I should have just been recording myself doing the work",
    "selftext": "This is embarrassing but maybe someone else needs to hear it.\n\nI have a small agency (9 people) and for the past six months I've been obsessed with \"building systems\" and creating documentation so my team doesn't need me for everything. Classic bottleneck founder problem.\n\nHere's what I did:\n\nSpent hours writing SOPs in Notion. Nobody read them. Too long, too boring, too much text. Tried making them shorter but then they were too vague.\n\nHired someone on Upwork to create training materials. They made these generic templates that didn't actually show how WE do things. Waste of $800.\n\nBought a Udemy course on \"building systems for your business.\" Took notes. Created frameworks. Built spreadsheets. Still nobody on my team knew how to do things without asking me.\n\nThen last month I got sick. Like actually sick, couldn't work for a week. And my team just... figured stuff out. They called each other, they screen-shared, they walked each other through processes. It wasn't elegant but it worked.\n\nThat's when I realized I'd been thinking about systems completely wrong.\n\nI was trying to WRITE documentation when I should have just been SHOWING people how to do things. People don't want to read a 12-step process. They want to see someone do it once and then try it themselves.\n\nSo I stopped writing and started recording. Not fancy recordings - just screen recordings where I do the actual work and talk through what I'm doing and why. Like explaining it to someone sitting next to me.\n\nI made 15 of these in two weeks. Each one is 5-10 minutes. I used whatever tools made it fast - screen recordings with Loom for some, used Trupeer for ones that needed cleanup and written versions, some I just did on Zoom calls and saved the recordings.\n\nThe difference is insane.\n\nMy team actually watches these. I can see it in the analytics. More importantly, questions have dropped by like 60%. When someone asks how to do something, I send them the 6-minute video instead of typing out a long explanation or getting on a call.\n\nNew hires onboard way faster because they can watch me do the work instead of reading about the work.\n\nThe insight that's valuable: **Systems documentation doesn't need to be polished or comprehensive. It needs to show someone competent doing the thing while explaining their thought process.**\n\nStop trying to write the perfect SOP. Just record yourself doing your job for a week and narrate what you're doing. That's your documentation.\n\nYou don't need a course on building systems. You don't need to hire someone. You don't need fancy tools. You need to hit record and do your actual work while explaining it.\n\nI spent six months overthinking this when I could have just shown people how I do things. Hopefully you're smarter than me and don't waste half a year on it.\n\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 598,
    "downs": 0,
    "created_utc": 1765121298.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Lesson learned from switching from writing to recording videos; actionable approach with show-not-write.",
    "composite_score": 4.3903642502255575
  },
  {
    "score": 580,
    "title": "Use AI like a $10M consultant instead of like a search engine",
    "selftext": "I've noticed the same patterns in the ones that actually make money vs. those that waste time.\n\nMost people are using AI like a search engine. The winners use it like a $10M consultant.\n\nHere are the 5 patterns that separate the two:\n\n    Pattern 1: Role-Based Prompting\n    Instead of: \"Write me a marketing plan\"\n    Use: \"Act as a CMO who's scaled 3 SaaS companies to $50M. Create a marketing strategy for...\"\n\n    Pattern 2: Context Stacking\n    Instead of: \"Create social media content\"\n    Use: \"Create social media content for [specific audience] struggling with [specific problem] who [specific behavior]...\"\n\n    Pattern 3: Constraint Definition\n    Instead of: \"Help me with sales\"\n    Use: \"Create a sales process for B2B SaaS with 6-month sales cycles, $50K average deal size, targeting CTOs at 500+ person companies...\"\n\n    Pattern 4: Output Specification\n    Instead of: \"Give me ideas\"\n    Use: \"Generate 10 ideas in bullet format, each with expected ROI, implementation difficulty, and timeline...\"\n    \n\n    Pattern 5: Iteration Frameworks\n    Instead of one-shot prompts, use: \"First, analyze [situation]. Then, provide 3 strategic options. Finally, recommend the best approach with reasoning...\"\n\nI've documented 75 of these business-specific prompts that have generated $50M+ in trackable revenue. \n\nThe difference in results is honestly shocking.\n\nAnyone else seeing similar patterns with AI implementation?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 580,
    "downs": 0,
    "created_utc": 1749636946.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Enumerated patterns for using AI; a multi-item list that outlines a framework.",
    "composite_score": 4.476676132390331
  },
  {
    "score": 446,
    "title": "Our first bad hire cost us $180k and nearly killed team morale",
    "selftext": "Everyone talks about recruiting costs. Nobody talks about the cost of a bad hire.\n\nWe hired a \"senior engineer\" after one interview. Seemed great on paper. Moved fast because we were desperate.\n\n3 months in it was obvious they weren't working out:\n\n- Couldn't work independently\n- Code quality was poor\n- Caused conflicts with team\n- Slowed down two other engineers who had to fix their work\n\nKept them for 6 months trying to make it work. Finally let them go.\n\nTotal damage:\n\n- $90k in salary and benefits\n- $40k in recruiter time to find replacement\n- $50k+ in lost productivity from other engineers\n- Immeasurable damage to team morale\n\nAll because we rushed and didn't do our diligence.\n\nNow we take 2 extra weeks on interviews. Haven't made a bad hire since.\n\nSaving $5k on recruiting fees by rushing is the dumbest possible optimization.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 446,
    "downs": 0,
    "created_utc": 1763858835.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Cautionary tale about hiring; lesson-focused with costs and mitigation.",
    "composite_score": 4.311621068777157
  },
  {
    "score": 404,
    "title": "I CANT do this anymore, Im so fucking tired of being poor.",
    "selftext": "If there's a word for worst than pissed, use it. ive been absolutely pissed at the fact that there's people out there that just made a million in profits as you read this post, but I cant even go buy fruits. I cant deal with this bs anymore. YES ik getting rich takes time, consistency, passion, and most importantly, a plan. but getting rich is not my current goal, my goal is to at least make my own $1000 first. then 10k, then 100k, and so on. I need some good advice on how to get started, maybe some proven working money methods people have used, or side hustles that dont take much to start. im 18, no money, no phone, no car. all I got is a computer, reliable bike, and a house to live till I move out or kick myself out. im willing to work for someone but not in the cooking industry, im done with that bs too. ive tried indeed and craigslist, ive tried flipping on fbmp. dont even mention dog/baby sitting, im not dealing with getting accused for murdering someone's dog again.\n\n(EDIT: The dog killed himself by jumping off a porch with the leash still attached to his collar.)",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 404,
    "downs": 0,
    "created_utc": 1735512505.0,
    "media": null,
    "is_video": false,
    "num_comments": 530,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Highly emotional vent about poverty; primary rant.",
    "composite_score": 4.622502283755403
  },
  {
    "score": 391,
    "title": "I built a company doing over $100M this year. We're a known nationwide brand. I'm pretty wealthy. And I’m not sure the price I paid was worth it.",
    "selftext": "I’m writing this anonymously because I don’t want anyone connecting it to me or my company.\nAll I’ll say is this: the business I built will do over $100M this year, I’m financially set for life, and on paper my life looks “perfect.”\n\nBut here’s the side nobody actually talks about:\n\nI sacrificed everything to get here.\nNot like the motivational-poster version.\nI mean literally everything.\n\nMy mental health? Wrecked.\nMy physical health? Worse.\nMy stress levels feel like I’ve aged 20 years in 5.\nI’m fulfilled in the sense that I created something massive… but I wouldn’t say I’m happy. Not even close.\n\nI have friends who make 1% of what I make and are 1000% happier.\nThey sleep better.\nThey laugh more.\nThey’re present.\nTheir bodies don’t feel like they’re falling apart from the pressure.\n\nIt’s weird because I don’t regret any of it.\nI’d make the same choices again.\nThat’s the crazy part - the sacrifice got me here, and I’m proud of what I built.\n\nBut I want people to understand something nobody ever says out loud:\n\nIf you want extreme success — real, generational wealth, insane scale, the 0.01% outcome — you have to be ready to sacrifice almost everything in your life.\nYour time.\nYour health.\nYour peace.\nYour relationships.\nYour body.\nYour ability to “just relax.”\n\nPeople think they want this.\nMost don’t.\nMost shouldn’t.\n\nI’m not complaining.\nThis is the life I chose.\nBut it came with a price that I’m still paying every day.\n\nIf anyone’s curious, I’ll answer questions here.\nJust figured someone should hear the truth before jumping into the fire thinking it’s all freedom and happiness on the other side.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 391,
    "downs": 0,
    "created_utc": 1765426645.0,
    "media": null,
    "is_video": false,
    "num_comments": 324,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.71,
    "category_rationale": "Insightful reflection on sacrifices required for massive success.",
    "composite_score": 4.546727747509895
  },
  {
    "score": 374,
    "title": "Accidentally saved a client ~$30k a year just by watching how they actually worked",
    "selftext": "Earlier this year I was helping a small clinic that complained about “too much paperwork” and how it was slowing everything down.  \nThey thought they needed some fancy AI system.  \nThey didn’t.\n\nSo instead of jumping straight into code, I hopped on a call with them for a few hours and watched what they actually did every day.  \nTurned out half their “data entry” was literally just copy-pasting the same info between forms, spreadsheets, and emails.\n\nI built a simple workflow that:\n\n* reads their intake forms\n* fills out their spreadsheet automatically\n* sends a summary email to the right staff\n* stores a copy in their shared folder\n\nNo fancy dashboards or complicated software to learn.  \nJust connected what they were already using.\n\nTwo weeks later, they told me it cut 10–12 hours of admin work a week.  \nThat’s roughly \\~$30k a year in saved time (i believe).\n\nThe lesson for me: most businesses don’t need complicated systems, they just need less friction.  \nIf you want to build automations that people actually use, start by watching what they already do instead of what they say they do.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 374,
    "downs": 0,
    "created_utc": 1766280892.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.74,
    "category_rationale": "Provides a reproducible, step-by-step workflow to automate admin tasks.",
    "composite_score": 4.061423066036124
  },
  {
    "score": 307,
    "title": "My fart-tracking website somehow turned into a real business",
    "selftext": "A few months ago, I built a simple website [https://tuute.com](https://tuute.com) where people can log their farts  mostly as a joke to see if anyone would use it. It actually blew up. So far there have been 3,000+ farts logged from 100 countries, and I’ve made $19.39 from affiliate revenue. What surprised me most wasn’t the traffic.  it was the engagement. When I added a personal leaderboard, people came back to see their stats. When I added a downloadable history, some even said they’d show it to their doctor. It’s been a hilarious but real crash course in product-market fit, gamification, and how community feedback shapes any product even one built on gas.\n\nHas anyone else here ever learned serious lessons from a totally unserious idea?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 307,
    "downs": 0,
    "created_utc": 1762123991.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Shares a real-world lesson about product-market fit and lessons learned from an unserious idea.",
    "composite_score": 4.170810342809753
  },
  {
    "score": 305,
    "title": "I thought coding was the hardest part… but launch day proved me wrong",
    "selftext": "Last year I quit my job to go full-time on a SaaS. I naively thought the hardest thing would be shipping the features. I even had a Trello board with 40 backlog items, grinding 10+ hours a day for three months until launch.\n\nOn launch day, I even bought a $29 domain and proudly posted it on Product Hunt. The result? 17 visits, 0 sign-ups. I sat there refreshing Google Analytics until 3am, watching the flat line… brutal.\n\nThe following month I sent cold emails to 50+ potential users. Only 2 replied. One of them literally said: “I can do this with a Notion template.”\n\nThat’s when it hit me: coding was actually the easiest part. The real challenge is getting people to notice you, and convincing them to pay. If I could do it again, I’d spend weeks talking to users before writing a single line of code.\n\nAnyone else had that “nobody cares after launch” moment?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 305,
    "downs": 0,
    "created_utc": 1759429331.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.8,
    "category_rationale": "Argues the real challenge is user discovery over coding and offers a mental-model conclusion.",
    "composite_score": 4.117435423263049
  },
  {
    "score": 280,
    "title": "Landed a $16k/m contract from Reddit",
    "selftext": "I'm a webdev subcontractor and my last three contracts were all turning giant spreadsheets into niche web apps used by like 10 people, usually just one b2b customer. I'm seeing these contracts pop up more and more, and it's a lucrative but underserved part of the webdev industry.\n\nI am seeing investment going into older industries like SCADA/ERPs as well. So definitely keep your eyes open for those. What keeps surprising me is I basically have to to turn down these sub-contracts because I don't have time to do them all.\n\nMaybe because devs are now all chasing \"indiehacking\" dreams and less boring stuff like spreadsheets.\n\nFor this specific contract, I frequently write about my experience as a freelancer/1-person developer - and about building SaaS for companies who use spreadsheet as their primary platform in the comments/posts like these.\n\nThis led to multiple DMs and conversations, one of them turned out to be someone I was already connected to on X/Linkedin. I get \\~3 DMs a day and 1 per week would move to a video call. For those video calls, one every month would turn into a solid lead that I'd consider contract for.\n\nEither way, contract signed last week, work starts in April! My DMs are open.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 280,
    "downs": 0,
    "created_utc": 1710537512.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Narrative about freelancing success and market insights without actionable steps.",
    "composite_score": 4.103227016065627
  },
  {
    "score": 259,
    "title": "I will invest up to $10k in your idea",
    "selftext": "No bs.\n\nPitch me your idea. \n\nI will help you brainstorm and elevate it.\n\nWe will come up with fast execution and validation plan.\n\nIf it needs investment, I will do it.\n\nLets create something magical!\n\nEDIT! I have now answered to most of the DMs.\n\nHERE IS MY SUMMARY:\n\nThere are mainly two types of ideas:\n- either too simple and vague (would need to niche down)\n- or I couldn't even understand what the idea is (some biochemistry type shi, you guys should directly hit up with investors in that specific field)\n\nTo those who think I will steal any ideas - cmon bros, be real. Most of the ideas are full garbage. Even ChatGPT can come up with better ones.\n\nINCREASE YOUR CHANCES GETTING AN INVESTMENT:\n1. Don't ask \"can I pitch to you\", just pitch it.\n2. Dont write too much text, dont write too little.\n3. Investor should understand the idea with under 3 sentences.\n4. State your location and previous experince/skillset right away.\n5. Write in 1 text! If you write 5 texts, in Reddit you only see the last one before opening the chat.\n6. Ideally show some validation, traction. Even showing successful competitors helps.\n7. Dont expect the investor to respond right away, they have their own life outside of social media.\n8. DONT EVEN DM before you have posted your idea publicly, best and most honest feedback is literally down here in the comment section. \n9. And lastly, THERE IS 0% CHANCE SOMEONE STEALS YOUR IDEA.\n\nEDITEDIT!\nForgot to add the most important one.\n10. State the reason why are you pursuing the idea in the first place. Can be measured in monetary value, can be your personal ambitions, can be something beautiful.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 259,
    "downs": 0,
    "created_utc": 1762045473.0,
    "media": null,
    "is_video": false,
    "num_comments": 547,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Offers a numbered, reproducible pitching process to win investment.",
    "composite_score": 4.4443636272130025
  },
  {
    "score": 254,
    "title": "When AI Ads Take Control,Where Do Founders Still Add Value?",
    "selftext": "Hey everyone, \n\nTikTok just flipped the switch. Starting like 20 days ago, every Shop advertiser has to use GMV Max, its AI ad engine. No manual targeting, no settings to tweak, no way out. You pick a budget and ROI goal, then the system decides everything from placements to spend to even new creatives. \n\nFor smaller sellers this feels like a win. Less setup, fewer headaches, and TikTok even throws in a “ROI protection” guarantee. But bigger brands and agencies are freaking out because it feels like giving the steering wheel to the platform. TikTok gets the data and the control while you are basically just funding the machine. \n\nSo as founders, if ads are no longer in our hands, where do we still stand out? Is it brand, product, distribution, community? Or something else? \n\nCurious to hear how you are thinking about this shift.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 254,
    "downs": 0,
    "created_utc": 1758689969.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains the shift to AI ad platforms and invites discussion on remaining founder value.",
    "composite_score": 3.5060251826019644
  },
  {
    "score": 245,
    "title": "What are the hardest lessons when building your own store?",
    "selftext": "Hey everyone,\n\nI have been thinking a lot about what it really takes to run your own store as an entrepreneur. From the outside it looks simple: pick Shopify or another platform, launch, run ads, and sell. But once you are in the trenches, the problems feel very different.\n\nOne lesson I keep hearing from other founders is that choosing the wrong platform early on can become a nightmare later. What feels cheap and easy at the start often turns into expensive migrations and endless plugin hacks once the business starts to scale.\n\nAnother pain point is traffic versus conversion. Paid ads bring clicks but often not buyers, and SEO or content takes forever to build momentum. Many founders I know spend heavily on ads only to realize the real bottleneck is converting strangers into loyal customers.\n\nAnd then there is trust. Unlike selling on Amazon, running your own store means you are asking a customer to trust your brand from day one. Payments, shipping, and product quality all become part of that trust equation. Many entrepreneurs underestimate how hard it is to get the very first order when nobody knows you.\n\nI would love to hear from other entrepreneurs here. If you have built your own store, what turned out to be harder than you expected? What do you wish you had done differently in the early days?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 245,
    "downs": 0,
    "created_utc": 1758545978.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Offers observed lessons on store-building challenges and solicits others' input.",
    "composite_score": 3.3794957344632106
  },
  {
    "score": 237,
    "title": "I am going to make 100k in 2026.",
    "selftext": "I am tired of the rat race. I am tired of working for other people. I have no idea how — but I have to make 100k next year. My only problem is I can’t think of what to do. I want to work hard, hustle and make sure I get that money.\n\nI’m writing this for other entrepreneurs to inspire me - I want to do something tangible where I can really work hard at it. I also want to write this so when I look back at the end of 2026 I smile at how I accomplished what I went out to get. Hope everyone else achieves their goals next year.\n\n* EDIT: So happily surprised with how many motivated and ambitious entrepreneurs there are out there! Let’s hope we all achieve what it is we are looking for! *",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 237,
    "downs": 0,
    "created_utc": 1767277552.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Aspiration post with no actionable content; mainly motivation.",
    "composite_score": 4.074962824189634
  },
  {
    "score": 227,
    "title": "Do you ever feel like Reddit gives more honest feedback than any other platform?",
    "selftext": "I’ve been noticing something lately, whenever I share ideas or early concepts on Reddit, the feedback feels way more grounded compared to what I get on places like LinkedIn or Twitter.\n\nPeople here don’t hold back (for better or worse 😅), but I’ve realized that’s actually helpful when you’re trying to test how real users might respond to your product, landing page, or even just your pitch.\n\nFor those of you building something new, have you ever used Reddit to test ideas, messaging, or get early feedback before going live?  \nWas it worth it, or did it just attract criticism that didn’t really help?\n\nI’m curious how other founders see Reddit, as a useful part of the journey or just too unpredictable to rely on.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 227,
    "downs": 0,
    "created_utc": 1760097750.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks about Reddit as feedback tool; mostly a question about methodology.",
    "composite_score": 3.7099948383284165
  },
  {
    "score": 220,
    "title": "Growth or Burn, when is aggressive scaling actually a trap?",
    "selftext": "I keep thinking about the “move fast, grow fast” mantra. After seeing multiple AI and SaaS startups collapse under their own weight, I wonder if aggressive scaling is actually a liability. Growth gets you attention and funding, sure, but if unit economics are broken, every new customer just digs a deeper hole. Amazon survived early burn because it had deep capital markets behind it, but most of us don’t. How do you decide when growth is sustainable vs when it’s just financial quicksand?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 220,
    "downs": 0,
    "created_utc": 1759235184.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.75,
    "category_rationale": "Discusses when aggressive scaling is a trap and analyzes concepts around growth and sustainability.",
    "composite_score": 3.44387727585312
  },
  {
    "score": 218,
    "title": "$10k MRR, low lift, tiny ceiling — keep cruising or let it go?",
    "selftext": "Small productivity tool doing \\~**$10k MRR**. It mostly runs itself: low support, stable churn, cheap infra. Users are happy. I’m… not that excited anymore. Feels capped, and every hour here is an hour not spent on higher-upside work.\n\nNot trying to sell—just curious how other founders decide.\n\n**How would you call it?**\n\n* Keep as calm cash flow and set strict time guards?\n* Bundle into something bigger to give it a new arc?\n* Hand it off/sell so it stops taxing attention?\n\nTwo lines on your rule of thumb would help a lot.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 218,
    "downs": 0,
    "created_utc": 1757775053.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question-driven post about deciding whether to continue a cash-generating SaaS; lacks a clear list, model, or steps.",
    "composite_score": 3.5904441148401185
  },
  {
    "score": 195,
    "title": "keep your 9–5 If you want to be successful in your business",
    "selftext": "I’m honestly tired of hearing people say, *“Quit your 9–5 and start your own business.”*  \nIt sounds inspiring, sure… but after being in business for a while, I can tell you that advice is dangerously oversimplified.\n\nI actually tried the whole “burn the boats” thing. And looking back? It was the wrong decision for 99% of people.\n\nHere’s why:  \n  \n1. Business doesn’t follow your plan ever.\n\nYou don’t just execute a strategy and make money.  \nYou test, you adjust, you try again, you iterate, and nothing goes the way you imagined in your head.\n\nAnd if your *life* depends on the success of every test, every ad, every client conversation…  \nYou will panic and mess everything up.\n\n2. You’ll sabotage ideas that needed time to work.\n\nMaybe your strategy *does* work but only after 3–6 months of data and iteration.\n\nBut when you need cash today because you burned your income source, you’ll try something once, see it doesn’t work immediately, and throw it away.\n\nNot because it was bad…  \nBut because you couldn’t afford patience.\n\n3. Stress absolutely kills creativity and clarity.\n\nI’ve helped enough companies systemize their operations and scale to know one thing for sure:\n\n**A stressed founder becomes blind.**  \nYou can’t see the simple fix.  \nYou can’t think long-term.  \nYou take fewer risks.  \nYou stop experimenting.\n\nYour brain goes from “build” mode into “survival” mode and you cannot grow anything from that place.\n\n4. Your 9–5 is not the enemy. It’s your unfair advantage.\n\nI saw a TikTok the other day where someone said:\n\n“Stop fantasizing about being the underdog. Use your unfair advantages.”\n\nAnd honestly, your 9–5 is an unfair advantage because it buys you something most new founders don’t have: time to experiment, space to think clearly, the ability to make mistakes, the freedom to iterate without fear, and the calmness to build systems properly.\n\nThis is my idea guys, for me I  think the best time you should consider leaving your 9-5 should be after you have a proven lead gen system , reliable delivery workflow. \n\nI am curious to know your ideas, specially from founders running businesses so others can learn \n\nEdit** Idk if you guys want to hear this but I work exclusively with $1M–$10M ARR founders, and we’ve built a private circle of 600+ operators.\nEach week I share the same systems and scaling frameworks clients pay high-ticket for us to implement. If you’re in that range or aiming for it you can join the weekly newsletter [here](https://go.modernoperators.com/newsletter?utm_source=reddit&amp;utm_medium=post&amp;utm_campaign=bereketab) it’s free",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 195,
    "downs": 0,
    "created_utc": 1765545912.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.85,
    "category_rationale": "Central claim that staying in a 9–5 is an advantage with reasoning and examples.",
    "composite_score": 3.9285105277095944
  },
  {
    "score": 189,
    "title": "My First SaaS Only Lasted 3 Months — Lessons from Building Cubo.to",
    "selftext": "I want to share a failure story from my own journey as a founder. A couple of years ago, I launched **Cubo** — a virtual office SaaS meant for freelancers, coaches, and small teams. The idea was simple: combine scheduling, video calls, and client engagement into one place.\n\nIt sounded promising… but within 3 months, the project flatlined. Here’s why:\n\n1. **Too many features, no killer hook** We bundled video calls, booking, and CRM-lite into one app, but nothing stood out as *the* reason to use us.\n2. **Weak product-market fit** Most freelancers already had Zoom + Calendly + Notion. We underestimated how “good enough” existing tools already were.\n3. **Acquisition without retention** We could get signups through ads and posts, but very few stuck around after the first week. Free trials rarely converted.\n4. **Burn rate too high for early stage** Running video infrastructure + a small team meant expenses piled up fast, with no matching revenue.\n5. **Not enough early feedback loops** We built what *we* thought users wanted, instead of iterating quickly with a small set of paying customers.\n\n# Lessons I Took Away\n\n* **Start narrower.** One clear pain point &gt; a bundle of half-baked features.\n* **Talk to users more.** Don’t assume — validate willingness to pay.\n* **Track retention first.** Vanity metrics like signups don’t pay the bills.\n* **Stay lean.** Control burn until you have true pull from the market.\n\nIt wasn’t fun to shut it down, but the 3-month crash course taught me more than any book could.\n\n👉 My question to this community:\n\n* Have you ever launched a SaaS that flopped fast?\n* What did you learn that shaped your next venture?\n\nI’d love to hear your stories — maybe we can build a “failure library” together.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 189,
    "downs": 0,
    "created_utc": 1757768766.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.85,
    "category_rationale": "Shares lessons and insights from a failed SaaS project with supporting reasoning.",
    "composite_score": 3.25231422831266
  },
  {
    "score": 183,
    "title": "44-Year-Old Multi-Millionaire Keeps Lying About Paying Me—WTF?",
    "selftext": "Very curious to hear other peoples perspective.\n\nI did some consulting for this Single Family Office 2 years ago, we had a full contract signed and everything. One thing that just annoyed me at the time, it was that the location of jurisdiction was based in Switzerland, instead of being based here in the US. I let it kind of slide, not assuming I would get stiffed.\n\nA year passed, and honestly, I didn’t really need the money. The agreement was that he would pay me $25,000 a month as a retainer, plus a percentage on the back end of deals, to help him take a company public and make key introductions. At first, when I brought up payment, he kept saying he’d pay me in one lump sum in 3–4 months. I was fine with it—I wasn’t pressed. But over time, he kept claiming he wasn’t liquid and was waiting for a big cash-out. Eventually, I realized he was just stringing me along and taking advantage of my time. I formally walked away. I had treated this role like a board seat—limited time commitment but still valuable. In the end, I got played because I was too nice.\n\n**Fast forward two years**, and now I’m just pissed that I wasted a whole year dealing with this ridiculous person. He still texts me with the same nonsense—“I’m getting it done, I’m getting it done.” At this point, it’s beyond frustrating; it’s straight-up disrespectful. It’s not even about the money anymore—it’s the principle. I got screwed over and lied to my face, and that’s what really bothers me.\n\nTaking legal action against someone in Switzerland is actually a pain in the ass, and I'm not sure what i want to spend $200k to get $400k.\n\nHas anyone dealt with something similar? Any creative methods?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 183,
    "downs": 0,
    "created_utc": 1739986517.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Emotional grievance about being lied to and mistreated; venting and moral judgment.",
    "composite_score": 3.9749707556419214
  },
  {
    "score": 179,
    "title": "What Does an AI Product Manager Actually Do?",
    "selftext": "I’ve been diving into AI products lately, and one thing I’m still trying to wrap my head around is the role of an AI product manager. How does it differ from a traditional product manager? With AI being so data-driven and constantly evolving, how do you prioritize feature development? \n\nFor those who’ve been in the trenches of AI product management, what skills or tools have been the most useful for balancing both tech and user needs? Would love to hear your experiences and any advice on making the jump into this field! ",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 179,
    "downs": 0,
    "created_utc": 1758543697.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "A general question about AI product management roles; lacks substantive content.",
    "composite_score": 3.1557875029352966
  },
  {
    "score": 180,
    "title": "Did a favor for a friend, and she made $30k!",
    "selftext": "Over the summer a friend of mine wanted to start coaching, so I setup a quick landing page and linked it up to Stripe for her.  No big deal, just took a few hours one weekend. \n\nShe just told me that she's make $30k since then!  I was blown away.  \n\nThis has been a great reminder to me that:   \n\\- You don't need to spend lot to get a new idea started  \n\\- What's easy for you can be life changing to another  \n\\- Keep it simple \n\nNow she's talking about quitting her job and going in 100%. \n\nEDIT:  I just talked to her and she approve sharing the link.  So here it is:\n\nhttps://thepersonalyst.com",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 180,
    "downs": 0,
    "created_utc": 1736388066.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Anecdotal success story; brief and not instructional.",
    "composite_score": 3.961314191388969
  },
  {
    "score": 164,
    "title": "When AI Ads Take Control, Where Do Founders Still Add Value?",
    "selftext": "Hey everyone, \n\nTikTok just flipped the switch. Starting like 20 days ago, every Shop advertiser has to use GMV Max, its AI ad engine. No manual targeting, no settings to tweak, no way out. You pick a budget and ROI goal, then the system decides everything from placements to spend to even new creatives.\n\nFor smaller sellers this feels like a win. Less setup, fewer headaches, and TikTok even throws in a “ROI protection” guarantee. But bigger brands and agencies are freaking out because it feels like giving the steering wheel to the platform. TikTok gets the data and the control while you are basically just funding the machine. \n\nSo as founders, if ads are no longer in our hands, where do we still stand out? Is it brand, product, distribution, community? Or something else? Curious to hear how you are thinking about this shift.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 164,
    "downs": 0,
    "created_utc": 1760099506.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Explores where founders add value in the context of AI advertising; presents a mental-model discussion.",
    "composite_score": 3.2685139398778875
  },
  {
    "score": 149,
    "title": "Enough of these stupid AI wrappers",
    "selftext": "Every week there’s a new “AI hiring platform” popping up, claiming it’s gonna revolutionize recruiting, and EVERY *single one* of them ends up being nothing more than a glorified LinkedIn wrapper with a chat UI.\n\nThey all say “AI matching,” but it’s literally just keyword search with extra steps. Same recycled profiles, same shallow screening, same useless dashboards.\n\nI’m all for AI helping recruiters work faster, but this isn’t it. If you’re gonna build in this space, at least fix the ACTUAL pain points: sourcing, screening, scheduling, all the boring repetitive stuff that kills time.\n\nNot just slap ChatGPT on top of LinkedIn and call it innovation. Is new AI even being built or is everyone just shipping wrappers now?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 149,
    "downs": 0,
    "created_utc": 1759530821.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Frustrated critique of AI wrappers and superficial solutions in recruiting tech.",
    "composite_score": 3.418591259055681
  },
  {
    "score": 148,
    "title": "My employee quit and I realized we had zero training materials. Cost me $8K to fix.",
    "selftext": "Operations manager gave 2 weeks notice. She handled everything: client onboarding, invoice processing, vendor relationships, internal workflows. I thought we'd be fine. We weren't.\nFirst week without her: New hire asks 47 questions. I answer 47 questions.\nSecond week: Same questions again because he forgot. I answer them again.\nThird week: He does something wrong that creates a $2,400 problem with a client. Nobody told him the right way because nothing was documented.\nHired a consultant to help document everything. Cost $8,000. Took 3 weeks to create:\n23 process documents\n15 training videos\nSOPs for everything the old manager used to just \"\"know\"\"\nMost painful $8K I've spent. Could've avoided it by documenting as we went.\nNow I make team leads record quick walkthroughs whenever they create a new process. We use basic tools Notion for docs, loom for screen recordings, gamma for visual guides since those are quick to put together and just build the knowledge base as we go instead of in crisis mode.\nThe real cost wasn't the $8K. It was the month of chaos and the client problem that could've killed the relationship.\nDocument your processes before someone leaves. Not after.\"",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 148,
    "downs": 0,
    "created_utc": 1765643277.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.75,
    "category_rationale": "Offers actionable steps and tools to document processes and avoid crisis; sequence-like guidance.",
    "composite_score": 3.5998109136112246
  },
  {
    "score": 139,
    "title": "How I closed another $10k client from Reddit",
    "selftext": "Last time I shared a post here about how I closed a $9.6k/m client from IndieHackers and it kind of got viral and this led to another success story, someone reached out to me and I closed another client currently finishing up the design and starting the development!   \n\n\nhttps://imgur.com/a/mwyF7q5  \nDo not loose hope, I sent 1000s of cold emails with no luck but this worked!   \nFor the people who don't know I started Devmason.io last year and it took off and I started making $20k then $30k/m then I got exhausted, few clients churned then I started sending out emails.  \nReddit is underrated  \n\\- Share more of your work online SPECIALLY Reddit  \n\\- Start collecting testimonials ASAP, I keep them here https://testimonial.to/al3rez/all  \n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1713273241.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Narrative with actionable tips (testimonials, outreach) implying a repeatable client-closing process.",
    "composite_score": 3.7211770556853665
  },
  {
    "score": 128,
    "title": "would you build a business around this kind of tool?",
    "selftext": "i came across a project recently on hugging face called NoWatermark. it’s an ai tool that removes watermarks from images, and to my surprise it actually works really well. link if you’re curious: https://huggingface.co/spaces/abdul9999/NoWatermark\n\nit got me thinking — in the world of entrepreneurship, there are so many tools that start out as simple experiments like this. some of them stay as side projects, and some end up evolving into actual businesses.\n\nthe interesting part here is the gray area: watermark removal clearly has demand (designers, photo editors, even people restoring old family photos could find it useful), but there’s also the big question of ethics and copyright.\n\nso i’m curious how other entrepreneurs here would approach this:\n\nwould you even consider building a business around something like this?\n\nif yes, how would you position it so it doesn’t come off as “removing ownership rights”?\n\nif no, do you think there’s a safer adjacent use case that could still be monetized?\n\ni’m not the builder of this tool, just fascinated by the idea and the bigger question of when a tool is “just a cool demo” vs when it’s a real startup opportunity.\n\nwould love to hear some perspectives.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 128,
    "downs": 0,
    "created_utc": 1758105941.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Discussion prompt about whether to monetize a tool; not fitting a strict how-to or list.",
    "composite_score": 2.9886047081312395
  },
  {
    "score": 116,
    "title": "Forget unicorns. $10K MRR solo feels better than $2M seed and stress",
    "selftext": "I’m a founder of a SaaS company, which I built solo, bootstrapped, no investors. It scrapes data from social platforms and maps. Simple tool, solves a real problem and makes money from day one.\n\nAnd honestly, the more I build, the more I believe micro SaaS &gt; venture-backed startups. I’ve seen too many stories like \"raised $700K pre-seed → burned through it → now stressed out trying to raise again.\" Meanwhile, I just fix bugs, ship small features, talk to customers and grow at my own pace.\n\nWith micro SaaS, you can get to $5K–$20K MRR with high margins, no pressure and total control over your time. You don’t need a team of 20 or a slide deck for every decision. Just a useful product, a few customers who pay and a feedback loop that actually works.\n\nWould love to hear from others building solo or small- how’s it going for you? And if you’re still debating startup vs micro SaaS, happy to share more behind the scenes if helpful.\n\nP.S. many asked for a link so I decided to share it here: [https://socleads.com](https://socleads.com/)",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 116,
    "downs": 0,
    "created_utc": 1744391220.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.88,
    "category_rationale": "Advances a central claim about micro SaaS viability with reasoning and examples.",
    "composite_score": 3.5021558660821803
  },
  {
    "score": 113,
    "title": "Tropicana Lost $50M Because They Forgot What an Orange Looks Like—Marketing Fail of the Century",
    "selftext": "Alright, picture this: You're half asleep, stumbling into the grocery store to grab your usual orange juice, and BAM—you can’t find it. You squint. You look harder. The entire Tropicana section has been abducted and replaced with some generic, off-brand nonsense. Except… it is Tropicana. They just decided to erase their most recognizable design—an orange with a straw—because, I guess, minimalism?\n\nBack in 2009, Tropicana spent $35M on a full rebrand, ditching their iconic packaging for a sleeker (read: blander) design. Within two months, sales plummeted 20%, losing them $30M almost overnight. That’s $50M+ burned just because nobody knew what the hell they were looking at. The backlash was so bad that they hit the corporate panic button and went back to the old design immediately.\n\nThis might be the case study for “If it ain’t broke, don’t fix it.” But it begs the question: Why do brands mess with something so core to their identity? Is this just a case of marketing execs needing to justify their salaries, or did they actually think a glass of orange juice was more recognizable than an actual orange?\n\nWhat’s the worst rebrand you’ve ever seen?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 113,
    "downs": 0,
    "created_utc": 1739442116.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.82,
    "category_rationale": "Provides a branding case study with a lessons-oriented explanation.",
    "composite_score": 3.6724948383284164
  },
  {
    "score": 98,
    "title": "Have you ever had a client drop you because you weren't US based?",
    "selftext": "It happened to me early on, and honestly, it stung. I was doing everything right delivering solid work, hitting deadlines, good communication but the minute they found out I wasn’t based in the US, it was like a switch flipped. They ghosted me a week later.\n\nLooking back, I get it. Some companies just feel more secure working with US registered businesses, especially when it comes to contracts, payments, and trust. But that experience pushed me to register my business in the US. I used Adro for the whole process and let me tell you, having a legit US address, phone number, and EIN made a huge difference. I stopped getting questioned about my legitimacy, and I landed more clients without the back and forth. If you're international and serious about scaling, especially if you're selling on Amazon, using Stripe, or running Facebook ads, getting a US presence is a game changer.\n\nCurious, anyone else dealt with this kind of bias? Did registering in the US help? Would love to hear your story.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1751306145.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Shares experience and practical advice about client bias and establishing US presence.",
    "composite_score": 3.302606870750968
  },
  {
    "score": 89,
    "title": "TikTok just gamified shopping. Slash &amp; Free turns referrals into discounts until you hit $0. This is borderline genius.",
    "selftext": "TikTok quietly launched a new campaign called Slash &amp; Free, and it might be one of the smartest viral growth plays of Q4.\n\nHere’s how it works:\n\n1. You pick an item on TikTok Shop.\n2. Every friend who clicks your referral link “slashes” a few dollars off the price.\n3. Enough referrals = item hits $0 = you get it free.\n\nIt’s essentially a gamified referral loop with zero ad spend. TikTok gets viral exposure, creators push their links for dopamine hits, and the platform gets fresh signups and engagement data.\n\nIt’s Temu’s “invite friends, get free stuff” re-skinned for a Gen Z audience, but way slicker in UX and shareability. They turned shopping virality into a literal game mechanic.\n\nWould love to hear if anyone else is watching this unfold or has data on how it’s converting.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1764049449.0,
    "media": null,
    "is_video": false,
    "num_comments": 945,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Explains a growth mechanism (gamified referrals) with supportive analysis.",
    "composite_score": 4.169688077640221
  },
  {
    "score": 90,
    "title": "Made a comeback at 47",
    "selftext": "in 2019 i lost millions of paper profit. \n\nI was an NYC fireman. Planning to retire early. \n\n13 years of work. Started with my own primary residence after being a lifetime renter.\n\nEventually I had….\n\n$5M in real estate\n50 tenants\na dream house in chappaqua ny with tons of equity was in danger.\nwhy? \n\nWe didn’t have consumer debt.  My personal car was a 2012 Toyota Camry I bought for cash. 6k bought from a mechanic after it was in an accident. \n\nMy cc were paid monthly. I’m not a big consumer. Tools I buy tools. \n\nI built a small real estate business up from zero. I had a lot of equity, some of the deals were 80% paid.\n\nI had a few million dollars worth of 24 month 12% interest loans. \n\nA contractor had placed\nliens which ruled out refinancing and meant each loan would have to be repaid sooner then I planned. \n\n some of the loans were only 3 to 6 months out.\n\nevery deal had personal guarantees\n\ni went from collecting $50K/month...\nto sitting in my car on FDNY days off wondering what was next. \n\nWhen you used to work two jobs running a company going crazy all the time a little silence and solitude is good helps you spot opportunity.\n\ni bought a used bobcat and dump truck with what was left after my real estate sale(cleared some cash), did some work in m my house. Did some work on myself, by myself.\n\nPut about 500k in equity in my house by clearing some land and making it flat and usable, building stone patios, rock walls. Moved 200 yards of dirt and rock. \n\nEventually I paid every loan\nevery contractor. \nno bankruptcy, all loans and bills paid.\n\nbut i was cooked...\nnot totally broke we both had our jobs my wife a succesful business but i was ... identity less after the backyard project I searched for another opportunity. \n\nevery building sold peeled off a layer of confidence\nearly retirement? not my dream\ni love to work\n\nEnter ecom. \n\ni worked\ni read\ni listened to every ecommerce podcast\nstudied facebook ads\nran tests\nfailed\nlearned\nworked for free 3x brands.\n\na stuck brand\n$70K/month\nwe grew it to $1.5M/month\n\nbut this isn’t only Ecom. Could be plumbing, landscaping whatever. \nit’s about what you do when you think you’ve hit your last run\n\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 90,
    "downs": 0,
    "created_utc": 1746465268.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal comeback story without actionable guidance.",
    "composite_score": 3.6229031949655175
  },
  {
    "score": 91,
    "title": "What’s the one skill every entrepreneur must have to succeed?",
    "selftext": "There’s a lot of advice out there, learn sales, marketing, storytelling, or leadership.  \nBut if you had to pick *just one skill* that’s absolutely non-negotiable for entrepreneurial success… what would it be?\n\nSome people say it’s resilience, others say execution, communication, or focus.\n\nFor those who’ve been building or running businesses, what’s the one skill that truly made the difference for you, and how did you develop it?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 91,
    "downs": 0,
    "created_utc": 1762946630.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Discussion prompt asking for the single essential skill; no substantive content.",
    "composite_score": 3.786833456873396
  },
  {
    "score": 83,
    "title": "What’s the one lesson you learned way too late in entrepreneurship?",
    "selftext": "Every founder has that one realization they wish they’d understood earlier -  \nsomething that would’ve saved months of stress, money, or unnecessary mistakes.\n\nFor some it’s:  \n• “Cash flow matters more than revenue.”  \n• “If everyone is your customer, no one is.”  \n• “Hiring too early creates more problems than it solves.”  \n• “Speed doesn't matter if you're building the wrong thing.”  \n• “Boundaries prevent burnout, not laziness.”\n\nSo I’m curious:\n\nWhat’s the one hard-earned lesson you learned far later than you should have?  \nAnd how did it change the way you run your business today?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 83,
    "downs": 0,
    "created_utc": 1764156959.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Discussion prompt asking for a late entrepreneurial lesson; no substantive content.",
    "composite_score": 3.578703831430509
  },
  {
    "score": 81,
    "title": "Expecting everyone to be an entrepreneur is ignorant",
    "selftext": "Seriously, if everyone as an entrepreneur then who is a cop? Who os a firefighter? Who is a nurse? Who is a an amazon delivery driver? We all need eachother so let’s stop pretending like we don’t. That Dream Lamborghini of yours waa designed by a mechanical engineer who works 9-5. The roads you drive on were paved by pavers. All the packages you order online? Amazon, ups, USPS, and Fedex come into play. \n\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 81,
    "downs": 0,
    "created_utc": 1743867838.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.89,
    "category_rationale": "Emotional/moral critique about expecting everyone to be an entrepreneur.",
    "composite_score": 3.377053310904844
  },
  {
    "score": 74,
    "title": "i made $7k in 2 months because i was sick of being the broke friend",
    "selftext": "a couple of months ago, i started working on something that could actually make money. my friends kept flexing about their jobs, they'd work at their dad's lawnmowing business making $2k a month and wouldn't shut up about their paychecks. meanwhile i was 15 sitting in my room building random stuff that nobody used. it was honestly embarrassing and i got tired of feeling broke compared to everyone else.\n\nso i decided to get serious about building something people would actually pay for instead of just cool projects that impressed nobody.\n\nhere's where things are right now:\n\n* $7k in revenue in just the past 2 months\n* $3k MRR and growing (lifetime + monthly deals are crazy)\n* 160+ paying customers (77 in the past 2 months !)\n* 25k monthly visitors total from the past 2 months\n\ni spent nothing on ads. all the growth came from Discord and Slack founder communities at the start for the first paying users, and then Twitter build-in-public, Reddit posts, and cold emails for the next hundred. i joined like 8-10 Discord communities and spent weeks helping people before ever mentioning what i was working on. posted daily on Twitter for months sharing my building journey. cold emailed 150+ founders daily with a value-first approach.\n\nsome takeaways so far:\n\n* community engagement beats everything. you can build the coolest thing but unless you're actively helping people in communities, no one finds it.\n* charging from day one works. no free trials, just paid access. people who won't pay aren't serious customers.\n* consistency is way better than going viral. i posted every single day for months instead of trying to get lucky with one viral moment.\n\nthis is still very early but now my friends have stopped bragging about their $2k monthly paychecks. funny how that works when a teenager makes more from his bedroom than they do working summers from hard work and staying humble.\n\ni still tell them I'm failing projects and haven't made a single dollar. they are still flashing the paychecks.\n\nmakes me think the ceiling is way higher than i thought.\n\nhere's proof so you know im not bullshitting: [screenshot](https://imgur.com/a/m7b08H7)\n\nedit: if you want to check out what I am building (because people keep asking me): [link](http://bigideasdb.com)",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1756526867.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.87,
    "category_rationale": "Contains a list of actionable takeaways/tointers from the experience.",
    "composite_score": 3.281453191751568
  },
  {
    "score": 68,
    "title": "It feels like almost everyone wants to / is starting a business these days",
    "selftext": "I've recently noticed there's been a huge increase in the number of startups and new businesses. The side hustle culture is very much IN. 10 years ago, it wasn't so prominent. I'm curious, I wonder if it is to do with more opportunity, or that information is widely available, or are people just fed up of working for other people, is it hard to live on a salary? Are there loads of these business and finance gurus now telling people to start businesses to get rich so there's more people doing it?\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1763993501.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Open-ended discussion about startup trends; lacks structured guidance.",
    "composite_score": 3.4568864920876683
  },
  {
    "score": 64,
    "title": "How do you keep momentum when legal stuff slows your launch?",
    "selftext": "Starting a business in the US from abroad is a challenge in and of itself. I knew it wouldn’t be simple, but I definitely underestimated how draining the process would be.  \n  \nBetween figuring out the structure, dealing with legal documents, handling banking stuff, and working across time zones, it’s been a ride. I finally felt like everything was in place and I was ready to go. Then the EIN delay hit.  \n  \nI submitted the SS-4 by fax over a month ago, and I’ve heard nothing. I knew it wouldn’t be immediate, but I didn’t think I’d be waiting this long. Now I just feel stuck, refreshing my inbox and checking this site where people anonymously post their EIN wait times. I’ve caught myself checking it like 3 times a day just trying to get some sense of progress.  \n  \nIt’s been hard to stay motivated. Every time I feel like I’m gaining traction, something new stalls the launch. Just curious, how do you keep the energy up when things outside your control slow everything down?  \n  \nWould love to hear how others navigated this phase. Not gonna lie, I’ve been feeling pretty discouraged with all this outside pressure.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1749746795.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for strategies but does not present a step-by-step framework.",
    "composite_score": 2.9854623766499837
  },
  {
    "score": 59,
    "title": "Got denied by YC a second time. Crushed.",
    "selftext": "Just got denied from YC after an interview today. This is the second time we applied and got rejected at the interview stage. I honestly was crushed, way more than I was expecting. \n\nMy cofounder is leaving after this. My job at FAANG sucks, so I was hoping this would be my out. I feel completely blindsided. \n\nI was so hopeful this time. The feedback was neutral, and not the feedback we were expecting. Basically, they weren’t convinced our product is needed which I found shocking. The product is a proven idea outside of enterprise, so it should be an easy sell. It’s already making money elsewhere. \n\nI wasn’t nearly as upset as this the first time around because my hopes were low and I actually liked my job. Now I’m 24, no friends and no cofounder. It’s like my life has completely changed within a second. This sucks.\n\n\nI’m gonna go eat and watch a movie, then hopefully I’ll be out of this rut.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1698453346.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Strong emotional vent about YC rejection and personal setback.",
    "composite_score": 3.3772135495608744
  },
  {
    "score": 63,
    "title": "I built an email API because I was tired of paying $400/month just to send password reset emails",
    "selftext": "After 5 years of freelancing, I noticed the same pattern with every client: they'd start a SaaS, pick a popular email provider, and within 6 months they'd be paying hundreds just for transactional emails.\n\nOne client was paying $380/month to send 200K emails. Password resets. Order confirmations. The boring stuff.\n\nI kept thinking: \"This can't be that hard.\"\n\nSpoiler: It was that hard.\n\nStarted building my own email infrastructure last year. Learned more about SMTP, DKIM, SPF, DMARC, IP warming, and deliverability than I ever wanted to know.\n\nFirst version was garbage. Emails landed in spam. Got blocklisted by Microsoft. Cried a little.\n\nBut after hundreds of late nights, I finally got it working. 99%+ deliverability. Own infrastructure. No AWS SES middle-man eating margins.\n\nNow I'm using it for my own projects and slowly opening it up to others.\n\nThe funny thing? The hardest part wasn't the tech. It was convincing myself that competing against well-funded companies was even possible.\n\nIf anyone's curious about the email deliverability rabbit hole, happy to share what I learned. It's a weird niche but surprisingly interesting once you get into it.\n\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1766151087.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Personal technical narrative with insights about building own email infrastructure.",
    "composite_score": 3.2127808360173846
  },
  {
    "score": 62,
    "title": "I asked 23 of my friends why they haven't started a business - answers were depressing",
    "selftext": "Spent the last two weeks asking some friends who i know have showed interest in a business idea.\n\nHere's what I found:  16 people had a \"business idea\" but couldn't articulate their first actual step, 5 people were \"still researching\" after 6+ months, 2 people were waiting for \"the right time\". \n\n  \nThe pattern here is that everyone is focused on the WHAT instead of the HOW. \n\nSo I'm testing something: Picking the most boring, unglamorous business I can think of (window cleaning) and just executing the checklist publicly. No overthinking. No perfect plans, just showing the steps i'm taking to get some sort of output.\n\nQuestion for this sub: **What's the actual thing stopping YOU from starting?** Not the excuse you tell yourself, but the real reason.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 62,
    "downs": 0,
    "created_utc": 1763939303.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Analyzes why people struggle to start and suggests validating a practical approach.",
    "composite_score": 3.3489564093190696
  },
  {
    "score": 58,
    "title": "Landed a $9.6k/month client from Indie Hackers",
    "selftext": "Hey there!\n\nI run a dev agency called devmason.io, and I've got a cool story to share. I like writing about my work and experiences on Indiehackers.com. Guess what? A client reached out to me after reading one of my posts!\n\nThey needed help switching their project from SemanticUI to Tailwind CSS and adding some new features using React hooks. I was super excited to lead this project and lend a hand. I also helped new devs join the team and taught them some good practices. Even though we all work remotely, I fit right in and was always available on Slack to help out.\n\nThe client was really happy with my work and left me a testimonial. They even agreed to do a referral! It's so cool to see how sharing my experiences can lead to great opportunities.\n\n[https://testimonial.to/share/railsman/t/Lvpkalx2D6BabglwzWE7rB3Xq](https://testimonial.to/share/railsman/t/Lvpkalx2D6BabglwzWE7rB3Xq)\n\nSo, if you ever need any dev work done, feel free to message me. I'm always ready to chat!\n\n\n\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1712061986.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Anecdotal success story with limited general guidance.",
    "composite_score": 3.055412002970107
  },
  {
    "score": 56,
    "title": "Does anyone else get imposter syndrome when working with international clients remotely?",
    "selftext": "No matter how confident I felt in my work, there was always this little voice in my head when pitching or onboarding US clients: “Do they think I’m legit?”\n\nWorking remotely from outside the US, I found myself over explaining, over prepping, and overthinking everything. It wasn’t just about the work, it was about looking the part. A polished website, a clean email domain, a US number, a proper business address. All those tiny things suddenly felt massive.\n\nEventually, I realized it wasn’t just nerves, it was trust. US clients expect a certain level of structure and presence. That’s when I decided to make it official and set up a US entity. I used Adro Banking for the legal side and to get my business account sorted along with the US SIM card, phone number and address. It helped a lot, not just practically but mentally. I felt way more legit once everything was in place.\n\nStill, I’m curious do others feel this way? Does imposter syndrome hit harder when you’re working with clients from a different market? What helped you feel more confident or “established” when making the leap? Would love to hear how others navigated this.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1750847626.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Discusses imposter syndrome and asks for others' experiences; not instructional.",
    "composite_score": 3.04034653182591
  },
  {
    "score": 56,
    "title": "How do small DTC apparel businesses decide where to focus early on?",
    "selftext": "I run a small DTC apparel business [(XOOBAY)](https://www.xoobay.com/), and I’m trying to be more intentional about where to focus time and resources in the early stages.\n\nThere are so many areas competing for attention at once, customer support, fulfillment, marketing, community building, operations, and general day-to-day admin — and it’s hard to know which ones actually deserve priority before the business reaches more stability.\n\nFor other small business owners, how did you decide what to focus on first when everything felt important? Were there areas you initially underestimated that ended up having a bigger impact than expected?\n\nI’m not looking to promote anything, just hoping to learn from others who’ve navigated this stage already.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1765713254.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks how to prioritize focus; seeks advice rather than delivering steps.",
    "composite_score": 2.7444354830323228
  },
  {
    "score": 49,
    "title": "How I grew my bootstrapped company 100% organically",
    "selftext": "Zero ad spend. No paid influencers. No cold outreach.\n\nI'm bootstrapped, so I couldn't afford to burn money on ads hoping something would stick. I had to find channels that compound over time.\n\nHere's what worked.\n\n**SEO became my main acquisition channel**\n\nMost founders sleep on SEO because results take months. That's exactly why it works — your competitors give up.\n\nI automated my content pipeline with this [tool](https://blogseo.io/): keyword research, article generation, publishing. One post per day, every day. After 3 months: 3 clicks/day → 450+ clicks/day. That traffic now converts on autopilot while I sleep.\n\n**Building in public on LinkedIn &amp; X**\n\nI shared my journey: wins, failures, lessons. No fluff, no humble brags. Just honest updates about what I was building and learning.\n\nThis did two things: attracted early users who resonated with the story, and kept me accountable to actually ship.\n\nSocial media posting is very slow at first, but if you keep delivering value consistently, you'll eventually be rewarded.\n\nConsistency is key, and where you can, always automate to protect your time for high value tasks!",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1764266471.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Provides a numbered-style list of growth strategies.",
    "composite_score": 2.821470004336019
  },
  {
    "score": 49,
    "title": "What happened when I lost everything twice trying to build a branding business",
    "selftext": "I started selling $5 logos on Fiverr when I was 19. Things picked up fast, and for a while it felt like the business was running itself. Then out of nowhere, Fiverr delisted us. Even with 5-star reviews, a few issues I didn’t catch piled up, and the whole account was gone overnight.\n\nI hit zero hard. No customers, no income, nothing. That period forced me to actually learn how to run a business instead of just taking orders on a platform. When I came back, things went well again… until I realized my second big mistake:\n\nI had built everything on a platform I didn’t own.  \nNo customer list, no retention, no control. So I had to rebuild again, website, ads, processes, support basically learning real operations from scratch. It was messy, slow, and full of trial and error.\n\nA few lessons I learned the hard way:\n\n* Platform dependency will burn you eventually. Own your customer relationships.\n* Good service isn’t enough if your systems suck. Communication and expectations matter.\n* Scaling fast is pointless if the foundation isn’t stable.\n\nI’m in a better place now with a team and more stable systems, but it took a lot of rebuilding (twice) to get here.  \n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1762534465.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares hard-won lessons and best practices for building a business.",
    "composite_score": 3.041694465025156
  },
  {
    "score": 48,
    "title": "What made you realize your business could actually go international?",
    "selftext": "For me, it wasn’t some massive sales spike or viral moment. It was way more subtle just getting through that first layer of legit red tape. I remember wanting to tap into the US market but thinking, there’s no way this is gonna work from where I am. Still I figured I’d try so I registered an LLC in the US, set up a proper business address, got a real US number through Adro and hoped it would lead somewhere.\n\nThen one day, Amazon approved my ad account. That was it. No confetti, no fireworks but in that moment, it felt real like, okay I’m not just playing around anymore. And let’s be honest, we all know getting approved on Amazon com is a game changer. I’ve been in the ecommerce space for years, but the moment that approval came through, I knew it was time to lock in. Everything just started feeling more legit.\n\nThat tiny win unlocked a whole new path, access to US based tools, smoother payment systems, even better ad performance. Curious to hear from others, was there a moment when it clicked for you? When it went from a fun project to this could be huge?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1751993956.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Personal turning-point narrative with a guidance-oriented insight about expanding internationally.",
    "composite_score": 2.945892422607626
  },
  {
    "score": 44,
    "title": "Freelancers who took it global, how’d you land your first US client?",
    "selftext": "Hey folks, I’m based in Canada and just finished setting up my business in the US. Got the llc, US address, phone number, basically the whole setup. Used Adro banking to handle all that for us just to speed things up since it was a lengthy process and we’re trying to take off quickly.\n\nNow that the paperwork’s out of the way, I’m trying to figure out how to actually land my first US client.\n\nIf you’ve made that leap, I’d love to hear how you did it. Was it cold outreach, Upwork, referrals, paid ads? Anything you’d recommend or avoid? What industry are you in, and how long did it take you to close that first US deal after getting everything set up? Were there any surprises or big differences working with US clients?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1750263356.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A request for advice on landing US clients; lacks a defined model or steps.",
    "composite_score": 2.865333768495006
  },
  {
    "score": 45,
    "title": "I lost a lot of my friends since becoming an entrepreneur.",
    "selftext": "I'm not asking a question but I just wanted to express how I've been feeling here. I'm a female entrepreneur, and have been so busy and in my own world that I've lost touch with pretty much the majority of my friends. Its a lonely path, and right now I'm feeling a bit down about it but all I can do is go forward and continue on the path. It was sad to see my old close friends invite people to be their bridesmaid but I wasn't included. I only see them every now and then and at birthdays or big events, but my day to day is just working, hanging out with my dog, and my husband. \n\nAnd it's too late for me to try and resurface those relationships now, or if it I do it seems disingenuous. You reap what you sow. It sucks, I'm still on the grind and don't have the time for friendships still, but hopefully I will be able to soon. ",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1742877768.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Emotional vent about losing friends due to entrepreneurship with a clear negative stance.",
    "composite_score": 3.1759090820652176
  },
  {
    "score": 42,
    "title": "Keep your 9–5 if you actually want to build a real business next year",
    "selftext": "This sounds wrong in a world constantly telling you to “quit your job,” “escape the 9–5,” and “bet on yourself.” I bought into that idea too, right up until I tried it for myself.\n\nI rushed to go solo early because that’s what successful founders *say* they did. No boss, no ceiling, full freedom. On the surface it felt like the right move. In reality, it backfired.\n\nI work with founders on their ops now, and I see this pattern a lot.\n\nThe first issue was execution. Business doesn’t work the way Twitter threads make it sound. Ideas are cheap, but execution is not, and execution requires skills most people haven’t built yet.\n\nWorking for others exposed me to real systems, real constraints, and real decision-making pressure. Those are things you don’t learn from courses, templates, or motivation threads.\n\nThe second problem was time pressure. When your business is your only income, every decision becomes rushed. You pivot too early, sell too cheaply, and chase tactics instead of building foundations.\n\nA job buys you time, and time is unfair leverage in business. It gives you room to think clearly instead of reacting out of fear.\n\nThe third issue was mental strain. Being broke and calling it “freedom” isn’t heroic, it’s distracting. When survival pressure is high, long-term thinking disappears.\n\nYou stop planning and start scrambling. Desperate decisions compound faster than good ones ever do.\n\nThe reframe that changed everything for me was realizing that working for others isn’t the enemy. It’s leverage. It’s paid practice, skill development without existential risk, and a sandbox where mistakes are cheaper.\n\nThis isn’t advice to stay employed forever. You should quit eventually, but only after you’ve built transferable skills, saved enough to buy time, and proven your idea can survive without panic.\n\nCurious how other founders see this. Did quitting early help you, or did it slow you down?\n\nEdit\\*\\*  Not sure if this will help, but because of my business I work closely with $1M–$10M ARR founders and see the patterns most founders miss. \n\nEach week I share the same scaling frameworks and operational systems we implement with clients \n\nyou can get them free in my newsletter if you want to see how the top founders  actually run their businesses [here](https://go.modernoperators.com/newsletter?utm_source=reddit&amp;utm_medium=post&amp;utm_campaign=bereketab)",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1766758996.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Presents a mental model that employment can be leveraged to build a business, with reasoning and cautious guidance.",
    "composite_score": 3.0470290829394173
  },
  {
    "score": 44,
    "title": "Anyone have experience with Ecom Boss Mentoring?",
    "selftext": "Just had a call with the Ec⁤om Bo⁤ss Mentoring team and it honestly sounded really good. They focus on dropshipping us⁤ing Facebook Marketplace and eBay instead of paid ads, plus they have some AI automation tools which seems pretty cool.\n\nThe guy i spoke with was super knowledgable and the whole approach seems different from the typical shopify/ads route that hasnt been working for me.\n\nBefore i commit to anything i wanted to see if anyone here has actually gone through the program? Would love to hear some real experiences from people who've worked with Jam⁤es Conti and his team.\n\nTheir reviews look solid but you know how those can be sometimes. Figured id ask here for some honest feedback from other aussies.\n\nThanks in advance!",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1760771119.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A question about experiences with a mentoring program; no substantive content.",
    "composite_score": 2.825761533782472
  },
  {
    "score": 42,
    "title": "Nextiva review, what's your actual experience?",
    "selftext": "Been researching business phone systems for our 10 person team and Nextiva keeps coming up as an option. Reviews seem pretty mixed though.\n\nWe need phone, video, and team chat consolidated. For those actually using Nextiva, how's it working out? Specifically curious about call quality, setup process, and if the unified approach actually makes things easier day to day.\n\nTrying to make an informed decision here, real experiences appreciated.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1764325100.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for real-world experiences with a specific service; no analysis or steps.",
    "composite_score": 2.8880284469075486
  },
  {
    "score": 41,
    "title": "Tips for working with Fiverr UGC creators?",
    "selftext": "I’m looking to validate a new product idea and figured UGC-style content might be the fastest way to test messaging. I’ve worked with UGC creators before, but never on Fiverr or similar platforms. I noticed Fiverr has quite a few people offering this service.\n\nSince I’m new to using Fiverr for UGC, I’m wondering if anyone has tips for working with creators there. What should I ask for up front, and what helps avoid endless back-and-forth?\n\nAlso, are there any other platforms you’d recommend for affordable and quick UGC content?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1758219254.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for tips on working with UGC creators; seeks practical guidance but not a listed framework.",
    "composite_score": 2.611809917757732
  },
  {
    "score": 41,
    "title": "Best virtual assistant for startups in 2025?",
    "selftext": "I’m trying to find a virtual assistant for startups that can genuinely help me focus on growth instead of drowning in tasks. Needs to manage admin work, organize projects, and maybe help with customer outreach.\n\nI’ve looked at a few options but there are so many and reviews feel mixed. Which ones are actually worth it? Any suggestions from people running small teams?\n\n**Update**: I’ve been using [Wing Assistant](https://redditpost.link/wing-assistant) and it’s been a game changer. My VA handles admin, project organization, and even some marketing tasks, which frees me up to focus on growth. The quality and reliability have been solid, and the team makes onboarding really easy.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1762758834.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A request for recommendations on a virtual assistant; anecdotal update included.",
    "composite_score": 3.2323433039010006
  },
  {
    "score": 38,
    "title": "Ever had to turn down a client because of location or compliance? How’d you handle it?",
    "selftext": "It’s not something we plan for, but if you’re working internationally, it’s almost inevitable. You get interest from a client, maybe even start early talks, and then realize you can’t move forward because of legal or compliance issues tied to their location.\n\nIt happened to me not long after I set up my US entity. I’d gone through the usual process with Adro banking, proper registration, address, SIM, and all that and realized that there were clear rules around who I could actually support. I wasn’t expecting to have to say no to a high value lead so that crushed me. Saying no was tough. I wanted to help, but I also knew I’d risk future compliance issues if I didn’t draw that line. So now I’ve built some early vetting into my process to avoid those situations where possible.\n\nAnyone else run into this? How do you turn someone down when it’s not about budget or fit but just legal boundaries? Would love to hear how others handle it.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1751564070.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question about handling compliance-related client refusals; practical but not a step-by-step.",
    "composite_score": 2.707640232218321
  },
  {
    "score": 38,
    "title": "How Can I Become Wealthy Before 25?",
    "selftext": "Hi everyone,\nI’m 19 years old and currently in school, about to graduate this year. I’m really curious about how to build wealth before turning 25. I’m not too concerned about the exact income—whether it’s 1,000 euros a month or 20,000 euros a month or even 500 euros. What really matters to me is learning how to become an entrepreneur and grow my own business.\nI’d love to hear your advice, experiences, and any tips on how to get started and succeed at a young age. Thanks a lot!\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1763803194.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Student asks for advice on wealth building at a young age; general guidance request.",
    "composite_score": 3.2057042500574395
  },
  {
    "score": 39,
    "title": "I built a $1M real estate portfolio in 4 years. Leveraged it to open a business. Now I’m struggling hard.",
    "selftext": "I’ve spent the last few years grinding — flipping homes, buying rentals, and reinvesting nearly everything. I worked day and night, sacrificed a lot socially, mentally, and financially to build up a $1 million real estate portfolio by the age of 24.\n\nThis year, I decided to take a big swing. I leveraged part of my portfolio to open a new business — something I was genuinely passionate about. But truthfully, it’s not doing well. The local market isn’t responding the way I expected. Foot traffic is slow. I don’t have another other means of cash to pass my bills. Some days I don’t know how I’ll keep the lights on.\n\nI’ve tried adjusting the model, marketing harder, staying positive… but lately it feels like I’m screaming into the void. I’ve even started looking for jobs just to survive, but so far — no luck. It’s humbling. And honestly, it’s heartbreaking. I wake up feeling like a failure most days. It’s gotten to the point where dark thoughts creep in — I’ve been seriously struggling mentally and emotionally.\n\nI’m also struggling to find a job anywhere I apply. I’ve applied to 22 jobs and nothing. \nI know I’m not the only one who’s been here. If anyone out there has advice — business, mindset, resources, anything — I’m listening. If you’ve come back from failure or dug yourself out of a hole like this, please share. I need help, and I’m not too proud to admit it.\n\nThanks for reading. Even just hearing from a few people who’ve been through the fire would mean a lot.\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1746392643.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Personal story of struggle and request for advice, dominated by emotional venting.",
    "composite_score": 3.143773988109431
  },
  {
    "score": 39,
    "title": "$200k to 20 Hour Weeks",
    "selftext": "Im a 31 y/o with $200k in cash savings hoping to leave the corporate world and do something more entrepreneurial and fulfilling. I have healthy retirement assets for my age and a rental property in a hot southeastern city netting around $1000 a month. I’ve kicked around the idea of buying a business or investing in commercial real estate but these are obviously I just don’t necessarily have a community to validate my ambitions and being in a finance role making good money with prospects for career growth have caused me to pursue the easier route of working hard at my day job. I know, though, as I look around at those that have been successful in a similar setting that the hours and stress will only continue to grow until retirement and would love to take the financial capacity I’ve built up to buy a better lifestyle (even if it’s 10 years down the road). \n\nHas anyone taken a few hundred thousand dollars and left the corporate world? What opportunities, investments, or ventures would you pursue if you were in my shoes?\n\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1735582687.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for advice on leaving corporate and opportunities; lacks a defined framework or list.",
    "composite_score": 3.177224908833346
  },
  {
    "score": 37,
    "title": "Three dead apps at $0, fourth app passed $4.5K MRR once I stopped coding first and started validating like a grown-up",
    "selftext": "My first three apps were beautiful, polished, and completely useless. Six months of coding each, pixel-perfect UI, clever features I was proud of zero paying users, zero revenue, zero traction. I never spoke to a single real user before building. I just trusted my \"product instincts\" and whatever seemed to be trending on Twitter and Product Hunt. Classic technical founder mistake repeated three times.\n\nThe turning point was studying real app founders who shared exactly how they got from 0 to 1,000 users with receipts: 20-30 customer interviews upfront before writing code, shipping ugly one-feature MVPs in 2-3 weeks not 6 months, multi-platform launches across 20+ directories not just App Store, and doing manual onboarding calls with the first 50 users to understand confusion points and actual needs.\n\nFor app #4, I forced myself to follow that exact pattern instead of jumping straight into code like always. Execution looked completely different: spoke with 32 people in my target niche (freelance marketers struggling with client reporting) about one specific pain point, killed two different ideas in week one before writing a single line of code because fewer than 10 people would commit to paying, finally validated a third idea where 14 people said they'd pay $19/month, then built just one core feature in 2.5 weeks using a React Native boilerplate instead of reinventing authentication and payments infrastructure for the fourth time.\n\nLaunch strategy was systematic not heroic: posted problem-first content in 5-6 relevant Reddit and Facebook communities before ever mentioning I had a solution, submitted to 20+ app directories and startup listing sites over 2 focused weeks, personally onboarded the first 40 users via 20-minute Zoom calls while furiously tweaking onboarding flow every few days based on where they got confused or dropped off.\n\nTimeline and numbers: month 1 had 19 paying users at $19/month ($361 MRR), month 3 reached $1.7K MRR after implementing annual pricing, month 8 hit $4.5K MRR with monthly churn under 4% because I'd built something people actually needed.\n\nThe app itself wasn't dramatically better than my failed ones. The difference was entirely the process: validate with real conversations, build the absolute smallest version that solves one problem, launch everywhere relevant systematically, and learn directly from the first paying users instead of guessing in isolation. All borrowed from founders in [FounderToolkit](http://foundertoolkit.org) who were generous enough to share their exact playbooks, metrics, and timeline breakdowns publicly.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1767108636.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Describes a repeatable validation process and steps; acts like a playbook.",
    "composite_score": 2.7397835966168103
  },
  {
    "score": 39,
    "title": "This is why your ads get spam leads - click fraud rates by ad network for December 2025",
    "selftext": "Hi all\n\nBelow are the click fraud rates by ad network for September - December 2025.\n\nNotes:\n\n* The amount of click fraud you'll get depends on a number of factors: the industry, location, language, campaign setup, and history of click fraud (especially fake conversions).\n\n* The data contains objective detection only (100% proven to be a bot). I have excluded \"suspicious\" traffic as that doesn't really tell us anything (maybe a bot, maybe a human), so you can consider the numbers to be the minimum amount of click fraud by ad network.\n\n* The reason search ads / platform ads get click fraud is due to a click fraud technique called \"retargeting click fraud\".\n\n* The reason display / audience network ads get lots of click fraud is because that's where the criminals earn money from this scam - they own the display / audience websites, so for every fake view / click they get paid by the ad network. \n\n* If you're new to all this, click fraud exists because it allows criminals to steal your ad budget. The flow of money is advertiser -&gt; ad network -&gt; criminal's website. At least $100B is stolen from advertisers every year due to click fraud, and the ad networks do very little to stop it since they rely on click fraud for their revenue targets.\n\n* The way to stop click fraud is to prevent the bots from generating fake conversions. That's because the ad networks send you traffic which looks like your converting traffic, so if you only allow human conversions, you'll be sent human traffic. How do you do this? Either use purchase conversions only, or offline conversions, or competent bot protection.\n\n* Two of the signs you have a click fraud problem are spam leads and excessive abandoned checkouts.\n\n* Marketing teams commonly choose to buy bot traffic as it helps them hit their KPIs - number of visitors, number of leads, and low cost per lead. *Regardless of quality*.\n\n* I work in the bot protection industry, have been a click fraud researcher for 12 years, and I'm currently doing a doctorate in this topic.\n\n----------\n\nClick fraud rates by ad network:\n\n* Google Search: 13%\n* Google Display: 27%\n* Meta (Facebook): 6%\n* Meta (Instagram): 38%\n* Meta (Audience): 67%\n* LinkedIn: 17%\n* LinkedIn Audience: 24%\n* Microsoft Search: 14%\n* Microsoft Audience: 24%\n* TikTok: 68%\n* TikTok Audience: 79%\n\nReddit Ads and X Ads consistently have 80%+ bot / immediate bounce traffic, so we consider them worthless.\n\nHappy to answer any questions.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1765692675.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.79,
    "category_rationale": "Provides factual guidance about click fraud and preventive measures.",
    "composite_score": 2.7746090113350905
  },
  {
    "score": 37,
    "title": "Don't follow your passion, Solve expensive problems instead",
    "selftext": "Solve expensive problems for people who can pay\n\nMy agency journey:\n- Started: Building websites because I loved coding\n- Reality check: Loving code ≠ loving client management\n- Pivot: Focused on what clients actually valued (speed, reliability, results)\n- Result: 3x revenue, happier clients, less stress\n\nPassion is great for hobbies.\nProblem-solving pays the bills.\n\nWhat expensive problem does your business solve?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1748966571.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Advocates solving expensive problems over chasing passion; presents central claim with reasoning.",
    "composite_score": 2.8468742196406227
  },
  {
    "score": 37,
    "title": "I hit $4000 MRR in three months with my web dev agency as a solo founder, and here is what I have learned.",
    "selftext": "Well, it's not much, but as a solo founder, it's everything for me.\n\nFour months ago, I left my full-time job to start my agency. I worked for a month to prepare, and then I officially launched my agency three months ago. It has been quite a journey. I want to share my experiences with fellow solo founders who are working hard. If my experience can help even one person, I would be very happy.\n\nSpoiler alert, it's not just hard, it's brutal. You’re wearing every hat from website to sales or marketing to demo, you name it. The mountain of tasks was overwhelming. I used to stare at my screen, juggling through a huge list, trying to figure out what to do. After some time, I realized it was not getting me anywhere. So I set one goal - get the first client. Instead of trying to do everything, I focused on what mattered most. If any task was not crucial for getting the first client, it was secondary. It helped me a lot to prioritize and get things done.\n\nYou’ll try a lot of things that won’t work. I failed a lot of things I tried, like launching ad campaigns, spending some money but no result, pitching to some clients without being fully prepared to onboard a new client, etc. I was frustrated, sad, and down. But I kept going. I dug deeper, found out what went wrong, researched solutions, and talked with other founders. Honestly, several times I thought about quitting and going back to my remote job but deep inside one thing kept me going is, I know I am damn good at what I do, I just have to crack it. I just have to keep going.\n\nYour network could be your best leads in the early days without spending a single penny. Throughout my 6+ years of Product Design career, I’ve built a network with founders, marketers, and other designers that eventually led to my first two clients. Your network is more valuable than you can imagine; leverage it.\n\nLinkedIn and Reddit can be incredibly valuable if used strategically. Instead of spamming people with pitches, I joined relevant subreddits and communities where my ICPs are active. I closely observed them, engaged in conversations, and gathered feedback.\n\nOn Reddit, I participated in discussions, providing valuable insights without making any pitches. For example, I once converted a client simply by sharing a helpful suggestion in a Reddit post. On LinkedIn, I consistently post high-quality content, share insights, and connect with my ICPs. So far, I have achieved over 60k+ combined reach and engagement, and I've generated several leads.\n\nI have heard this phrase a lot: \"It’s a marathon, not a sprint\". Now I understand what it actually means. It's going to be tough, and that's why every small victory is worth celebrating.\n\nFeel free to ask anything.\n\n*\\*If you have made it this far, thank you so much.*\n\n*\\*\\*English is not my first language, so I apologize for any errors.*",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1751808120.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares lessons learned from starting an agency with practical takeaways.",
    "composite_score": 2.9334949370279135
  },
  {
    "score": 35,
    "title": "The most badass way I grew my business without spending a penny on marketing.",
    "selftext": "I've been a [mentorship fellow of Value Posting](https://stan.store/valueposting/p/free-client-acquisition-strategy) *(no dms please)* for the past 3 years, and with this content strategy I was able to get my first paying customer ever in my life and I get appointments on autopilot with this method even today.\n\nFast forward to over 3 years and half of my revenue in my business comes from value posting.\n\nI recently joined back this community and I saw a ton of people struggling to get more customers, I'm no expert but I just wanted to help you guys out a little bit with what I learned in the mentorship.\n\nAnd the **best part**?\n\nI did not know what I was doing when I started doing this. I started from zero and they helped me get $18k MRR in under 100 days.\n\n**Intrigued?** \n\nWant me to spill out what I learned in the 1-1 mentorship?\n\nIt's very simple like the name suggests, It's called Value Posting .\n\nYou may be like, what does that even mean.\n\nIt basically means joining facebook groups in your industry and adding massive value inside with a small hidden promo CTA. (When you make a post, you are not just helping the community, you are helping every single group member that joins and searches the community for life)\n\n*(If a community has 20k members, at least 1000 people will see your value post, now imagine posting automated value content on 20 communities a day in your niche, you are eyeing yourself to 20,000 people in your industry everyday at minimum without spending a dime on marketing)*\n\nFirst thing you need to do is join 20 Facebook groups in your niche.\n\nIf you have a Shopify SaaS, you'll need join facebook groups that have people who sell products on shopify. **Eg. Shopify for Entrepreneurs**\n\nIf you are a pressure washer, you need to join local facebook communities in your area. **Eg. DFW Home Improvement**\n\nIf you are an online service provider, you'll need to join groups that have your ideal clientele. **Eg. Yoga for Beginners**\n\nYou get the point.\n\nYou'd be surprised how many facebook groups are out there in your exact industry where your potential customers are roaming around.\n\nOkay, you've joined 20 groups in your industry.\n\n**Now what?**\n\nI used to sort the group by hot posts and see what's trending. I then used to see what kind of content blows up on that specific group and use AI to rewrite/repurpose very similar content.\n\nRemember you only have to do once, because you are not posting on 1000 groups, you are only posting on top 20 groups that you cherry pick in your industry to build a trust authority flywheel.\n\nAnd since I was posting content that the specific community loved, my content would blow up every single time and with a little plug to my services, I was eyeing to every single member on the group for the next couple of days and for every single new member who joins and searches the group's search engine for life.\n\nThis was crazy, with engaging content and a sweet CTA plug that did not look spammy, I was getting leads, dms and appointments on autopilot, sometimes even 3/4 appointments in one day.\n\nOn top of that they also taught me to the mother-child value commenting strategy.\n\n**Here's how it works:**\n\nThe goal with value commenting is to add massive value to people who are asking for help with a optimized facebook profile for anyone present/or in the future to see your product/service and convert.\n\nI used to promise myself to not skip a single question and I used to answer by providing as much value as possible.\n\nThere used to be some questions that I had no idea about, for these, I used to google, double check on 2/3 sources to make sure I was not spreading misinformation but most of the questions that these people were asking were very simple and repetitive.\n\nAnd because people also used to see my value posts, a ton of people would dm me asking me more questions, and this is where the big money is made - when your potential client is communicating with you 1-1 begging for your help (like you're an expert) you can easily convert them as your clients no matter what product or service you sell.\n\n**Here's my 100 day stats (yes I tracked it)**\n\n|`Communities`|`Automated Value Posts Made (in 100 days)`|`Appointments (till date)`|`Clients Acquired`|`Monthly recurring revenue`|\n|:-|:-|:-|:-|:-|\n||\n||||||\n||||||\n||||||\n||||||\n|`Group 1`|`45`|`8`|`2`|`$1800`|\n|`Group 2`|`84`|`5`|`2`|`$1800`|\n|`Group 3`|`19`|`1`|`1`|`$900`|\n|`Group 4`|`4`|`0`|`0`|`0`|\n|`Group 5`|`216`|`17`|`6`|`$5400`|\n|`Group 6`|`49`|`4`|`3`|`$1800`|\n|`Group 7`|`71`|`2`|`0`|`0`|\n|`Group 8`|`80`|`9`|`0`|`0`|\n|`Group 9`|`13`|`5`|`0`|`0`|\n|`Group 10`|`44`|`2`|`0`|`0`|\n|`Group 11`|`76`|`6`|`1`|`$900`|\n|`Group 12`|`91`|`6`|`2`|`$1800`|\n|`Group 13`|`75`|`2`|`0`|`0`|\n|`Group 14`|`120`|`8`|`2`|`$1800`|\n|`Group 15`|`82`|`1`|`0`|`0`|\n|`Group 16`|`54`|`3`|`0`|`0`|\n|`Group 17`|`29`|`0`|`0`|`0`|\n|`Group 18`|`42`|`1`|`0`|`0`|\n|`Group 19`|`97`|`5`|`0`|`0`|\n|`Group 20`|`83`|`8`|`3`|`$2700`|\n|`Total comments`|`1374`|`DMs received: 93`|`Clients Acquired: 22`|`MRR: $18,900`|\n\nI made 1374 posts in around 10 weeks, got 93 dms, signed 22 clients and made $18,900 in monthly recurring revenue.\n\nAppointment/Client Acquisition Ratio: 23.65%\n\nSome may say this is high, some may say this is low.\n\nI personally think this is low for me, I average 35 to 40% conversion because these are warm leads, these people are pre-sold on your products/services with a indirect marketing plug.\n\n**The best part?**\n\nIt can be 100% automated today with Ai, posting schedulers, VAs and help from value mentors.\n\nPeople search in the search box inside communities, and when you are posting content that the community loves, your content will always be there for anyone who searches whether that be in 2 months or 2 years. I received a dm asking me for help and **they said they reached out to me seeing my 2 year old comment.** Are you kidding me?\n\n**Start value posting** from today and you'd be surprised how many value packed moderated communities are out there in your industry and when you are a known face to your potential clientele, your growth will be unstoppable.\n\nI still use this very same strategy but now I make my virtual assistants do all the mud work, but when I started I used to create value posts/write value comments 2/3 hours a day.\n\nIf you value post onsistently everyday, you will generate customers that you never thought your business could handle, I'm a live proof right here, I have a 7 figure business that got kicked off by value posting on small facebook communities.\n\nThat's pretty much it.\n\nI'll be happy to answer comments/feedbacks/criticisms.\n\nIf you want the list of 800 micro facebook groups to value/post and value comment, comment interested below and I'll pm you.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1746030787.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Promotes a specific growth strategy (value posting) and results; advice-based.",
    "composite_score": 2.8875014997167656
  },
  {
    "score": 34,
    "title": "Looking for like minded",
    "selftext": "I find myself getting into social media and entrepreneurship more and more each day. Talking about it at work, with friends social gatherings and I get looking at weird but encouraged. I am looking for people that are trying to get into creating businesses/content/products with a group of like minded individuals. I’m 28 and want to build a team or group of friends/partners/creators. Where we can collaborate and support each other and learn from each others success and failures. Dm me! 🙏",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1747707345.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Brief call for like-minded people; lacks substantial content.",
    "composite_score": 3.095098040014257
  },
  {
    "score": 31,
    "title": "After 20 Failed Startups in 12 Years, I Finally Have One That Is Making Money. I'm So Happy and Excited!",
    "selftext": "12 Years of hard work, struggle and pain\n\n20 Failed Startups 😭\n\n1 made money in 2017 but now dedz. It is a Help Desk software. I think it failed because the space is too competitive and I also don't know how to do marketing.\n\n1 is printing money continuously so far. I'm planning to switch it to a monthly subscription model for sustainability instead of a one-time payment model. It's a [tool](https://customerfinderbot.com/) I built to scratch my own itch in finding customers. The elevator pitch is \"Find Your Customers In Seconds with Social Media AI\". It's designed to save you time and help you focus on closing deals rather than hunting for leads. I'm also working on adding support for LinkedIn and Reddit soon.\n\nI built it in a few days using Ruby on Rails, PostgreSQL, Digital Ocean, OpenAI, Kamal, etc...\n\nLessons? 👇\n\n* Solve real problems (e.g, save them time and effort, make them more money). Focus on the pain points of your target customers. Solve 1 problem and do it really well.\n* Fail fast. Validate immediately to see if people will pay for it then move on if not. Don't over-engineer. It doesn't need to be scalable initially\n* Do marketing (build it and they will come rarely succeeds)\n* Keep on shipping 🚀 Many small bets instead of 1 big bet.\n\nI also started a newsletter where I will be sharing all the lessons I'm learning in building startups and programming - [Startups and Programming](https://startups-and-programming.beehiiv.com/subscribe)\n\nAny questions? I'll be happy to help by further sharing all the things I've learned.\n\nAlso, what do you think of the idea of the tool that I built?\n\nWhat would make this tool more valuable to you?\n\nHow could it better fit into your workflow?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1724372809.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.84,
    "category_rationale": "Contains bullet-point life lessons for startups.",
    "composite_score": 2.8812289939910154
  },
  {
    "score": 34,
    "title": "YOU ARE WHO YOU SURROUND YOURSELF WITH!!",
    "selftext": "I’m trying to find a group of entrepreneurs who are working hard to words achieving their goals and dreams( like me) or you can be an already winning entrepreneur. \n\nI want to form a group where we can meet daily on Zoom or other online platforms where we can video call or chat live and we can motivate each other, hold each other accountable and win together to better ourselves!\n\nWho’s keen to be part of such thing?\n\nOr if there’s something like that exists that you already Joined, may I ask to Join in yours!\n\nThank you 🤍\nAli",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1720090222.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Group recruitment post with no substantive content.",
    "composite_score": 3.110353132399244
  },
  {
    "score": 31,
    "title": "You've got 10+ employees. but work more than ever. ",
    "selftext": "I'm almost concerned. more than ever, I hear employees have \"quit quit-ed\" or \"no one wants to work\". And NO ONE knows why this is. I've spoken with multiple business owners that have yet to crack the code.\n\n***Prepare yourself because this will sting a little.***\n\nYour employees are not inspired. they're not incentivized. but they need to work to survive.  \nsounds like a recipe for \"doing the bare minimum possible\"\n\n**NOW THAT THE PAIN IS OUT OF THE WAY**  \n\"so what. I run a business, i'm not here for their emotions\"  \nI get it. you're also trying to survive. you also have your own agenda. and you wouldn't hire people if you didn't absolutely have to. surprise, surprise *No one likes dealing with other people's problems*.\n\nbusiness isn't easy, and you're right, you **SHOULDN'T** have to deal with other people's emotions. the unfortunate truth is that this is now part of your \"list of shitty tasks if I want to produce more\"  \n(as if we didn't have enough on that list to begin with.)\n\nI'm not saying it'll be easy, but here's what I've found that works.  \n*every business is different and keep in mind this is a broad fix. for me to cater EXACTLY to your business, I'd need to know more* ***ABOUT YOUR BUSINESS***\\*. take this with a grain of salt.\\*\n\n**THE SOLUTION**:\n\n* ***Inspire them***\n   * Tie what their job is to the over all mission of your business. if your business goal is to \"make more money\" great, but that's not what THEY care about. they want to know that their sacrifice and efforts goes to something that matters, not to someone else's bank account.\n   * what solution does your business solve, and who do you solve it for? this is exactly what you will try to tie every role back to. for example, I'm a leadership coach. my angle is that I want to improve the culture of businesses **BOTH** for the business owner **AND** the employees. so I tie all my employee roles to the fact *that we help people resolve one of the LARGEST impacting pains for most adults.* the pain being, that they hate their job/coworkers/employees/subordinates/supervisors, had a bad day at work, etc.\n* ***Provide clarity***\n   * give clear description of what they are expected to do, how to do it, who to speak with if they have questions, what tools they need, etc. **AND REMIND THEM REGULARLY**. If you think you've done this clear enough, I urge you to look at it again. Pretend you're telling a robot to make a PB&amp;J sandwich. if you said \"go in the fridge and get the jam\", where is the fridge, did you tell it turn around and locate it, is the jam on the door or a shelf, which shelf, did you tell it to close the fridge door, did you say to open the jar... do you get the idea?\n   * employees that don't know what they're supposed to do, stress out more and are less productive. they end up going into a \"stay out of sight and under the radar\" because they're afraid of being found out. this can be a cancer in your business because you're paying people that aren't doing the work. **THIS IS** ***NOT*** **FROM NOT WANTING TO DO THE JOB PROPERLY**. they are people too. give them everything they need to be successful. and remind them in case they forgot. regular 1-on-1s and open communication help with this significantly.\n* ***Hold Them Accountable***\n   * as the business owner, if you get more stressed about meeting deadlines than your employees do, then this is a key indicator that you're not holding them accountable. THEY should be stressed about the results of their work, not you. at least not as much. the goal is to **SHARE** the stress/desire to provide good results. not have it all bundled on you, the owner.\n   * **DO NOT** *only* use deterrents to fuel their fire. this will make results appear in spurts, not consistently. this can also lead to burnout. the goal is to give them a carrot to chase AS WELL AS a fire to run from. the more emphasis on the carrot, the better. Give them KPIs that you expect them to meet, and ideally how they would meet those KPIs. make sure these are CRYSTAL CLEAR. *we can talk about how to maintain quality of work, but that's outside the scope of this post.*\n* ***STRONGLY reinforce good behavior***\n   * if you scold a pet for getting on the sofa, they won't do it **in your presence**. if you REWARD them for not getting on the sofa, then they'll follow the rule in your absence. people are no different. find different ways to reward them for doing things the way you want them to be done. the more positive reinforcements the better. people like to feel good. it's easy to forget that. this piece is on **YOU** as the business owner to think of ways to reinforce **ALL GOOD BEHAVIOR** that you want to see. if you think that payment is enough, you're sorely mistaken... (i know, it's not fair)\n* ***The Walls Have Eyes***\n   * I couldn't think of a better bullet header, sue me. Your employees will **ALWAYS** put themself in the position of the person that you interact with. positive or negative. your behavior is **CLOSELY MONITORED** by your workforce. if you explode at negative news, they won't give it to you. if you fire people without reason, they'll grow contempt for you along with stress and fear for themselves. the goal here is to remain transparent with your team. remind them you're a person and you're not perfect in all ways. this doesn't mean that you can let loose all the time, this means that you won't show up perfect everyday, **BUT YOU MUST TRY TO**. this being said, **your team will fight with blood, sweat and tears if** they believe they're being lead by someone with their best interest in mind. They won't fear for their own well being if they **BELIEVE** that you will take care of them.\n   * talk with them. have the hard conversations. tell them what you know. be honest. treat them with respect. Try to do right by them as if you are leading your younger self. as if whatever happens to them happens to you too.\n\nFor the sake not making the post too long, I'll stop here, but there is a lot more that goes into a healthy business culture, as you may know.\n\nI'm open to your thoughts on this. I'm more than happy to have a conversation in private if you'd like.\n\nMy goal is to help business owners create better business culture, make more money, and gain more of their time and peace of mind **NOT** at the expense of others.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1715436936.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Provides a central idea about motivating employees with actionable pointers rather than a step-by-step guide.",
    "composite_score": 2.755664976151897
  },
  {
    "score": 32,
    "title": "Is this too little bonus to employees ?",
    "selftext": "Wondering how other entrepreneurs and business owners dish out employee bonuses end of year and how you factor that\n\nThis year we are projected to clear $2.6 MM net income . Our best year yet. Usually we clear anywhere from $500k on low end to $1.25 mm net \n\nWe have about 60ish employees (grew from 5-7 employees 8 years ago)\n\nNormally we give anywhere from $50-65k bonuses per year \n\nThis year my business partners wanted to cap it at $90k and I wanted to push higher for $120-140k since we had our best year but they didn’t see the value behind that. I’m always for giving back more to the employees but my partners disagree ( I understand their perspective in saving money). I mean end of day the employees are the ones that keep the ship sailing right ? Gotta take care of them while we can. Sometimes my biz partners say I’m too nice and we shouldn’t be so accommodating and “friendly” to the staff. And that business is just business and everyone is replaceable (except a few key people)\n\nWe don’t have any VC funding so we control all the financial decisions Inhouse \n\n",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1765532749.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Raises a budgeting/bonuses question with internal negotiation; lacks a clear model or step-by-step guidance.",
    "composite_score": 2.9160006138632966
  },
  {
    "score": 35,
    "title": "Drop your business, I’ll find you 5 potential customers (for free)",
    "selftext": "Hey everyone,\n\nI’d love to help some founders here connect with real potential customers.  \nDrop your startup link + a quick line about who your target customer is.\n\nWithin 24 hours, I’ll send you 5 people who are *already showing buying intent* for something like what you’re building.\n\nI’ll be using our tool [Reddboss.com](https://reddboss.com/?utm_source=reddit_entrepreneurs) , which tracks online conversations for signals that someone is in the market. But this is mostly an experiment to see if it’s genuinely useful for folks here.\n\nAll I need from you:\n\n* Your website\n* One sentence on who it’s for\n\nLimit to first 20 people since this takes some manual work on my end.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1764807550.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Offers a free service to deliver customers; not a list, steps, or model.",
    "composite_score": 3.146333132463137
  },
  {
    "score": 31,
    "title": "What made you finally hire help and how did you know it was time?",
    "selftext": "For the longest time I convinced myself I could just hustle harder instead of bringing someone on but eventually customer emails were going unanswered, fulfillment was behind and I was still trying to tweak product pages at midnight. It hit a point where not hiring help was actually slowing growth so I had to get help even though I hated the idea of it.\n\nWhat I'm trying to do is ease the transition is setting up a few controls on the backend things like organizing my finances better and issuing separate cards for contractors or ad managers, all through my business banking setup by Adro banking that lets me do that easily. Looking back I probably waited too long but I’m curious how others decided it was time or are you still going solo?\n\nWas it revenue based? A time audit? Or just hitting a wall and realizing something had to give?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1754042353.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Shares experience and asks for criteria; mainly a discussion prompt rather than a model or steps.",
    "composite_score": 2.676694971815878
  },
  {
    "score": 32,
    "title": "the stuff no one warns you about when building a company",
    "selftext": "Let's get real. Building a company isn't all \"hustle porn\" and TechCrunch headlines. After burning my fingers (okay, my whole hand) building in this crazy startup world, here's what nobody tells you:  \n  \n1. Your head will mess with you\n\n∙ Some days you feel unstoppable. Others? Like a total fraud  \n∙ Everyone looks like they know what they're doing. Spoiler: They don't  \n∙ You'll switch between \"we're gonna be huge\" and \"we're totally screwed\" 5 times before lunch  \n∙ Pro tip: Get a therapist before you think you need one\n\n2. Time is brutal\n\n∙ Those \"quick meetings\" and \"casual coffees\"? They're killing your company  \n∙ Stop saying yes to stuff just to be nice  \n∙ Your calendar is like your diet - garbage in, garbage out  \n∙ Every hour spent with time-wasters is an hour your competition spends building\n\n3. Real talk about people\n\n• News flash: Everyone's replaceable (yep, even you)  \n• Cheap hires are like cheap shoes - you'll pay for it later  \n• \"Culture fit\" isn't just startup buzzword bingo  \n• You know that person you're hesitating to fire? Do it yesterday\n\n4. The customer truth\n\n∙Your cheapest customers will give you the biggest headaches  \n∙ They'll argue about $10 and demand million-dollar service  \n∙ Bad customers are like bad relationships - expensive and exhausting  \n∙ When someone shows you they're a pain, believe them the first time\n\n5. Market stuff nobody admits\n\n∙That \"huge market\" you're targeting? Everyone else is too  \n∙Just because it's a billion-dollar market doesn't mean you'll see any of those billions  \n∙ Being too early feels exactly the same as being wrong  \n∙ Find the people who actually want to pay you (novel concept, right?)\n\n6. Money talk\n\n∙ If nobody's complaining about your prices, they're too low  \n∙ Revenue is like oxygen - you'll notice it most when you don't have it  \n∙ Profitable beats popular every time  \n∙ Your pricing strategy shouldn't be \"whatever makes everyone happy\"\n\n7. The team and advisors reality\n\n∙ Want equity? Cool. Show me your check first  \n∙ Trust takes forever to build and seconds to break  \n∙ Clear beats clever every time  \n∙ Alignment isn't about everyone being friends - it's about everyone being honest\n\n8. VC truth\n\n∙ Most VCs are just well-dressed ghosters  \n∙ \"Let's keep in touch\" = \"No\"  \n∙ They have their own game to play  \n∙ Your emergency isn't their emergency\n\nBottom Line? Stop trying to make everyone happy. Focus on building something real. Something that lasts.\n\n9. Quick hits that cost me:\n\n∙ Your gut feeling is usually right (but verify with data)  \n∙ Sleep isn't optional  \n∙ Numbers don't lie, but they do hide  \n∙ The best pitch deck can't save a broken business",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1750705581.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Enumerated list of seven realities of building a company.",
    "composite_score": 2.7856045629017
  },
  {
    "score": 34,
    "title": "Just saved a founder $10k and months of time",
    "selftext": "I'm starting to realize a pattern that founders I've worked with haven't really \"validated\" their ideas before starting to build them.    \n  \nWhen I ask how they validated the idea, there is always a pause.  Everyone says they have spoken to potential customers but when I dig deeper, there is usually something off.   \n  \nThe root of it is emotional/psychological and not due to a lack of knowledge or skills.  Most understand that talking to potential customers first is the best approach, but this is often skipped.\n\nWhen they have spoken to customers, they ask the wrong questions or talk to the wrong people, resulting in misleading results. \n\nThey are too tied to the idea emotionally, don't want anyone to \"steal\" the idea, or don't actually want to hear that it's a bad idea because they've already invested time/money.  \n\nIdeally, the validation should lead to customers eagerly waiting to use the product because it is actually solving a problem they have.  This also makes the marketing side much easier.  \n\nI'm considering offering a quick validation service where I do the research, conduct interviews, and give a report with a clear go/no-go based on what I learned.  Having a third party run the interviews removes the emotional attachment gives the potential customers more freedom to speak honestly.    \n  \nI'd love to hear your thoughts on this.   Would this be useful to anyone?    \nAnyone have a similar experience? ",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1736128818.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Argues for early customer validation and a potential service; centers on a mental model and rationale.",
    "composite_score": 3.042946960191063
  },
  {
    "score": 30,
    "title": "People are earning money off of many different types of apps, but what type of apps actually give users the opportunity to earn money on each app?",
    "selftext": "In my case, I have previously been the type of person who would never pay for an app or make an in-app purchase. Lately though, I have come across advertisements for several apps that focus on providing short-form video content and tips/learning content, essentially using video as a tool to further your skill set rather than spending time mindlessly scrolling through what everyone else is posting in their free time. One of the main examples that stood out to me was an app called Methods.аpp that focused on helping people create short-form video content for their own benefit.\n\nHowever, each time I see a prompt with \"payment required,\" I typically skip right by the prompt as I have passed by this prompt so many times it caused me to start to think about what types of apps I should actually be purchasing and going through the process of completing tasks on these apps that could have the potential to earn me money, either by completion of tasks, content creation, or skills enhancement.\n\nI assume dating applications are among the highest possible earning applications since most people are looking for a relationship. Am I wrong, or are there many other different types of categories of apps that people have earned an amount that would make it worthwhile to pay for them without falling into a trap of scams or being exposed to lies regarding payment opportunities?\n\nIf anyone reading this has had a real-life experience with using any of the various app types, including apps like Methods.аpp, please post a comment indicating what type/category your experiences fall within and if you believe your time spent on the app(s) was worth your time.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1765612279.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Long question about earning-app categories; lacks a central model or actionable steps.",
    "composite_score": 2.6329066873302445
  },
  {
    "score": 31,
    "title": "My Honest experience with shopping recently",
    "selftext": "LuxuryZion is one of the online stores I still find myself going back to whenever I need to shop for clothes. I wouldn’t even say they are trying to be anything special but they have been consistently reliable for me which is rare these days.  \n  \nWhat I like most is that everything just works out, payment is smooth, delivery comes on time and the items I have ordered have actually matched what I saw on the site. Nothing dramatic, just a simple store that does what it’s supposed to do.  \n  \nThey are not a huge brand or anything but they have been useful enough that I keep returning whenever I need something.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1763989710.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal shopping experience review; mainly opinion with little substantive guidance.",
    "composite_score": 2.8122099696478684
  },
  {
    "score": 32,
    "title": "Does perceived popularity affect engagement?",
    "selftext": "It’s curious how often engagement seems tied to perception rather than content. Pages with larger follower counts often attract more attention, even if their content quality is similar to smaller accounts. Services like[ socialboom.io](https://socialboom.io) allow creators to boost initial engagement, which brings up an interesting discussion: How much do social signals influence real behavior online?\n\nFrom a psychological perspective, users are more likely to engage with content that already appears popular. But at the same time, relying too much on perceived engagement can be misleading. Is it worth experimenting with ways to highlight activity, or does it risk creating a false sense of growth?\n\nMany creators struggle to gain traction initially, regardless of their content quality. Some try posting during peak hours, using trending topics, or collaborating with influencers. Others wonder if early engagement signals can help algorithms push content further. This balance between perception and genuine interest seems critical for sustainable growth.\n\nHow do you decide whether to prioritize perceived engagement versus organic traction? Have you noticed that active pages get more interaction simply because they look popular?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1763219583.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Discusses how perceived popularity affects engagement with analysis and actionable considerations.",
    "composite_score": 2.507074567237719
  },
  {
    "score": 33,
    "title": "Most SaaS founders are building a \"nice to have\" when they should be building a \"need to solve\"",
    "selftext": "I've been advising SaaS startups for the last few years, and there's a pattern I keep seeing that's almost comical at this point.\n\nFounder spends 6-12 months building product. Gets some initial users. Users say \"this is cool!\" Founder gets excited. Then... crickets. No one actually pays. Or if they do, they churn out after a month.\n\nThe founder is confused. \"But they said they liked it!\"\n\nHere's the brutal truth: people saying \"this is cool\" is the kiss of death for your SaaS.\n\nCool doesn't pay bills. Cool doesn't solve burning problems. Cool is what people say when they don't want to hurt your feelings.\n\nWhat you want to hear instead is: \"Holy shit, how much does this cost? I need this yesterday.\"\n\nThe difference between these responses comes down to whether you're building a \"nice to have\" or a \"need to solve.\"\n\nI just finished working with a founder who pivoted from a \"cool analytics dashboard\" (nice to have) to a \"fix the compliance problem that could get you fired\" tool (need to solve). Same tech. Different positioning. His demos now end with prospects asking how fast they can implement.\n\nAfter seeing this pattern repeat across dozens of startups, I created a simple diagnostic framework that helps founders identify whether they're building a \"nice to have\" or a \"need to solve\" - and how to pivot to the latter if needed.\n\nI use it with every SaaS founder I advise now. It's structured around identifying psychological purchase triggers and barriers in your sales funnel.\n\nI've turned it into a template that walks you through the whole process. If you want it, DM me your email and I'll send it over. No strings attached, just pay it forward by sharing your results.\n\nWhat \"nice to have\" vs \"need to solve\" battles have you experienced with your product?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1744178337.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Presents a diagnostic framework to distinguish 'nice to have' from 'need to solve' with a usable template.",
    "composite_score": 2.648054542234077
  },
  {
    "score": 31,
    "title": "Business owner is it worth going to business school ",
    "selftext": "I am a 21 year old guy who wants to start his own business, but doesn't know the business side of it. However, I am going back to school for business. When I tell people that I am going back to school for business, they tell me that I don't really need it or that I am just blowing money away when I can just get a business license and start from there, or I know  a few people who regret going to business school I find this really discouraging because I really don't know the business side of it. I already have the skill set which I know is important.",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1724604891.0,
    "media": null,
    "is_video": false,
    "num_comments": 133,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Personal inquiry about whether business school is worth it; lacks actionable steps or lists.",
    "composite_score": 3.24370237750231
  },
  {
    "score": 16,
    "title": "What’s the hardest part of building a business nobody talks about?",
    "selftext": "This has been on my mind all week. When you look at Twitter or LinkedIn, it's all about the **big wins: hitting a revenue milestone, closing a funding round, getting featured in some article.** It's awesome, don't get me wrong, but **it's such a tiny part of the picture.**  \n  \nThe truth is, 90% of my time is spent on things that are not glamorous at all. I'm talking about **chasing** **down invoices, dealing with unexpected server issues, or just sorting through legal jargon that makes my head spin.** It’s the constant little fires you have to put out every single day.  \n  \nYou feel like a professional problem-solver, not a visionary CEO. And honestly? It can be draining. It's the silent, repetitive work that really tests your commitment.  \n  \nDoes anyone else feel this way? What's one part of running your business that you find really tough but never see anyone talk about?",
    "subreddit": "Entrepreneurs",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 16,
    "downs": 0,
    "created_utc": 1756976091.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Central claim that the hard parts of entrepreneurship are mundane operational tasks, with examples illustrating the reality behind glamour.",
    "composite_score": 2.582508912706236
  }
]