[
  {
    "score": 1034,
    "title": "My whole family laughed at my \"failing\" business in a car ride home from dinner.",
    "selftext": "My sister was talking about money and brought up my \"failing\" business that l've been spending all my time and energy on these last 5 months with very minimal results.\n\nShe brought it up and my Mom, Dad, and her were laughing in my face.\n\nI put my fucking all into this business and I want it to succeed so fucking badly.\n\nWhen she brought that up without knowing how many hours l've put into it, it fucking crushed my soul.\n\nI blocked her number, went to my room and just got done crying for the past hour. I feel like such a fucking amateur right now. \n\nI can not wait to look back on this moment when I reach a point of success to prove that it isn't a \"failing\" business and show them I actually know wtf l'm doing.\n\n\nDoes anyone have a similar story l'd love to hear them.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1034,
    "downs": 0,
    "created_utc": 1709453122.0,
    "media": null,
    "is_video": false,
    "num_comments": 1002,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.250590816303146
  },
  {
    "score": 973,
    "title": "I'm shutting down my $400k/yr business... and it sucks.",
    "selftext": "Well, I guess I've gotten past the freak-out phase, past the panic, past the weekly (then bi-weekly, then almost daily) strategy/pivot meetings with my team, and past the difficult conversations with my wife. I'm over thinking I can \"knowledge\" my way out of it, leverage my way out of it, *get advice* my way out of it. I'm even past the hardest stage of them all - acceptance. ***I've accepted that my bread and butter over the last decade and a half is essentially on life support.***\n\nIn some ways, I was lucky. In 2013, I was early to the freelance platforms like Upwork (Elance), Fiverr, and PeoplePerHour. Shortly before joining these platforms, I started writing business plans and pitch decks for a few startups. This translated well to the freelance sites, and I quickly grew my reputation and became one of the top sellers on PeoplePerHour. I scaled that into a business (a startup consultancy), and success followed there too. My marketing background allowed me to implement an SEO strategy that actually worked.\n\nEvery day, I was answering new inquiries. My team was growing. I was creating systems and processes and training new hires on how to create high-quality assets for our startup founder clients.\n\nAnd I did this for over a decade. Every year, growth. Every year, a higher salary. Every year, more employees. Partnerships with incubators and accelerators. Clients were closing investor deals in the high six-figures and leaving us rave reviews.\n\nBut things change. New technology comes out. Trends shift. I was used to times where the economy would get better temporarily, and people would get comfortable in their jobs and focus less on their entrepreneurial ideas. In these years, maybe there'd be a bit of loss in revenue --- but nothing I couldn't recover from.\n\nHowever, I never expected that **AI** would change EVERYTHING the way it did. I saw AI coming, I adopted it, still use it to this day. But what I didn't see coming was – AI would pretty much eliminate the need for my entire business. No one needs a team of startup experts and consultants when you can type \"Write a business plan for X\" and fulfill your goal. I thought our quality would hold us over, but the value just no longer supported our pricing (and costs). I also didn't see that it would completely change how Google provides information, which in turn, would also kill my SEO traffic that I relied on.\n\nJust like that, my $400k/yr business turned into a $300k, then a $200k, then a $150k business - held on by the few incubator/accelerator clients who still stuck with us. Those daily inquiries went to zero, as did my hopes and dreams.\n\nNow... my business isn't a business. It's a well-crafted website that barely drives traffic and no longer drives leads. It's a reduced team that is just holding on to faith, while looking to me for the solution; knowing that eventually I'll have to pull the plug on the business and their livelihoods. It's all my ideas over the last decade, left to die. It's anxiety, depression, tough conversations, and doubt. It's.... failure.\n\nFailure in business... not failure in life. And more so, failure in THIS business, not failure in me as a founder. Because we're entrepreneurs, and the whole reason we exist is to solve shit. Find a problem. Solve it. This is the problem the universe has put before me, and no matter how painful it is, I will survive. I will make it through... and probably do it better.\n\nHow? Well, during all this period of doubt and stress, I also started building two MVPs for new startups I've been researching and planning. I'm not starting from Square 1 - I'm starting from Square 15, with all the knowledge, experience, and connections I've been fortunate to secure over the last decade. And I'll win again, because that's what I do, **that's what we do.**\n\nWhat is the lesson here? I have no idea. I literally just don't have other people in my life who will understand this, but I feel like someone here will. I'm venting, damnit.\n\nMaybe the lesson is, failure is never really failure. Sometimes you just have to turn the page to see the rest of the story.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 973,
    "downs": 0,
    "created_utc": 1757450027.0,
    "media": null,
    "is_video": false,
    "num_comments": 259,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.931045630864025
  },
  {
    "score": 403,
    "title": "A database of verified startup traffic",
    "selftext": "Fake MRR screenshots? We don’t do that here. 👋\n\nI built [**TrustTraffic.co**](http://TrustTraffic.co)**,** a simple tool that verifies your revenue automatically via Google Analytics.\n\nSteps:\n\n1.  Upload a read-only Google Property ID and add TrustTraffic's email to read-only property access management in Google Analytics\n2. Get a public profile with automatically verified traffic\n3. Receive a free dofollow backlink\n\nNobody can tamper with the numbers, all the revenue data is pulled directly by the server.\n\nPlus, there's a leaderboard of the startups with the highest traffic.\n\nIf you're building publicly, would love to see your verified numbers on the site! Currently the leader has 37,511 all time pageviews.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 403,
    "downs": 0,
    "created_utc": 1764035719.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8335026198302677
  },
  {
    "score": 395,
    "title": "150 million users. $0 in profit.",
    "selftext": "We’ve all heard of SoundCloud. They blew up almost overnight, going from around 10 million users to 150 million. Musicians were uploading nonstop, listeners couldn’t get enough, and everyone was talking about them. It looked like a dream scenario.\n\nBut when you look closer, the numbers tell a different story. Revenue barely moved, going from about $9 million to $12 million, while costs exploded from $19 million to $33 million. They nailed product-market fit, but they completely missed profit-market fit. Every new user made them bigger, not stronger.\n\nAnd that’s where so many startups mess up. Growth looks amazing on paper, but if your economics don’t work, all you’re doing is scaling your losses. \n\nI wrote about this on my Substack, MBA for Entrepreneurs, and broke down how founders can actually test if their growth is healthy before scaling too fast. It’s crazy how often companies celebrate “explosive growth” that’s secretly killing them.\n\nCurious what you think though. If you were running a startup and your users were exploding but profits weren’t, would you slow down and fix the model or keep scaling to grab market share?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 395,
    "downs": 0,
    "created_utc": 1762805362.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.193232587275926
  },
  {
    "score": 212,
    "title": "Stopped chasing \"passion\" and started a boring moving company and actually happy",
    "selftext": "This might be unpopular here, but I need to vent about something. For years I was that guy. You know the one - trying to build \"the next big thing,\" chasing passion projects, reading about disruption and innovation, pitching investors on half-baked SaaS ideas. Spent 3 years burning through savings on startups that went nowhere. Then I did something that felt like giving up: started a moving company. Unglamorous. Unsexy. Zero VC interest. Just trucks, boxes, and manual labor.\n\nAaand. It's been the best business decision I ever made.\n\nHere's what nobody tells you about \"boring\" businesses - they print money if you're even marginally competent. Why? Because your competition is usually terrible at the basics.\n\nWhen I started, I looked around at other moving companies in my area. These guys were running businesses like it's 1995. Awful websites, no SEO, competing purely on being the cheapest, zero customer follow-up. It was like shooting fish in a barrel.\n\nI did nothing revolutionary. Just ran it like an actual business. Got proper marketing set up - worked with a marketing team (in my case it was [mover marketing AI](https://www.movermarketing.ai)) just to rank in Google's Map Pack, implemented a real CRM, trained staff properly, had decent branding, followed up on quotes, charged what we're worth instead of racing to the bottom on price. That's it. No innovation. No disruption. Just competence.\n\nAfter 18 months I've got:  \n\\- Six figures annual revenue  \n\\- 22% profit margins  \n\\- Work maybe 25 hours/week now  \n\\- Sleeping great at night (no investor pressure, no burn rate anxiety)\n\nI learned that \"Follow your passion\" is terrible advice for most people. You know what I'm passionate about now? Financial freedom. Time with my family. Not stressing about runway or product-market fit. The moving business gave me that. My \"passion project\" SaaS ideas gave me anxiety and credit card debt.\n\nSure, I'm not going to be a unicorn founder. I'm not changing the world. But I'm making great money, have actual work-life balance, and own 100% of something profitable. That beats the hell out of chasing Silicon Valley fantasies.\n\nAnyone else ditch the \"sexy\" startup dream for something boring and profitable? Or am I just coping hard?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 212,
    "downs": 0,
    "created_utc": 1766596975.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.851411906951987
  },
  {
    "score": 207,
    "title": "From Being millionaire to depressed",
    "selftext": "Today I met a well-educated guy who spent 20 years in the IT industry, made several crores over his career, owned multiple real estate properties, had solid savings, and even a comfortable cushion in his PF account.\n\nAbout six months ago, he decided to quit his job to pursue entrepreneurship, chasing his long-time dream.\n\nHe was well-prepared… or at least, he thought so.\nHe had enough funds to cover basic necessities, his child’s school fees, and more. But life had other plans.\n\nAs soon as he left the job, things began to spiral.\nUnexpected expenses started piling up like medical, family, repairs, you name it.\n\nHe had to drain his bank accounts to stay afloat.\nTried withdrawing money from his PF, but ran into bureaucratic hurdles.\nTried selling some real estate, but the builder refused.\nEventually, he had to sell the very house they were living in.\nAnd just when he thought things couldn’t get worse, he started applying for jobs again but faced rejection after rejection.\n\nAll this took a serious toll on him. He spiraled into depression and began seeing a therapist.\n\nWhat struck me the most was this:\nIt wasn’t just the situation that broke him, it was his mindset.\nThe shock, the overthinking, the inability to accept that things won’t always go as planned, that’s what really hurt him.\n\nThis made me reflect deeply.\nIf you’re starting your own journey, dream big but prepare for the worst.\nLife doesn’t always follow your plan. Some things will go sideways, no matter how prepared you are.\n\nThis is a marathon, not a sprint.\nBe resilient.\nDon’t panic if things don’t go your way immediately.\nAnd most importantly, don’t let temporary setbacks define your self-worth.\n",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 207,
    "downs": 0,
    "created_utc": 1758223451.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8421695918504337
  },
  {
    "score": 161,
    "title": "A VC firm just offered us $100,000 for 10%. Should we take it?",
    "selftext": "We’re in the early days of the product. No revenue, not launched yet. My cofounder and I are both 25 and have been building this for about six months while testing with a small group of users.\n\nWe don’t really need money to run the product. The only reason we would raise is so we can go full-time and not worry about rent for a while. We’re not hiring, not running ads yet, nothing like that. So I’m honestly not sure what we’d even spend $100k on right now.\n\nPart of me thinks it’s too early to give up equity. Another part thinks that having a year of runway would be nice. This is my first time doing this, so I really don’t know what’s normal.\n\nHas anyone taken money this early? Good idea or dumb idea? And how do you even know if this VC is someone you actually want to work with? Not sure how they can contribute this early.\n\nEDIT: due to a large amount of DMs and request, the product can be found here [krona](https://mykrona.com).",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 161,
    "downs": 0,
    "created_utc": 1764885655.0,
    "media": null,
    "is_video": false,
    "num_comments": 366,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.181848046668676
  },
  {
    "score": 156,
    "title": "We raised our prices and got rid of sh*tty customers. Here’s why",
    "selftext": "When I launched my menswear brand with no experience, I thought that offering a better product at a lower price was the best strategy to hit the market with our product. Looking back it was a pretty terrible idea but I was naive and excited to launch.\n\nOur tees launched at $19, with free shipping over $50. The goal was to just out-value everyone else, scale through volume, and win on a solid style/product. For a while (about the first year in business) we saw traction early-on and our order volume grew at a pretty solid pace.\n\nBut the one thing I absolutely did not expect was that the lower our prices were, the worse our customer base would became.\n\nAfter about 12–18 months, we started noticing\n\n* High return rates\n* Frequent complaints about damage caused by the *customer* (e.g. bleaching, ripping)\n* People trying to scam us for refunds, free replacements, orders not arriving (with photo proof of delivery)\n* Emails demanding discounts or abusing our support team\n* Very little brand loyalty, just deal-hunters, and coupon clippers\n\nMy initial thoughts those first few months were that our products absolutely sucked. There were so many complaints despite the massive amounts of positive reviews and good feedback we received along with the negatives. I have pretty thick skin and I welcome all kinds of feedback, but some of these customer complaints and scammy tactics were brutal to deal with. I try to treat every customer we have like my best friend is buying from me.\n\nSo we were essentially attracting customers who only cared about getting a deal and not people who cared about quality, fit, or the brand itself.\n\nWe decided to try something different, which I was super hesitant to do at the time: raise prices. Not drastically but by about $3–4 every 4-6 months. Honestly, it was whenever we felt was the right time. We monitored repeat customers, customer support tickets, AOV and overall revenue. Over time we started noticing a difference.\n\nWe started seeing:\n\n* Fewer complaints\n* Higher repeat order rates\n* Lower return rate\n* More thoughtful feedback and genuine customer engagement\n* People caring about the brand and the product\n* More revenue, even at a slightly lower volume which eventually quickly surpassed our previous volume\n\nWe realized we weren’t just selling product but filtering for a type of customer.\n\nRaising prices wasn’t just about margin and more about signaling/positioning ourselves to what we stood for: quality, simplicity, and long-term value.\n\nIf you’re building something similar, I’d encourage you to look at what your price point invites in. Because in our case, low prices brought high headaches and slightly higher prices brought loyal, brand-aligned customers.\n\nHappy to answer anything about how we navigated that transition, tested pricing, or handled the fear of “turning people off.”",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 156,
    "downs": 0,
    "created_utc": 1752602478.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.61176357041803
  },
  {
    "score": 148,
    "title": "I’m so damn tired of being broke. I need advice",
    "selftext": "Basically what the caption says. I’m a broke college student, sick of working at the fucking grocery store for 30+ hours a week. I constantly watch entrepreneurship videos (Alex Hormozi, Grant Cordone, Iman Gadzhi etc.) and I’m constantly looking for these so called “high value skills” that they’re always talking about. I’m so fucking sick of this shit bro, words can’t explain. Basically the question is, what are these skills they’re always talking about? I’m trying so fucking hard to make this shit work. I refuse to live my life like everyone else from my hometown. Like a fucking loser. Open to any suggestions. ",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 148,
    "downs": 0,
    "created_utc": 1710471667.0,
    "media": null,
    "is_video": false,
    "num_comments": 501,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.228538126984784
  },
  {
    "score": 134,
    "title": "The 100 hoodies that drained my wallet and what I wish I knew about on demand printing",
    "selftext": "As a young entrepreneur, I started a clothing business a while back. The idea was simple: hoodies with motivational quotes printed on them. The kind of designs I thought would go viral on Instagram.\n\nWith all the confidence in the world, I went ahead and printed 100 of them. A hundred hoodies lined up like soldiers, ready to take over the fashion world… but instead, they drained my wallet dry.\n\nSlowly, those hoodies turned into a monument to my poor decision-making. Every time I opened the closet, they stared back at me without fail.\n\nMy business basically froze until I discovered an on demand printing plug, and with it,  I wouldn’t have to tie up all my money in inventory. I realized that I could have  just uploaded the designs, let customers place orders, and have each hoodie printed one by one.\n\nThe more I researched, the more I realized this is how a lot of small businesses actually run. They team up with designers, set up sleek online shops, and let printers handle each order. I even noticed suppliers on sites like Alibaba offering on demand printing services, exactly what I needed back when I was drowning in unsold stock.\n\nI’ve made peace with the experience, but every time I think about how easy it could’ve been, I can’t help but laugh at myself.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 134,
    "downs": 0,
    "created_utc": 1759112333.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5309850188786496
  },
  {
    "score": 123,
    "title": "I feel broken as startup founder",
    "selftext": "I started my \"serious\" entrepreneurship journey 7 years ago in 2018. \nI built 7 businesses. All of them failed except the last one which i saw an okayish success. But it left me broken, frustrated and burned out.\n\nI had a brutal co-founder breakup due to conflict then I started again with new co-founders but due to my self sabotage and burnout it lead nowhere and i exited the business at 3k mrr. \nI feel bad that all my startup friends are doing good in life. One got into YC, my co-founder has when i last checked 25k mrr business. While my other co-founder is also doing good with his new startup and here I'm. Still struggling without any solid business in hand.\nI have launched a new Saas based on AI agent but it's not getting the traction i hoped for. \nThe past 7 years my social and financial life took a toll. I never did a job so i didnt had extra money to do some fun stuff. Just good handmade food. I also dont have any gf. I thought i will get distracted. And honestly i didn't has spare time. My family relationship is good because i live with my parents but my social life sucks.\nStartup journey has been brutally hard with me and i feel just sorry for myself.\nI'm 26 btw.\nWhy me? Everyone is getting successful but I'm getting failure after failure despite doing entrepreneurship full time and it's been 7 years to it?\nI can't sleep at night as well. That's why I'm sharing this post here.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1741025176.0,
    "media": null,
    "is_video": false,
    "num_comments": 124,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8618766916662635
  },
  {
    "score": 84,
    "title": "First enterprise deal is asking for $2M E&amp;O - normal or overkill?",
    "selftext": "I have a small SaaS (10 people) and we just got our first shot with an enterprise client. Their contract requires $2M Errors &amp; Omissions or E&amp;O insurance (professional liability) coverage, which feels massive for our size.\n\nI really need some advice here as we don't want to lose this client over something like coverage. Should I push back and negotiate limits down, or just bite the bullet? If you've bought coverage, did you bundle it with cyber/general liability to save $$?\n\nAny traps in the policy wording to watch for (tech exclusions, retroactive dates, etc.)?\n\nTA!",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1759344004.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5245169657285493
  },
  {
    "score": 79,
    "title": "I dropped out of university to start my business and here’s what I learned",
    "selftext": "I was sitting in a lecture hall a few years ago, realizing I was learning how to pass exams, not how to build a life. I couldn’t ignore it anymore I didn’t want to wait for a degree to maybe land me a job I didn’t even want.\n\nSo I left. No backup plan, no safety net. Just me, a laptop, and the decision that I’d rather fail on my own terms than succeed on someone else’s path.\n\nIt wasn’t glamorous. I burned through savings, made mistakes, and went through months where I questioned if I’d thrown my future away. Friends were graduating while I was drowning in self-doubt.\n\nBut at 25, looking back, it was the best decision I’ve ever made. I’ve learned more about sales, risk, leadership, and resilience in business than I ever could have in a classroom. And most importantly, I’ve learned that freedom comes with responsibility and every win and every loss is on me.\n\nI’m curious has anyone else here taken the leap away from the “safe” path to bet on themselves? And if you’re still on the fence, what’s holding you back?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1756468683.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5295466653133714
  },
  {
    "score": 79,
    "title": "l think one of the easiest ways to make money is to find a spot where the “big guys” are basically ignoring their own customers.",
    "selftext": "Like, here’s a perfect example:\n\nCall of Duty used to OWN the FPS world because people loved the grounded, realistic war vibe. That’s what the fanbase showed up for. Then out of nowhere they started trying to copy whatever was trendin goofy skins, Nicky Minaj, or whoever they added, stuff that didn’t even feel like a war game anymore.\n\nThe hardcore fans complained nonstop, but COD didn’t care because, who else was gonna challenge them?\n\nAnd then Battlefield showed up and literally gave people EXACTLY what they’d been begging for: big maps (debatable), vehicles, destruction, teamwork, and more realism. Battlefield didn’t beat COD by being better, they beat them by giving fans the thing COD stopped giving them.\n\nThis happens in every industry.\n\nYou don’t have to be a huge company to pull this off. Just look for products that sell well in your niche but have crappy competition, or where the reviews are all complaining about the same thing. Make your own version, fix the obvious issues, add one or two cool features, and people will pick yours every time.\n\nWay easier with software, obviously. But even with physical products (Before you come for me, I know it's not cheap, I know we make them for a living), but if you see a real gap, it’s usually worth the shot.\n\nHope this inspires an idea. It might sound obvious, but l'm sure someone needed to hear this.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1764970965.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3230766609773523
  },
  {
    "score": 60,
    "title": "Anyone else struggle with deciding when to outsource tiny tasks?",
    "selftext": "I’ve been juggling a bunch of micro-tasks for my small online shop, and they’re starting to eat up more time than the “big work.” Stuff like formatting spreadsheets or cleaning up product photos. I tried grabbing a quick gig on Fiverr for one of the more tedious things, and it actually saved me a whole afternoon. But part of me wonders if I should just keep everything in-house to maintain consistency.\nQuestion: How do you decide which tasks are worth outsourcing vs handling yourself?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1764336676.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1747066354871816
  },
  {
    "score": 58,
    "title": "Bad recession incoming - is now the time to start a business?",
    "selftext": "My husband and I are strongly consideribg starting a business within the next year and are putting things into motion now to get it started. However we see that with the way the economy has been going and the recent administration's actions, a bad recession is likely incoming. In order to start the business we'll have to take out an SBA loan and use our house as collateral, which is a scary thing to do in a time of political and economic instability. On the upside, the kind of business we are starting tends to do very well during recessions, and there is a definite market for it where we live. Do we start the business or wait and see how things shake out? ",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1740318809.0,
    "media": null,
    "is_video": false,
    "num_comments": 159,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5329120029701064
  },
  {
    "score": 56,
    "title": "Do gas station owners make a lot of money?",
    "selftext": "I was wondering if gas station owners made any good money? \n\nMy sister was telling me today that a family we know makes like 40k a month in cash flow off a 2 or 3 convenience stores. I wouldn’t have expected that because they didn’t appear very wealthy at all. \n\nI grew up around a number of Indian families who own gas stations and I’ve never seen any signs that they make a lot of money. Maybe they’re frugal and hiding it?  \n\nThere is one family I know that leases gas stations and they make good money. \n\nIdk. I am positive there are gas station owners out there who make bank, but I don’t know any personally. \n\n",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1760636259.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3538008614935637
  },
  {
    "score": 58,
    "title": "I will build an app every 30 days until one makes money.",
    "selftext": "Recently, I took on a challenge to build a native iOS app in 30 days. That means designing, building, testing, and launching within that time frame.\n\nComing from a background in cross-platform app development, I found it difficult to build native, there were a lot of challenges along the way. But I’m still here, and the app is almost done.\n\nToday, a thought crossed my mind: “What if you do this every month???”\n\nThat idea really fired me up, and I think I’m going to do it: build and launch a new app every month until one or more of them takes off. At the end of the day, we all want to make money, and with AI, we can execute faster than ever.\n\nSo that’s my plan: build, launch, and talk about a new app every month until it works.\n\nMaybe to some people this sounds crazy, but I truly believe it’s going to work.\n\nI’ll be back with regular updates.\n\nAll the best to everyone!",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1757406186.0,
    "media": null,
    "is_video": false,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4917738056145304
  },
  {
    "score": 57,
    "title": "Do you think entrepreneurs are born with the mindset, or can anyone learn it?",
    "selftext": "I’ve been thinking about this a lot lately. Some people seem to have this natural drive, they take risks easily, spot opportunities where others don’t, and push through failure without flinching. It almost feels like they were “wired” for entrepreneurship from the start.\n\nBut at the same time, I’ve seen people who weren’t naturally bold or business-minded learn the skills over time (reading, practicing, failing, and slowly building up that resilience)\n\nSo it got me curious:\n\nDo you think the entrepreneurial mindset is something you’re born with? Or can anyone train themselves into it with enough experience?\n\nI Would love to hear from people who’ve been on both sides of this, especially if you felt like you weren’t born with it but grew into it.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1755891424.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.434173356149178
  },
  {
    "score": 53,
    "title": "How to believe in myself as an Entrepreneur when no ones else does? ",
    "selftext": "I've been working on starting a business for several months. Currently, not making money yet but I'm getting my name out there &amp; I'm seeing &amp; hearing promising things. \n\nI truly think I can do this. I have plans, I have budgets, &amp; I'm adapting when things don't go to plan. I'm always revisiting my plans &amp; budgets to make improvements. I've got everything under control. \n\nBut I've just learned, no one else believes in me. \nThey all think I'm wasting my time, wasting my money &amp; that hurt. I find myself suddenly questioning myself when I wasn't before. \n\nMy gut is telling me this will work. I've never had such a strong belief in myself ever before. But this business I'm building. I truly think it will work out. It just needs a bit more time.  Based on the growth I've already seen, I think I can start making an income before the year is over. \n\nBut my motivation &amp; drive has taken a hit with this new found information. I've never not had someone to support me. Now I'm alone in this &amp; am struggling a little. ",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1713464858.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3960600080386025
  },
  {
    "score": 49,
    "title": "Am I the only one who thinks \"Hustle Culture\" is just unemployment with a faster refresh rate?",
    "selftext": "Am I the only one who thinks \"building a personal brand\" is just narcissistic procrastination with a better landing page?​\n\nAfter 20 years in this industry, I’ve realized 90% of this sub is people asking how to scale a business that has $0 in revenue. You’re worried about LLC structures, logo design, and which \"guru\" course to buy, but you haven't sold a single unit of anything to a human being who isn't your mother.​\n\nI see threads daily about how \"hustle culture\" is toxic. Fair point. But the alternative isn't posting philosophical essays on Reddit about \"burnout\" from a business that doesn't exist yet. The alternative is building a boring service, charging money for it, and ignoring the noise.​\n\nStop optimizing your morning routine. Stop asking for feedback on your \"stealth startup\" that is just a ChatGPT wrapper. Go find a customer who is willing to open their wallet. If you can't do that, you don't have a business; you have an expensive hobby that requires a lot of coffee.​\n\n**Does anyone here actually have a P&amp;L statement, or are we all just farming engagement for a newsletter nobody reads?**",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1766481824.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1472094628571465
  },
  {
    "score": 43,
    "title": "Please tell me I’m not the only one drowning in startup ideas...",
    "selftext": "**Ever get halfway into building something and start questioning everything? 😅**\n\nI’m one of those people who always has too many startup ideas floating around, and I can never decide which one to focus on. \n\nTwo months ago, I started working on a small project that helps me organize and analyze those ideas ... basically a way to compare them and see which one’s worth pursuing. It started off exciting, but now I’m questioning everything. \n\nI keep jumping between wanting to go deeper into it or just pivot completely. \n\nHas anyone else gone through this kind of “what am I even doing?” phase as a founder? Would love to hear how you handled it.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1761670009.0,
    "media": null,
    "is_video": false,
    "num_comments": 70,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.304081850845725
  },
  {
    "score": 41,
    "title": "How did you get out of your head about starting a business?",
    "selftext": "I am the type of person who has always dreamed of starting a business and being an entrepreneur but I feel too scared and ill-prepared to start as I haven't had any formal training in business and entrepreneurship. But deep down, I feel this intuition that if I let go of these fears, it is something that I can become really good at and something that will fit my lifestyle. Hence, the question above: How did you get out of your head about going forward with your first idea and how did you battle the fears that came with it? ",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1746550875.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.203347330412157
  },
  {
    "score": 37,
    "title": "€100k by end of the year – I seriously need help",
    "selftext": "Hey everyone,\nI’m 20, studying engineering, and I’m in a situation where I need to make €100k by the end of the year—this isn’t just a goal, it’s a necessity. I’m not exaggerating when I say this feels like a life-or-death situation for me.\n\nI’m willing to outwork anyone, learn fast, and do whatever it takes (legally and ethically). I just need direction. I know there are people here who’ve been in tight spots and made it out—please, if you have any advice, I’d be incredibly grateful. I don’t have time to waste, and I’m ready to go all in.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1743011875.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1398326166239388
  },
  {
    "score": 42,
    "title": "After 10+ Years in Corporate, Have You Ever Thought About Using Your Network to Build Something of Your Own?",
    "selftext": "If you’ve spent a decade (or more) in the corporate world, chances are you’ve built a strong professional network of colleagues, clients, vendors, industry contacts.\n\nBut here’s the question:\n\nHave you ever thought about using that network to start something of your own?\n\nI’m not talking about quitting overnight to build the next unicorn.\n\nIt could be consulting, freelancing, a side business, or even a franchise anything that lets you leverage the relationships and reputation you’ve built over the years.\n\nIf yes ,what’s stopping you from taking that step?\n\nIs it the risk, financial stability, family responsibilities, or just not knowing where to start?\n\nCurious to hear from people who’ve thought about it or even tried it.\n\nWhat’s your biggest blocker? ",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1754905015.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.18269479382268
  },
  {
    "score": 38,
    "title": "How to balance FT job against promoting SE?",
    "selftext": "Hey all\n\nI'm a full-time worker, but I also run a side hustle online business which has been growing slowly but steadily over the past couple of years. My dream is to do it full-time, however income stream is too erratic atm, so am reliant on my 9-5.\n\nProblem is, this is artificially holding me back, as I cannot be too obvious about promoting the SE work (e.g. on LinkedIn, with a website etc) as this would alert my main employer that I'm working elsewhere on the side (they would not be keen on this, and also there is some overlap, so would cause issues. It would also mark me out as 'not 100% committed to the company', so I'd be the first to be let go in a reshuffle).\n\nIt's all a bit of a catch-22. How have other people navigated this?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1764004687.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8656552300503115
  },
  {
    "score": 38,
    "title": "Can you really build a dev team around vibecoding and freelancers (Fiverr, etc.)  ?",
    "selftext": "\n\n\n\n Dev teams are expensive. It got me thinking  in a world of vibe coding,” maybe the model doesn’t have to be a full in-house team. What if the core work is done by someone like me using AI and no-code,or even base44 and then freelancers come in just to polish and finish the tricky parts?\n\n\n\nThat’s basically what happened to me with one prosuct: I needed a custom internal tool to connect our CRM to WhatsApp support. I started building it myself (thanks GPT), but hit a wall. Instead of hiring engineers, I outsourced the last stretch  kind of a “built part of the project, then hand it to  Fiverr/ freelancer to finish it” move.\n\n\n\nIt was clean, fast, and I didn’t need to pull in engineering resources. Honestly, it might have been the most efficient product we shipped last quarter.\n\n\n\nCurious if anyone here has actually tried building around freelancers like this. Do you think this could scale, or is it just a hack for small ops?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1758650571.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9262890677156363
  },
  {
    "score": 39,
    "title": "SBA approved my loan",
    "selftext": "I’ve wanted to own a business my whole life. Finally had enough money saved up to do it. Have been under contract for 60 days and just got my approval and boy was it a lot of work. \n\nClose end of May. \n\nPurchase price 1.2 million \nRevenue of 760k average last 3 years\nEBTA 360k\n\nLoan payments of 190k between SBA and seller note. Leaving me $170k a year. And I have plans to expand right after closing. \n\nFamily entertainment centers. Two locations. \n\nAny questions or advice I would love to hear as this is my first business. 😁",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1714493740.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0179239093367585
  },
  {
    "score": 35,
    "title": "Is Entrepreneurship More About Freedom or Responsibility? 🤔",
    "selftext": "I hear this a lot, “I want to be an entrepreneur so I can have freedom!”\n\nAnd as someone who spends most of my days helping people launch and grow franchises, I can say… yes, freedom is real. But so is the responsibility that comes with it. 😅\n\nEntrepreneurship feels like having the keys to your own life, but also being the one who has to drive, refill the tank, fix the tire, and sometimes push the whole car when it won’t start.\n\nFor me, it’s both.\n\nFreedom gives you the dream.\n\nResponsibility shapes reality.\n\nAnd the mix of both is what makes the journey worth it. 💛\n\nFor you, what does entrepreneurship lean more toward:\n\nFreedom? Responsibility? Or a chaotic-but-beautiful blend of both?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1765350102.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.259938117287071
  },
  {
    "score": 34,
    "title": "What are you building? If I like it, I might become your lifetime user",
    "selftext": "I love building products and being around builders. This week I want to try more products which can increase my productivity and help me create new ideas to enhance my current workflows.   \n  \nSo share what you're building and I'd love to try the ones I find interesting. \n\nMy other selfish interest is I want to get in touch with smart builders to collaborate together. Because we grow together when we build together. ",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1753086288.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.216617064357404
  },
  {
    "score": 34,
    "title": "Does anyone else feel frustrated for wanting to be successful anymore?",
    "selftext": "I'm 18 years old and lately I've been feeling really fucking frustrated because I want to do everything NOW. I want to learn everything in one day, I want to read 10 books at the same time, I want to start businesses, I want to move fast, but at the same time I feel like I'm falling behind.\n\nSometimes I get so involved in this process of wanting to improve that I end up stressed and doing nothing. As if no matter how much you read or learn, it was never enough. I see people who at 20 are already breaking it and it gives me the feeling that I'm late. But then I ask myself: do I really have to go at full speed or am I just putting pressure on myself like an idiot?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1738944663.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0047192947339196
  },
  {
    "score": 32,
    "title": "Which industries are most at risk right now?",
    "selftext": "I’ve seen how quickly markets can shift. Right now, the industries most at risk are the ones tied heavily to discretionary spending, things people can easily cut when times get tough. That includes luxury retail, high-end restaurants, boutique fitness studios, and certain niche personal services.\n\nOn the other hand, essential and service-based industries like home maintenance, cleaning, affordable food, and senior care continue to stay strong. People still need these services no matter what’s happening in the economy.\n\nIf you’re planning to start a business or buy a franchise, focus on something recession-resilient. A model that solves everyday problems or offers consistent demand.\n\nWhat industries do you think are feeling the most pressure right now?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1762757011.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0051201967655596
  },
  {
    "score": 32,
    "title": "Most founders don’t have a motivation problem. They have a clarity problem.",
    "selftext": "Talk to enough founders and you notice a pattern: very few are “lazy,” but many are exhausted and unsure why nothing is moving. The real drain isn’t the hours; it is ending the week with 40 tasks completed and no meaningful change in revenue, users, or insight. Shipping UI tweaks, rewriting copy, changing tools, posting on every platform each thing feels productive in isolation, but collectively they don’t form a coherent path.\n\nThe real unlock is treating clarity as your main job, not a nice-to-have. Start by defining a single stage goal for the next 4-8 weeks, something uncomfortably specific like “Get 10 paying customers” or “Run 15 real customer interviews.” That goal becomes the filter. Any task that doesn’t directly support it gets downgraded, postponed, or deleted.\n\nThen, each week, list only three “needle-mover” actions that clearly connect to that stage goal: outreach, interviews, experiments, offers, follow-ups. Everything else is background work, not the main story. This sounds simplistic, but it forces a painful and useful question: “Is this task truly tied to my current stage, or am I just doing it to feel busy?”\n\nWhere structured frameworks and other [founders’ journeys](http://foundertoolkit.org) help is in defining those stage goals and needle-movers. When you see what real founders prioritised at idea, validation, launch, and early MRR, your own priorities stop being guesses and start looking like informed bets. It’s much easier to say no to shiny distractions when you have concrete examples of what worked for others at the same stage you are in.\n\nYou probably don’t need more hustle; you need a sharper definition of “progress” and the courage to ignore everything that doesn’t serve it, at least for this chapter of the journey.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1765545853.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7592102824570004
  },
  {
    "score": 29,
    "title": "My small snack business went viral overnight; 850k YT views. Here’s what happened/how I'm managing.",
    "selftext": "Background: I run a small international snack brand called Pop Snax, which I started 2 years ago. Initial operations were out of my apartment where snacks took up every inch of space, lol. I've grown steadily over the last year, and I'm now working out of a co-warehouse space.\n\nAnyway, last Sunday, something wild happened. A huge influencer (Joe Bartolozzi) who randomly ordered one of my mystery snack boxes in August, unboxed it on stream. Had no idea who he was so I had no idea he was even placing an order. Within hours, my website traffic exploded. Shopify was dinging nonstop.. I got over 300 orders in two days. I was super confused at first and asked a customer how they found me, and that's when I found out about the influencer unboxing.\n\nI cried almost constantly for the first 2 days bc this was one of those surreal “this is actually happening” moments, and I had no idea what I'd done to deserve this. Since last Sunday, orders have been heavy and consistent and the video featuring my box has hit 850k views!\n\nWhile running the business, I also work a full-time job, so, I've been running on fumes trying to keep up with customer emails, packing, and fulfilling, often late into the night. It's been exciting, but also kind of chaotic.\n\nAnyway, this viral moment has given me my first real taste of HEAVY demand at scale, but its also exposed how under-resourced I am as a solopreneur. I don’t have a team yet, or fulfillment support, and I’m still figuring out how to maintain that momentum after the viral wave calms down.\n\nEven with the boost, I know growth won't be linear. There’s still the day-to-day grind I'm trying to figure out, i.e. running ads, improving packaging, managing costs, dealing with platform issues (looking at you, Amazon 😅), and trying to make every customer happy. I'm trying to get deep into AI, so I can offload some of that pressure/manual oversight.\n\nFeel free to ask me anything! And if anyone else here has gone viral with a product or business, how did you handle the surge? Did you manage to sustain it afterward?",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1762096878.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8272268755754655
  },
  {
    "score": 32,
    "title": "Looking for a partner!",
    "selftext": "Hi everyone,\n\nI’m looking for a motivated partner to brainstorm, start, and work hard on something real together.\n\nI’m innovative, flexible, and goal-oriented, and I’m excited to explore ideas for a new business. I have ideas in tech, but I’m also interested in product launches. I also love “boring” businesses like car washes.\n\nI don’t have a fully formed concept yet, but I’m open to collaborating and building something from scratch.\n\nI am based in the Netherlands.\n\nIn case you’re wondering why I’m searching on Reddit: all my surroundings are artists and doctors.",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1758280283.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1341039268698307
  },
  {
    "score": 29,
    "title": "most useful college degree for an entrepreneur?",
    "selftext": "my life goal is to be an entrepreneur. i've already started a few businesses, and ive decided thats what i want to do with my life. my parents are forcing me to go down the college route despite these goals of mine. so if im going to spend 4 years studying in college, id like to at least pick something that will be useful. so the question I pose is what degree should i choose in college that will be most useful for starting a business, and will also provide me with a high paying/stable job that I can use to fund my side business early on? currently thinking about finance or accounting, but im open to what you guys think",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1754256949.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.034719294733919
  },
  {
    "score": 31,
    "title": "Feedback from investors on how to get financing (post with their original threads)",
    "selftext": "Recently I've researched VCs that are actively investing right now (and shared the list of these VCs here - [https://www.reddit.com/r/Entrepreneurship/comments/10ws7yg/how\\_we\\_collected\\_152\\_active\\_vcs\\_tips\\_from\\_an/](https://www.reddit.com/r/Entrepreneurship/comments/10ws7yg/how_we_collected_152_active_vcs_tips_from_an/?utm_source=share&amp;utm_medium=web2x&amp;context=3)). \n\nAnd as I worked on the base, I heard many startup owners struggle with the issues of getting financing for their businesses. \n\nSo, I decided to take a step further, and besides the list of actively investing VCs, I've also collected priceless gems of investors' recommendations on how to get financing. This will be a post with Twitter threads you can save.\n\n**Twitter threads from prominent investors who advise on financing for startup founders** \n\n1. Beata Klein of Creandum\n\nBeata Klein, an associate at Swedish VC firm Creandum, once made a thread with 10 of her favorite Twitter advice threads for all the startup entrepreneurs who’ve decided to try the troubled VC waters. This thread is amazing. One of my top recs.\n\nShe collected tips from Gagan Biyani (Udemy co-founder), Joe Flaherty (Founder Collective VC fund), Yohei Nakajima (Untapped Capital), and many others:\n\n[https:\\/\\/twitter.com\\/axeliaklein\\/status\\/1348895418755784705?s=20](https://preview.redd.it/7m8oy5fsviia1.png?width=1174&amp;format=png&amp;auto=webp&amp;s=da1ec2b5061d6d1e2d36d92ab61964c0e1e2c6c4)\n\n2. Maximilian Fleitmann of VizardVentures\n\nMaximilian Fleitmann of VizardVentures shares valuable information on startup fundraising resources — metrics, financial models, pitch deck templates, and information pieces one shouldn’t neglect when pitching VC funds. \n\n[ https:\\/\\/twitter.com\\/maxfleit\\/status\\/1419553661433298947](https://preview.redd.it/gshn7db2wiia1.png?width=1174&amp;format=png&amp;auto=webp&amp;s=1235dd6e4e71c03f946229c558d9030d3b4b0f02)\n\n3. Harlem Capital\n\nHarlem Capital venture fund has neatly arranged all the previously shared threads into one full-scale compendium of knowledge that will certainly come in handy for startup owners. \n\n[https:\\/\\/twitter.com\\/HarlemCapital\\/status\\/1491433030518738950](https://preview.redd.it/j4bi814gwiia1.png?width=1168&amp;format=png&amp;auto=webp&amp;s=a3d74d37b685f4e00df6db5cdd77e4420aaaeb50)\n\n4. Alex Macdonald of Velocity Black\n\nAlex Macdonald, a Velocity Black founder who became the angel investor for 30+ startups, has composed a thread about seed raising for startup owners. Here, you’ll learn about proper scheduling, space&amp;stage filter mechanisms, the first VC search engine, and many more. \n\n[https:\\/\\/twitter.com\\/alexfmac\\/status\\/1521179318533214214](https://preview.redd.it/awkss56jwiia1.png?width=1192&amp;format=png&amp;auto=webp&amp;s=f7383fd1019ab62b89721e483e7c7a5ed6d79951)\n\n5. Matt Shumer of OtherSide AI assistant\n\nMatt Shumer, the co-founder of OtherSide AI assistant, created a thread of video lectures by the most renowned angel investors — Geoff Ralston (Y Combinator), Andrew Lee (Clubhouse, Initialized), Elizabeth Yin (Hustle Fund VC), Sam Altman (Open AI), and more.  With such a background, finding the money for your startup will be easier.\n\n[ https:\\/\\/twitter.com\\/mattshumer\\_\\/status\\/1415775783344214017](https://preview.redd.it/0ypvf1jrwiia1.png?width=1180&amp;format=png&amp;auto=webp&amp;s=d857451baba7ab2bee0b1d1aac92f9d26aa7d7c9)\n\n6. Luke Mostert of Future Africa\n\nLuke Mostert, the Head of Investments at Future Africa and founder of Young African Catalysts, made the insightful thread about African startups he had to review in the past few years. What makes a startup VC-backable — he asks and tries to elaborate on this question, using all his experience. \n\n[https:\\/\\/twitter.com\\/lukemostert\\/status\\/1574337715784523784](https://preview.redd.it/ousmlnyuwiia1.png?width=1180&amp;format=png&amp;auto=webp&amp;s=6e8afcce29dc9337a845eeab8f97354966a77a11)\n\nIf you know any other helpful info to add, let me know. I'd be happy to extend the post with other gems!",
    "subreddit": "Entrepreneurship",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1676542283.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.405664976151897
  }
]