[
  {
    "score": 2170,
    "title": "Landed a $3.1M contract and it nearly destroyed us",
    "selftext": "I still wake up at 3am in cold sweats thinking about how close we came to losing everything. 12 person dev shop, 4 years of blood and sweat, almost GONE because of a fucking payroll company. we landed a $3.1M fintech contract last december (biggest deal of our lives) and it turned into 8 months of pure hell that nearly bankrupted us\n\nour gusto bill went from $1k to $11k/month OVERNIGHT. hidden fees EVERYWHERE .. international fees, currency conversion, compliance bullshit for each country. then 8 devs in india don't get paid bc their garbage system \"couldn't process\" it. client's threatening to pull the contract while half our team is literally on strike. THEN … and this is where i lost my fucking mind .. IRS hits us with $23k in penalties bc gusto NEVER SET UP PROPER TAX WITHHOLDING. we're burning $300/day in late fees, contractors jumping ship, and these absolute clowns at gusto support just bounce me between departments for WEEKS. \"that's handled by international\" \"you need compliance\" \"let me transfer you\"... i was ready to drive to their office and flip every desk in that building. my lawyer finally forced me to switch after showing me reddit threads of gusto destroying other companies. new provider dropped costs to $6k and somehow unfucked the IRS mess in 3 days. still don't understand how thera fixed what gusto couldn't handle in 3 MONTHS but whatever, screw gusto forever.\n\nbarely delivered on time. aged 10 years. lost hair. probably gave myself an ulcer. if you're planning to scale DO NOT USE GUSTO. they will destroy your company. search reddit first or learn the hard way like me",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2170,
    "downs": 0,
    "created_utc": 1752480396.0,
    "media": null,
    "is_video": false,
    "num_comments": 177,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.196869824608868
  },
  {
    "score": 1430,
    "title": "I turned 33, a few thoughts on life:",
    "selftext": "I turned 33, a few thoughts on life:  \n  \n1. I wish I would’ve realized earlier that you can just do things, and opportunities are endless when you have that mindset  \n  \n2. I have done some really cool things in life, none of it compares to the joy I get from being a dad  \n  \n3. My wife is literally the best single choice I’ve made in my life, everything else has come from that choice  \n  \n4. I’ve been broke and I’ve had money, having money is a superior route  \n  \n5. How you treat people direct correlates to the level of success you will have in life  \n  \n6. Building cool things with great people is the superior business model  \n  \n7. Optimizing my life for health, relationships, and joy has been a huge factor to where I am today (I didn’t start doing this until 29 though)  \n  \nThankful for all the people who have been a part of my journey  \n  \nLet’s keep building",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1430,
    "downs": 0,
    "created_utc": 1750379413.0,
    "media": null,
    "is_video": false,
    "num_comments": 164,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.984381605866729
  },
  {
    "score": 1336,
    "title": "How I make $4k/month with Instagram pages (350k+ followers)",
    "selftext": "In the summer of 2023 I started an Instagram page about the city where I live. At first it was just for fun, but it grew very quickly. After a few months, I reached 40K followers, and now the page has 170K followers. It is one of the biggest Instagram pages for my city.\n\nAs the page grew, I began working with restaurants and other tourism related businesses.\n\nThey paid me for promotions, and some became clients who I sold ad placements across my pages. This helped me make a good semi passive income, even while I was still in high school.\n\nSince this model worked well, I tried the same method for other popular cities in Europe. I created three new pages last spring. One page now has 100K followers, and the other two have 40K each.\n\nNow, I faced a problem. How could I make promotional videos for restaurants in other cities that are far away from me? I started looking for UGC creators who live in those cities.\n\nI pay them to visit the restaurants and create the videos in exchange for free food at the restaurants. These pages together make me €3K/month.\n\nTo make this work, I use a tool that automatically sends a free travel guide to people who comment a keyword under my posts.\n\nThis brings me more engagement and leads that is really important to go viral on Instagram these days. I get 100-120 leads every day from my page. I sell tourist services like tours and apartment rentals, making about €1.6K/month from this one page alone.\n\nI also manage social media and run lead generation ads for clients outside of the travel niche, using the strategies I apply on my own pages. This brings me another €1K/month.\n\nNow at 19 years old, I make €4K/month from Instagram while in my last year of high school.\n\nLet me know if you have any questions! 😊",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1336,
    "downs": 0,
    "created_utc": 1740584772.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.9060839629816835
  },
  {
    "score": 1245,
    "title": "Last year I started a business that did $5M. This year I’m prob gonna do $35M -45M depending on q4. Did I get lucky?",
    "selftext": "Quick backstory: \n\nI’ve been doing my own thing since 2015. I started with a drop shipping store and hustled. Started with $50 and my first year did $1M. \nCost to acquire customers were $2-$3 back then.  It’s was glorious. \n\n3 year later I sold my company and moved to Vegas to help build that brand’s Ecom division. I took that brand from $20k per month to $1.7M per month in under 1 year. Cost to acquire customers were $60-$70. After 2 years I left. \n\nI opened my own agency and built a pretty dope cash flow $15-20k per month. $35-40k in q4. \n\nGot back into the brand building driver seat last year and cofounder a dope company with my good friend. We each invested $3k and generated $5M revenue in year one. Took a while to remember how to build and scale an org. The first million too 6 months. The rest of the year was hyper growth. \n\nThis year we crossed the first $1M in ~80 days. Now we’re scaling up again. Cost to acquire customers is $100+ \n\nI don’t think it was luck. It’s just being relentless. \n\nHappy to share any insights for those looking to make their first mil and beyond. \n\nPS: happy to verify my private information if mods need to check me out\n\nEDIT: genuinely appreciate the questions and comments. I gotta hit the hay - finally got my 6 month old down for the night. I’ll be back tomorrow to hustle on y’all’s questions. \n\n2ND EDIT: Welp this kinda took most of my productive morning. Appreciate the badge ( I don’t know what it is but thank you) Appreciate all the questions and grilling me on my knowledge. \n\n—- \nI’m prob gonna make another post around a few case studies or something based on the 100+ friend requests and questions yall sent in DMs. Most questions are around the same theme - how do you build, grow, scale - and there’s really no cookie cutter approach. It’s pounding dirt every day until you hit a tiny spark and then fanning the flames until it turns into a bon fire. Then pouring gasoline wearing. Nothing but a wet t-shirt. \n\nResources:\n\nTop entrepreneurial podcast: my first million (especially earlier episodes), founders, money wise, and how to take over the world \n\nTop people to “learn” from on YouTube: Sam Ovens, Alex Hormozi, pat david (Valuetainment super early episodes), Russell Brunson \n\nGreat copywriters to study: Gary halbert,  David Ogilvy, Joe sugarman, Eugene Schwartz, Dan Kennedy\n\nCopywriting course: copythat by Sam par or rmbc method by Stefan Georgi \n\nLanding page designers - X just search for guys like Oshalchemy and Katrina shtogryn. \n\n",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 1245,
    "downs": 0,
    "created_utc": 1743558841.0,
    "media": null,
    "is_video": false,
    "num_comments": 603,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.146036511633717
  },
  {
    "score": 787,
    "title": "From an idea to replacing my full-time salary in 4 months and hitting $20 million in total sales as of this week. How I did it, and what's next!",
    "selftext": "12 Years ago I wrote a post on Reddit that led to the formation of this subreddit.\n\nAs of 2 weeks ago I hit the $20 million dollar sales mark.\n\nProof cause it's Reddit: [https://capture.dropbox.com/sSU3bL9w5R7vSSVh](https://capture.dropbox.com/sSU3bL9w5R7vSSVh)\n\nSo how it started\n\nIn October 2011 I was reading an article about a guy that started a cleaning company in his city and is now doing $150,000 per year.\n\nI worked full-time, but figured, shoot, if he can pull that off, why can't I?\n\nI got to working in this order:\n\n1. I drew up a quick marketing plan-literally one page in bullet form\n2. Had a website built that featured some of the ideas that I thought was most appealing about his site.\n3. Asked my home cleaner if she would take the jobs if I got any and she basically said \"hells yeah\" (I now have a total of 8 cleaners)\n4. I brushed up on my adwords (I had already owned an Adwords guide and had dabbled in adwords before for another local company)\n5. Started Twitter and Facebook page.\n\nAll of this took like 3 weeks.\n\nI launched the site on November 3rd and had the first job on the first day.\n\nBy the end of November I made my first $1,000 profit, and in a few weeks did ($4,000 per month), which exceeded the take home pay from my full time job.\n\nQuit my job at the $40,000 per month mark and then went on to build a multi-million dollar company.\n\n[https://capture.dropbox.com/5EoDW1zGfXDvgbQZ](https://capture.dropbox.com/5EoDW1zGfXDvgbQZ) &lt;-Me quitting my job.\n\nThis post is three-fold. To say,\n\n1. This is not brain surgery and\n2. Don't overthink shit, sometimes just doing it is the only answer.\n3. I'm going to re-create the case study that I did as I built this company in real time, updated with what works in 2024 and you can follow along and do it yourself if you would like.\n\nOr you can hang out here for 10 more years without doing anything.\n\nAnyhow that's the plan, if you're down, let me know I'll go through every day what to do for the next 27 days and show you exactly how to build these companies.\n\nIn true reddit fashion you can tell me why this no longer works or the market is saturated or blah blah blah and I'll just giggle over here and keep going.\n\nEither way, It kicks off tomorrow!\n\nPosts here so far:\n\nAll posts are here:\n\n[Backstory: From Zero to $20 million in sales](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1ase92j/from_an_idea_to_replacing_my_fulltime_salary_in_4/)\n\n[Day 1- The Industries that Work](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1atam05/day_1_choose_your_industry_live_20_million_dollar/)\n\n[Day 2- Choosing Your City and Business Model](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1atykp0/day_2_choosing_city_and_business_model_from_an/)\n\n[Day 3- How To Choose Your Domain](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1autoyg/day_3_choosing_your_domain_name_from_an_idea_to/)\n\n[Day 4- Website and elements](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1avlyd3/day_4_the_perfect_website_theme_and_elements_from/)\n\n[Day 5- Logo and focus](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1awkldv/day_5_your_logo_and_a_word_on_focus_from_an_idea/)\n\n[Day 6- Copywriting](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1axl0as/day_6copywriting_from_an_idea_to_replacing_my/)\n\n[Day 7- Customer Service](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1ayhh7q/day_7customer_service_from_an_idea_to_replacing/)\n\n[Day 8- Pricing](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1az8qqd/day_8pricing_from_an_idea_to_replacing_my/)\n\n[Day 9- Online Booking](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b04jyx/day_9_online_booking_from_an_idea_to_replacing_my/)\n\n[Day 10- E-COMMERCE ELEMENTS](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b0klz7/day_10_ecommerce_elements_from_an_idea_to/)\n\n[Day 11- BUSINESS FORMATION](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b1jl60/day_11_business_formation_from_an_idea_to/)\n\n[Day 12- PHONE SYSTEM](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b2kkpx/day_12_setting_up_your_phone_system_voip_and_a/)\n\n[Day 13- MARKETING CHANNELS](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b36cez/day_13_intro_to_marketing_local_services_from_an/)\n\n[Day 14- HIRING DAY 1](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b48icq/day_14_finding_your_first_service_providers_from/)\n\n[Day 15- HIRING DAY 2](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b549ki/day_15_hiring_day_2_from_an_idea_to_replacing_my/)\n\n[Day 16-INSURANCE](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b5v26i/day_16_insurance_from_an_idea_to_replacing_my/)\n\n[Day 17-MULTIPLE CUSTOMER CONTACTS](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b6hfvu/day_17multiple_customer_contacts_from_an_idea_to/)\n\n[Day 18-COMPETITION AND VALUES](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b7dfit/day_18competitive_and_values_from_an_idea_to/)\n\n[Day 19-MAKING MILLIONS WITH YELP](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b8203f/day_19how_to_make_millions_with_yelp_from_an_idea/)\n\n[Day 20-MAKING MILLIONS WITH THUMBTACK](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b94d66/day_20thumbtack_from_an_idea_to_replacing_my/)\n\n[Day 21-WHY ENTREPRENEURSHIP HASN'T WORKED](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1b9rlix/day_21_heres_why_entrepreneurship_hasnt_worked/)\n\n[Day 22-LEVERAGING VIDEO](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1baldiq/day_22_dont_send_me_these_dms_anymore_and/)\n\n[Day 23-LAUNCH LIKE A PRO](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1bbpiah/day_23_how_to_launch_your_local_service_business/)\n\n[Day 24-DESIGN FOR CONVERSIONS](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1bc7e95/day_24_from_5000_a_month_to_5000_per_day_design/)\n\n[Day 25-$10K IN REVENUE FROM ONE EMAIL BLAST](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1bdvfd7/day_25_10k_in_revenue_from_one_email_blast_heres/)\n\n[Day 26- TOOLS WE USE](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1bgzs85/day_26_quick_summary_of_what_we_use_from_an_idea/)\n\n[Day 27- QUICK START GUIDE AND EVERYTHING THAT GOT US HERE](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1bp8u7f/day_27_quickstart_guide_how_to_launch_a_local/)\n\nThere it is, no need to spend years on here overthinking, you can launch a business and be ready to launch next month this time, quit playing around.\n\n**Whenever you're ready, these are 3 ways I can help:**\n\n**1.** [**Sweaty Startup Operating System**:](https://rohangilkes.com/course2/)  Join 2,000+ students in my flagship course: Learn to build a lean, profitable, local service business. This is the system I used to quit my job and grow from zero to $20 million in sales and has generated over $100s of millions in revenue for other redditors.(https://docs.google.com/presentation/d/1gUESPVsiuhxLCHHU0vBt7FwNpMM1QQPPwBz44RpZ6\\_o/edit#slide=id.g56935b55df\\_2\\_195)\n\n This also gets my cell phone number so you can **text me for help as you build**.\n\n**2.** [**See what I'm working on and follow along**](https://indiepa.ge/rohangilkes) (Revenue updated in real time)\n\n**3.** [**The software we use to run your sweaty startup:**](https://convertlabs.io/cohort/pricing) Booking form, your website, hosting, domain, credit integration, email templates, the whole shebang.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 787,
    "downs": 0,
    "created_utc": 1708104436.0,
    "media": null,
    "is_video": false,
    "num_comments": 250,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.816363078230074
  },
  {
    "score": 756,
    "title": "My friend's \"artisan\" coffee shop is just a £99 Nespresso machine (making £15k/month)",
    "selftext": "So my mate opened what was supposed to be a bakery about 8 months ago. Decent pastries, cakes and stuff, nothing special and just about breaking even.\n\nThen she pivoted hard into the \"coffee shop\" vibe and renamed it something pretentious with \"&amp; Co.\" at the end. She's charging £3.80 for a flat white and £4.20 for a cappuccino. Premium prices for the area.\n\nThe coffee is made with a Nespresso Vertuo Pop she got for £99 from Argos and pods that cost about 38p each when bought in bulk. No barista skills needed, just stick in a pod and press a button. She's making £3+ profit per cup after the pod cost.\n\nThe irony is she first saw this machine when she came to my house. I've had this machine for yonks and I know that if you stick with the safe options like Costa Rica, El Salvador, Colombia, Mexico and those kind of pods, you just can't go wrong and nobody gonna have a clue.\n\nThere's a proper £2k+ commercial espresso machine in the corner, the kind you'd expect in a specialty coffee shop. Customers can barely see it unless they're really looking or go out of their way to look behind the counter.\n\nShe bought it broken on purpose. Found it on Facebook Marketplace for dirt cheap and it's purely for aesthetics. It's never worked, it's literally just a prop.\n\nBehind that machine is the Nespresso machine doing all the actual work.\n\nFrom what she's told me she's selling 170+ cups a day on average. Rough maths says that's £500+ in daily coffee revenue alone (not counting pastries) which is approx \\~£15k a month just from coffee.\n\nThe customers seem to be raving about it on Google reviews.\n\nPart of me thinks this is genius cos she's created an environment people want to be in and they're happy to pay premium prices. She laughs it off saying \"restaurants mark up wine 300%, nobody bats an eye\".\n\nIs this just smart business? She's asking me to join her and double down.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 756,
    "downs": 0,
    "created_utc": 1759513944.0,
    "media": null,
    "is_video": false,
    "num_comments": 440,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.793815174233992
  },
  {
    "score": 689,
    "title": "I worked 100-hour weeks for 2 years building my startup. Hit $1.2M revenue, then had a complete mental breakdown. Here is what \"hustle culture\" doesn't tell you.",
    "selftext": "Two years ago, I was the poster child for \"grinding 24/7.\" My SaaS startup had grown from $0 to $1.2M in 24 months. TechCrunch wanted to interview me. I was speaking at conferences. From the outside, I was living the dream.\n\n**But here's what nobody saw**: I was dying inside.\n\n**The \"Glory Days\" (That Were Actually Hell)**\n\nFor 2 solid years, I averaged 100-hour work weeks:\n\n* Monday-Friday: 6 AM to 11 PM\n* Saturdays: 8 AM to 8 PM \"lighter\" days\n* Sundays: Only 6 hours because I was \"taking it easy\"\n\nI lived on energy drinks and Adderall. My girlfriend moved out. I missed my dad's 60th birthday for a deal we didn't even close. But revenue kept climbing, so I told myself everyone else was just weak.\n\n**Then Everything Collapsed**\n\nMarch 15th, 2023. I was presenting Q1 numbers to potential investors when I had my first panic attack. Mid-sentence, I couldn't breathe. Vision went blurry. Hands shaking so badly I couldn't hold my laptop.\n\nThe paramedics said it wasn't a heart attack, just \"stress.\" Like stress was some minor inconvenience instead of the thing that nearly killed me at 29.\n\nOver the next month, panic attacks became daily. I couldn't drive without feeling like I had pass out. By April, I couldn't get out of bed some days. We lost two major clients. Three employees quit.\n\nMy therapist put it bluntly: \"You've been in fight-or-flight mode for 2 years straight. Your nervous system is completely fried.\"\n\n**The Recovery Nobody Talks About**\n\nI took 8 months off. Not by choice - my body literally wouldn't let me work.\n\nStarted therapy twice a week. Got on anxiety medication (which I was initially too proud to try). Learned words like \"boundaries\" and \"sustainable pace\" for the first time.\n\nThe hardest part? Watching other entrepreneurs on LinkedIn humble-bragging about \"grinding\" while I was learning how to sleep through the night again.\n\n**What Hustle Culture Won't Tell You**\n\n**Burnout isn't a badge of honor - it's a business liability.** When I was grinding 24/7, I was making terrible decisions because I was exhausted. I over-hired, over-promised, and nearly tanked the company I'd sacrificed my health to build.\n\n**After recovery, I restructured everything**. Hired a COO. Cut my hours to 50/week maximum. Revenue dropped initially, then stabilized and grew more consistently.\n\n**Your mental health isn't separate from business success - it's the foundation of it.** I spent $75K on software but refused to invest in therapy until I literally couldn't function.\n\n**The Best Part? I am Still Here**\n\nToday, 18 months post-breakdown, we're at $1.8M ARR. Working 45 hours a week. I sleep 8 hours a night. I went to Thailand for 2 weeks and didn't check email once.\n\nThe business didn't collapse without me grinding 24/7. It actually got better.\n\n**To Anyone Currently in the Grind**\n\nIf you're reading this at 2 AM between \"just one more task\":\n\n* You can't pour from an empty cup indefinitely\n* Taking breaks isn't lazy - it's strategic\n* Your worth isn't measured by hours logged\n* Therapy isn't a luxury - it's maintenance for your most important business asset: you\n\nThe entrepreneurship community glorifies the grind, but nobody talks about the casualties. **Consider this your permission to prioritize your mental health.** Your future self (and your business) will thank you.\n\nTo anyone grinding through their first breakdown right now: It's not weakness. It's your body trying to save your life. Listen to it.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 689,
    "downs": 0,
    "created_utc": 1753158116.0,
    "media": null,
    "is_video": false,
    "num_comments": 113,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6023015164054915
  },
  {
    "score": 689,
    "title": "I want to share the ways I make money for many of those looking for ideas.",
    "selftext": "  \n\nMy main business is party rentals. Tents, tables, chairs, etc…). I’ve done very well in that and have invested in things that I don’t have to do any work for.\n\n1. Restroom Trailer business - 30% owner. Two other guys deliver, pick up, clean, etc…. I just collect. 3 restroom trailers. My take per week - $1000-1500.\n\n2. Dish rental business. 30% owner. We rent out dishes, glassware, flatware to caterers doing off site parties in barns, warehouses, homes, tents. I do nothing. Weekly take $1000-$3000.\n\n3. Airbnb. 1/3 owner. 12k sqft barn converted into a house. I do nothing. Makes 12k per month. My take $1-3k per month.\n\n4. Nerf war/GellyBall parties. 30% owner Inflatable bunkers and blasters. Set up in people’s yards for parties. I do nothing. Weekly take $300-$500.\n\n5. 1. YouTube channel about the tent industry. It’s Niche, so not much. $250/month. (it’s called “The Tent Guy”)\n\n6. 2. YouTube channel giving people side hustle ideas. Just got monetized, only about $30.00 a month.\n\n7. Patreon - basically different tiers of consulting for the tent industry. $400-$500/month.\n\n8. Amazon affiliate - link to products that I use in my businesses shown in my youtube. $50/month.\n\n9. Amazon Merch - tshirts. $50/month.\n\n10. Zazzle - selling designs on products. $100/month.\n\n11. Smash words. Selling books on event rental business. It’s old. Not much. Less than $50/month.\n\n12. Amazon KDP – Wrote several books in the side hustle area. Just started a few months ago, made around $500.00\n\n13. TikTok – related to making money and side hustles. Tiktok does not pay much, its more of a way of getting out there for other stuff.\n\n14. Party Rental Course. A course teaching people how to start a party rental business. Released it 12/16/2022 and made $20K so far. Will push more when tent season starts back up.\n\n15. Affiliate for some event related companies. Not much, a few hundred a month.\n\n16. eBay. It’s not entirely passive, but I get things made in large quantities that I can list 100 at once instead of listing 100 separate items. I just have to ship. $1000/month.\n\nMy various ways to see my stuff are on my profile.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 689,
    "downs": 0,
    "created_utc": 1681966896.0,
    "media": null,
    "is_video": false,
    "num_comments": 383,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8360147029210205
  },
  {
    "score": 610,
    "title": "Why do most high-achievers avoid entrepreneurship?",
    "selftext": "I’ve known a lot of people way smarter than me like engineers, analysts, strategy people, who never even consider starting their own thing. Supposedly, only about 0.1% of highly talented people go the entrepreneurship route. I’m no genius myself, but I do run a SaaS, and it’s wild to me how much brainpower sits on the sidelines.\n\nAfter meeting hundreds of high-potential people in corporate and tech, I think it’s less about money or ideas and more about comfort. Smart people often build stable, well-paid careers, and the thought of ditching that certainty for the chaos of entrepreneurship is just not appealing. Also, there’s the curse of seeing too many risks. Being able to see every possible way something could go wrong can paralyze you before you ever start.\n\nWhen I started my business SocLeads, there were at least ten voices in my head telling me why it would fail and none telling me to just try it and learn. Most people don’t need more brains or better ideas, they need permission to try, get things wrong, and not have it wreck their self-image.\n\nI really believe talent is everywhere, but momentum is rare. Sometimes average people win just because they’re willing to send that first cold email, launch an early version, or risk looking dumb.\n\nWhat do you think?",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 610,
    "downs": 0,
    "created_utc": 1759411805.0,
    "media": null,
    "is_video": false,
    "num_comments": 347,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.784330832215844
  },
  {
    "score": 607,
    "title": "How I created a successful Mobile IV Therapy Company",
    "selftext": "Hello everyone! My name is Joe &amp; I own a [marketing company](https://www.omgmarketingco.com), and a mobile IV company. (used too) - I used to post a ton back in the day but I've recently saw how bad this sub has been getting within the last year. I wanted to break down the top 10 points of building a marketing company. If you have any questions feel free to ask!  \n\n\nWhat is Mobile IV Therapy?  \nMobile IV therapy is like having a mini hospital visit you, wherever you are. It's a service where a nurse comes to your location to give you special fluids through a small tube that goes into your vein, usually in your arm. These fluids can help you feel better if you're dehydrated, feeling sick, or lacking certain nutrients. It's like getting a big, fast drink of exactly what your body needs to feel better, without having to go to the doctor's office or hospital.   \n\n\nNow that we have that out of the way I was able to create a company called Pure IV Arizona, which got bought out by another company this [past year](https://www.azivmedics.com) \\- Here are some analytics/data for people that are curious just how great an IV company can do if done properly:   \n[https://gyazo.com/528f839eae2cbbc8e1595d623586dbdb](https://gyazo.com/528f839eae2cbbc8e1595d623586dbdb)  \n[https://gyazo.com/de28eae2a6fd145201205cdbe2cf0bfd](https://gyazo.com/de28eae2a6fd145201205cdbe2cf0bfd)\n\nFun/Fast Facts of Mobile IV Therapy:  \n\n\n\\- Investment: $5,000-$10,000 (again I own a marketing company, without it it would of been more toward $20K-$30K    \n\\- Time to build: 6-12 months    \n\\- Rev potential: $200K - $1M (first year)  \n\\- Profit: $60K - $500K (not counting weekly paychecks)  \n\\- Full time commitment\n\nSteps on how I did this and how you can take similiarites and use them for your business.\n\n \n\n1. **Establish Your Business Structure and Online Presence**: To kickstart my mobile IV therapy business, I first established a Limited Liability Company (LLC) and set up dedicated bank accounts for business operations. I invested in developing an engaging and user-friendly website, which serves as the primary interface with my customers. In Arizona, where I operate, you don't have to be a medical doctor to own a mobile IV therapy business. However, you still need a medical director to oversee the clinical side of things.\n2. **Build Your Team**: My next step was to hire a team of 5 to 10 skilled and licensed nurses. I made sure they had all the necessary equipment and supplies, such as vitamins and IV solutions, to provide the best care for our clients.\n3. **Invest in Marketing**: In this industry, effective marketing is vital. I directed a substantial portion of my budget towards Facebook Ads and Google Ads. Given the growth in the mobile IV therapy industry, digital advertising is a great way to capture the attention of potential clients.\n4. **Secure Insurance and Suppliers**: I ensured that all our nurses have the required insurance cover. I also set up agreements with reliable suppliers for our vitamins and IV solutions. I made sure our medical director's license was in place to support our clinical operations.\n5. **Set Up a Call Center and Scheduling System**: To efficiently manage appointments, I established a dispatch center, essentially a call center, along with a robust scheduling system. This setup is crucial in managing the flow of our operations and ensuring clients are attended to promptly.\n6. **Create Landing Pages for Lead Generation**: I used Unbounce to design lead pages that work hand-in-hand with our advertising campaigns. These pages capture potential client information, which our dispatch team uses to reach out and secure appointments.\n7. **Monitor Ad Performance**: I make it a habit to review the performance of our Facebook and Google ads every day. This routine allows me to spot trends, potential growth opportunities, and areas where we may need to tweak our strategy.\n8. **Ensure Proper Analytics Setup**: Before initiating any ad campaigns, I confirmed that Google Search Console and Google Analytics were correctly set up. These tools give me insights into how our website and ads are performing, helping guide decision-making.\n9. **Implement a Communication Platform**: I decided to use platforms like WhatsApp and Microsoft Teams to facilitate seamless communication with my team. This tool is vital for real-time coordination, especially when dispatching calls to our team of nurses.\n10. **Manage Dispatch and Revenue**: Finally, I ensured that our dispatch team efficiently managed calls, leading to prompt client service. By doing this effectively, we've been able to generate a steady income stream for our business.\n\nThese are the basics you need down in starting a mobile iv therapy company. I'm sure I'm missing some minor details but this is exactly how I was able to grow this company from $0 to $2M+ within a year. Majority of it was really zoning in on FB/Google ad advertising + events + getting the name out there. I believe hiring the nurses was the hardest part.  \n\n\nIf anyone has any questions about this please feel free to leave a comment below.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 607,
    "downs": 0,
    "created_utc": 1688768857.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.376905251090135
  },
  {
    "score": 599,
    "title": "My app makes me $2,700/month after 6 months!",
    "selftext": "So developing the basic version of this app took about 30 days.\n\nI did it together with my brother and we also did marketing for it together.\n\nWe constantly work to improve it and the growth has been crazy for us the last few months.\n\nThe idea started as just giving AI memory to make it easier for ourselves to build our products (didn't exist in LLMs when we started). Then we continued to improve upon it and add new features like searching through Reddit discussions to validate ideas, following specific phases from ideation to building and marketing, and adding tools to make the whole process more actionable.\n\nAll we did to market it was talk about our journey building the app on X in the Build in Public community (great way to get attention early on btw).\n\nWe also launched on Product Hunt which got us our first paying customers.\n\n54 days after launch we hit $1,000 MRR\n\n98 days after we hit $2,000 MRR\n\nAnd today we’re at $2,700 MRR.\n\nTotal revenue is about $9,000.\n\nThe beginning is the toughest part, so I thought I could be of some help to you guys by just telling you how we got off the ground.\n\nI’ll keep it brief because no one wants to read a wall of text:\n\n**Reaching first 100 users**\n\n- Created survey to validate idea in target audience’s subreddits\n- Offered value in return for responses (project feedback)\n- Shared MVP with survey participants when it was finished\n- Daily posts in Build in Public on X sharing our journey and trying to provide value\n- Regular posts in founder subreddits\n- Result: 100 users in two weeks\n\n**Getting our first paying customers**\n\n- Focused on product improvements based on initial feedback\n- Launched on Product Hunt (ranked #4 with 500+ upvotes)\n- Got 475 new users in first 24h of PH launch\n- Got 5 first paying customers in 24h\n- Featured in Product Hunt newsletter\n- Result: 22 paying customers within one week of launch\n\n**Scaling to $2,700 MRR**\n\n- Continued community engagement\n- Strong focus on product improvements\n- User referrals from delivering value\n- Sustained organic growth\n- Result: Steady growth to $2,700 MRR\n\n**What actually worked**\n\n- Idea validation before building (saved months of work)\n- Being active and engaging in communities (Build in Public on X + Reddit)\n- Product Hunt launch ([here's](https://www.reddit.com/r/ProductHunters/comments/1hspc88/5_tips_for_a_successful_product_hunt_launch_got/) a post of mine with some PH launch tips)\n- Focusing on product quality over marketing gimmicks\n- Being open to feedback and using it to improve product\n\nWe didn’t spend a dollar on marketing to reach this point and we recently hit 5,000 users. It’s only in the last week we’ve started experimenting with paid advertising.\n\nThe goal for this year is to hit $10k MRR, which I see as doable if we get paid advertising to work.\n\nThe app is called [Buildpad](https://buildpad.io/?ref=Reddit) if you want to check it out.\n\nI’ll continue sharing more on our journey to $10k MRR if you guys are interested.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 599,
    "downs": 0,
    "created_utc": 1740665490.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.391088678219889
  },
  {
    "score": 589,
    "title": "I asked GPT4 to become a CEO and create the most profitable company you can build with £100 GBP and 1 human hour per day.",
    "selftext": "\nThis is what happened so far: \n\n1 - ChatGPT4 told me to start an organic and sustainable clothing e-commerce store.\n\n2 - It chose the brand name Herbivore Clothing Co. \n\n3 - We will sell clothing made from sustainable cotton and organic materials.\n\n4 - GPT4 told me to attract angel investors for upfront capital.\n\n5 - I am seeking Angel investors for upfront capital. (HMU)\n\nIt's a tough market these days, I will take what I can get. \n\n6 - GPT4 drafted a 10 step business plan and suggested I use Shopify and Printful, selling exclusively print-on-demand.\n\n7 - We now have a live Shopify store \n\nLet's see where ChatGPT takes this in 30 days.\n\nOur store is live!\n\nhttps://herbivore-clothing-co.myshopify.com/\n\nTotal Spend so far: £1 (Shopify are currently running an offer which is £1 a month for the first 3 months)\n\n1. Main progress achieved so far:\n\n- We started building an e-commerce store.\n- ChatGPT chose the brand name “Herbivore Clothing Co.”\n- Our AI clothing line was designed and is ready to go!\n\n- Printful integration with the Shopify store.\n- First hat sample order is on it's way for QC.\n- Pricing set at what ChatGPT suggested.\n- Introduced Free Global Shipping\n\nMessage from the CEO (ChatGPT):\n\nAs CEO of Herbivore Clothing Co., I am thrilled to announce our new venture in the Sustainable fashion business. Our mission is to provide high-quality organic clothing that allows our customers to express their unique style and personality. We are dedicated to sustainability and ethics in all aspects of our business, from our supply chain to our packaging.\n\nWe are excited to offer our customers a seamless online shopping experience through our e-commerce website built on Shopify with a range of payment options and easy checkout process. Our team is working hard to create a variety of designs that will appeal to a wide range of customers and we are committed to continuously expanding our product offerings.\n\nWe believe that by putting our customers first and delivering exceptional products and services, we can build a successful and sustainable business that makes a positive impact on the world. Thank you for your support and we can't wait to share our products with you!",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 589,
    "downs": 0,
    "created_utc": 1680121848.0,
    "media": null,
    "is_video": false,
    "num_comments": 157,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.545180555119355
  },
  {
    "score": 548,
    "title": "Why do many entrepreneurs claiming to earn $100million, $200million from other ventures now produce YouTube videos?",
    "selftext": "It's noticeable that a trip down the YouTube business advice rabbit hole reveals numerous individuals boasting about their enormous earnings and offering financial guidance. While I understand that building a YouTube brand can be lucrative, it puzzles me why those supposedly adept at making millions outside of YouTube would pivot to creating content on the platform. Wouldn't it be more sensible for them to focus on scaling their existing businesses further? Moreover, skepticism arises regarding the authenticity of these claims, especially when advised that those who teach aren't necessarily experts in their field. After all, prominent figures like Elon Musk, Jeff Bezos, and Warren Buffett aren't seen sharing advice on YouTube or authoring how-to books. What drives these successful entrepreneurs to YouTube, and can their claims be taken at face value?",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 548,
    "downs": 0,
    "created_utc": 1710058073.0,
    "media": null,
    "is_video": false,
    "num_comments": 220,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.631768481292647
  },
  {
    "score": 536,
    "title": "So I’ve launched 18 startups.  If I could start over today, here’s what I would do…",
    "selftext": "First off, so I don’t have to waste time with these responses:\n\n\\-Yes I’m a little crazy. Whoopty Do! \n\n\\-Yes I didn’t do it the way you would have done it. Oh snap, we have different brains and backgrounds? Groundbreaking stuff! \n\n\\-Yes this is real, I did this all transparently on Reddit in real time from when I was doing $4k a month where the image starts with build in public, all the way to past $200k a month. Check the history through the years, you’ll find screenshots, me logging into my stripe with video lol, a tour of our office and warehouse, and everything in between. \n\n**Now that’s that’s out the way…**\n\nHere’s what I want to say. \n\nSo I got here by doing things my way and not caring what the generally accepted startup methods were.\n\nI simply sold what people already by. **GENIUS!**\n\nBut if I were to start over again here’s what I would say to a younger me:\n\n**DON’T DO ANY OF THIS.**\n\n**DON’T** Try to solve multiple things as opportunities pop up that could be complementary products to your main product.\n\n**DON’T** Launch without full validation testing while getting started.\n\n**DON’T** Skip the planning stages where you do full market research, economic research, SWOT analysis, where you take as much time as possible planning carefully and validating each product before you build. \n\n**DON’T** Put up a landing page and slap on a stripe checkout and try to get your first customer\n\n**DON’T** Launch before everything is perfect and every pixel in place.\n\n**DON’T** See startups as a numbers game where you put up as many shots as possible to see what works like you’re a venture capitalist distributing risk.\n\n**DON’T** Throw in the towel if something isn’t rolling within 60 days of launch and diligent marketing.\n\n**Don’t** Launch before testing demand as if you can infer demand from the fact that there are viable competitors making money. \n\n**Don’t** Focus on a slimmed down product and FAT marketing like…this is the path to success! \n\nLet me stop fucking with y’all. Re-read those last few sentences and cover up “Don’t”. \n\n**These things are EXACTLY what I would do all over again.**\n\nI’m not a genius. \n\nI’m not even great at business. \n\nEverything I learned I learned by doing and googling. And taking shots and learning along the way. (And this is enough to separate the winners from folks on the sidelines)\n\n**Do this instead (serious this time):**\n\n1. Grab a one page business plan and write that idea out.\n2. Make sure it’s something with viable competition. Boom: Validation done.\n3. Get up a landing page (Takes like 10 minutes these days)\n4. Set up your stripe or calendly (schedule a call) link\n5. And get to marketing hitting all of these as close to daily as possible\n\n* Facebook Groups\n* Facebook Dms\n* Facebook profiles\n* Linkedin\n* Reddit\n* Twitter (Will forever be Twitter Fuck x)\n* Tik Tok\n* Instagram\n* Youtube Shorts\n\nBuilding a new tool for this btw. \\^\\^\n\nIf you don’t have some money from this in like 60 days, Fam, pivot and move on. \n\nYou’ll learn a shit ton more from going through this a couple times that hanging out on the sidelines for the next decade.\n\n**SO WHAT WAS I THINKING IN DOING ALL THIS?**\n\nFam, I was broke, hated my job, and wanted a way out of corporate America. The end. \n\nNo magical dreams about changing the world. Wasnt’ trying to get clean water to Flint!\n\nMy dreams were about my next car payment and finding the right a/c setting so it would kick on the exact perfect number of times where I could keep my electricity bill low enough while also not dying of heat stroke.\n\nAnd none of this is perfect. But life isn’t perfect. Imagine if folks overthought relationships like they overthought building businesses. Some of y’all would die alone lol\n\n**So that’s what I wanted to get out**\n\n* No you don’t need to get the tech perfected.\n* Nope that business plan doesn’t have to be 60 pages. What is this 1997?\n* Nope you don’t need funding (go build something that matches your bank account) \n\nHere’s what I’ve realized. Most aspiring entrepreneurs are **physically allergic to execution.**\n\n\\-You’ve read every startup book.  \n\\-You’re in ten “founder” Discords.  \n\\-You’ve watched a thousand YouTube videos about passive income and scalability.  \n\\-You’ve even got a Notion doc labeled “2025 Business Ideas.”\n\nBut you still haven’t launched a single thing.\n\nWhy?\n\nBecause you’ve confused *preparation* with *progress*.  \n**You think startups are about perfect ideas — Startups are about** ***reps***\\*\\*.\\*\\* \n\n**Well that's just opinion any way, that doesn't make me right.**\n\nBut my opinion is if you keep waiting for that perfect idea you’re going to keep getting trumped by people like me that put up reps.  And now with AI the ability to put up reps is closer to once per week than it is once per year (like when i was starting out).\n\n**SO FINAL THOUGHTS**\n\nTake action. \n\nOverthinking and overplanning ttricks your brain into thinking you’re building something when you’re stuck in preparation mode.\n\nInstead, treat business content like a recipe — not a novel.\n\nIf you want to cook a steak, you don’t spend five days reading Gordon Ramsay’s autobiography. You type “how to cook a perfect steak” into YouTube, hit play, and start searing.\n\nMedium rare of course.\n\n**Questions**\n\nI know my way isn’t the only way. I’m curious, for those of you who have been building for a while:\n\nIf you had to start over, would you put up multiple shots and grind it out with one project?\n\nWould love to hear stories, lessons etc.\n\nAll this is just one person's opinion at the end of the day. \n\nDms are open too, I've been responding to all my Dms on here for over a decade.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 536,
    "downs": 0,
    "created_utc": 1761762896.0,
    "media": null,
    "is_video": false,
    "num_comments": 195,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.596102321377793
  },
  {
    "score": 522,
    "title": "What are you building? List it below &amp; I'll give you one unconventional marketing strategy to try.",
    "selftext": "For context, you can see my [growth hacking newsletter](https://startupspells.com) that covers tons of unconventional strategies from Startups to Brands.\n\nAnd give me an unconventional strategy to grow. Currently, trying it on Reddit &amp; Twitter. But soon might try Cold Emails.\n\n**Edit: This blew up a lot more than I expected. Worry not, I'll be back to finish what I started. Keep them coming. Definitely read my blog linked above for unconventional strategies. Already covered 30 of those in there.**\n\n**Edit 2: I am going to sleep now. If I haven't gotten back to you, don't worry. I'll check it throughout the week. Keep commenting and please for the love of god, write what your app does and who you are targeting. The better the question, the better the answer.**",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 522,
    "downs": 0,
    "created_utc": 1715055536.0,
    "media": null,
    "is_video": false,
    "num_comments": 416,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.771069716354153
  },
  {
    "score": 519,
    "title": "The dumbest idea I had made me my first internet dollar.",
    "selftext": "I had a silly idea a year ago: A website to *tell* people you're having sex.\n\nAfter all, what's better than having sex? Telling people you're having sex.\n\nThe idea: submit your name, and it gets displayed for 24 hours. Pay a *small fee* and it stays for a **week**.\n\nOn a flight from Greece to the UK, I decided enough was enough and whipped out the MVP.\n\n3 hours flew by (pun intended). 72 hours later, the app was finished.\n\nI posted it to a few sub reddits yesterday thinking it would get ignored.\n\n400k+ reddit views, 3000+ site visits, and £12 later, I'd gone through an emotional whirlwind and made my first internet dollar! This was not only my first dollar, but the first time I'd ever seen any traction from my web development endeavours. And all from the dumbest idea I've ever had.\n\nMy takeaways from this experience were that silly polarising ideas can work. However, realistically, a 0.12% site conversion rate, with a low cost product, after payment provider fees (30 cents + 1.x%), I'll need to go massively viral in order to make any real money. Still, a fun experience I thought worth sharing.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 519,
    "downs": 0,
    "created_utc": 1728243793.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": true,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.335673618361589
  },
  {
    "score": 506,
    "title": "Database of verified startup traffic. The hopeful end to fake screenshots?",
    "selftext": "I’ve been frustrated for years by how unrealistic a lot of “startup traction” claims are online. Every pitch deck says the same thing: *“We’re growing 30% month-over-month.”* Every new product on Twitter shows a suspiciously clean Google Analytics screenshot. And investors never know what’s real and what’s inflated.\n\nSo… I built something to solve that.\n\nIt’s a simple database where founders can add their startup and verify their traffic automatically using Google Analytics. No screenshots, no manual uploads, nothing editable. The metrics are pulled directly from the source and displayed publicly on a profile, so anyone can see the actual numbers.\n\nFounders can add their startup for free. There’s no catch, I’m trying to build something genuinely useful for the maker/Indie Hacker community. \n\nIf anyone wants to test it, break it, or roast it… I’m open to all feedback.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 506,
    "downs": 0,
    "created_utc": 1764036546.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.108617606700296
  },
  {
    "score": 493,
    "title": "Remote Cleaning Space - $330k in 12 months",
    "selftext": "**Easiest Side Hustle to start**\n\nLast year I  worked in Tech and decided to start a side hustle. I wanted to get involved in a business that didn't require much brain power but where there was a gap in customer service and marketing.   \n\n\nThat is when I decided to get in the cleaning space. Low and behold the first month I  start the business I  also get let go from my job and was forced to do the cleaning myself. I  have a family and there was no way in hell would I  allow my pride to get in the way of providing for my family.   \n\n\nThis time in March I  found myself cleaning floors and felt more freedom than I  ever had working in corporate. I spent 10 hours cleaning one house and to this day I'd do it again if I  had to.   \n\n\nFast forward 3 months I could no longer clean homes because my body was sore and it just wasn't scaleable so I  had to get creative.   \n\n\n\"*How can I  focus solely on sales and stop cleaning?\"*   \n\n\nThat is when I looked into some state laws here in Texas and realized I  can legally outsource all of the cleaning jobs and still keep 50% of the booking price. That is exactly what I  started doing.   \n\n\nBy month 4 of opening my cleaning business I  went from $15k a month to $40k a month and I  didn't even have to leave my home.   \n\n\nToday is my one year anniversary of opening my cleaning business and im just so happy I  took the leap of faith. I  didn't think that owning a cleaning business would write my ticket to freedom but im glad it did.   \n\n\nIf you guys would like I'd be more than happy to discuss what marketing methods I  used to start my business. You can operate a remote cleaning business and keep your full time job. I  was unfortunate (so i  thought) to be let go so I  had no choice but to make this successful.   \n\n\nAnyway... Don't sleep on boring businesses there is a huge demand for home service based businesses right now. It's not sexy but it's profitable when done right.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 493,
    "downs": 0,
    "created_utc": 1678152179.0,
    "media": null,
    "is_video": false,
    "num_comments": 396,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.720622202305204
  },
  {
    "score": 425,
    "title": "I built a tool using GPT that generates replies to all your emails, and leaves them in your drafts folder for you to send.",
    "selftext": "Hey everyone! 👋\n\nI absolutely hate writing emails. Even using ChatGPT to help is still pretty annoying - it takes time to write the prompt, and more time to wait for a response. ⏰\n\nThat's why I built [mailwiz.app](https://mailwiz.app/) (mostly with GPT!) -- whenever I receive an email, MailWiz automatically generates a reply to it and leaves it in my drafts folder.\n\nWhen I open my inbox, I see a bunch of personalized replies ready for me to review and send. It's pretty amazing, and it saves me a huge amount of time.\n\nI'm currently looking for beta testers who will have free access to the tool. If you're interested, leave a comment or send me a message and I'll get in touch. 🚀",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 425,
    "downs": 0,
    "created_utc": 1682071664.0,
    "media": null,
    "is_video": false,
    "num_comments": 405,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.638672615891316
  },
  {
    "score": 383,
    "title": "Made $5,000 extra just by showing the demo first:  AI is a cheat code",
    "selftext": "I made an extra $5K just by showing instead of telling.\n\nRunning a software dev agency in 2025 is wild. With tools like Lovable, Cursor, Claude Code, etc., spinning up a working prototype takes maybe an hour or two. Recently I upsold a app service to client making me extra $5000. \n\nHere’s my new playbook for 2025: \n\nNew Clients:\n\n1. Hop on a call.\n\n2. Understand what they’re trying to solve\n\n3. Build a quick working demo using AI\n\n4. Share it with them + provide timeline and price along with it\n\n5. Follow ups, if they don't reply\n\nI’ve had people approve projects within 24 hrs just by seeing a real clickable prototype. Yes sometime they may ghost but it's worth the effort you put.\n\n  \nExisting Clients:\n\n1. I casually note what’s bugging them or what could be automated\n\n2. Build a quick demo, again with AI doing the heavy lifting\n\n3. Built and provide free value \n\n4. Pitch it as a monthly add-on\n\nHonestly, AI is a cheat code. You don’t need to pitch hard when the client can see the solution. A few prompts get you to a first version that’s good enough to convert.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 383,
    "downs": 0,
    "created_utc": 1753595553.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.163545221149
  },
  {
    "score": 372,
    "title": "How I Make $10,000 Monthly | AI Influencer Management",
    "selftext": "Hello everyone,\n\nDon't worry about my profile name or image, my real name is Ben.\n\nI'm a 32-year-old former copywriter live in LA since 2021.\n\nI've always dealt with side hustles, but this story was the most successful.\n\nBelow, I will tell you **how I earned $10,000 per month** in just three months.\n\n**SUMMARY OF WHAT I DO**\n\n**The simplest explanation is that I do AI influencer management.**\n\nI produce content with two models named Emma and Jade (I also try different models).\n\nI make money through brand collaborations, personal gifts, and Patreon.\n\n*DISCLAIMER: NOTE A REFERRAL LINK*\n\nEmma: [https://www.instagram.com/emmalauireal](https://www.instagram.com/emmalauireal)\n\nJade: [https://www.instagram.com/jadelaui/](https://www.instagram.com/jadelaui/)\n\nOur community on Discord: [https://discord.gg/tmq8MQnzHt](https://discord.gg/tmq8MQnzHt)\n\n**HOW DID I START?**\n\nYou know Meta (Facebook) investing in AI and opening [celebrity accounts](https://about.fb.com/news/2023/09/social-profiles-for-metas-ai-characters/).\n\nShortly after seeing this, I did research on realistic model production.\n\nIn the second half of 2023, technology was not as good as it is now.\n\nBut as of now, I have two of the most realistic models on Instagram.\n\nI will not share the link because it is against the rules (I think).\n\n**HOW MUCH DID I EARN IN THE LAST 90 DAYS?**\n\nUntil May, Emma and Jade had joint Patreon accounts.\n\nTherefore, I write the following numbers as the sum of the two:\n\n* March: $12,103.23 (Emma go viral)\n* April: $6,300.02\n* May: $9,001.95\n\nAs I write this, I earned **$1,096.05** in the first four days of June.\n\n**HOW DO I DO?**\n\nI use the interface called **Foocus**.\n\nAlthough the base model changes from time to time, we can generally say that it is **Jaggernaut V9**.\n\nI share daily content like a real Instagram influencer.\n\nEmma's current reach exceeds **1.3 million** monthly.\n\nJade is more impressive. She managed to surpass **3.3 million** reaches.\n\n**CAN EVERYONE DO IT?**\n\nSimple answer - yes. You can do it.\n\nBut as of now, there are 1000s of AI influencers.\n\nIt's not just about creating \"sexy\" photos.\n\nYou have to create influencers who are high quality, creative, and have personality.\n\nI even opened an AI influencer agency because the future is so bright.\n\n**IS THERE A START-UP COST?**\n\nIf you have a powerful GPU, nope. You can start on your own computer.\n\nBut if you don't have a PC, you may have to pay for platforms like RunDiffusion.\n\nI wrote it very carefully so as not to violate the rules.\n\nIf there is a problem please let me know and I can fix it.\n\nI will answer all future questions.\n\nSee you around,\n\nBen.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 372,
    "downs": 0,
    "created_utc": 1717542923.0,
    "media": null,
    "is_video": false,
    "num_comments": 292,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.502642641985743
  },
  {
    "score": 366,
    "title": "These guys made billions stealing startup ideas",
    "selftext": "In 1998, 3 German brothers, Marc, Oliver, and Alexander Samwer saw the rise of a new platform called eBay.\n\nIt sparked a thought: if eBay was gaining traction in the U.S, why couldn’t a similar platform work in their home country.\n\nSo they approached eBay with an idea: bring the platform to Germany and hire us to run it.\n\nDespite their passionate pitch, the eBay executives turned the brothers down.\n\nReturning to Germany the next year, they launched Alando, an eBay clone for the German market.\n\nIn a shocking twist, just a hundred days after launching, eBay acquired Alando for a staggering forty three million dollars. \n\nSensing they were on to something, the brothers used the money to launch Rocket Internet, a venture studio dedicated to the art of ripping off US companies.\n\nThe blueprint was simple: duplicate successful US businesses, launch them in foreign countries and eventually sell them to the original company.\n\nOver the next few years, the Samwers targeted several major platforms including Facebook, Twitter, Youtube, and Amazon. Each time selling their clone for hundreds of millions.\n \nToday, each brother is worth around 1.2 billion dollars.\n\n(Shameless Plug) For more stories like this check out the [50 Greatest Business Success Stories](https://www.foundercentral.co/) along with our [Instagram](https://instagram.com/foundercentral_?igshid=d3JycnR2ZWJidWMw&amp;utm_source=qr) and [tik tok](https://www.tiktok.com/@shortformbooks?_t=8h0HTdGJA34&amp;_r=1)",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 366,
    "downs": 0,
    "created_utc": 1698860860.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.19791142683833
  },
  {
    "score": 358,
    "title": "I'm fixing vibe-coded apps while everyone else is still busy laughing",
    "selftext": "I've spent the last month fixing AI/vibe-coded apps. Totally by accident.\n\nFor a while I was just watching from the sidelines. Memes, slop, screenshots - funny. Then I started noticing something else - an opening in the market: not just wannabes playing with AI, but people who actually run businesses. Agency owners, operators, folks with real money, building internal tools and little SaaS products with AI. And slowly being more vocal about their frustrations and failures.\n\nNot \"haha look at this mess\" type of frustration.\n\nMore like: \"I've already sunk weeks, money, and my ego into this and it still doesn't actually work.\"\n\nI decided to test if there was anything real there. Did some outreach, got a few \"nah, I'm good\", a bunch of silence.\n\nThen, in two weeks, three people said yes. Here they are:\n\n**First client:** spent three months in ChatGPT building his SaaS.\n\nAnd honestly? He did alright. Auth working, CRUD working, UI not terrible.\n\nBut Stripe completely destroyed him.\n\nNot because Stripe is hard - Stripe is boringly straightforward.\n\nChatGPT had built this Frankenstein architecture where nothing connected to anything properly. Half the logic lived in random files. Some in serverless handlers. Some in components.\n\nYou could change one thing and break seven others accidentally.\n\nIt took me a week to untangle it and get payments running.\n\nAnd Stripe was only the start - once you fix one part, the rest of the mess reveals itself.\n\n**Second client:** a React app. Gorgeous components. The founder was proud of how \"clean\" everything looked.\n\nThen I checked under the hood:\n\n* No state management.\n* Double API calls everywhere.\n* Zero error handling.\n\nThe moment one feature needed to talk to another, the whole thing collapsed.\n\nIt was like building a pretty house with no plumbing - looks amazing right until you try to flush the toilet.\n\n**Third:** this is when I noticed: okay, this is a pattern.\n\nThis one looked fine at first glance, but I removed almost 2,000 lines of useless code on day one.\n\nDuplicated functions, dead imports, code that didn't belong to any feature, random leftovers from past attempts.\n\nAll hidden under a \"looks good in the UI\" layer.\n\nAnd this is when it clicked:\n\nLLMs are great at producing finished-looking things.\n\nTotally useless at producing launchable things.\n\nHere's what they consistently fail at:\n\n* architecture (it optimizes for speed of generation, not reality)\n* decision-making (doesn't know your scale, so it picks enterprise patterns for tiny apps)\n* testing (it can't run the app and see the fallout of its own choices)\n* edge cases (slow API? weird user input? degraded network? it has no instinct for any of this)\n* cleaning up after itself (LLMs leave behind scaffolding, dead code, and weird experiments)\n\nThat last 20% - the part between \"I have something that works in a demo\" and \"I can actually launch this without it burning down\" - that's not more prompting.\n\nThat's engineering.\n\nAfter the third project, I thought:\n\n\"Okay - this is a real thing.\"\n\n\n\nWhile experienced developers are still laughing at vibe coding, there's a growing pile of half-finished products - and being early in the corner where they become real, shippable software feels like the right place to stand.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 358,
    "downs": 0,
    "created_utc": 1764769013.0,
    "media": null,
    "is_video": false,
    "num_comments": 158,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.375793010738545
  },
  {
    "score": 349,
    "title": "TV Mounting: $60,000+ Profit/Year. How Can Leverage My Know-How?",
    "selftext": "After helping a friend mount a TV at his house, I realized how easy it was and decided to create a website and run some ads to see if I could get a few clients to make some extra $$ over the weekend.\n\nWhat was supposed to be a side hustle became my main source of income. I started alone in 2020. Today, these are my numbers:\n\n* 1,476 Clients\n* 4 Employees\n* 1 Car with \\~$2,000 in tools\n* $421,427.96 Revenue\n* $220,125.57 Profit\n\nThe great thing about mounting TVs is that it doesn’t take longer than 30 minutes to complete a job, and clients will happily pay $150/$300 to have it done by professionals. Every time I encountered something new — for example, metal studs — I'd tell the client I needed to get the right screws for the job, drive to a home depot and watch YouTube videos to learn what to do and also what to buy. There was never a time when I couldn't find a solution on YouTube.\n\nBesides the time it took to create the website and ads, my only investment was $800 to run the ads on my first month. The business was always profitable and paid for itself from the second month forward. All the tools, employees, and the car were paid with money that was generated mounting TVs.\n\n---\n\nThis business changed my lifestyle. I don't make crazy amounts of money, but I was able to structure the business in a way where I don't work more than 3 hours per week and get paid as any regular full-time job.\n\nThe first year, I was mounting TVs myself with a helper, but it got to a point where I was spending too much time on my phone, so I decided to hire a second person. Today, the guy who started with me has his own car, a company card for gas/emergency Home Depot runs, and he is responsible for hiring the help. I pay him $40/h, and he decides how much he wants to pay for the help.\n\nThe first year was the best profit because I was actively working on the business. My profit dropped by $20,000 when I decided to focus on admin/sales.\n\nI am providing all of our text communication templates for anyone who wants to start a TV mounting business today (Check comments).\n\nYou don't need a website! Follow this order: Craigslist → Bark → Get a Website → Yelp → Google. (I tried Facebook ads, and the return is not great).\n\n\\---\n\nNow, I'd like some advice on how to leverage my know-how and the tools I've built.\n\nI have:\n\n* My spreadsheet that grew in complexity with the business.\n* The website that is connected to the spreadsheet and a Trello board.\n* A script that creates all the necessary texts for communication after the client pays the deposit.\n* Ads data from 4 years of profitability.\n* A sales process that converts 60% to 80% of our leads per month.\n* A web app with all the information the field team needs. This app greatly reduces the amount of calls between the TV mounters and I.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 349,
    "downs": 0,
    "created_utc": 1708468000.0,
    "media": null,
    "is_video": false,
    "num_comments": 126,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.323469904828254
  },
  {
    "score": 344,
    "title": "$14k selling ChatGPT prompts.",
    "selftext": "6 months ago, I started a silly little business of **selling ChatGPT prompts.**\n\nSo far, I've sold $14,016 worth of prompts and I'm not stopping.\n\nIn this post, I'll break out how I did it.\n\n**Statistics:**\n\n* Website: [Prompt Advance](https://promptadvance.club/get)\n* **Product:** [ChatGPT prompt bundle](https://promptadvance.club/get) (10,000 prompts).\n* **Revenue (total):** $14,016\n* **Started:** July 2023\n\n## Who am I and why did I start this business\n\nI'm a web developer by trade who started a couple of indie startups in the past.\n\nFor the last couple of months, I'm highly interested in Gen AI space.\n\nI knew I wanted to build something related to ChatGPT, but I didn't want to build another tool using their API.\n\n## How did I come up with the idea\n\nI saw a lot of Facebook ads for these ChatGPT prompt bundles.\n\nthousands of prompts packaged into Notion template.\n\nI thought to myself, \"who would buy that?\"\n\nBut apparently, market is there. So I went into the rabbit hole.\n\nI knew I could build something similar, but better.\n\n## How did I build the product\n\nSince I'm web developer, I could code the platform to host all the prompt myself. That costed me $0 in total.\n\nAlso, it was super simple to build an easy interface to find and copy paste the prompts (around 3 months).\n\nAfter I got my first 100 customers, I knew I should improve the product.\n\nSo I built the ChatGPT browser extension, bringing all my prompts directly into ChatGPT.\n\n## How did I get my customers\n\nI got my first 10 customers from Reddit ads. I barely break even.\n\nThen, I started posting on [Medium.com](https://Medium.com), this gave me a lot of profitable sales.\n\nI tried Facebook ads, but not profitable.\n\nI also started building free [ChatGPT tools](https://promptadvance.club/tools) and sharedon Reddit. This led to a couple of sales.\n\nIn the meantime, I also started working on SEO which also bring couple of sales.\n\nTo break it down, around 50% of my customers came from Medium, 25% Facebook ads, and another 25% was Reddit, SEO, and other random traffic.\n\n## What are my future plans\n\nI want to keep building free tools and sharing them.\n\nI want to write more blog posts to drive SEO traffic.\n\nI want to keep experimenting with Facebook ads and try to make them profitable.\n\nI want to improve the extension, really focusing on usability. I want to make the whole experience of working with extension profitable\n\n## Lessons I want to share\n\nNo matter how stupid the idea sound, go for it.\n\nDon't be afraid of the competition. Looka t their reviews, see what customers don't like. Use it as a feedback for your product.\n\nDon't listen to negative feedback. When I tell someone I'm selling ChatGPT prompts, they always ask who would buy it. Well, as it turns out, a lot of people will.\n\nTry different marketing channels. See which one has potential. And when you find it, keep working on it.\n\n*I think that's it. If you have any other question, ask me in the comments.*",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 344,
    "downs": 0,
    "created_utc": 1701787682.0,
    "media": null,
    "is_video": false,
    "num_comments": 131,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.310606060676198
  },
  {
    "score": 333,
    "title": "Local newsletter making $300k/year off ads with 21k subscribers",
    "selftext": "Hi all,\n\nI'm an economist studying the newsletter industry. Thought you might be interested in [an analysis](https://contentquant.io/articles/naptown-scoop-01/) I did on ad monetization in *local* newsletters, i.e. newsletters sharing events/news in a particular area.\n\n## What I did\n- Scraped 765 issues of the Naptown Scoop, a local newsletter in Annapolis, MD making $300k off ads with 21k subscribers\n- Identified and classified every advertiser in every issue\n\n## What I found\n- There were 210 total advertisers across 4 years.\n- The most common advertiser categories were in food &amp; dining, media &amp; news, non-profits, retail &amp; shopping, and home services.\n\n### However...\n- The most common advertiser categories *for the top advertising spot* were in real estate, medical &amp; healthcare, and financial services.\n\n### What characterizes those advertisers?\n- High Customer LTV\n- Local-decision making\n- Trust based industries\n\nBut what really surprised me?\n\nJust **5 advertisers accounted for over 50%** of the top advertising spot across the Naptown Scoop's whole history.\n\nThe broad lesson, I believe, is the following:\n\nIf your newsletter is driven by ad revenue, start backwards.\n\n1. Define your ideal advertisers.\n2. Acquire an audience with *those* advertisers in mind.\n3. Create content which keeps that audience engaged.\n\nA few linchpin advertisers will drive most of your revenue.\n\nWhat I can share here on Reddit is limited since I can't embed images/javascript - I created several interactive graphs in [the full article](https://contentquant.io/articles/naptown-scoop-01/).\n\nHope this is useful!",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 333,
    "downs": 0,
    "created_utc": 1735064140.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.193153393003422
  },
  {
    "score": 336,
    "title": "Going Public! $120M in revenue so far, now I’m taking my company public and invite you to ride along…",
    "selftext": "Hello Reddit! I'm the founder of Rally - the creators of the bus rideshare. We’re the Uber of buses, a virtual bus company, and mass mobility as a service.\n\nWe have 2 services: [Rally](https://rally.co/), for popup transportation to events; [OurBus](https://www.ourbus.com/) for regularly scheduled intercity travel.\n\n**We’ll move our 3 millionth customer this year and reach $40M+ of annual revenue.** We got here by raising millions from angel investors, venture capital, accelerators, and strategic investors.\n\nI went full time with the company in 2015 after raising my first round of capital. But I actually started this as a side project before that with the help of the Reddit community. If you want to verify, you can see that my earliest posts are promoting the first bus trip.\n\nI’d be happy to explain more about the business and share the history of building the company with you, but I'm really here today because I thought this would be a good time to start a ride along for the next phase of growth - **potentially taking the company public.**\n\nI've learned a lot about the process of going from a private to a public company in exploration of this next step. It has been difficult as there's not a lot of people speaking about going public in an accessible way. I wish there were more entrepreneurs talking about it like they do so many other aspects of the business building process. I’d like to change that and hopefully help others while doing so.\n\n**I want to livestream the journey.** Going public is an opaque process. With your help I think we can change that. Let’s make this fun with transparency on the decision making, documenting the procedural steps, facing the challenges, all the way to the ringing of the bell on listing day. And I promise to do so in a very open and honest way.\n\nI'd really like to know if this meta story about going public is interesting to this community. If so, I’ll write more posts that answer questions like:\n\nWhat does going public mean exactly?\n\nWhy go public instead of raising private capital?\n\nHow if the IPO market is dead?\n\nWho is this guy again?\n\nThese are my thoughts to start, but I trust you all will come up with a lot more questions along the way.\n\n**Are you interested in knowing more?** If you want to follow along please let me know with an upvote and/or a comment. This is certainly a big and scary step so your curiosity would give me a lot of encouragement.\n\n**Disclaimer:** This post is intended for educational and informational purposes only. It is not an offer to sell or a solicitation of an offer to buy any securities. Our potential plans to go public are subject to many uncertainties and no final decisions have been made.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 336,
    "downs": 0,
    "created_utc": 1722435311.0,
    "media": null,
    "is_video": false,
    "num_comments": 160,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.336042838887264
  },
  {
    "score": 317,
    "title": "How I make €5k/month with Instagram pages - AMA",
    "selftext": "In the summer of 2023 I started an Instagram page about the city where I live. At first it was just for fun, but it grew very quickly. After a few months, I reached 40K followers, and now the page has 180K followers. It is one of the biggest Instagram pages for my city.\n\nAs the page grew, I began working with restaurants and other tourism related businesses like hotels.\n\nThey paid me for promotions, and some became clients who I sold ad placements on my pages. This helped me make a good semi passive income, even while I was still in high school.\n\nSince this model worked well, I tried the same method for other popular cities in Europe. I created three new pages last spring. One page now has 120k followers, and the other two have 60k each.\n\nNow, I faced a problem. How could I make promotional videos for restaurants in other cities that are far away from me? I started looking for UGC creators who live in those cities.\n\nI pay them to visit the restaurants and create the videos in exchange for free food at the restaurants. These pages together make me €5k/month. (if you are from NYC, Los Angeles, Amsterdam, Vienna or Rome send me a dm and work with me haha)\n\nTo make this work, I use a tool that automatically sends a free travel guide to people who comment a keyword under my posts.\n\nThis brings me more engagement and leads that is really important to go viral on Instagram these days. I get 100-120 leads every day from each page. I sell tourist services like tours and apartment rentals, making about €1.6K/month from this one page alone.\n\nI also manage social media and run a lead generation agency for tattoo shops, barber shops and HVAC businesses, using similar strategies I apply on my travel pages. This brings me another €1K/month.\n\nNow at 19 years old, I make €7k/month in total from Instagram while I just recently graduated high school.\n\nLet me know if you have any questions! 😊",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 317,
    "downs": 0,
    "created_utc": 1754469834.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.243123462563545
  },
  {
    "score": 310,
    "title": "How we organically scaled an ecommerce skincare brand from $2000 to $48000/month within 8 months",
    "selftext": "Hello Redditors, just wanted to share a recent success story of a skincare brand that we worked with. \nWhen the owner first approached us for marketing, she was losing money on paid ads despite having high-quality products developed by a talented dermatologist. Business’s online presence was a mess, and the website wasn’t communicating brand’s offerings in a convincing manner. I understand that the humble beginnings of this venture might be relatable for a lot of you and I hope you guys will be able to find immense value through this post. \n\nAfter our initial market research we found that there is genuine demand in the market for their products but the trust factor is missing. When we found that the owner herself is a dermatologist, we proposed that we can rally the brand behind her professional authority instead of draining money on paid ads.     \n\nHere’s how we did it: \n\nWhat really changed things for them was our approach of making social media and SEO work together instead of treating them as separate channels. In this strategy, social content feeds SEO performance, and SEO research informs social content creation. Since sometime, we have been noticing that google is paying way more attention to social signals, viral TikToks and Reels are showing up in search results. This means that if you are creating good content on social media, you’ll not only make sales through views on that particular platform(which dies down after a few days) , but your content will get indexed on google as well creating a never ending stream of sales. This works really well for service businesses too - we've seen accountants, lawyers, and consultants use the same principles to grow their client base in addition to ads. We still chose traditional SEO with social media for this brand because there was decent search volume for relevant keywords. \n\nFirst things first - we had to fix their website. It was a technical nightmare. Won't bore you guys with the specifics but here are some key technical changes that we made - We had to rebuild the whole thing from design perspective, got the page load speed down from 4.2 seconds to 1.8 seconds, fixed their site architecture (they had product pages competing with category pages), implemented proper canonicals to fix duplicate content issues, and added relevant schema markup for their products and reviews. Small thing, but we also compressed all their product images - they were loading 4MB images on mobile which was killing their Core Web Vitals scores. Don't sleep on technical SEO - it's boring but it is extremely important. Even if you are planning to do seo yourself, make sure to generate a technical seo report from several free tools available online and fix the issues before moving ahead. \n\nFor our keyword research, we didn't just use the usual tools. We dug into Reddit, Quora, and skincare forums to find the actual language people use when talking about skin problems. Direct keywords like, \"anti-aging cream\" get a ton of searches, but the competition is insane. Instead, we found long-tail opportunities around specific ingredients and skin concerns. Like, \"fungal acne safe moisturizer\" has decent search volume but way lower competition, and the conversion intent is super high. This works in literally any industry - find the specific language your customers use and optimize for those phrases instead of the obvious head terms everyone else is fighting over.\nWe then turned SEO insights into social-first content. So when we saw people searching for \"niacinamide benefits for skin,\" we didn't just write a blog post. We had the founder make a quick and engaging reel explaining the science in a way that didn't feel like a lecture. People were searching for this info anyway - we just gave it to them in a format they'd actually enjoy consuming.\n\nA practical example of our approach: We identified \"bakuchiol vs retinol\" as a high-potential keyword. We created:\nA detailed, scientifically-backed blog post comparing the ingredients\nA series of short-form comparison reels with product applications\nAn infographic breaking down the benefits of each that went viral on Pinterest\nA downloadable skincare guide for sensitive skin featuring both ingredients that worked a lead magnet\n\nThe result - The blog post ranked in the top 3 for the target keyword, while the social signals from the viral content further boosted their search rankings. Meanwhile, their social reach expanded because the content was backed by solid SEO research showing what people actually wanted to know.\n\nFor social, we used some of our go-to strategies that always seem to work but still aren’t widely used especially by new creators. For instance, we had the founder film her videos during \"golden hour\" because we noticed that soft, natural lighting boosted watch times by 22%. We also tested different hooks and found that starting with something like, “Here's something your dermatologist probably isn't telling you about...\" doubled engagement compared to other intros. \n\nWe also experimented with what we call \"content sandwiching\" - we'd post a teaser on TikTok that ends with \"full routine on Instagram,\" then post a slightly longer version on Instagram that says \"full guide on our website.\" This created this perfect funnel that moved people across platforms and eventually to their store. The engagement metrics were great, with about 18% of TikTok viewers actually making it all the way to the website. I've seen this work for all kinds of businesses - from real estate agents to coffee shops to software companies. I won't suggest doing this a lot though as it might create frustration among followers. We usually use this strategy when we already have a decent following on all the platforms so that the final traffic which reaches the website is actually worth it. Also, if you have been posting valuable content consistently, your followers are curious to find additional platforms for connecting with you and  don’t mind following a few extra steps for supporting your business.\n\nAnother strategy that worked really well was intentionally leaving out small details in reels that people would ask about in comments, then the founder would reply with separate reels as responses. Instagram's algorithm LOVES this kind of engagement, and it also gave us ideas for future content based on what people were asking.\n\nWe also tried something a little different with their content calendar which has wired well for us in the past as well. Instead of sticking to the usual approach of posting at “optimal times,” we grouped content around specific skin concerns and released it all at once. For example, we’d create five videos about acne and post them within 2-3 days. This made the algorithm take notice and treat the brand as an authority on that topic. Almost immediately, we’d see a big jump in followers who were  interested in acne solutions.\n\n\nThis is a sustainable way of growing followers since the content clusters belong to similar categories, the audience attracted by the first topic stays interested as we explore more topics. After a few days, we switch to another topic, like dry skin or anti-aging but we keep adding interesting content related to previous content clusters from time to time. For instance, after the initial acne videos, we’d follow up with more related content, like “best products for acne-prone skin” or “how to prevent breakouts.” This kept the momentum going and maintained interest over time. \n\nFor the first couple months, we focused mostly on creating amazing content and building free backlinks. As the revenue and profits started increasing, we ramped up our link building to include some paid backlinks as well. Basically don't get too caught up in advanced link building when you're starting out (if you don’t have the budget) - for most niches, the basics still work great if your content is actually good.\n\nOur content strategy had four main pillars: Educational stuff (science behind ingredients, common skin care myths), Before &amp; After transformations, Behind-the-Scenes content (showing how products are made), and some promotional stuff (but super minimal). The educational content consistently crushed it compared to other categories. We've found this content mix works for almost any business - just adapt the pillars to your industry.\n\nThe most important question you should ask yourself before posting anything is super simple: \"If this showed up in my feed and it wasn't from my brand, will I actually watch it?\" If the answer isn't an immediate \"hell yes,\" scrap it and look for something else. This one question probably saved us from posting tons of mediocre content that would've just been ignored for previous clients as well.\n\nAfter continuous efforts for 8 months, their organic traffic has now gone from practically nothing (1,200 visitors) to 37,000 monthly visitors. Their rankings have improved from ranking for just 12 keywords to over 780 in the top 10 positions. Their conversion rates have hit 3.8% from organic traffic (which is pretty good e-commerce), and their social following on Instagram went from 2,300 to 68,000, TikTok from zero to 42,000. \n\nWhen the owner first approached us, profitability wasn’t her immediate concern. With so much competition online, her primary goal was to scale revenues first. She planned to focus on profitability later by introducing upselling and bundle-selling strategies once the brand had gained traction. But because we focused on organic growth methods, the business became profitable right from the start. \n\nThe brand is projected to hit $100K/month by third quarter and we're now working on phase 2 of our strategy - expanding into YouTube with more in-depth content, building an interactive skin type quiz for the website which will act as a lead magnet, targeting more keywords for SEO, launching email campaigns for retargeting and the owner has decided to reinvest a small part of profits into paid ads now so we are working on a ppc strategy as well. \n\nMarketing strategies should be designed with profitability as a core goal from the beginning. This can give businesses a significant advantage - It ensures sustainability and provides the financial flexibility to experiment and scale faster in the long run.\n\nThankyou For Reading!",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 310,
    "downs": 0,
    "created_utc": 1741005661.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.246799610768547
  },
  {
    "score": 311,
    "title": "I made $10k in 1 month selling a course at 9$",
    "selftext": "For years I have been targeted by facebook ads selling business courses on absolutely everything.  \n\n\nI have always wondered : are they really making money with these ads ?  \n\n\nAt the beginning of the year, I saw there was a high demand for content on ChatGPT, especially beginner content.  \n\n\nSo I launched a course using Facebook Ads as my only acquisition channel.  \n\n\n**Course &amp; Pricing strategy :**\n\n\\-Main product (a 1 hour video course) : Learn the basics of ChatGPT for entrepreneurs (9$)  \n\\- First upsell (a 10 page PDF file) : 10 business idea to launch with ChatGPT (19$)  \n\\- Second upsell (a 20 page PDF file) : The A to Z strategy to launch your business with ChatGPT today (39$)\n\n&amp;#x200B;\n\n**Key figures :**\n\n\\- 50% of my clients were buying my first upsell  \n\\- Average basket : 25$- CAC for the first week : 10$  \n\\- CAC for the second week : 16$  \n\\- CAC for the third week : 21$  \n\\- CAC for the fourth week : 28$  \n\n\n**Revenue of the first week :**  \n\\- Day 1 : 248 dollars  \n\\- Day 2 : 209 dollars  \n\\- Day 3 : 400 dollars  \n\\- Day 4 : 220 dollars  \n\\- Day 5 : 649 dollars  \n\\- Day 6 : 609 dollars  \n\\- Day 7 : 789 dollars  \n\n\nThat was an amazing experience, I got hundreds of clients, most of them were amazed by the content for only 9$. It feels so good !  \n\n\nUpsell are so powerful, I could not believe it.  \n\n\nUnfortunately, I failed at scaling the ads and could not stayed profitable so I stopped everything.  \n\n\nIf you have a course in mind, launch it, Facebook Ads is still so powerful to find clients for your product,  \n\n\nIf you have any advice on scaling Ads, I would love some feedback and if you have question, please do not hesitate !",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 311,
    "downs": 0,
    "created_utc": 1692887145.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.287200223546283
  },
  {
    "score": 305,
    "title": "After 7 failed side projects in 2024 and 2025, I finally figured out the real reason most of us never make it",
    "selftext": "I have wasted the last 18 months starting and abandoning projects.  \n2025 was going to be the same until I had a stupidly obvious realization that changed everything.The difference between people who make it and people who dont isnt:\n\n* Better ideas\n* More money\n* Knowing the right framework\n* Being a 10x engineer\n\nIt’s literally just this:\n\n  \nThey finish the ugly v1 and ship it while the rest of us are still polishing the landing page.\n\nThat’s it. That’s the whole cheat code.\n\nOnce I accepted my first version would suck, everything became 10x easier. Stopped caring about perfect design, perfect name, perfect tech stack. Just shipped something that barely worked and fixed it in public. If you are stuck right now, do this today:\n\n1. Pick your dumbest, most boring idea\n2. Give yourself exactly 14 days\n3. Ship it even if you hate it\n\nYou will either make something people want or you will finally kill the idea and move on. \n\nEither way you win. Currently on weekend #3 of forcing myself to follow my own advice. Feels terrifying. Feels amazing.\n\nWho’s with me?",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 305,
    "downs": 0,
    "created_utc": 1764170837.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.155128352673438
  },
  {
    "score": 296,
    "title": "How I Made $293k in Six Months with Legal Leads on Facebook Ads",
    "selftext": "Hey Reddit, so I ran this affiliate thing for legal leads and pulled in $293,890 over six months. Took some testing, but it worked out.\n\nHere’s how it went down.I used paid Facebook ads—Facebook, Instagram, all their placements. Spent $25k on one account, $107k on another, about $132k total.\n\nThat got me 2,532 leads at $150 each and 255 calls worth $31,340.\n\nRevenue hit $293k, though some leads went unpaid if they’d been submitted by another publisher in the last 30-60 days.\n\nSold everything to an aggregator, not direct to lawyers.\n\nThe big shift was going Spanish instead of English.\n\nEnglish market’s crowded—everyone’s doing it. Spanish had less competition, cheaper ads, better conversion rates. Cost per lead dropped from $70 to around $50, and the leads were solid, closing more deals.\n\nMade a real difference.\n\nWhat worked? Manual bidding and AI UGC ads\n\nManual bidding kept my costs steady—no surprises. AI for user-generated content cut ad production costs from $150 a pop to $15, and production went from days to maybe an hour with edits.\n\nLead quality and CPL stayed the same as human-made ads. I’ve been playing with AI for like 10 years, so it was an easy call.\n\nSetup was simple: targeted Spanish speakers on Facebook, ran Spanish UGC ads, built a Spanish landing page.\n\nConversion rates went up, costs went down. If I had one tip, it’d be this: look at less competitive markets. Switching languages can flip your costs if you’re smart about it. Test manual bids too—saves you cash.\n\nThat’s it. Questions, let me know.  \n",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 296,
    "downs": 0,
    "created_utc": 1742281482.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.167056535198172
  },
  {
    "score": 293,
    "title": "Forget unicorns. $10K MRR solo feels better than $2M seed and stress",
    "selftext": "I’m a founder of a SaaS company, which I built solo, bootstrapped, no investors. It scrapes data from social platforms and maps. Simple tool, solves a real problem and makes money from day one.\n\nAnd honestly, the more I build, the more I believe micro SaaS &gt; venture-backed startups. I’ve seen too many stories like \"raised $700K pre-seed → burned through it → now stressed out trying to raise again.\" Meanwhile, I just fix bugs, ship small features, talk to customers and grow at my own pace.\n\nWith micro SaaS, you can get to $5K–$20K MRR with high margins, no pressure and total control over your time. You don’t need a team of 20 or a slide deck for every decision. Just a useful product, a few customers who pay and a feedback loop that actually works.\n\nWould love to hear from others building solo or small- how’s it going for you? And if you’re still debating startup vs micro SaaS, happy to share more behind the scenes if helpful\n\nP.S. many asked for a link so I decided to share it here: [https://socleads.com](https://socleads.com/)",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 293,
    "downs": 0,
    "created_utc": 1744296892.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.170596556033941
  },
  {
    "score": 289,
    "title": "How much YouTube pays me for 1,000,000 view videos (Shorts vs Long Form)",
    "selftext": "Hi,\n\nI’m a “creator-preneur” of sorts documenting designing and launching my own product \n\nthis is how much money YouTube paid me for getting 1,000,000 views on a “long form” video vs getting 1,000,000 views on a YouTube Short \n\n**1,000,000 view YouTube Short** \n\nWhile the video might say 1,000,000 views - youtube does not pay you for all of those views. For YouTube Shorts it only pays you from a different metric – *Engaged Views* \n\n*Engaged views* \\- How many times viewers stayed to watch past the initial seconds, not including any loops. This metric only applies to Shorts.\n\nRoughly on a one million view YouTube Short, I would expect 650,000 of those to be classified as *engaged views*. (for me personally)\n\nSo YouTube Shorts pays me based on “Revenue per 1K engaged views”\n\nMy rate is roughly $0.25 per 1,000 engaged views.\n\n650 x $0.25 = $**162.50**\n\n**1,000,000 Standard YouTube Video**\n\nEngaged views only exist for Shorts so Long Form YouTube Revenue is just calculated based on regular RPM (Revenue Per 1,000 views). \n\nMy Rate for Long Form YouTube is roughly $4.50 per 1,000 Views \n\n1,000 x $4.60 = **$4,600.00**\n\n**How is this Magical RPM Number Calculated?** \n\nWellll… many factors go into it\n\n* Video Content Type \n   * As someone who makes business-ey, product design content, mine is higher than average \n   * The highest earning is typically finance and the lowest being more general entertainment (prank channel etc.) \n* Video Length \n   * My videos are typically longer than 8 minutes, which is the minimum required length to have ads in the middle of videos \n   * the longer the video, the more ads in your video, the more revenue YouTube can generate off your video = more earnings for you\n* General Engagement (like, comments, shares, and how the effective ads on your videos are to viewers)\n   * The better your videos perform for advertisers, the higher youtube can charge for ads placed on your video - and YouTube passes on some of that extra revenue to you.\n* Cursing or Non Ad friendly content would nuke your RPM because advertisers don’t want to place ads on those videos \n\nThe “algorithm” swirls all those factors around and spits out an RPM number. \n\n\\*also these are rough numbers for me and change on a video by video basis\n\nThanks for reading :)",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 289,
    "downs": 0,
    "created_utc": 1758919883.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9814988599324534
  },
  {
    "score": 290,
    "title": "Stay up all fuc**ng night",
    "selftext": "I’m 25. Still young, still figuring stuff out, but I know one thing for sure: I’m not about to live a life someone else designed for me. I look around and see friends and family stuck in a world they built for themselves. They hate their alarms, hate every extra minute at work, and spend their weeks just counting down to Friday so they can hit a bar and drink away the stress.\n\nAnd yet, somehow, they feel the need to tell *me* how to live. *“Get a stable job”* they say. *“Send your résumé to some soul-sucking company with windowless offices”.* But why the hell would I do that? Why would I sign up for a life they obviously hate?\n\n**Whoa, whoa, slow down**, take your hands off that keyboard! Don’t go typing out some snarky comment just yet. Let me explain. No, I’m not some spoiled rich kid. No, I don’t have a trust fund or some wealthy uncle hooking me up. I pay my own way. I know what it’s like to grind, to make sacrifices. I get that nothing in this world comes for free.\n\nBut here’s the thing I can’t shake: *how many lives do we get?* **One**. Not one and a half. Not two. Just one. So why the hell would I keep putting my dreams on hold—waiting for summer, for vacation days, for the next weekend? Why wait for the “perfect time” that might never come?\n\nI’ve decided to start now. Tonight, if I have to. Yeah, I’ll lose sleep, but not over some boring project or a dead-end job. I’m losing sleep over something bigger—a passion, a vision, a plan for my life that’s crystal clear in my head. A dream that just needs me to make it real.\n\nSo if you’ve read this far, wish me luck. And if you’re anything like me, grab that thing you love and make it happen. And if it doesn’t work out? Screw it—start again!",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 290,
    "downs": 0,
    "created_utc": 1734553487.0,
    "media": null,
    "is_video": false,
    "num_comments": 153,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.2101533494041385
  },
  {
    "score": 269,
    "title": "Vent… Don’t make the same mistakes I’ve made.",
    "selftext": "I’ve come to realize that luck was a way bigger factor than I previously anticipated... I had my first e-commerce store (pet niche) peak 50k monthly sales (around 12k profit., yet it was only from the pandemic bubble. I failed to adjust or outsource my work fast enough and it quickly failed. I tried ordering a product with shipping crates in bulk instead of dropship, and my margins tanked hard. \n\nMy second store I was able to solve a problem.. I noticed people’s glasses were fogging up when they wore masks and noticed that people rarely used anti fog products. I created a small brand of anti fog wipes, decided to order again bulk instead of dropship and fulfill myself. This was doing about 5-10k in monthly sales then the mask mandates started being lifted everywhere. Once again I failed to adjust, and my store tanked quickly. \n\nI stopped e-commerce for awhile and pursued Web3. Yet another bubble where the money I was making was most likely some of easiest times in recent history. It started slow but by mid to late 2021 I was clearing 10-15k profit a month from trading…. Instead of learning savings habits I was fucking stupid and spent a lot of money on vacations and financed a Mercedes AMG… Once crypto crashed last year I started eating away at my savings quickly — trying to live this stupid faux lifestyle. Once again, I failed to adjust… and once again, I realize now that luck was a much bigger factor. \n\n\nMy realization: I am not “him”. I’m a 26 year old who left a comfortable government job 3 years ago (even if I hated it) with benefits making 70k a year,  to try and pursue an unsustainable business. I was just lucky. My ego is atrocious, and my narcissism has caused me to make repeatedly bad decisions. Im going back to school this year to pursue a masters in business analytics, hopefully this will restart my motivation and turn me in the right direction. \n\nDon’t be like me. Don’t rush into quitting a comfortable career just because you have a few strong months in a row. Don’t try and do everything yourself, outsource help when you can afford to. Learn to budget properly, don’t be fooled about big deposits into your account when you have business expenses to pay. Create your own luck, but don’t rely on it. If you start making good money, don’t immediately start buying expensive things to show off. No one cares, you have to really want it yourself. Learn to invest, and not into extremely volatile shit. Don’t make the same mistakes I made, you will waste your potential\n\nEdit: This felt good to get off my chest...and to read all the supportive comments and have others share their experiences/stories was amazing. Thank you, /r/EntrepreneurRideAlong",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 269,
    "downs": 0,
    "created_utc": 1683080757.0,
    "media": null,
    "is_video": false,
    "num_comments": 113,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.179816189827224
  },
  {
    "score": 264,
    "title": "How Liquid Death Went From a \"dumb idea\" to a $700Million Company",
    "selftext": "In 2009, when Mike Cessario was attending a concert sponsored by Monster Energy, he noticed that the cans given to the band were filled with water and not the drink!\n\nThis got him wondering... *why aren’t there more healthy products that still have funny, cool, irreverent branding?*\n\nFast forward to 2019, Mike launched [Liquid Death](https://en.wikipedia.org/wiki/Liquid_Death) with the mission to make H2O cool. And now, it's worth $700 million!\n\n# Implement The Dumbest Idea 😛\n\nMark set out to create the coolest water brand ever. \n\nHis strategy was counterintuitive. He started by asking: What’s the dumbest possible idea?\n\nBut why not aim for a smart idea instead? Well, the traditional brands must’ve exhausted all those.\n\n* The name—&gt; Liquid Death\n* The packaging—&gt; beer can\n* the slogan—&gt; murder your thirst\n* the logo—&gt; a skull\n\n&gt;“If someone I knew saw that in a store, I’m pretty sure they’re going to have to pick that up and be like, ‘What is this?’” he said. “And once someone picks something up, you’ve basically won.”\n\n### Sanity Check\n\nWhen Mark planned to launch Liquid Death, everyone was telling him that the idea was dumb, and investors weren’t willing to fund him.\n\nHe needed a way to show them the potential of the product. So he spent $1.5k shooting a commercial and $3k in Facebook ads and within a couple of months, the ad had more than 3 million views and the page attracted 100,000 followers—more than Aqua Fina had at the time!\n\nThanks to the success of this marketing campaign, Mark finally secured $1.6 million in funding and launched the brand officially.\n\n### Sell to Everyone\n\nAt first, Liquid Death’s customers were partygoers. It was available at bars and tattoo parlors.\n\n&gt;“We wanted to give people permission to participate in this cool rock-and-roll brand without needing to consume something gross.”\n\nBut in order to expand, Mark had to turn the brand into a status symbol. He did this through several viral campaigns:\n\n* Collaborating with Tony Hawk to sell skateboards printed with paint infused with his blood.\n* Creating a heavy metal album using the hateful comments they received.\n* Betting $50k on the underdog of Super Bowl LVI and threatening to send a witch to jinx their opponent.\n\nAnd soon, everyone wanted to buy Liquid Death and didn’t find it stupid to drink water from a beer can with a skull on it.\n\nIt is currently the second best-selling mineral water on Amazon and the fastest-selling at Whole Foods.\n\nWith 60K locations in the US, they're projecting $260 million in 2023 sales.\n\n Every Monday, I share bite-sized startup case studies every Monday. [Subscribe to receive the next one in your inbox](https://www.wtdr.xyz/)",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 264,
    "downs": 0,
    "created_utc": 1675105115.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8294448728862855
  },
  {
    "score": 260,
    "title": "Watching a client lose half his company in a divorce made me rethink how I protect mine",
    "selftext": "I’ve been helping a client grow his business for a few years. He’s smart, hardworking, and built everything from nothing but now he’s going through a divorce, and it’s brutal. Because he never set clear lines between personal and business assets, his ex’s lawyers are now arguing she’s entitled to half of the company. He wasn’t trying to be shady or hide money just never thought he’d need that kind of protection. But seeing how something personal can completely shake up a business has been a real wake-up call for me. It made me realize how little we talk about personal risk as entrepreneurs. We spend all our energy on taxes, growth, and clients, but forget that one major life event can undo everything we’ve built.   \nHave any of you taken steps to protect your business if something personal goes wrong? Would love to hear what kind of safeguards you’ve set up legally or otherwise.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 260,
    "downs": 0,
    "created_utc": 1760618459.0,
    "media": null,
    "is_video": false,
    "num_comments": 131,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1444274729412065
  },
  {
    "score": 254,
    "title": "I left my job in banking to start a company 18 months ago. We now do multi-six-figures in revenue and have a full-time team, but here’s what I wish someone would have told me:",
    "selftext": "# The grass is greenest where you water it\n\nFor the first few months, I was looking at other people.\n\n\\&gt; Wondering how they got so lucky.  \n\\&gt; Jealous of their many opportunities.  \n\\&gt; Thinking the grass was greener.  \n\n\nBut now 18 months later I realise the truth…I am in 100% control of my life.  \n\n\nAnd the grass can be green wherever you want it to be, all it requires is that you put in the work, and water it.\n\n# If you don’t know how to cook, the chef owns the restaurant.\n\nI read this quote recently and it couldn't have resonated with me more.  \n\n\nYou MUST be an expert in your craft.  \n\n\nAlthough you can hire team members with specific skills (And they will add a tonne of value to the business).  \nTo own an amazing restaurant you have to know how to cook.  \n\n\nWithout the underlying expertise, you will not have the ability to steer the ship in the right direction or:  \n\n\n\\&gt; Know where the gaps lie within your market.  \n\\&gt; Know what potential customers want.  \n\\&gt; Know how to innovate.  \n\n\nThe more you develop your own skillset, the more your company will thrive.  \n\n\nWhat’s something you wish you’d been told at the start of your business?",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 254,
    "downs": 0,
    "created_utc": 1689581079.0,
    "media": null,
    "is_video": false,
    "num_comments": 113,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.0349926061021915
  },
  {
    "score": 246,
    "title": "From a sport no one was playing in the 80s to a $45.2 Million sport in 2023 - Here's what we can learn from Spikeball",
    "selftext": "In the 1980s a sport called Round Net launched. It flopped. In 2008, Chris Ruder acquired the brand and relaunched it (aided by a Shark Tank appearance). The first year, he did $10,882 in revenue. Now they're doing $45M.\n\nHere's Spikeball in 4 bullet points:\n\n&amp;#x200B;\n\n* In 2003, Ruder and his friends were on the beach in Kauai, Hawaii when he pulled out his old round net. People walking by kept asking him: What are you playing? How do you play? Where can I get it?\n* When he arrived home he started research Round Net and discovered the game's trademark had expired and there was no patent on it. He acquired the tradename and filed for a patent.\n* In 2008, Spikeball.com launched and did about $4K in sales.\n* Ruder ran it as a side business for 5 years. In 2013, he hit $1 million in annual revenue and only then quit his job to pursue this full-time.\n\n# Notes\n\n\\- To better understand his market, he'd hit up every customer and had them do a survey. This taught him his main demographics where Ultimate Frisbee Players, PE Teachers, and kids from Youth Groups.\n\n\\- To drum up traffic, he started DMing ultimate frisbee players and youth group directors on Facebook and Twitter, offering free sets to anyone with a large following in exchange for photos of them playing SpikeBall.\n\n\\- In order to drum up demand for a new sport like this, you'll need mass marketing. But how do you do that without a budget? In 2015, Ruder went on Shark Tank (and got a $500K deal at 20% equity from Daymond John, which he turned down). The exposure led to Spikeball finding mainstream success and growing every year since.\n\n\\- A core driver is word of mouth. People play it in the park, on the beach, or on a college campus, and that exposes new people to the sport. A sport that you'd have to do in a special type of building wouldn't have that benefit.\n\n&amp;#x200B;\n\n**Enjoyed this post?** [**Here's**](https://rjyoungling.substack.com/) **where you can find more content like this. I write a newsletter for solopreneurs. Every Monday at 15:00 Amsterdam time.**",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 246,
    "downs": 0,
    "created_utc": 1695309387.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8062759689307755
  },
  {
    "score": 249,
    "title": "10 Years Later and Over $20 million in Sales, Here are 10ish Things I wish I Knew When I Started out!",
    "selftext": "Quick post but hoping to at least save some of you from some of the crazy mistakes new entrepreneurs make.\n\nStuff that I've done:\n\nHow I built my service business to [$20 million in sales ](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1ase92j/from_an_idea_to_replacing_my_fulltime_salary_in_4/)\n\nHow I built Wet shave Club to [$100,000 in 6 months](https://www.reddit.com/r/Entrepreneur/comments/2h1mlt/the_inner_workings_of_a_subscription_box_company/)\n\nHow I built my software company to [$2 million in ARR here](https://www.reddit.com/r/SaaS/comments/owjc4m/hola_peeps_i_had_a_multimillion_saas_exit_built_a/)\n\nFor this post these are some things that have worked for me.  ME! If they don't vibe with how you work, so be it, just sharing my take.  &lt;insert shrug&gt;\n\nHere goes:\n\n1. If everything is perfect by the time you launch, you've launched too late.  Stop fucking around.\n2. Being cheap often ends up being the most expensive choice you make for your business.  You either pay upfront or you pay more on the backend, but you're going to pay.\n3. The more research and planning you do to prepare yourself for launching your business, the less likely you are to ever launch.\n4. There will come a point where growing your business will require you to fire a bunch of customers. It’s a glorious thing.\n5. All things being equal, the more options you offer customers, the less likely they are to make a purchase.  Offer fewer choices.\n6. Build businesses that don’t scale. You can take care of yourself and your family with a simple “but will it scale?” business, while you wait for your unicorn (which most probably isn't happening anyhow).\n7. A $100 customer isn’t 10 times the effort to find as a $10 customer.  Could as well up the value and price with more confidence.\n8. Your “About Me” page isn’t really about you. It should be renamed the “Can I create enough trust to overcome objections” page.  Write from that angle.\n9. Run ads to Sales page? Nah!  Run ads to content, link from content to sales page. Win!!!\n10. You can always find a list of things you need to work through first before opening the doors to customers.  And I’m here to say, that list is almost always b.s. You can't win from the sidelines. Focus on checkout flow, launch, and fix the rest of the stuff as you go.\n\nBONUS:\n\n11. Best way to validate a business idea is to find another successful company doing the same thing. They've validated it for you. The more of those folks I find, the better I feel about the idea. (Which is kinda the opposite of how new entrepreneurs think)\n\nSee my [real time transparent Stripe revenue for my new projects ](https://indiepa.ge/rohangilkes)and sign up to follow along as I build. ",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 249,
    "downs": 0,
    "created_utc": 1724082379.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9824250108400467
  },
  {
    "score": 250,
    "title": "My first saas project generated $1.9k revenue in just over a week",
    "selftext": "I've launched a few apps in the last couple weeks, but this is the first one I monetized. It's a query-based web app called Unriddle ([unriddle.ai](https://unriddle.ai/)), where users can interact with documents via GPT-4. It makes it easy to understand complex docs like research papers and textbooks as the AI can retrieve info and summarize/simplify content.\n\nI made it almost entirely using ChatGPT. It gave me a starting point for most of the components, and then I built them out and made them look better. Pretty much every time I sit down to code these days I'm starting with ChatGPT, especially if I'm building a component/flow from scratch.\n\nIn terms of marketing, I'm sharing regular updates on Twitter, posting in grad student communities every few days (Discord and Reddit), and when I first launched I sent a link to \\~1k users from another similar product I built. I'm trying to think about ways to engage more students, so I'm all ears if anyone has any ideas.\n\nAnyways I thought it would be encouraging to share this little win for anyone thinking about hacking on some side projects :)",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 250,
    "downs": 0,
    "created_utc": 1683556261.0,
    "media": null,
    "is_video": false,
    "num_comments": 110,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.112335210874367
  },
  {
    "score": 243,
    "title": "I made a tool to put GPT-4 on any textbox on the internet to simplify tasks such as email writing, content writing, customer support chats, localizing chats, Google sheet formula, etc. And made around $400 in 24 hours.",
    "selftext": "I am Nithur. I build in public on Twitter. Two days ago, I had a crazy idea to put GPT-4 or any model (such as trained on your company docs, guides, etc) on every textbox on the internet. So, I started coding it quickly and challenged myself to launch it by night on Twitter. \n\nEverything went as planned and I was able to make the initial version work by that night. I launched it on Twitter. It became mildly viral on Twitter. And was seen by 52,000 people. It still dragging in more views.\n\nHere is the whole Twitter thread:  https://twitter.com/nithurM/status/1636024450960302080?s=20 \n\nThe app works on literally any site. Some use cases: answering customer support chat straight on your favorite systems such as Zendesk, localizing any message, generating google sheet formulas straight on Google sheet, writing emails straight on your favorite email clients, writing posts on Linkedin, Facebook, Twitter, writing MySQL queries on natural language, etc.\n\nI planned to sell a lifetime license for early birds at $9.99. It brought me $400 worth of sales in the first 24 hours. And then I increased the price to $19. \n\nI am planning to increase the price to $79 as the final price. But before that, I'll experiment with various pricing. I am only selling lifetime licenses. Your own the app forever. No monthly charges. If everything goes well, I'll write another post here. \n\nThank you.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 243,
    "downs": 0,
    "created_utc": 1679128079.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.111103075309041
  },
  {
    "score": 244,
    "title": "I FINALLY did it. I quit my 9-5.",
    "selftext": "I FINALLY did it. Today was my last meeting at my day job and it still feels surreal.\n\nFrom this moment on, I'm all in. Full-time entrepreneur. My main focus will be my MVP consultancy/agency.\n\nThe long nights after work, the weekends spent building instead of resting - they weren't easy. They were HARD. Working two full-time jobs left me exhausted, unfocused, and barely sleeping. I couldn't go on like this.\n\nBut looking back now? Worth it. All of it.\n\nNow I feel free.\n\nI'll be real - it's scary af. I have almost no runway, and doubts are creeping in. A voice in my head keeps asking \"Am I stupid?\"\n\nBut still... it feels like the right choice. Because deep down I believe in myself. I'm betting on myself and on my vision.\n\nI'm reaching for the stars. I'm ready.",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 244,
    "downs": 0,
    "created_utc": 1736182631.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.096375547221679
  },
  {
    "score": 236,
    "title": "Easiest money you've ever made?",
    "selftext": "I will start: before diving into entrepreneurship 8 years ago, I was working as a fullstack developer focused on e-com. \n\nI had quit my job and, while I was looking for a new opportunity, I'd take my time to just help people with simple technical questions in coding forums, Facebook groups, etc. I actually loved helping people and would just code a quick script or fix a small issue on their website free of charge. \n\nAfter doing this for a few months, I fixed a website of someone who ended up being a relatively famous youtuber in the e-com niche. I did this free of charge just out of kindness, I had no idea who he was. \n\nHe had a private course with 300+ students and, well, he recommended me to ALL of his students. I got like 200+ clients overnight who were paying me to code very simple stuff (simple for someone who was working with it daily, still a bit tricky for non-devs ofc).\n\nI made around $30K usd in a few weeks with fairly low effort and it helped me to invest in my first business.\n\nWhat is yours? ",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 236,
    "downs": 0,
    "created_utc": 1754841193.0,
    "media": null,
    "is_video": false,
    "num_comments": 89,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.0868696007297665
  },
  {
    "score": 227,
    "title": "The Riches Are In The Niches!",
    "selftext": "One thing I have learnt from sales and businesses is that small business owners will happily shell out for something that is saving time and making their lives easier even if they don’t immediately see a huge ROI. If it saves time, simplifies work flow, cuts down on stress or just gets rid of that one really annoying task they’re all in because at the end of the day, peace of mind and smoother operations are priceless.\n\nI’m reselling Ai Front Desk receptionists to mostly spas and massage therapy businesses and the wow factor most of the time is usually when I show them a demo and they see a “client” book an appointment through a quick phone call or text. The real value lies in showing them how the Ai makes their business efficient and smooth. \n\nPick a niche, understand their pain points, and show them how exactly you help them solve that pain point. Works way better than trying to explain with huge terms. \n\nCheers!",
    "subreddit": "EntrepreneurRideAlong",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 227,
    "downs": 0,
    "created_utc": 1744462125.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8843267753603214
  }
]