[
  {
    "score": 7673,
    "title": "My secret steps to becoming a millionaire",
    "selftext": "I see hundreds of post each week with people asking for the magic pill to become successful. I would sell this info for $99 but no one would buy it because there is really no secret to it. \n1. Worked 14 years (steady 9-5 w2 job)without a vacation or a off day. Literally missed 6 hours of work the day my son was born and another day when I had the swine flu. Saved money\n2. Picked a industry that created the most millionaires and spent every waking second learning as much as I could about the industry and all the different niches and verticals. (Real estate) \n3. Found the most successful people in my area and emailed them asking how I could provide value to them in exchange for learning and eventually having opportunities to be apart of deals. \n4. Obtained a real estate license and agreed to write offers for a group of investors, I would receive $750 at closing and credit the rest of my commission to the investors. Wrote thousands of offers and pocketed over $100k cash, credited close to a million to the investors. \n5. Learned what the investors looked for, who they used for lending and contractors. Started to buy my own properties and do joint ventures with the investors group. \n6. Found contractors in the service industry who were great operators but terrible at business. Bought into their companies and assembled a team to handle the backend. (Hvac, roofing, roll off dumpsters). \n7. Built a portfolio of 19 rental houses that I paid on average $125k for. When the market spiked I sold 14 of the properties for a average of $310k per unit. \n8. Paid off the 5 rental properties and that cash flow pays my living expenses. Dumped the rest of the money into a self strorage deal, and short term rentals. \nAt the age of 38 my net worth was north of 4 million and my monthly cash flow from all properties and businesses is over $20k a month with some months hitting $60k. It took 20 years and a lot of 80 work weeks to build “passive income”. \nLooking back I regret not spending time with my kids and family. Having money is nice but relationships, family, health, and memories is a lot better. \nThe more you make the more you spend. My life and problems are still similar to when I was paycheck to paycheck, I just have nicer cars, house, and am able to do whatever I want whenever I want. Which gets boring quicker than you would think. \nThe market has changed so much I no longer invest in real estate, have seen a lot of people over leverage and lose it all. \nHope this rant helps someone. Key point to take away is just find something and go all in, but also live your life and cherish your family, friends, health.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 7673,
    "downs": 0,
    "created_utc": 1696012946.0,
    "media": null,
    "is_video": false,
    "num_comments": 945,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.017967363063194
  },
  {
    "score": 5379,
    "title": "Any tips on successfully leveraging PR to jumpstart a new company?",
    "selftext": "I have an SaaS product in the tech space that was launched within the last two months. I built up an email list prior to launch, am running ads on various platforms and have some revenue coming in. However, my product is very niche and it’s hard to create look-a-like audiences for it.\r  \n\r  \nI want to switch up my strategy to get a much broader reach and I think PR is probably my best option for reaching as many business-oriented people in the tech scene as possible. \r  \n\r  \nAny suggestions on how to go about doing this? I am open to hiring a PR firm but afraid of partnering with the wrong one. Any green/red flags to look out for when searching?",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 5379,
    "downs": 0,
    "created_utc": 1692097635.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.417327269162361
  },
  {
    "score": 4963,
    "title": "So, I found out my employees don’t want what I want.",
    "selftext": "More than 12 years ago I became brainwashed by Gary V, Grant Cardone, and Tia Lopez. Night after night, I’d pour a drink and sit in front of my computer, wishing I wasn’t trapped at my day job selling copy machines. I dreamt of owning my own business, I could feel it in my soul but with no experience, money, or connections that burning desire was just existential dread. Over the years, I became obsessed with the idea of “success” and money making. The more content I consumed, the more the algorithms fed it to me. \n\nI did indeed start my business and somehow, despite my best efforts to f*ck it up, it grew into the baddest bar and restaurant cleaning company in Portland Oregon. I guess the way it happened was my relentless work ethic and my inability to say no. The jobs kept rolling in and I’d just do them, no matter what. It didn’t matter if I didn’t sleep for 24 hours, it didn’t matter that I didn’t have a day off for more than 3 years, I didn’t even care that people saw me as a janitor. Money is money and I was going to get mine. I was building my dream and cashing checks. And the whole time I had Goggins in my ear calling me a bitch and asking me “who’s going to carry the mops?”\n\nEventually, I had no choice but to build a team. I had several hundred hours of work to do each week and there literally wasn’t enough hours in 7 days to even do 1/4 of the work if I stayed solo or even hired a small team. So I did what any moron does and I put out job ads with zero back end processes to actually be a decent employer. I figured this is a pirate ship and once I assemble a crew, then I’ll stop to get organized and check the map. \n\nAll hell broke loose. I’ll save that story for another time, but just know those scurvy dogs tried to kill me and the business. But I had Jocko telling me that this was my fault and if I wanted it to change I needed to take responsibility. I started to analyze my situation as if I were an employee working for me. I realized, oh shit, these entry level janitors don’t give af about my business. They just want a check and want to go home. \n\nAt first it was a pain in the ass and I was like “nobody wants to work these days” but that gave me no power and it made me weak. I had to be reflective and ask, “is that true, or are you an idiot and they just don’t want to work for YOU”. That question and the following answer really appealed to mh self loathing nature and I found comfort in my failure, but I also realized that if this is my fault maybe I can fix it. \n\nI started to see some stuff on tiktok about quiet quitting, and “your work isn’t your family”, I started to realize that people had their own dreams and interests. I wasn’t the special guy with the only plan for success, which was painful for me to realize. lol. \nI started thinking, how can I support these employees of mine? How can make their lives better?\n\nI came up with a plan. What I I steered into the gig work economy? My employees didn’t seem to want long hours even if it meant overtime and more money. Those were my values, not their. They want to go to school, work another side job, and sort of piece meal their work day. They want multiple streams of income from different sources and not be totally reliant on some shitty janitor job working for a guy who doesn’t know what he’s doing. \n\nSo I broke the shifts into 2-3 hours per day and advertised the job as a side gig. (I know part time work had been around forever, but hey it’s marketing) my job ads were like, “make $2000 per month before your day begins. Work solo, listen to your headphones, be done before 9am and have the rest of the day to live your life on your terms”. \n\nI did initially think, who the hell is going to work part time as a janitor? I’ll only find disfunction and chaos, but I decided to look for people who have busy lives. We hired teachers, students, tattoo artists, bartenders and servers, stay at home parents. The job is ideal for anyone who wants some extra side income that is stable and doesn’t impact the other things in their life because it’s so early in the day or on the weekends. \n\nThose job ads brought in hundreds of applicants every time I posted them. All of a sudden people were not trudging through the day and getting in a bad mood from 8-9 hours of manual labor. There was less fighting and drama. If someone no call Jo showed, it was super easy for someone to pick up a 2 hour shift, rather than scramble to pick up 8 hours. Since we work in the off hours we used to start at 4am, good luck finding a replacement when hour staff flakes at 4am. But with my new plan we could push the start times to 7am, which made it easier for people to show up to their job. \n\nWent through and split up all the roles and jobs. Sales people, office managers, service managers, assistant managers. All part time. When people would rise above and show an interest in the job or want more hours, we of course made a path for them. This let me incentive people more too, not only could they get raises for doing good, they could get more hours. On the flip side, if they were a toxic mess, we could phase them out with very little impact. \n\nYes, there were some trade offs or things to consider. Communication is much more of a priority with more people. Some new hires will flake sooner because they don’t value it like a full job, although once I got the right people into place most of my staff sticks around for several years. It’s a bit more work for scheduling and HR, but not much and my office can keep up on the demands. \n\nAnyway, I think the world is changing and as an employer we can be flexible and give our team the lifestyle they want. People do want to work hard, they want to get good at their job, but they also have boundaries and their own interests. Just because we want to hustle and grind to be the best janitor in the world, doesn’t mean we need to drag innocent bystanders along with us. People want to work from home, they want flexibility, I say steer into it if you can. You might be surprised with a happier and more functional staff, in world where “nobody wants to work anymore” \n",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 4963,
    "downs": 0,
    "created_utc": 1750008131.0,
    "media": null,
    "is_video": false,
    "num_comments": 533,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.7946024013409705
  },
  {
    "score": 4955,
    "title": "I scraped 109K comments to find the best side hustles",
    "selftext": "Got ripped off by too many courses so took matters into my own hands\n\nI scraped 112K total comments from Facebook Groups, Reddit, YouTube, TikTok, and X on discussions related to side hustles.\n\nUsed Grok and Gemini 2.5 to filter the ones with most sources reporting success &amp; least upfront investment. Sorted into offline &amp; online.\n\nOffline side hustles:\n\n1. Odd jobs on Taskrabbit like assembling furniture, mowing lawns or pressure washing. People say the leads are consistent and they can set their own schedule.\n\n2. Dog sitting / walking on Rover then building your client list for long term stays which pay way more as some people avoid doggy day cares. With multiple dogs, people are making a solid income.\n\n3. Being a senior companion through Care or Nextdoor / Facebook Groups. You don’t need medical experience. Just offer rides, company, or light errands. People are making a full time income with just a few clients per week.\n\n4. Organize &amp; promote local meetups related to specific interests. You find the venue and sell tickets through Facebook Events or Meetup. People host business networking, senior events, or dating advice seminars this way and make thousands per event every week.\n\n5. If you live near even a semi-touristy city make a listing on Airbnb experiences for things like walking tours, food tours, bar crawls, couples photography, or other experiences. Earnings vary widely.\n\nOnline side hustles\n\n6. Create an online newsletter for your city or county using Beehiiv. Write a bit of local news and feature ad spots for local businesses. Promote the newsletter by running Facebook Ads at very low daily spend that are geo-targeted to your city. Depending on population people report making more than their corporate job.\n\n7. Make quiz videos &amp; Reddit story videos using VUBO and post them on TikTok and YouTube shorts. Until you’re eligible for adsense &amp; TikTok creator fund payouts, you can sell your own digital product, an affiliate offer, or get paid by brands to feature their logo/product in your videos. Several people in a Facebook Group report earning a full income doing this.\n\n8. Write and publish ultra specific books on Amazon KDP and rank for long keyword searches. “First Time Mom Guide to C-Section Recovery” or “How to Train a Rescue Greyhound”. People report using AI to help them outline and write books and claim that you can make serious money once you publish many titles.\n\n9. Sell Print on Demand products on Etsy. People are using ChatGPT to make designs then putting them on mugs, tshirts, bottles and candles, and listing them on Etsy. Get inspired by best sellers and don’t reinvent the wheel. Most report using Printify for fulfillment.\n\n10. Make UGC (user generated content) for brands. Find clients through Billo, Collabstr, Fiverr and X. Film some portfolio videos with products around your home. People are making more than jobs by doing this part time and the secret is to craft your niche. Example: health and wellness products.\n\nHope this helps! Now go make that bread!",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 4955,
    "downs": 0,
    "created_utc": 1752158112.0,
    "media": null,
    "is_video": false,
    "num_comments": 528,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.791859133721619
  },
  {
    "score": 3973,
    "title": "Forced every engineer to take sales calls. They rewrote our entire platform in 2 weeks",
    "selftext": "Our senior DevOps engineer thought I'd lost my mind. He didn't join a startup to do sales. So he promised me 5 calls and I guaranteed he'd never have to do it again. It was a bit of a back-and-forth but I strongly believe it fundamentally changed how we build products.\n\nWhen I sat in on the calls, I observed a few things: \n\n\\- Seeing them explain why our competitor's platform was \"too complex for non-technical users.\"  \n\n\\- Seeing them assure the customer that the continuous monitoring was actually working (We had beautiful logs and metrics. But what they wanted was a green checkmark.)\n\n\\- Seeing them respond when customers asked \"Can someone just do this for me?\" \n\nMost of our team are backend engineers too and I think this fundamentally made them better product designers. At the end of it, they were sketching a completely different architecture without my \"PMing\". Because they finally understood who was actually using our product.\n\nThe rewrite took 2 weeks. We removed 60% of features. Added a simple progress bar. Built Slack integration for questions. Created \"done-for-you\" workflows. \n\nOur support tickets dropped 70%. \n\nThe biggest problem with most engineers is actually over-engineering. \n\n1. **Users don't care about your elegant solution** \\- they care about their problem going away\n2. **Technical correctness &lt; user understanding** \\- if they can't use it, it doesn't matter how well it's built\n3. **Every feature has a cost** \\- not in code, but in user confusion\n\nSince this experience, I've made this a mandatory culture in our team. Every engineer takes 5 sales calls per quarter. There's always going to be a little pushback. But hearing the exhaustion in a customer's voice when they say \"I just need this to work.\" does it all. I think it helps build up their instinct. ",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 3973,
    "downs": 0,
    "created_utc": 1755767709.0,
    "media": null,
    "is_video": false,
    "num_comments": 414,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.628251911129842
  },
  {
    "score": 3863,
    "title": "I quit my $300k finance job at 30 because I finally admitted I hated it - and the lifestyle downgrade has been absolutely brutal.",
    "selftext": "For 7 years I pushed through a career that looked great on paper but made me miserable. I finally walked away this year. No dramatic blow up, no big revelation, just the quiet realization that I could not keep pretending I enjoyed it.\n\nSince then, I bought half of a 40-year-old family business and started building a Miami-focused real estate platform. (Both sites were basically vibe coded by me with basic programming experience. Hiring them out would have been over $100k - irrelevant detail).\n\nWhat has been insane is the lifestyle freefall.\n\nI was always scared to become an entrepreneur because of this exact thing. Now I am living it.\nOne business is profitable but still early stage. The other is a startup that needs heavy lifting.\nBoth require marketing, ads, experiments, money going out before money comes in.\nI underestimated how competitive it is just to get attention. Meta ads, Google ads, creative testing, all of it. I really thought I could just show up and grow something. Absolutely delusional.\n\nThe hardest part?\nIgnoring the headhunters calling with mid six figure jobs.\nI know I can go back. I know I can make money tomorrow. But that is the life I spent years trying to escape.\n\nAnd then there is the identity shift.\nTelling girls I am building companies instead of being the finance guy at a big fund.\nNot casually dropping $200 on sushi like it is nothing.\nNot skiing every winter.\nNot having that easy, comfortable narrative of I am doing well.\n\nIt is humbling. Honestly, some days it is embarrassing. I did not expect it to hit this hard.\n\nBut I also have so much respect now for entrepreneurs who stuck through this phase and made it work. You do not realize how much grit it takes until you are the one staring at the ceiling at 3AM wondering if you are insane.\n\nRant over.\n\nWould love to hear if anyone else went through this identity and lifestyle whiplash when switching from a high paying job to entrepreneurship.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 3863,
    "downs": 0,
    "created_utc": 1765424168.0,
    "media": null,
    "is_video": false,
    "num_comments": 834,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.737880355485257
  },
  {
    "score": 3556,
    "title": "How I made 15K+ in a month with a simple python script and nicotine pouches",
    "selftext": "So, this is one of those dumb ideas that somehow worked out way better than expected. I live in a country where nicotine pouches weren’t sold… until recently. A company opened up selling them, and people were losing their minds over it. They would put new stock on their website at random times, and every day it would sell out within 3-5 minutes. If you weren’t fast, you missed out.\n\nI was actually using these pouches myself and getting tired of missing the drops. So, I wrote a simple Python script that would monitor the website for stock updates and send me a Telegram notification the moment they were available. Worked like a charm—I never ran out of pouches again.\n\nThen I thought, why not share this with others? I moved the notifications to Twitter, and every time stock became available, my bot would tweet about it. People went nuts for it. The Twitter account blew up, gaining 5,000 followers in just two weeks.\n\nAt that point, I figured it was time to monetize this thing. I stopped the free Twitter notifications and posted an announcement: if you still wanted to get notified, you’d have to subscribe to my Telegram bot—$5 for one month or $10 for three months. And believe it or not, I made over $15K in about a month and a half.\n\nUnfortunately (or maybe fortunately for the consumers), the company eventually ramped up production, and nicotine pouches became available all the time, so the hype died down. It was short-lived, but I made some solid money with just a basic Python script and some simple market timing.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 3556,
    "downs": 0,
    "created_utc": 1730714143.0,
    "media": null,
    "is_video": false,
    "num_comments": 239,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.476189486041584
  },
  {
    "score": 3406,
    "title": "Like It or Not, These 6 Industries Will Always Print Money!!!",
    "selftext": "I came across this post, and it got me thinking: making money is often about understanding human nature. Some industries thrive because they tap into deep desires, fears, or insecurities.\n\nHere’s the list:\n\n1. **Men’s lust** – Adult entertainment, dating apps, and OnlyFans are billion-dollar industries.\n2. **Women’s desire for beauty** – Skincare, fashion, and fitness keep growing because the demand never stops.\n3. **Elderly’s health** – Healthcare, supplements, and assisted living services make fortunes.\n4. **Children’s education** – Parents spend heavily on tuition, online courses, and skill development.\n5. **Rich people’s fear of loss** – Wealth management, insurance, and investment firms profit from this.\n6. **Poor people’s desire to get rich quickly** – Get-rich-quick schemes, lotteries, and even certain coaching programs feed off this.\n\nWhether ethical or not, these industries will always have demand. ",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 3406,
    "downs": 0,
    "created_utc": 1739281460.0,
    "media": null,
    "is_video": false,
    "num_comments": 322,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.521973394733429
  },
  {
    "score": 3374,
    "title": "I've challenged myself to make $100K in 100 days (DAY 100)",
    "selftext": "It’s day 100 of my journey.\r  \n\r  \n**Who am I?**\r\r  \nI’m a Software Engineer living in Serbia, with no prior experience in sales or entrepreneurship.\r  \n\r  \n**What I’ve tried in these 100 days?**\r\r  \nI tried to create my own mobile app, but it went really slow, so I’ve decided to work on it later, not during my challenge - $0.\r  \n\r  \nI’ve created a few digital products (black and white, minimalistic maps) and selling them on Etsy - $4.\r  \n\r  \nI’ve started offering mentoring services for beginner level programmers. That worked pretty well in the beginning, but then it slowed down - $2115.\r  \n\r  \nI’ve started making YouTube videos about my life as a software engineer. It’s going very slow but that’s normal, I guess. It won’t help me with my challenge, but I believe that in a long-term, having (and growing) a YT channel is a good idea. And I simply like making videos - $0.\r  \n\r  \nI’ve found a freelance project where I work as a backend developer, just like my main job. I understand it’s not very entrepreneurial because it’s just a job, however, at this stage it seems like the best option to make some money, because I already have the skill - $8000.\r  \n\r  \nAfter one of my previous posts, a guy DMed me here on Reddit and asked me if I can do the coding in his new application. We had a conversation, I liked the idea, so I’ve started to work on that project as well. It doesn’t make me any money now but maybe it will in the future - $0.\r  \n\r  \nSo in total I’ve made $10119.\n\nAlso a couple of people donated me a few bucks - $25.\n\nWhich means **I'm finishing my challenge with $10144.**\r  \n\r  \n**Summary**\r  \nAs you can see I failed. I've made 10X less than I aimed to make. \n\nDo I have any regrets? Absolutely no. I'm happy that I've made 10K and I believe if my goal was $10K I would make only $1K or so. \n\nWhat did I get from this challenge?\n\n* I learned something new about myself. I'm happy to know that I can work hard and be disciplined. It gives me confidence that I can achieve anything I want, that I won't quit.\n* I'm proud of myself that I went public with my challenge inspite of the anxiety and fears. It was very difficult for me to make my first post, and look at me now, I can publicly say \"I failed\" and I'm OK with that. Because I realize that any fail teaches you and I'm glad to learn my lessons.\n* I learned new skills. I've started work with JavaScript, Vue.js, React Native, those are all new to me. Mentoring other people helps me to grow as a software engineer and as a potential team leader. My communication skills have got better as well. Also I delved into SEO, marketing, sales, SaaS, so a lot of good stuff which I believe, will help me in the future.\n* I got about 200 new connections on LinkedIn.\n* I had conversations with different people from all over the world and I absolutely loved it.\n* I received a lot of advice from you which was especially great for me. A lot of different opinions, fresh ideas, and tips. \n\nWhy I didn't achieve my money goal?\n\n* I definitely needed a plan. I didn't have one.\n* I was trying too many things. I had to choose one thing, work hard and scale it. \n* I needed more knowledge in sales and marketing.\n\n**Final words**\n\nI want to thank each of you from the bottom of my heart. Thank you for wishing me good luck, for your invaluable advice, for your support. Thank you haters for making me less sensitive to judgement. Thank you all.\n\nIt's been an awesome 100 days. \r\r  \n\r  \nBye.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 3374,
    "downs": 0,
    "created_utc": 1694179783.0,
    "media": null,
    "is_video": false,
    "num_comments": 359,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.496425027550687
  },
  {
    "score": 3308,
    "title": "I sell a private jet flights to people who only want to look rich",
    "selftext": "When I first got into the private jet business (no, I don’t own a jet), I thought I’d be selling these private jet flights to celebrities, billionaires, CEO’s etc. What I didn’t expect was the surging client base of Gen-Z’s, influencers, online gurus and dropshipping coaches. \n\nThe funny thing is that most of these people don’t even care about getting from A to B, most of them book the shortest route and some of them don’t even leave the ground… they just want pictures, and videos of them on the jet sipping champagne lol\n\nAt first this was extremely weird and I “judged” these people. Like why would they spend money just to flex on Instagram? It felt fake, very shallow. \n\nBut over time i realized that this was the product. The private jet is what people REALLY want. But they aren’t buying transportation, they are buying an image, a story of showing everyone “I made it” for most of them, painting this picture is more valuable than the jet itself. \n\nThe crazy is the absurdly MASSIVE demand for these fairly cheap private jet flights. I never imagined an entire market of people who aren’t rich but desperately want to LOOK rich. \n\nBut honestly, this was the best thing that could have happened to me because I don’t have to convince anyone to buy. The product (which is the jet flight) sells itself and I close those deals with little to no effort. \n\nThe lesson: sales isn’t always about the product you’re selling. It’s more about selling the feeling behind it and getting people emotionally invested. If you understand ego, you’ll understand markets. \n\n ",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 3308,
    "downs": 0,
    "created_utc": 1758660931.0,
    "media": null,
    "is_video": false,
    "num_comments": 548,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.616982939384899
  },
  {
    "score": 3081,
    "title": "GUIDE TO HOW BECOME A MILLIONAIRE. For younglings, so they stop asking the same thing every other post.",
    "selftext": "So, you're a kindergarten student, or maybe a high school graduate and you stumbled across a tik-tok video of a \"multi-millionaire high school graduate with Lamborghini (they always have Lamborghinis... it's like the cheapest sh\\*t you can rent to fake a lifestyle). And you think you want to do the same thing?\n\nIf yes,\n\n# THEN THIS IS YOUR GUIDE TO BECOMING FINANCIALLY INDEPENDENT FOR THE REST OF YOUR LIFE!!\n\n**Step 1: Graduating the highschool.**\n\nContrary to what young millionaire kids will say to you on TikTok, YOU NEED TO GRADUATE AT LEAST FROM YOUR HIGHSCHOOL. Tiktoks would say that Bill Gates or Mark Zuckerberg didn't graduate from college, so that might encourage you to not take the the school route. What they don't tell you is they dropped out from Harvard, not Tulsa Community College.\n\n**Step 2: Find a field or industry that you are kind of good at.**\n\nAnd become great in it. Join an existing company, the scale of it doesn't matter much. Locate the team lead or a manager that are quite good in their role. Ask them to be your mentor. Your goal in this stage is to gain as much knowledge as possible about your current field. If you find a good mentor, it will make a life-changing difference in the knowledge you can gain in that field.\n\n**Step 3: Now your entrepreneurship journey starts.After working for a few years in your chosen industry.**\n\nMillions of dollars are waiting for you, now you have to take the risk to take them. It is time you create a business in the same field/industry, and with your knowledge, it's your chance to do it better.\n\nThere's no special magic business idea that will instantly get you millions, Maybe if you got lucky in 2016 and accidentally purchased like $20,000 worth of bitcoins while you were drunk and forgot to sell it the next days, the road to millions will be hard.\n\nAny idea, any business plan, in any industry, being done 15% - 20% better than your competition does, will guarantee you millions.  Some kids started clearing gardens at a young age, and by 25 they had multiple employees and millions of dollars. But they had to put in the work.\n\n&amp;#x200B;\n\n**Step 4: Expand, hire a few people, and expand your business.**\n\nIf after 1-3 years of working on your business, you are still the main pillar in your business, you are not an entrepreneur, you are just a worker. This is the time you start learning about leadership and managing people, this is the time you have to open up to your employees and trust them to do your work. Here you start focusing on expanding, in growth. Promote or Hire someone you trust, and put them in charge of the day-to-day operations. Your goal now is to focus on finite objectives.\n\nAt this stage, you should be heavily put into planning the next 5 to 10 years. If you want to enjoy vodka by a beach with Australian supermodels feeding you grapes, you need to build a sustainable business.\n\nAlso, hire a business lawyer and a financial manager, they will help you a lot!\n\n&amp;#x200B;\n\nPlease remember: Entrepreneurship is your journey to become a millionaire. But this path is also dangerous, lonely, and hard.\n\n# Entrepreneurship is like a knife fight in a prison yard. It's hard, it's bloody, it's dangerous, but I swear it's f*cking fun.\n\nThere are no shortcuts in this path, form your fundamentals right, and you will be on the path to make millions.\n\n&amp;#x200B;\n\nYou need to remember, people who promise you to be a millionaire by 19-20 and the only thing you need to do that is to buy their $20 book or course, will not help you become a millionaire. 99.9% of them are just saying the exact same thing as the other, just recycling the same bullsh\\*t.\n\n**Dropshipping will not make you a millionaire within the first month, it won't. You have more chances of becoming a millionaire by pressure washing properties and garages than dropshipping in the same year.**\n\n&amp;#x200B;\n\nThanks for coming to my talk, If you pay me 200$ an hour to consult you on how to become an entrepreneur, basically I will just copy and paste this exact same message in the chat and charge you $400.\n\n&amp;#x200B;\n\n**P.S.:** This post is not entirely satire, if you need to become rich, you need to become the best version you possibly can of yourself. Invest in yourself, and focus on yourself, you are the priority of your life.\n\n**P.P.S:** If you need to ask \"how to make x amount a dollar more as a student\" this is not your place, entrepreneurship is not a short journey. This is probably the best step-by-step you will find for your journey to entrepreneurship.\n\n**P.P.P.S:** If you need to ask \"I have x amount of years in finance/woodwork/whatever job and x amount of savings. How do I become an entrepreneur?\", I promise you, whatever you start doing you will burn through your money faster than you can notice. If you are unable to critically think about a few possibilities you can do for YOUR future, then you don't know enough about your industry to start working on your own.\n\n**P.P.P.P.S.:** If you need support or help, start by helping yourself first, figure out a few ideas yourself, and allow us the community to assist you with what we know best. But we won't do it for you. You know yourself best, not we. So if you need quality answers, make quality questions.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 3081,
    "downs": 0,
    "created_utc": 1694358020.0,
    "media": null,
    "is_video": false,
    "num_comments": 318,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.423227975910991
  },
  {
    "score": 2937,
    "title": "Is anyone automating their cold email outreach at scale? Looking for solutions that simplify email deliverability",
    "selftext": "I've been exploring ways to scale cold email outreach without running into the usual roadblocks like domain health and warm-ups. In my experience, setting up domains manually and dealing with constant churn has been a huge pain, especially when you're trying to scale up quickly.\n\nI'm curious if anyone here has tried out newer methods or tools that streamline the process. Specifically, I'd love to hear how you're handling:\n\n* Domain setup times\n* Email volume per day (without getting your domain burned lol)\n* Managing inboxes\n* Keeping costs reasonable (Google Workspace has gotten crazy expensive)\n\nI've been testing something new that promises faster domain setup and better scalability, but I'd love to know how the community here is approaching these issues. Any suggestions, tips, or feedback from your experiences would be super helpful!",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2937,
    "downs": 0,
    "created_utc": 1729814365.0,
    "media": null,
    "is_video": false,
    "num_comments": 110,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.225713280847567
  },
  {
    "score": 2633,
    "title": "How I've been making over 10k / mon. since 20 (25 now)",
    "selftext": "Want to give some value, in particular for the younger guys, as I know how the online entrepreneur space is these days. SMMA, dropshipping, crypto, lambos, Miami, Dubai, I know what it's like to see that stuff all over the internet. All of these gurus, infoproduct guys, etc. etc. \n\nMy average month is about 20k-30k now, I do real life business, I didn't just hit it once, It has been consistent. I had a clothing brand agency, well still do, and my biggest month was about 25k Rev, but the majority of money I've made was in sales. I've tried dropshipping, SMMA, Crypto, all of it. My first sales job was as a door to door canvasser, setting free roof inspections for a roofing company at 19. I didn't want to do it, I had too much pride, always told myself I'd run my own company, be a millionaire before everyone else. I was the only kid my age at the time into self improvement, going to seminars, Tony Robbins, Gary Vee, etc. but I didn't have the vehicle to make my first money yet. I eventually lost my job, car got totaled, I was late on rent, no source of transportation and this offer came up. Long story short, I did it and made my rent that first week, which was $1,000 at the time (2018). The sales guys that were closing all made over $100k. Before you make a million, you need to surpass six figures. \n\nNow I'll get deeper into the specific industry I'm in but I want to highlight D2D, and sales in general as it relates to entrepreneurs. The entrepreneurial spirit is something some of us are born and gifted with. It is only a matter of time before you find the vehicle to express that. Entrepreneurship is a sport to a degree, but it's a mental one, not physical. There are skillsets involved, like in sports. A fighter will train to enhance his skills, speed, power, cardio, different fighting styles, boxing, BJJ, etc. I say this because as an entrepreneur, your ability to succeed depends on your strengths and weaknesses, and building your strengths is only a matter of putting in reps. No course or PDF will put reps in for you. You need to train and persistently put in those reps to enhance those skills that translate into desired outcomes and results. This is where sales comes in. D2D is unlimited entrepreneurship training, and the best part is you get paid to learn. If you started a business from scratch right now, with no experience, you'd need to sell one of two things, a product, or a service. Now in the creation of that product or service, there are skillsets involved in doing so, you have to build those, and if you want to succeed at them, you have to get good as well. In sales, its one primary skill, you're selling someone else's product or service, so you don't have to worry about the fulfillment or management of that business. Sales and marketing drive revenue simply speaking. If you can sell and market, you can profit. Where many young people, myself included, go wrong, is they hear about these business models that these guys teach, and try to manage a business that they know nothing about. They tell you how they made $10k, $100k per month. And give you a blue print of what they're doing, but you didn't put in the reps they did. If LeBron put out a course on how to shoot better, I imagine there's some value in that, but you aren't putting in LeBrons work, and with his natural gifts, so you're not going to become him. Lock in on whats in front of you and progress by mastering one thing, then learning the next skillset you know you'll need to learn on the trajectory to become a master CEO. This is the way, not chasing online trends. FB ads changes, Tik Tik changes, Instagram changes, markets get saturated. Build you. \n\nNow what is the industry I'm in? Exterior home restoration. What is that? Well basically we complete work on homes from storm damage, hail, winds, tornadoes, hurricanes, etc. and insurance pays for the work. Every home owner has insurance, and these companies pay for repairs to be completed. Like an auto body shop, if you crash a car, or got hail damage, the company pays the shop, shop does the work, and boom everyone's happy. I started setting leads, went on to closing deals, then later started project managing. Roofing was the bread and butter, but I've made the most of money so far doing niche high end windows that get damaged by hail. These windows are 5x the cost of a roof, and most contractors have no clue how to deal with the claims and install. I have an LLC and subcontracted by the contractors to generate deals. I close the deals, they complete the work. This is my business, and it works well. I get a $5k avg. per deal, and I sell a lot. If you're interested in learning more about this specific industry fire away questions or DM me, I'm more than happy to help. ",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 2633,
    "downs": 0,
    "created_utc": 1715967556.0,
    "media": null,
    "is_video": false,
    "num_comments": 377,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.414361670544378
  },
  {
    "score": 2583,
    "title": "Made $200k last year while still in college",
    "selftext": "I've had this in my draft post for weeks and idk if it's of any value to anyone at this point but here goes:\n\nGot the final numbers this week and to my disbelief, I 8x’d my income between 2021 ($25k) and 2022, while still in college.\n\nRealizing I made this money last year hasn't made me any happier than when I worked at a restaurant for $2k/mo, but I did learn more last year than any other year, about business and life. Hopefully there's something in here that helps someone out there.\n\nMy business is an ecommerce business, I buy containers of product that I've white-labelled from a manufacturer in China and sell it online. I don't work from a beach in Bali or drive a nice car, most of my year was sitting behind a computer at my desk, answering calls, visiting the warehouse, etc. My day-to-day resembles most 9-5 jobs. But, I'm making enough money to support myself and building equity, and that's been the #1 goal since I got started.\n\nSome background, my first experience in business was a drop shipping business that I started in 2020. It had all kinds of issues and stressed me the fuck out, but I managed to sell it in the summer of 2021 for $15k. People always say \"don't sell unless it's a life changing amount of money\" and as dumb as it sounds, $15k at the time WAS a life changing amount of money. I'd never seen that much money at once, and that check proved to me that I was at least capable of creating something valuable. Smiling ear-to-ear, I took my $15k to the bank and enjoyed the rest of the summer without a care in the world.\n\nFor two months, I applied to jobs, internships, and got ready for school to start up again in the fall. After a single week of classes, I realized there was no way I'd be able to sit still for another 2 years of school: I had to start something new. I started looking for product ideas.\n\nMy criteria was this:\n\n\\\\- high AOV ($500+)\n\n\\\\- no local competition\n\n\\\\- somehow related to my existing product/industry knowledge\n\nWithin a few weeks, I stumbled on what I thought was an amazing product that fit my criteria, and decided that instead of leaving my hard-earned $15k in the S&amp;P, I was going to go all-in on starting my own direct-to-consumer business. I blamed most of the issues of the drop shipping business on how dependent I was on the supplier, and thought by taking on more risk and servicing a larger portion of the value chain, I could create something more sustainable (and more profitable). I would buy inventory from a factory overseas, wait several months for it to arrive, brand it, and sell it online.\n\nI started with one order (one pallet) of the product from China in November 2021. This was when shipping rates were still insane so the cost of the product was about $5k and the shipping was $7k via ocean, so after some other costs, ads, Shopify etc I'd pretty much put all the money I had into this new idea. The first pallet took about 4 months to arrive, but in that time I was running ads, sending out samples to customers, and improving the website. I managed to sell the entire first batch of inventory before it arrived, and used that revenue to order another pallet from the factory in January 2022.\n\nBy March 2022, the second pallet was sold out and I ordered my first 20' container. This was a huge jump in order size, and suddenly my entire net worth was in that container, plus I had $10k in credit card debt. Everything was riding on that container, if something went wrong I'd pretty much be SOL.\n\nOf course, the manufacturer fucked it up and sent about 35% of the inventory in the wrong colour, with this terrible finishing material that looked really cheap and fake. The product I'm selling is very aesthetic-based and I've priced/marketed it on the higher end, so this was devastating to me. I had a meltdown in my bedroom, yelled a bunch, took some deep breaths, and prayed that this wouldn't sink me. For weeks, I had nightmares of all the 1-star reviews, returns, complaints, lawsuits, etc., but there was nothing I could do. I took photos of the product as it was, put it on the website and hoped for the best.\n\nA small number of people complained, but most people didn't seem to mind the difference (or know the difference, since there were virtually no competitors in this niche), and the \"terrible\" inventory was sold out within a matter of weeks. We even got a few positive reviews during that time which really got the ball rolling.\n\nAs usual, when it feels like the sky is falling...it usually isn't.\n\nAs the months went by, I kept repeating this process: Ordering product, selling it, calling customers for feedback, having the factory make changes to the product, selling more, repeat.\n\nI sold $80k/month from June-September, $100k in October, $200k in November and $120k last month.\n\nI closed out 2022 with 800k in revenue, I netted about 25%. No employees, some contractors for odd jobs, and a 3PL. From Jan-May I was in school (taking 5 classes) while working a part-time internship in fintech. In May, I went full time into the business, but was back to school in the fall with three classes. My grades have taken a hit as the business has grown but I'm still on track to graduate in April.\n\nI've finally hired a full time employee to handle customer service and am now working on adding new products and pursuing new markets.\n\nAs I said in the beginning, I made $25k in 2021. In 2020 I depended solely on COVID checks, and before that I waited tables while pursuing a career in music.\n\nHere's a few of the things that have helped me the most over the past 2 years.\n\n**Be honest about your reasons for doing things**\n\nAsk yourself this - if you could never tell a single soul about what you're doing, would you still do it?\n\nIf you could never brag at dinner parties about owning your own business, would you still want to own one? If you couldn't put \"entrepreneur\" in your bio would you still want to be one? If you can't answer these questions honestly, reflect on your reasons for doing what you do. In my experience, it's incredibly hard to succeed at something if your primary motivator is vanity/ego.\n\nThe life of a business owner is too ugly and painful to be worth it if you're just doing it is to flex on imaginary haters. I made the biggest strides in life and business after I deleted my instagram account and haven't looked back.\n\n**The silver bullet you're looking for is sacrificing the thing you love the most**\n\nI'm not there yet, but the one thing that's helped me progress more in life and business more than anything else has been giving up one of the things I love the most: alcohol.\n\nI absolutely love the feeling of being drunk, but from March-October last year I didn't have a drop of alcohol and the business objectively wouldn't have done as well as it did if I didn't make that choice. I also felt, like, incredibly happy considering how much bullshit I was dealing with as a never-ending stream of problems and tasked continue to pile on.\n\nThe subconscious reward structures I'd built for myself (alcohol to celebrate, to relax, to end the week, etc) weren't really apparent until I stopped drinking. Same went for the escapist tendencies (alcohol to forget problems, mitigate anxiety), I didn't realize how much of a crutch alcohol was until I cut it out for an extended period of time.\n\nSome people don't have crutches at all, some people have different ones like weed, porn, video games, etc. If you have something that you go to when things get really hard, try cutting it out for a few weeks. You'll be surprised at how much more you can handle than you thought, even without your crutch.\n\nHeineken 0% feels 90% as good and has none of the downsides, highly recommend.\n\n**Run towards whatever scares you the most**\n\nAlmost every single \"win\" from last year stemmed from doing something that scared the shit out of me. Over-communicating with customers when their orders were delayed by MONTHS. Calling customers personally when they were pissed off and letting them yell at me. Reaching out to people who I deemed to be out of my weight class (celebrities, big retailers, etc) and pitching our product. Putting out content that I'd made myself (that I was starring in) on the company socials. This stuff all scared the shit out of me and I wanted nothing more than to NOT do any of it - \"just bury yourself in the Shopify dashboard, you don't need to do any of that\" is what I told myself.\n\nEvery single time that I put my head down and ran towards the thing that scared me the most, I was paid back 10 times over. Customers went from angry to understanding. Big collaborators featured us at no-cost and skyrocketed our growth. Videos went viral, etc. Good things happened that I never would've imagined.\n\nIf it scares the shit out of you, run towards it.\n\nThat's it - I have no idea what the future will bring, but these are the learnings that have stood out to me the most thus far. Wishing everyone a prosperous 2023",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 2583,
    "downs": 0,
    "created_utc": 1674856655.0,
    "media": null,
    "is_video": false,
    "num_comments": 417,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.442880650210563
  },
  {
    "score": 2494,
    "title": "I sold my AI tool for $35,000",
    "selftext": "Hey Entrepreneurs, Marc here.\n\nLast month I wrote here about how sold a habit tracker for $10,000 in October.\n\nEarlier this month, I got $35,000 in my bank account after selling a landing page maker with AI. Here's the story:\n\n&amp;#x200B;\n\n**- April 2023:**  \nJust like everyone, I get massive FOMO with AI.  \nI played with GPT and decided to build a landing page generator with AI:  \nInput text and the AI prefills a template with copy and AI-generated images.  \nI'm working on it with a good friend of mine named Martin.  \n\n\n  \n**- May:**  \nThe product is called LandingAI. It's an MVP but we launched and made \\~$8,000.  \nUnfortunately, Martin and I had different visions for the project so we forked.\n\n&amp;#x200B;\n\n  \n**- June:**  \nLandingAI is the name of a big corp (bummer) so I rebranded it to MakeLanding.  \nI ditch 90% of the code because users want a very different product:  \nSo here I am, building an entire website builder powered with AI...  \n\n\n&amp;#x200B;\n\n**- July:**  \nI launched again, but made a BIG mistake:  \nI swapped the one-time payment for a monthly subscription and got $20 MRR for 15k visitors...  \n\n\n1. If you can avoid subscriptions, do it\n2. New pricing means new positioning—users compared the app to Framer &amp; Webflow\n\n  \n\n\n**- August:**\n\nI removed the subscription and sales came back: \\~$7,000 in 3 months.  \nBut I realized this was going nowhere...\n\n  \n\n\n**- September:**  \n\n\n* I don't use the product\n* The market is gigantic and crowded\n\nAs a solopreneur, nothing is more important for me than building cool stuff for people I care about.  \nAnd I didn't really care about this big market so...  \n\n\n  \n**- October:**\n\nI called my friend Dan and he said: SELL. He was right.  \nI bought my shares of LandingAI from Martin and listed MakeLanding on Acquire: Asking $38,000 for $14,000 TTM (3x profit)  \nWithin hours, I received dozens of NDAs and a buyer started the process 🤯  \nAfter a few weeks of NDA, LOI, Escrow, etc. the buyer sent the money but...  \nOnly a fraction of the transaction. Then he ghosted me. So I canceled the transition. Back to Acquire...  \nLuckily, in 24 hours I got another buyer!  \n\n\n&amp;#x200B;\n\n**- November:**\n\nWithin weeks, the money was in my bank account.  \nThe buyer and I never called, just a few messages. It's mind-blowing.  \n\n\n&amp;#x200B;\n\n**My takeaways:**  \n\n\n1. Don't build AI products just because\n2. Don't go on a massive market you don't care\n3. Sell if you don't know how to grow the product  \n\n\nIt's my 3rd acquisition this year. I love the freedom of build, sell, repeat.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2494,
    "downs": 0,
    "created_utc": 1701257544.0,
    "media": null,
    "is_video": false,
    "num_comments": 484,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.452441419260541
  },
  {
    "score": 2442,
    "title": "How i made $0 with 0$ investment in just 3 months",
    "selftext": "Yes, I did it, I made $0 with no investments, no skills, no knowledge, no motivation, no discipline, no experience, no connections, no opportunities, no vision, and absolutely no life.\n\nHere’s the exact process I followed:\n\nStep 1: Wake up  \nStep 2: Scroll Instagram reels for 6 hours  \nStep 3: Eat  \nStep 4: Fight with random Indians in the comment section (high-level networking)  \nStep 5: Scroll reels again  \nStep 6: Sleep  \nStep 7: Repeat for 90 days straight\n\n**Results:**\n\n* Revenue: $0\n* Investment: $0\n* Stress level: also $0\n\nBut here’s the thing: I didn’t quit. I kept going. I stayed consistent.\n\ntrust the process\n\nLike this post and drop a comment and i'll bless you with the full guide",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2442,
    "downs": 0,
    "created_utc": 1758744633.0,
    "media": null,
    "is_video": false,
    "num_comments": 290,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.354869961466391
  },
  {
    "score": 2438,
    "title": "Kanye just pulled off the greatest SEO hack of 2025. (So far)",
    "selftext": "He recently posted on Instagram, sharing his dissatisfaction with adidas that their site comes before his when you google his site Yeezy.\n\nNow because of a few million fans typing it in unison on Google, testing out what he was saying, his site now comes before adidas. Incredible.\n\nThis was in real time within 20 minutes.\n\nI was reading the other day about how marketers need to move beyond relying on google searches for their business because of the up rise of \"Zero Click Results\" from users thanks to Googles built in AI feature.\n\nDo you think Kanye's organic post prove that SEO is still king?",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 2438,
    "downs": 0,
    "created_utc": 1736306688.0,
    "media": null,
    "is_video": false,
    "num_comments": 207,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.213743467795112
  },
  {
    "score": 2411,
    "title": "I billed $200k this month and I don't know who else to tell",
    "selftext": "hello everyone, 4 years ago, I launched my recruiting company. I have staff working with me but do most of the billing myself. I don't know what happened this summer but I got busy as heck and now I just finished invoicing $200K for the month of August (which is really the carryover from work done since June), which will allow me to hit more than 7-digit revenue for 2025 (after employees' salaries) for the first time in my life.  \nNow for the sad part, this is something I would have shared with my dad but he passed in May and I had to share with someone.   \n\nobligatory EDIT: thank you so much for your messages, this is the best thing that happened all day (well, with the $200k)",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2411,
    "downs": 0,
    "created_utc": 1756321178.0,
    "media": null,
    "is_video": false,
    "num_comments": 407,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.422707385013054
  },
  {
    "score": 2391,
    "title": "These guys made billions stealing startup ideas.",
    "selftext": "In 1998, 3 German brothers, Marc, Oliver, and Alexander Samwer saw the rise of a new platform called eBay.\n\nIt sparked a thought: if eBay was gaining traction in the U.S, why couldn’t a similar platform work in their home country.\n\nSo they approached eBay with an idea: bring the platform to Germany and hire us to run it.\n\nDespite their passionate pitch, the eBay executives turned the brothers down.\n\nReturning to Germany the next year, they launched Alando, an eBay clone for the German market.\n\nIn a shocking twist, just a hundred days after launching, eBay acquired Alando for a staggering forty three million dollars. \n\nSensing they were on to something, the brothers used the money to launch Rocket Internet, a venture studio dedicated to the art of ripping off US companies.\n\nThe blueprint was simple: duplicate successful US businesses, launch them in foreign countries and eventually sell them to the original company.\n\nOver the next few years, the Samwers targeted several major platforms including Facebook, Twitter, Youtube, and Amazon. Each time selling their clone for hundreds of millions.\n \nToday, each brother is worth around 1.2 billion dollars.\n\n(Shameless Plug) For more stories like this check out [the 50 Greatest Business Success Stories](https://www.shortformbooks.com) along with our [Instagram](https://instagram.com/shortformbooks?igshid=NGVhN2U2NjQ0Yg%3D%3D&amp;utm_source=qr) and [tik tok](https://www.tiktok.com/@shortformbooks?_t=8h0HTdGJA34&amp;_r=1)",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2391,
    "downs": 0,
    "created_utc": 1698860779.0,
    "media": null,
    "is_video": false,
    "num_comments": 228,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.271178916486317
  },
  {
    "score": 2329,
    "title": "How I Went From $10k A Day To Zero Now Living Check-To-Check",
    "selftext": "Two years ago, I used to make $10k a day in revenue by myself from my bedroom with a consistent 20-30% profit margin. Now I work a regular job and basically live check to check and struggle to pay bills. \n\nBefore I start, I wanna say I’m not really sure what the point of posting this is. I guess it can be looked at as a cautionary tale or an interesting anecdote, or maybe you guys will have some similar stories to tell. Not really asking for advice necessarilly but am open to hearing any honest feedback after telling my story. I’ll try and keep it concise. \n\n- Late 2019/early 2020 before the pandemic I was working sales at a high(ish) end car dealership. Brutal hours but fun and challenging, although colleagues sales tactics were morally questionable at times. Was making $5k-$6k a month. \n\n- One day I sold a car that had a bonus on it and combined with my hourly I made like $400 that day. At that point, that was the most money I had ever made in one day and I was hyped. \n\n- I get home that day and excitedly tell my 19 year old buddy about my $400 day which I spent 11-12 hours at the dealership working hard to get. He goes “that’s cool, I just made $1200 today and I was cruising around in my mustang all day.” He was drop shipping Jewelry on instagram/facebook and was doing 1k profit a day and about an hour of work at most. \n\n- At this moment I have an epiphany and I say to myself “what the fuck am I doing?” I begin researching drop shipping and getting mentorship from my buddy. \n\n- After a month or two of trying 3 products out and spending $1k on ads and nothing hitting, Covid hit the world. A week or two before COVID hit, I had launched my 4th attempt at a drop shipping product. Finally, a sale. First week I’m doing &gt;5 sales a day and either barely breaking even or making $10-$20 profit. \n\n- Pandemic hits full swing early march 2020. car dealership lays everyone off, including me. I’m jobless. \n\n- Two weeks after being laid off, boss calls me and says he wants me back. My store is doing $40-$50 a day profit at this point. I see a potential future in this, so I make the tough decision to tell my boss no and focus on my store. \n\n- Over next 6 months through the end of 2020 and into 2021 store grows massively. At its peak, I’m doing 10k a day in revenue and $2500 a day profit. I feel rich and like I finally “made it.”\n\n- Keep in mind that throughout this whole process, I did very little maintenance work. For the first ad creative I launched, it was pieced together from other companies ads who sold the same thing. Probably did my first 5-10k in sales off that ad, then filmed my own. Milked the second ad for a couple hundred thousand bucks, and only after that ad died I made a 3rd and final ad creative which I milked for another few 100k in sales. My strategy was extremely simple to scale - Just launch a video creative and make a CBO with 10 different interests and keep increasing the budget if it’s profitable. At one point, I was spending 4-5k a day on ads. \n\n- Early/mid 2021 the revenue starts dwindling but I had more money than I ever had. At my peak I was sitting on about 60-70k liquid cash in my bank account. Still running ads off the same video creative I filmed months ago and steadily bringing in a couple hundred bucks per day. \n\n- Mid/late 2021 the creative wasn’t profitable anymore and money stopped coming in. I start focusing on other things like getting my first apartment, new GF, hobbies, etc. also had pay a hefty tax bill. While I had money I was living lavish, buying stuff on a whim, bought a new PC, eating out, being wasteful in general with money since it seemed to come so easy. \n\n- It seemed like my thought process was basically “making all this money was so easy, so I’ll just relax and enjoy the money I’ve made so far and when it runs low I’ll start a new product and be fine”\n\n- Fast forward early 2022 - I look up one day and it’s been many months since I’ve made a single dollar running ads and all of a sudden I’m down to 8k in my bank account, which is basically like 2-3 months worth of expenses at most. I’m fucked. \n\n- Moneys run out. Even if I wanted to start a new store, I don’t have any excess money and am literally scraping by to pay bills with odd jobs. \n- Mid/late 2022 got the job that I’m currently (75k/yr) at which pays my bills and leaves me with a little bit of extra money every month but not much. \n- Today in 2023 - finally established enough at this job to have enough extra money each month to not desperately worry about bills and have some extra to invest. Currently looking to re-start my entrepreneurial journey and do things better this time around.\n\nSome Key takeaways - \n1. I’m a lazy idiot \n2. Money management is important \n3. Don’t forget to set aside money for taxes \n4. Just because you struck gold once doesn’t mean anything unless it’s repeatable \n5. Be consistent and don’t get comfortable once you start seeing success\n\nSome questions that may arise after reading this - Why didn’t I just continue making video ads/start another store when the money got low? Or even while it was successful? \n\nGood question. I really don’t know. Maybe laziness? Maybe procrastination? Maybe a false sense of security? Any time I got the nagging feeling to maintain my store or do work I’d just see the random $800 or whatever I made that day and I’d go “eh I can get to it later I got nothing to worry about.” Even to this day I struggle with that. At this point it’s been over two years, I’ve tried launching a few new stores but they failed and were few and far between. I still feel like if I put real effort in, I could be back to making money like I was before within months. I will say that I don’t think my success was a fluke as I pay great attention to detail and it wasn’t an accident. I deliberately studied and perfected my website, video creatives, customer service, fulfillment, sales funnel, etc and understand why the success happened and how it happened. The main problem I seem to have is just this procrastination devil on my shoulder that convinces me not to take action when action is necessary. Maybe it’s too strong of a “things will be alright and work themselves out” mentality which is useful is some aspects of life but may be detrimental to a persistent entrepreneurial mindset. \n\nAnyway, not really sure how to summarize this.\nTLDR - Worked 12 hour days as a car salesman making 5k a month, started a drop shipping business making $2500 profit a day, stopped maintaining store/profit stopped and blew almost 100k in savings living lavish lifestyle for over a year until I became broke and had to get a regular 9-5 job to pay my bills. \n \nHas anyone experienced anything similar? Would love to hear your thoughts on this story.\n\nEdit - for those asking what kind of store it was, it was a one product store selling a portable medical device for about $70",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 2329,
    "downs": 0,
    "created_utc": 1703800294.0,
    "media": null,
    "is_video": false,
    "num_comments": 558,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.438561824969231
  },
  {
    "score": 2230,
    "title": "TIL Jeff Bezos made $280M from a $250k Google investment because an acquisition he made totally flopped",
    "selftext": "Pretty random but thought I’d share (just read the book about Amazon). Bezos made a TON of money as an angel investor into Google.\n\nTLDR: In 1998, Amazon acquired a startup called Junglee and the acquisition was basically a disaster. But one of the employees, Ram Shriram, ended up intro’ing Bezos to Larry Page and Sergey Brin. They show him a prototype, and he wrote a $250k check on the spot into their $1M seed round.\n\nFast forward to Google’s IPO in 2004, that $250k was worth $280M. If he had held on to it, that would have been $20B today (I heard that on the Acquired podcast).\n\nPretty much the reality of investing in startups. If you're already meeting smart people and building relationships, the opportunities show up in your workflow. Not from \"deal hunting.\"",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2230,
    "downs": 0,
    "created_utc": 1761324939.0,
    "media": null,
    "is_video": false,
    "num_comments": 204,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.2318765008117145
  },
  {
    "score": 2030,
    "title": "No One Warns You About This Part of Entrepreneurship",
    "selftext": "Everyone talks about the risk. The sleepless nights. The grind.\n\nBut no one talks about:\n\nThe awkward feeling of telling friends &amp; family about your business and seeing zero excitement on their faces.\n\nThe guilt of watching employees/freelancers rely on your business to pay their bills—when you’re barely paying your own.\n\nThe anxiety of seeing someone else launch your exact idea—but with a bigger budget and better connections.\n\nThe way your confidence gets ripped apart when a random stranger calls your product “meh.”\n\nThe identity crisis when you realize your whole personality has become “work.”\n\n\nEntrepreneurship isn’t just about building a business. It’s about surviving the mental game.\n\nBecause the truth is:\nMost people don’t quit because they failed.\nThey quit because they can’t handle feeling uncertain every single day.\n\nIf you’re in the middle of that storm—keep going. The best entrepreneurs aren’t the smartest or the most funded. They’re just the ones who don’t stop.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2030,
    "downs": 0,
    "created_utc": 1742332809.0,
    "media": null,
    "is_video": false,
    "num_comments": 190,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.175726607028671
  },
  {
    "score": 1936,
    "title": "I made it: I'm a multi-millionaire and now life sucks",
    "selftext": "Man, mid 30's.\n\nI've been working for the last 15 years Monday to Sunday, every day at least 10 hours, Sunday maybe 4-8.\n\nThe last 2 years I've had the best results and my net worth is over 5M. I only own a stinking old car, nothing else in physical possession except a computer, clothes, watch and little else. I live between the US and Europe. You might wonder why I have so little; because people like me who have been through it are like that.\n\nI could retire and live very comfortably, which I have thought to do, maybe going Latin America, adopt a dog, living in the beach.\n\nMy ex-girlfriend left me 10 months ago; she never knew I was doing so well financially. I'll never know if she would have decided to do it if she knew how much I was making; even though she asked me several times, I never told her. We had serious plans, so it hit me hard. I felt like a failure.\n\nI have met new women, but none of them have fulfilled me. I need time and I would have preferred to have someone who would have accompanied me, not arrived when things were already easy.\n\nEven though I've started making a lot of money in the last few years, specially the last one, the truth is, my life sucks; it's based on working, on relationships with people in my business. I don't enjoy that money.\n\nI only have 2 close friends who live in different cities, I have contact with my family, but they have their own problems, so it's not something too close.\n\n\n\nBut at least I have money and I'm aware that I'm depressed because of my lifestyle.\n\nI plan to get better.\n\nI encourage colleagues who feel the same.\n\nGreetings.\n\n  \nTLDR; I made it, but now my life sucks.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 1936,
    "downs": 0,
    "created_utc": 1731412795.0,
    "media": null,
    "is_video": false,
    "num_comments": 1424,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.456537052891376
  },
  {
    "score": 1879,
    "title": "I started a business 4 months ago and it's already selling around $40k a month with about 60% profit margins. Here's how I did it",
    "selftext": "I should preface this by mentioning that I originally posted this as a reply to a thread asking entrepreneurs how they're making $10k/month. I figured this might help other people too. \n\nSo here's the scoop into how we did it (wife and I). Mind you, we've recently started out in Colorado as we just moved from Florida in March of this year. (We did the same thing in Florida)\n\nWe own a wholesale bakery and grab-and-go breakfast company in Colorado. My wife handles bakery, I handle breakfast and juice company.\n\nOur product line consists of over 100 different products, which sounds like a lot, but it's really just a bunch of variations of cookies, brownies, pies, breakfast sandwiches, RTE chia puddings and overnight oats, and cold-pressed juices. We also cater primarily to a more-or-less health and lifestyle conscious crowd (Boulder and Denver), so we offer a lot of gluten-free, keto, vegetarian, vegan and even low-fat options. This quickly adds up in your catalog.\n\nI own a decent DSLR camera that I use to take pictures of our products (but don't let it stop you, most phones take excellent pictures too) and we put together a quick catalog on Canva showcasing our unit price, suggested retail price, and minimum quantity for each item. \n\nThen we went on Google Maps and compiled a list of every independently owned coffee shop and café in a 40 mile radius, and with the magic of the Internet, we quickly had a prospect list, complete with email and phone number. \n\nWe then started introducing ourselves to the shop owners and offering free samples, along with a copy of our catalog. Once we had some interest and we knew the business had a chance to succeed, we signed a 3 month lease at a commercial commissary kitchen, which is basically $300/mo. for one 6-hour shift per week, and is month to month after the first 3 months. The advantage with this route is that you get access to a fully licensed and inspected kitchen, you can scale responsibly, and the best of all, you can call it quits after 3 months if you don't like it or if it doesn't work out and you don't lose $100k worth of equipment that you can't get rid of. You also get access to high-capacity equipment that you would need to borrow or spend a lot of money on, like massive walk-in coolers and freezers, convection rack ovens, 80qt mixers, etc. \n\nWe've been lucky to be growing fast and we've even decided that we are not taking new customers at the moment, and I'm only selling to about 20-30 coffee shops, out of a massive list of over 300 prospects in our area, and not counting anybody outside of our delivery zone. \n\nWe're now up to 3 days a week ($1000/mo rent) and we've brought in a few people to help us with some busy side work (cleaning, packing, etc). My goal is to reach around $3k in sales per day, which I think I can achieve with my existing customer base by simply introducing some new products that they may be in need of. That would put our sales at just over $1M per year, and with our low cost and payroll, this would represent around $500-600k take-home at the end of the year.\n\nOur bakery also has an awesome corporate-gifting component that makes us another $150k per year, and around $350k in sales during the month of December alone (holiday gifting). I can go deeper into this too if you're interested. This adds another $250k roughly in net profit every year and it's normally what we save every year and how we've been able to open and explore other ideas and businesses in the past.\n\nOverall, the main advantage that I see with this business model is that it's a win-win for everyone. Coffee shops don't generally have licensed kitchens, but they do have a demand for food, pastries and non-coffee beverages (think Starbucks). The opportunity is massive anywhere you want because there will always be a need for a specific food category that may not have a great local supplier (croissants, juice, sandwiches, ready-to-eat lunch and salads, etc). Or maybe you can take some of their business if you offer a better price point or smaller minimum order.\n\nAlso, if your product is well-received, soon enough it becomes a highlight in whichever place is carrying it, and not only is the shop making more money by selling it, but they're also attracting more customers for it. You make money, they make money, customers are happy. That's the sauce, really.\n\nThis is about as specific as I can get, but I'm sure I'm leaving some things out. Feel free to DM me if you have more questions and I'll be happy to help!\n\n-------\n\n** EDIT - 08/24 **\nFirst. of all, thank you for all the nice comments. This post definitely blew up more than I anticipated. I'm glad my story can inspire a few people to pursue their own dreams. however, because this is Reddit, you have a few folks who are adamant on proving me wrong, so I thought I'd share one example from one of our top selling products, cinnamon rolls.\n\nHere's my cinnamon roll recipe:\n\n* 2 cups (240g) AP flour ([Sam's Price](https://www.samsclub.com/p/member-s-mark-all-purpose-flour-25-lbs/prod21480584?xid=plp_product_1)) - $2.32 for 240g\n* 1/2 cup whole milk - ([Sam's Price](https://www.samsclub.com/p/members-mark-wholemilk-1-gallon/prod9430203?xid=plp_product_2)) - $0.11 for 1/2 cup\n* 1 1/4 ounce packet active dry yeast ([Sam's Price](https://www.samsclub.com/p/fleischmann-s-instant-dry-yeast-2-16-oz-bags/164800?xid=plp_product_1)) - $0.24 for 1.25oz\n* 1/4 cup (50g) sugar ([Sam's Price](https://www.samsclub.com/p/c-h-granulated-sugar-50-lb-bag/157710?xid=plp_product_4)) - $0.87 for 50g\n* 4 tablespoons unsalted butter - ([Sam's Price](https://www.samsclub.com/p/members-mark-unsalted-sweet-cream-butter-4lbs/prod18380300?xid=plp_product_1)) - $0.38 for 4 tbsps\n* 1 large egg yolk - ([Sam's Price](https://www.samsclub.com/p/members-mark-cage-free-white-large-eggs-60-ct/prod26140046?xid=plp_product_2)) - $0.16 for 1 egg\n* 1 1/4 cups (125g) confectioners' sugar - ([Sam's Price](https://www.samsclub.com/p/member-s-mark-10x-powdered-sugar-7-lb-bag/161329)) - $0.27 for 125g\n* 2 cups (360g) brown sugar ([Sam's Price](https://www.samsclub.com/p/member-s-mark-light-brown-sugar-7-lb-bag/161521?xid=plp_product_2)) - $0.79 for 360g\n* 2 tablespoons ground cinnamon - ([Sam's Price](https://www.samsclub.com/p/member-s-mark-ground-cinnamon-18-oz/prod6240360)) $0.25 for cinnamon\n\nIf you add all these, a batch comes out to $5.39, from which I get 16 buns. This means, to be exact, that my buns come out to $0.33.\n\nNow, by my 4x rule, these buns would sell for $1.32 retail. However, these buns are massive, and most coffee shops are selling them for around $5.99. This means that if I offer a client a 40% wholesale discount on a case of 12, I'm selling the unit for $3.60, and the case for $43.20.\n\nNow, if you want to get technical and add the expenses of the kitchen rent (I pay no utilities there), then sure, these take about 1.5 hrs to make, and we make about 10 batches at a time (while also doing other things, mind you), so my rent cost factored in would be around $1.38 ($1000 rent / 72 hours a month / 10 batches). So let's say my overall cost for one case of 12 is $5.34, all costs included.\n\nWith that said, here is my [margin calculator](https://www.omnicalculator.com/finance/margin?c=USD&amp;v=cost:5.34,revenue:43.20) here so you can see that my margins on CINNAMON ROLLS specifically is actually around 87.64%. When you add my other products, it all averages out to about 58-60%.\n\nI'll also add on here that most shops order 2 dozen every 2 days. The places we work with are pretty busy as they are on main streets and downtown areas and usually go through the 2 dozen daily, and that's not the only thing they order. Most will also order 6-7 cases of sandwiches, juices, overnight oats or pudding jars, and more.\n\nThanks again for reading!",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 1879,
    "downs": 0,
    "created_utc": 1692767522.0,
    "media": null,
    "is_video": false,
    "num_comments": 407,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.27698793080862
  },
  {
    "score": 1876,
    "title": "I (23 y/o) make $740,000 a Year with Mobile Apps - AMA",
    "selftext": "Just to clear it out the way: this is a throwaway account so I don't care about useless karma, and I’m not selling crappy courses or promoting any products. I'm just a dreamer going with the flow in this world 🌱\n\nRead the tl;dr at the end need be.\n\n## Growing Up\n\nI was, admittedly, a computer addict growing up, and I absolutely loved video games! Somewhere along the line, I found out about and grew an interest for finding cheats and hacks for video games.\n\nTowards the end of 2013, a series of exploits for the game ‘Roblox’ came out which allowed you to run scripts within game servers/instances. This is when I first started to learn how to program. I became obsessed with creating my own scripts, and I was eventually able to write ones wayyy more powerful than anything publicly available at the time. I grew my skills a ton during this period - this was probably my most eye-changing learning experience in tech so far in life if I'm being honest 👩‍💻\n\nI was programming on and off for a few years after that, but nothing too significant until high school in 2016/2017 when I started looking for freelance programming jobs. No one took me seriously as a self-taught teenager who never set foot in college before, but I started to ramp up my skills anyways.\n\nFun fact and my biggest regret: I was known as a developer throughout my school and I often had friends pitch me ideas! I never took any of them seriously, and one friend told me about his idea of a “digital business card where you could just share a link instead of an actual business card”. I told him that “that’s exactly what LinkedIn is and it already exists”. What he was actually pitching wasn’t LinkedIn, but Linktree. He also pitched it to me months before a single line of code of Linktree was ever even written, and I had the skills to make it at the time. Linktree is a $1.3B company today… oops. 🤦‍♀️\n\n## The Start\n\nI learned how to create mobile apps after my school offered to waive my community service requirements (went to a private school) for the rest of my years there if I made a landing app for them.\n\nI started working on more and more personal projects since no one would hire me as a freelancer, and in 2018 I released the first version of a dating app for a specific niche group which I knew were hesitant against joining ‘standard’ dating apps like Tinder or Bumble. The group made up a huge percent of the population yet there were no good dating apps specifically serving them.\n\nThink, for example, of the Muslim population who don't usually date outside of their religion and who have their own standards and norms for dating (and thus wouldn't usually be on Tinder). Ignoring economic differences, would you rather fight to get the 6 billion non-muslim people in the world if you had hundreds or thousands of potential competitors, or would you specialize and fight to get the 2 billion muslims if you only had a single digit number of potential competitors?\n\nThat app was semi successful, and then I thought to myself “okay, there are many other groups that are hesitant to join Tinder and I already have the core code and functionalities of a dating app. Why not just reskin the app, add a few minor changes to the back end, and just release it as a new dating app for a different niche group which wouldn’t take too much extra work compared to starting from scratch?” 🤔\n\nClose terms for this is 'white label app' or 'app templates' if you wanna look into it further. An example of this would be if someone made a generic baby phone game app and then released a \"Police Man\", \"Fireman\", \"Ambulance\", or even \"Justice League\", and \"Avengers\" versions after reskinning, thus casting a wider net.\n\nSince then I’ve released a total of 14 different dating apps. I’m projecting a return of just over $740k after expenses this year combined across all of them. My most popular one makes \\~$178k/yr, and my least popular one makes \\~$14k/yr.\n\nMy early traction strategies were about the same with each release: prioritize user satisfaction and reviews, social media marketing to relevant Subreddits, Facebook Groups, Instagram, TikTok, etc, offer users Pro access for inviting friends, and even physical flyers at key locations from time to time just for the hell of it lol. I think all of those combined were responsible for like 35% of initial growth - the rest came from a few \\*shadier\\* strategies and from word of mouth.\n\nAnywho, I will note that I did go to university at the same time (starting in 2019) while doing all of this, and I have a Bachelor's degree in Computer Science today. I had a really, really easy time with it though and I graduated in only 2.5 years (big thanks to CLEP &amp; DSST). Knowledge is power y'all 📚🧠💡\n\n## Conclusion\n\nI thank the stars for where I am now. Technology changed my life forever and granted me pretty much all the gifts I have today. I’m pretty happy with my position in life right now since I’m able to just chill out and go with the flow &lt;3\n\nHonestly, I haven't been hustling or working on the apps much anymore, and in return they haven't been growing nearly at the same speed as expected from a high velocity tech startup today. I don't have any fancy matching algorithms like popular dating apps today, and the UI/UX and many other elements of the apps are honestly a bit dated at this point. I have no workers outside of a few Upwork/Fiverr people from time to time. Needless to say I'm lazy and I hate hustle culture. I'm just checked out and really content to be chilling at this point in life 😇\n\nI’ve always had fairly cheap hobbies, inexpensive tastes, and a significant lack of care for social status, so my expenses and spendings aren’t too different from anyone else’s. I’m now thinking of going all in on r/Bogleheads and just wandering the Earth with the returns and such 🤩🌎\n\nCheers! Good luck fellow dreamers! 💫\n\ntl;dr made a dating app for a niche group, marketed it well, took the core code of the app and made other versions for other niche groups, repeated the processes that led to success on the first app, and allowed the apps to grow over the years.\n\nAMA",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 1876,
    "downs": 0,
    "created_utc": 1694791093.0,
    "media": null,
    "is_video": false,
    "num_comments": 689,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.322888817989973
  },
  {
    "score": 1763,
    "title": "I spent $47k and 18 months building an \"AI startup.\" Here's the brutal truth about why 90% of AI businesses are doomed.",
    "selftext": "**TL;DR:** Burned through $47k building an AI tool that 12 people use. Here's what the \"AI gold rush\" really looks like from the trenches, and why most AI startups are just expensive tech demos.\n\n# The Setup (AKA How I Got Caught Up in the Hype)\n\n18 months ago, I was a perfectly happy software consultant making decent money. Then ChatGPT happened, and suddenly everyone was an \"AI entrepreneur.\" My LinkedIn feed was nothing but:\n\n* \"I built an AI that does X in 10 minutes!\"\n* \"Our AI startup just raised $2M!\"\n* \"$10k MRR with AI tools!\"\n\nI got FOMO and thought, \"How hard can it be?\"\n\n**Spoiler alert:** Very hard.\n\n# The Idea (That Seemed Brilliant at 2 AM)\n\nI decided to build an AI-powered content creation tool for small businesses. The pitch was simple: \"Input your business details, get professional marketing copy in seconds.\"\n\nWhy this seemed genius:\n\n* Small businesses suck at copywriting\n* They don't want to hire expensive agencies\n* AI can write decent copy\n* Subscription model = recurring revenue\n\nI spent weeks validating this idea by asking friends, \"Would you pay for this?\" Everyone said yes.\n\n**First mistake:** Asking people what they'd pay for instead of asking them to actually pay for it.\n\n# The Build (18 Months of \"Almost Done\")\n\n**Months 1-3: The MVP That Wasn't Minimum** I started building what I thought was an MVP. Ended up with:\n\n* Custom AI training pipeline\n* Beautiful UI with 47 different templates\n* User authentication system\n* Payment processing\n* Admin dashboard\n* Analytics suite\n\nCost so far: $12k (mostly my own development time valued at $100/hour)\n\n**Months 4-8: Feature Creep Hell** Beta users started asking for features:\n\n* \"Can it write in different tones?\"\n* \"What about social media posts?\"\n* \"Can it integrate with WordPress?\"\n* \"What about email templates?\"\n\nI said yes to everything. Each feature took 2-3x longer than expected.\n\nCost so far: $28k\n\n**Months 9-12: The Technical Debt Tsunami** Nothing worked together properly. The codebase was a nightmare. I spent 4 months just refactoring and fixing bugs.\n\nCost so far: $39k\n\n**Months 13-18: Desperation Marketing** Launched on Product Hunt (ranked #47 for the day). Posted in Facebook groups. Cold emailed 500 small business owners. Tried Reddit ads, Google ads, LinkedIn outreach.\n\nTotal additional marketing spend: $8k Total users acquired: 73 Paying customers: 12\n\n**Final tally: $47k spent, $340 revenue.**\n\n# What I Got Wrong (Pretty Much Everything)\n\n# 1. I Built a Solution Looking for a Problem\n\nSmall businesses don't actually want AI copywriting tools. They want customers. Big difference.\n\nWhen I actually talked to my target market (should've done this first), here's what I learned:\n\n* They're too busy to learn new tools\n* They don't trust AI for their brand voice\n* They'd rather hire their neighbor's kid for $50\n\n# 2. I Competed with ChatGPT\n\nWhy would someone pay me $29/month when ChatGPT Plus is $20/month and does way more?\n\nMy value proposition was \"it's easier than ChatGPT.\"\n\nReality: It wasn't. And even if it was 10% easier, that's not worth paying 45% more.\n\n# 3. I Underestimated Sales &amp; Marketing\n\nI'm a developer. I thought \"build it and they will come\" was a real strategy.\n\nBreakdown of my 18 months:\n\n* Building: 14 months\n* Marketing/Sales: 4 months\n\nShould have been:\n\n* Building: 4 months\n* Marketing/Sales: 14 months\n\n# 4. I Ignored Unit Economics Until Too Late\n\nMy customer acquisition cost: $650 per customer ($8k marketing spend ÷ 12 customers) My average revenue per customer: $28 (most churned after 1 month)\n\nEven a business school dropout could see this math doesn't work.\n\n# 5. I Built for Myself, Not Customers\n\nI made assumptions about what small businesses wanted based on what I thought they should want.\n\nTurns out, they just want more sales. They don't care how beautiful your UI is.\n\n# The Real AI Business Landscape (It's Not Pretty)\n\nAfter networking with other \"AI entrepreneurs\" for 18 months, here's what I've observed:\n\n# Tier 1: The Actually Successful Ones (5%)\n\n* Had domain expertise BEFORE AI\n* Solved real problems for specific industries\n* Focused on B2B with enterprise budgets\n* Examples: AI for radiology, legal document review, financial compliance\n\n# Tier 2: The Lifestyle Businesses (15%)\n\n* Simple wrappers around OpenAI API\n* Serve very specific niches\n* Make $5k-20k/month\n* Examples: AI email responder for dentists, AI job description generator\n\n# Tier 3: The Strugglers (30%)\n\n* Built cool tech demos\n* Can't find paying customers\n* Burning through savings/investor money\n* This is where I lived\n\n# Tier 4: The Delusional (50%)\n\n* Think they're going to replace Google\n* Have raised money based on PowerPoint slides\n* Will be out of business within 2 years\n\n# What Actually Works in AI Business\n\nAfter talking to the successful Tier 1 and Tier 2 folks, here are the patterns:\n\n# 1. Pick Boring Industries\n\nThe sexiest AI companies get all the attention and funding. But plumbing contractors also need software, and there's way less competition.\n\n# 2. Charge Enterprise Prices\n\nIf you're saving a company 40 hours/week, charge them for 40 hours/week. Don't charge $29/month because that's what consumer apps cost.\n\n# 3. Focus on Compliance/Risk Reduction\n\nCompanies will pay stupid money to avoid getting sued or fined. AI that helps with compliance is worth 10x more than AI that \"increases productivity.\"\n\n# 4. Become the Expert First\n\nLearn an industry for 2-3 years BEFORE building AI for it. The AI part is easy. Understanding the problem is hard.\n\n# My Pivot Strategy (What I'm Doing Now)\n\nI'm not giving up on entrepreneurship, but I'm definitely giving up on AI for now.\n\n**New approach:**\n\n1. Pick an industry where I have connections (web development agencies)\n2. Identify a specific, expensive problem ($10k+ problem)\n3. Build the simplest possible solution (no AI needed)\n4. Charge properly ($500-2000/month, not $29/month)\n5. Get 10 paying customers before building anything fancy\n\n**The business:** Project management tool specifically for web dev agencies that integrates with their existing stack and automates client reporting.\n\nNo AI. No fancy features. Just solving one expensive problem really well.\n\n# Hard Truths About the AI Gold Rush\n\n# Truth 1: Most AI Startups Are Just Expensive Consultants\n\nIf your business model is \"AI does the work faster,\" you're selling labor arbitrage, not technology. That's a consulting business with extra steps.\n\n# Truth 2: OpenAI/Google Will Eat Your Lunch\n\nIf your competitive advantage is \"we fine-tuned GPT for X,\" you don't have a competitive advantage. You have a 6-month head start, max.\n\n# Truth 3: Customers Don't Care About Your Technology\n\nThey care about outcomes. \"AI-powered\" is not a benefit. \"Saves you 10 hours per week\" is a benefit.\n\n# Truth 4: The Technical Barriers Are Lower Than Ever\n\nBuilding AI products is easier than it's ever been. Which means everyone's doing it. Which means you need actual business advantages, not just technical ones.\n\n# What I Wish Someone Had Told Me\n\n1. **Start with the market, not the technology.** Find people with expensive problems first. Then figure out how to solve them.\n2. **B2B &gt; B2C for AI.** Businesses have money and understand ROI. Consumers just want free stuff.\n3. **Niche down relentlessly.** \"AI for small businesses\" is not a niche. \"AI for orthodontist appointment scheduling\" is a niche.\n4. **Test with money, not words.** Don't ask if people would pay. Ask them to pay.\n5. **Budget 3x longer than you think.** Everything in AI takes longer because the technology is still figuring itself out.\n\n# The Question Everyone's Asking\n\n\"Should I still start an AI business?\"\n\n**My answer:** Only if you have deep domain expertise in a specific industry, access to that industry's decision-makers, and a problem that costs companies $100k+ per year.\n\nIf your plan is \"build cool AI thing, figure out customers later,\" just save yourself the time and money. Buy index funds instead.\n\n# Final Thoughts\n\nI don't regret this experience. I learned more about business in 18 months than I did in 5 years of consulting. But I definitely could have learned it for a lot less than $47k.\n\nThe AI opportunity is real, but it's not what the Twitter influencers are selling you. It's not about building the next ChatGPT wrapper. It's about understanding specific industries so well that you can apply AI to solve their most expensive problems.\n\nMost of us (myself included) jumped on AI because the technology was exciting. But technology doesn't build businesses. Understanding customer problems builds businesses.\n\nThe gold rush mentality is exactly what's wrong with entrepreneurship right now. Everyone's looking for the quick win, the magic bullet, the secret hack.\n\nThere isn't one. There's just doing the boring work of understanding customers and solving their problems.\n\n",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 1763,
    "downs": 0,
    "created_utc": 1754478474.0,
    "media": null,
    "is_video": false,
    "num_comments": 535,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.2560809756421865
  },
  {
    "score": 1759,
    "title": "I found out why successful entrepreneurs don’t post on here",
    "selftext": "Yesterday I posted brief steps on my journey to becoming a millionaire. I shared the time, work, learning, sacrifices, and regrets I had along my journey. \nI have since received 50-60 terrible private messages and my account has been reported several times. \nIf you read the last post try doing it with a positive mindset. The main reason I worked so much was so my wife could be a stay at home mom. \nI may post more in the future because there was a few people who reached out and said it was something they needed to hear, but the hate is real. \nThe main point I was trying to get across is heath, family, and friends needs to have a higher priority while you are grinding for entrepreneurial success.",
    "subreddit": "Entrepreneur",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1759,
    "downs": 0,
    "created_utc": 1696094441.0,
    "media": null,
    "is_video": false,
    "num_comments": 356,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.211846775870247
  }
]