[
  {
    "score": 1740,
    "title": "Order canceled over shipping cost (pictures of order included)",
    "selftext": "So I'm not 100% sure on how to feel about this. I did a custom order, it's a nearly 12lbs crochet spider, and I recently finished it and reached out to the buyer. She was happy with how it looks and the size and was okay woth the price point of 200 (which is lower than i should list the plushy for but i originally quoted her for around that price) for the plushy itself. I sent her the custom order listing and after I made sure all the information for the shipping was correct, told her to check the listing out and let me know if she had any questions. \nI dont know if she just rushed through the process or what but she bought it then complained that shipping was $60 then she canceled the order and now I haven't heard back from her. \nI dont mind doing custom orders like this, because the worst thing that happens is I end up with a new plushy, but for some reason this one made me upset. I have no idea what to say to her at this point. \nDo I just take the L and list it on my etsy or wait for a response?",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1740,
    "downs": 0,
    "created_utc": 1709341101.0,
    "media": null,
    "is_video": false,
    "num_comments": 264,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.187421708085735
  },
  {
    "score": 1575,
    "title": "For everyone who gave me some advice on my product photos, do these look any better?",
    "selftext": "Thank you for all of the advice on my previous post! I have taken a couple of new photos trying to follow everyone’s suggestions- no hands, neutral background, off the ground, a level angle with the plushie, further away- I know a lot of people said they didn’t like the idea of the plushie being on bedding, but because they are stuffed animals I really like the cozy background and opted for a basket with a blanket. Please let me know if you think these are any better! \n\nHere is the link to my shop for those asking, the only thing in my shop right now is the patterns to learn how to make these plushies, not the actual plushies! I also have not updated the photos on my shop as I wanted to get some opinions first!\n\nhttps://www.etsy.com/shop/DesignsDaisyFinds?ref=seller-platform-mcnav",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1575,
    "downs": 0,
    "created_utc": 1706751113.0,
    "media": null,
    "is_video": false,
    "num_comments": 145,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.022232641045755
  },
  {
    "score": 1450,
    "title": "Sent to me at 5 am Christmas morning.",
    "selftext": "Our processing time is 5-7 days during the holidays. They ordered on Sunday the 15th and chose free standard shipping instead of expedited shipping, giving them seven shipping days until Christmas. We even told them that the order would not arrive before Christmas. We shipped on the 19th, three days a head of schedule. \n\nI'm not a wizard. If your item takes 13 hours to make, it's practically a miracle that I got it out to you in four days during the holiday rush. After weeks of working non-stop, skipping sleep, and injuring my self to finish people's orders ahead of schedule, this is just insulting. ",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1450,
    "downs": 0,
    "created_utc": 1735138521.0,
    "media": null,
    "is_video": false,
    "num_comments": 288,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.12711633381601
  },
  {
    "score": 1126,
    "title": "Is this customer actually serious? What do I do?",
    "selftext": "This sweatshirt delivered on December 22. They’re saying they washed it with vinegar. I responded and said we would not recommend this and the care instructions are located in the listing description, and that I’m sorry this happened to them. They’re now arguing with me and saying the vinegar shouldn’t have done anything to it. \n\nThey haven’t told me yet what they want. What do I do? I don’t feel I should replace this or give them a refund. Am I wrong???",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1126,
    "downs": 0,
    "created_utc": 1704237290.0,
    "media": null,
    "is_video": false,
    "num_comments": 365,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.061164458743312
  },
  {
    "score": 1091,
    "title": "Oh Karen, no... :(",
    "selftext": "Oh! What a rubbish day. I'm very sad to see this 1 star review of my lack of psychic capabilities. It's not my fault I was born without them :'(\n\nTo make it worse, she was my 10,000th order. I wasted my tiny champagne, noooo!\n\nEtsy really is a significantly nicer side of the marketplace world and 99.5% of customers are incredible, but this definitely caught me on a tough day and pinged a nerve. I had a small cry and a big swear, now I'm sharing here so that I can get a group hug, because we all know how this feels.",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1091,
    "downs": 0,
    "created_utc": 1752601455.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.792261860110428
  },
  {
    "score": 976,
    "title": "My entire shop has been stolen and is for sale on Temu, now it's time to spread the message on Temu's social media",
    "selftext": "Like many others, my work has been stolen by a Chinese company that sells on Temu. I was made aware by a past customer on Instagram that she saw some of my photography for sale on Temu.\n\nWhen I checked, to my surprise, my entire store had been ripped off, over 500 listings!\n\nI sent Temu an email documenting 77 of the listings and mentioning that their are hundred more and requested they removed them all and shut the store for IP violation.\n\nTemu has removed 77 of the listings that I sent them but allowed the seller to continue to sell and continue to sell my other stolen listings. I've sent them a legal notice and intend on taking legal action as once Temu is aware of the sale of stolen art on their website, without removing it, they also become responsible for it.\n\nI'm writing this post today to ask the Etsy community to come together and start to publicly call Temu out for selling our stolen work on their website. Just a small search on Temu will show up hundreds of popular listings stolen from the wonderful community on Etsy.\n\nI've started to comment under their social media posts \"please remove my stolen artwork from your website\" and also \"Temu knowingly sells stolen art on their website, please don't support a company that doesn't respect creativity and intellectual property\"\n\nI believe if more people spread this message across their social media channels daily it would hurt their reputation (whats left of it) more and hopefully make Temu accountable.\n\n\\*\\*\\*\\*\\*\\*EDIT\\*\\*\\*\\*\\*\\*Last night just before going to bed I've noticed that the shop has currently has a \"Coming soon.The store is taking a short break.\"My listings are no longer visible on Temu (for now). I've not received any correspondence from Temu as of yet but I will follow up and continue to watch this shop to see if it remains shut or is reopened again in time.\n\nReading through the comments I see many people have been affected by Temu or a similar platform, I can share what I have done to get to this point. I originally sent links to 77 of my listings, assuming that would be enough to have the seller banned. The seller had over 6.5k listings so it made the task of finding all 500+ quiet time consuming and frustrating. Temu removed the listings I sent them and allowed the seller to continue to operate even though I had made them aware that this seller had stolen hundreds of my works.\n\nI'm not a legal expert and was mostly using chat gpt for advise. I read that Temu become responsible if they are made aware of stolen work and continue to allow it to be sold (yes you can argue that you need to send every single link to be removed but Temu need to hold some sort of responsibility.)\n\nTemu are liable under the **Digital Millennium Copyright Act (DMCA)** to protect original work. They also have a base in Dublin and have to abide by European Rules.\n\nI sent them a legal notice threatening to take action if my listings weren't removed and the seller banned. I then sent them a final notice with a 48 hour grace period before involving legal action in the EU (where I am based). It was after the second email that the store has been closed (but I worry it will only be closed temporarily.)\n\nSome quick advise I've learnt from this - firstly I wasn't selling digital downloads (although I do have a download store the work stolen was from my print store) I am a photographer and sell photography prints. My work was ripped from my mockups, now I must consider watermarking the images in the mockups. The mockups used on Temu were **different** to my own mockups.\n\nSecondly - if you find a handful of listings of yours you can quickly report them, they were quick to take the ones I reported down - less than 24 hours.\n\nLastly - if, like me, you've had hundreds of listings stolen and they are spread amongst thousands of listings, you could try go down the road I did by threatening legal action, I'll be happy to share the emails I sent with anyone who needs them.\n\nFor now my work is safe, Thanks for all the comments and very sorry to read about the others affected, I still intend to actively spread the word about the awful business practices by the sellers on Temu\n\nA few days ago I made a reel to try and raise awareness about Temu's practice's - please feel free to share it onto your stories: [https://www.instagram.com/p/DEsIILqNd5L/](https://www.instagram.com/p/DEsIILqNd5L/)\n\n\\*\\*\\*\\*\\*\\*\\*EDIT\\*\\*\\*\\*\\*\\*\\*\\*",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 976,
    "downs": 0,
    "created_utc": 1736765821.0,
    "media": null,
    "is_video": false,
    "num_comments": 183,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.857303475223541
  },
  {
    "score": 939,
    "title": "Only the 2nd irrational person I’ve sold to thankfully",
    "selftext": "I sell my original chain pouch that holds crystals/small treasures. My most popular listings are my stainless steel and gold plated stainless steel-which I have the materials listed several times throughout the listing. I don’t accept returns on my work unless there was an error on my end which thankfully I’ve only had happen once in 3 years. This person came raging in demanding a refund and dismissing the fact I was willing to even accept a return based on their error… which I only mentioned after they started their tantrum. They are mad I wouldn’t outright refund without getting the piece back.\n\nHad anyone experienced a PayPal dispute for their Etsy purchases? I already contacted customer support to provide them the issue with the buyers demand and proof they received exactly what they order. I’m so thankful that 99.8% of my customers and supporters are incredibly lovely and I don’t run into these types of buyers often.\n\nAlso I pride myself on customer service when selling my work however I don’t tolerate assholes!",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 939,
    "downs": 0,
    "created_utc": 1705434549.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.738401334295964
  },
  {
    "score": 918,
    "title": "Now that's how you respond to a 1 star review",
    "selftext": "I was looking through crochet patterns on Etsy and found this seller. I always change the review order from \"suggested\" to \"most recent\" since I know Etsy hides 1 star reviews (as a seller I like this, as a buyer I know to check). This review came up and I thought the response was fantastic. They were professional, then took the criticism and updated the listing to avoid further issues in the future. And I did check the listing and it does have a picture of part of the pattern so that you can get an idea of their style. I think I'll work on updating my own listings with the same thing because I think it's a great idea! ",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 918,
    "downs": 0,
    "created_utc": 1767050005.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.444376138745943
  },
  {
    "score": 904,
    "title": "I need advice pls! How should I respond to this?",
    "selftext": "I offer personalised hoodies which are the standard unisex Gildan ones that no one has ever had any issues with. I have a size guide with very thorough sizing in my listing and I’ve specifically mentioned that no returns or refunds are accepted on personalised items unless they arrive faulty… \nThey know that they don’t have a case for Etsy and that’s why they are threatening with a bad review… not sure what to do. Please help!",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 904,
    "downs": 0,
    "created_utc": 1707593512.0,
    "media": null,
    "is_video": false,
    "num_comments": 233,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.861256507910275
  },
  {
    "score": 848,
    "title": "Mod announcement: If I can tell that ChatGPT wrote your post, it's not allowed",
    "selftext": "And I might ban you from the sub. \n\nThis is a rant, and I admit it's a rant. \n\nWe have settings on in our sub that filter posts from new and low karma accounts. Every time I check mod queue there are multiple posts from new accounts... and a lot of them are written by ChatGPT. \n\nI just encountered a AI slop shop being promoted by a ChatGPT written story.  It was about some how some 12 year old kid created a shop to pay for summer camp and can we please help him out. I looked at the shop and it was AI generated crap of the lowest quality... the \"I don't care if this person has 6 fingers\" variety. \n\nDoubtlessly the entire story and shop were created by asking ChatGPT to make up a story that would make people feel sorry and want to throw money. \n\nThat kind of disgusting sneaky \"manipulation\" advertising is a major pet peeve of mine. I find it way worse than honest promotion.\n\nI'm starting to see it damn near constantly. And I will ban without a second chance for it.\n\nEverybody... be aware of this type of manipulation. The \"my wife opened a shop, please support her\" is a popular one. \n\nSo is the \"look what I found!\" pretend buyer post.  Sometimes the idiots making it are so dumb they don't even bother to use an alternate account from the one where they do the direct promotion.\n\nI always want to call that out, but I don't, because I don't want to give them a heads up on how to better scam and manipulate people. \n\nBut beyond all that... any long word salad slop post (or comment) written by ChatGPT isn't going to be allowed here. 95% of the time it's some kind of advertisement, but even when it's not, it's not allowed. \n\nWe are living in a world that is going to literally forget how to write sentences and I am not about it. \n\nI wish all mods on Reddit would take this stand. \n\nThat's all. \n\n...I lied, it's not all. I do want to add this:  if you don't recognize ChatGPT when you see it, go spend some time reading ChatGPT written responses and other content. It won't take long for it to start screaming at you when you see it. \n\nEDIT:  This keeps coming up, so I want to clarify up here.\n\nI do not use dashes to identify something as AI. That's just dumb and not necessary. The style is far more distinctive than that. \n\nIf you're not having ChatGPT write your stuff, I'm not going to think ChatGPT wrote it. \n\n",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 848,
    "downs": 0,
    "created_utc": 1751832856.0,
    "media": null,
    "is_video": false,
    "num_comments": 136,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.717267973822156
  },
  {
    "score": 836,
    "title": "Customer who purchased from me wants to know my making process so she can do it too",
    "selftext": "I have a customer who has purchased something from me who is now messaging me with questions on how I do it/ what supplies I use. She wants to know the details that have taken me years to get right and the supplies that I have worked very hard to find the best of. I really hate when people ask this because I personally find it a bit rude, but I don’t know how to reply in a way that will be professional but not cause them to bash my shop because they aren’t getting their way. \n\n*update* I messaged her back thanking her for her previous order and for supporting my small business. I also politely told her that while I am happy to answer customers questions, there are parts of my process, as well as material info, that i have spent years perfecting and refining and therefor prefer to keep private. \n\tShe was not happy about that. She responded that sharing the info wouldn’t have taken away from my shop and how it’s not some super important “patent pending information” 🙄. She’s a crafter too after all. As well as saying she’s not going to order from my shop, which I would have cancelled any future orders from her anyways so I don’t care. I’m fully expecting a bad review from her order she had already received before our conversation. Man, some people are super entitled nowadays. \n\nI really wish Etsy had a full on way to block someone. Not just marking their messages as spam or keeping them from being able to see shop updates, but an actual you-can’t-order-or-have-anything-to-do-with-my-shop type of block.",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 836,
    "downs": 0,
    "created_utc": 1753015060.0,
    "media": null,
    "is_video": false,
    "num_comments": 201,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8104011427165725
  },
  {
    "score": 817,
    "title": "Repeat buyer keeps cleaning out my shop",
    "selftext": "I sell doll clothes in my shop - I'm painstaking with my details, and very proud of my work. I have a repeat customer who buys out a ton of listings as soon as I list them. She's very nice and has been open with me about the fact that she uses them to clothe the rag dolls she sells on her website and at craft fairs.\n\nOn the surface, a profit's a profit, right? But ultimately I don't know how I feel about this. \n\n* I assume she's cutting out my tags and presenting the work as her own.\n* Her buying out almost everything I list prevents me from reaching other customers\n\nHow would you feel about this? I don't necessarily want to raise my prices and make the items inaccessible to other customers.",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 817,
    "downs": 0,
    "created_utc": 1758552788.0,
    "media": null,
    "is_video": false,
    "num_comments": 312,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.888025472444547
  },
  {
    "score": 785,
    "title": "Now seems like a good time for a gentle reminder to NOT purchase boxes/materials from ULINE",
    "selftext": "The last thread on this was from a while ago so I feel like it’s time for another PSA re: Uline.\n\nI used to order my boxes from them until I discovered that I was indirectly supporting fascism and the dismantling of democracy as we know it in America.  That is not hyperbole - please google the founders of Uline as they are among the top funders of election denialism, extreme MAGA candidates, and a bevy of other anti-democratic, regressive causes.\n\nI now order from the [Boxery](https://www.theboxery.com/) for shipping boxes (specifically their boxes made from 80% recycled materials but I’m looking for greener options that won’t break the bank) and [Eco Enclose](https://ecoenclose.com/) for packing materials (which I try to keep to a minimum).\n\nI encourage other sellers who still use Uline to consider other options if your values don’t align.  And when you receive a shipment in a Uline box, consider contacting the company and respectfully asking them to switch suppliers.\n\nThis list of alternatives has been shared here before, but its still the best one I’ve been able to find:\n\n[https://burlesquedesign.com/blogs/news-1/say-no-to-uline-1](https://burlesquedesign.com/blogs/news-1/say-no-to-uline-1)\n\nThank you - and here’s to a prosperous (and peaceful) 2024!\n\nETA 2: Wanted to document some additional suppliers to check out since there were several requests in the comments.  \n\nIn addition to The Boxery (www.theboxery.com), I have contacted and received responses from the following suppliers to confirm they don’t use / partner with / have any kind of wholesale relationship with Uline:\n\n[https://www.cheapassshippingsupplies.com/](https://www.cheapassshippingsupplies.com/)\n\n[https://www.staples.com/shipping-boxes/cat\\_CL213835](https://www.staples.com/shipping-boxes/cat_CL213835)\n\n[https://www.staples.ca/collections/cardboard-boxes-9410](https://www.staples.ca/collections/cardboard-boxes-9410) (Staples Canada)\n\n[https://www.packagingsupplies.com/](https://www.packagingsupplies.com/collections/corrugated-boxes)\n\nHope this helps! \n\nETA: This is not about the normal political left or right.  Uline’s founders are well documented supporters of the stolen election conspiracy and have thrown their money towards candidates, organizations and media platforms that continue to propagate it.  This is about the far-right extremist forces that are careening us towards a fascist state if we don’t stand up to them.  And this is one SMALL way I am suggesting that shop owners who care about preserving democracy (whether you’re a Dem or a Repub) can do just that.  In addition to voting of course;-).",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 785,
    "downs": 0,
    "created_utc": 1704840818.0,
    "media": null,
    "is_video": false,
    "num_comments": 203,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.665237629752357
  },
  {
    "score": 685,
    "title": "I just canceled my first order because the customer was throwing red flags of being a 1 star reviewer ",
    "selftext": "I have over 9k sales and this is the first time I’ve actually had to do this. Customer placed an order and then in messages let me know how upset she was that I couldn’t do her custom order (something that wasn’t possible) and that I was wasting her time because she spent a lot of time on my site picking out what she wanted. I told her I don’t want unhappy customers and I can already see that she’s unhappy so I’m canceling her order. I feel like I dodged a bullet. \n\nUpdate: She created a new account and placed another order. I told her the first time not to order from me again. I didn’t notice until I started making the order and noticed it was suspiciously similar to the one I had cancelled. I checked the customer and it was a different name with the same address. I cancelled that order too and sent a message to that buyer saying I’m sorry if this is in error but the address had been flagged as the same address as a buyer that was marked as suspicious. I explained that I’m a small independent artisan and it’s important for me to be diligent in these scenarios so that I can keep selling on the platform. (This was a large order and I could be risking a large amount of one stars). I guess the next step is reporting her to Etsy for harassment? This is uncharted territory for me. ",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 685,
    "downs": 0,
    "created_utc": 1735665137.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.421825787524151
  },
  {
    "score": 674,
    "title": "Going into my third year. Over 100k revenue",
    "selftext": "Just wanted to let those who are thinking of starting Etsy that I totally recommend it. I’m going into my third year and have over 100k in revenue and over 2.7k sales (not sure why my sales stats are when I took the screenshot) Netted 70k in profit. \n\nI also wanted to say that Etsy ads are not needed as all of my sales come from organic traffic. I ran ads for a week and it wasn’t worth it. \n\nIf you’re struggling don’t give up, pictures, pricing and Seo Are KEY! It took me a few months to figure it out but I think I got it down. \n\n",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 674,
    "downs": 0,
    "created_utc": 1738027572.0,
    "media": null,
    "is_video": false,
    "num_comments": 163,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.611725696854874
  },
  {
    "score": 657,
    "title": "How to handle this?",
    "selftext": "I just received a message from a customer who purchased from me this morning. Etsy emailed the customer the shipping info (which is automatic), the customer responded as if it was “me” emailing them and they are irate that I have sent an email to them when they didn’t want to be contacted. Obviously, I can’t control Etsy’s automatic emails… But I am worried that this person might reflect their frustration out on a review and I am a star seller and I don’t want to have to deal with something that I have no control over (this being a good example!) How would you handle this?",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 657,
    "downs": 0,
    "created_utc": 1710950337.0,
    "media": null,
    "is_video": false,
    "num_comments": 140,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.620335449941646
  },
  {
    "score": 658,
    "title": "Etsy refunded a $1400 order even though it was delivered and signed for",
    "selftext": "We recently shipped a $1400 vintage Cartier watch to a customer in Midtown New York. The package was sent via FedEx with restricted delivery and direct signature required. The customer signed for the package but immediately opened a case with Etsy claiming non-delivery.\n\nThis is the first instance of blatant fraud in our 12 years of business and over 7,000 orders. Typically, a signature guarantees protection, but Etsy admin \"Tony\" denied our claim, in the customers favor.\n\nWe are now out $1400 and the watch. To make things worse, both local police and the NYPD are refusing to assist, stating it's an Etsy issue. We can't even obtain a police report which is necessary to file a claim for this serialized watch. To be able to possibly recover it in the future.\n\nWe have full insurance, but they refuse to cover buyer fraud since the package was technically delivered. The FedEx driver has even been interviewed twice by his management, confirming the delivery as well as GPS coordinates. (everything was provided to Etsy)\n\nEtsy Seller Beware: Do not sell expensive items on Etsy. They do not have your back in cases of fraud, even with overwhelming evidence.\n\nNo Support: Despite paying over $100,000 in fees and ads, and maintaining a stellar seller record (less then 5 one star reviews in 7,000+ orders, half of 1 stars were typos) , Etsy offered no support beyond a vague promise of an email within 5 business days.\n\nThis has been costly and frustrating experience. We urge other sellers to not sell high-value items on Etsy. And we will be rethinking the marketing of these items on the platform.\n\n  \nUPDATE: Though the BBB, this issue was resolved",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 658,
    "downs": 0,
    "created_utc": 1725036091.0,
    "media": null,
    "is_video": false,
    "num_comments": 247,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.751111255007118
  },
  {
    "score": 657,
    "title": "Making negative profit, what should I do?",
    "selftext": "https://overflowingvase.etsy.com\n\nFor context, I started my shop in August 2022, not expecting much. Just really liked making origami roses and thought it’d be nice if people thought they were worthy of buying. I took pictures and uploaded 4 listings, and then drew a logo myself. I didn’t research a lot about marketing or pricing.\n\nSince then, I’ve had 93 orders and made around $1000 excluding material costs and gas. I’ve received all positive reviews.\n\nI was ecstatic to know that other people liked my work, especially those customers who reached out to me with requests. I’ve gotten a few requests about receiving the product earlier, to which I agreed and paid for priority mail shipping for them.\n\n\nHOWEVER, I am just now realizing that my profits are not equal to the efforts I put in. \n\nI charge $12 for 1 origami rose. It takes me almost an hour to make and pack. I pay for the shipping myself. I thought I was making at least $4 per rose\n\nI live with my parents and are under their billing, and their tax rate is 37%. After some calculations today, I realized I was wrong…\n\nIt rounded out to $0.12 per rose.\n\nI’m afraid to raise my prices because I don’t know if anyone would pay for my roses if they’re so expensive. \n\nI’m devastated. I definitely don’t have the time to spend hour for $0.12. This shop has been a huge achievement for me because I loved making other people happy with my passion. I don’t want to close it.\n\nWhat should I do now?",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 657,
    "downs": 0,
    "created_utc": 1706426217.0,
    "media": null,
    "is_video": false,
    "num_comments": 283,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.764885063637474
  },
  {
    "score": 654,
    "title": "Etsy’s copycat problem  completely destroyed my nearly 7 figure business",
    "selftext": "I wanted to share my story because I saw another seller share a post that’s nearly identical to what happened to me, and I think it’s something Etsy really needs to address.\n\nA couple of years ago, I came up with a design style that didn’t exist on Etsy yet. It was in a popular niche, but the specific look, layout, and aesthetic were completely new. Within a few months it took off, one listing alone made over $200,000 that year. It felt amazing to finally find something original that resonated.\n\nBut once that listing blew up, the copycats came fast. Some sellers literally copied my artwork and just swapped in their own mockups. Others made near-identical versions, same color palette, same graphics, just a slightly different font. Within months, the niche was flooded with imitations.\n\nI started reporting them through Etsy’s IP infringement portal, sometimes 20 listings at a time, and nearly every report was approved. These weren’t gray-area situations; they were copies. But the backlash was intense. I started getting angry emails from sellers demanding I retract my reports or accusing me of “ruining” their businesses.\n\nOne seller I reported made a post in a large Etsy Facebook group after her shop was taken down. She claimed I’d gotten her shop removed, but Etsy doesn’t close entire shops for a single report — she likely already had multiple valid IP strikes. What was wild is that other people in her comments chimed in saying I had reported them too and every single one of them had also copied my designs.\n\nThen my shop started getting hit with what looked like bot attacks, huge, unnatural spikes in views/visits that tanked my conversion rate from around 3.5% to 0.02%. The algorithm heavily relies on conversion rates, so my listings completely fell off search. I don’t have any proof, but I’m lead to believe this was an attack from someone I had reported. This was absolutely devastating and I desperately reached out to Etsy for help. I called countless times, sent message after message and they did absolutely nothing. No investigation, no explanation, nothing. I felt completely abandoned by the platform I’d built my livelihood on.\n\nMy shop never fully recovered. My revenue has dropped by about 50% every year since. And now, if you search that niche, you’ll find thousands of listings copying the design I created, many of which are now “bestsellers.”\n\nThis whole experience was devastating. It took an enormous mental and emotional toll on me. I spent months feeling anxious, defeated, and heartbroken watching something I built from the ground up get taken over by copycats who are still to this day profiting off my work while Etsy stood by and did nothing.\n\nI’m not sharing this for sympathy, I’m sharing it because this is happening to so many creators, and it’s getting worse. Etsy’s system doesn’t protect originality, it rewards whoever can replicate it fastest. Websites like Erank, samurai sale, and Everbee - who Etsy themselves fully support, make it too easy for these copycats to identify best selling products on the platform so they can steal the design. Until something changes, being the original creator often ends up being a disadvantage and I do not see Etsy as a viable platform for long term success in e-commerce at all.",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 654,
    "downs": 0,
    "created_utc": 1760275793.0,
    "media": null,
    "is_video": false,
    "num_comments": 193,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.672642164956896
  },
  {
    "score": 649,
    "title": "The Review That Crushed Me...",
    "selftext": "Hi all, so as you can see from the photo, a previous customer thinks that I'm a reseller from AliExpress. I have been making these toadstools for over 3 years now. Since, my products first went a bit viral, everyone including shein or sellers from AliExpress, eBay, Facebook, tiktok has been stealing my photos &amp; customer photos which I've shared here before. I get the ones with stolen photos taken down, they pop up again. I worked so hard on each that I damaged my wrist so I thought the prices were no longer suitable and upped it.\n\nAll the items in my shop are taken in my back garden with my hands or on a wooden perch my dad made. It's so frustrating and embarrassing that it's being compared to dropshippers. I spend hours just to get these photos. Its now knocked me from 5 to 4.9 stars which while still good is now at the top of all the reviews. What would you do. I want to address their concerns without being pushy or rude. Thank you.",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 649,
    "downs": 0,
    "created_utc": 1702297966.0,
    "media": null,
    "is_video": false,
    "num_comments": 129,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6048850327962745
  },
  {
    "score": 643,
    "title": "This is out of line, right? Will Etsy remove a review like this?",
    "selftext": "For context this guy ordered a small item (around $15 including first class shipping) on Saturday. The item was shipped and taken to the post office Monday, and is moving through the system just fine with an update every day. He messaged me early Thursday afternoon, 3 1/2 days after being in the mail.\n\n I immediately double checked the arrival estimate on my listing to make sure it wasn't off, but nope it's correct. My listing shows that you will get it anywhere between 7 to 15 days after ordering. \n\nI have thousands of five star reviews and situations like this are really rare. Just kind of baffled!",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 643,
    "downs": 0,
    "created_utc": 1707439544.0,
    "media": null,
    "is_video": false,
    "num_comments": 147,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.629016725057291
  },
  {
    "score": 643,
    "title": "I want to hit something hard",
    "selftext": "This is the first time I’ve wanted to reach through the computer and strangle a customer. \n\nRecap- customer ordered a set of prints, has messaged me 3 days ago asking where they are and I told him his estimate was 19th August to 30th August. This is what he came back with today. \n\nI bit him straight in the ass! \n\nAlso- I know you can’t redirect post back to yourself, however I had to say that just to annoy him so more😂 \n\nAlso, people don’t bend over backwards for bad people. I’m happy to lose the money on this order, let’s just hope he never gets the prints! \n\nHappy reading",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 643,
    "downs": 0,
    "created_utc": 1693341447.0,
    "media": null,
    "is_video": false,
    "num_comments": 138,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.592893267486859
  },
  {
    "score": 615,
    "title": "Im so confused?",
    "selftext": "I’m so confused?\n\nAttached screenshot of a message from a repeat buyer who has purchased approx $1000 worth of product in the last month. She also had purchased from me about a year ago. Her orders are almost complete so I’m not in a position to cancel and refund at this point but I’m totally mystified by this message. She purchased two of the item in question about 2 hours apart, and afterwards I responded to her asking if she meant to order two or if she accidentally checked out twice. She respond and said she did in fact want two so I told her they were in the queue and got on with my day.\n\nThis is what I sent in response: \n\n“Im sorry you feel this way, all of my items are made to order (this is outlined in both the item description and in my FAQ). I am one person who makes all the items by hand and I re list the item until I am out of fabric or materials to create it. I’m not certain why the indication of remaining stock (which is not something that I personally advertise but is a feature of the Etsy platform) would cause you to feel this way or why it affects your confidence in my business or my production quality. If you could let me know why this is such an issue for you I will see what I can do.\n\nYour items that you have ordered are all in production and as with all my items are being made with care by hand to the sizes you ordered at the time of purchase. You can absolutely send your feedback to Etsy but again, I’m a little confused about your complaint because restocks are a completely normal aspect of online shopping.”\n\nNot really looking for advice but maybe just needing to vent?! Anyone had something similar happen?",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 615,
    "downs": 0,
    "created_utc": 1712538509.0,
    "media": null,
    "is_video": false,
    "num_comments": 115,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.556809706777885
  },
  {
    "score": 576,
    "title": "Four shops selling the same “handmade” journal cover",
    "selftext": "I reverse image searched it after seeing it repeatedly on Etsy and found that it’s also available on Amazon and through a wholesale site, and there’s a very similar one on Temu. This is going to be the death of Etsy if they don’t crack down on this stuff. What’s even more frustrating is that while scrolling the results for “Hobonichi cover” Etsy showed me almost nothing but products from those four shops, meaning the actual handmade items were nowhere to be found. If anybody reading this sells Hobonichi covers I’d love to check out your shop!",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 576,
    "downs": 0,
    "created_utc": 1707005929.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.54112836887543
  },
  {
    "score": 577,
    "title": "Oof! One of the biggest Etsy sellers got shut down this week",
    "selftext": "Idk if I can say the name, but it's basically the biggest digital seller on Etsy for at least the past year. They were regularly making over 1000 sales per day, and much more around holidays. \n\nThis seller was also a huge art thief and sold a lot of the stuff that's found on those PLR sites (none of that stuff is truly PLR by the way, it's all stolen). \n\nI'm posting because people often ask why their small shop got shut down for IP theft when \"everyone else is doing it\" as a reminder that everyone gets caught eventually. It might take a year or more but they will catch you. Not only that, if you're stealing IP from huge companies like Disney, they also have the money and resources to take you to court and take back everything you earned and then some. It's just not worth it, people.",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 577,
    "downs": 0,
    "created_utc": 1721237544.0,
    "media": null,
    "is_video": false,
    "num_comments": 187,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.634006763052369
  },
  {
    "score": 573,
    "title": "Anyone dealt with this?",
    "selftext": "So I reported this seller for stealing my design.  They sent this the next day. I never got an answer from Etsy but an AI response that said block them and call police if I don’t feel safe. \n\nToday, my best sellers were removed bc this person reported it. I reported again this time with chat and they seemed more concerned and would open an investigation. \n\nDoes Etsy tolerate this? Will my listings be restored without having to wait the  allotted days? ",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 573,
    "downs": 0,
    "created_utc": 1763668728.0,
    "media": null,
    "is_video": false,
    "num_comments": 140,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.561021448725663
  },
  {
    "score": 562,
    "title": "Does my jewelry look 'cheap' to you? ",
    "selftext": "The thing is, I design and make jewelry, using Czech glass beads and rhinestones. I've had now twice a customer message me in disappointment about a piece of jewelry, saying they're smaller than they had hoped, or that they look cheap and plastic, and it's actually both killing me and has me at a loss.\nWhile the stones themselves are not Swarovski, which I know some people seem to agree are some of the finest you can use, I don't think I price my pieces nor I claim for them to be made of a anything they're not. But saying they look 'cheap' or 'plastic' really does hurt my feelings because 1. I make every single one of my pieces myself, from start to finish, and I don't use plastic, or resin or acrylic, nothing that can peel off or scratch, etc.\n2. The only 'plastic' in the pieces is the thread, which is kinda inevitable, but I'm fairly sure this isn't it..?\nSo I'm genuinely curious, although I dread the response now that I've had this happen... Does my jewelry look 'cheap' or poorly made to you? \nThanks a lot in advance for taking the time to read and answer 💜",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 562,
    "downs": 0,
    "created_utc": 1714438980.0,
    "media": null,
    "is_video": false,
    "num_comments": 281,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.703132949011026
  },
  {
    "score": 553,
    "title": "How should I handle a demanding customer?",
    "selftext": "I work for a design company and the fabric in question is brand new. I took what we have left of the fabric around to my coworkers for a sniff test, and 11 people (including myself) couldn’t detect any smell. She’s either making this up in order to get a partial refund, or some kind of smell seeped into the packaging while in transit. The logical part of me thinks I should just give her the refund and get it over with, but the other part of me wants to let her know she can’t push people around like this. What would all of you do?",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 553,
    "downs": 0,
    "created_utc": 1708383709.0,
    "media": null,
    "is_video": false,
    "num_comments": 192,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.606288419232317
  },
  {
    "score": 532,
    "title": "Please I need urgent HELP!",
    "selftext": "Hey everyone,\nI need some advice PLEASE because I’m honestly freaking out right now.\n\nI sell fine jewelry, mostly silver, on Etsy and today a buyer opened a Help Request saying her package arrived opened, the necklace was missing… and there were worms crawling out of the box. She even sent a pic.\n\nThing is:\n-I shipped it on Monday (Aug 11) from another country to the US via FedEx, it got there today, 3 days total.\n-My packaging is clean, sealed, and obviously has no reason for bugs to be in it. I just checked for the rest of my packaging at home and there’s no signs of bugs or larva. \n-The worms look like mealworms (like pet food), not something that just appears in shipping.\n-The pics show the box on a dusty wooden table, no outer mailer, no customs tape or signs it was opened in transit.\n-The tracking history never shows that it was held or inspected by customs, and normally when that happens there’s a seal on the package and it’s recorded in the tracking.\n\nI’m getting scam vibes, but I know Etsy tends to side with buyers in cases like this. Should I ask her for more pics of the outer package and inspection stickers first, or just escalate to Etsy right away?\n\nI do have photos from when I shipped it showing it was sealed and in perfect condition.\n\nHas anyone been through something this weird? I need urgent advice :(",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 532,
    "downs": 0,
    "created_utc": 1755105383.0,
    "media": null,
    "is_video": false,
    "num_comments": 200,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.620825237736817
  },
  {
    "score": 527,
    "title": "Please help- another seller is making my life hell",
    "selftext": "A few days ago I found a shop had copied my design, so I reported them and it was taken down.\nThey then sent three emails saying they know the laws and so on, I ignored the messages.\n\n\nSo the seller I reported have sent up a Wordpress website, added 2 of my listings (photos stolen), then sent a report to Etsy saying I had stolen the designs and Etsy removed my own designs. \n\nI’ve just looked at the website she made and she has now added more of my listings clearly to report them.\n\nShe has sent me emails to my personal email, saying she will continue to destroy my shop\nUntil I withdraw the complaint. \n\n\nI saw in her shop reviews two other sellers said she stolen their designs too, so I got in touch and they’d been treated the same but not as far as her adding their listings to her site. \n\nI’m now on holiday mode and this is my only income. Im so upset she can do this. \nI written to Etsy but in the meantime surely her reporting me will destroy my shop? \n\nI feel like I’m being stalked and I feel sick. What can I do?",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 527,
    "downs": 0,
    "created_utc": 1704752216.0,
    "media": null,
    "is_video": false,
    "num_comments": 197,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.605966517664577
  },
  {
    "score": 518,
    "title": "Omg. That Etsy ad was horrible and inappropriate",
    "selftext": "I just saw the Etsy ad that we, and make no mistake about it, we paid for that ad, about the Americans accepting the Statue of Liberty from France, and sending them a cheeseboard as a gift in return.\n\nFirst, it didn’t even mention what Etsy does. It was pathetic. \n\nSecond, Etsy doesn’t sell cheeseboards. You’re not allowed to make gift combination, packages or gift baskets on Etsy. Their terms of service specifically for bid you doing this type of listing. So what the hell? \n\nWhat is wrong with these people Etsy? Do they never leave their Starbucks infested headquarters in Brooklyn? Do they actually think that being a hipster is real life? \n\nWhat the hell?",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 518,
    "downs": 0,
    "created_utc": 1707701360.0,
    "media": null,
    "is_video": false,
    "num_comments": 274,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.572333704763589
  },
  {
    "score": 516,
    "title": "I just made my 2000th sale! Here's what I've learned.",
    "selftext": "I just made my 2000th sale today! \n\nI realize one harsh truth: You may have a passion for creating, but you may suck at running a business. \n\nYes, we are all talented, creative individuals, but it does take a separate set of skills to know how to run a business and how to sell your items. You may be the best painter in the country, but if you aren't willing to learn Etsy, you'll never make a sale. I hate to sound like a boomer, saying \"No one wants to put in the effort anymore\" but it's true. You can't just list items, and think sales will flood in. No matter what some guy on YouTube tells you. \n\nThere are so many \"gurus\" claiming to know the secrets of Etsy, but there really isn't a secret. Find a niche, and learn how to sell. Etsy is not a get-rich-quick scheme. After your friends and family have supported you, you have to learn how to make a profit from selling to random strangers. People will not buy your items just to be supportive. \n\nI realized that while I am talented - so are a million other sellers. I couldn't just half-ass it, and think I'd be rich. I had to accept that sometimes - my work just sucked. And that's okay, there is always room to grow and improve. It just takes time. \n\nAnd please please - read the seller handbook!!!",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 516,
    "downs": 0,
    "created_utc": 1733703659.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.3980112392544894
  },
  {
    "score": 493,
    "title": "How do I even respond to this?",
    "selftext": "I recycle skateboards and I turn them into stuff like shoehorns. this person purchased one for a friend and they gave me no negative comments except for me not including on what exactly I was selling them in the actual packaging?\n\nIs it my responsibility to tell the person this person bought it for what the gift is supposed to be? I would assume the person got it for them because they know what a shoehorn is but do you guys typically put a description of what you're selling in the actual packaging if it's not obvious? Even though the listing itself tells you what it is and what it does? \n\nI feel this 3-star review is super unwarranted unless there's something else I am missing here before I ask them if there was anything else that they did not like about the order, is there anything else I should ask them?",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 493,
    "downs": 0,
    "created_utc": 1752768143.0,
    "media": null,
    "is_video": false,
    "num_comments": 120,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.455119634081872
  },
  {
    "score": 477,
    "title": "Credit where it's due. Etsy has turned my side hustle into a full income for me and my team.",
    "selftext": "We all have a bone or two to pick with Etsy from time to time, and I keep seeing horror stories almost daily but credit where it's due.\n\nI was a struggling artist with a side hustle making handmade furniture for friends and family when I opened my Etsy shop in December 2019. Things took off pretty much straight away, and even though there have been some wild ups and even wilder downs, looking back over the last five years, Etsy has put food on my table and supported up to 10 employees at a time (currently 5, since the world corrected itself after Covid).\n\nIf you're just starting out, I hope this gives you a bit of encouragement to keep pushing. There's a lot to be gained if you play your cards right on Etsy.\n\nAlso, I’m open to ideas to mark our 10,000 orders. Keen to celebrate it properly!",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 477,
    "downs": 0,
    "created_utc": 1744898020.0,
    "media": null,
    "is_video": false,
    "num_comments": 117,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.412868900265181
  },
  {
    "score": 476,
    "title": "Would you be upset",
    "selftext": "Customer left me a one star, They specified in the review that they could have made it better themselves. I immediately messaged to ask if they would like a refund and reminded them I definitely have in the description it's supposed to be like a funny little gag gift and I'm new at this specific craft so they're not very professionally made 🥺 I just feel like why get it anyway and then tank my shop rating ",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 476,
    "downs": 0,
    "created_utc": 1710536313.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.395057600781824
  },
  {
    "score": 475,
    "title": "This sub stresses me out",
    "selftext": "And I'm stressed about what the response might be to this post.\n\nPeople come here to ask sincere questions, and a lot of the time they get downvoted and snarky answers (often including that OP could have found the answer themselves if they dug into it online).\n\nIt seems like a lot of people use this sub to get a sense of superiority over others by shaming them for not knowing things (including not knowing how to source info).\n\nHell, I know how to source info online, but sometimes I just want to talk to some fellow humans about it. And often times a quick post will get to a person that knows the answer faster than it would take for me to find the answer on my own. \n\nI've just noticed in myself how stressed I am when posting here; I feel like I'm walking on eggshells. Just scrolling through the main feed, about 25-30% of the posts have a \"0\" score. Imo that is abnormal. Especially given that a lot of those posts are from vulnerable new folks, just seems in bad taste.\n\nIf you're new, don't take the behavior on this sub personally. If someone gives you  crap about \"not putting in enough effort to find the answer on your own\", 1) it's incredibly normal to have to learn the skill of finding information, and despite what some people imply, you are *not* fundamentally incapable of having a successful Etsy shop just because you don't have that skill yet and 2) even if you know how to find information, it's incredibly normal to want to seek human connection and conversation over digging in on your own.\n\nApologies in advance if this post isn't allowed. The world is just making me sad recently, and it's surprising to me that this sub isn't a more compassionate place.",
    "subreddit": "EtsySellers",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 475,
    "downs": 0,
    "created_utc": 1738614739.0,
    "media": null,
    "is_video": false,
    "num_comments": 182,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.483832497585707
  }
]