[
  {
    "score": 3346,
    "title": "Seasonal Flipping: How I turn $60 into $240 over and over",
    "selftext": "(Reposted with recommended edits from mods)\n\n**TL;DR (the whole method):**\n\nI'm a seasonal flipper, so I'll flip patio furniture and other things during the summer, but patio furniture sucks to flip in the winter (there's no supply even though there's still a reasonable amount of demand), so this is what I do instead:\n\nI buy portable AC units in the winter when demand is dead for \\~$60 each, store them for a few months, and then sell them in summer for \\~$240/each.\n\nIn winter, portable ACs are like snow shovels in July: people aren’t buying.\n\nNo demand = lower prices\n\nIn summer (especially after the first heat wave), buyers shop from the bottom up and the cheap units disappear fast.\n\nHigh demand = higher prices\n\nThis is one of the few flips where the “value add” is basically timing + storage + organization.\n\nIt's just that easy\n\n**Full Post**\n\nLast summer, I made $7,200 selling \\~40 portable AC units. This summer, my goal is to sell 100.  **This is what I do and how I do it:**\n\n**1) Timing** (This is in Denver, where I am)\n\nWhen temps drop and nobody needs AC anymore (usually October where I am), I wait \\~1 month and then I hop on message place and I make $60 offers on every single portable AC that's listed, regardless of what it's listed for.\n\nAfter messaging all of the existing listings, I just use the free version of the DealScout app to send me push notifications every time a new unit is listed since facebook's native alerts for new postings don't work, and it's search algorithm sucks.\n\n**2) What I buy** (simple criteria)\n\nI’m not picky about brand. *I AM picky about completeness + condition.*\n\n**My buy criteria:**\n\n\\- Works\n\n\\- Looks decent (not trashed)\n\n\\- Has all window vent parts (hose + window kit pieces. Remote not required)\n\n**My typical offer strategy:**\n\nOffer $60 for anything decent with parts.\n\nPay up to $80 for nicer/larger units (12k–14k BTU, clean, good brand, good condition).\n\nI generally avoid paying over $100 in winter because… why? Demand is dead and you usually don’t need to.\n\nI then follow up once a month (at the end of every month) with everyone that turned me down and resend my offer and let them know I'm still interested. I'll start upping the offer too as the warm months approach if I haven't been able to get them to come down all winter.\n\n**3) How I find them** (both old + new listings)\n\n1 month after the weather gets too cold for AC's (usually November around here) I manually go through all listed ACs and message every single one of them. I offer $60 on literally every active listing, regardless of listing price, and I buy the units from the sellers that accept and follow up later with the ones that haven't yet.\n\nAfter that, I just set up my automatic search terms on DealScout and FreebieAlerts (both are free to download and use) and let those apps do literally 100% of the searching for me.\n\nWhat I personally do:\n\nSet up DealScout to watch for: **Search term:** “portable AC”  **Radius**: \"10 miles\" **Price Range:** \"$0 - $150\"\n\nSet up FreebieAlerts to watch for **Search term:** “portable AC”  **Radius**: \"15 miles\" (I'll travel farther for a free one) **Price Range:** (no price filter on freebie, which is why I use both apps)\n\nDon't pay for DS's instant alerts because you don't need them. You have absolutely no competition on the buying side for ACs in the winter, so just use the free account.\n\nBoth apps will constantly do the searching for you and will alert you when things are posted.  These will alert you every single time a new listing is posted so you don't miss anything and so you see them first.\n\nEvery time I get a notification about a new portable AC listing, I message and either ask to come grab it (when I'm available), or I offer them $60, and follow up monthly like I mentioned in the previous section.\n\n**4) Storage (this is why I think anyone and everyone can do this)**\n\nPortable AC units take up almost no room\n\nYou can put them in a spare room, closet, basement, along garage walls, a storage unit (My photo is a shipping container with \\~50 units), anywhere.\n\nOnce you’ve bought them and stored them, your “work” is basically done.\n\n**5) How to Sell Them (be patient)**\n\nI wait until after the first real heat wave to even list any of them. Basically after the first week with 90+ temps is when I'll list them.\n\nI wait until then because that first heat wave will wipe out the $100-$180 listings, and from that point on, AC's will only go for $200+\n\n**6) How many I list at once**\n\nI only list 2–3 at a time, ideally different BTUs / slightly different looks.\n\nIt keeps your messages manageable, I don't flood the market, and I just restock listings as they sell\n\nAlso: in summer, buyers come to me. I don’t deliver. I don’t meet halfway. If they want it, they come to my place. Sometimes during the winter, I can even get people to deliver them to me if demand is low enough lol.\n\n**7) My pricing ranges (ballpark)**\n\nAssuming it works, looks decent, and has all parts:\n\n**8,000 BTU: $220–$240**\n\n**10,000 BTU: $240–$260**\n\n**12,000 BTU: $260–$300**\n\n**14,000 BTU: $280–$340**\n\nThe MAIN determinant of the price it will sell for is the BTU's. Brand matters less than you’d think.\n\n**8) My listing template**\n\nI pretty much always have a description like this:\n\n“10,000 BTU portable AC. Blows ice cold. Cools \\~350 sq ft (easy for a living room + kitchen area). Includes all of it's parts, including the hose + window vent kit.”\n\nI always say \"Ice cold\" and always give the sqft it can cool\n\n**My #1 mistake (and its fix)**\n\nMistake: mixing vent parts across units all winter.  \nFix: number everything.\n\nThe first winter I bought 40+ of these, I didn't label anything, I just shoved all of the units in my basement. That ended up hurting me a lot at the end of the summer because not only did I waste tons of time trying to figure out what parts went with what unit, but I didn't do it with 100% accuracy and ended up having like 6 units at the end with no matching parts, and my profit took a hit because of that.\n\n**What I recommend:**\n\nMasking tape + marker: put a big number on each unit\n\nPut that unit’s vent kit pieces in a trash bag\n\nLabel the bag with the same number\n\nAttach/tape the bag to the unit\n\nIf you don’t do this, you’ll end the season with a pile of “almost complete” units and it hits your profit.\n\n**Try it yourself**\n\nYou don’t need to go huge.\n\nIf you buy 5 units in winter at \\~$50–$60 each (say $250–$300 total) and sell them in summer for \\~$220–$260 each, you can realistically clear \\~$1,000 before minor costs — mostly for being patient and organized.\n\nIt's simple, very foolproof, and easy to make money. All you have to do is be patient and you can make as much as you want.\n\nFeel free to ask any questions you have and I'll answer them the best I can!\n\n**Edited to add:**\n\nI do not test them at the time of buying.  That may not be the wisest practice, but I have only ever had 1 dud out of the 200+ I've sold, and I discovered it before selling.\n\nI DO test every single one before selling, and have 100% of them running and blowing \"ice cold\" when the buyer comes to check it out.  It helps secure the sale, but also keeps sleazy people from returning it after using it for 2 days while their central AC gets repaired (I've had that happen once, and now I test 100% of them so it will never happen again)",
    "subreddit": "Flipping",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 3346,
    "downs": 0,
    "created_utc": 1766003463.0,
    "media": null,
    "is_video": false,
    "num_comments": 396,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Contains a structured, repeatable sequence of actions to flip items.",
    "composite_score": 5.544050965739335
  },
  {
    "score": 2628,
    "title": "Flip of a lifetime, seller threatening legal action unless I return it",
    "selftext": "For many years, I have flipped large items locally on Craigslist and Facebook marketplace. \n\nI found an amazing deal on Facebook marketplace for an Ingersoll Rand diesel compressor posted for $1500. Models in good working condition were listed for $14,000. I almost thought it was a scam, but there were none of the usual red flags of a scam ad. The ad stated it ran rough and would need some work. I decided to take the risk and check it out.\n\nI drove an hour and 45 minutes to meet the seller, and it was a young woman who was selling for her husband who was out of town. The compressor would not start up but the engine would turn over. Still an amazing deal and I am mechanically inclined, so paid asking price in cash and towed it home. \n\nThe compressor had bad fuel and 2 bad injectors. Went through and drained the fuel, replaced fuel filter, injectors, and changed the oil. Ran like a dream after. I sold it 6 days later for $12,500 which is one of my best flips.\n\nSeveral days later I get a message from the seller stating that her husband told her the wrong price, and meant to post it for $15,000, not $1,500. She demanded I return the compressor and she would refund my money, and is getting very irate. I told her I already fixed and sold it, and she threatened to sue, stating I took advantage of her. The thing is, it didn’t run so figured it had significant mechanical issues reflected in the price, I would not have bothered if the price was $15,000. I now have at least 10 hrs invested and some cost of my own.  \n\nA side note - I use a separate Facebook profile for marketplace transactions and a google voice number on Craigslist, so I don’t think she has my actual identity. Should I simply block her? Is there any legal action she could take? I did screenshot the ad. Part of me understands it sucks to be in her position, but I held up my end of the deal and have time and money invested in this.\n\nEDIT: She only became irate and threatened legal action after I told her it was sold, stating that I took advantage of her and should have known it would not actually be for sale for $1500. However if the engine was not functional, it would be worth less. \n \nSounds like I am in the clear, and have since messaged her that since she has threatened legal action, I will only respond to her legal counsel if they reach out, and to cease all contact with me. Then I blocked her. I have saved all conversations and the original posting before it was deleted. ",
    "subreddit": "Flipping",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 2628,
    "downs": 0,
    "created_utc": 1732717329.0,
    "media": null,
    "is_video": false,
    "num_comments": 549,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Narrative about a flip with a legal dispute; lacks a clear instruction or model.",
    "composite_score": 5.509971930853484
  },
  {
    "score": 2500,
    "title": "Left something for a porch pick up and the buyer left fake money. How would you handle this?",
    "selftext": "Firstly, this did not happen to me, it was posted on a FB group for local sellers warning about this buyer\n\nA seller was selling 6 items for $20 each and they left them on the porch for porch pickup. \n\nThe buyer took the items and left fake money. \n\nWhat would you do?\n\nPersonally I would only ever hand the items to the buyer so I can check the cash. In this situation do you think the police would care?\nThe money is obviously not counterfeit but branded as copy money",
    "subreddit": "Flipping",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 2500,
    "downs": 0,
    "created_utc": 1754834600.0,
    "media": null,
    "is_video": false,
    "num_comments": 732,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for advice about handling a counterfeit/make-believe money incident; no steps or model.",
    "composite_score": 5.5506656790510664
  },
  {
    "score": 2488,
    "title": "Found 37 matured savings bonds",
    "selftext": "I run a business picking up unwanted clothing and selling it overseas. Last week someone gave us about 650lb of clothes in a series of bags. In one of the bags inside a coat was 37 savings bonds in a grocery bag. The last names on the bond matched the donors last name so I called and asked him if he knew either person listed on the bonds. He told me it was his mother and grandmother. I proceeded to tell him I had a stack of their savings bonds I would like to return to him. He and his mother picked them up and were super happy. ",
    "subreddit": "Flipping",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2488,
    "downs": 0,
    "created_utc": 1751702286.0,
    "media": null,
    "is_video": false,
    "num_comments": 136,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Short anecdote about finding and returning savings bonds; no actionable framework.",
    "composite_score": 5.206885180186797
  },
  {
    "score": 2399,
    "title": "\"I only brought 300$\" Rage",
    "selftext": "I'm writing with his wife since two days. They finally say they will come in tomorrow. They ask if they can do 300$ instead of 380$ and we agree on 350$.(See picture)\n\nFast forward I meet this guy and he keeps talking to me about his job for 15 minutes.\nHe then says \"I only have 300\" I said we agreed on 350$ and I won't go lower and he leaves after I don't sell him the ruck for 300$. \n\nWhat a waste of time wtf. What did they expect? Oh cool you basically lied to me before and you're such a nice guy here take it for free?!",
    "subreddit": "Flipping",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2399,
    "downs": 0,
    "created_utc": 1750441831.0,
    "media": null,
    "is_video": false,
    "num_comments": 362,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Emotionally expresses frustration about a lowball buyer; primarily rant.",
    "composite_score": 5.387664554229662
  },
  {
    "score": 2000,
    "title": "Honesty is always the best policy",
    "selftext": "I bought 10 copper pieces on ebay last week. Guy mistakenly sent me 20. Sat on it for a day, tempted to just keep them. I knew it was wrong but have had a rough 2024 selling. Went with my gut and messaged the guy. He was very grateful and said he wished more buyers were like this. Sent me a label to ship the others back. \n\nI don't think I believe in karma, but I was raised to know right from wrong. Just a message to all us sellers out here, keep your biz above water and we all win.",
    "subreddit": "Flipping",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2000,
    "downs": 0,
    "created_utc": 1706995116.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Moral anecdote emphasizing honesty and a lesson for sellers; explanatory but not procedural.",
    "composite_score": 5.087382736464094
  },
  {
    "score": 1830,
    "title": "I bought a $75 “media melon” from the Goodwill Bins and gave myself a week to flip the 2500 dvds/cds/bluray inside it…here’s how I did…",
    "selftext": "If you’re unaware, some goodwill outlet stores sell huge “melon boxes” full of the DVDs, Blu-ray and CDs they can’t sell. I had a garage sale about a month ago and a surprising number of people wanted to buy DVDs and CDs. So I decided to buy one just to see how much I could make off it. \n\nIt contained over 1000 DVDs and about 150 tv season sets, 1200+ CDs, about a hundred Blu-ray (including a couple season sets) and 6 Xbox one games. About 10 percent of the items were factory sealed.\n\nI first sold off a few anime DVDs I found for $15. Then I held a one-day garage sale and made $283 selling DVDs at $1 each or 3 for $2 and bluray $2 each or 4 for $5. DVD season sets were between $2-$4. CDs were 50 cents each or 40 for $10.\n\nAfter than, I sold all the remaining CDs to one guy for $50 and then all the dvds to another guy for $250.\n\nI kept a few dozen rare CDs and DVDs that I’ll sell on eBay but so far, I’ve sold off about 98 percent of the “melon box”  and have grossed $598. So that’s $523 net.\n\nNot bad for doing this all in the span of 6 days, but it was a ton of work. I also got lucky on the DVDs by finding someone willing to pay my asking price.\n\nBut it was pretty fun and i even found some cool stuff—I might just do it again 😁",
    "subreddit": "Flipping",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1830,
    "downs": 0,
    "created_utc": 1728120900.0,
    "media": null,
    "is_video": false,
    "num_comments": 233,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.84,
    "category_rationale": "Explicit step-by-step flipping process with setup and actions; actionable.",
    "composite_score": 5.174796273006768
  },
  {
    "score": 1449,
    "title": "I made over 350k flipping one product in the last 10 years - its over now, so I though you'd love the story.",
    "selftext": "Well, it finally stopped being worth my time so now I can let you in on a huge secret product that I've been holding on to for over a decade. \n\nAb Lounge. yes, the blue chair that sculpts your abs. The ones you used to see at every garage sale for 5-10 dollars. The ones that right now you can find on Facebook marketplace in any city on earth for $10.   \n\n\nFor the last decade, I've had listings on eBay for the Ab Lounge, Ab Lounge 2, Ab Lounge Ultra with 100+ inventory on each of them. All listed depending on time of year between $169 and $199, with $19.99 shipping.   \n\n\nEvery time one sold, which for a LONG time was multiple sales per day, I would pop on craigslist/Facebook marketplace, make a deal to grab one for 10-40 dollars - and go get it. I had perfect sized boxes in my truck. I would detach a few things, fold it completely flat, slide it into the box, tape it, put the label on it, and drop it off at UPS. Shipping always cost between $30-50 depending on where the customer bought from. I had a few orders over the years delay by a few days, but I never had to cancel one because I couldn't find inventory. Sometimes I'd have to drive a ways, but I always was able to deliver. The supply was so abundant because its a larger item, difficult to ship if you don't know how, and flippers largely would overlook them. \n\nFor over 6 consecutive years, my average NET PROFIT from each ab-lounge sold was over $120 per unit. I was shipping more than 12 units a week on average. \n\nOne day in 2016, I sold 21 Ab Loungers - I had none on hand. Took me 6 days to fill the orders.   \n\n\nThere were times that working an hour or two on my lunch break or before/after work, and Sundays was paying me more in profit from just Ab Loungers than my regular job.   \n\n\nSales started slowing about two years ago at the price point I needed. I dropped price a little bit, and was earning around 90-100 per unit for a while, but eventually it got to the point where I was making less than $70 per unit - so I stopped doing it. \n\nEvery time I saw someone post on these sites about finding Unicorn products that they could continually flip for a good amount of net profit, I never once let it slip what I was doing. I never had people fighting me over them at garage sales, and people never once balked when I lowballed them on Facebook/craigslist. Most of the time, even if it was listed for 40 or 60 dollars, they'd take 10 or 20 just to get rid of them. \n\nI earned around 350k over 10 years. I always planning on revealing my secret, but when it comes to best flips - I loved that I never had to pay out of pocket for vacations, new vehicles, gas, etc. I would always just use my PayPal card with eBay money from sweet, sweet Ab loungers. \n\nI know there are a ton of you out there that have a Unicorn product like this. Now that Ab Loungers aren't my thing anymore, I'll be looking for the next unicorn. Happy hunting! ",
    "subreddit": "Flipping",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1449,
    "downs": 0,
    "created_utc": 1691250720.0,
    "media": null,
    "is_video": false,
    "num_comments": 219,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "A narrative with a long-term business model and lessons learned, not a step-by-step guide.",
    "composite_score": 5.052579342646077
  },
  {
    "score": 1369,
    "title": "Someone messaged me claiming the item I found at goodwill is stolen and belongs to their company. How would you proceed?",
    "selftext": "2 years ago I found a $1000 item for $10 at a goodwill. I forgot about it and recently listed it. \n\nI get a message from a buyer stating the computer I listed belongs to the company and it’s stolen. \n\nOne thing I did is leave the company name, number, and serial on the computer, so that’s how I’m assuming he gathered a screen to show me it was part of their company. But 1000% can say I bought it legally and I’m pretty sure this was donated. There have been times I’ve bought tons of company items, and some companies will donate to goodwill. \n\nSo I’m wondering what should I do? Repost the item with the company sticker, or should I respond to the buyer? ",
    "subreddit": "Flipping",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1369,
    "downs": 0,
    "created_utc": 1758910081.0,
    "media": null,
    "is_video": false,
    "num_comments": 250,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Dilemma about a stolen item claim; seeks guidance rather than a how-to.",
    "composite_score": 5.064057427896926
  },
  {
    "score": 1329,
    "title": "Purchased an auctioned unit and it was empty...",
    "selftext": "This was a first for me. Usually we show up after winning an auction, pay, and the goods are in the locker as the photos showed. Today I was bidding on a non-lien/managers special unit that had what appeared to be a brand new Bradley Corp stainless steel triple sink with washbars... Not sure exact model from photos, but our estimate was upwards of $6,000, possibly up to $15,000. I won the auction for $100, surprisingly. Maybe people figured it would be used or something because it was a non-lein unit, but I was willing to make the gamble. While paying I was chatting with the manager who told me they opened the box to take the photos for the auction (they can because it was abandoned goods), so I was super excited because that means it was brand new. Paid, signed, and the manager walked me up to the unit. It was COMPLETELY empty. Her jaw dropped and she was on the phone with the district manager immediately. Neither of them had ever had this happen. I guess either the old tenant realized that left behind their stuff or it was an inside job. I hope they are able to figure it out based on the camera footage. Would have been a fantastic payday for me 😅",
    "subreddit": "Flipping",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1329,
    "downs": 0,
    "created_utc": 1726187739.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Anecdote about an auction slipping; no procedure or list.",
    "composite_score": 4.871504573599471
  },
  {
    "score": 1284,
    "title": "This flip took me on a wild ride",
    "selftext": "Picked up this phono preamp for $8 at goodwill. When opening the unit to clean and inspect it (before testing) , I found a rag that was balled up. This little stash has been in there for quite some time, the rag, tape and bags were all falling apart. Inside the stash I found 6 valuable diamond, platinum and gold rings that are currently being appraised (estimated to be about $3k) and $2k in scrap gold which I was given cash for.",
    "subreddit": "Flipping",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1284,
    "downs": 0,
    "created_utc": 1698527242.0,
    "media": null,
    "is_video": false,
    "num_comments": 148,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "A personal thrift-flip story with no instruction or list of options.",
    "composite_score": 4.930496261873451
  },
  {
    "score": 1134,
    "title": "Looking for advice: Sold $13k item on ebay",
    "selftext": "Hey all! So, I just sold some extremely expensive plates in eBay for $13,000. I've never sold something this expensive, so I just want to make sure I'm buttoned up and not opening myself up to losing it all.\n\nHere are some facts:\n\n- plates sold @ $12,700\n\n- buyer doesn't have any feedback\n\n- the name on the account that bought the plates is an actually reputable person in the city they are being shipping to\n\n- the address they are being shipped to shows up on Zillow as a house worth oflber $2 million\n\n- buyer left a note asking if I could ship FedEx\n\nWhat could I be missing? What extra step, if any, should I be taking to ensure that I am protected in this transaction? Any help is super appreciated!",
    "subreddit": "Flipping",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1134,
    "downs": 0,
    "created_utc": 1755804538.0,
    "media": null,
    "is_video": false,
    "num_comments": 489,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "The post seeks actionable steps to protect a high-value sale.",
    "composite_score": 5.120093901543398
  },
  {
    "score": 1116,
    "title": "Flea market and brick-and mortar folks: go buy an old vending machine.",
    "selftext": "Yes, I’m serious. Like one of the capsule toy machines you’d see at a bowling alley.\n\nI set mine up in my shop a couple of years ago. Anything too small and fiddly, I put in a mystery egg. Interesting bits of broken jewelry? Mystery egg. Old game pieces? Egg. Bottle caps, tiny figurines, glass gems, bits of paper ephemera, seashells? You guessed it, egg. I also bulk buy quartz points, tumbled stones, small fossils, stickers, and little tins and glass bottles.\n\nMy initial setup costs were about $200, which covered the machine, tokens, empty eggs, and little organza bags to hold the prizes (this protects anything fragile and keeps it from going everywhere if an egg pops open inside the machine). There’s a drawer labeled EGG RETURN in the table under it, so I can reuse most of the eggs a few times.\n\nI sell about 150 eggs a month (more during the holidays) and give people a free egg with a $100 purchase. My materials cost per egg is about fifty cents. And they make people _so fucking happy_. Grown adults! Like obviously kids like them, but grown adults are _delighted_ to get a little screw-top tin full of old buttons, or a glass jar labeled MAGIC BEANS. (They’re pinto beans from the grocery store, technically.)\n\nIt’s a serotonin machine. I _know_ what’s in there and I still get excited for people who’ve never tried it before. I have regular customers now who come in whenever they’re in the neighborhood so they can get a mystery egg — and usually they end up getting other stuff too.\n\nMy original plan was to clear out all the little odds and ends that accumulate when you sell vintage stuff. As it turns out, instead I have to actively hunt for _more_ odds and ends to keep the thing full.\n\nSeriously. Go buy a vending machine.",
    "subreddit": "Flipping",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1116,
    "downs": 0,
    "created_utc": 1705343831.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Narrative explains a business idea and the reasoning behind it.",
    "composite_score": 4.859211840489697
  },
  {
    "score": 1086,
    "title": "Need some advice on what you would do in this situation",
    "selftext": "So I had a buyer purchase a shirt that was going to New York a day or so before Christmas , I have two day handling and they placed the order on the weekend so I didn’t have to ship out til Monday, from the get go he was pretty demanding that I ship the item out , I did in the time I’m required to ship it, few days later I get a message from the seller wondering why the item is in Guam. I figured I must have put the wrong address on the label but when I checked pirateship the address was correct and the tracking was showing that for some reason it had gone to Guam. Few days later the buyer sends a message saying that it is now in Hawaii, which I assume would make sense if the situation was correcting itself. Buyer is now saying they will refuse delivery and is demanding a refund. I’m curious what some of you would do to handle this situation. Attached are photos of the conversation between me and the buyer .",
    "subreddit": "Flipping",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1086,
    "downs": 0,
    "created_utc": 1704145053.0,
    "media": null,
    "is_video": false,
    "num_comments": 372,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Requests a procedural approach to resolving a shipping dispute.",
    "composite_score": 5.0345839599906395
  },
  {
    "score": 1035,
    "title": "Couple months ago I picked up a “$100,000” drone defense radar at a thrift store for $8. I sold it for $5000 within a day of listing and just wanted to share my experience!",
    "selftext": "Price tag from thrift store: https://imgur.com/a/NM2tq5m\n\nPicture of radar: https://imgur.com/a/OIVYrVF\n\nFirst off, the MSRP is pure speculation, truthfully I have no idea since you need to inquire about their products and have only come up with those prices from a Latvian website that used to sell them and certain articles or comparable devices.\n\nI walked into the thrift store, just a normal day and nothing unusual, taking my time and got to the electronics section. When I saw it, I thought it was one of those box lights for tracing and almost walked by it but then I picked it up and felt the weight. I didn’t know what I had in that moment, couldn’t find comps but did google the company and saw they manufacture equipment for drone defense/detection so at that point I knew this had to be an expensive piece… but is there a market for it? \n\nWhen I got home, I did further research and found one comp, a previous model that you can still inquire about on their website listed for $12,000 on eBay. This was my thought process… I don’t have any power cables for this unit, I don’t have any way to test it or the know how and it’s pretty beat up so I don’t even know if it works. It being a newer model and selling it for parts/repair compared to the other seller’s working unit, I listed it for $10,000.\n\nI was getting a pretty decent amount of views and within an hour of listing, I receive a notification for a $500 offer. In the message he writes “Interesting device - unfortunately not likely worth very much for parts only!”. I decline but now I know there is some interest for this device if people are willing to shell out $500 on a chance. Then 20 minutes later I receive a $5000 offer… FROM THE SAME GUY.\n\nObviously it’s a little sus that someone would try to downplay it then offer five grand. All these thoughts came into my ahead “there is no way he’s actually going to pay” “this guy is such a scammer”. But maybe he just realized I’m not (that) stupid and cut the bullshit, throwing me an offer I couldn’t refuse. He was right, I accepted the offer and he paid right away. Maybe I undersold, who knows, I don’t think about that or care. 5K is 5K, especially on an item I can’t test and only paid $8 for. Like anybody would on a big sale though, I investigate a little…\n\nTurns out he works for a competitor company and they’re most likely going to reverse engineer this mofo and $5000 is a small price to pay for a chance to get an edge on their competitors. Plus that’s chump change to a multi hundred million dollar company. And that company is Echodyne, major investors like Bill Gates, Northrop Grumman. The radar I sold is by Fortem, a smaller company it seems but still attracting investors like Lockheed Martin and Hanwha. I’m sure these people invest in a lot of businesses but it’s still cool. Which absolutely blows my mind, how a device this advanced just randomly shows up at a thrift store for only eight measly dollars. One of the great parts about this sale is eBay barely took any money, it was only about a 4% transaction fee. Honestly, I didn’t even consider it sold until the return window was closed. I always had this nagging feeling that I was going to get an INAD but it never came!\n\nThanks for reading, a one of a kind find and my best single item flip to date!",
    "subreddit": "Flipping",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1035,
    "downs": 0,
    "created_utc": 1755556831.0,
    "media": null,
    "is_video": false,
    "num_comments": 163,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Shares the reasoning and market context for a thrift-store flip.",
    "composite_score": 4.835281679433063
  }
]