[
  {
    "score": 7,
    "title": "Built my food delivery startup using an open-source solution. Here's what worked for me",
    "selftext": "A few months ago, I was struggling to launch a local food delivery platform in my city. Think UberEats, but hyper-local and targeting underserved areas. I’m not a dev myself, but I do have a decent grasp of how things should work. I went down the SaaS route first, tried a few popular white-label platforms but the monthly fees, commissions, and rigid features made it unsustainable for my budget and needs.\n\nAfter digging around GitHub (and asking ChatGPT), I found a semi open-source project called Enatega. Honestly, I hadn’t heard of it before, but what stood out to me was that it was **self-hosted** and had **separate apps for customers, vendors, and riders** all out of the box. That was exactly what I needed.\n\nIt wasn’t plug-and-play (don’t expect magic if you’re not technical), but with some help from a friend who’s a developer, we got it deployed, rebranded, and even added a few customized features. The big win for me was **full ownership** which meant no commissions, no platform fees, and we could tweak whatever we needed.\n\nWhat I liked:\n\n* One-time cost, no recurring billing nonsense  \n* We control the data and the stack  \n* Dev-friendly backend (NodeJS + Express)  \n* They’ve got a pretty active [GitHub](https://github.com/enatega/food-delivery-multivendor) and docs  \n\nWhat could be better:\n\n* The learning curve is real if you’re non-technical  \n* Needs some design polish out of the box (we updated the UI)  \n* Deployment could be smoother but if you’ve deployed full-stack apps before, it’s doable  \n\nIf anyone is considering building their own niche delivery app (food, grocery, liquor, etc.), I’d definitely recommend looking into open-source options before locking yourself into a SaaS trap. For me, Enatega worked out. It might not be for everyone, but worth exploring if you want something more flexible and ownable. \n\nWould love to hear if you guys have any advice or have similar stories to share. I’m still very much in the startup phase so I’m looking to learn from anyone who has more experience.\n\n,",
    "subreddit": "FoodTech",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 7,
    "downs": 0,
    "created_utc": 1754566954.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Personal narrative with reasoning about using open-source technology and its tradeoffs.",
    "composite_score": 1.8166506143517749
  },
  {
    "score": 5,
    "title": "Online grocery shopping: are you interested to view food additives, carbon footprint and price/100g?",
    "selftext": "I have started online shopping and I can see this information is painful to find.\n\n1. For additives, in the best scenario for have to click on the food item (you typically don't see this info from the list of items).\n2. Carbon footprint, cant find this\n3. And most of the sites emphasize on the product price, but not the price/100g which is not great.\n\nI have just released a chrome extension that adds 1. and 2. and was considering adding 3 as well.\n\nSo far it only works for Tesco in the United Kingdom, its free, its called RevealYourFood in the Chrome Web Store - [https://chromewebstore.google.com/detail/revealyourfood/kgedpgkjpngmnogoccooglfnobheilfg](https://chromewebstore.google.com/detail/revealyourfood/kgedpgkjpngmnogoccooglfnobheilfg) \n\nWhat do you think, do you have any feedback for me? ",
    "subreddit": "FoodTech",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1724851418.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Product idea/update with a request for feedback rather than a structured guide or model.",
    "composite_score": 1.772636252551653
  },
  {
    "score": 5,
    "title": "How Smarter Cafeterias Are Redefining the Workplace",
    "selftext": "**How Lunch Shapes Your Workday** \n\nOften, people tend to underestimate how much a workday is shaped by food habits, both what you eat and the entire experience. Long cafeteria lines, limited choices, or rushing after a quick bite can leave you drained before you even make it back to your workspace. On the other hand, when food is easy to access and stress-free, it creates moments to relax, connect with colleagues, and enjoy a break. \n\nThis is where the modern workplace cafeteria plays a huge role. Food isn’t just about filling your stomach; it impacts your focus, energy, and overall productivity. Employers who prioritize convenient and well-managed cafeteria services often see a noticeable difference in how employees perform during the day. \n\n**From Boring Cafeterias to Buzzing Hubs** \n\nWorkplaces are beginning to rethink their dining spaces, moving away from traditional setups into smart cafeterias that use [digital cafeteria management](https://gokhana.com/digital-cafeteria/strategic-corporate-dining-and-cafeteria-management/) software. These technology-driven solutions make dining faster, more transparent, and more enjoyable. \n\nImagine opening an app, checking the cafeteria menu in advance, and placing an order without standing in line. Contactless food ordering not only saves time but also reduces stress during peak lunch hours. Add in themed food days, seasonal specials, or even pop-up stalls, and suddenly, the cafeteria becomes more than a necessity, It’s a hub for culture, connection, and creativity. \n\n **When Meals Spark Ideas** \n\nFood goes far beyond just fueling employees. Shared meals open up opportunities for casual conversations, quick catch-ups, and even spontaneous brainstorming sessions. Some of the most creative ideas often come from informal spaces, not meeting rooms. A smarter cafeteria setup can become an unexpected source of collaboration, innovation, and stronger workplace culture. \n\nWhen companies introduce modern dining solutions, employees save time, feel appreciated, and stay more engaged. Happier employees tend to work better, and a cafeteria that supports this naturally adds value to the entire organisation. \n\n**Tech at the Table** \n\nWhat’s really exciting is how technology is transforming something as ordinary as lunch. Platforms like GoKhana in India are [digitising cafeterias](https://gokhana.com/digital-cafeteria/strategic-corporate-dining-and-cafeteria-management/) for workplaces, hospitals, and schools. Their intelligent cafeteria management systems simplify everything from vendor coordination to menu planning and even cashless transactions. \n\nBy bringing cafeterias online, these solutions create a smoother experience for employees while giving companies valuable insights into food consumption, preferences, and operational efficiency. It’s a win-win: employees enjoy convenience, and employers gain a smarter, data-driven dining ecosystem that is more efficient. \n\n**Food for Thought** \n\nIf food influences focus, mood, and creativity, then it’s far more than just a workplace perk. A smarter cafeteria system can become one of the most overlooked yet powerful ways to boost employee productivity and satisfaction. In a world where companies compete not just for talent but also for engagement and retention, investing in [digital cafeteria management ](https://gokhana.com/digital-cafeteria/strategic-corporate-dining-and-cafeteria-management/)solutions could be a game changer. ",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1756883918.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.75,
    "category_rationale": "Explains how smart cafeterias and digital management impact work life with supporting reasoning.",
    "composite_score": 1.5281512503836436
  },
  {
    "score": 3,
    "title": "Is it just me or the opportunities totally suck",
    "selftext": "I graduated last year in food tech and forget competition it's like there isn't any jobs in the market. I find no publicly disclosed positions in any companies and if there's 1 or 2 vacancies in any position they get filled up internally by their own known people, like it's impossible to get in unless you are directly referred by the hiring manager or higher authorises. Compared to other sectors there's no mid-large scale hirings they barely need 3-5 people in their quality assurance department and another 5 in managing the process plant, rest all the labors. And not to mention the pay is so low and growth is very limited so is switching like if you take a job in plant management it's near impossible to get into quality assurance. \nIs it just me or it is like this. Some say that abroad has better opportunities but they don't bother looking at your resume unless you have years of experience.",
    "subreddit": "FoodTech",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1758786667.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Strong emotional grievance about the job market in food tech.",
    "composite_score": 1.5986356165197844
  },
  {
    "score": 3,
    "title": "Using AI to cut food waste: my experiment with GeniChef",
    "selftext": "Hi everyone,\n\n\n\nI’ve been working on GeniChef, an AI cooking app that tries to answer a simple question: what can I cook with what I already have at home?\n\n\n\nThe idea is to snap a photo of your fridge or pantry, and the app suggests recipes, meal plans, and even shopping lists. In theory, this helps people save time and cut down on food waste.\n\n\n\nI launched it a few months back and the results have been mixed: good initial curiosity, but adoption and retention are weaker than I hoped. Some people love the concept, others try it once and never come back.\n\n\n\nWhat I’d love to discuss with this community:\n\n•\tDo you see AI-driven cooking tools actually becoming part of daily food routines?\n\n•\tIs “reduce food waste” a strong enough motivator for adoption, or should the focus be on convenience and speed?\n\n•\tFor those working on similar tools, how do you balance tech novelty vs. real user habits?\n\n\n\nI’d really appreciate your thoughts — I figure this group is one of the few that really understands both the food and the tech side of the challenge.",
    "subreddit": "FoodTech",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1757262246.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Describes an AI cooking app and invites discussion on adoption and balance of novelty vs habits.",
    "composite_score": 1.5105899869919437
  },
  {
    "score": 4,
    "title": "RTD coffee ",
    "selftext": "Hello everyone!\n\nI’m developing a young, Swiss-based brand of vegan, natural oat milk latte, filled into nitrogen-pressurized cans to maintain freshness. My goal is to create a delicious and convenient beverage that can be stored at room temperature.\n\nI’m currently looking into the best retort sterilization settings to ensure long shelf-life without compromising the quality and taste of the product. Could anyone advise on the optimal temperature and duration for sterilization that minimizes product degradation?\n\nThank you so much for any insights! 🫶",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1731622471.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Technical question seeking sterilization parameters; no broader theory or steps.",
    "composite_score": 1.75
  },
  {
    "score": 4,
    "title": "Help! I'm lost.",
    "selftext": "Hey everyone! I'm really worried about my career growth in the food industry. Despite completing my graduation (3 years) and going to finish my masters (1 year) in a few of months with knowledge just enough to pass modules, I feel incompetent and insecure about my field. I didn't take my foundational year seriously due to online mode of lectures and winged tests and assessments. I am currently working at M&amp;S in the Food-hall section as part time though. I know I am passionate about this industry and want to make the most out of it but since the realisation has hit late and there's so much crucial knowledge left to be gained, I really don't know from where to start.\nAlso, what are some of the important skills needed in the food industry? Your guidance will be much appreciated.",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1720546752.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal career worry with requests for guidance and skill suggestions.",
    "composite_score": 1.8380456295278407
  },
  {
    "score": 5,
    "title": "Career for fresh graduate bachelor degree in foodtech",
    "selftext": "Hi, im a fresh grsduate in degree foodtech, \nI want to ask what vacancy I should pursue, so far in job websites related vacancies are such \n\nQA/QC\nR&amp;D\nTECHNICIAN\n\nI wonder what more jobs are valid for degree in foodtech because mostly vacancies in job websites are the three listed above \n\nBesides these three idk what else i can pursue in this field. \n\n(Sorry if im ignorant, I am a dumb student)",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1706765081.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Career-vacancy question by a fresh graduate seeking alternatives to common roles.",
    "composite_score": 1.9172268755754653
  },
  {
    "score": 4,
    "title": "Food Tech Start-ups: the Boom to Bust Cycle.",
    "selftext": "Food Tech Start-ups: the Boom to Bust Cycle.\n\nFirst, it was indoor farming, and now food and beverage companies are following suit. Bankruptcy announcements of once high-flying ag-tech and food-tech start-ups are making headlines. High-profile bankruptcies have recently been announced, including Tattooed Chef, Do Good Foods, AppHarvest, Aerofarms, and Bang Energy. A leading industry CEO believes they are only just starting.\n\n*“We’re at the tip of the iceberg. There’s going to be more fallout,” said Brian Choi, CEO of The Food Institute, a food industry media and market research company. “There’s less of an appetite from investors to keep funding a fundamentally flawed business.”*\n\nThe fundamentally flawed businesses he is referring to are the start-ups of the last half decade that sold investors on the ability to combine green consumer preferences, sustainability, and alternative food production methods. The pitch was that modern technology would make climate-friendly production possible. Even with the higher upfront costs, consumers would be willing to pay more.\n\nIn many cases, the jury is still out, but the money is also running out. Higher interest rates and the end of free money have investors no longer willing to bet on these unproven, expensive ideas. Consumers and investors have shown less enthusiasm about alternative foods when presented with the final products and costs.\n\nMany of these businesses cited inflation and supply chain costs when filing for bankruptcy. While the business environment certainly shifted, these start-ups were not built to compete when prices and costs changed.",
    "subreddit": "FoodTech",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1692554666.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Industry analysis and commentary on the boom-to-bust cycle in food tech with reasoning.",
    "composite_score": 1.4794850021680095
  },
  {
    "score": 5,
    "title": "10-Point Story of Alternative Proteins Not Being Told",
    "selftext": "While media headlines tend to emphasize current challenges, there is a significant oversight regarding the substantial progress being made by scientists, policymakers, and industry innovators worldwide.  \n\n\n1. The alternative protein industry has the potential to create significant job opportunities and contribute to the economy through real facilities and investments.\n2. Governments worldwide are increasingly recognizing the importance of alternative proteins in addressing environmental challenges and supporting food security, leading to increased funding and support.\n3. Major food companies and retailers are embracing alternative proteins as a viable business opportunity, driven by consumer demand and the potential for commercial success.\n4. Collaboration and partnerships across the food value chain are becoming more prevalent, demonstrating a collective effort to advance the alternative protein ecosystem.\n5. Continued research and development investment in alternative proteins can lead to remarkable advancements, benefiting the environment, public health, and the global food system.\n6. Innovations in harnessing plants and microbes are expanding the range of ingredients available for alternative protein production beyond traditional plant-based options.\n7. The future holds a wide variety of plant-based, cultivated, and hybrid alternative protein products.\n8. Consumers and chefs are increasingly interested in alternative proteins, with taste, price, and health being the primary factors influencing purchasing decisions.\n9. Alternative proteins offer significant environmental and societal benefits by reducing deforestation, conserving land and aquatic ecosystems, and promoting biodiversity conservation.\n10. Business-as-usual methods of meat production are insufficient to meet global demand while addressing climate change and other sustainability goals, highlighting the need for more sustainable approaches to producing meat, seafood, eggs, and dairy.\n\nSource: [https://gfi.org/blog/the-10-point-alternative-protein-story-not-being-told/](https://gfi.org/blog/the-10-point-alternative-protein-story-not-being-told/)",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1685606130.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.95,
    "category_rationale": "Explicit 10-point list of statements about alternative proteins.",
    "composite_score": 1.5281512503836436
  },
  {
    "score": 4,
    "title": "The immediate future of cultivated meat is hybrid",
    "selftext": "The cultivated meat industry is exploring ways to produce meat that is a hybrid of animal and plant-based proteins to bring down the costs of production and deal with the issue of limited supply.\n\nPlant-based proteins will allow cultivated meat companies to produce meat products that are more affordable for consumers. For example, Ivy Farm Technologies' hybrid pork meatball contains 51% pig cells and costs $20 to produce, with 95% of the cost driven by animal cells.\n\n  \nIn addition to cost, the total amount of cultivated meat produced will likely be small, so mixing animal cells with plant-based protein will help the limited supply go a lot further. For example, Upside Foods has the largest cultivated meat pilot plant in the US, which can produce 50,000 pounds of cultivated meat each year. In comparison, 51,000,000,000 pounds of chicken was produced in the US alone in 2021.\n\n*“It always shocked me that people were still trying to sell the dream of 100% cultivated,”* SciFi foods, CEO Joshua March said. *“I do think people have done themselves and the industry a bit of a disservice on that.”*\n\nSource [https://www.wired.com/story/hybrid-meat-blended-burgers-upside-foods-ivy-farm-technologies/](https://www.wired.com/story/hybrid-meat-blended-burgers-upside-foods-ivy-farm-technologies/)",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1680654011.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains why hybrid cultivated meat could be the future with supporting data.",
    "composite_score": 1.4489700043360187
  },
  {
    "score": 4,
    "title": "Overpromising and underdelivering are hurting the plant-based food industry",
    "selftext": "Many plant-based alternative protein products, particularly vegan cheese, have failed to win over consumers on a large scale due to consistent over-promising and under-delivering, including taste, cooking behaviour, nutrition, and high price.\n\nFood manufacturers, retailers, and restaurants all have to step up their game to deliver on consumer expectations, raise the bar, launch fewer and better products, invest more in R&amp;D, and focus on consumers to truly push products to taste better and have better functionality.\n\nTo achieve a sustainable food system, the food industry needs to stop over-promising, take a more selective strategy, curate and elevate the best products, incorporate more plant-based products in cooking, and manage increasing plant fatigue with customers.\n\nSource: https://agfundernews.com/over-promising-and-under-delivering-risks-the-future-of-plant-based-cheese",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1679796748.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Offers a conceptual explanation of why overpromising hurts plant-based products and prescribes strategic improvements.",
    "composite_score": 1.4489700043360187
  },
  {
    "score": 4,
    "title": "Using plants as bioreactors to revolutionize protein production",
    "selftext": "&amp;#x200B;\n\n[Photo by Francesco Gallarotti on Unsplash](https://preview.redd.it/w4qu7qxvwfpa1.png?width=800&amp;format=png&amp;auto=webp&amp;s=c40a1c9621cc5be8a14acbec96ca881e1a2a014b)\n\nMolecular farming is a technology that involves engineering plants to produce desired ingredients such as proteins. This approach to protein production has been gaining traction in recent years with several companies emerging in the space in the past few years. \n\nRecombinant protein technology is the underlying technology used in molecular farming. Recombinant protein is the production of proteins from the expression of recombinant DNA, which combines DNA from at least two sources. Cells can be programmed to become cell factories and produce specific proteins. With molecular farming, plants act as single-use bioreactors. \n\nMolecular farming involves growing plants while using them as single-use bioreactors. As usual, the plants convert sunlight, CO2, and water into nutrients, which are then used by the cells to produce the desired recombinant protein. Once the protein is produced, it must be retrieved by harvesting and processing the crop through downstream processing steps. \n\n# Companies working on molecular farming \n\n#### Miruku\n\nA plant-based alternative protein and molecular farming technology company that is developing future dairy foods and ingredients. The company is breeding and engineering plant crops to turn their cells into dairy proteins using energy from the sun. Miruku modifies plant cells to produce dairy proteins, sugars, and fats as though they were tiny cellular factories\n\n#### Mozza Foods\n\nThe Los Angeles-based startup produces cheese made from the proteins found in cow’s milk using plants instead of cows. By engineering plants to make better cheese, they are on a mission to create plant-based cheese that is indistinguishable from animal-based cheese in terms of taste and texture.\n\n#### Bright Biotech\n\nThe Manchester-based company uses genetic engineering of plants to produce high-value proteins for a wide range of applications, including R&amp;D, therapeutic, cosmeceutical, agri-food, and industrial purposes. They have developed a proprietary light-driven protein expression technology that uses chloroplasts (plant organelle that is responsible for photosynthesis) to make high yields of proteins in plants.\n\n#### Nobell Foods\n\nThey create cheese and other dairy products from plant-derived dairy proteins. The company aims to provide animal-free cheese that melts and is affordable for the majority of people who are unwilling to compromise on taste and price. \n\n#### ORF Genetics\n\nA plant biotechnology company that develops and manufactures high-quality recombinant proteins in bioengineered barley plants. The company uses barley grain as a vehicle for producing human and animal growth factors.\n\n# Benefits of molecular farming\n\n#### More cost-effective\n\nMolecular farming offers a more cost-effective approach to producing proteins and other molecules compared to traditional methods such as mammalian cell culture or microbial fermentation. Growing plants in an open field offer a cheaper alternative to building large-scale manufacturing infrastructure that’s required for mammalian cell culture or [precision fermentation](https://betterbioeconomy.substack.com/p/using-microbes-as-factories-to-produce).\n\n#### More scalable\n\nGrowing plants in large quantities is a feasible option for the large-scale production of proteins and other ingredients, as it can be easily scaled up to meet the required demand. This makes molecular farming an appealing choice for those seeking to produce significant quantities of these substances.\n\n#### More versatile\n\nMolecular farming is an incredibly adaptable approach as it allows for the genetic engineering of plants to generate an array of proteins and other compounds. This opens up many opportunities to produce a variety of products, including vaccines, antibodies, therapeutic proteins, and meat alternatives.\n\n#### More sustainable\n\nMolecular farming presents a sustainable method for protein production, as it requires fewer resources and generates fewer waste byproducts in contrast to conventional production techniques, thereby promoting environmental friendliness. This makes it a viable option for the sustainable production of food and pharmaceuticals, and it has significant implications for global food security.\n\n***Thank you for taking the time to read this article! If you found it informative and interesting, consider joining my*** [***newsletter***](https://betterbioeconomy.substack.com/), ***where I explore the intersection of biology, technology, and business in creating a sustainable food system.***",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1679556106.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Educational overview of molecular farming with examples of companies.",
    "composite_score": 1.75
  },
  {
    "score": 4,
    "title": "Meat alternatives - Market research",
    "selftext": "Hi guys! I am part of the challenge hosted by Wageningen University. We are conducting market research on plant-based meat produced from food waste. We wanted target the best audience. Please fill up this form so we can formulate nutritious and tasty meat alternative! You can also share it with your network!\n\nThank you so much for your help!\n\nRethink Waste Team \n\nhttps://docs.google.com/forms/d/1DAZU9Zxn_fSNff8rUtjPwQqtYMiaSC-vU4iiNb_ZA0Q/edit",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1678119875.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Simple request for survey participation with no substantive content.",
    "composite_score": 1.5994850021680094
  },
  {
    "score": 3,
    "title": "Exploring FoodTech SaaS Partnerships – Any Insights or Leads?",
    "selftext": "Hey everyone,\n\nI recently interviewed with a couple of leading restaurant management foodtech startups in KSA. While I’m waiting on offers, I’m trying to better understand how restaurants here and in the GCC are using 3rd-party SaaS solutions (POS, delivery integrations, loyalty apps, etc.).\n\nIf anyone has insights, recommendations, or is open to connecting me with companies in this space, I’d really appreciate it. Happy to share my own experiences with foodtech, partnerships, and scaling SaaS in the region as well.\n\nThanks in advance 🙏",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1756120941.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for insights/leads about FoodTech SaaS partnerships; content is a request rather than analysis.",
    "composite_score": 1.7015449934959719
  },
  {
    "score": 2,
    "title": "Plant-Based Meat Is the Best Investment to Tackle Climate Change",
    "selftext": "Investment in alternative meat and dairy alternatives could result in 3x more GHG reductions compared to investment in green cement technology, 7x more than green buildings, and 11x more than zero-emission cars.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/w48k0c39w1ja1.png?width=663&amp;format=png&amp;auto=webp&amp;s=11a24bddcdecf23e74d1bc8ca954b7b9a4b6a12a\n\n[https://betterbioeconomy.substack.com/p/plant-based-meat-is-the-best-investment](https://betterbioeconomy.substack.com/p/plant-based-meat-is-the-best-investment)",
    "subreddit": "FoodTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1676771255.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "States a central claim about climate impact of plant-based meat with supporting statistics.",
    "composite_score": 1.2271212547196624
  }
]