[
  {
    "score": 1300,
    "title": "Asked a former client to finally pay for my packaging design work from July 2023 (that they’re now using publicly)&amp; this is their response ",
    "selftext": "I’ve reached out dozens of times and up through January 2024, they always responded with a promise to pay once their latest investment comes in. Which was obviously BS but at least the acknowledged owing me in writing.\n\nI saw yesterday via a post on LinkedIn (and then checked their website) that they’re actually using my packaging design work and copywriting - the product is even available for sale to the public now. \n\nI reached out one last time, imploring them to pay their bill finally so we can all avoid small claims. This was their response. And yes, I have a signed contract. Absolutely wild to reply to a professional email like that. \n\n\n",
    "subreddit": "freelance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1300,
    "downs": 0,
    "created_utc": 1715702963.0,
    "media": null,
    "is_video": false,
    "num_comments": 372,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.62,
    "category_rationale": "Anecdotal complaint about an unpaid client dispute with mild emotional framing.",
    "composite_score": 5.1426317124659295
  },
  {
    "score": 934,
    "title": "My client is a Nazi",
    "selftext": "I recently onboarded a new client who hired me to  migrate his entire cloud infrastructure to in-house. One of these systems is a Samba server that the company uses for file storage.\n\nI wasn't intentionally snooping around, but during the file transfers I started seeing some odd filenames for PDFs. I decided to open one and it was an entire ebook on achieving racial purity by \"breeding out\" other ethnicities. I thought this was a little weird, but there were dozens of other ebooks on similar topics in the same folder.\n\nI looked around a little more and found a folder with pictures of my client wearing clothing with swastikas on it, one where he was doing a Sieg Heil salute. There were hundreds of pictures, but I didn't look at all of them. Frankly it wasn't that interesting.\n\nI'm pretty sure my client is a Nazi. I'll be finishing up this job (I'm under contract) and moving on.\n\n\nEdit: I'm in the US. It's not illegal to be a Nazi. Some of you also don't understand the concept of contracts and NDAs, and it shows. I've already consulted with my attorney and he has advised to finish the contract and move on. ",
    "subreddit": "freelance",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 934,
    "downs": 0,
    "created_utc": 1736822113.0,
    "media": null,
    "is_video": false,
    "num_comments": 143,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Moral condemnation of a client described as Nazi with emotional stance.",
    "composite_score": 4.7324928569201425
  },
  {
    "score": 460,
    "title": "Honestly how do you find clients?",
    "selftext": "I have a really good portfolio and have been a designer for over 10 years but I’m really struggling to find clients.\n\nI follow these YouTube videos that break the process down but they all offer the same advice and none of it is working for me.\n\nI’ve been cold messaging on linked in to companies in the sectors I like to work in but am having no responses at all.\n\nI literally got one response today that just said “no thanks” and it was actually really disheartening :(\n\nI’ve spent so much time working to get as good as I can but the actual process of finding clients is a complete nightmare and I really don’t know what to do. How do you really get clients??",
    "subreddit": "freelance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 460,
    "downs": 0,
    "created_utc": 1673892223.0,
    "media": null,
    "is_video": false,
    "num_comments": 202,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for client-finding strategies; lacks a substantive list or model.",
    "composite_score": 4.559948944346254
  },
  {
    "score": 444,
    "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
    "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
    "subreddit": "freelance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 444,
    "downs": 0,
    "created_utc": 1764053727.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Narrative of a breach and asking for how to handle similar situations; advisory potential but not explicit steps.",
    "composite_score": 4.434495658808814
  },
  {
    "score": 351,
    "title": "To everyone who’s been rejected, turned down on job leads, lost clients, gotten yelled at by clients and replaced…",
    "selftext": "I just want y’all to know — fuck em. lol They are not the end all be all to your career. They are not an indication that you’re a failure. They’re just not meant for you. \n\nI recently lost a client and every single project I did for them was a fail. I would work all night on these things and feel proud of what I had created, only for them to tell me over and over again that it was not what they were looking for. Eventually, they told me I just wasn’t the right fit and that we had to part ways. I was saddened, felt defeated. I questioned my ability to design or be a freelancer. Made me feel like I wasn’t good enough.\n\nThat was 3 months ago. Found a new client a month later and they love absolutely everything I do, they pay 3x more, is respectful, and is one of the biggest companies in the world… and I would’ve never gotten this opportunity if I had stayed with that previous client.\n\nTake rejection as a blessing.",
    "subreddit": "freelance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 351,
    "downs": 0,
    "created_utc": 1679617145.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Expresses frustration about rejection while offering a hopeful takeaway; emotional stance dominates.",
    "composite_score": 4.163136676981232
  },
  {
    "score": 302,
    "title": "I humbly present: The \"Holy Sh*t\" Package...",
    "selftext": "one day I ran an experiment and quoted my ideal price —\n\nthe one that delivers massive value, guarantees every success metric the client is solving for, and enabled me to hire specialized experts for each stage of the project.\n\nHeaded into the budget meeting, my instinct for the video project was $1,500... but the number I asked for on the call was $25,000... that would allow me to deliver the Holy Shit Package.\n\nThey went for it. I've quoted accordingly since.\n\nSTART BIG and negotiate scope after, if needed.\n\nWho's got tactics to pile on to this one?",
    "subreddit": "freelance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 302,
    "downs": 0,
    "created_utc": 1737570039.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Shares pricing strategy as a mental model (start big) and invites tactics; analytical framing.",
    "composite_score": 3.947503255862136
  },
  {
    "score": 283,
    "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
    "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
    "subreddit": "freelance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 283,
    "downs": 0,
    "created_utc": 1748902750.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Personal story of invoice dispute with advocacy for women; emotional and normative stance.",
    "composite_score": 4.184857561788747
  },
  {
    "score": 267,
    "title": "Does anyone else work freelance because they're a fucking mess in a 9-5 world? Shite body clock, poor focus, etc?",
    "selftext": "**Sleep**\n\nOften, I can't sleep for shit. I'm in my late 30s and it's never improved.\n\nI could maybe force a 8:30am rise but then I'm too tired to work. Today, I got up at 11am, and that's fine.\n\nI've read something about a caveman gene where some of us are programmed to stay up and watch the cave. I think I'm a cave watcher.\n\n**Focus**\n\nMy focus is all over the fucking place. I can hyper-focus, but it's not on what I should be doing. In other words, I procrastinate like a mother fucker.\n\nThe cave would be fucked because I'd get distracted by a badger or something.\n\nI bought a book on overcoming procrastination and never read it.\n\nI'm less pleased with these traits but again, it's fine.\n\n**Motivation**\n\nI'll hit periods where I need a few days off. I can't explain it honestly I just have zero motivation. So I do.\n\nBut I do it knowing my work labido will return. I've been through it enough. I don't let it bother me.\n\nThat's also fine.\n\n**Employers would run a mile**\n\nCan you imagine if I led with this when applying for a job?\n\nI mean, I wouldn't mention it, because you can't, but it should be more acceptable. Especially the sleep thing. Throughout the course of a given month I'll do just as well (maybe better?) as your average Joe.\n\n**Thank fuck for freelance**\n\nMy savior.\n\nI pay tax twice, don't get any benefits and would like to earn more, but as a job I LOVE it.\n\nLuckily, I charge $60-75/hour so even if I work 10 days it's enough. For now anyway, but it's within my hands to grow and earn more.\n\nI can also largely choose what to work on based on what I fancy that day/week.\n\nI'm free. I don't need your cave.\n\nClients don't know if I'm working, having a wank or going for a walk. It's none of their business anyway. I deliver each month and know my shit so, again, it's fine.\n\n**Talk to me**\n\nAnyway, I'd be interested in hearing if this resonates with anyone and/or what your day/week looks like and how you've learnt to improve.\n\nSorry if this has been posted before. It's difficult to search for \"is anyone else a fucking mess\" or similar!\n\nThanks\n\n&amp;#x200B;\n\nEdit: To those PMing me RE freelance advice I'm sorry but I don't think I'm the person to speak to.\n\nFeel free to start a thread and message me about it and I'll comment though. At least then people can call me out if I'm giving bad advice (which is entirely possible if not likely!).",
    "subreddit": "freelance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 267,
    "downs": 0,
    "created_utc": 1683233313.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Personal freelance struggles with sleep/focus; emotional, experiential venting.",
    "composite_score": 4.169553406381375
  },
  {
    "score": 266,
    "title": "I've been overcharging a client for at least 18 months",
    "selftext": "I'm in a bit of a quandary. I have a client who I like working for. My rate (so I thought) was $45/hour. I've been charging them this for at least 18 months and they've been paying it no problem. I recently wanted to increase my rate so I went and looked at the contract I signed and it says $40/hour. I did in fact charge them $40/hour for the first few months - then I apparently just changed it to $45, without asking or proposing or anything. $45 was what I was charging other clients and I guess I got confused, then I just used the last invoice as the template going forwards. Nobody noticed. What should I do about this? Can they claw back the money somehow? I assume not - I'd just stop working for them if they tried that...but I like working for them and I don't want to be dishonest. I also want to increase my rate to $55, on the basis that I haven't changed it in 2 years (except, of course, I actually have!)\n\nI'm a technical content writer and editor.\n\nUPDATE: Thanks for all your (incredibly diverse) opinions. I'm going to mention it to them because I'm sure they'll be basically fine with it and it's only right to be honest and upfront. But I also consulted a lawyer friend who said \"It's a variation of the contract by conduct - you're fine\". So if it came to it (it won't) they wouldn't be able to claw back the money - and I'm certainly not going to offer to do so.\n\nUPDATE 2: I told them and it's all sorted out. They were as confused as I was. They said they knew what my rate was and I told them it said 40 on my invoice and they just said \"we can issue you a new invoice if you like but it's not required\". When I first started I quoted 45 and they said can we start at 40 and we'll see how we go, sort of thing. Obviously I forgot that conversation and when I messed up six months later (due to starting a new invoice when away from my desktop - I know, I know, my invoices are now all online) they just accepted it. Anyway, I'm going to 55 next month. Thanks for all your replies and sorry if I was rude to any of you - I don't agree that I did anything that bad or that they are now owed that money. I'm sloppy, clearly, but I'm not dishonest and at the end of the day it's my work that matters to them. And legally there's no question about it - they accepted my invoices, which means a variation of the contract by conduct. As I said, I consulted a contract lawyer.",
    "subreddit": "freelance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 266,
    "downs": 0,
    "created_utc": 1710948294.0,
    "media": null,
    "is_video": false,
    "num_comments": 245,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Reflects on rate overcharging and uses contract-by-conduct reasoning to frame resolution.",
    "composite_score": 4.319478814916265
  },
  {
    "score": 257,
    "title": "Client emailed all of his independent contractors, and said “please check your email twice a day during holiday break”",
    "selftext": "Yikes. How would you handle that? \n\nFirst off, I am an IC. I set my schedule and I set my vacation time. \n\nHe started by saying, “I’ve just emailed the full time employees telling them how to be online over Christmas break.” I can only imagine what he asked of his actual employees? \n\nHe asked us to monitor work email (his company provided email account for me) twice a day from Christmas Eve through New Years Eve, while the office is closed. \n\nFor context, I work for this client one day a week (Tuesdays), but he has requested that I monitor his company provided email account daily. I already told him, i only work for him on Tuesdays, and that is the day I monitor his company email. As a courtesy, I check his company provided email address on Mondays the day before I work for him. \n\nOther days of the week I work for other clients, or, I am physically unable to monitor emails.",
    "subreddit": "freelance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 257,
    "downs": 0,
    "created_utc": 1734459976.0,
    "media": null,
    "is_video": false,
    "num_comments": 119,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Scenario-based question about handling workload expectations during holidays; seeking practical advice.",
    "composite_score": 4.171210328987042
  },
  {
    "score": 241,
    "title": "Sick of the hustle, considering getting a stable job, no more freelancing",
    "selftext": "After more than 12 years of freelancing, I am considering getting either a remote part time or full time job. I am so sick of having gaps where either clients don’t give me enough work, or new clients don’t come so I have to settle for the ones that I do have but have low budgets so they can’t pay me enough. I can’t even budget myself correctly bc I could have two great months, and then 4 awful ones. I dont remember the last time I took a real vacation bc of money and always being on my laptop for clients. Im just sick of the instability. Anyone else feeling this way?",
    "subreddit": "freelance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 241,
    "downs": 0,
    "created_utc": 1711966539.0,
    "media": null,
    "is_video": false,
    "num_comments": 114,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.84,
    "category_rationale": "Emotional vent about freelancing instability with no actionable steps.",
    "composite_score": 4.141664286157237
  },
  {
    "score": 231,
    "title": "Lost a great client today. ",
    "selftext": "I'm super bummed. I lost a client i freelanced for for 3 years part- time &amp; remotely. I liked the job, everyone loved my work but they just replaced me with a full- time non-remote employee. Because they want someone un the office 3 times a week (side note- the job can be done 100% remotely but whatever). \n\nAnd that was 1/3 of my monthly income so that sucks. I know I'll find another client and that everyone is replaceable but i started freelancing full time in February when i got laid off from my full time job so the thought of  hustling again to find a new client feels exhausting and depressing.\n\n\n\n",
    "subreddit": "freelance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 231,
    "downs": 0,
    "created_utc": 1717228905.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.86,
    "category_rationale": "Emotional vent about losing a client and the stress of freelancing instability.",
    "composite_score": 4.090805582189675
  }
]