[
  {
    "score": 32,
    "title": "I'm so happy I left my salary job behind",
    "selftext": "Posting just to organise thoughts to be honest.   \nI bumped into someone in the gym just now. A partner of a friend of mine. Don't know her massively well. She seemed a bit surprised i saw her and she immediately had to tell me that shes going to the gym now and working through her lunch to make up the time. \n\nI don't give a shit about what hours she does. She absolutely knows that, but she felt the need to explain this all to me. The guilt she holds for going to the gym during work hours (i guess she starts at 9am) is eating away at her that she has to blurt it out as soon as she is speaking to someone even if they are totally unrelated to their job. \n\nThat feeling, i know it well. Its this unbelievably dominating heaviness to do right by the company you work for. Even if they might not do right by you. And even if no one really cares the pressure you put on yourself to be a good employee is a real energy suck. Your constantly paranoid someone is going to work out that you aren't pulling your weight, even if you are a model employee. You put so much effort into the performance of looking like a good team member. Its just so exhausting and a total waste of energy that can be redirected in to much better things.\n\nI'm so glad i dont have to think about this anymore. I'm 41 now and I'm a little sad that I spent probably too much of my life wasting my time on these thoughts but overridingly happy that I've left this all behind. ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1739180769.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5545439355418686
  },
  {
    "score": 24,
    "title": "As an accountant, these are the mistakes I see freelancers make all the time… do these sound familiar?",
    "selftext": "I’m an accountant, and I work with a lot of freelancers, from designers, devs, creatives, writers, all sorts.\n\n  \nDifferent industries, same patterns. These are the ones I see constantly:\n\n• No cashflow buffer — income looks great until 2 clients pay late  \n• Mixing personal + business spending — makes it impossible to know if you’re actually profitable. Difficult to reconcile.   \n• Forgetting small expenses — software subs, travel, equipment, coffees… it all adds up  \n• Not putting aside enough for tax — January always surprises people (You know it's coming so why be surprised)   \n• Undercharging at the start — then realising the rate doesn’t work once you actually track your costs\n\nNothing judgmental, just stuff I keep seeing over and over again.\n\nWhat’s the money/admin mistake *you* learned the hard way?",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1765407271.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.474925010840047
  },
  {
    "score": 21,
    "title": "Looking for the best accounting software for self-employed UK",
    "selftext": "**Update -** After trying a few of the suggestions and doing a bit of digging on my end, I've decided to go with **Sage**. It works nicely with the way I already organise things, which made the decision easier. Thanks to everyone who shared advice!\n\nHey all, I'm finally getting fed up with juggling invoices/spreadsheets when tax season comes around. I'd like to switch to actual software before things met messy year.\n\nJust a few questions\n\n1. What accounting software are you using at the moment?\n2. Anything you've tried that was great (or terrible)\n3. Does it handle things like invoicing, expenses, and self-assessment without too much flaff?\n\nThanks in advance! Cheers!",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1763846917.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.760028301678009
  },
  {
    "score": 22,
    "title": "Any freelance graphic designers willing to share and compare rates?",
    "selftext": "Friends, family and even an accountant on a discovery call have now advised me that I'm too cheap and I should raise my rates. I'm a freelance graphic designer based in Manchester with 15 years experience, charging £270 a day. I get great feedback and generally have repeat clients.\n\nI've found online rate cards from recruiters or Google sheets but feel like these can be skewed heavily by top chargers. \n\nI'd love to hear from actual UK based designers what your real day rates are, or any opinions on my pricing.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1704962735.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8643028251775458
  },
  {
    "score": 19,
    "title": "Imposter syndrome when charging a client??",
    "selftext": "Does anyone else reduce the actual amount of time spent on the task when charging the client because you feel like you should have done it in a smaller amount of time??  Eg sometimes when I’m working on a task and it’s taken me approx 2.5hrs I’ll only charge them 2hrs cause I’m worried they’ll think I shouldn’t have taken that long to do it? \n\nNot sure if this is normal or just imposter syndrome thinking I’m not good enough 😂",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1710332866.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.636254456353118
  },
  {
    "score": 19,
    "title": "What’s the best invoicing software for UK freelancers right now?",
    "selftext": "Hey guys, I’m looking to upgrade my invoicing setup. I want something that’s simple, handles VAT, tracks payments, and maybe even integrates with my bank automatically. My current tool feels slow and messy once I have more than a handful of clients.\n\nI’ve heard people rave about a few options but I want to hear real-life experiences from UK freelancers, not marketing hype.\n\nWhat do you use for invoicing that actually saves time and keeps clients happy?\n\n**Update**: Tried **Sage UK** and it’s been really reliable. VAT and payment tracking are smooth, it connects to my bank easily, and clients haven’t had any issues. It’s definitely made invoicing faster and less frustrating.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1765892166.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.75
  },
  {
    "score": 18,
    "title": "How I get 10 Monthly Interviews as a freelancer.",
    "selftext": "Upwork has become very competitive, and I've had an up-and-down relationship with it since 2011 when it was called oDesk. In short, I've been through everything: good jobs, nightmare jobs, good periods, completely dead periods, got scammed, got stolen from, received good reviews, and got bad reviews. But in the end, I gained good experience, and I'll share what I learned (most of it has been said here before), some ethical and some not so ethical, please share your advice too:\n\n1- Don't be a generalist, even if you are one: I changed from Full Stack Developer to React Native Specialist. It attracts better clients looking for specialists and makes you stand out. Big clients and companies always look for specialists, while generalists attract cheaper clients.\n\n2- Only apply for jobs you can do excellently, as it shows in your proposal. Write with technical details and exactly what you'll do. Sometimes provide a small sample or diagram (but not more than 10% of the project).\n\n3- Don't apply to clients with no history or verified payment. Read old reviews and what freelancers said about them. Two negative reviews saying the same thing? Avoid them.\n\n4- When checking reviews, try to find the client's name. Starting with \"Hello John\" makes you stand out among copied proposals.\n\n5- Check the hire rate: Low hire rates usually mean posts stay open without closing, wasting your connects.\n\n6- Match the post's energy: Detailed posts need detailed proposals. Brief posts need brief proposals.\n\n7- For urgent posts, keep it short. Start with \"The work is clear and I can start now...\" Urgent clients won't read long paragraphs.\n\n8- Most clients don't want the best programmer, they want someone who says \"don't worry, I got this!\" They're often senior developers who need help with extra work.\n\nAfter getting a client:\n\n1- Keep good clients close: When you find a professional client who knows what they want and pays well, do your best for them. Bookmark their searches to see when they post new jobs.\n\n2- Aim for long-term clients. Let them know you're available for future work after completing the job.\n\n3- My trick: Offer to fix small bugs after the contract ends. It ensures five stars, as they won't give bad reviews and then ask for favors.\n\nThat's what I have now, sorry for the long text, and please share other tips I might have forgotten.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1731329172.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.9987536009528288
  },
  {
    "score": 15,
    "title": "Am I charging too much?",
    "selftext": "I'm doing free lance web development as a side gig and an agency recently reached out to me. They wanted me to build a 41 page website, 31 of the pages were very similar but had different content on each page. They only provided me with the home page design and the task was to copy the content from their current site and make the new website with the style of the home page design provided. I was going to build the website in WordPress using Elementor and wanted to charge £20 an hour. In total it would have taken me 7 days costing £1050. Is that too much? They were blown away, said it was a lot and said they'd only be willing to pay £400 maximum. I offered to reduce it to £900 but they ignored me.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1733850160.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7308463208990186
  },
  {
    "score": 13,
    "title": "Self-employment as an actor working a couple days a year... can my claims outweigh earnings?",
    "selftext": "I work as an actor, but work can literally be a day's filming for a couple of hundred pounds, and you might be lucky to get two of those a year.\n\nTechnically I could claim things like my membership to Spotlight (the only job posting board for the industry), kit for my self-tape auditions, even crazy things like haircuts that are required for a certain job. Tons of travel, office equipment, comms equipment etc etc.\n\nThe list goes on and can easily cost thousands.\n\nNaturally I also have an 'actual' job on PAYE which pays about £35k/yr.\n\nSo... could I claim these expenses against my usual Income Tax, even though I earn so little from the actual self-employed job? At what point might it flag up as being absurd?!",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1764086478.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.351128035678238
  },
  {
    "score": 13,
    "title": "Author created merch off my designs without permission",
    "selftext": "Hey all, I wonder if someone has been in this position before and has an idea of what I can do going forward. In 2018 I illustrated a series of children's books for an independent author. The written agreement I have states very clearly that I'm just giving her the rights to use the illustrations for the books, ebooks, and promotional material and that it is NOT for merchandise, and the rights to merchandise can be discussed at a later date. The reason for that is that I did not get paid very much at all (long story as to why) and I didn't want to sign over more rights for so little money espeecially as she was a difficult person to work with. I got paid, the work got done, and I thought no more of it.\n\nI happened across her instagram today and I noticed she's created plushies of the characters using my designs since July 2022. I've never been in this position before and have no idea what my next steps are. She's clearly (to me) in breach of contract. Do I send a cease and desist? I'm open to the idea of getting a contract with her to discuss the rights for merchandise but I'm clueless about where to go from here.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1673901048.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2456130378462476
  },
  {
    "score": 11,
    "title": "Is this even allowed? Job spec demanding a week of full-time work for below minimum wage…",
    "selftext": "I just came across a job ad that honestly shocked me.  \n  \nThey’re offering £300–£500 for a project that clearly needs a full week of full-time work - design, branding, multiple pages, “polished” delivery, and a 7-day turnaround.\n\nIf you break that down, it comes out below minimum wage for the workload they’re expecting.  \n  \nBut because they label it \"freelance\" they get away with it, even though the scope basically *is* a 40-hour job disguised as a “project”.\n\nIs anyone else tired of seeing companies list completely unrealistic expectations and tiny budgets, then call it \"freelance\" so they can legally underpay? It feels like it’s getting worse lately.   \n  \nNot sure whether to report it, call it out, or just laugh and move on. ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1764326084.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.0811662482156343
  },
  {
    "score": 12,
    "title": "Is £2000 too much to ask?",
    "selftext": "Hey folks,\n\nI had an interesting client encounter recently and wanted to get your thoughts before I move forward.\n\nA potential client reached out, they own a nicotine pouch company based in the UK. They wanted me to handle:\n\nFull SEO for their website (both technical and on-page optimization)\n\nReddit account management\n\nDiscord community management\n\n\nBasically, a full-blown SEO + community management hybrid role.\n\nWhen I asked about their budget, I was considering proposing a £2,000 per month retainer for all this work. This includes covering SEO audits, implementation, reporting, keyword strategy, link-building guidance, Reddit growth, Discord moderation, and ongoing community engagement.\n\nNow I’m wondering, is that too high for the UK freelance market, or actually fair given the scope (and the fact it’s not a quick one-off project but continuous management)?",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1759594910.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.53515469271794
  },
  {
    "score": 12,
    "title": "Will you share your experiences of freelancing and mental health?",
    "selftext": "Every year, I run a piece of research looking into the state of mental health in freelancing.\n\nI've been doing this since 2019, and the insights have fed into work which has supported over 250,000 freelancers, and is used by organisations like Mind UK and even the UK government.\n\n2024 has been a really hard year for many of us, so I'm using this research to shine a light on where the gaps are, and where the challenges lie in freelancing.\n\nAnd, many people tell me it's a really useful exercise in reflecting upon your year too!\n\nIt takes less than ten minutes, is completely anonymous, and I publish the results in early Jan\n\nPlease take part and share with fellow freelancers: [https://leapers.co/research](https://leapers.co/research)\n\n  \nThank you (and thanks to u/tenpastmidnight)\n\nMatthew",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1731076857.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.8189433523068366
  },
  {
    "score": 10,
    "title": "Avoid Fiverr at ALL costs.",
    "selftext": "I am at a loss here.\n\nI had my passwords grabbed by malware from a fake client on Fiverr. They were even able to withdraw from my bank account and buy crypto.\n\nI reached out to Fiverr immediately after I realized this, providing details of the situation. They proceeded to lock down my account while the investigation was ongoing. Odd, but fine.\n\nA few days go by. Nothing is heard back from Fiverr. I cannot withdraw money or respond to clients. I created a new support request, reaching out to Fiverr again asking if my account can be restored. They say I need to verify my identity and provide the last 4 digits of my phone number.\n\nWhy am I the one being investigated now? I have no idea, but I provide them the information, and again, never hear back from them.\n\nI messaged them 3 more times, 1-3 days apart each time. They will not respond. It has now been 2 weeks, they are intentionally ignoring me. Here is the conversation: [https://imgur.com/a/taHZJD2](https://imgur.com/a/taHZJD2)\n\nI have clients that are now let down, I cannot fulfill contractual obligations which puts me in a position to be sued thanks to Fiverr. They have locked down my account and will not respond to support request, which is effectively an account ban. I am also unable to withdraw the money that I earned from my work.\n\nIt gets even worse now.\n\nThe portion of this post above this line was originally posted on r/Fiverr, in hopes that someone from Fiverr would see it and be able to help me.\n\nWell, someone did see it, and proceeded to take down the post. Here's the screenshot showing my post was removed: [https://imgur.com/a/8Ih40e9](https://imgur.com/a/8Ih40e9)\n\nThis confirms that Fiverr has officially shut me down and is harboring my earnings from me. Freelancing is currently my main source of income, so this is impeding my ability to pay my bills and survive. \n\nI just want as many people as possible to see this and be very wary about using Fiverr. We freelancers are the whole reason these websites exist, and for them to treat us like this is absolutely criminal.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1724534919.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.6338926851582252
  },
  {
    "score": 13,
    "title": "Graphic design fee - is it too high? Why am I second guessing myself?",
    "selftext": "A family friend has a childcare business and asked me to design two posters for digital &amp; print, detailing the activities over the various holidays this year for her after school club.\n\nI agreed &amp; said I could do both for £150 / £30 an hour (5 hours). This fee would include any changes she needs in the future. She responded by saying that her previous designer (who ghosted her) charged £15 for 1 poster &amp; £30 for a more detailed poster. \n\nI let her know that I could see that the quality of the previous designers work is reflected in the price she was charging. I went onto say that I can design both posters for £90. \n\nI am now second guessing my fee for some reason. Is it too high? \n\n\\*\\*\\* Extra info: I now work as a filmmaker, but 10 years ago I trained and worked as a graphic designer for 3 years. Last year this family friend asked me to help her out with designing a poster at the last minute as her graphic designer ghosted. She was very happy with my design and complimented me on how much more professional it looked. ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1705023292.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6277288977117355
  },
  {
    "score": 11,
    "title": "I’m getting nowhere!",
    "selftext": "Hi everyone,\n\nI (34F) started as a freelance writer in 2015 and managed to earn a really decent living until the pandemic dried everything up. I branched out into all sorts of content marketing as well as just writing, but that was my main service — SEO stuff for websites, blogs etc. \n\nAfter realising I’m literally incapable of working FT for somebody else (after working 2 pretty high up marketing jobs) I rejoined the freelance world this time last year and holy hell, it sucks. So I’m looking for some advice.\n\nI have one client who pay me for a few hours of work every week. I found them on LinkedIn. 12 months later, I have applied to countless other freelance jobs (mainly through LinkedIn but also on job boards, through freelancer newsletters etc) and mainly heard nothing back.\n\nThe ones who I did hear back from have messed me around SO much. I’ll do a pre-interview task which I spend hours on, then an interview, then some emailing back and forth before they change their mind about wanting someone or hire someone else.\n\nThe last few jobs I’ve applied for I’ve even done unpaid tasks because I’m desperate, which ends up with me feeling resentful when nothing comes of all the time I’ve invested. \n\n I think my portfolio is pretty good, I’m really experienced in marketing now and I have 2 degrees in writing! What am I doing wrong? Please be honest but kind as I’m feeling pretty flat right now.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1752952975.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.3063025007672873
  },
  {
    "score": 11,
    "title": "Common money mistakes UK freelancers make (and how to avoid them) 💸",
    "selftext": "Hey everyone — I’m a qualified UK accountant and work with a lot of freelancers, especially in creative and online industries like Amazon FBA, designers, devs, and consultants.\n\nI’ve noticed some recurring financial mistakes that end up costing freelancers money (and stress), especially when starting out or scaling up. Thought I’d share a few here that might help some of you avoid them:\n\n**1. Mixing personal and business money**  \nEven as a sole trader, using a dedicated bank account makes life *so much easier* — for taxes, tracking expenses, and not overspending.\n\n**2. Forgetting about tax from day one**  \nA common trap: you land a few clients, money starts flowing, but you forget HMRC will want their slice later. Set aside 20–30% as you go.\n\n**3. Not claiming what you’re entitled to**  \nMany miss out on claiming allowable expenses (phone, home office, software subs, etc). And if you’re a limited company, there are *even more* options to be tax-efficient.\n\n**4. Waiting too long to get help**  \nYou don’t *need* an accountant from day one, but by the time tax deadlines roll in, or if you’re looking to go limited, it’s usually worth having someone in your corner.\n\nThis subreddit has some great advice and community support — just wanted to drop a few insights in case it helps someone here keep more of what they earn.\n\nIf anyone has questions around freelance taxes, going limited, VAT thresholds, etc — happy to answer in the comments or DMs.\n\nStay profitable ✌️",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1746556627.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2898775886267373
  },
  {
    "score": 11,
    "title": "How to attract high-paying clients in the UK ? ",
    "selftext": "[ Looking for advice] I'm a experienced freelance software developer who recently relocated to the UK. I'm finding it a bit tough to adjust to the higher rates here. Most of my previous clients were used to lower rates, and I'm struggling to find global clients who are willing to pay UK/EU market rates.\nDoes anyone have any tips on how to attract high-paying clients in the UK? Any advice would be greatly appreciated!\"\n\nP.S: I'm not trying to self-promote; I'm genuinely seeking advice from the community.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.76,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1732348164.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.126302500767287
  },
  {
    "score": 12,
    "title": "UK web development agency refuses to pay me",
    "selftext": "Hi everyone, I am not based in UK but I have been working with a web development agency for one month and a half. I sent them 2 invoices but they refused to pay me and they ultimately blocked me from their LinkedIn.  \n\n\nWhat can I do to get back my payments?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h135pi6petua1.png?width=936&amp;format=png&amp;auto=webp&amp;s=73d193606ce9157b0a2ceac5a000427252673f32",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1681898663.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5707003222457807
  },
  {
    "score": 10,
    "title": "Freelance Platforms like Malt, but for the UK?",
    "selftext": "Hi and happy new year everyone, \n\nI’m EU-based and want to expand my freelance business into the UK market. Does anyone know of premium freelance platforms similar to Malt (very popular in France) but available in the UK?\n\nI’m targeting platforms where rates and project quality match high standards (like Malt), so not Fiverr or Upwork, where pricing often feels driven down. \n\nHas anyone here worked through similar platforms in the UK? If so, what’s your experience been like in terms of:\n\n\\- Client quality\n\n\\- Rates \n\n\\- Ease of payment\n\n\\- Option to remain unlisted on Google (only visible on the platform itself)\n\n\n\nAny advice or firsthand experiences would be greatly appreciated!\n\nThanks in advance for your insights!",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1767549029.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.120468310350047
  },
  {
    "score": 10,
    "title": "How do you even start freelancing?",
    "selftext": "I really don’t understand how you are supposed to start freelancing?\n\nI boast a lot of tech skills, being a full stack dev and am happy to freelance cheap in comparison to other people, the issue is I’m not sure where to even start?\n\nUpwork is awful, Fiverr I’ve had an advert for 3 months even offering a free try it before you buy it to try and get some customers even tried cold calling/messaging small and larger businesses with 0 luck at all. I have a portfolio, I have a no risk they it before you buy it, there are many within this sector that are making an absolute killing but I can’t even seem to get a message back.\n\nSomeone please help or give some tips!\n\nAll would be appreciated, thank you :)",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1766929934.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2294567029973438
  },
  {
    "score": 10,
    "title": "Positioning self as agency vs freelancer on new website",
    "selftext": "Hi Guys, \n\nI provide digital marketing and web development / maintenance services to a few clients most of whom I have a personal connection with or acquired through word of mouth.\n\nI have a personal website mainly focused on aviation (I’m an airline pilot). It has a blog that’s getting some traffic and acts like my online CV.\n\nI still list all the freelance services and portfolio pieces of my work there.\n\nHowever now, I’m thinking in order to attract new clients and appear more professional I should keep my personal blog separate and create a new agency website like [somefancyname]digital.co.uk instead of [myfirstnamelastname].com.\n\nDoes anyone here do this? What are your thoughts? I’m not trying to appear as an agency as it’s just myself for the time being.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1756231062.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2070890277373376
  },
  {
    "score": 10,
    "title": "Building a community for uk freelancers",
    "selftext": "Im building a community\nHello all, hope you are well — I’m a freelancer myself and noticed how scattered everything is when it comes to finding local work or connecting with others in the UK who are also freelancing.\n\nSo I’ve started a new project, it’s a platform where freelancers can find local work, get verified, and actually build relationships with nearby clients and other freelancers. The core idea: less spam, more trust, and actually helping each other win. Starting off in just the UK but hopefully gonna be able to expand later\n\nCheers ✌️\n\n",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1746219137.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2313926851582253
  },
  {
    "score": 10,
    "title": "How to find clients?",
    "selftext": "I’ve started a marketing freelance service specialising in working with small ecommerce businesses. I offer a general marketing strategy service, as well as a more niche conversion rate optimisation service. \n\nMy idea is to get consistent clients in with a CRO audit worth around £80, then hopefully upsell the full marketing strategy service to some of them which I price at £800-1k one-off fee. \n\nMy main issue is getting clients. I’m trying to build a LinkedIn presence, but this feels like hard work. I’m happy to spend on ads, but so far has been really unsuccessful CTR’s on LinkedIn and Meta.\n\nOne thing I haven’t tried is cold email. \n\nWhat would you recommend for finding clients? I’d ideally want around 1-2 leads per week. My market is pretty niche, I just don’t know how to target the small ecommerce business owner space. \n\nI’m also under the illusion there are more and more small ecommerce stores these days as people launch their own businesses. I’m kind of basing that of anecdotal evidence though. ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1729611365.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.43076948563464
  },
  {
    "score": 9,
    "title": "HMRC asking for payment for this tax year AND next tax year?",
    "selftext": "Hey guys, apologies if I'm missing something obvious or stupid here but I'm pretty confused and was wondering if somebody could help explain something to me.\n\nI've been freelancing on the side of a full-time job for around four years, and filing a tax return at the end of each year as usual. My full time earnings have crept up in that time, but my freelance earning have been around the £2k mark. I'd file in April, and pay monthly until January - no problem.\n\nLast year, around June, I finished a big freelance project and took payment in full. This meant that my total turnover for last tax year (23-24) was around £7k. I filed over the weekend, and HMRC are asking for \\~£2.5k for the 23-24 tax year, PLUS \\~£1.8k for the upcoming 24-25 tax year, paid in full by January, with £1.8k again for the 24-25 tax year next July.\n\nWhy are they asking me to pay the 24-25 tax year already? I don't think I'll be doing another big project this year, so my taxes should be much much lower for that year, but either way why am I paying tax on money I haven't even earned yet?\n\nI'm a little bit panicked because I can't actually afford to pay that much money, as I use the money I earn freelancing to repay debts (I'm in a lot of debt, I know) and cover bills. It feels a little bit upsetting to have worked such long days and nights, and so many weekends, just to have HMRC turn around and ask for enough money to undo all progress I made on the debt, and then some. I'm just feeling a bit like there's no way out now, and I don't understand how I could have put in that much work, only to be in a worse situation than I was? Is this a normal thing for freelancers? I feel pretty stupid right now 😅\n\nAnyway, hope you're all well! The evenings are getting lighter!",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1712684518.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.3612113404111033
  },
  {
    "score": 9,
    "title": "Setting up as a freelance - advice needed!",
    "selftext": " So I've landed a couple of freelance clients (hooray!). Now I'm looking for some general advice, from billing to expenses to contracts. What are the essentials that I need to get in place.\n\n* Business bank account - needed? Best account for sole traders?\n* Do I need a contract or agreement to send to my clients? Where can I find a good template?\n* If I'm charging by the hour, how should I bill my clients? Is it best practice to send a breakdown of the hours?\n* Expenses - where and how should I document these?\n* Invoices - can you recommend any templates or software?\n\nAny other tips or advice would be very welcome :)\n\nAnd in case it's important, I am offering PPC and digital advertising services.\n\nThanks",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1685178124.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.9869850021680093
  },
  {
    "score": 11,
    "title": "Moving out of freelancing platforms and get bigger clients",
    "selftext": "It has been almost 4 to 5 months I have started out freelancing as a software developer, I mostly get my contracts from upwork. Now this may feel like something really ambitious considering I have only been freelancing for 5 months now, but I want to move out of upwork.\n\nI spoke with some people who have been doing this for a long while, I see they have a steady stream of contracts flowing in every month and they have really big names like pwc, spotify, microsoft in their books. But naturally no one wants to spill the recipe to get there.\n\nMy question is how do I get out of upwork and make this pipeline where I get atleast a minimum no of contract outside upwork and what places do I go looking for them? Also how do you get such contracts with these MNCs? Make no mistake, I am not looking for any shortcut but rather a path and guidance which can take me there.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1681018697.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2538025007672875
  },
  {
    "score": 9,
    "title": "Where do freelancers find clients in 2025?",
    "selftext": "Bit of a back story, I freelanced for a few years until 2018 when I went into a full time job. I used to get my clients by being active on forums, most of which are now are dead.\n\nI have been made redundant from my current job and if it's anything like my last redundancy it was 6 months till I got a new job, so thinking of dabbling my hand back into freelancing and seeing if it's possible to make it my full time job again.\n\nWhere are UK freelancers (especially developers / designers) getting their clients from in 2025? ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1758225024.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.201544993495972
  },
  {
    "score": 9,
    "title": "New IT company based in London looking to collaborate and projects",
    "selftext": "Hey everyone,\n\nI’ve recently launched an IT services company here in London. While we’re new to the UK market, our team has experience delivering software development and IT solutions for clients in the US.\n\nWe’re looking to connect with: •\tOther founders who might need tech capacity (apps, websites, integrations, cloud, IT support) •\tAgencies/contractors that sometimes need reliable subcontractors •\tAnyone who’s gone through UK public sector contracting and has tips on breaking in\n\nHappy to collaborate, share experiences, or just meet like-minded people building in London.",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1757496712.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2895906230238126
  },
  {
    "score": 10,
    "title": "If I have overseas clients, how do I protect myself in the event that they don't pay up?",
    "selftext": "I've always worked for UK based clients (design + marketing), but I feel like I'm missing out on so much potential work by avoiding anyone based overseas.\n\nI worry that I wouldn't have a leg to stand on if they didn't pay their invoice. I always get a portion upfront, but what if they don't pay the final payment?\n\nIs the only solution to just receive full payment before the work is even completed?",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1756815879.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2685139398778875
  },
  {
    "score": 9,
    "title": "Lost my first client today",
    "selftext": "Hi everyone, I’ve been freelancing part-time alongside my 9–5 for the last two years. I lost my first client this week, and part of it feels like fault - I haven’t been managing my workflow well. Between juggling emails, keeping up with deadlines, responding to inquiries and trying to track multiple projects at once, I feel like I’m constantly dropping balls.\n\nI started this freelancing job as a hobby, but some days I spend more time organizing than actually doing the work I enjoy.   \n  \nHow do you keep it all together? Or is it just a daily struggle for everyone?",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1755501269.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.2394716761534186
  },
  {
    "score": 8,
    "title": "Thinking of jumping into the  freelancing world, how to get clients?",
    "selftext": "Hi all, I’m a design strategist / UXUI designer based in London, with experience working in a consulting firm and startups - now interested in doing more freelancing work. \n\nWould you say LinkedIn is the best place to find potential clients? As I do see some posts where people would share on LinkedIn that they’re looking for contractors / freelancers sometimes. This is something I’m thinking of doing on top of reaching out to my own connections. \n\nAny freelancers here use any tools or strategies to get clients successfully? ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1754084480.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.1937141855927433
  },
  {
    "score": 9,
    "title": "Built a simple invoicing tool to manage my freelance work — sharing it in case it's useful to others",
    "selftext": "Hey folks,\n\n  \nI'm a freelance developer and was getting tired of managing invoices manually, especially around tax time and when sending files to my accountant.\n\nSo I built a small web tool for myself — [PlainInvoice.com](https://plaininvoice.com). You can create and download invoices without even logging in. But if you do register, you can save clients, track payments, and even invite your accountant or team member with view-only access (which has been a huge help for me).\n\nHere’s a short demo video if you want to see it in action: [https://youtu.be/b3ywvs-8nYM](https://youtu.be/b3ywvs-8nYM)  \nIt’s free to use — I made it mainly for myself but thought it might be helpful to other freelancers in the UK too. Open to any feedback or suggestions!",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1746603565.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.25
  },
  {
    "score": 8,
    "title": "How did you start out?",
    "selftext": "I'm in between jobs and been thinking of freelancing for years and think it's a good time to try it. I was wondering how people started out? I've looked at Upwork and trying to get my head around it all. I was wondering what your best tips are for someone at the beginning of their freelance journey? Are freelance sites the best way to get work? I'm UK based and would be offering research services. ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1766412119.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.3653521568062845
  },
  {
    "score": 7,
    "title": "UK based, freelancing for UK companies",
    "selftext": "Hi, I'm UK based freelance packaging designer. Most of my clients come from Upowrk and none of them are UK based. That works fine, and it's clear for me how to pay taxes etc. However, now I started getting enquiries over LinkedIn from UK-based businesses. \n\nI only heard about IR35, and not sure if (and how) does it apply. I operate as a self-employed. It would also be a project to create labels, not an ongoing work. \n\nCan I just invoice them and that's it? Or so I need to contact an ubrella company? I'm really confused here. If thats too much hassle for too much expense, I would rather continue working with foreign companies. \n\nAny advice much appreciated 🙏",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 7,
    "downs": 0,
    "created_utc": 1766087045.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.9671656121837653
  },
  {
    "score": 7,
    "title": "New to freelancing — how did you find your first UK clients in bookkeeping or admin support?",
    "selftext": "Hey all,  \nI’ve just started freelancing after working in UK finance and accounts for 17+ years. I’m now offering bookkeeping and reporting services to small businesses and sole traders, and I’d love to hear how others got started.\n\nI’ve listed a couple of gigs on Fiverr but haven't had any traction yet. I’m considering reaching out on local Facebook groups or maybe setting up a basic website, but I’m still exploring options.\n\nFor those of you offering similar freelance services — finance, admin, or virtual support — how did you go about getting your first few clients? Did anything surprise you in the early days?\n\nAppreciate any tips or insights. I’m open to learning and connecting with others in a similar space!",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 7,
    "downs": 0,
    "created_utc": 1753127626.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.0296349804879155
  },
  {
    "score": 8,
    "title": "Advice Needed : Finding Freelance WordPress Development Work through Agencies",
    "selftext": "Hi everyone,\n\nI am a PHP Developer with 2-3 years of experience, and I have developed a few WordPress plugins since 2020 which have around 20,000 installs combined. I have been in the UK for a year and a half, and I recently finished a Master's degree. I already have a full-time job as a PHP Developer, but I also want to do part-time freelance WordPress development.\n\nI read somewhere that working with agencies is a good way for freelancers to get work because they can give their extra work that they cannot complete to freelancers. However, I have not thought of this approach before, and I have some questions.\n\n1. Firstly, how would I go about contacting agencies for freelance work, and what would be the proper way? \n\n2. Secondly, are there any popular websites in the UK that agencies use to outsource their freelance work?\n\nI have been freelancing since 2016 and have a decent profile on Upwork with 100 jobs and plenty of 5-star reviews. However, on Upwork, people are mostly looking to pay very low rates, and I want to get out of that and work with agencies directly.\n\nLastly, are there any other ways I should be aware of as a freelancer to find work? Any advice would be greatly appreciated.\n\nThank you all in advance for your help!",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1681740902.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.005272505103306
  },
  {
    "score": 8,
    "title": "How to outreach more clients from zero?",
    "selftext": "Hi everyone. I'm a freelance 3D motion graphic and interactive designer, currently I'm working for an agency but I want to reach out more clients and make more money, it's really hard to live in UK at this moment... I have sent my portfolio to some small-to-medium agencies (one of my friends advise) but never get response. I also have fivrr and upwork account, but I feel like the market is fullfilled at this moment. I also tried to build up my personal social media site and the progress is slow. What should I do and focus on at this moment? I'm assuming that my potential clients would be small-to-medium advertising agencies just like what i worked for before? Am I wrong?? Really need some suggestion!!!! ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1746195754.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.005272505103306
  },
  {
    "score": 7,
    "title": "Is £25 per greetings card design a fair/standard amount for someone new to freelance illustration?",
    "selftext": "I'm new to freelance fresh out of arts university and was approached by a company to design greetings cards. The rate is £25 a card, which I was okay with until I did further research which suggested I should be paid much more. The cards would be simple and with practice I'm hoping they would take me around 2 hours or less, hopefully less than an hour the more I get used to the briefs as they are only simple, but the fee would include giving all rights to them and I don't get any royalties. I have signed a contract as I am keen to get the experience and start having some income, but I just wanted to clarify if this is a standard fee or if I should aim for higher fees in future? ",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 7,
    "downs": 0,
    "created_utc": 1728568221.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.0296349804879155
  },
  {
    "score": 6,
    "title": "Income Protection Insurance - is it worth it?",
    "selftext": "(This is my first reddit post, so please be nice :)) Hey guys, I'm relatively new to freelancing and was recently advised to get income protection insurance. I'm in my mid-twenties and have no health problems. So hopefully I won't have to claim it, but I think it would be a good idea to have just in case something did happen! I'm curious to hear other people's experiences and how good have the insurance companies been at paying out if something does happen\n\nWhat has been people's experience of income protection insurance? Has anyone had to claim it and was it difficult to claim the money? Are there any insurance companies I should avoid or you would recommend? \n\nThank you in a∂vance :)",
    "subreddit": "freelanceuk",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 6,
    "downs": 0,
    "created_utc": 1707429415.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.044688663038069
  },
  {
    "score": 5,
    "title": "Setting up as a Sole Trader while renting",
    "selftext": "Hi there, I'm sorry if this has been discussed/answered before but I've taken a look through the posts etc. and can't seem to find anything.\n\nI've just started doing a little freelancing on the side. It's alongside my normal job which I do 4 days a week, and I'll likely end up earning over £1000 through it, so I need to set myself up as a Sole Trader I believe (not really wanting to go limited just yet).\n\nMy tenancy agreement states I cannot run a business nor register the property as a business, which is technically fine as I can go out and do my freelance work in cafes, or if needs be, at the place I'm freelancing for. However, I'm unsure where I should register the business address and looking for recommendations?\n\nI've seen a lot about 'virtual addresses' etc. as apparently a PO box isn't accepted, but I wondered if anyone on here has experience with these and if they could recommend? Any other info/advice is gladly received - I'm a bit lost in it all and I want to get everything sorted sooner rather than later so I can crack on with the work :-)\n\n  \nTIA!",
    "subreddit": "freelanceuk",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1747594510.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.9796962438796153
  }
]