[
  {
    "score": 1460,
    "title": "It happened to me today",
    "selftext": "I’m using a throwaway for this because my normal username is also my name on socials and maybe clients find me here and don’t really want to admit this to them. On my main account I’ve been one of the people in here saying AI isn’t a threat if you’re a good writer. I’m feeling very wrong about that today.\n\nI literally lost my biggest and best client to ChatGPT today. This client is my main source of income, he’s a marketer who outsources the majority of his copy and content writing to me. Today he emailed saying that although he knows AI’s work isn’t nearly as good as mine, he can’t ignore the profit margin.\n\nFor reference this is a client I picked up in the last year. I took about 3 years off from writing when I had a baby. He was extremely eager to hire me and very happy with my work. I started with him at my normal rate of $50/hour which he has voluntarily increased to $80/hour after I’ve been consistently providing good work for him. \n\nAgain, I keep seeing people (myself included) saying things like, “it’s not a threat if you’re a GOOD writer.” I get it. Am I the most renowned writer in the world? No. But I have been working as a writer for over a decade, have worked with top brands as a freelancer, have more than a dozen published articles on well known websites. I am a career freelance writer with plenty of good work under my belt. Yes, I am better than ChatGPT. But, and I will say this again and again, businesses/clients, beyond very high end brands, DO NOT CARE. They have to put profits first. Small businesses especially, but even corporations are always cutting corners. \n\nPlease do not think you are immune to this unless you are the top 1% of writers. I just signed up for Doordash as a driver. I really wish I was kidding. \n\nI know this post might get removed and I’m sorry for contributing to the sea of AI posts but I’m extremely caught off guard and depressed. Obviously as a freelancer I know clients come and go and money isn’t always consistent. But this is hitting very differently than times I have lost clients in the past. I’ve really lost a lot of my motivation and am considering pivoting careers. Good luck out there everyone.\n\n\nEDIT: wow this got a bigger response than I expected! I am reading through and appreciate everyone’s advice and experiences so much. I will try to reply as much as possible today and tomorrow. Thanks everyone",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1460,
    "downs": 0,
    "created_utc": 1680940252.0,
    "media": null,
    "is_video": false,
    "num_comments": 511,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional vent about losing a client to AI and the threat to freelance writing.",
    "composite_score": 5.269285196422212
  },
  {
    "score": 961,
    "title": "FTC announces ban on fake reviews and testimonials",
    "selftext": "This is huge news, and in my humble opinion as a former professional reviewer, long overdue:\n\nThe final rule prohibits:\n\n* **Fake or False Consumer Reviews, Consumer Testimonials, and Celebrity Testimonials**\n* **Buying Positive or Negative Reviews**\n* **Insider Reviews and Consumer Testimonials**\n* **Company-Controlled Review Websites**\n* **Review Suppression**\n* **Misuse of Fake Social Media Indicators**\n\nMore details on the FTC website, which I'll try to link in the comments because I was automodded for trying to include it in the post.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 961,
    "downs": 0,
    "created_utc": 1723665920.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.68,
    "category_rationale": "Enumerated list of prohibited fake reviews and related practices.",
    "composite_score": 4.505209094212951
  },
  {
    "score": 866,
    "title": "I'm so mad that I have to change my writing style because of AI",
    "selftext": "I've been a writer/editor for 17 years, and it's all I've ever done. I've authored thousands of articles for high-end sites, so I'm pretty sure AI was trained on some of my work. \n\nThe longer AI is here, the more I have to change my writing style. I've had multiple clients accuse me of AI just because of em dashes, the rare ellipses, and a few strategically placed turns of phrase (e.g., in short, in other words). This is *the* writing style I used to get the numbers they're paying me for, and thanks to AI, it just looks synthetic to them. \n\nI even had a friend accuse me of using AI to text (!!), so I switched to a lazy style that I hate. I've had reddits accuse me of using AI to write posts, and I've had to add errors to get around it. \n\nI think this is giving me imposter syndrome. Every time this stuff happens, I feel like I must be a terrible writer if I sound that inhuman. And the changes I've made feel like they lower the quality of my work, which doesn't help.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 866,
    "downs": 0,
    "created_utc": 1762281437.0,
    "media": null,
    "is_video": false,
    "num_comments": 253,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Emotional frustration about AI changing writing style and self-doubt.",
    "composite_score": 4.8754359557861795
  },
  {
    "score": 437,
    "title": "Absolutely Appalling ",
    "selftext": "I'm not one to complaint, but this needs to be said. I got hired by an online blog company to write about TV and Movies...sounds, great, right?! WRONG. They made me feel really good about my writing, brought me on board and had me go through 2 weeks of intensive training. I was 95 percent done with the online modules and writing samples and then got an email saying my training had been terminated due to my writing not being \"up to par with their standards.\" \nMind you, I have an undergraduate degree in English, and a Masters in Creative Writing. They then decided only to compensate me 20 dollars for the nearly 20 hours I put into their ridiculous training program. The company is Screen Rant, and this is the crap that they're pulling on people who are talented, hard working and simply want to write. I do not stay silent when I've been treated poorly, and this crosses a line. I deserve better, and I will find better, because I'm worth it.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 437,
    "downs": 0,
    "created_utc": 1722429369.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional grievance about unfair treatment and low compensation by an employer.",
    "composite_score": 4.311089970369588
  },
  {
    "score": 336,
    "title": "Best freelance platforms for finding writing jobs",
    "selftext": "Hey, everyone. I’ve been writing content for over a decade online. I do just about everything; writing blog posts is my favorite, but I also do plenty of website copy and ad copy. I ghost write almost everything; it’s very rare for me to have anything published under my own name (which is the way I like it).\n\nAt any given time, I usually have between 10-20 clients, and work 40+ hours a week. Whenever possible, I aim for long-term work. That is the key to getting out of the feast or famine “business model” (let’s face it—feast or famine isn’t really success) of being a freelancer. I've also experimented beyond freelance writing, but continue to focus on writing as my primary source of income. \n\nOver the years, I have experimented with a whole lot of different platforms to find work, some well-known, others not as much. As a writer, your job should be writing and getting paid, not scrambling around searching desperately for clients. In the hopes that this helps some people earlier in their freelancing careers, I’ve put together a run-down of all of the freelance platforms I’ve used and their pros and cons.\n\n# The Best Freelance Writing Platforms (and Alternatives):\n\n# Upwork:\n\nIf there is just one name that springs to mind in freelancing, it is probably Upwork. On the plus side, there are many millions of active users, so you can find a ton of potential clients and gigs on this site. If you get to be really skilled at bidding and/or find some repeat clients, business can be good.\n\nThere are downsides, however. Competition is fierce. You need to pay for “Connects” to apply for gigs beyond the first few each month. There are also hefty commissions (the fee can range as high as 20%). I originally started on UpWork, but the nickel and diming for everything now has pushed a lot of the better freelancers and clients out. \n\n# Facebook Groups:\n\nThere are a number of Facebook groups that function as marketplaces for freelance writing. Out of all of them, there are only a couple that I can really recommend. I have found some work through The Copywriting Job Hub. But the best one by far is Cult of Copy Job Board.\n\nRates are usually decent through these groups, and competition is not as intense as it is through a major freelancing site like Upwork or Fiverr. Some clients here do not really seem serious/ready to hire (they do not know what they want), but others are fantastic. Your best bet here is to wait for something in your niche to come along, and then apply. There is no middleman, no limitations and no fees.\n\n# Contra:\n\nRelated to finding jobs off of traditional freelance sites is Contra. Unlike Upwork, Contra charges zero commissions, and you can submit proposals to jobs for free. That means you can apply to as many jobs as you want, and keep more of the money you earn. If you want premium features such as advanced portfolio customization, you can pay for Contra Pro (basic Contra is 100% free). Basically, it works similarly to UpWork but with greater focus on North America based employers that tend to pay better + no fees. \n\nIt has all the major advantages of UpWork (ease of booking for clients, portfolio, reviews, etc. in one place), but lets you offer all of that without fees. I use it as my primary platform for clients I get directly. I still get clients on UpWork as well, but if you have a solid portfolio I'd highly recommend Contra as it avoids the lowballing of UpWork. \n\nAny downsides? First, it's heavily focused on US based employers and most of the clients I've seen have been tech or startup related.  If you don’t have a portfolio or writing to show clients, you’ll likely have a harder time than Fiverr/UpWork as you can’t bid under $25/hour. Overall, there are less clients than UpWork for the same reason. I can’t speak to that myself as I joined with a fair bit of writing experience, but if you’re less experienced, I’d recommend using it alongside the others and seeing what works best for you. \n\n# Fiverr:\n\nAnother top site for freelance writers is Fiverr. Like Upwork, the biggest advantage of Fiverr is how big it is. Unlike Upwork, Fiverr does not have a bidding system. Whether that’s a plus or a minus depends on how you like to work, but I appreciate that it is less of a time sink (plus, I am not spending money on proposals).\n\nAlas, Fiverr is notoriously hard to break into because the competition is insane. I can confirm from my own experiences that this is the case. The market is flooded, and getting started is tough. Also, just like Upwork, Fiverr eats a chunk of your earnings through commissions. If you have a particular niche that you can turn into a Fiverr service (i.e. flat rate), it’s worth trying--just be sure to factor the fees into your rates. \n\nI can also see it working as a lead generation tool, where you'd offer a flat rate service to get client leads and then upsell them on an ongoing relationship. Just beware that Fiverr has rules against working with clients off-site, so be sure to factor in their fees.\n\n# Freelancer:\n\nLike Upwork, Freelancer.com is a site that has millions of active users. There are some things I like about it, like its on-page chat, competency tests, and flexible withdrawal options. And once again, you can find a ton of potential clients here.\n\nThere are some downsides. Just as on Upwork, those who pay the most stand the best chance of getting gigs. Also, I have not been too impressed with the quality of the gigs that I have found through this site.\n\n# PeoplePerHour:\n\nPPH is a UK-based platform that can be good for content writers. Over a million businesses are here looking for freelancers, and there is a quality matching system.\n\nThe pros and cons are very similar to Upwork, actually. Just as I have found some decent jobs on Upwork, I have found some through PPH. But the fees on PPH are similar to those on Upwork, and once again, you have a limited number of free proposals you can make each month.\n\n# Forums:\n\nOne more solid option for finding freelance writing work that is often overlooked is through web forums. Examples include affiliate marketing forums like BlackHatWorld, Builder Society and Digital Point, as well as niche forums for webmasters.\n\nThis has been one of the best channels for me to find work. Costs are minimal, and I do not have to waste time writing bids/proposals. You can find quality, long-term clients on forums without paying commissions, and you can communicate outside the forums if you want. The biggest downside is that you will not get a ton of leads as most potential clients are spending all their time on big freelancing sites. So, alas, they are just as likely to overlook forums as your competitors are.\n\n&amp;#x200B;\n\nIf you guys have any other questions about where to find freelance writing jobs or anything else, let me know and I'm happy to help where I can.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 336,
    "downs": 0,
    "created_utc": 1680551043.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "List of best freelance platforms with pros/cons.",
    "composite_score": 4.015204890031292
  },
  {
    "score": 335,
    "title": "Sold my first article!",
    "selftext": "I'm excited to have sold my very first article and wanted to share with you guys. It went on the front page of a site most people have heard of. I even got 30% over my asking price. I am an undergraduate student at 36 and have sold myself short in all aspects of my life. Now, I feel like I might just be okay at this after all. Even if I have to grind it out on evenings and weekends, I feel like finally my career is starting. Thanks for providing this space for writers to come together. Cheers, everybody.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 335,
    "downs": 0,
    "created_utc": 1675410469.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal achievement update; lacks substantive content.",
    "composite_score": 4.109459896077637
  },
  {
    "score": 317,
    "title": "I finally found the best freelance writing gig site!",
    "selftext": "You just click on the site and you'll see listings offering anywhere from hundreds of dollars to thousands of dollars for two days of work! Sure, sometimes the clients are crabby, but these things happen.\n\nAlso, my rent is $490 a month. And sometimes I'm compelled to walk out and admire my own mailbox. Also, Bella Goth keeps walking by my house, I think she's trying to flirt with me.\n\nIt's the Sims. I'm playing the Sims.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 317,
    "downs": 0,
    "created_utc": 1678122718.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Humorous anecdote about freelancing; no clear instructions or arguments.",
    "composite_score": 4.011551765183383
  },
  {
    "score": 304,
    "title": "From no experience copywriter to six-figure contract job in 10 months...",
    "selftext": "As a freelancer, I've learned that the journey to success is always challenging, but it's definitely worth it. I am sharing my story, hoping to inspire others who may be in the same boat as I was just a year ago.\n\n**In March 2022, I had never done copywriting in my life. I was a 50-year-old screenwriter with a passion for advertising and marketing, but I needed to figure out how to connect with clients.** That's when I discovered Upwork, and I started taking on random gigs - from greeting cards and board game instructions to YouTube scripts and website copy. I taught myself how to write a blog, and I read a marketing book every single week. My goal was to get paid to build a portfolio, and within a short time, I listed my rate at $75 an hour.\n\nI also wanted to legitimize myself as a freelancer, so I built a great-looking website. I bought a template and hired a web developer off Upwork for under $300. I got my portfolio items up and running, and I was ready to go.\n\nAfter eight months on Upwork, I made 15K, but I burned out on the process. I would apply for 30 jobs and only hear back on one. Plus, the stress of constantly missing new job opportunities or having a day without work was killing me.\n\nThat's when I focused my efforts on getting a long-term gig. I signed up for all the major job sites but discovered that LinkedIn offered the best opportunities to get noticed. At first, I got little traction, but I continually refined my resume and LinkedIn profile. As a writer, I realized I had a skill that could improve my situation.\n\nI also concluded that I could spend an hour applying to twenty $100 jobs on Upwork or an hour applying to twenty 50k to 100k jobs on LinkedIn. The choice was obvious.\n\nOnce I prioritized LinkedIn and optimized my resume and profile, I got traction. Recruiters reached out to me directly for jobs that weren't posted yet. I interviewed for several jobs, but the fit wasn't right. However, I took every single interview offered to improve my skills.\n\nAfter a few months of interviewing, I landed my dream contract job! I just started writing for a top telecommunications company, fully remote, for 125k a year.\n\nSo, to all the writing freelancers, keep pushing to learn more and try new things. And thanks to everyone here for your amazing guidance and tips!",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 304,
    "downs": 0,
    "created_utc": 1674676837.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.68,
    "category_rationale": "Narrative includes a sequence of actions to build a freelancing career.",
    "composite_score": 4.067237267183032
  },
  {
    "score": 294,
    "title": "I hate AI",
    "selftext": "I fucking hate AI. The company I freelance for scans all of our work to make sure it’s not AI generated. I totally get it, we’re an SEO-focused content writing group, my issue is totally not with them. \n\nHere’s my issue: I write all ALL of my pieces completely without any AI of any sort - I don’t even use Grammarly anymore. So why are the scans showing that my work is 48-50% AI? The worst part is, if the software already thinks I’m a bot, how am I even supposed to fix the pieces to scan as original?\n\nThis just plays into my complete irritation about AI being used for writing. Corporations already undervalue writers, and now they get to use software to write their stuff instead of paying actual good people for it. It’s bullshit and I hate it.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 294,
    "downs": 0,
    "created_utc": 1674591108.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.79,
    "category_rationale": "Strong emotional stance against AI in writing and its impact.",
    "composite_score": 4.2734806833522505
  },
  {
    "score": 255,
    "title": "How to politely say \"you're not paying me to sit by my computer for 40 hrs/week\"",
    "selftext": "First time posting in this sub. I'm an experienced writer, editor and content director. I've been contract/freelance since 2000, and I'm celebrating 29 years in my career this July. So I've been around a while. I've been 1/2-3/4 time while raising my kids, who are now grown, but I'm still enjoying having the freedom to handle things that come up (like elderly parent issues, dr. appts and stuff for my college kid) without stressing about work. I'm not interested in booking every minute, but I do have time to take on more projects.\n\nI just had a meeting with an agency that I work with to discuss more opportunities with other clients. I told them I'm about 60% booked with the clients I currently serve (theirs and others), and they asked several times in different ways what my turnaround time could be like on other projects. I said it depends on the project. I said it depends on what else is going on that week. I said I turn things quickly whenever possible. And finally I had to say, \"Because I'm currently only booked 60% of my time, I'm not at my computer 100% of my time.\" (I also have a hard boundary of no email on my phone.)\n\nThat felt awkward, but the fact is no one is paying me to sit at my desk for 40 hours just in case something comes up that needs a quick turn. \n\nIs there a better way to discuss this?",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 255,
    "downs": 0,
    "created_utc": 1746210367.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Question about better ways to discuss compensation boundaries; mostly a request for advice.",
    "composite_score": 3.976360583999643
  },
  {
    "score": 253,
    "title": "Client wants me to verify human written content for every article I submit now",
    "selftext": "Been writing for this client for two years. Never had issues. Suddenly they want \"proof\" that every article is human written before they'll pay me.\n\nSaid they read something about google penalizing ai content and now they're paranoid. I've tried explaining that I don't use ai, that they can see my writing style is consistent, that we've worked together forever.\n\nDoesn't matter. They want verification. Asked if I could provide some kind of certificate or report proving my work is human. I honestly don't even know if that exists.\n\nThis is insulting. I'm a professional writer getting treated like a cheating student. Has anyone else dealt with this? What did you do?",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 253,
    "downs": 0,
    "created_utc": 1764298579.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional complaint about client demanding human-writing verification.",
    "composite_score": 4.205000600867441
  },
  {
    "score": 255,
    "title": "I’ve Given Up on Writing. I Hope You Don’t Have to, but if You Feel You Need to, Please, Read This.",
    "selftext": "I got my first writing gig when I was 17 and earned myself $26 for writing a small blog for a Car Washing business. I also worked for $3 a piece, writing between 3 to 5 daily pieces, 500 words each. Then, got scammed by the same client and was owned around $50.\n\nMind you, I'm South American, and at the time, I lived in Venezuela so $50 was a lot of money to me, enough to comfortably pay for a lot of food and help around the house for a good while. \n\nAs of today, I live in Colombia and can comfortably pay for my monthly expenses with $400. I can pay my bills, and groceries, and still have some money to spare.\n\nI have been a full freelance remote writer for more than 7 years. I'm 29 now.  \n  \nI used to be part of the top 10% of freelancers on Upwork.com. I  \n  \n I worked at a content writing company for 2 years creating SEO-based blogs with backlinks, each counting 1,500 words, having to make around 1 to 2 per day.   \n  \nThen, I worked as a copywriter for a marketing agency and completed over 400 copywriting tasks in 1 year.\n\nI've written books, both fictional and non-fictional, as a ghostwriter. \n\nI've written short stories and translated over 22 articles, each one being 5,800 words.\n\nI dare to say I have experience and a track of success as a writer.\n\n  \nYet, I was laid off from my copywriter position last May. \n\nI saw it coming. My team started with 8 writers, and by the time I was laid off, we were only 3. Even a senior was laid off before me. \n\nSo I started looking for a new job as a way to prepare myself for the event, but I never landed it.\n\nI spent 9 months trying to find a job. \n\nI most likely sent over 700 CVs and applications. I did countless interviews and finished a lot of \"tests\" or \"assessments\", and some of those assessments were for companies that wouldn't answer after submitting them.\n\n  \nI was applying to Colombian companies that provided services to American companies, so some positions would pay $500 to $900 a month, a lot of money. Remote work as well.\n\n  \nBut I kept failing.\n\n  \nWhat's worse, I was in debt because I tried to save my dad from a brain tumor he was diagnosed with last year, so there were a lot of expenses and my savings went downhill. Sadly, he passed away after the surgery. He couldn't withstand it. \n\n  \nSo, I ended up in a position where I could be homeless anytime soon.\n\nNo job, no savings, no income, and severely depressed from losing my father.\n\n  \nAs an immigrant, I have no family where I live. I had to go back to Venezuela to be with my father during his last days. If it wasn't for my friends, I would be homeless right now. Many times, I would have starved throughout the days. \n\nAnd all because I wanted to be a writer.\n\nIn the last week of June, I was contacted by a recruiter to go through the process of a company. The salary was good and the job was remote so I was incredibly excited. But I didn't want to put all my eggs in one basket, so I started to apply for other jobs.  Ones that didn't involve writing.\n\n  \n3 weeks later, after a process that was incredibly slow and tedious (and the \"boss\" went on vacation and decided to put me on hold until he was back), I was told they picked another candidate.\n\n  \nI had promised myself that would be the last time I applied for a writing job.\n\n  \nSo I just contacted a call center.\n\n  \nI'm bilingual, very good in English (C2 level), and have a native level of Spanish.\n\n  \nAs you can expect, I was contacted within a day, on a Friday. Saturday, I had an interview. On Monday, I had my medical exams. On Friday, last week, I had started and was signed already. \n\n  \nAnd I feel very torn about my situation.\n\n  \nOn one hand, I am excited about the idea of stability, and there's a big chance I could be working remotely after two months within the company. The pay is fairly good, too, and so far, the company's great. Plenty of benefits, including healthcare and life insurance.\n\n  \nOn the other hand, I have to wake up at 6 a.m. and arrive at work at 8 a.m. Commuting takes around an hour, and I have no car or bike, so I have to take the metro and be a canned sardine for 40 minutes every morning.\n\nMy shift is from 8 to 6, too, so 10 hours a day.\n\n  \nA part of me cries when I remember the days I would wake up at 8, write good mornings on my copywriting portal, and just fulfill my daily tasks.\n\n  \nA part of me cries deeply knowing that I had to leave behind something I've been doing since I was a teen.\n\nAnd it saddens me to think that I might never come back to working entirely as a writer.\n\n  \nI might try to finally put some attention to my idea of writing books and becoming a self-published KDP author. Once I start earning a constant flow of $400/month from them, I could quit and dedicate myself to writing. But, as you know, it is very unlikely this will become a reality.\n\nEven then,  I have decided to give up on writing.. At least, I'll stop writing for others.\n\nNow, I'll just write for myself and the people that might read me. Whether it bears fruit or not, I'll come back in a year and share my story.\n\nIf you feel stuck as a writer and that nothing you do is working, please. think about my story and the possibilities you have available at your disposal.\n\n  \nSadly, writing has been one of the things greatly affected by AI. We are entering an age of misery, and I think we will have to adapt. \n\nI apologize for the long rant. I just wanted to vent out and share my story. \n\n  \nThank you for reading, and I hope you have a fantastic day. ",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 255,
    "downs": 0,
    "created_utc": 1722485835.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Long personal career narrative with experiences, no clear advice or structured method.",
    "composite_score": 4.118557562610624
  },
  {
    "score": 252,
    "title": "Freelance writing is a \"lazy girl job\"",
    "selftext": "I was reading about the latest TikTok trend of \"lazy girl jobs\";  those that pay well, but are remote and low-effort.\n\nSearch \"lazy girl jobs\" on TikTok and you'll find countless women showing off their easy jobs or expressing their desire for one. \n\nAnyway, the Daily Mail published a list of the most-searched \"lazy girl jobs\" and freelance writing was in the top 10.  \n\nI dunno about you, but I'd say this is anything but a \"lazy girl job\".\n\n\rIt's hard enough to be taken seriously as a freelance writer. Now, we're being undermined by TikTokers (of all people) ;D",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 252,
    "downs": 0,
    "created_utc": 1693850387.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Expresses frustration about being undermined and challenges trend; mainly opinion.",
    "composite_score": 4.069863030615142
  },
  {
    "score": 210,
    "title": "In one month I've lost all my clients",
    "selftext": "Three longterm clients I've worked with for multiple years. First one couldn't afford me anymore, which I saw coming down the pipeline as they kept mentioning AI in passing, so that wasn't a surprise. \n\nSecond one is downsizing and changing their strategies. Their weekly newsletter that I've written for three years is done as of today. They were kind enough to give me a few weeks notice and have gone above and beyond to get me over testimonials and positive feedback.\n\nThird one had a shakeup where my three contacts - all who loved my work and gave me uncomfortable levels of praise - were fired. The two remaining people, who have been there maybe six months, have never worked with freelancers before and told me it's just too much for them to handle as they try to find their footing in these abrupt new roles. Having a copywriter would just make content creation \"too complicated.\" \n\n  \nI can't believe it, how quickly everything slipped out of my hands. I know I should've and yeah, my inbound funnel got neglected while I was billing thousands to these three every month, doing work I really liked. I'm not blameless; I was complacent and I shouldn't have been. I know that. \n\n  \nIt just...it always comes faster than you were planning for. Tomorrow I start back at zero in a world that feels more hostile and like new crabs are getting added to the bucket daily.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 210,
    "downs": 0,
    "created_utc": 1706722899.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Personal setback vent with reflection; lacks actionable steps.",
    "composite_score": 4.015596000942913
  },
  {
    "score": 201,
    "title": "I got hired at the worst content mill I have ever come accross. ",
    "selftext": "\\*across \n\nThe company is called Total Apex Media. They cover topics like sports, entertainment and health and wellness, It's a fairly new company and they are posting pretty aggressively on the major job boards. The job posting I came across seemed legit as they require applicants to have at least three years of experience.\n\nIt's only after you apply that they let you know the rate for the position is $2 per article.\n\nIn addition to copy, writers are expected to do all of the backend work in WordPress themselves. I decided to take the job simply to spruce up my portfolio a bit.  It was easy as there was no interview. They pretty much hire you on the spot.  They have hired upward of 200 people from all around the world to pump out content 24/7.\n\nThe pay is offensive enough, but the thing that really put me over the edge is the way they treat their writers. Writers are expected to produce a minimum of five articles per week. I am in my first week and higher-ups have already reached out to demand I meet my weekly quota. Today (Sunday) the Chief Editor informed us that we simply have no excuse to not be writing articles today. This is legit one of the most deranged things I have ever read.\n\n&gt;u/channel Good morning, Everyone: I have added seven topics to the Relationships tab (six have links that essentially write the article for you) on the Google Sheet, five Music topics, four of the five classic Black sitcom topics I posted in Television remain, six Spirituality topics, and two topics I posted in Books on Richard Wright's *Native Son* and Don DeLillo's *White Noise* are still available. When I return home from various Sunday services around 3:30 p.m. EST, I will post more topics in these verticals and the Movies vertical. Everyone, please write and submit at least one article today. Yes, even on a Sunday. You can do it. I have ten employers (not including Total Apex), am a graduate student purely for fun at three universities, and have significant health challenges, and I will still write and publish at least one article today. Yes, I'm insane and have a ridiculous schedule. However, it goes to show that no one, not a single person in the company, has an excuse not to write a 600-word article (or 700-word Health and Wellness article), especially when the \"For More Great Content\" is already 164 words, leaving only a minimum 436 words for you to write (536 words for Health and Wellness). You have no excuses unless you're experiencing an emergency and/or extenuating circumstances. Come on, only 436 or 536 words a day? Not much to ask at all. Let's have a great day and rock and roll! Thank you!\n\nTalking this way to people who are essentially working for free is definitely a choice.\n\nHaving previously written for Screen Rant, I thought the Valnet properties were the bottom of the barrel for these types of sweatshop style content mills. But even Valnet paid $10 per article and never demanded I work on Sunday.\n\nSeriously, if you come across this company, do not waste your time.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 201,
    "downs": 0,
    "created_utc": 1724007285.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Ventary critique of low pay/poor treatment at an employer.",
    "composite_score": 4.042512056337945
  },
  {
    "score": 199,
    "title": "I’m tired of hearing about ChatGPT",
    "selftext": "I’m sick to death of spotty 16 y/o ignorant 4chan edgelord neets telling me that ChatGPT is going to put me out of work within the next year.  \n\nChatGPT is shite. It cannot do work at my level and I doubt it ever will be able to. I’m not a mill writer pumping out volume crap stuffed with nonsense keywords.\n\nThe sooner the ChatGPT hype dies it’s inevitable death, as was the case with NFTs and crypto, the better",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.76,
    "subreddit_type": "public",
    "ups": 199,
    "downs": 0,
    "created_utc": 1683451493.0,
    "media": null,
    "is_video": false,
    "num_comments": 222,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Angry/resentful stance against ChatGPT hype; emotional.",
    "composite_score": 4.045182427188061
  },
  {
    "score": 191,
    "title": "An open letter to ChatGPT and AI fearmongerers",
    "selftext": "I know the sub is tired of all these ChatGPT question posts, but this one’s different. I’m a SEO article writer, copywriter and YouTube scriptwriter and I’ve been using Jasper, ChatGPT, and even other “lesser” AI tools, although many of these have niche uses better than the aforementioned two. I’ve even been contacted by AI writer developers to test out and market their apps because of my writing niche (Web3, Crypto, AI) so I’m confident in my knowledge of their uses and limitations. I won’t be namedropping those here to avoid promos.\n\nTo you, AI writing assistant fearmongerer, and firm believer that the freelance writing career will be over in 2 years. Have you ever tried using ChatGPT and reading the things it comes up closely?  \n\nI know how to use the more complex prompts for these AI tools. I don’t just type “write an X word article about x topic.” I ask it to develop headlines, and synonyms or rewrite existing content in a celebrity’s tone and voice. \n\nI’m planning to release my AI prompt cheat sheet for newbie writers soon to understand the use cases and limitations of AI prompts realistically.\n\nAnd I’m telling you, ChatGPT is NOT ready to replace writers, nor are the other tools. They can be great as writing aid, but they aren’t powerful enough.\n\nThey won’t be in the next version, either. AI tools have difficulty identifying voice, tone, and sounding like a human. \n\nHowever, you can use these as a faster google. “Give me ten definitions on X” is much faster than searching ten definitions manually. It’s fantastic at that.\n\nClients are freaking out because of what they perceive as AI content. Agencies are between embracing them or fearing them like the plague.\n\nBut seriously, cut the fear-mongering. If this is your excuse not to start freelancing or quit freelancing, then I don’t think this is the job for you. You fear a tool that can enhance your writing (if used intelligently) instead of embracing it as an alternative.\n\nThanks for reading my rant!",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 191,
    "downs": 0,
    "created_utc": 1674930229.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Argues against AI fearmongering and discusses practical use of AI tools; provides guidance.",
    "composite_score": 3.9336188260023244
  },
  {
    "score": 187,
    "title": "Google Destroying Everything",
    "selftext": "I have been in the industry for over a decade. I have always had long-term, high-value clients from Raptive and Mediavine Network for content writing. Recently 80% of my clients have either terminated the contract or revised it down significantly.\r  \n\r  \nSince the Helpful Content Update in September, sites have been struggling. Now they have collapsed significantly. I am not talking about spam or niche sites being deindexed. They are not deindexed but down more than 50%. All of my clients are experts in their domains. Most of them rely on advertising income, not through affiliation. These are decade-old sites with nothing to do with AI or any black hat SEO tricks. Most of them are still ranked on the first page for many keywords, but since Google made significant changes in the SERP, the traffic is down even with the same ranking.\r  \n\r  \nI'm sure some people still think Google as virtuous and they might be generalizing all bloggers as spammy who were affected by these updates. However, if we look at the keywords, it's evident that Google is rewarding Reddit, Quora forums and penalizing small and medium bloggers. I feel like my whole decade-long career has gone to waste.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 187,
    "downs": 0,
    "created_utc": 1712237873.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Career-impact rant about Google's update affecting clients.",
    "composite_score": 4.000899323540647
  },
  {
    "score": 184,
    "title": "It’s not enough being just a writer anymore and when I embraced that my life changed",
    "selftext": "Just read a super real post from u/rustykeys1 and felt strongly compelled to share my two cents as well bc I think this is single-handedly the only reason I survived the post-Nov-2022 AI epidemic while writers all around me got killed.\n\nGuys. \n\nWriting, it’s not enough anymore.\n\nI realized this pretty early on after OpenAI released ChatGPT and I honestly believe you guys are better off accepting this, learning a few more skills, rather than finding another job in a completely new domain.\n\nSome things I did to become IRREPLACEABLE:\n\n- Learned keyword research with SEMrush so I could provide clients relevant content IDEAS instead of just writing stuff they gave me. Took me an hour or two?\n\n- Started designing branded infographics on Canva to complement certain sections of my blog posts (literally asked ChatGPT for ideas, put it to life, slapped the client’s logo and website on the bottom right). I was naturally a creative and visual person, this came pretty easy.\n\n- Added tables and diagrams to my blog posts to make content more digestible \n\n- Designed attractive and attention-grabbing CTAs for them. I’m a B2B writer which means every single piece of content I write has a dual purpose: to educate and to sell something. \n\nSo I practiced copywriting alongside standard content writing. \n\nBut wanna know something I found out about the point above? There’s a huge disconnect between the writers and developers on CTA implementation - like where it should be placed and where it should go. \n\nI closed this gap by using ChatGPT as my personal developer/designer. Here’s what I did - and you can replicate this process for quite literally any task or function -\n\n1. Took a screenshot of an example CTA / image / design I liked and fed it to ChatGPT 4.0\n\n2. Asked it to create the code that would allow me to add it as an interactive element on the website (if it was a CTA, I also provided the end URL that the button should take the user too) \n\n3. This is what was game changing for me. I discovered a tool called codepen which basically lets you preview what the code is supposed to look like. So, without actually knowing how to code, all I did was paste the generated html from ChatGPT to codepen and made comments based on the visual preview.\n\n4. I literally took a live screenshot of the preview from codepen, fed it to ChatGPT again, and gave feedback (e.g., “change the background color to green and align the button to the middle of the CTA box and change the copy in the button to “Try free for 7 days” and link to [URL]”) \n\n5. Repeated this until my CTA was perfect, then attached that final embed code to the end of my article for the client/developer team to then transfer to the website CMS.\n\n- Also bought a Surfer SEO subscription and delivered articles not through Google docs but Surfer draft links so clients can see all the keyword optimizations and SEO best practices I followed along with an SEO content score\n\n\nAnd you think my clients would ever choose someone else over me when they couldn’t do the above? \n\nAll of the above probably took me a grand total of 5-6 hours to learn and get the hang of. And my article production time is around the same because AI is helping me write faster but I’m using that saved time to make the above improvements to the content.\n\nLmk if you guys have questions happy to answer. ",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 184,
    "downs": 0,
    "created_utc": 1731225132.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.8,
    "category_rationale": "Offers concrete steps to become irreplaceable; a how-to playbook.",
    "composite_score": 3.8351091562392594
  },
  {
    "score": 183,
    "title": "Lost my biggest client to their own fuckup",
    "selftext": "Welp.\n\nI got a message today.\n\n“We are writing to inform you that as of today, all your permissions have been removed, and we are parting ways professionally.”\n\nThe reason?\n\n“Spelling the client's name incorrectly or using the incorrect name altogether, specifically their competitor's name.”\n\nI had a hunch and looked. This was the client who EXPLICITLY TOLD ME to use that name. I had assumed it was a client company of theirs.\n\nI have emailed the people I do work for, alas, to no avail. \n\nSadly, their 2.8 cents per word, and eventually the “dramatic” increase to 2.9 cents per word that I have been doing for the past five years never increased any further, while inflation continued apace. \n\nI’ve recently been writing 5,000 words a day, explicitly without AI, and doing research to back it up. I am dead on my feet and haven’t seen enough of my daughter. She’s 4.\n\nI was pretty much falling asleep while writing articles for them. I don’t doubt I must have sent a client something that included my half asleep attempts to type something coherent at some point, but they’ve not mentioned it.\n\nNo, what they’ve removed me from the system for is… doing exactly what they told me to do. Following the instructions of the client.\n\nFor fuck’s sake.\n\nHopefully this leads to better things.\n\nI’m glad I get to see my daughter.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 183,
    "downs": 0,
    "created_utc": 1762560817.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Emotional vent about client mistake and career impact.",
    "composite_score": 3.785847818673518
  },
  {
    "score": 181,
    "title": "Lost my second client thanks to AI. Losing all hope for this line of work.",
    "selftext": "The first one ended our collaboration in favor of using AI. The stuff they post now is horrendous but they don't seem to care... or it works for them? \n\nToday, another client notified me that their new rate for writers is three times smaller than my minimum. I'm not expensive and haven't raised prices in a year and a half, so I declined to continue working with them. \n\nI will start actively looking which of my skills are transferable so I can gtfo. I don't see how the situation might improve in the following years. I'd already be on streets or back living with my folks if they weren't generous enough to send some money so I can survive. \n\nMy work is of great quality. I never use AI, I reach out to industry experts for each piece I write to create original articles. My work ethic is solid. I don't think I have anything more to give. ",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 181,
    "downs": 0,
    "created_utc": 1706747252.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Strong emotional vent about losing clients and AI impact on freelance writing.",
    "composite_score": 3.9837846369553866
  },
  {
    "score": 177,
    "title": "It finally happened to me...",
    "selftext": "I do freelance writing on the side of a full-time day job, but have a roster of clients that was essentially a second full-time job. \n\nOver the past approx. 10 days I've lost pretty much all of them. Well, I didn't \"lose\" them, but they're all putting a pause on projects for now for various reasons. AI, budgetary issues, the economy, the election (I'm in the US). \n\nI knew it was coming eventually, but still hurts especially with what I'm dealing with in my personal life finance wise. Just wanted to give a shout out to everyone to stay positive and keep pushing forward. Hopefully it's just a phase, but for the first time in 13 years I feel a little lost.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 177,
    "downs": 0,
    "created_utc": 1722802475.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Personal hardship and frustration from losing clients and AI budget pressures.",
    "composite_score": 3.8214689312767525
  },
  {
    "score": 179,
    "title": "My career is a joke",
    "selftext": "EDIT: I'm humbled by the great, inspiring dialogue here and everyone's encouragement. Y'all are the best!! \n\nY'all, I'm turning 44 next month and I can't help but think about how lame my career is. Honestly, I've only written for and edited extremely small potato publications, and I'm constantly around peers who write for national magazines and get more serious assignments...not just \"custom\" content, which is basically glorified advertising. \nAs a kid, I said I wanted to grow up and be a writer, but I never said what kind. I've always thought magazines are my passion, but lately I'm wondering if I'm just lost. And don't even get me started on essays, poems and short stories. Let's just say that when you read literature on a regular basis, you know when you aren't capable of producing it. \nIt's too late to become a dentist, but last night I thought maybe i can sell my valuable condo and buy a bunch of cheap places and just become a scummy landlord.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 179,
    "downs": 0,
    "created_utc": 1706288937.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Self-doubt and frustration about career path.",
    "composite_score": 3.881729183424734
  },
  {
    "score": 174,
    "title": "Being asked for a refund because my writing was “AI Generated”",
    "selftext": "A relatively new client just demanded a refund or edit because they put my writing through an AI checker a couple of sentences came back as “probably 65% chance of being written by AI”. \n\nI have no way to prove it is original, and they’ve gone back to work that’s already been paid and published and demanded edits because they believe it’s AI. \n\nEven sub headers like “Visit the City of Athens” came back as “AI generated”. \n\nI feel like, not only are writers going to struggle to find work with new AI writing programs out there, but they’re also going to deal with a lot of shady people who use AI as an excuse to not pay writers.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 174,
    "downs": 0,
    "created_utc": 1680518294.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Cites AI-related client dispute and broader risk to writers, offering caution.",
    "composite_score": 3.8910754500367077
  },
  {
    "score": 163,
    "title": "Feels like there's no work anymore",
    "selftext": "I've been freelancing on and off for the past 4 years. The last year feels like everything has dried up. I had two projects in early December, both from the same client, and that was all. Before then I went a months with nothing and I have had nothing since. \n\nI'm on LinkedIn, Upwork, Fiverr, Legiit, Contra, and I pick up work on Reddit now and again. \n\nAll I see anymore is people offering their work, but no one offering work they need to have done. \n\nI know there are ups and downs in this profession, but I feel there's an overall trend of the amount of work available shrinking. There are too many writers as well as too many tools that do writing for people. ",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 163,
    "downs": 0,
    "created_utc": 1705343830.0,
    "media": null,
    "is_video": false,
    "num_comments": 140,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Complaint about dwindling work and market saturation.",
    "composite_score": 4.024453404375388
  },
  {
    "score": 166,
    "title": "Oh my god, it’s so bad out there",
    "selftext": "Every few months I decide it's time to get back to marketing and it's worse every time I do. I was finding clients up until Aug. 2023. Then by Spring 2024 when the HCU Armageddon hit I had two clients bite it. \n\nMarket's been bone dry since for me. I had a client cut out last month, and I'm down to my last one. \n\nI worked some part-time jobs last year, hoping those would bridge the gap until the market readjusted, but those didn't work out and the market is in worse shape than ever. \n\nI cannot find jack to apply to that even looks legitimate. For the first time I've been doing this in over 10 years, I'm actually scared. I've never envisioned a world where people didn't need real content. I don't know what my future is. \n\nAre there any marketing tips that actually work these days? Or are there adjacent jobs that need people? ",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 166,
    "downs": 0,
    "created_utc": 1749748873.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.74,
    "category_rationale": "Expresses fear and asks for tips, venting about a bad market.",
    "composite_score": 3.904458980586908
  },
  {
    "score": 162,
    "title": "Never write for free",
    "selftext": "Hi. I posted here a while ago about writing for free. I found what I thought was a nice mental health organisation that can't pay me. Because I love mental health and can't find clients in this niche to pay me, I thought it was OK to write a few articles for free for this organisation to have a few mental health niche samples on my portfolio. But now that I'm deep into the process of writing for them, I changed my mind.\n\nThey have one editor and the editor is so demanding. She asked me to change a bunch of parts in my article and rewrite them. Then, the CEO of this organisation wants me to be 'active' in their project management app, meet with the other writers online and have discussions about the company. Why?\n\nI'm not working for them!\n\nI realised that the more demanding a client is, the less they pay or the cheaper/less interested in compensating you they are. I'm done with writing for free. No matter how fun the niche is, it's not worth doing free labour.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 162,
    "downs": 0,
    "created_utc": 1728557171.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.73,
    "category_rationale": "Rejecting free-work and criticizing exploitative freelancing.",
    "composite_score": 3.8051892762213573
  },
  {
    "score": 165,
    "title": "I put “AI prompt engineer” in my Upwork profile… and got an invitation to interview in under an hour",
    "selftext": "There’s been a lot of talk here lately about AI and a currently popular thread about what career moves people are considering in light of this. A mention of selling yourself as a prompt engineer got me thinking, why not? At this point if you’ve played with these tools a little you basically qualify. So, I updated my profile and added some stuff about prompt engineering.\nImagine my surprise when, not even an hour later, I got an invite for a gig using mid journey to make backgrounds.\nNow, idk if that will go anywhere (I’m more experienced with gpt) but it was a real eye opener. Like it or not, “prompt engineer” is currently a gig with a lot of opportunity and very little in the way of rules or regulations. It’s also presently a pretty cheap skillset to develop. So, just thought I’d share that food for thought with you all.\n\nEDIT: this got quite a response! I’m not going to respond to you all (these dainty little fingers have words to type for money! Gotta keep ‘em fresh!) but to answer a few points:\n1.\tyeah maybe it’s a race to the bottom or a flash in the pan, but I think it’s worth dipping your toes into. I’m not sure why it would “taint” my career as a writer but I already have a disclaimer on my profiles stating I do not use AI in non-AI work (and had it before I started checking out prompt engineering)\n2.\tNobody is forcing you to do this. I’m not even sold on it. It’s just a little experiment on my part. Like it or not, we are all (and I mean all in the broadest societal sense, not just those of us in this subreddit) going to have to reckon with the rise of AI. So if you don’t wanna take a peek into prompting (which, fair!), well you’d better be doing something.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 165,
    "downs": 0,
    "created_utc": 1681242340.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.71,
    "category_rationale": "Notes new Upwork invitation for prompt engineering and implications of AI-driven gigs.",
    "composite_score": 3.7863931760890233
  },
  {
    "score": 159,
    "title": "Ok, let’s be real, is this industry dead now?  ",
    "selftext": "Just a few months ago everything was going ok, super busy.  One client took time off to revamp content, fine. Then another client killed their website and I found out by logging into a dead WordPress and a missing Slack channel.  Another has a buggy claims system.  \n\nSo I go to do the usual thing when it gets slow, apply with clients.  But the job boards are all universally dead, same empty reposts.  What I do find: 0 responses.  So I set up an Upwork for the first time in 10 years, thinking maybe that’s where the gig stuff went.  And get told I have to buy some Upwork Bucks type scam currency to even apply?  The sites and publications in my niches are now all run by a handful of mega companies, all of which I’ve applied or worked for.  Every time I try anything through LinkedIn, it’s a scam.  \n\nI never thought the industry/internet would shatter this drastically.  I always thought every website, business and publication was a potential client, and now I have no clue how to connect with the hiring ones.  It feels like without a working internet, my only other option is get my CDL and apply with the lumber yard across the street.  Then get told I don’t have the necessary experience or physical strength!  ",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 159,
    "downs": 0,
    "created_utc": 1715021844.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Despair about industry collapse and difficulty finding work; venting.",
    "composite_score": 3.966786866903427
  },
  {
    "score": 151,
    "title": "This is just insane",
    "selftext": "I just saw a job where someone wanted to hire a fiction writer for 20k stories. The title said he wanted someone who \"writes for fun.\" The budget? \"$15 as I'm just starting out.\" I keep seeing that exact phrase with varying disgustingly low rates at the bottom of jobs. How is it that clients are paying LESS than they did 7 years ago yet upping their requirements?\n\nI just had an interview with a client who complained about getting \"scammers\" and claimed she wanted to put honest effort into the stories to build a brand for herself. Then at the end of the interview, she said she was looking for one new novel **each month** at a rate of just under 3 cents per word. Gee, I wonder why you keep getting people from Nigeria and India applying, as she kept complaining.\n\nYou're not going to get genuinely good content when you're paying so little and have such short deadlines. And don't get me started on the ones that want you to have degrees and certifications but only offer one or two cents per word but think it's okay because they're offering \"consistent, daily work\" as if anyone with a Master's wants to work 16 hours a day just to pay rent. Yet, they complain \"no one wants to work anymore\" and \"I only get scammers/non-native applying\" and \"the job isn't hard if you know what you're doing/it should only take 2 hours\", etc.\n\nThese clients are wild, man.\n\n Edit:\n\nPeople saw one sentence mentioning Nigerians and Indians and started making assumptions. People are completely ignoring that this is a critique of clients and their unrealistic expectations. I was pointing out the insanity of my client complaining she kept getting \"scammers\" (this is HER wording to refer to people who claimed to be native speakers of American English but proved otherwise) while not providing a rate that would incentivize the demographic she wanted. The client specifically wanted an American writer because she was not a native English speaker and wanted someone to help her with her ideas. I was also pointing out that she claimed she wanted to put genuine effort into creating the best stories possible...yet had a one-month deadline for each book.\n\nAlso, love everyone calling me \"entitled\" and whatnot. I got the interview because I ***applied*** to this 3 cents a word job. That is below the base pay for American writers. I didn't ask her for more or expect her to give me more just because I'm American. The issue is that she complained she kept getting non-American applicants. After doing the math, the amount I would be paid for that book is a little over $1000. Most Americans aren't going to apply to a job that expects them to work full-time yet only pays $1000 a month (before taxes). I made more working fast food. But I NEVER complained in this post that I was \"too good\" for the rate or suggested I should be paid more for being American. Instead, I acknowledged that a lower rate drives away people who can afford to be picky. Just like how people who are in a good financial situation aren't applying to McDonald's. So, who's left flipping burgers? People without college degrees or who are physically/mentally unable to do other work. Again, I'm saying this as a person who was in the fast food industry for years. I'm saying this as a person who's been in the freelance writing industry for years. You're not going to get what you expected when your rate is low and you don't respect your employees' hard work.\n\nThe point of this post is that clients are expecting too much for too little. If you take anything else away from this, that's YOUR interpretation, and you should evaluate why YOU interpreted it that way...",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 151,
    "downs": 0,
    "created_utc": 1675646929.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.76,
    "category_rationale": "Critique of low rates and unrealistic client demands; strong normative stance.",
    "composite_score": 3.8339832309757136
  },
  {
    "score": 148,
    "title": "I've essentially lost my main source of income to AI and feeling very discouraged.",
    "selftext": "The content mill I write for has started using AI tools, and I'm really not a fan of it. Now, instead of writing articles from scratch, we have to edit an AI draft to be more readable and human-like. Because this involves less actual writing, the pay rate for these articles is really low --- one cent a word, and even *less* than that for some articles. We initially got paid 3 cents a word which was already pretty low, so this honestly just feels like a slap in the face. \n\nWe got emails making it seem like the AI content would be optional and that there would still be plenty of non-AI articles to choose from, but the options have been incredibly slim this week. Maybe it's just a slow week for clients, but I doubt it. \n\nThe weirdest thing is that we'd gotten many clients *accusing* us of using AI before they even made this change... So the fact that they're basically forcing us to use AI now is a very strange decision.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 148,
    "downs": 0,
    "created_utc": 1679060803.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Vent about AI replacing content writers and the resulting pay cut and misuse of AI.",
    "composite_score": 3.8335930645526695
  },
  {
    "score": 145,
    "title": "Client came back after 3 months",
    "selftext": "So, a long time client of mine had stopped outsourcing work, claiming that he found some \"amazing one-click SEO article generation tool\". I didn't stop them, let them go.\n\n3 months in, now the client comes back and asks me to redo all of the shit they published with AI. \n\nNothing big, nor a momentous achievement, just wanted to share this here because there's a lot \"AI is taking over\" hue and cry all around.\n\nSome hope remains, I guess.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 145,
    "downs": 0,
    "created_utc": 1691044442.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.45,
    "category_rationale": "Mostly a personal anecdote with no clear instructional structure or model.",
    "composite_score": 3.696744654092842
  },
  {
    "score": 135,
    "title": "PSA: Avoid Fiverr at ALL costs.",
    "selftext": "I am at a loss here.\n\nI had my passwords grabbed by malware from a fake client on Fiverr. They were even able to withdraw from my bank account and buy crypto.\n\nI reached out to Fiverr immediately after I realized this, providing details of the situation. They proceeded to lock down my account while the investigation was ongoing. Odd, but fine.\n\nA few days go by. Nothing is heard back from Fiverr. I cannot withdraw money or respond to clients. I created a new support request, reaching out to Fiverr again asking if my account can be restored. They say I need to verify my identity and provide the last 4 digits of my phone number.\n\nWhy am I the one being investigated now? I have no idea, but I provide them the information, and again, never hear back from them.\n\nI messaged them 3 more times, 1-3 days apart each time. They will not respond. It has now been 2 weeks, they are intentionally ignoring me. (A link to a photo of the conversation will be in comments.)\n\nI have clients that are now let down, I cannot fulfill contractual obligations which puts me in a position to be sued thanks to Fiverr. They have locked down my account and will not respond to support request, which is effectively an account ban. I am also unable to withdraw the money that I earned from my work.\n\nIt gets even worse now.\n\nThe portion of this post above this line was originally posted on r/Fiverr, in hopes that someone from Fiverr would see it and be able to help me.\n\nWell, someone did see it, and proceeded to take down the post. (Link in comments)\n\nThis confirms that Fiverr has officially shut me down and is harboring my earnings from me. Freelancing is currently my main source of income, so this is impeding my ability to pay my bills and survive. \n\nI just want as many people as possible to see this and be very wary about using Fiverr. We freelancers are the whole reason these websites exist, and for them to treat us like this is absolutely criminal.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 135,
    "downs": 0,
    "created_utc": 1724534993.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Long complaint about Fiverr inaction after a hack and its impact on work.",
    "composite_score": 3.696540580187617
  },
  {
    "score": 136,
    "title": "Finally! Enough time has passed (5 years) for me to offer you unsolicited advice that you'll listen to!",
    "selftext": "Hey guys,\n\nFebruary marked 5 years freelancing for me! 🥳\n\nWhich means it's the perfect time to do what I love best:\n\n✨ ***Offering Unsolicited Advice!*** ✨\n\nOkay, but honestly, I'm going to keep this quick, because I normally go deep.\n\nOne MAJOR lesson from every year.\n\nListen or don't.\n\nYou ready?\n\n# YEAR 1: FUCK A PROFESSIONAL WEBSITE.\n\nAll you need to start freelancing is [yourname@gmail.com](mailto:yourname@gmail.com), an idea of what you want to do, and 2+ examples that show you can do it.\n\n**Yes, eventually get one.** But in Y1, you probably don't know enough about what you're doing to even write a good site.\n\n# YEAR 2: THE ONLY PERSON WHO CARES ABOUT YOUR BUSINESS IS YOU.\n\nYour finances, your client load, your work-life balance — all of it is up to you. **This is a blessing and a curse.** No one will think less of you for doing less work, but because no one knows what you even *do*.\n\n# YEAR 3: YOU HAVE NOTHING TO LOSE BUT YOUR TIME.\n\nSend that proposal — STOP researching! Drop that bad client — STOP trying to save it! Reach out to that influencer — STOP hesitating!\n\n**This one applies mostly to solo workers without partners/families that rely on them.**\n\n# YEAR 4: THE EMOTIONAL HIGHS ARE JUST AS DANGEROUS AS THE EMOTIONAL LOWS.\n\nYour own flattery is a snake's favorite tool to use against you. You make faster decisions and reap the regret only after the excitement is gone. **Always build time into your decisions.**\n\n# YEAR 5: NOTHING MATTERS MORE THAN YOUR PEOPLE.\n\nCashflow, cars, fun experiences, travel, and even long-term savings won't save your ass in the long run. ONLY your people, your community, can come together to support you completely.\n\n**You can't do this alone.**\n\nSo stop trying!\n\n🌱",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 136,
    "downs": 0,
    "created_utc": 1678212487.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Numbered yearly lessons presented as discrete items.",
    "composite_score": 3.6149600256775343
  },
  {
    "score": 134,
    "title": "A question for senior writers - was it ever THIS bad?",
    "selftext": "To get it out of the way first - know that I'm not the dooming and glooming type. Even as I'm writing this now, I'm fairly certain that we'll see a positive turnaround in the market in the future, but dear god is it bad right now.\n\nI started freelance writing in 2020, and I was very quickly making good money doing something I loved.\n\nCome 2023, the number of open jobs started dropping rapidly.\n\nCome July 2024, I only have a single client, and not only have I not worked with anyone new for months - I haven't applied to almost anything in months.\n\nIf my memory serves me right, I only applied for one job since April, and it's not because I'm not looking hard enough, it's because, from my point of view, there are simply not as many jobs as there used to be.\n\nAt this point I'd be willing to accept a low-paying gig as long as I could count on a few hundred bucks a month, but I haven't seen any of those available in a long time (aside from the gigs paying something abysmal like 10$ per 1000 words).\n\nAll in all, I'm just looking for an expert opinion - what do the senior writers think is happening and what's your opinion on the near future of the industry?\n",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 134,
    "downs": 0,
    "created_utc": 1722257331.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A question-centered post seeking expert opinions with little substantive content.",
    "composite_score": 3.9177863242147053
  },
  {
    "score": 133,
    "title": "How I went from $30k to $2k/month in freelance income",
    "selftext": "I've been freelance writing for a couple of decades, specializing mostly in IT and software development.\n\nBetween mid-2020 and this past spring, there was not a single month when I invoiced less than $30k. Some months I cleared $50k.\n\nThen, in May, work dropped off surprisingly quickly. By July I was down to $15k in income. In August I did $8k. This month I'll do $2k. October could well be the first month since I started all of this where I make no money at all from writing.\n\nI'm not actually that upset because I invested about 80 percent of my income when times were good, and my stock portfolio is large enough at this point that it would theoretically last forever if I withdrew enough to support my annual spending.\n\nI'm mostly just kind of mystified at how quickly it all came to an end. I didn't see a major change in demand following the release of you-know-what in November 2022 and thought I might be immune to technological disruption because I was at the high end of the market. But something happened over the past six months that killed my writing career. I'm guessing it was Google's search changes, but it's hard to say definitively. (Other factors were that several of my contacts at my largest clients happened to get new jobs or be laid off, plus two large media companies that I used to write for regularly merged and shed their freelancers in the process.)\n\nIt reminds me of the Hemingway quote about how you go bankrupt slowly and then all at once.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 133,
    "downs": 0,
    "created_utc": 1759167764.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.82,
    "category_rationale": "Offers a mental-model explanation for freelancers' income decline with supporting context.",
    "composite_score": 3.7638473078041326
  },
  {
    "score": 132,
    "title": "I feel like my career is over",
    "selftext": "I posted here before about how my contract was terminated with a high-paying client after they falsely accused me of using AI, and gave me no opportunity to defend myself.\n\nSince then I've been looking for clients for over two months and have only scored one small, short-term gig in that time and a couple of one-off gigs here and there.\n\nI've cold-emailed, reached out to old editors/colleagues, applied to every job listing I can find on ProBlogger, Indeed, LinkedIn. I've gotten absolutely nothing back. I've even tried applying to write for content mills like Express Writer and haven't heard back.\n\nI have almost eight years of experience as a freelance writer and editor with a massive portfolio. I was a pretty successful music journalist for a minute. The pool is so dry right now that I'm starting to think that my writing career is over. And since I don't have experience in anything else nor do I have a degree, it feels like it's the end of my life. I'm probably going to have to work in food service just to pay a fraction of my bills.\n\nI guess I just needed to vent, I'm not sure what I'm asking for here. Maybe some assurance that I'm not alone in feeling this way?",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 132,
    "downs": 0,
    "created_utc": 1702911872.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Expresses the feeling that the writer's career is over and vents about the market.",
    "composite_score": 3.782606097320204
  },
  {
    "score": 127,
    "title": "Update: Landed a job as Senior Copywriter",
    "selftext": "About 3 months ago I made a post here about how I was at rock bottom after 3 years of successful freelancing. I had made 75k freelancing in 2022, but since about Nov/Dec 2022 all my work sources dried up and I was not finding any more. It was a combination of AI plus the economy impacting my niche. In desperation I started hunting for full time jobs.\n\nWell, I finally landed one and I just finished my first week at it! It’s Senior Copywriter for a big corporation. They are paying me 86k plus full benefits! That includes paid holidays and 4 weeks PTO per year. I think the one thing that helped is that it’s in-office, so the pool of applicants was much smaller. It’s a 20 min drive from my house and I have to be there 5 days a week - no hybrid option. \n\nAt first I was very apprehensive because I hated the idea of being in office and working for a corporation, and writing about something I have no interest in (it’s telecommunications).\n\nBut after the first week, I’m SO glad I took this job. I loved the freedom of freelancing, but the absence of the mental load of finding clients, managing projects, keeping clients happy, managing an organization’s marketing efforts, etc is AMAZING. And the pressure of having to work as fast as possible to keep finishing projects so I can take new ones and make money is gone. The other day the IT guy had to kick me off my computer to fix something, and all I could do was sit around. He was very apologetic, but in my head I was thinking “I don’t mind - I get paid anyway!”\n\nAlso I lucked out and landed a good work environment. My manager is nice and supportive. The dress code is casual, so I can wear jeans. They are pretty relaxed about what time people arrive and leave as long as they do a good job, so they are fine with me leaving at 3 to pick up my kids from school. The writing is crazy easy and they are amazed by how fast I do it.\n\nAll in all, I think it’s going to be a nice, easy, solid job that will allow me to make money and won’t burden me with a big mental load.\n\nJust wanted to give an update, because so many people told me they were in the same boat as me when I posted in complete despair.\n\nEdit - in case anyone asks how I found the job - a recruiter found me on LinkedIn.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 127,
    "downs": 0,
    "created_utc": 1691333588.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares a success update with insights about leaving freelancing for a stable role.",
    "composite_score": 3.5732705970076997
  },
  {
    "score": 122,
    "title": "IAPWE is a SCAM !!!!",
    "selftext": "Be alert—an old scam has resurfaced, targeting job seekers with enticing offers. You might receive an email promising a content writing job at $10 per 100 words. However, when you attempt to sign up, you’ll be prompted to select a subscription plan. Even if you decline, the site insists you connect your PayPal account (with auto-renewal enabled), and unsubscribing is intentionally difficult.\n\nIt’s best to steer clear of these suspicious offers. For your awareness, here’s a copy of the email I received:\n\nRe: Application Approved, XXXXX\n\n&gt;Hi xxxxxx,\n\n&gt;Thank you for confirming your application for our content writer position.\n\n&gt;After finishing reviewing your submission, we are pleased to inform you that your application met our quality guidelines and has been approved.\n\n&gt;The beginning pay rate for this position is $10 per 100 words, which comes out to approximately $40 per hour (based on the average time it takes our writers to complete a 400 word article).\n\n&gt;If you’d like to move forward, we will send you an invite to our content portal where you can accept assignments based on your availability.\n\n&gt;If we don't hear back from you within the next 5 days, we will start reaching out to other applicants to fill this role.\n\n&gt;If you want to get started, please complete the short registration form here. (Scam starts from this link so I've removed it)\n\n&gt;Best,\n\n&gt;Helen Matthews \n\n&gt;Content Moderator\n\n&gt;On Nov 27, 2024, at 4:16 PM, xxxxxxx \\[xxxxx@gmail.com\\](mailto:xxxxx@gmail.com) wrote:\n\n&gt;Confirming content writer application.",
    "subreddit": "freelanceWriters",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 122,
    "downs": 0,
    "created_utc": 1749040964.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Warns about a scam and explains how to avoid it, providing actionable caution.",
    "composite_score": 3.660954040407257
  }
]