[
  {
    "score": 1337,
    "title": "Donald Trump Ruined My Business",
    "selftext": "I’m an Amazon seller. I sell toys. My best selling product is made of stainless steel and sourced from China. The U.S. doesn’t have a domestic toy market. Even with 200% tariffs it would still be cheaper for me to source from China instead of producing in the U.S. My product was loaded onto the boat March 1st and I expected to pay 25% (Section 301 tariffs) + an additional 10% China tariff, and a 3% duty. The boat departed a day after Trump announced the additional 10% China tariffs(so now 20%). On March 12th a new 25% tariff on steel goes into effect on all countries importing steel to the U.S. \nI expected to pay 38% in tariffs/duties, but I will now be paying 73%. \n\nI wonder how much of these tariffs i can claw back by pretending the Gulf of Mexico is called the Gulf of America. Im trying not to get political, but thank you for ruining my business overnight Donald. No warning, you gave me no time to plan. Announcing tariffs to go into effect in the next 12 hours is unprecedented. Oh, and you still haven’t closed the de minimus loophole that my competition exploits daily. Sorry for the rant guys. \n\nUpdate: I made a YouTube video explaining the problems more in depth. \n\nhttps://youtu.be/dvusTD6ijH4?si=n58L-XYX12sw9pX-",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 1337,
    "downs": 0,
    "created_utc": 1741750868.0,
    "media": null,
    "is_video": false,
    "num_comments": 460,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.073306576126629
  },
  {
    "score": 298,
    "title": "A quick update on my move away from Amazon.",
    "selftext": "**Amazon Sales:**\n\n2017-2024, 99.1% of our sales were on Amazon. Averaging $43m per year, total margin of 7.28%. Average net profit line of $3,130,400 per year.\n \n2017-2020, I was working off an average net of 10.79%\n\n2021-2024,  as return scams, increased storage fees, increased amazon fees, competitors locking up our most profitable ASINs with black hat techniques, and finally the inundation of cheap chinese knockoffs using deceptive titles to confuse customers into buying shit chinese stuff instead of my American made quality products started to build, our margins were as low as 6.71% in 2023. \n\nIn early 2023 I started my plan of moving away from Amazon and direct to consumer via my own website. I refused to give into Amazon's new business plan of making most of their revenue off ads, and even though my products were being searched for by name and sku number, I was appearing on page 2. I would not give in and I never paid a penny for Amazon Ads. \n\n**Website Sales:**\n\n2023-2024 was laying the ground work for exiting amazon and while my website was 10+ years old, it was neglected. It took a lot of time and money to make it current. Total cost was in the neighborhood of $650,000, however it is very tough to figure that out exactly. I have so many products, that it took almost a year to build the listings and all employees were working on it when they had down time. \n\nWith the website, I now have two new costs that I never had to deal with, advertising and SEO. I hired a full time SEO expert in house, and my monthly advertising budget is $65,000. I also had to bring in 3 new packers to handle the new volume of boxes leaving our facility, because FBA used to handle that. \n\nAs of July 21st, my 2025 sales have been $18,327,315.70 on my website, $367,283.27 on Amazon (we have not restocked anything since February)\n\nSo far my net is 17.02%, $3,119,309 on the website, and 6.28% on Amazon, for $23,065. \n\nMy sales are down 18% YOY from 2024, but my profit is up almost 230%\n\n__\n\nWhen I left Amazon, the race to the bottom in my niche was over. My competitors on Amazon raised their prices, I raised my website prices and margins soared. \n\nProfit aside, there is no way to convey how stress free my life is today vs 2 years ago. Our customers our now my customers, we can provide incredible customer service, our scam returns are virtually zero, our reviews are absolutely insanely positive, and every month our organic conversion rates from the search engines go up, lowering advertising overhead. I am no longer having to rely on some lady in India with a screaming baby in the background to take care of my product page issues. I don't have to worry about Amazon axing product pages, flagging my top sellers for pesticides, or product pages just vanishing and spending hours upon hours getting them restored. \n\nAt the same time, all of these chinese shit temu ASINs designed to go after my products are receiving horrible reviews on amazon and their sales numbers have to be tumbling. \n\nLeaving Amazon was the best thing I've ever done, and even if you don't plan on leaving soon, please, please, please start your website building sooner than later, even if you do not generate a lot of sales it will give you a huge leg up when Amazon goes 100% temu. \n\nTake it from an OG on Amazon (almost 18 years), Amazon used to be amazing. They cared about their sellers, they cared about their customers and they were a great place to sell, buy, and use for legit reviews. Amazon is now a dumpster fire. Yes there is money to be made here and there, but once the sentiment gets a little worse, I believe we are going to see a large customer shift away from Amazon, and you want to be prepared.",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 298,
    "downs": 0,
    "created_utc": 1754401054.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.16531083135537
  },
  {
    "score": 255,
    "title": "Hit my first 100K",
    "selftext": "Canadian seller here and sell only on Amazon Canada. Just hit my first 100K. Overall gross profit is about 15-20%.\n\nI started my journey in March 2022 with retail and online arbitrage models and then gradually transitioned into wholesale. Last 4 months I have been doing about 10K/month on average. It is a very long learning curve but I am so glad I have achieved this.\n\nI have a full-time corporation job that pays too much for me to leave for now (I have a very high fixed monthly bill to pay due to some not-so-smart investment choices...) but I always wanted to have my own business and I am really glad I started my FBA business. I can only work on some nights when everyone goes to sleep. And Amazon FBA fits my schedule perfectly. I hope I can hit 200K, 500K, and even 1M one day.\n\nJust want to share my story that anyone can do it and I am very thankful for all the positive feedback I got from this forum.\n\n&amp;#x200B;\n\nEdit:  1. Sorry I can not share where I bought my product and I do not sell courses...\n\n2. Not-so-smart investment choices is I have variable mortgage rates  on all my properties insteading of lock them at below 2% in 2020. So I am paying 6%+ interest rate on all my properties instead of 2%\n\n3. Amazon have 3 different business models, Arbitrage, wholesale and private label. I suggest you watch some youtube videos to learn what they are.\n\n4. If your question is asking what is Amazon FBA, I seriously think you are too lazy and should not do amazon... \n\n&amp;#x200B;\n\nhttps://preview.redd.it/6whg1uciwy0c1.png?width=1654&amp;format=png&amp;auto=webp&amp;s=b68b78a50545b04a346d3fe68c0bf3967a948458",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 255,
    "downs": 0,
    "created_utc": 1700253457.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.23230226448908
  },
  {
    "score": 219,
    "title": "Amazon “lost inventory” showing up on eBay",
    "selftext": "I am a brand owner on Amazon and have brand protection; nobody can sell my items but me.\n\nAmazon loses my FBA inventory on most shipments. Usually it’s one or two out of many hundreds so I just ignore it, but in the past before I owned the company it could be entire cases of 100 units lost and the old owner just ate it.\n\nRecently I was cruising eBay checking to see my items and I found a seller selling multiple quantities of my items, roughly at my COGS.  I reached out to them and asked how they got my inventory and they said they bought a pallet of random Amazon liquidations and it included hundreds of my items. \n\nThis is so frustrating- I’m now left to compete with my own items. I tried enforcing brand protection on eBay but it hasn’t resulted in any takedowns. I honestly can’t even be sure that these are real (they could be counterfeit, or someone gray marketed them in China where my mfg is).\n\nHas anyone else run into this?",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 219,
    "downs": 0,
    "created_utc": 1757008851.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.944136677603675
  },
  {
    "score": 186,
    "title": "Amazon Pulls the Plug on Q4 Orders from China",
    "selftext": "Just in: Amazon has reportedly cancelled a large portion of its Q4 inventory orders from China—specifically for Amazon Basics and other private label brands.\n\nThis is massive.\n\nIt signals a deeper impact from the ongoing tariff war, and potentially a big shift in sourcing strategies from Amazon’s side.\n\nHere’s what this could mean for sellers:\nMore opportunity for 3P sellers to fill the gap\nReduced competition from Amazon-owned brands\nPossible long-term shift in sourcing toward Mexico, Pakistan, India, and other low-tariff regions\n\nFor sourcing-dependent brands, this is a wake-up call to diversify their supply chain now—before Q4 crunch hits.",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 186,
    "downs": 0,
    "created_utc": 1744213846.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8918906265436277
  },
  {
    "score": 178,
    "title": "Finally hit $100k in the last 12 months",
    "selftext": "Throwaway account because I don’t want this tied to my brand, but I just hit $100k in sales on Amazon (screenshot attached). I know it’s kind of a vanity milestone, but it feels good to finally see six figures on the dashboard. Not life-changing money yet, but trending in the right direction. Wife doesn’t care, so I’m sharing here.\n\nBackground:\n- US-based, started April 2024\n- Custom product in the supplement space\n- Initial investment: $15k → later added $35k for two more flavors after first batch sold through\n- Currently 5 SKUs live, with 4 more launching soon\n- I do everything myself, biggest partner is my contract manufacturer\n- Not brand new to ecommerce (previous Shopify store did ~$200k GMV in 2 years), but was new to Amazon\n\nMargins / numbers:\n- tACOS ~20%\n- COGS ~25%\n- Amazon fees ~25%\n- Returns 1-2%\n- 150 active S&amp;S subscriptions\n- 160 product reviews\n- Haven’t taken a single dollar out, reinvesting everything into inventory\n\nChallenges:\n- I found a great co-manufacturer but MOQs are steep at $20k per SKU, and I’m still a small fish for them\n- At the beginning it was a risk that I wouldn’t sell out in time (expiration date of 2 years on label) but luckily, this wasn’t the case\n- Only now getting to order volumes where I can get down COGS -33%\n- Lowering COGS, adding more SKUs and inventory turnover velocity are 3 competing goals. Cashflow is always tight when scaling inventory\n- Getting reviews. I had planned to get 30 reviews with each SKU and then to merge, but now this isn’t possible anymore \n- In general it’s been a lonely journey. I definitely want to connect with more merchants\n- PPC. CPC is crazy high for my desired search terms but lately, ‘auto’ campaigns have performed best\n\nGoals:\n- Estimate I need ~$40k/month in sales to afford a $100k/yr founder salary\n- On a linear trend, that’s maybe 2 years out\n- Stretch goal is to hit it in 1 year\n\nSome Learnings:\n- Find a reliable larger contract manufacturer\n- Don’t bother with order quantities below 1,000\n- Never run out of stock!!!\n- Change payment settings to pay ad spend from your credit card. AMEX Gold is a great combo\n- Sure, do A/B test, but at my volume, these tests take forever and likely do not reach significance. So I still operate by intuition mostly\n- ChatGPT is your best friend\n- Do not expect any salary within the first 2 years. Even though fulfillment is incredibly easy with FBA, this is far from “passive income”. Chances are you fail, but even if you’re successful, you’ll want to reinvest your proceeds\n- Got burned by an agency in the beginning that cold approached me with some AI created video about my listing. NEVER EVER CONTRACT ANYONE WHO REACHES OUT TO YOU. Instead, get recommendations and reach out to those.\n\nCaveats:\n- Gross revenue, not profit\n- Technically 13 months, not 12\n- Amazon only (not counting Shopify)\n- Includes ~$2.4k in Vine orders that I’d call “fake sales”\n\nPS: Not selling anything, not offering services, just sharing the milestone with people who’d appreciate it. Also not interested in any services.",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 178,
    "downs": 0,
    "created_utc": 1756611151.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.929968890845381
  },
  {
    "score": 173,
    "title": "The New FBA Reimbursement Policy is Nothing Short of Criminal...",
    "selftext": "*Effective March 10, 2025, we’ll reimburse you based on the product manufacturing cost of the affected inventory. To help provide you greater control and accuracy, you can choose how we determine the manufacturing cost for your products:*\n\n* *We’ll provide a manufacturing cost estimate for you. This estimate is based on a comprehensive evaluation of comparable products sold by Amazon, by other sellers, and through wholesale channels.*\n* *You can provide your manufacturing costs directly. If you don’t provide your own costs, we’ll automatically apply our estimate which you can change when you’re ready.*\n\nSo let me get this straight. Amazon loses our inventory and instead of that reflecting poorly on them, is then allowed to reimburse us what they randomly decide it's worth? OR we submit to them our actual costs (which I'm sure proof will be needed for) so Amazon will cumulatively have our ingredients, manufacturer's name, and product costs just ready to go for a rainy day....\n\nThis is mafia shit.",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 173,
    "downs": 0,
    "created_utc": 1734554371.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.988202180914985
  },
  {
    "score": 153,
    "title": "So many people are focused on ACOS, it hurts my heart. Here is my PPC strategy for February for a $4M brand.",
    "selftext": "It's simple.\n\nThis strategy is useful if your product may be a gift.\n\nToday is February 1st, and my team is already pushing Valentine's day keywords hard, with ACOS 100%  or higher.\n\nAnd you know what? When the Valentine's day comes, we gonna be ranking in the top. Here is how I play the game of PROFIT.\n\nBidding early, while everybody is busy bidding for ACOS, my team is bidding for organic positions (for Valentine's day keywords exclusively).\n\nAll the rest of the keywords are optimised for ACOS as usual.\n\nWith this strategy we sold in December for $2M in a single month. $300k of that net profit.\n\nAnd this is the biggest opportunity most sellers are missing RIGHT NOW.\n\nBid HIGH when no one else is bidding. Bid LOW when everyone starts bidding.\n\nThanks for reading and have a good month of February.",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 153,
    "downs": 0,
    "created_utc": 1706781970.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.527656973388116
  },
  {
    "score": 150,
    "title": "Got to $40k/Month, and got screwed",
    "selftext": "The brand in question will never be on sale ever again, so i’ll try to be as open as possible without breaking the rules:\n\nMain ASIN: B0D3853B7S\nToiler Paper Niche, one of the hardest to get into with PL due to high MOQs, high sales volume needed just to stay relevant and get a few organic sales.\n\nSo, briefly (not so much), the story goes like this:\nBack in November 2022, uni student, someone contacted me on a Fiverr gig where i was offering supplier research. They had an idea for a bamboo toilet paper brand and a few product specs. All seemed legit, so why not?\n\nThey somehow got impressed by my work (in retrospect, maybe they just didn’t know how to do anything), so they wanted me to be their Project Manager, and as a broke uni student that was great since they “paid” well (much lower than they should have, but in Italy you can only dream about anything more than 8/9€ per hour, so this was miiiiiiiles better). \n\nIt didn’t take long to realize that they knew nothing, had no plan at all, and they basically wanted to dump the entire\nbusiness on me. The only thing they had was Money.\n\nI thought i got lucky, i get to run my own business with someone else’s money? Hell Yeah! (i always wanted to try FBA, so not being exactly “my own business” didn’t bother me)\n\nFrom that point, i handled literally everything:\nSuppliers, Samples, Design, Import, Logistics, Amazon, Imgs, Copy, PPC, etc…\n(you know how difficult it is to set up an account for someone else, that answers like once a month?)\n\nAfter two full years of sampling and planning (as i said before, the owner would answer like once a month, wouldn’t read reports or take calls, just whatsapp messages, and only like a single question was answered each time. Almost like they had a cooldown for thinking even a little…), we launched in October 2024. No review-building, no Vine, no “warmup” period. They wanted an immediate launch as soon as inventory was received.\n\nWell before launch, i did an intensive market study and sent the owner detailed reports with sales forecasts, costs, and investment needs: $30–40k sales, around 10k PPC, a Total spend of around 100k, including amz fees, ppc, new production order double the size of the launch one, which itself was 30k with shipping.\n\nBreak even wasn’t expected before Q4 2025, and i was VERY CLEAR about this, mentioning it at least once a month all the way from 2022 to launch, and even after. It’s simply impossible from the get go, as amz fees are like 50+%, production and shipping 20%, and ACOS would be huge since we had no reviews and majority of customers are brand loyal, or expect some form of validation before trying a new brand. The only way to be profitable is to plan long term, build subscriptions and brand recognition, and switch to a website after a few years. Again, all of this was made very very clear, and was accepted by the owner. \n\nBut we did have a very good product though, and the start was incredible. Not a single day without sales, consistent growth week over week.\n\nMonth 1 we did $15k, month 2 was 23k, month 5 38k, total in first 8 months was around 200k, aCoS was stable at 40% a month after launch, brought it down to 20% by the end (without counting subscriptions). By the end of\nthe First Week of November, we already had to order the second batch, double the size, costing us around 55k.\n\nThis should be where i’m like “that’s it, everything went perfectly, we’re making millions now, i’m just here to brag, bla bla bla”....\n\nNaah, everything went to S**t almost immediately after we started…\n\nTurns out it wasn’t the owner’s money, but we had an investor, and the owner never shared any of my reports (all the market analysis, expectations, etc..) with them and somehow PROMISED profit within 2 months of launch and break-even in the first month, both literally\nimpossible unless they wanted like 2 sales a day in the middle of the night when competitors didn’t run ads.\n\nSooo the investor pulled out in November, covering only half the cost of the new batch. This forced me to manually slow sales in December and January to avoid running out of stock: Dec 16k, Jan 29k (started ramping up again).\n\nWhen the inventory finally arrived beginning of February, we hit $38k in both February and March, difference being that March was at break even, as i completely shifted our strategy and brought the aCoS down enough to be self sustainable, and enough to make the brand survive.\n\n(Hell, i could write an entire 100 page book about the second order, and i don’t mean the selling part, i mean the ordering itself, it was such a clusterf*** than noone would believe it)\n\nAlso i never received any pay from November onwards, but i kept working purely to keep the brand alive as i believed it had potential (and was naively promised 30% of ownership if we survived)...\n\nBUT even though i managed to do so, and the brand was by then expected to do $800k in 2025, the owner suddenly stopped replying entirely (still active on IG, so it’s not like they died or anything), and without access to the company’s bank account, i couldn’t pay the suppliers myself, so i let the products sell out without PPC until inventory ran out.\n\nIn the end the owner still walked away with ~$25–30k profit in the final months, abandoned what could have been a 7-figure brand, still owes me like $25k, and not a single care in the world.\n\nI did everything perfectly, all my economic predictions came true, even the revised ones, achieved an unthinkable thing by getting profitable much earlier without sacrificing sales, but i made a single mistake… I never signed a contract…yeah, i know…\n\nThat’s it for the rant, if anyone wants to see any report i might have, launch forecasts, or other stuff, i’m happy to share. I still have Seller Central access (for now, probably going to get deactivated soon), so i can post whatever’s left on there before it’s gone.",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 150,
    "downs": 0,
    "created_utc": 1755082553.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8422223098794097
  },
  {
    "score": 114,
    "title": "Global ocean bookings dropped 49% in one week — U.S. imports from China down 64%. Is this the calm before the storm?",
    "selftext": "Saw this chart from CNBC and had to share.\n\nBetween March 24–31 and April 1–8:\n\t•\tGlobal TEUs booked fell 49%\n\t•\tOverall U.S. imports fell 64%\n\t•\tU.S. imports from China fell 64%\n\t•\tU.S. exports to China down 36%\n\nWhether you’re in e-commerce, freight forwarding, retail, or manufacturing — these numbers are brutal. This isn’t just a seasonal dip. It’s a massive contraction in global trade volume within one week.\n\nWhy this matters:\n\t•\tLead times are about to get longer\n\t•\tPrices for ocean freight could spike\n\t•\tStockouts could creep in across Amazon, Shopify, and big box stores\n\t•\tBrands relying on Q2/Q3 inventory might be in trouble\n\nWe’ve already seen Red Sea disruptions, inventory corrections, and conservative ordering — but this is the sharpest week-over-week drop I’ve seen in a long time.",
    "subreddit": "FulfillmentByAmazon",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1745094986.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.737907303210758
  }
]