[
  {
    "score": 10398,
    "title": "My wife gave me 90 minutes to design our wedding invitation and I think I nailed it.",
    "selftext": "We tried to do it with one of the many templates available online and but hated all of them, and we had to submit our wedding invitation to the printer before the next day. She was about to go get a massage and  said she didn't care anymore and just wanted it done, so I could do whatever I wanted. I took a \"more is more\" approach and just kept adding birds and outlines until I was satisfied. Minimalism is cowardice. She loved it, and her only note was to add the Chrysler building. All the source photos were taken by me, with the exception of the birds and the picture of us.",
    "subreddit": "graphic_design",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 10398,
    "downs": 0,
    "created_utc": 1756919879.0,
    "media": null,
    "is_video": false,
    "num_comments": 266,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Personal design narrative with a design principle (maximalism vs minimalism) and insight rather than steps or a list.",
    "composite_score": 5.950247208888492
  },
  {
    "score": 9293,
    "title": "Took a Crack at the Barrel",
    "selftext": "Figured I should get in on the action since the Cracker Barrel logo redesign is all anyone seems to be talking about.\n\nPersonally, I think it is a solid update and the outrage feels a little overblown. For fun, I explored how the new design might carry over a few subtle callbacks to ease the transition and keep some of that heritage intact.\n\nNot a critique, just an experiment in how small details can bridge old and new.\n\nSee this and more design fun on my insta http://www.instagram.com/VisuallyAW",
    "subreddit": "graphic_design",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 9293,
    "downs": 0,
    "created_utc": 1756183836.0,
    "media": null,
    "is_video": false,
    "num_comments": 491,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains design reasoning about how small details can bridge heritage; presents a mental model of design adaptation.",
    "composite_score": 6.034185219526529
  },
  {
    "score": 7622,
    "title": "recreated the ms paint mirror for $100!",
    "selftext": "thought it was a really cool idea, then read the comments from all of you about how easy it would be to DIY. it was! \n\ni ripped apart my $10 [target dorm mirror](https://www.target.com/p/13-5-x-49-5-framed-door-mirror-room-essentials/-/A-87294433?preselect=13568566#lnk=sametab) for the glass, designed the UI part in Figma with [this UI kit](https://www.figma.com/community/file/1254078490904184073/windows-95-ui-kit) from Figma Community and [this icon pack ](https://www.dropbox.com/scl/fo/6d1dqci5rl3cwzzr7es18/AMbpfpkk4QMMwUcIUbc8sV8?rlkey=dlxqq1rcw7nqeawem1bagcra2&amp;dl=0)from Internet Archive. sent it off to a printing company for adhesive vinyl (\\~$70), then put it on a piece of particleboard from home depot (\\~$15)! also covered the sides with aluminum foil HVAC tape.\n\n  \nthe most difficult part was probably getting all the glue off the cheap mirror without breaking it haha",
    "subreddit": "graphic_design",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 7622,
    "downs": 0,
    "created_utc": 1749648976.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.89,
    "category_rationale": "Provides a reproducible sequence of actions (DIY mirror recreation) with materials, costs, and steps.",
    "composite_score": 5.58153284596189
  }
]