[
  {
    "score": 212,
    "title": "I sent 35,000 cold emails to porn addicts",
    "selftext": "I recently started a porn addiction quitting app. I purchased a list from a retired OF creator to see if I can get some sales. I say purchased maybe it’s more like renting or placing an ad in a newsletter. \n\n(The app is on iOS only &amp; has a hard paywall. No free trial.)\n\nThe email was simple. Basically said “I got your email from a OF creator that cared enough about you to let me reach out about my solution”.\n\nAnd that is the truth. She ended up retiring from OF because she got into religion. Needless to say she was happy for this arrangement \n\nThe results were higher than expected.\n\n.23% converted into paid subs at $29.99 annual each.\n\n$2,429.19 in revenue.\n\n$1,000 paid for the list.\n\n$1,249.19 profit for one email to a bunch of porn addicts. Never thought I’d say it\n\nLife is a video game. \n\nFeels good to help too\n\n(Edited for clarity)",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 212,
    "downs": 0,
    "created_utc": 1754034582.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.963532536071123
  },
  {
    "score": 147,
    "title": "Yesterday I got my first customer. Today I’m at $150 MRR + got #7 on PH",
    "selftext": "Hey again!! I’m the guy from yesterday who got his first $25 MRR customer a few hours *before* our Product Hunt launch.\n\nWell… we just got two more customers 😳  \nThat brings us to **$150 MRR** in less than 24h.  \n(and we ranked #7 on Producthunt!!)\n\nThis feels unreal. My brother and I have been building a no-code app builder (Shipper.now) for a few weeks now, we only started sharing about it publicly \\~9 days ago.\n\nYesterday was supposed to just be launch prep.  \nWe didn’t expect *anyone* to find us early, let alone subscribe.\n\nNow we're sitting at 3 customers and $150 MRR.  \nTiny numbers, but huge motivation.\n\nThe goal is still $10k MRR. But this gave us the push we needed to keep shipping. Will keep sharing the journey if that’s helpful.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 147,
    "downs": 0,
    "created_utc": 1754568198.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6759129657786014
  },
  {
    "score": 140,
    "title": "“Quit your job and make $20k/month in 60 days” the advice that almost ruined me",
    "selftext": "Lately, I’ve been seeing the same story everywhere:\n\n“Left my 9–5, now I work 2 hours a day from Bali”  \n“Zero to $100k/month with no experience”  \n“Fired my boss, tripled my income in 3 months”\n\nAnd for a while, I believed it. I thought I was just being too cautious.\n\nBut here’s the part they don’t tell you — most of these posts are highlight reels. They skip over the debt, the failed launches, and the fact that many of these “overnight wins” were built on years of unseen experience, networks, and savings.\n\nWhen I quit my job to go full-time on my startup, I thought my biggest challenge would be building the product. It wasn’t.  \nIt was figuring out how to survive when there was no paycheck coming every month.\n\nThe romantic version of “going all in” hides the reality:\n\nYou lose structure and have to create your own.\n\nYou burn through savings faster than you think.\n\nYou need customers *before* you need more features.\n\nI spoke to a founder who’d been running a profitable agency for 8 years. I asked how he got clients. He didn’t talk about ads or cold email scripts. He said:\n\n“Start where people already trust you. Build there first.”\n\nThat’s when I realized my mistake — I’d left my job to serve an audience I didn’t even know.\n\nNow, I test ideas while I’m still earning. I validate with small offers before building big products. I’ve learned to keep my safety net intact so I can take risks without betting the house.\n\nIf you’re thinking of quitting your job tomorrow, remember this:  \nFreedom isn’t about leaving your 9–5. It’s about having options. And options come from skills, networks, and systems you build over time.\n\nIf you want something sustainable, start here:\n\nLearn to sell before you have to sell.\n\nBuild a customer base while you still have income.\n\nDesign a runway that buys you time to experiment.\n\nTest small before committing big.\n\nEntrepreneurship isn’t a plane you jump out of without a parachute — it’s building the parachute while you’re still on the ground.\n\nSo ask yourself:  \nDo I have a clear audience?  \nCan I afford to fail a few times?  \nAm I building this because it matters to me, or because I want to escape?\n\nDon’t quit just to quit. Quit because you’ve built the skills, trust, and systems to make your next step inevitable.\n\nThat’s how real freedom is built.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 140,
    "downs": 0,
    "created_utc": 1758785445.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6262531348305176
  },
  {
    "score": 108,
    "title": "From $0 to $2.4k MRR with cold emails (and how to do it yourself)",
    "selftext": "A few months ago, I was burning $150/month on Facebook ads with terrible conversion rates (0 users lol) and posting daily on LinkedIn with no results :/\n\nThen when I tried cold email in 90 days, we went from 0 to 83 customers. Zero ad spend\n\nI was doing cold email completely wrong for the first month and still saw results. After sent +15k emails, and watching multiple paid courses, I fixed my approach and everything exploded!!!\n\nI think cold email still remains the king on B2B ecosystem because\n\n1. **Ad costs have exploded:** Facebook CPMs up 89% since 2023, Google Ads getting more expensive daily - Meanwhile, cold email costs stay flat at \\~$0.10 per send\n2. **Remote work normalized email communication:** People check email more frequently, respond faster, and are comfortable with digital-first business conversations\n3. **AI boost the productivity:** tools let you research, write, and personalize faster than ever\n\nHere's what you need to start:\n\n**Step 1: Set Up Dedicated Domains (Don't Skip This)**\n\nBuy 1-2 extra domains for cold email campaigns. **Never use your main domain** \\- if salesforce.com is your product, use trysalesforce.com or getsalesforce.com for outreach.\n\n* **Domains**: GoDaddy (\\~$20/year each)\n* **Email hosting**: Zoho ($12/year per mailbox, create up to 3 mailboxes per domain)\n\n**Step 2: Configure Your DNS Records Properly**\n\nThis step makes or breaks everything. Set up these DNS records in your domain provider:\n\n* MX records\n* SPF\n* DKIM\n* DMARC\n\nZoho provides step-by-step tutorials for GoDaddy integration. If this fails, your emails go straight to spam no matter how good your copy is.\n\n**Step 3: Warm Up Your Mailboxes (2 Weeks)**\n\nStart this immediately - don't procrastinate. Use **Instantly's free 14-day trial** for automated warmup. Manual warmup takes forever and isn't worth it.\n\nYour mailboxes need 2+ weeks of gradual email exchanges to build sender reputation before launching campaigns.\n\n**Step 4: Build Your Prospect List**\n\nUse your ICP (Ideal Customer Profile). If you don't have one, use AI to create 3 different persona roles.\n\n**Tools:**\n\n* **Clay** (expensive but powerful)\n* **Apollo or Saleshandy** ($40-50 one-time for a campaign, solid B2B databases with AI filters)\n\nInput your ICP criteria and export qualified prospects.\n\n**Step 5: Validate Your Email List**\n\nBefore sending anything, validate your prospect emails using **Reoon** \\- 12,000 validations for $12. Keep your bounce rate under 2% or your domain reputation tanks fast.\n\nIt's okay if you lose 20% of your prospects, that's the average\n\n**Step 6: Master Personalization**\n\n**LinkedIn Activity Scraping**: Check prospects' recent LinkedIn posts, job changes, or company updates. Reference something specific they shared or achieved.\n\nExample: \"Saw your post about scaling your sales team to 50+ reps. The challenges you mentioned around lead quality really resonated...\"\n\nI used Introwarm for this personalization at scale\n\n**Step 7: Write Non-Salesy Email Copy**\n\n**Key principles:**\n\n* Sound helpful, not salesy\n* Provide value in every email\n* Use different value propositions per follow-up (free trial → demo → done-for-you service)\n* Keep subject lines short\n* Be proactive: \"I'm open to discuss this in a meeting if needed\" instead of \"Let me know if I can help\"\n\nPlan 4-5 follow-ups spaced 3-7 days apart. You can use ChatGPT for grammar but ensure it doesn't sound robotic.\n\n**Step 8: Set Up Your Sending Strategy**\n\n**Sending limits:**\n\n* Start: 5-10 emails/day per mailbox\n* Scale to: Maximum 30 emails/day per mailbox\n* **Timing**: Monday-Friday only, avoid weekends\n* **Spacing**: 3-7 days between follow-ups\n\n**Tools**: Instantly, Smartlead, or Saleshandy (I used Saleshandy - worked perfectly)\n\n**Step 9: Track the Right Metrics**\n\n**Realistic benchmarks:**\n\n* 2-5% reply rate = good performance\n* Focus on replies, not open rates\n* Track meeting-to-close conversion\n\n**A/B testing framework:**\n\n* Test 2-3 subject lines simultaneously\n* Test different opening lines\n* Test various value propositions\n\nMeasure by reply percentage, not open rates (tracking opens hurts deliverability)\n\n**Step 10: Avoid These Deliverability Killers**\n\n**Never include until you get a response:**\n\n* Images or attachments\n* Multiple links\n* Spam trigger words (\"free,\" \"guarantee,\" \"act now\")\n\nUse plain HTML only - fancy formatting screams \"marketing email.\"\n\n**The Results You Can Expect**\n\nWith this system:\n\n* Week 1-2: Setup and warmup (no sends yet)\n* Week 3-4: Start with 5-10 emails/day, expect 1-3% reply rate\n* Month 2-3: Scale to 20-30 emails/day, optimize to 3-5% reply rate\n* Month 3+: Consistent pipeline of qualified leads\n\n**My numbers:** 15,400 emails sent over 90 days, 693 replies (4.5% rate), 277 demos booked, 83 customers acquired. Cost: \\~$400 total setup.\n\nJust start simple and scale what works. Most people over-complicate this and never launch.\n\nIf you need help with this I'm open to help :)",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 108,
    "downs": 0,
    "created_utc": 1752584901.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5863184263004912
  },
  {
    "score": 104,
    "title": "If you want to reach the top 1% in marketing and growth within 6 months, do these 5 things (detailed steps, no fluff)",
    "selftext": "1. Pick one channel to master not \"try everything\":\n\nQuit spreading thin. Pick ONE Email, X, Reddit, LinkedIn, Instagram, YouTube, or TikTok where your audience really hangs out. Watch what's already working at the top. Study 20 viral accounts or brands there. Make notes.\n\n2. Publish every single day even if it feels \"small\":\n\nYou don't need to go viral. Consistency wins. Publish a daily post, thread, video, or newsletter, no matter what. You cannot get better at marketing if you aren't in motion.\n\n3. Steal like an artist (but credit and remix):\n\nDon't copy-paste, but break down the top performing posts/ads/sequences in your chosen space. Reverse engineer them. What's the hook, what emotions do they trigger, what is the call to action? Apply these moves in your style.\n\n4. Document and share your own results:\n\nEvery week, share a quick recap: what you tried, results, what you learned. Transparency makes people trust you, and it builds your personal brand. Share even the things that flopped.\n\n5. Find or create a community of doers, not lurkers:\n\nJoin a challenge group, mastermind, Discord, or subreddit committed to shipping and reviewing marketing experiments. Hold each other accountable. Feedback and momentum matter more than perfect tactics.\n\nBonus:\n\nIf you stick to this, NETWORK daily (one DM or honest comment a day), and keep refining your own playbook, you WILL be in the 1% of marketers measured by knowledge, results, or friends in the game.\n\nWhat's one high-leverage growth tip you've seen work lately? Let's stack the best ones below.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 104,
    "downs": 0,
    "created_utc": 1756515827.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.487388298019416
  },
  {
    "score": 99,
    "title": "7 days into running a faceless influencer on X (481K impressions, fully automated, no API)",
    "selftext": "ello! \n\njust wanted to share some early results from a little experiment I've been running.\n\nI built an automation system that runs a faceless influencer account on X. It doesn't use the official API at all. It posts autonomously, replies to other posts, and just keeps going on autopilot without needing any intervention from me.\n\nI'm on day 7 now and here are my current stats (screenshot attached). Pretty happy with how it's going so far considering I haven't touched it once since setting it up. The whole thing costs around 50 cents a day to run.\n\nCurious if anyone else here is doing something similar. Would love to hear what kind of results you're getting or how your setup works.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1753338202.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.677115859865488
  },
  {
    "score": 89,
    "title": "What I’ve learned experimenting with Reddit as a growth channel",
    "selftext": "I’ve been testing Reddit over the past few months to see how it works as a growth channel compared to other platforms, and I thought it might be useful to share what’s been working (and not working) for me.\n- Throwaway accounts don’t last communities respond better to accounts that look natural and post consistently.\n- Posts framed as personal experiences or open-ended discussions tend to get way more traction than direct promotions.\n- comments matter more than I expected; sometimes a well-placed comment drives more engagement than a standalone post.\n- Each subreddit has its own “culture” copying the same post across different ones almost always backfires.\n\nI’m still experimenting and would love to connect with others who are trying to crack Reddit growth whether it’s swapping notes, brainstorming ideas, or even testing things together.\n\nNot here to spam or sell anything, just curious to see how others are approaching Reddit. Has anyone here found it effective for lead generation or community building?\n",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1755421945.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2174388520184376
  },
  {
    "score": 84,
    "title": "You only need 1-2 hrs a day. To change your life👨🏻‍💻",
    "selftext": "You only need 1-2 hours, 60 minutes a day to change your life. It seems so simple, and people confuse that with easy, so they get disappointed after what feels like ages of a lack of progress and quit.\n\nYou only need 1 hour, 60 minutes to change your life. But most people feel like that isn't enough time. \n\nThe truth is that most successful people didn't quit their job and just start working 80 hours a week.\n\nEveryday, I spend 1-3 hours of writing, building and networking. These 3 moving levers are the foundation of my business so I dedicate time, effort and resources into it. No excuses.\n\nYou need to stop living in the delusion that you are so different from everyone else that other people don't make sacrifices to achieve their goals and that you won't have to either.\n\nBlock out one measly hour, early morning or late night, pick one. \n\nThose are the only times that the world doesn't demand your energy. Those are the times that you're going to do your best work. Those are when you move the needle towards the life you want. \n\n1 hour a day, for 365 a year is more than enough to become an entirely new person.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1753352701.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.183890601867711
  },
  {
    "score": 77,
    "title": "Cheapest proxies I’ve used for SEO tools ($0.49/GB)",
    "selftext": "Been on the hunt for proxies that won’t break the bank but still work reliably with SEO tools (rank trackers, SERP pulls, GMB tasks, etc.). Most of the “budget” ones I’ve tried in the past got flagged instantly or throttled.\n\nTried a provider recently and was honestly surprised:\n\nClean IPs\n\nSmooth speeds\n\nHaven’t hit bans yet\n\nFiltering options that actually help with tool stability\n\nPrice is $0.49/GB. At that rate, it feels like they’re either undercutting the whole market or testing some kind of new model.\n\nFor anyone curious, here’s the site I tested with: Evomi .com\n\nHas anyone else here tried them for automation or long-term SEO campaigns? Wondering if the consistency holds up.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1755345182.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0936395961864522
  },
  {
    "score": 73,
    "title": "The viral video structure NO ONE talks about (but WORKS!)",
    "selftext": "Alright, let's talk about the structure of viral videos.\n\nThe first thing is the hook. You need to think about the first three seconds of your video and stop them from scrolling. This is very important, so you need to spend some time thinking about it. Since there is nothing new under the sun, there are some structures you can use.\n\n* Say something shocking that evokes a strong emotional reaction. Your goal here is to polarize your audience (be prepared to receive some nasty comments tho.)\n* State a tangible result viewers can achieve in a short time.\n* Start with a compelling personal story or a client success story.\n* Address a common problem or frustration your audience experiences.\n* Highlight an incongruence in people's behavior or compare your audience to a desirable outcome.\n* Create a sense of urgency by mentioning a limited-time opportunity or something they might miss out on.\n* Say something intriguing or challenge a common belief to make people want to know more.\n\nAll of these are good enough to give you great results. However, the most powerful hooks often combine a great opening statement with a visual hook. You know, you can use a surprising image, a dynamic camera movement, text on screen, or even you doing something unusual.\n\nAfter the hook, you need to mention a problem your audience is facing. You can state the problem directly or share a relatable story (the last one works very well if you know about storytelling. We might do another post about it). Your goal here is to make the audience aware that they have this problem.\n\nNow you have to present the solution as a magic pill, something that will solve their problem and improve their lives or businesses. Some marketers say you need to avoid giving step-by-step instructions and just tell your audience *what* they need to do, but this is 50/50. It depends if you wanna generate curiosity or if you want to give solutions. Both options work.\n\nAlright, now you need to add some social proof that validates your claims. You can include your achievements, testimonials or success stories from your clients, or quantifiable data and statistics. The last one is the best option if you are just starting and have no previous experience.\n\nNow, for the last part, just add a strong call to action. Tell viewers exactly what you want them to do. This is the section where you can offer your products by directing them to a class, resource, or further information in exchange for engagement (like a comment). A strong call to action encourages comments, which boosts the video's reach on social media.\n\nOur advice as a marketing agency is to post 2-3 videos per day for rapid growth. To avoid visual fatigue and keep your audience engaged, utilize 4 to 6 different content styles. You know, things like carousels, direct-to-camera videos with professional editing, point-of-view shots, selfie-style responses to comments, explanatory videos using a tablet...\n\nWell, we hope this helps. This is all based on our experience working with clients, so we are sure this is gonna be useful for you. Have fun!",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1746993762.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0888529744506386
  },
  {
    "score": 76,
    "title": "This hack is now of the most powerful I know to get unlimited leads",
    "selftext": "Here’s a simple and effective method to extract followers from any LinkedIn company page and turn them into leads\n\nI tested it yesterday and pulled over 75,000 profiles, results were solid.\n\nHere’s how it works :\n\nStep 1: Create a new LinkedIn account  \nStep 2: Start a free trial of Sales Navigator  \nStep 3: Add a job title on your profile like “Intern” at the company you want to target  \nStep 4: In Sales Navigator, use the filter “People following my company”, this becomes available since LinkedIn thinks you’re part of that company  \nStep 5: Export the list, enrich the data (email, role, etc), and use it in your outreach  \nStep 6: Remove the intern job, pick another company, repeat the process\n\nSuper useful to build targeted lists from pages that already gather your ideal audience\n\nRomàn from [gojiberry.ai](http://gojiberry.ai/) (We track the right people at the right time, so you talk to leads who are already interested.)\n\nPS: For those who think this isn’t ethical, while they’re scraping likes, comments from influencers, or using Sales Navigator, it’s exactly the same thing.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1758296918.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.277171572089618
  },
  {
    "score": 72,
    "title": "How I gained 17 K followers from a single Instagram post",
    "selftext": "Recently I posted a short 47-second reel about Jeff Bezos ex wife, MacKenzie Scott and how she helped him to grow their business!\n\nI didn’t use paid ads or collabs! Just a clear hook, a good story, and a simple but eye catching thumbnail!\n\nWithin a few days it hit 3.3 million views and brought 17K new followers to my page.\n\nWhat worked: The first 3 seconds (a strong curiosity hook). A story that mixes emotion Ending with a small lesson!\n\nI think people still respond to stories more than marketing! Curious, have any of you had a post or video blow up unexpectedly or any other grow stories that can help and inspire!?\n",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1762739114.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.505871880127584
  },
  {
    "score": 70,
    "title": "Got more enterprise replies by killing the sequence",
    "selftext": "I run ABM and growth at a B2B SaaS in the marketing automation space. I’ve built some “best practice” sequences but this one worked well. The 6 touch outbound looked great in reports but in reality  replies were dead.\n\nSo we paused it for a few weeks and tried one simple change. We dropped the long sequence and sent one personal email and a short page with two questions for their team. No five followups nurture spam.\n\n**The email (under \\~90 words):**\n\n* Start with something specific about them (role, initiative, or metric we saw).\n* One sentence on why we’re reaching out now.\n* Two questions they could forward internally.\n* Calendar link only in the PS.\n\n**The mini page (built once w light personalization):**\n\n* Their logo and ours.\n* 2-3 bullets using their language (“You said / We heard”).\n* The same two questions in big, simple text.\n* **One action row:** Move Forward (book 20 min) or Need More Info (short 3-question form).\n\n**What happened was Replies went up 96% in 3 weeks.** We got way more “Looping in my boss” messages and fewer polite dead ends.\n\nWe also got no's faster which actually helped clean up the pipeline.\n\nSample size was small (a few hundred emails), but results held up long enough that we kept the play for enterprise and upper-mid market.\n\n**Why it worked**\n\nOne clear mental task. We weren’t pitching, just helping them think internally. Forwardable format thats easy to drop in a Slack thread or forward to a manager.  \nPlain human tone, no fluff or just following up type shit.\n\n**Guardrails that mattered**\n\n1. Send within 24 hours of first contact or research.\n2. Keep the email under 100 words and include only one link.\n3. Keep the page under 200 words and mirror their phrasing.\n4. If they click “Need more info” the AE replies with 5 short sentences addressing only those gaps.\n\n**What didn’t work**\n\n* Turning the page into a mini landing page (looked like marketing, ignored).\n* Adding pricing too early (brought procurement into the chat too soon).\n* Waiting more than 48 hours to send (reply rate dropped fast).\n\n**How we tracked it**\n\n* Reply rate per thread.\n* Positive reply rate (meeting, forward, loop-in).\n* Time to first response.\n* Then meeting booked rate and opportunity creation v the old sequence.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1760013914.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1582300248724935
  },
  {
    "score": 69,
    "title": "Multi-step forms vs single long forms? Which actually converts better?",
    "selftext": "We're debating whether to break up our main signup form into 3 quick steps or just keep it all on one page. Multi step forms feel cleaner and people only see one question at a time but they also add extra clicks which usually dropoff. \n\nWe ran a few early tests on our saas leadgen form and noticed a few things: \n\n1. Fewer people started multistep forms but a higher number finished them\n2. On mobile completion time dropped by about 30% even though there were more screens\n3. The biggest win came from moving the company info field to step 2 with fewer ragequits up front. \n\nStill testing variations but I'm wondering if anyone else has seen this pattern. Do multistep forms consistently outperform long ones or does it depend on offer type or traffic source?\n\nThanks very much :) ",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1760526285.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3262970389637347
  },
  {
    "score": 68,
    "title": "GUYS, I've reached $475 MRR after launching 1 month ago. Here's what worked and what didn't",
    "selftext": "Launched precisely 1 month ago and I've reached $475 MRR !!  \n(could've been $650, but we had to refund some because product wasn't ready yet)\n\nIn the past month I tried (almost) every growth tactic I could think of. Some were huge time sinks, some actually moved the needle. Writing this out so others don’t waste time on the same dead ends I did.\n\nFor context: My app is a no-code tool that helps non-technical people build apps. Think Cursor or Bolt .new, but way simpler and friendlier to people who just want to make something work ASAP, without any technical knowledge.\n\n# What actually worked:\n\n1/ Build in public (X + LinkedIn). I started by posting daily updates on both platforms - literally day counts, product screenshots, and small lessons learned. LinkedIn brought some traction early but fizzled out. On X (Twitter), most posts got maybe 10 likes max… until one random tweet announcing my Product Hunt launch exploded in the build-in-public community. It got 200+ likes, 10k+ views, 90+ comments.\n\nLesson: you never know which post pops, so consistency is everything. You also don't know who's watching, it might be someone willing to pay for what you're building :)\n\n2/ SEO. Instead of generic blog posts, I wrote comparison pages and articles around real customer pain - mostly targeting frustrated users of competitor products. Those people are searching because they’re already upset and looking for alternatives. Even in the first month, those pages drove hot leads and some conversions. It’s still early days but feels like one of the highest ROI channels long term.\n\n3/ Product Hunt launch. We landed #7 Product of the Day (almost #6).\n\nThe hilarious twist: the very next day, a VC-backed competitor took #1. Timing isn’t always in your control, but even without the trophy, PH gave us a ton of visibility.\n\nWe were featured in their newsletter the following day, which drove another spike of users. Totally worth the effort.\n\n4/ Talking to users (DO THIS!!). We had to issue refunds a few times, the product wasn’t ready... but instead of ignoring those customers, I asked every single one why they didn’t stick. The feedback was (very) brutal, and also exactly what we needed to hear. Those conversations sent us back to building and fixing everything with a clear path ahead.\n\n5/ Email marketing. I set up retention and failed payment flows in encharge. Already seeing results: catching failed payments and re-engaging users who would’ve churned otherwise. Super underrated to set this up early, even if you only have a handful of users.\n\n6/ Reddit launches. I shared Shipper in communities where other builders hang out. Since our product is literally made for builders, the overlap was perfect. Being transparent, showing actual demos, and answering questions brought in paying customers directly.\n\n7/ Showing my face. Most indie founders post anonymously with a logo. I noticed whenever I showed my face, people trusted me more and actually engaged. It makes a difference when users can see you’re just another human trying to figure things out.\n\n\\- - -\n\n# What completely failed:\n\n1/ Small directory launches. Tried submitting to niche SaaS directories and random launch sites. Almost no clicks, no conversions. Pretty much wasted hours.\n\n2/ Hacker News launch.... brutal, got 1 upvote and disappeared. Not every channel is for everyone.\n\nRight now... I'm doubling down on what’s clearly working, like building in public, SEO, Reddit, and talking directly to users. Holding off on ads and cold email until I’ve squeezed every drop from these. The compounding effect of consistency is real, and I’d rather master a few channels than chase shiny new ones.\n\nPeople don’t care about fancy features or AI integrations. They care about solving their painful problems in the simplest way possible. When you listen to your users, fix what’s broken, and show up consistently in the communities they already hang out in, growth actually happens.\n\nMost people think it’s impossible to get traction early on.  \nI’m telling you it’s possible, you just have to show up every day and promote way more than feels comfortable.\n\n# MY BIGGEST TIP\n\nDon’t hide behind a logo, show your face!!! Talk to your users directly, even if it means hearing hard truths. And keep posting even when it feels like nobody’s listening.\n\nOne post, one comment, or one DM can completely change your trajectory.\n\nI wasn't very comfortable doing it at first, but here I am telling you it's worth it :)\n\n\n\nlink: [this is my saas](https://shipper.now/)",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1757167261.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.312428106408365
  },
  {
    "score": 66,
    "title": "Built a voice AI that sounds like me and books meetings while I sleep",
    "selftext": "Not long ago, I found myself manually following up with leads at odd hours, trying to sound energetic after a 12-hour day. I had reps helping, but the churn was real. They’d either quit, go off-script, or need constant training.\n\n\n\nAt some point I thought… what if I could just clone myself?\n\n\n\nSo that’s what we did.\n\n\n\nWe built [Callcom.ai](http://Callcom.ai), a voice AI platform that lets you duplicate your voice and turn it into a 24/7 AI rep that sounds exactly like you. Not a robotic voice assistant, it’s you! Same tone, same script, same energy, but on autopilot.\n\n\n\nWe trained it on our sales flow and plugged it into our calendar and CRM. Now it handles everything from follow-ups to bookings without me lifting a finger.\n\n\n\nA few crazy things we didn’t expect:\n\n\n\n* People started replying to emails saying “loved the call, thanks for the clarity”\n* Our show-up rate improved\n* I got hours back every week\n\n\n\nHere’s what it actually does:\n\n\n\n* Clones your voice from a simple recording\n* Handles inbound and outbound calls\n* Books meetings on your behalf\n* Qualifies leads in real time\n* Works for sales, onboarding, support, or even follow-ups\n\n\n\nWe even built a live demo. You drop in your number, and the AI clone will call you and chat like it’s a real rep. No weird setup or payment wall. \n\n\n\nJust wanted to build what I wish I had back when I was grinding through calls.\n\n\n\nIf you’re a solo founder, creator, or anyone who feels like you \\*are\\* your brand, this might save you the stress I went through. \n\n\n\nWould love feedback from anyone building voice infra or AI agents. And if you have better ideas for how this can be used, I’m all ears. :)\n\n",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1755019149.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1116388205399454
  },
  {
    "score": 66,
    "title": "Anyone used Prowly for press outreach or is it just another shiny PR tool?",
    "selftext": "So yeah... I've been in this weird spot where I’m handling PR stuff for a startup even though I'm not, like, a “PR person” at all (I do mostly product/dev stuff tbh). We’ve been getting zero replies to our press emails and someone suggested trying Prowly to find journalists and send press releases or whatever. Looked it up, seems slick but I’m also paranoid about dropping $$ on another tool that overpromises and underdelivers \n\nAnyone here actually used it for media outreach? Does it actually work or am I gonna waste another week writing press kits nobody opens? Like, does it help with cold pitching or is it mostly for folks with an actual PR background?  \n\nAlso… is it normal to feel like you’re shouting into the void with this stuff? lol",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1752501976.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.29175668478032
  },
  {
    "score": 63,
    "title": "Not sure if Fiverr is trolling or genius-marketing.",
    "selftext": "Not sure if Fiverr is trolling or genius-marketing.\n\nThey’re literally advertising to vibe coders now.\n\n'Built with vibes? finish with Fiverr.'\n\nPart of me thinks it's brilliant. they’re owning a common indie dev pain point.\n\nPart of me feels like they’re mocking us 😅\n\nAnyone here actually try this approach?\n\n[https://www.instagram.com/reel/DMsRbc2xGrc/](https://www.instagram.com/reel/DMsRbc2xGrc/)",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1754425867.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.842209969647868
  },
  {
    "score": 63,
    "title": "This is how I make Selfie style Veo 3 videos that gets my accounts' 83k followers in 3 days.",
    "selftext": "I've been experimenting with various video ad formats powered by the new Veo 3 AI model. Using this some accounts have reached 83K followers in only 3 days.  \n  \nAfter testing, I developed a streamlined workflow to produce engaging, selfie-style viral ads fast—perfect for TikTok, Instagram Reels, or YouTube Shorts. Here’s a step-by-step guide to help you replicate this:\n\n# 1: Use ChatGPT to Generate Your Video Scenes\n\nStart by giving ChatGPT your **product details** and **core script/message**. Ask it to break down your script into 3-4 distinct scenes that naturally showcase your product in action. This helps you get a storyboard-style outline that feels dynamic and relatable.\n\n**Example prompt:**  \n*“I’m selling a travel guide app. Generate 3-4 short scenes for a selfie-style video ad where a travel blogger uses the app while exploring a city.”*\n\nChatGPT will give you scene ideas like:\n\n* Selfie shot at a local street market\n* Showing the app to a vendor\n* Sampling local food with a recommendation\n* Closing with a call to action about the app\n\n# Step 2: Prompt Veo 3 to Generate Each Scene\n\nNext, take each scene description and feed it to Veo 3 with detailed, vivid prompts. The key is to describe not just the setting, but also:\n\n* Who is in the video (appearance, style, mood)\n* What they are doing (actions, interaction)\n* Lighting and atmosphere (time of day, mood)\n* Audio/dialogue style (accent, tone, script)\n* Visual style (grainy film look, selfie angle, etc.)\n\n**Example detailed prompt:**\n\nA selfie video of a travel blogger exploring a bustling Tokyo street market. She’s wearing a vintage denim jacket and has excitement in her eyes. The afternoon sun creates beautiful shadows between the vendor stalls. She’s sampling different street foods while talking, occasionally looking into the camera before turning to point at interesting stalls. The image is slightly grainy, looks very film-like. She speaks in a British accent and says: “Okay, you have to try this place when you visit Tokyo. The takoyaki here is absolutely incredible, and the vendor just told me it’s been in his family for three generations.” She ends with a thumbs up.\n&gt;\n\n**Here is an example channel grown to 260K followers after 18 videos**\nhttps://www.instagram.com/big_yowie_/reels/\n\nhere is the example prompt to recreate this using veo 3 and add your own assets using cliptalk:\nA handheld selfie-style shot, from the point-of-view of a gorilla in a lush jungle. A large silverback gorilla holds the camera at arm’s length. His long, powerful arm is clearly visible in the frame, and his face is perfectly framed. The gorilla says: “I’m just testing out this new AI  and I’m going to post it on TikTok later, Essentially it felt cute might delete it later” (lips moving like he’s saying it)\n\nVeo 3 then generates a fully produced 1080p video clip with synchronized audio in about 30 seconds.\n\n# Step 3: Edit &amp; Polish with Cliptalk or Your Editing Tool\n\nNow, bring the clips into an editor like **Cliptalk editor** to assemble the final ad.\n\n* Add your **brand a**ssets\n* Add **subtitles**\n* Add narration voice over (if needed but Veo 3 can generate speech too)\n* Export optimized formats for TikTok, Instagram Reels, and YouTube Shorts\n\nThis workflow has worked perfect for me and I hope it helps you start experimenting with this tools and get it's benefits.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1750016926.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.172289621350847
  },
  {
    "score": 64,
    "title": "Turned great ads with dead landings without a redesign (playbook + numbers)",
    "selftext": "We were chuffed with out CTR and CPL until we saw the depressing drop off. People clicked, skimmed the hero then left. Bit of a classic ad talks to pain, page talks about product situation. \n\nWhat worked wasn't a rebuild (of Evangelion). We decided it was time to make the page continue the same conversation the ad started. \n\n**What we did in 2 weeks (no dev queue):** \n\n1. **Message mapping &gt; new pages:** Each campaign we mapped an ad promise to with page headline, proof, and CTA. If the ad said \"cut cycle time in half\" the hero said it first, not our boiler plate. \n2. **Contextual swaps:** We used Mutiny to swap hero copy, logos, and proof by industry + company size. Ads for fintech showed fintech logos and a compliance flavored proof. Manufacturing saw throughput language. \n3. **Goal based CTAs:** Demo led campaigns got \"Book 20 min\", ROI campaigns got \"See ROI model\" and one job per visit. \n4. **Social proof that matches the click:** If the ad mentioned fewer handoffs we showed a case study quote about it. \n5. **Safety rails:** We capped variants (around 3 per campaign) and removed and that didn't beat control in 7 days. \n\n**Stack**: Mutiny for page swaps and audiences, GA4 for post click, LI/Display for ads, simple UTM hygiene. \n\n**Results so far:** \n\n* Bounce rate has dropped 12% on paid landings\n* Lead rate up by 20%\n* Wrong CTA clicks down 24%\n* Sales call show rate up 10%\n\n**Things we wished we knew when we first started playing:** \n\n1. Not everything needs to be personalized. Do it for the first 300px and the CTA. \n2. Limit audiences to value/context (industry, size, campaign theme. Firmographics alone are lipstick. \n3. Tie every swap to a single hypothesis otherwise you can't learn. ",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1762503687.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8014739840026865
  },
  {
    "score": 60,
    "title": "What AI tools are you using today for growth marketing?",
    "selftext": "I just joined a company where we’re building a culture of experimentation, and I’m leading the content &amp; growth area.\n\nI’m trying to understand which AI tools are actually helping growth marketers in their daily workflow.\n\nNot the typical “top 50 tools” you see on blogs. I’m looking for the real stack you use every day.\n\nContent, automation, data, research, agents, whatever.\n\nAnything that truly moves the needle for you.\n\nWhat’s in your AI toolkit right now?\n\nWould love to learn from your experience. Thanks in advance!\n\nCrescente",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1763168984.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.463575197597008
  },
  {
    "score": 59,
    "title": "I accidentally discovered a growth hack that got me 847 qualified leads in 6 days (and it cost me $0). The twist? I was trying to help my competitor.",
    "selftext": "Hey r/GrowthHacking,\n\nI am still shaking as I write this. Last week, I thought I was about to lose my SaaS business. Today, I have more qualified leads than I know what to do with, and it happened because I tried to be a good person.  \n  \nMy startup has been hemorrhaging money for 8 months. I build project management software for remote teams, and I was down to my last $200 in the business account. My competitor just launched a similar tool and was absolutely crushing it on LinkedIn.\n\nInstead of being bitter, I decided to do something that felt right but made zero business sense.\n\n**What I Did (The \"Accidental\" Hack):**  \nI noticed their customers were struggling with a specific integration issue in their LinkedIn comments. So I made a **free 15-minute Loom video** showing exactly how to solve it using any project management tool (including theirs, not mine).\n\nI posted it as a reply saying: \"Hey, I build competing software but noticed you were stuck. Here's a free solution that should work with \\[competitor's name\\]. Hope this helps!\"\n\n**The Results That Broke My Brain:**\n\n* **847 people** messaged me in 6 days\n* **312 said** \"Holy crap, if you help competitors, imagine how you treat customers\"\n* **89 signed up** for my free trial without me asking\n* **23 converted** to paid plans in 4 days\n* **My competitor's CEO** messaged me asking to collaborate\n\n**The Emotional Rollercoaster:**  \nI cried twice. Once when I posted the video thinking I was an idiot for helping competition. Again when I realized kindness isn't just good karma—it's the most powerful growth hack I've ever seen.\n\n**Why This Works (My Theory):**\n\n* **Trust signal**: Who helps their competition? Someone you can trust\n* **Expertise proof**: I solved their problem in 15 minutes\n* **Authenticity**: No sales pitch, just genuine help\n* **Community building**: I became \"that helpful guy\" instead of \"another vendor\"\n\n**The Replicable Framework:**\n\n1. **Find your competitor's struggling customers** (LinkedIn, Twitter, forums)\n2. **Create genuinely helpful content** that solves their problem\n3. **Give credit to your competitor** (this is crucial)\n4. **Don't pitch anything** \\- let your expertise speak\n5. **Follow up privately** if they engage\n\n**The Plot Twist:**  \nMy competitor and I are now partnering on a joint webinar next month. Turns out there's enough market for both of us, and customers love seeing \"enemies\" collaborate.\n\n**My Question for This Community:**  \nHas anyone else tried \"competitor kindness\" as a growth strategy? I feel like I stumbled onto something that could work across industries, but maybe I just got lucky?\n\nAlso, if you ever felt like you're one month away from giving up, maybe try helping someone you \"shouldn't\" help. The universe has a weird sense of humor.\n\n**P.S.** \\- The original Loom video now has 12K views &amp; I have turned it into a mini-course. Sometimes the best business moves feel like the worst business moves.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1753160394.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1081379243690526
  },
  {
    "score": 54,
    "title": "roast my simple but effective cold email.. 11.3% reply rate",
    "selftext": "Hey guys, a few months ago we started with cold emails for user acquisition on the SEO niche and I think we're doing good so far but leave you here the results and the email so you can roast it!\n\n**Subject:** backlinks\n\n&gt;Hey {firstname},\n\n&gt;I’ve seen you’ve been quite active on backlink building communities lately...\n\n&gt;We're running a free platform where you can submit {website} and match with other site owners looking for backlink collaborations (we track every collaboration to get rid of spam sites)\n\n&gt;We count with 800+ validated and high-quality websites and 1240+ partnerships has been done so far.\n\n&gt;want to join? it's free :)\n\n&gt;Best\n\n&gt;Nicolas\n\nReply Rate: **11.3%**  \nEmails Sent: **530**  \nEmails Answered: **60**  \nUsers Converted:  **23**",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1754956885.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.073377687326235
  },
  {
    "score": 53,
    "title": "How did you get your first 1,000 users for your app?",
    "selftext": "Hey everyone!\n\nI’ve been building a project called Thinkly - a micro-learning app designed for people who want to learn new skills but struggle with time and focus.\n\nInstead of long courses, Thinkly breaks topics into short, gamified lessons (XP, badges, streaks - like Duolingo, but for real-world skills).\n\nI’m currently preparing for launch and want to grow it organically.\n\nI’ve been studying TikTok and Reddit strategies for organic traction and plan to recreate content from other viral “study app” videos - but I’d love to hear from those who’ve actually done this successfully.\n\nHow did you get your first 1,000 users or testers organically?\n\nAny underrated channels or strategies that worked for you (besides the obvious ones)?\n\nNot trying to promote anything here. just looking to learn from others who’ve been through the early-stage grind.\n\nAppreciate any insight or personal experiences:)\n\nHave a lovely day!",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1762377452.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4199243915188187
  },
  {
    "score": 53,
    "title": "In less than 72 hours, I managed to rank at the very top of ChatGPT results for my niche.",
    "selftext": "And I didn’t need complicated funnels, backlinks, or ads, just a simple Reddit post.\n\nMost marketers are still focused on Google SEO…\n\nBut they’re overlooking a massive traffic source that’s right in front of us:\n\nAI-generated answers.\n\nWith 180M+ people asking ChatGPT questions every day, getting your content referenced by LLMs is the new frontier.\n\nI put together a Reddit strategy that makes your posts show up consistently in AI outputs.\n\nHere’s what I break down inside the guide:\n\n\\- The post format that boosts LLM visibility\n\n\\- A posting rhythm that maximizes indexing\n\n\\- The subreddits where ChatGPT pulls the most content\n\n\\- Why old-school SEO tactics don’t translate to LLM rankings\n\nBy applying this system, I was able to:\n\n\\- Reach the #1 spot for my main keyword in 3 days for my SAAS.\n\n\\- Capture ongoing traffic straight from AI responses\n\n\\- Outpace competitors pouring money into traditional SEO\n\nHere is the guide : [https://www.notion.so/The-Reddit-LLM-SEO-Framework-26ab9abcbe3f80e19060e679e317e5df?source=copy\\_link](https://www.notion.so/The-Reddit-LLM-SEO-Framework-26ab9abcbe3f80e19060e679e317e5df?source=copy_link)",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1757953188.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9354577776620876
  },
  {
    "score": 48,
    "title": "How I Generate High-Quality Leads on Reddit: My Exact Methods (Without getting banned)",
    "selftext": "I’ve been on Reddit for several weeks now, simply to get leads for my SAAS (30% of my demos come from reddit and 70% from my tool [gojiberry.ai](http://gojiberry.ai) )\n\nSince we’re in the B2B space, a lot of people want to generate leads.\n\nI’ve tested many methods, and I’m going to share the results I got each time.\n\nThe MOST important thing : you HAVE to give VALUE. NO ONE CARES ABOUT YOUR ADS.\n\nIf you can't provide value, stop here. It's already over.\n\nLet’s start with Reddit SEO. It’s very simple. I type keywords related to my niche on Google, see which posts show up, and then comment on them. Sometimes without my link, sometimes with my link. The advantage is that you won’t get banned. Moderators don’t really care if you comment on an old post. The downside is that if the post went viral, your comment will be at the very bottom, meaning very few upvotes and very little visibility. On very big posts, I check two or three months later and see dozens of impressions, but nothing that will change a business. If you have a way to upvote your comments and get them to the top, that can change things. We will talk about that later.\n\nComments are the first thing. What’s really interesting is that this allows you to join Reddit spaces where posting is sometimes impossible. I recommend using an account dedicated only to commenting.\n\nNext, posting in Reddit subs. I do this as well, and there are a few ways to do it. The first way is to post an open question. You post a question, and then a lot of people will start responding. For example, you ask, “What’s the best LinkedIn tool?” Many people reply, and then you respond to them saying, “I’m the creator of this tool; I wanted to compare it with competitors.” People click, and they simply sign up. That’s a soft approach.\n\nAnother method is much more direct. You share your results and say, “Here’s who I am, here’s what I achieved with this tool,” or “I’m the creator of this tool.” I strongly advise you not to put the link directly in the post. That works very well. The problem is that you can’t do it every day; otherwise, it becomes tricky. Having upvotes from the start when you post will also help you gain a lot more visibility. You see where I’m going with this; I won’t say more.\n\nWhat you can do afterward is edit the post a few days later and add your company link, because after a few days, the risk of getting banned is much lower.\n\nAnother method is Reddit SEO articles. Here, you simply write posts that rank as “alternatives to Instantly.” Then you write an article, almost like a blog, saying, “I tested Instantly alternatives; here are the pros and cons.” This is interesting because those articles rank in Google and LLMs, and in the long term, you’ll get organic results.\n\nAnother way, for posts where you can’t post because it’s too difficult, like the Lead, Lead Generation, or Y Combinator subreddits, is to run ads. Ads work really well. You set up a budget and start getting traction.\n\nA big tip when you have a post that performs well is to repost it across all quality subreddits. For example, if you post in SaaS, you can repost in SaaS Marketing, B2B Marketing, Cold Email, and so on. Often, if a post goes viral in one subreddit, it will perform in others too. Avoid putting links right away. Wait several days. Also avoid adding links in the comments.\n\nBe honest. Do not say, “I found this tool,” if it’s your own. People will find out eventually. Again, boosting your post with a lot of upvotes early on will massively increase visibility. Draw your own conclusions from that.\n\nThese are all the methods I’ve used. They allow you to book a lot of demos if you do it well. If you want to industrialize the process, I recommend having multiple accounts: one just for commenting, one for a more aggressive approach, and one for a softer approach.\n\nIf you’re not happy about this kind of marketing existing, that’s one thing. But we’re all here to get results. The key is honesty. Sell something truly useful that changes your prospects’ lives. Otherwise, even the best marketing will not help.\n\nCiao!",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1756631090.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9382600978676328
  },
  {
    "score": 51,
    "title": "Looking for marketers to test my SEO tool for free",
    "selftext": "Hey guys,  \nI’ve been building an SEO platform called **Woop**, and it’s finally at a stage where I’m ready to put it in the wild… and have it torn apart by people who actually do SEO for real.\n\n**What Woop does right now:**\n\n* AI-powered **Chat Assistant** that uses ChatGPT *but* also considers your site’s **actual SEO stats** before giving recommendations.\n* **SERP Analysis** for tracking rankings &amp; opportunities.\n* Auto-generated **Meta Titles, Descriptions, and Alt Text**.\n* **Table of Contents** generator for blogs.\n* Full **SEO Reports** with keyword breakdowns.\n* Built-in **Content Calendar** for blog &amp; video scheduling.\n\n**Why I’m here:**  \nI want honest feedback from SEO experts, marketers, and content creators. Tear it apart — tell me what’s missing, what sucks, and what’s surprisingly good.\n\n**Free beta access:**  \nI’m giving Reddit first dibs. No charges whatsoever, just try it and send your feedback.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1755165159.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3289293494558714
  },
  {
    "score": 51,
    "title": "Let's talk about VIBECODING - Anyone here using vibe coding for real business needs  and handing it off to a Fiverr dev/Inhouse dev to finish?",
    "selftext": "I’ve been wondering this for a while. is anyone here actually using vibe coding to run a business or ship real products?\n\nNot talking about side projects for fun I mean:\n\n\\* building internal tools\n\n\\* automating small parts of operations\n\n\\* getting MVPs live\n\n\\* skipping early dev hires\n\n\n\nI’m not technical, but I’ve been able to get scrappy tools 60-70% working using ChatGPT+, Cursor and other tools. They’re functional, but rough. We once had a junior teammate try building something for our ops team, worked surprisingly well, but still needed polish. We handed it off to a developer, who cleaned it up and made it actually usable. That combo worked better than expected.\n\nIt got me thinking - maybe that’s the model:\n\nLet your employees Vibe-code first &gt; freelance dev second\n\nCheap, fast, and good-enough.\n\nthis ad Fiverr put out around the exact idea  kind of nails the vibe-coding spirit:\n\nFiverr's video on helping vibe coders finish their builds\n\n(yes, real ad  no I’m not on their payroll)\n\nSo I’m genuinely curious:\n\nAnyone else here using this hybrid model in a real business?\n\nIs it scalable?\n\n",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1753895399.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0486395961864523
  },
  {
    "score": 52,
    "title": "Low karma = low life? How do you escape Reddit noob jail?",
    "selftext": "Hey folks, so I recently joined Reddit thinking I could finally ask smart questions and join cool convos. Plot twist: I can’t do sh\\*t because my karma is somewhere between 0 and “don’t even try.”\n\nHalf the subreddits are like VIP clubs and I’m the guy in flip-flops at the door. I get that it’s to stop spam, but come on… how are you supposed to *start* if you can’t *start*?\n\nAny clever (but legit) ways to get past this low-karma purgatory? I don’t mind working for it, but farming upvotes on cat pics wasn’t exactly part of the plan.\n\nAppreciate any survival tips.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1753277302.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2473964882885826
  },
  {
    "score": 51,
    "title": "Wrote 50 cold emails. Got 2 responses. Both became customers worth $47K combined.",
    "selftext": "Hated the idea of cold email. Felt spammy. Felt desperate. Avoided it for years because it seemed beneath what a \"real\" company should do. Then I ran out of other ideas and needed customers.\n\nWrote 50 personalized cold emails. Not templates. Actually researched each company and wrote something specific to them. Mentioned something from their website or recent news. Explained specifically why I thought we could help their situation. Took about 2 hours total for all 50 because I batched the research.Created a simple one-pager in Gamma that I could attach showing exactly what we do for companies like theirs.\n\n48 people didn't respond at all. Expected and fine. 2 people responded. Both turned into calls. Both turned into customers. One became a $29K annual contract. The other started at $8K and has expanded twice since then. Those 2 hours of writing cold emails generated more revenue than months of content marketing and social media combined. I was so worried about bothering people that I missed out on helping people who actually needed what we offered.\n\nCold email isn't spam if it's relevant and personalized and offers real value. Spam is irrelevant mass messaging. Taking time to understand someone's situation and explaining how you might help is just sales. And sales is how businesses grow. I still don't love doing it but I stopped pretending it's beneath me.\n\n  \n",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1767115424.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.113490017620208
  },
  {
    "score": 51,
    "title": "I thought I cracked growth by Programmatic SEO. Went from 1000 -&gt; 0 impressions overnight (learn from my mistake)",
    "selftext": "I thought I had stumbled on a goldmine for Programmatic SEO.\n\nHere’s the setup:  \nI came across a site that used AI to generate tattoos. They had a ton of category pages (“rose tattoo ideas,” “skull tattoo ideas,” etc.) and were ranking with crazy traffic. I thought why not do the same for **nail designs**?\n\nQuick SEMrush check showed huge search volume + low keyword difficulty for stuff like “sunflower nail designs,” “pink nail designs,” “Christmas nail designs.” Basically 'X Nail Designs'. Hardly any competition. Perfect.\n\nSo I built a site:\n\n* H1 + optimized title + short description\n* AI-generated nail art images\n* Started with \\~10 categories (rose, gothic, Christmas, etc.), 5 images each\n\nWeek 1 - impressions climbed from 100 &gt; 200 &gt; 1,000. Looked promising.\n\nThen came my fatal mistake.  \nI wanted to scale. I generated 40+ more images per category, aiming for \\~50 per keyword. Suddenly I had 3,000+ pages ready. I thought I’d “play it safe” by only submitting 5 new links/day in the sitemap… but I forgot Google crawls automatically.\n\nGoogle discovered all 3,000 pages at once.  \nWithin days &gt; impressions tanked to **zero**. The site got slapped (soft penalty / crawl bloat, still figuring out which).\n\nSo yeah… I basically killed my own site in 1 week by flooding Google with AI-generated pages.\n\n**Lesson:** If you’re doing programmatic SEO, don’t push thousands of thin/duplicate-ish pages live at once. Pace your publishing, make sure pages have unique value, and control what’s crawlable.\n\nHope this helps someone else avoid the same pain.\n\nhttps://preview.redd.it/2td3zvo2xljf1.png?width=2706&amp;format=png&amp;auto=webp&amp;s=904f90e5898f873fd3df37c719108acaf80fe647",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1755415113.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.210260313573743
  },
  {
    "score": 50,
    "title": "Scraped 10,000 SMBs without a site — building their landing pages BEFORE contacting them",
    "selftext": "Hi hackers,\n\nI’m experimenting with a bold idea:  \n→ What if I created a personalized site for a small business *before* even reaching out?\n\n# The plan:\n\n* Scraped 10k local businesses with no online presence other than Google Maps\n* Auto-generated landing pages using Deep + Next.js\n* Deployed via Vercel CLI (1 subdomain per business, which is just a slug of the lead's name + vercel.app)\n* Send to each of them a custom SMS with their live site that they can edit\n\nSo far, I’ve only tested it on a **first batch of 1,000 businesses in the “Spa / Beauty” niche**.\n\nResults? → 0 conversions 😅  \nBut I got useful insights (SMS deliverability, CTR, infra limits, etc.)\n\n👉 Full breakdown:  \n[https://yannis.blog/articles/how-I-generated-10k-landing-pages-for-local-businesses](https://yannis.blog/articles/how-I-generated-10k-landing-pages-for-local-businesses)\n\nI’m now preparing a second test on plumbers/electricians.\n\nWould love to hear ideas for better niches, feedback on the approach, or tips.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1747377611.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3047081108983307
  },
  {
    "score": 48,
    "title": "The Hidden 4th Asset on LinkedIn Everyone Ignores (Growth Hack)",
    "selftext": "**Most people think LinkedIn has 3 assets:**\n\n1. Business page (limited organic reach)\n2. Personal profile (decent reach but hard to scale)\n3. Paid ads (expensive, obvious)\n\nBut there's a 4th asset hiding in plain sight: **Strategic commenting on influencer posts**\n\nWhen you consistently add value in comments under posts from leaders your audience follows, you're essentially getting free placement in front of thousands of engaged prospects.\n\nThe hack: Instead of chasing followers, chase the comment sections of people who already have your ideal audience's attention.\n\nAnyone else discovered unconventional LinkedIn assets?",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1750246641.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1337750956996233
  },
  {
    "score": 46,
    "title": "Cold outreach taught me one big lesson: Never sell in outreach. Sell to inbound.",
    "selftext": "I've been deep into cold outreach lately. Tried Infra, ZaZu’s playbook, Eric Kowalski’s videos, even dug into the SaaS Yacht Club stuff. There are so many tools out there to help you set up your infra, find great leads, write punchy copy, automate sequences.. all of it.\n\nBut here’s the one thing that really stuck with me:\n\n**Don’t try to sell in your outreach.**\n\nEveryone you reach out to cold, that TAM you’re hitting… if they’re interested, they’ll come back later. Like a boomerang. Not because your pitch was perfect, but because you sparked just enough curiosity.\n\nAnd that’s where the magnets come in.\n\nYou’ve gotta plant them all around your landing page, your socials, even your personal LinkedIn. All the places they might lurk before reaching back out. Once they do, the whole equation flips. Now they’re the ones trying to convince *themselves* to try your product. You’re not pushing anymore.\n\nI think I read something like this in a MKT1 newsletter or maybe one of Kyle Poyar’s posts. Either way, it hit hard.\n\nCold is for planting the seed. Inbound is where it grows.\n\nAnyone else noticing this shift in how outbound works lately?",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1746778334.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1653373164568452
  },
  {
    "score": 47,
    "title": "What finally made your growth results feel predictable?",
    "selftext": "For a long time our growth work felt streaky. One month something worked, the next month it didn’t, and it was hard to tell whether we were learning or just getting lucky. We were running experiments, but the inputs kept changing underneath us.  \n  \nWhat started to help was paying more attention to what fed the campaigns. Who exactly was getting into the audience, how fresh the data was, and whether we were reacting to real signals or just static attributes. Once those inputs stabilized, outcomes became a lot easier to explain.  \n  \nCurious if others have felt this shift. Did your growth get better from better ideas, or from tightening the system that sits before the campaign even launches?",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1765900951.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9882129135290056
  },
  {
    "score": 46,
    "title": "Should I ditch landing pages for email only offers?",
    "selftext": "I'm a growth marketer selling to mid market and enterprise. For years we've leaned on classic gated landing pages for every campaign like webinars, calculators, playbooks, etc. lately we're seeing those pages do less and less. \n\nFewer conversions, more dropoffs, it just feels like people don't want to jump through hoops anymore. \n\nWe've been experimenting with making email itself the offer. No clickthrough to a landing page, CTA just opens a pre filled reply or short form in email, and keeping people inside their inbox where they're already primed to act. \n\nAnother team tested this with a client and the email-only flow outperformed the landing page by around 25% on signups. Especially in smaller well defined segments like RevOps leaders at top accounts. \n\nBut we're nervous about losing tracking data and A/B test control that landing pages have. Anyone here make the switch?\n\nIf so, please let me know if: \n\n* It held up past the first few sends\n* How you handled attribution and reporting\n* Any unexpected side effects on deliverablility, spam filters, buyer confusion, etc. ",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1759839400.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0373223186248546
  },
  {
    "score": 45,
    "title": "How I'm getting inbound leads from LinkedIn without cold DMs (the lazy way)",
    "selftext": "Ran an experiment over the last few months and wanted to share what's working.\n\nInstead of sending connection requests or cold messages on LinkedIn (which felt gross and barely converted), I tried something different: strategic commenting.\n\nThe idea is simple. Find 5-10 creators in your niche who already have the audience you want to reach. Show up in their comments every day with something actually useful—not \"great post 🔥\" but real thoughts that add to the conversation.\n\nAfter a few weeks, people start recognizing your name. Some check your profile. Some reach out.\n\n**Results so far:**\n\n* 3-5 inbound conversations per week\n* 2 paying clients directly from LinkedIn comments\n* Zero cold outreach\n\nThe bottleneck was finding the right creators to engage with. LinkedIn search is pretty bad for this—you get millions of results and hit the limit fast.\n\nSo I built a simple directory that organizes LinkedIn creators by niche. Makes it way faster to find people worth following and engaging with.\n\nHappy to share if anyone wants to try this approach.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1764470412.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/bs10wqrc4b4g1/CMAF_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/bs10wqrc4b4g1/CMAF_96.mp4",
        "dash_url": "https://v.redd.it/bs10wqrc4b4g1/DASHPlaylist.mpd?a=1770353801%2CZGE4YzNlODA2MmMzYTdmNTcyN2U0MDRjOTI4NTUxYzMxNDI0MmY0ZjU4MmYzZGQzOTg0ZjYyN2JlNTc0ZjkxNQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 20,
        "hls_url": "https://v.redd.it/bs10wqrc4b4g1/HLSPlaylist.m3u8?a=1770353801%2CNzU3NzU4Mjg0ZmZmM2E5ZjU4OThlOTkwZmExYWZjZjQzZDVjOTY2ZWU0ZDUyMjIxNjRlM2M3NGQwMjYxYjBmMg%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7097428338495835
  },
  {
    "score": 42,
    "title": "How do you even start building GTM workflows and automations?",
    "selftext": "Seeing a lot of talk about GTM workflows and automation lately and I’m realizing I don’t fully understand what that actually means in a real setup. Is it just about linking tools together so data moves automatically or is it more about designing an entire process that helps with outreach, lead scoring, or campaign timing?  \n  \nRight now most of what I do is still pretty manual, researching leads, cleaning data, sending follow-ups, etc. It works but it feels like I’m wasting time on stuff that could probably be automated if I just knew where to start. If anyone here’s built their first GTM workflow or started automating parts of their process, how did you approach it?",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1760983672.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9855284469075487
  },
  {
    "score": 41,
    "title": "AI in Lead Generation—Game Changer or Overhyped?",
    "selftext": "AI-powered lead generation tools are everywhere now, but are they really as effective as people claim? I’ve tried a few, like Apollo, ZoomInfo, and Success AI, and I’ve seen some solid results. Success AI, in particular, has been great for automating prospecting without the high costs of some other tools.\n\nThat said, AI tools aren’t perfect. Sometimes the data isn’t accurate, and you still need to do manual outreach. Plus, cold emails only work if you have a solid strategy.\n\nFor those of you who use AI for lead generation, what’s your experience? Are these tools actually making a difference in your sales process, or is traditional networking still the best approach?",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1742231879.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1108242795578533
  },
  {
    "score": 40,
    "title": "AI SEO Tracking tools are everywhere, so what are you actually using?",
    "selftext": "Hello guys! Feels like every tool out there is suddenly pushing their own version of an AI SEO checking tool. Perhaps this is fair.\n\nOver the past few months, I’ve tried out Surfer AI, SE Ranking, and Nozzle. Each has its perks, but I’m holding off on full reviews because I want to hear what others here are using first.\n\nSo my question is what AI SEO tracking tools have you actually tried and stuck with?\n\nI’m especially interested in what’s working for those of you in content-heavy industries or who track multiple regions. Before I commit to anything long-term, I’d love to hear your take.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1752657308.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3493477835195846
  },
  {
    "score": 39,
    "title": "Here's what I learned watching young founders get rich with AI",
    "selftext": "They don't just build products. They build audiences first.\n\nEvery post is market research. Every viral moment gets monetized. Every comment becomes customer feedback.\n\nThe fastest path to your first $10M isn't buried in code anymore.\n\nIt's in your ability to make strangers stop scrolling.\n\nThen you build what they actually want (using AI to speed up development).\n\nSmart founders master the feed before they master the framework.\n\nAre you building an audience while you build your product?\n\n*Content is the new code*...\n\n",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1751028129.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7791506143517744
  },
  {
    "score": 36,
    "title": "I figured out how companies get tens of thousands of free targeted LinkedIn page likes",
    "selftext": "Hey everyone, I just found a hack some companies use to blow up their LinkedIn pages with likes from their exact ICP.\n\nImagine you’re running a SaaS targeting executives at $50M+ companies. Normally it’s really hard to get that audience to follow your page. And yet some pages have 10k, 20k, even 50k followers even though they barely post content and offer no incentive.\n\nI always wondered how they were doing it.\n\nHere’s the trick. When you post a job opening from your LinkedIn page, anyone who applies is automatically prompted to follow the page as part of the LinkedIn flow.\n\nWhat many companies do is create dozens of fake job listings. These attract hundreds or even thousands of applicants and instantly boost their page followers.\n\nI tested it myself. Within minutes, dozens of people followed my company page. It works.\n\nBut the downside is that you waste candidates’ time. Some applicants were sending custom videos and carefully tailored resumes for jobs that didn’t even exist. That’s when I deleted the job post. It felt wrong.\n\nStill, the hack is repeatable. In theory you could create 100 fake job posts and flood your page with followers. Some even scrape emails from the applicants.\n\nPersonally I don’t like this approach because it feels abusive. But in the first comment I’ll share something more useful. You can extract your competitors’ page followers. These are people in your ICP who already know your competitors, either because they liked their page or applied to their jobs. Fresh leads without wasting anyone’s time.\n\nTake this hack however you want. Even if you use the fake job method, I won’t judge.\n\nCheers !",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 36,
    "downs": 0,
    "created_utc": 1758406337.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8001734002204133
  },
  {
    "score": 38,
    "title": "Automatically add every people who sign up to your website or book a call to an automated LinkedIn sequence (84% conversion rate)",
    "selftext": "Hey everyone!\n\nWe’ve built this flow that could be of interest to other people here:\n\n* When somebody signs up, we automatically search the LinkedIn profile from the email address\n* Then add them to a LinkedIn sequence:\n   * Invitation: “Botdog!”\n   * 2 hours after invitation is accepted, a message: “Hey {{firstName | there}}! How are you doing? Saw you created an account on Botdog, how is it going so far for you?”\n   * Follow up message after 1 day if no reply: “Hey {{firstName}}? 🙂 Would love any feedback on your experience with Botdog so far!”\n* This works amazingly: **84% invites are accepted** (so then they see our content on LinkedIn, we can direct message the etc.) and **66% reply (!!)** \\- so 6X as many replies as our automated onboarding emails\n\nTotal cost: $20/month for Zapier, $47/month for Botdog Professional, \\~$0.06 per successful enrichment (we use ReverseContact pay as you go, there are other options - they have a pretty good hit rate of about 80% so far).\n\nFor now, we get \\~400 signups per month, so that's not too many to send an invitation to everyone. Once we get beyond that we plan to use Botdog's AI review feature to give instructions like “Only proceed if the person has at least 1,000 linkedin followers AND a LinkedIn paying subscription AND is likely to be interested in a tool to automate LinkedIn prospection (because they are involved with sales, because their company sell to B2B).”.\n\nThis way we’ll only use our invites on people who are the most likely to convert.\n\n[The exact Zapier flow, Fallback is if no LinkedIn profile is found via ReverseContact](https://preview.redd.it/2tmaiqqj6s0f1.png?width=1544&amp;format=png&amp;auto=webp&amp;s=cbff49262c9afaff7486ecbcef4434298f6decb6)\n\nYou’ll see that we use Slack notification as the trigger to sign up, this is a bit dirty but it works - you can use any trigger here, new Stripe subscription, Calendly or HubSpot meeting booked etc.\n\nThat's it, very obvious push for our product but I'm sure this could be useful to others here.\n\nLet me know if you want to do this, happy to jump on a call to build the Zapier with you!",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1747243036.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9540796048584896
  },
  {
    "score": 36,
    "title": "We got 10,000+ users without spending a dime on ads—here’s the system that actually worked",
    "selftext": "Everyone talks about viral loops and SEO—but the biggest growth unlock we’ve seen lately?\n\n**Turning retention into acquisition.**\n\nHere’s what I mean:\n\nMost startups obsess over getting *new* users. But what if your *existing* users were your best growth channel?\n\nWe built a loop that looked like this:\n\n1. User buys → gets a digital pass (like Apple Wallet or Google Wallet)\n2. We send *lock screen* push notifications for product drops, restocks, etc.\n3. Those push messages get opened at 30–40%+ rates (not a typo)\n4. The pass itself includes social sharing + referral hooks → bring in new users\n5. New users get their own pass… loop repeats.\n\nThis worked insanely well for DTC brands, indie SaaS tools, and creators.\n\n**Example:**  \nA niche apparel brand we worked with had under 1,000 customers. In 6 weeks, they:\n\n* 4x’d their returning customer rate\n* Got 2,000+ *net new* subscribers just from customer sharing\n* Had push open rates that crushed email and SMS\n\nNo ads. No algorithm games. Just a loop powered by lock-screen real estate nobody else was using.\n\n**Lesson?** Growth doesn’t always come from getting louder. Sometimes it’s about creating a reason for users to come back—and bring others with them.\n\nWhat’s the least obvious growth loop you’ve ever used (or seen someone use)?",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 36,
    "downs": 0,
    "created_utc": 1746127100.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9012167218989857
  },
  {
    "score": 37,
    "title": "My experience running Reddit Ads for my SaaS: 129k impressions, 344 clicks, €143 spent and 0 conversions",
    "selftext": "Hey Growth Hackers! I recently ran a Reddit ad campaign for my SaaS product [stackchanges.com](https://stackchanges.com) (a SaaS that monitors websites and reports changes and security issues). I liked the experience and wanted to share what I learned.\n\n# How I created the ad\n\nI decided to test Reddit ads because of its tech-savvy audience and targeting options. For our creative, I wanted something that would stand out in the feed. I used [Midjourney](https://www.midjourney.com) to generate eye-catching tech-themed images. The prompt I used was pretty specific - I wanted servers with electric energy around them on a clean white background. I'm amazed by the speed and quality of Midjourney. Then I used [Pixelmator PRO](https://www.pixelmator.com/pro/) to add text overlays. Reddit ads work best at 1140x1080 pixels. I made three different versions of the ad to test what would work best. I tried adding them to this post but they are deleted automatically by Reddit.\n\nHere's what happened in 3 days:\n\n* 129,099 impressions\n* 344 clicks\n* €143 spent\n* 0 conversions (yes, zero - even with a free month promo code)\n\n# What I learned\n\nTwo big takeaways:\n\n1. Timing is everything. People casually scrolling Reddit aren't actively looking to solve the problems they have at that moment. So, wrong moment to catch them.\n2. Subreddit fit matters more than I thought. Even though we targeted tech-focused subreddits, the audience match wasn't quite right for our specific tool.\n\n# Would I do it again?\n\nProbably not for stackchanges.com. I think our product needs to catch people when they're actively dealing with issues, not during their Reddit browsing time. Has anyone else here tried Reddit ads for a technical SaaS product? What was your experience? Would love to hear your thoughts!",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1739264806.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0084825955662877
  },
  {
    "score": 36,
    "title": "Landing pages v microsites: which converts better?",
    "selftext": "Currently debating whether to keep building single page landers that drive focus and urgency, or make small multi page \"microsites\" that give us more room for story, proof, and CTAs. \n\nThe two camps in my company argue: \n\n* Single page landers mean faster load, tighter message, less chance of drop off\n* Or, that microsites have more content paths, can tailor messaging by persona, and feel more substantial for high value accounts. \n\nOf course, the boss has the final say and will only go with the option that can prove the highest ROI. If you've AB tested or run both, please let me know how you fared. \n\nWhich gave you better conversion rates? Did the imapct depend on product type, funnel stage, or deal size (we work with small to medium sized B2B SaaS companies). Any huidden trade-offs like SEO, sales enablement, ad quality score? ",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 36,
    "downs": 0,
    "created_utc": 1757683059.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7803229787866575
  },
  {
    "score": 38,
    "title": "Scaling from $100K to $10M ARR : where do you hire vs. outsource?",
    "selftext": "I’m leading growth at a startup. We’ve just crossed $100K ARR (collected upfront) in our first two months, all organic, no paid ads, just content and scrappy growth loops. Our team is small: two of us on marketing/growth, one on content. The product is premium and trust-driven.\n\nWe’re very AI-first using it to punch above our weight and now we’re asking the classic question:\n\n**Do we keep the team lean and outsource the rest? Or start bringing on full-time hires to scale?**\n\nI’ve done both. Ive hired full-time more in the past but seem more interested in the freelance more project based this time round. Is that just the grass is greener syndrome showing its head? Each has tradeoffs. Staying lean is fast and efficient. But outsourcing can feel fragmented. No one owns outcomes long term. That’s what I’m worried about.\n\nSo I’m curious for anyone who’s *been on a team that really scaled* — from $100K to $1M to $10M+:\n\n* **Where is ownership most important early on?**\n* **What roles should be in-house vs. outsourced at different stages?**\n* **Who were the most important hires as your team grew?**\n* **What would you** ***do differently*** **if you were scaling again in todays environment?**\n\nTrying to stay capital-efficient *without* missing the moment. Would love to hear how others navigated this.",
    "subreddit": "GrowthHacking",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1754400633.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.078639596186452
  }
]