[
  {
    "score": 414,
    "title": "Please stop trying to transition into this field.",
    "selftext": "I get there are lots of burnt out providers in the field, and lots of developers out of work at the moment.  I would advise against trying to transition into this field at the moment.  The US government is removing 1 Trillion dollars from the US healthcare system over the next decade due to the BBB.  I don’t think people really comprehend what that means. Back of a napkin math means there will be potentially one million less jobs that pay 100k. 1m x 100k x 10y =1T. You’re going to be competing against people with a decade of experience specifically in healthcare tech.  I know people with a decade of healthcare tech experience even with AI who are competing for shitty $30 an hour contract jobs and still not finding work.  If you currently have a job, keep it and wait.  So many people are saying it’s sunshine and rainbows here, but that is not case anymore, pre 2022 this was an amazing field but that was largely due to digital transformation mandates like the HITECH act.  I’m not saying this to be a Debbie downer, I’m saying this field is saturated.\n\nEdit:\nI appreciate it may not be this way forever, but my point is that now is not the time to shoot for a transition.  You will be competing with people that have years of experience in the specific technologies that you are just now learning.",
    "subreddit": "healthIT",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 414,
    "downs": 0,
    "created_utc": 1753125122.0,
    "media": null,
    "is_video": false,
    "num_comments": 143,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.69,
    "category_rationale": "Central claim that the healthcare tech field is saturated and not a good time to transition, with supporting reasoning.",
    "composite_score": 4.372229342759717
  },
  {
    "score": 352,
    "title": "I Lost My Dream Job Because I Told Someone Else About It",
    "selftext": "I feel so stupid right now. I was in the final stages for an Application Analyst position—my dream job. It was down to me and one other person. The competition was tight, but I felt confident.\n\nThe worst part? I basically handed the job to my competition.\n\nI had told someone else about the role, thinking nothing of it. I didn’t think they’d be interested, let alone apply. But they did. And guess who got the offer? Not me.\n\nIt stings knowing that if I had just kept my mouth shut, my chances would’ve been so much higher. I don’t want to be that person who hoards opportunities, but damn, this one hurt.\n\nI’m trying to be mature about it—maybe it just wasn’t meant to be. But I can’t shake this feeling of regret. Lesson learned: not every opportunity needs to be shared.\n\nHas anyone else ever been in a situation like this? How did you move on?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 352,
    "downs": 0,
    "created_utc": 1739928695.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Personal anecdote with a clear lesson about not sharing opportunities and a question for others' experiences.",
    "composite_score": 4.178364692379766
  },
  {
    "score": 216,
    "title": "Got the offer!",
    "selftext": "I had a post a couple of weeks ago no IT experience.  11 years of radiology exp at same company.  Finally got my offer letter.  $114k as an Epic Radiant Analyst II.  They bumped me to ii due to my clinical experience within same company.  Implementation in 18 months.  I put 95k as desired salary cause thats what google told me lol.  Base from old clinical position was 110k. I guess my question would be should i negotiate for a bit more.  Chatgpt says average in my area is $117k for entry level analyst.  How should i go about this?  \n\nUPDATE: \n\nTook the offer.  Didnt ask for more money.  I did ask for flexibility in hours.  7-4 instead of 8-5.  Hybrid position 2 days in office.  Will increase as we get closer to go live.  THANKS TO EVERYONE THAT OFFERED ADVICE AND HELPED OUT!  Im excited to start my new job.",
    "subreddit": "healthIT",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 216,
    "downs": 0,
    "created_utc": 1755905193.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Celebratory post about receiving an offer and a brief discussion of negotiation considerations.",
    "composite_score": 4.014705096434771
  },
  {
    "score": 203,
    "title": "I still think people aren't getting it.",
    "selftext": "I saw another post today of someone asking about how they could transition from an RN to working in healthcare tech in a remote position paying $100k+ with some certifications.  I want to really emphasize how bad this market is.  My resume is below, I am even applying for $60k a year jobs and getting rejected.  I have, for fun, spun up EHR's and PACS servers on my homelab from scratch to play around with.  I'm not trying to shit on people that are trying to get in this field, but this is what you're up against for even lower-level roles.  It's not even a question of interviewing well, it's that I can't even get the interviews in the first place.  I can't emphasize enough how much I'm not doing this to be rude or crush dreams, I'm just trying to save you some time.  If you have a job right now, keep it!  Start saving as much money as you can, this is not the time to transition!\n\n**Solutions Engineer with 10+ years of experience in healthcare technology specializing in interoperability standards (FHIR, HL7, X12, DICOM). Successfully led implementations and integrations for major healthcare payers, radiology groups, and hospital groups, achieving up to 80% improvement in efficiency. Author of 'BOOK' bringing analytical rigor and innovative problem-solving to client-driven solutions.**\n\n \n\n**WORK EXPERIENCE**\n\n \n\n**Fifth Company                                                                                                            Sept. 2023 – Nov. 2024**\n\n*Solutions Engineer III*                                                                                                                             \n\n▪         Responsible for communication across different verticals within the organization, including product, project management, development, and sales. \n\n▪         Acted as primary technical consultant for major healthcare payer integrations utilizing x12 HIPAA standards.\n\n▪         Enhanced internal business processes, significantly accelerating client implementations.\n\n▪         Supported sales teams in pre-sales engagements, providing technical expertise to close deals and set accurate client expectations.\n\n▪         Designed and implemented new API connectivity standards, achieving an 80% reduction in custom software deployments.\n\n \n\n**Fourth Company                                                                                                         July 2021 – Sept. 2023**\n\n*AI Implementation/Support Manager*                                                                                                                   \n\n▪         Built and managed a high-performing team of support and implementation engineers from the ground up, enabling company growth by 500% over two years.\n\n▪         Led technical deployments of advanced radiology AI applications for renowned institutions including the NIH, VA, and the UK’s NHS.\n\n▪         Conducted heuristic analyses of clinical trial data, optimizing AI algorithmic performance.  Leveraged 3^(rd) party systems like google healthcare NLP API to assist.\n\n▪         Managed SLAs, customer relationships, and comprehensive training for global clients and partners.\n\n▪         Played a critical role in successful company exit through \\_\\_\\_\\_ acquisition.\n\n \n\n**Third Company                                                                                                             Oct. 2016 – June 2021**\n\n*Senior Support Analyst*                                                                                                                                  \n\n▪         Provided expert troubleshooting and integration support for Master Data Management/eMPI systems involving HL7v2, FHIR, Dynamics CRM, SOAP, and RESTful API’s.\n\n▪         Leveraged advanced data analysis skills using SQL and MongoDB to deliver effective solutions for patient demographic data matching/merging.\n\n▪         Consistently achieved SLA targets, enhancing client satisfaction and retention.\n\n▪         Supported critical processes leading to a successful acquisition by \\_\\_\\_\\_\\_\\_.\n\n \n\nSecond company - Not listed on my resume but was a Jr. .Net developer for a year\n\nFirst company - Not listed on my resume but ran a PC repair shop as a manager for a couple years\n\n \n\n**EDUCATION**\n\n**U of I**                                                                                                    \n\n*M.S. Health Informatics*\n\n*B.S. Computer Science* \n\n**TECHNICAL SKILLS**\n\n \n\n.Net/C#, SQL, MongoDB, Python, HL7v2, FHIR, X12, MSSQL Server, Visual Studio, Putty, RDP, Windows, Linux, Word, Excel, Power Point, Network Troubleshooting, Networking, Power shell, Bash, Git, HubSpot, Jira, Dynamics CRM, Salesforce, Docker, AI, DICOM, Healthcare Technology\n\n \n\n**SOFT SKILLS**\n\n \n\nNegotiation, Client Success, Project Management, Leadership, Problem Solving, Management, Strong written/verbal communication skills.\n\n \n\n**Publication**\n\n I wrote a book that puts engineering processes in terms that the layperson can understand but will not list it here to avoid doxxing",
    "subreddit": "healthIT",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 203,
    "downs": 0,
    "created_utc": 1754094268.0,
    "media": null,
    "is_video": false,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.79,
    "category_rationale": "Strong negative stance about the job market and interviews, framed as a warning to others.",
    "composite_score": 4.098051961398285
  },
  {
    "score": 181,
    "title": "After a year trying to build a healthcare app, I've made the process short for all of you in 5 steps",
    "selftext": "Alright so I'm an idiot who thought building a healthcare app would be like any other startup. Spoiler alert: it's not.\n\n**Step 1: Figure out HIPAA .** Thought patient data was just regular data. Nope. $15k for compliance stuff before I even wrote code. Now I have a 47-page document I pretend to understand.\n\n**Step 2: Integrations.** Epic wants $25k just to talk to them. Took 8 months to get approved. Best part? Our app crashed every time someone with an apostrophe in their name tried to log in. Thanks O'Connor.\n\n**Step 3: Timeline.** Told everyone we'd ship in 3 months. That was 14 months ago. Every simple feature becomes a compliance nightmare. Lost my first developer after the third audit.\n\n**Step 4: Money disappears faster than you think.** AWS went from $500 to $3k a month. Had to hire a DevOps guy at $5k/month because everything kept breaking. Burned through $220k way faster than expected.\n\n**Step 5: User research.** Spent 8 months on this beautiful interface. First doctor said it doesn't fit their workflow at all. Apparently clicking 5 times to schedule something is too much work.\n\nTurns out there are pre-built components for all this . Would've saved me a year of pain and most of my money if I'd known that from the start.",
    "subreddit": "healthIT",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 181,
    "downs": 0,
    "created_utc": 1754986518.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.95,
    "category_rationale": "Explicit 5-step procedural outline for building a healthcare app.",
    "composite_score": 3.9693714738660333
  },
  {
    "score": 151,
    "title": "What happens when Judy Faulkner steps down?",
    "selftext": "I'm not saying that Epic is bad software, but I do think one of the reasons it succeeds is the business model of requiring customers to staff an appropriate number of analysts and having dedicated support resources that work with those analysts. Requiring certifications to support the software turns the analyst into a commodity rather than an employee. If you are an employer you either hire and train with the risk of investing in an employee who takes that cert and finds another employer who pays more or you pay more money for employees who come with a cert. \n\nThere is also the matter of the campus at Epic and the requirement that Epic employees are in office. My experience is that there is a continual turnover as top performing college kids get hired at Epic, gain experience and then leave. It's rare you meet someone with a decade of tenure. The campus is interesting but it seems like a monument to one person's personality rather than a typical business investment. And, it's in Verona, Wisconsin. I must confess I like the campus, but I am not sure what it contributes. I was more impressed with the underground parking and the quality of their food and also, that catering are Epic employees and not outsourced. Kudos for that.\n\nThe question I have is what comes next? Does Epic stay privately held? Do those that come after operate with the principles that have governed Epic or does new management have an eye toward privatization and the big payoff that would come along with it? Does the business model turn toward expediency and immediate profitability over long term stability and continuous improvement? Does Epic ever fall under the eye of regulators as a monopoly in the industry? What happens if folks see the campus as a liability rather than an asset? I'm just curious if the next generation of management doesn't cannibalize the organization for money. I mean it is the American way!\n\nHaving worked with multiple EMRs, Epic is definitely a different implementation and support model. If you want to be successful, you tend to drink the kool-aid and conform your business toward their best practices. Other EMR solutions are definitely more hands-off and only come knocking when their is something new to sell OR they are afraid you are jumping ship. No one stays at the top forever.   \n\n\n  \n",
    "subreddit": "healthIT",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 151,
    "downs": 0,
    "created_utc": 1765129268.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Opinion/analysis about Epic leadership and future direction with speculative reasoning.",
    "composite_score": 3.7647695937658447
  },
  {
    "score": 136,
    "title": "Just accepted an Epic Analyst role with my company!!!!",
    "selftext": "Hello all!  \n  \nI’ve been working for an MSP that provides IT services for a hospital organization for about two years now, mostly doing in-person field service and help desk work. I applied for an Epic Analyst position kind of spontaneously and I actually got it!\n\nThey’re sending me to Epic HQ to get certified in Radiant, which is wild. I’ll be honest… I didn’t realize how big of a deal this was until after I accepted the offer. Now I’m a little nervous since it’ll be my first remote role, and I don’t have much Epic experience beyond basic user-level troubleshooting (like filters and printing).\n\nFor anyone who’s gone down this path - any pointers for working from home or advice on what to expect on the day to day?  Also, I’ve heard the tests for the certification are open book, is that true?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 136,
    "downs": 0,
    "created_utc": 1761306990.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Personal milestone with a request for advice; post not clearly fitting other categories.",
    "composite_score": 3.8121273632968022
  },
  {
    "score": 106,
    "title": "H1B visas to cost $100k a year",
    "selftext": "I have no love for the current administration after they pulled that medicare/medicaid cut but for once they've done something I really agree with.  The tech industry has been absolutely rife with H1B abuse.  If our college graduates cannot find jobs, then there should be 0 more IT workers coming in.  Also it has really limited the job market for home-grown PhD's.  Additionally there is definitely a pattern when once someone on an H1B visa gets into a hiring or management role, they help all of their buddies come work for them, shutting out American workers.",
    "subreddit": "healthIT",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 106,
    "downs": 0,
    "created_utc": 1758345710.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.64,
    "category_rationale": "Opinion against H1B practices presented as a normative stance.",
    "composite_score": 3.5535452077454375
  },
  {
    "score": 101,
    "title": "Caught staff using consumer AI tools for patient care coordination and almost had a hipaa nightmare",
    "selftext": "Almost had massive hipaa violation last month. Care coordinator using free AI tool to transcribe patient calls. Downloaded it herself didnt ask anyone.\n\nDiscovered during audit. Tool had zero hipaa compliance, no BAA no encryption no controls. Just storing PHI on random server somewhere.\n\nShe said yeah ive been using it 3 months its so helpful. Three months of patient info in random cloud service.\n\nHalf our staff doing similar stuff. Consumer AI tools with zero compliance being used for patient data.\n\nRoot issue is our approved tools are bad and approval takes forever. People find own solutions without thinking about compliance because theyre focused on patients not IT policy.\n\nHad to implement better tools that meet hipaa requirements while being good enough people actually use them.\n\nDid training on why this matters. Most staff had no idea they were creating compliance issues just wanted better tools.\n\nThink this happening at way more healthcare orgs than anyone realizes. Consumer AI so accessible and better than approved tools that people just use it without understanding implications.\n\nAnyone else dealing with this? How are you balancing security with actually giving staff tools they need. If you care about a recommendation we ended up going with fellow but there are other hipaa compliant notetakers out there - just be sure to check for that and that they dont use your data to train their ai models (v important).",
    "subreddit": "healthIT",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 101,
    "downs": 0,
    "created_utc": 1764938810.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.67,
    "category_rationale": "Cautionary incident about unapproved consumer AI tools with recommendations for compliant tools.",
    "composite_score": 3.6373546281150357
  },
  {
    "score": 97,
    "title": "Feeling like I made a mistake taking an Epic analyst position",
    "selftext": "Edit: I just want to say, thank you all SO much for your responses. I did come in during the middle of an implementation. Knowing that it shouldn't (hopefully) stay like this makes me feel better. Having a meeting at 9, then 3 separate ones from 11-2, then another at 3 and one at 4:30 is blowing my mind tbh. This is just an example, but many of the days are like this. The consultants are amazing. They're just so busy and stressed it seems. \nI'm going to keep to it, and try to wait it out and see what post live it like! \n\n\nHi all,\n\nI’m a new addition to the Epic analyst team at my facility, and I’m already feeling overwhelmed, even though my training classes haven’t even started yet.\n\nI’ve been trying to review documentation for the project and study the material on my own, but every time I start making progress, I get pulled into meetings. It’s non-stop. Some days I’m in meetings for 5–6 hours, and most days it’s at least 4–5. And for the actual analysts, their calenders have way more than me. They're often back-to-back, which makes it nearly impossible to focus, absorb anything new, or even take a proper break. I’ve had days where it felt like I couldn’t go to the restroom or eat at a normal time because meetings ran non stop.\n\nIs this normal for epic analysts?\n\nDid I make a mistake?\n\nI left a nursing job with a decent work-life balance (40-hour weeks and better pay), but I knew I couldn’t do it forever. I chose this path because I was told it would be a less stressful, more sustainable long-term career—with better pay down the road and more flexibility, especially working from home.\n\nRight now, though, I just feel overwhelmed and stuck in nonstop meetings. I haven’t even started the real analyst work yet, and I’m already burning out. If this is what the role is actually like day to day—talking about work more than doing it—I’m seriously second-guessing my decision.\n\nI knew there would be a lot of meetings in this role, but I just feel like this goes beyond that",
    "subreddit": "healthIT",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 97,
    "downs": 0,
    "created_utc": 1749235014.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional frustration about workload and burnout in the Epic analyst role.",
    "composite_score": 3.6262750956996235
  },
  {
    "score": 99,
    "title": "anyone else feel like half of “AI in health care” right now is just really fancy copy paste?",
    "selftext": "I’m seeing all these demos where an “AI assistant” listens to the visit, generates a note, then the clinician has to spend 5–10 minutes fixing the same 3 things every time: wrong template, extra fluff for billing, and details the AI confidently hallucinated from nowhere. it’s better than a blank page, sure, but it’s not exactly the revolution the sales decks promised.\n\nfor folks who are actually live with AI scribes or copilots in production (not pilots), what’s the real time saved per visit when you factor in correction, clicks, and EHR weirdness? are we talking minutes, or is it genuinely changing your day?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 99,
    "downs": 0,
    "created_utc": 1766179652.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Analytical discussion of real-world impact of AI scribes in healthcare with questions about time saved.",
    "composite_score": 3.5007394585211276
  },
  {
    "score": 83,
    "title": "As an outsider, what complaints do you have about EPIC?",
    "selftext": "I'm in IT and Cybersecurity (currently a university student) and I'm genuinely curious what the healthcare industry's position is on EPIC. In my eyes as an outsider (and as somebody who has always been curious about working in the industry), I believe EPIC has a monopolistic hold over HIT, especially with the recent development I heard about with the FHIR specification that I'm pretty sure most other EHR's are adopting.\n\nIs what draws people to EPIC the enterprise support? The features? What does EPIC have that nobody else seems to and why does it seem like nobody's concerned but me, about EPIC's dominating position in the industry.\n\nApologies if these are stupid questions or if I'm not welcome here. I didn't see anything in the rules stating I wasn't welcome. I simply wish to learn from the people themselves.",
    "subreddit": "healthIT",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 83,
    "downs": 0,
    "created_utc": 1766632523.0,
    "media": null,
    "is_video": false,
    "num_comments": 181,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "A request for opinions about EPIC with no substantive guidance or model.",
    "composite_score": 3.654314980054419
  },
  {
    "score": 81,
    "title": "Entry Epic analyst openings",
    "selftext": "There are a lot of “how can I break into HIT”posts so I thought I would share some “entry” positions at my org (and of course posting on a throw away so I don’t get in trouble). \n\nVanderbilt University Medical Center (in Nashville TN) has a few Epic “application analyst” positions open. Requirements are a bachelor’s and 2 years relevant experience, which can be anything from being an RN to a Principal Trainer. From my experience, pay is around 70-90k. Positions are probably remote but I don’t think you can live in Cali or NY. \n\nVandy also has “liaison” positions between IT and Providers called Customer Care Specialists that are great for clinical staff who want to get into the IT world but not necessarily build the system. These are hybrid positions since you provide in person support and I don’t know the pay.",
    "subreddit": "healthIT",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 81,
    "downs": 0,
    "created_utc": 1696863702.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Multiple Epic analyst openings listed as items.",
    "composite_score": 3.3950128513331945
  },
  {
    "score": 82,
    "title": "Why is our Analyst pay so low?",
    "selftext": "Located in the Midwest, low cost of living area, outside of a major city. Working for a “billon dollar company” (sure), and making $32 an hour as an Epic Beacon analyst (3 years in) servicing 17 infusion departments and four radiation oncology departments in a 3 hr radius on a team of four. I KNOW this is below the state average for this type of job, I just wonder how on earth a hospital can get away with it. I’ve had team members leave for greener pastures for remote jobs located out of state making twice what they were at this hospital, but just worried I don’t have the experience yet to jump ship. Is this solely due to where I’m located? Or is this hospital pulling one over on us all? Where are you located and how much are you making? Is it low or high cost of living?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 82,
    "downs": 0,
    "created_utc": 1750819479.0,
    "media": null,
    "is_video": false,
    "num_comments": 104,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Emotional grievance about low pay and hospital practices.",
    "composite_score": 3.634672741911043
  },
  {
    "score": 76,
    "title": "Healthcare costs:  would we be better off without Epic?",
    "selftext": "Hear me out. The cost structure (licensing, platform, staffing, cost of integration options) of Epic seems to be way higher than a best of breed, or a competing All-in-one EMR like Cerner. \n\nCould there be a cost savings for a patient (or an insurer) if the TCO of the combined EMR were capped?\n\nI'm also wondering if patient care / engagement is measurably improved by being on Epic vs. A lower cost (by TCO) platform. \n\nWhat do y'all think? ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1735745166.0,
    "media": null,
    "is_video": false,
    "num_comments": 120,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Discusses cost structure and total cost of ownership to compare Epic vs alternatives.",
    "composite_score": 3.520383410330707
  },
  {
    "score": 72,
    "title": "Trump, DOGE &amp; Healthcare",
    "selftext": "With all the potential cutting of programs and the desire of the current administration to make health reporting opaque what is the potential that some reporting and hospital quality tracking goes away?\n\n  \nI'm thinking about surveillance of hospital acquired conditions HAC\n\nPatient Safety Indicators PSI90\n\nRespiratory illness Surveillance\n\n  \nThe list goes on. We do a good deal of internal reporting to track and report such things but what happens next? If we send in weekly respiratory surveillance reports but those reports aren't compiled and available to the public what good is capturing the data? Also, are we thinking that CMS will stop reporting hospital quality and patient safety ratings on medicare.gov? I know we sometimes feel like we are drowning in regulatory reporting; however, do patients suffer long term if no one is really minding outcomes?\n\n  \nImagine if we weren't monitored for CAUTI or Surgical Site Infections. I don't think numbers would skyrocket but would we have a greater tolerance for these mostly avoidable conditions if it didn't have any negative consequences? \n\nPatient outcomes are likely to suffer.\n\n\n\nAlso, I shudder to think what will happen to the health system I work with if Medicaid and Medicare have substantial cost cutting moves either in lower reimbursements or in the case of Medicaid with more tightly controlled requirements to access benefits. It will further drive hospital system consolidation and will cause more rapid closures of critical access hospitals.\n\nWhat a time to be in HealthIT\n\n  \n",
    "subreddit": "healthIT",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1740226460.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Political/policy concerns with emotional stance about health IT reporting and funding.",
    "composite_score": 3.442747405489084
  },
  {
    "score": 73,
    "title": "I resigned - my job is available ",
    "selftext": "Not sure if this is allowed but (remove it if not) ...\n\nI resigned from my clinical apps role. My job will be posted next week. It's 300 bed community hospital.\n\nIf your in NH or on mass Boarder, would be a good job for people who want to be in IT or looking for a new IT role. IT just isn't my cup of tea. \n\nMain apps supported in the role: Altera (formally allscripts) Sunrise Radiology, Intelerad PACS, Powerscribe, Volapa Lung &amp; Breast, Cardio Centricity Workflow/Universal Viewer, Maclab, Philips iECG. \n\nThere's a host of other ancillary apps supported. \n\n",
    "subreddit": "healthIT",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1726852788.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "A personal job resignation notice with a job posting; minimal substantive content.",
    "composite_score": 3.247246717562967
  },
  {
    "score": 75,
    "title": "Epic analyst burnout",
    "selftext": "I’ve been an Epic analyst for almost a decade and I’m getting so burnt out. Our department has been shrinking due to budget constraints, but there are more projects and tickets than ever. IT leadership has no interest in the workload and only wants fast turnaround times. I feel like it’s just a matter of time before something tragic happens due to the pace. Then there are the endless nova notes, the increasing number of care concerns, ridiculous change management processes and so on…. \n\nIs anyone else experiencing this? It’s new for me despite being with this organization for several years. Is this an industry trend or is it my organization or maybe I’m just bad at handling stress? I’m so scared to jump ship and end up in the same situation. ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 75,
    "downs": 0,
    "created_utc": 1716914760.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Personal burnout venting with emotional expressions.",
    "composite_score": 3.3308002662662
  },
  {
    "score": 74,
    "title": "Health IT burnout",
    "selftext": "As the title states I’m just feeling so burnt out. I love analyzing things and trying to figure out pieces of the puzzle but at the end of the day I don’t want to do another thing. Cook, clean, play with my dogs, hang out with my family, literally nothing. I’m exhausted. I spend all day trying to solve problems and put things together for the users and while one group is happy another becomes unhappy. The process at my org for getting new things created that users want is convoluted at best and I feel like I’m under constant pressure to meet deadlines that no one else seems to care about. I know there is provider burnout and that’s something everyone is concerned about but what about IT? Is that a thing? Or am I just a wimp lol? \n\nI want to get better but almost everyday I dream of running off and living in the jungle or something and not dealing with another living soul or their issues. I really don’t know what else I can do at this point so I just need some tips or some motivation or some hope. Anything yall have to offer this poor woman at her wits end with everything?! \n\nSorry for complaining lol. I’m grateful for a job and the consistent work. I don’t want to appear ungrateful. Just want to know I’m not alone and how to get past it or what to do. Thanks! ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1712192439.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Burnout and frustration with IT work, emotional appeal, seeking tips.",
    "composite_score": 3.4691552768948
  },
  {
    "score": 70,
    "title": "Life AFTER being an Epic Analyst- those that moved on to different roles…do you regret it?",
    "selftext": "I have been an analyst for about 6 years. Have 4 certifications. Generally speaking I do enjoy working with Epic and leading small workgroups for projects, building, providing technical solutions to end users, etc. BUT i am at a point that I am unable to move up at my current org due to budget constraints and other issues. (My org hasn’t been backfilling open analyst positions for over a year now) \n\nI had an interview which would allow me to really leverage my epic knowledge and do quality work but there is a part of me that is scared of leaving my analyst position and feeling I might be regretful. \n\nSo for those of you who were analysts and moved into other positions/roles….what has your experience been and are you happy you made\nThe switch? ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1761040374.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question about others' experiences after leaving Epic Analyst role; lacks actionable content.",
    "composite_score": 3.309440230798569
  },
  {
    "score": 69,
    "title": "Hate integrating to EPIC",
    "selftext": "I’m on the vendor side (patient monitoring) and I just detest integrating (HL7) with EPIC.\n\nFor most other EMR vendors, one or two technical resources get assigned, we get connected, start testing, go-live.\n\nOn the other hand, for EPIC projects, call after call with 20 or so non technical people for months. Lots of talking and no action. Everyone just seems to know small pieces of how the system works.\n\nRant over - good night\n\n",
    "subreddit": "healthIT",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1727758481.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Clear emotional vent about the frustrating EPIC integration process.",
    "composite_score": 3.22767302917421
  },
  {
    "score": 64,
    "title": "Any HIPAA compliance training that doesn't suck?",
    "selftext": "Hi Reddit,\n\nI'm a new practice manager and trying to find a HIPAA compliance training platform for my practice that doesn't feel like watching a driver's education video from the 90's. Somehow everything looks and feels like it was made the day HIPAA was enacted!  And the team is basically using pencil and paper for compliance tracking today, which is not working.\n\nHave any of you found something that's actually engaging, with a platform that's easy to use?  This is my first real purchasing decision as a manager of the practice and don't want to mess it up.  The whole staff may be living with this choice for years to come.  \n\n\nUpdate: I want to thank you all for the recommendations and advice.  I wound up using [TeachMeHIPAA](https://teachmehipaa.com/) which was recommended by a commenter and have found it to be exactly what I hoped for.  Affordable, modern, and low cost.  Reddit FTW!",
    "subreddit": "healthIT",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1706795579.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Discussion about HIPAA training platforms with a success update rather than a strict guide.",
    "composite_score": 3.1481378173319925
  },
  {
    "score": 63,
    "title": "At my first Epic job &amp; found out they never sponsor Epic certs",
    "selftext": "Title. They just don't. A handful of people have certs they got from jobs at other organizations, but most people don't have any certs at all. People have been working in training and analyst roles for years with no official anything from Epic.\n\nAfter my coworkers told me this, I asked my boss about it (under the guise of \"oh haha I'm new I don't know how any of this works lol\") and she said that the organization evaluates the need to send people for official Epic training on an annual basis, \"but we find that it's not really necessary most of the time.\" To hear my coworkers tell it, no one has ever had accreditation or certs offered, and the boss consistently responds no when people ask.\n\nGiven that certs seem to be the basic credential for Epic jobs -- especially analyst jobs -- this is berserk, right? Or is it? This is my first Epic job (and my first job out of clinical work) and I'm really enjoying it, but now I'm worried about my employability if I ever want to leave or I get laid off or etc. How should I navigate this situation?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1722386623.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Expresses disbelief and frustration about lack of cert sponsorship at Epic.",
    "composite_score": 3.4562289939910156
  },
  {
    "score": 64,
    "title": "Finally Scored a Dream Job",
    "selftext": "Hey guys-\n\nThank you so much for this sub and for all the support/advice I received over the last couple of months. I was able to secure an Epic pharmacist position after 3+ months of job hunting.\n\nI applied for 60+ positions all over the country. Received about 3-4 inquiries about possible relocation (which was not possible for me). It turned out that the rural hospital decided to take a chance on me and I will get trained and certified for Beacon/Ambulatory at least (fingers crossed for Willow Inpatient too since I already have proficiency status)\n\nI do have 2 years commitment that I have to make and I'm both nervous and excited about a new career opportunity. I'm hopeful that this decision can further expand my future career option.\n\nOf course, the best part of this job is I'm going to be fully remote, with no on-call/weekends, and I get paid higher than what I make right now :)\n\nFor those of you who have similar pharmacist backgrounds, good luck on your journey, and stay positive!",
    "subreddit": "healthIT",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1687550213.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal success story with no actionable steps or model.",
    "composite_score": 3.3189433523068366
  },
  {
    "score": 61,
    "title": "New epic analyst feeling very lost",
    "selftext": "I am a new Epic analyst.  Our go live is Fall of 2026. This is a new position for me. I’m fairly new to IT and newer to this sector of healthcare in general. I don’t know a lot. I feel like I’m just being thrown to the wolves. I don’t really know what I’m doing. I’m being asked to run meetings next week, but I still don’t even fully know what’s going on. I feel very uncomfortable because I’m sitting in all these meetings desperately trying to process terms and workflows. I’m still not familiar with most terms or workflows, but I’m expected to run meetings now? Honestly I’ve never run a meeting in my life. The only meetings I’ve ever been a part of professionally are team check in meetings. Never been in a decision making meeting before. My manager does not agree with me having to run meetings. He said as a new analyst this is not expected to be in my scope, and I am just expected to be listening and gathering information. However the Epic people are insisting on it. \n\nI’m very stressed. I’m still trying to go through and decipher things and figure out what they mean. It’s stressful and I feel as though I am being set up for failure. I’ve been working towards this job for a few years now, and am wondering if maybe I made a mistake. ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1752513258.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Expresses stress and confusion in a new role with emotional tone.",
    "composite_score": 3.431816234866881
  },
  {
    "score": 65,
    "title": "Sigh! It’s hard out here (mini rant)",
    "selftext": "I’m still employed, currently as a technical project coordinator in a toxic workplace. Workplace bullying has gone down, so that’s something. I’ve been job hunting and I feel like recruiters keep getting my hopes up. I made it to the final round for an application analyst role. Four rounds in (last round), they were hyping me up saying I was one of the strongest candidates they’ve seen. Gave me great feedback about my interview skills. Still chose someone else. I asked if there was anything I could improve. Crickets. Two other jobs I passed recruiter rounds, hiring managers just weren’t interested, so did not get to interview. Another place straight up ghosted me. I’ve redone my resume, reached out to people, tried everything. Just tired. Still trying but yeah, mini rant. Any encouragement would help. Or maybe this feels like a safe space where I can just rant! ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1748652696.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Explicit mini rant about failed interviews and job-hunt frustrations.",
    "composite_score": 3.1975589333738594
  },
  {
    "score": 63,
    "title": "I went to a job fair and one of the recruiters told me that they didn’t know about Epic Sponsorship. ",
    "selftext": "Yesterday I attended a job fair. \n\nA lot of local hospitals that use Epic had been in attendance. I had my resume, cover letters for specific hospitals and roles, and the best possible outlook I could have. \n\nIf you have seen some of my previous posts you will see that I have been applying for various roles to try and transition from an HIM role to an HIT/ Epic analyst role. I spoke to five different hospitals with various different recruiters. I gave them each a copy of my resume and my pitch about who I am, what I have done, and what I am presently working on. It was so validating to hear every single recruiter and manager tell me that I’m qualified for the roles that I’m applying for. To tell me that the only thing I’m “missing” is an Epic certification. Something that’s not really in my control. Unfortunately I have not been able to work at a hospital that uses Epic but I have used other EMR’s. \n\nAnyway, I asked one of the recruiters if her hospital would be willing to sponsor individuals to obtain an Epic certification. For the past year and a half I have seen the same Epic positions get reposted over and over. Roles that sound entry level all the way up to senior level. The recruiter looked at me like I was crazy and told me that the hospital would reimburse the cost of obtaining the certification but obtaining the certification would have to come out of pocket for the possible employee. I told her that unfortunately, Epic does not allow you to just obtain a certification from them. That individuals would need to be sponsored by a hospital that uses Epic or be in an Epic role before being able to train to obtain the certification. \n\nThe recruiter asked me if I was serious. She then told me that her and her director had been trying to fill these roles for months and couldn’t understand why they weren’t finding people to fill these positions. She told me that she would have to let her director know the situation because she’s never heard of Epic sponsorship. She then told me that they see applications from very qualified individuals like myself and that they skim over the resume for anything that says Epic. If they don’t see it then they toss the whole resume out. The recruiter was kind enough to tell me that with her looking at my resume I had everything that they wanted in a candidate but she would toss my application out because I don’t have any Epic experience or any Epic certifications on my resume. \n\nIt is totally possible that the recruiter was just lying to my face about Epic sponsorship but I do believe she was telling the truth. Or those roles are just ghost jobs. Regardless, it did make me feel better to hear from various hiring managers and recruiters that there was nothing really in my control that I could do beyond not having Epic certs for a lot of the roles I am interested in. I feel a lot better about myself. \n\nI have gotten a few interviews from different hospitals that said that they are willing to sponsor, I just think I might appear as a higher risk compared to someone who already is certified. I have been interviewed but no offers yet. \nI’m trying to stay positive. I hope everyone else is too. \n\n",
    "subreddit": "healthIT",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1723236801.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Anecdotal experience about sponsorship; not a how-to or list.",
    "composite_score": 3.305713996159025
  },
  {
    "score": 63,
    "title": "Mass General Brigham Voluntary Employee Separation and Layoffs",
    "selftext": "Mass General Brigham, known as Partners Healthcare prior to a $100 million rebranding started at the height of the pandemic, has initiated a voluntary employee separation program with the aim of reducing its digital workforce by 15% (approximately 305 positions out of a total of 2000). Employees are given a two-week window to decide. Chief Information and Digital Officer Jane Moran cautioned that even if the voluntary employee separation target is achieved, a restructuring will still occur and there may still be layoffs.\n\nThis announcement follows Morans establishment of several new director and vice president positions, which were filled by her former colleagues from non-healthcare companies Unilever and Thomson Reuters. Among the 12 current digital health leaders at Mass General Brigham to whom potentially laid-off employees report, 5 have a connection to these companies and were hired after Morans placement as CIDO.\n\nAre there any other healthcare systems facing similar situations where hospitals are adopting business-focused approaches and leadership?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1699490734.0,
    "media": null,
    "is_video": false,
    "num_comments": 114,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "News-style post about layoffs prompting discussion; informational in nature.",
    "composite_score": 3.556528894160693
  },
  {
    "score": 60,
    "title": "Exit Opportunities for Epic Analysts?",
    "selftext": "Has anyone successfully transitioned from being an Epic analyst to something adjacent or unrelated? \n\n\n\nI’ve been doing this for over a decade and am curious about opportunities outside of the Epic space. However, I'm not exactly sure what roles we're qualified for. While I really enjoy doing the build, I’m not a fan of the \"business analyst\" tasks we're typically saddled with like operational relationship management, running workgroups, and project management. Also support is support, I may be a touch burnt out.\n\n\n\nFor background, I've got a handful of different certs and app team experience, been a consultant and FTE, no desire for management. I'm very thankful for my job and the experience I have, just curious about those who found life after Epic, TIA!",
    "subreddit": "healthIT",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1740585880.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Inquiry about career paths after Epic with no structured guidance.",
    "composite_score": 3.2439088506818767
  },
  {
    "score": 60,
    "title": "Why do jobs have “If not Epic certified, must obtain certification within 90 days of hire” Then auto reject when answering that you don’t have an Epic certification? ",
    "selftext": "I’ll admit, I’m feeling a bit bummed out (once again) about finding an EHR analyst role. I just applied for a job after checking to ensure I met all the qualifications. I pressed submit on my application and instantly received and auto rejection followed my an automated rejection email. The automated rejection email stated: \n\n“We regret to inform you that you were not selected to move forward in the recruitment process for this position due to the answers provided to one or more prescreen questions during the application process.” \n\nI know it’s because I answered honestly that I don’t have any Epic certifications. There was only one prescreen question, asking if I was Epic certified. However, the job description does say (copied exactly): \n\n“Certification Required: Must obtain Epic Certification issued by Epic within 180 days of date of entry into job.” \n\nSo what’s the deal? There have been multiple job postings in my area with similar job descriptions reposted month after month. Each time I am rejected despite updating my resume and having all other qualifications. I even called one organization and I was told that it was because I didn’t have Epic experience or an Epic certification but the job description doesn’t list it as a requirement. If it was a requirement I wouldn’t apply. A lot of these jobs have been reposted multiple times or on the company website for months. A lot of the jobs are also entry or intermediate level. \n\nIs it really that hard to train someone on Epic? It seems like the jobs here want someone extremely experienced but there aren’t enough of those individuals to fill those roles. So why not train or give someone an opportunity? Should I just give up? ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1719935286.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Frustration with auto-rejections due to Epic certification requirements.",
    "composite_score": 3.2140288339602447
  },
  {
    "score": 59,
    "title": "Rant on Epic",
    "selftext": "Joined my organization's implementation team a couple of months ago, flew into Verona (great campus/food), and am currently in the process of studying/obtaining certifications. Doing the typical BID track (Cogito, Clarity, Caboodle, and one of the data models). I came into this with previous experience in software development, business intelligence/data warehousing, and data engineering.\n\nAs I get deeper into this, I'm getting an odd sense that Epic as a company and its employees tend to be full of sh\\*t sometimes. Don't get me wrong, there are some smart people that I met, and I commend them for having the best product in the EHR market, but I can't help but feel that my BS radar is going off more than usual when interacting with them. It's like talking to a politician and absorbing their rhetoric.\n\n**Training**\n\n* The training in itself felt cultish and like some form of indoctrination. Anything that deviates from the \"Epic way\" is basically taboo. I get that they are trying to avoid custom solutions (I'm in the same boat), but there's really no discussion about it on their end. If you ask a trainer about something that deviates from the material, they basically **dodge the question**. If you bring something up about a potential flaw or gap that their software/tools/features don't address, they **dance around the question** and will ultimately not admit that there is a problem...even if there is.\n* For example, the training material is not as polished as it should be. Riddled with typos, traces of outdated information, poorly worded questions, training environments not having proper data to even check your work, etc. I brought this up to them and was basically gaslighted into thinking that the material is perfect and had no flaws.\n\n**AC / AM / TS**\n\n* I suppose it depends on who you get, but we got some very fresh college grads. Technically great on paper, but not a lot of experience to back it up or to inspire confidence sometimes. A lot of just reading straight off PowerPoint decks and when asked business critical questions, they tend to **dodge the question** and say they will circle back to you or save those questions for another discussion. You would figure that these people are experts, but they are actually learning as they go too. Not to diss them (not their fault, I put that on management), but you would think that Epic would provide at least one seasoned person to guide.\n\n**Tech Stack**\n\n* Cache and MUMPS still as the foundation? I've heard they've been trying to migrate off of it since at least 2011. The majority of the analytics backend is basically just SQL Server and SSIS packages behind the scenes? Is this really the best a company can do in the EHR space? All this money to buy expensive art on campus should be pumped into R&amp;D and modernizing their tech stack.\n\nI suppose this is what you can get away with when you have the biggest market share in the EHR space. But man, I don't really think that's something to be proud of. Epic has a good product, but part of that is given because the competition isn't so good in comparison. Hoping it gets better.",
    "subreddit": "healthIT",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1680565738.0,
    "media": null,
    "is_video": false,
    "num_comments": 70,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Strong emotional vent about Epic training and culture.",
    "composite_score": 3.288780424743181
  },
  {
    "score": 56,
    "title": "Job security for Epic Analysts",
    "selftext": "Hey all. \n\nI’ve been an HB analyst for just under a year now. Really like the hospital I work for, I enjoy the flexibility, really like my colleagues, I feel very fortunate to have gotten into this field of work. \n\nI am however curious about long term job security. From what I can tell, healthcare is very stable, and for hospital that utilize Epic, Epic staff seems essential but I was curious for those who have been around for more than a few years what job security been like.\n\nFrom others I’ve talked to, it seems to be one of the most stable environments but I do wonder if legislation around healthcare or general economic uncertainties have impact on our roles. \n\nThanks in advance. ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1752162029.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question about long-term job security without substantive analysis.",
    "composite_score": 3.345512790472886
  },
  {
    "score": 55,
    "title": "White House, Tech Leaders Commit to Create Patient-Centric Healthcare Ecosystem",
    "selftext": "Any reactions or thoughts on the whole CMS “Make Health Tech Great Again” event?\n\n\nHow do you think this will differ from previous or existing interop initiatives?\n\n\nHow can they effectively address consumer (patient) adoption here?\n\n\nWill we, our at least our health systems/networks, ultimately see downstream benefit?\n\n\nI hold reservations and can’t shake the feeling this will be just a transfer of care funding to tech companies impacting health systems. Curious to hear everyone else’s opinions. Some heavy hitters at this event but with these get-togethers its important to consider which entities and entrepreneurs are mission-driven and which of those are just trying to make some dough. Hoping for the best but only time will truly tell!",
    "subreddit": "healthIT",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1753914644.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Offers analysis of a CMS event and asks for opinions; adds reasoning about adoption and outcomes.",
    "composite_score": 3.243079825314606
  },
  {
    "score": 55,
    "title": "Epic Accredited VS. Certified",
    "selftext": "FYI, seen some posts about this but they were all old. Letting people know there were changes this January. To be considered Certified now you need to attend the entire training track on campus if you're in the US or at least one class if you are global otherwise you are considered Accredited. It no longer appears to flip if you take a different training track in person.\nDon't want anyone to get caught off guard. I have a new class to take and found out today. ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1736980233.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Informational policy update about certification requirements; no argument or steps.",
    "composite_score": 3.342402023787669
  },
  {
    "score": 55,
    "title": "I'm finally transitioning into Healthcare IT!",
    "selftext": "My background is in the laboratory as a CLS/MT and I've been seriously trying to make the transition into an analyst role for about a year and a half. I had put in applications for analyst roles as far as 2 years back but I was never even chosen for an interview. After I found out about the self-proficiency route, I studied and earned a number of certifications. I initially expected the red carpet to be rolled out for me, as someone with a clinical background AND that put in the work for self-proficiency certifications, but sadly that didn't happen. I found out that a lot of orgs wanted seasoned analysts with build experience. \n\nI must have filled out 200 job applications. I interviewed at least 8 times. Some of those were a waste of time (i.e. a recruiter passing my info along for a job that required build experience when I didn't have it). My last interview went okay. TBH, I didn't think I'd get an offer because some of the questions were technical or someone would ask if I had specific experience (Slicer Dicer) which I just didn't. I got a call back and an offer over my asking! I am stoked I finally found a company willing to give me a shot and it's an opportunity I won't waste.\n\nI hope to make a future post with things I did that I think helped my case, and things to avoid. But if you're in a similar boat, don't give up and keep putting in those applications. Getting told no over and over again is tough, but when it finally pays off, it's a great feeling. ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1714839714.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Personal transition story with lessons learned for others pursuing healthcare IT roles.",
    "composite_score": 3.191369909085694
  },
  {
    "score": 53,
    "title": "Go Live Mess",
    "selftext": "The organization I’m at went live today on Epic. It felt like chaos occurred everywhere. I supported an app by myself today with no on site support. It felt lonely, miserable and humiliating. This is a tertiary app i got a cert in and little clue about the build as an analyst. The main person was pulled into another team. Any words of encouragement anyone? Please help. I’ve sacrificed sleep, anxiety and shed tears for many months and it shouldn’t feel this way….idk what to do. Upper management should have staffed appropriately. I am furious. ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1709349446.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Emotional distress about a go-live situation and staffing, seeking support.",
    "composite_score": 3.240426063336218
  },
  {
    "score": 52,
    "title": "HIMSS just released the latest version of their jobs catalog \"Health Information and Technology Job Descriptions\"",
    "selftext": "Go to [https://www.himss.org/resources/health-information-and-technology-job-descriptions/](https://www.himss.org/resources/health-information-and-technology-job-descriptions/), and download:\n\n* [Health Information and Technology Job Descriptions](https://cdn.sanity.io/files/sqo8bpt9/production/9c432103097f8ad5c414d948abfa2262434229b1.pdf)\n\nThe latest version of their impressive resource released on Tuesday, October 21 is 230 pages focused exclusively on helping healthcare professionals - or future industry careerists who will look to begin their professional life soon or pivot into healthcare at some point - explore a range of positions in Health IT.\n\nIt includes job descriptions &amp; qualifications for over 100 different positions spanning all four stages of a career progression (Entry, Mid, Advanced, and Expert). While a bit anecdotal in a few places, I do think it is great tool providing a lot of benefit overall to the community and especially job seekers entering or pivoting into the tech sector of the industry.\n\nSince a measurable portion of this sub's conversations seem to be about...  \n\\- how to get  \n\\- breaking into  \n\\- feeling stuck with  \n\\- or general expectations doing  \n...one of the positions this resource calls out, I felt compelled to post about it.\n\nCertainly I, or one of this community's members, have held 3-5 jobs mentioned. So if anyone had any clarifying questions about a statement, qualification, etc. made in the document, I am sure someone here has personal experience with that thing.\n\nP.S. Their career mapping tool - while more limited in its scope than the document - is fun to use and I'm sure would be eye opening to recent grads, nurses, or mid-level professionals considering starting a health tech career. [https://www.himss.org/careers/career-pathways](https://www.himss.org/careers/career-pathways)",
    "subreddit": "healthIT",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1761229098.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Resource-sharing post about HIMSS job descriptions without analysis.",
    "composite_score": 3.024839887439908
  },
  {
    "score": 53,
    "title": "SERIOUS security flaw in “HIPAA compliant chatbot”",
    "selftext": "I’m a former corporate systems engineer, a data and technical efficiency manager. I’ve reached out to the company involved.\n\nA healthcare group near me just installed an AI chatbot, which claims to be HIPAA compliant. It gives out personal information without verifying identity, in response to prompt: “who am I?” It does this based on my phone number, which gives it access to certain information. It does this in text or voice. \n\nPhone numbers are easily spoofed, and frequently are, en mass, by scammers or otherwise.\n\nA bot with an auto dialer and number spoofer can therefore try large amounts of local phone numbers and, for all clients of this healthcare system, learn the name, and potentially more, associated with the phone number. This will also indicate who is and isn’t a client of said healthcare system. \n\nText messages can be automatically sent in large quantity, testing many numbers at once. They only need to ask the bot, “who am I?, give your best guess” or similar.\n\nThis is a very subtly dangerous vulnerability, and is not compliant. Hallucinations are a mathematical guarantee with current AI, and a walled garden based on phone number calling is demonstrably NOT secure.\n\nhttps://arxiv.org/pdf/2401.11817\n",
    "subreddit": "healthIT",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1736477957.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Identifies a security vulnerability and explains implications.",
    "composite_score": 3.0200300123746215
  },
  {
    "score": 50,
    "title": "Future job stability of Epic Analysts with the wide spread of AI",
    "selftext": "I'm curious on other opinions on the outlook for the Epic Analyst role now that AI is becoming more developed.\n\nI'm not an Epic analyst myself, but I've been trying to get into the role for a little while now. No luck as of yet.\n\nThough I was thinking about it the other day. Would this role even be secure in 5+ years with technology advancements. \nCurrently I'm an RN, so I have no concerns for job stability, but I think I'm making myself a little worried about the possibility of leaving my current role for one that could be eliminated.\n\nI feel I can't give an actual opinion without knowing how the role truly works. \n\nThoughts ?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1739829137.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Opinion-seeking post about AI impact on Epic Analyst job stability.",
    "composite_score": 3.1941764329856084
  },
  {
    "score": 49,
    "title": "Epic Analyst Job Offer",
    "selftext": "I was just offered a job as an Associate Epic Analyst and the starting pay is $29.50/hr and after I become Epic certified it will increase to $31.40/hr. I’ve been an RN for 9 years with a wide variety of experience at this hospital and currently make $40/hr. Also, this is a very low wage considering the lengthy interview process of 2 interviews and the Sphinx test. \n\nThe kicker is I have a friend who is also an RN who became an analyst about 3 years ago now with less nursing experience than me who started the same position at $32/hr. The HR person on the phone told me that the wage is non-negotiable and based on experience, but it’s just not adding up. \n\nI’m going to sleep on it before I give them an answer, but I’m thinking of telling them I can’t do less than $34/hr. \n",
    "subreddit": "healthIT",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1721766239.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal report on a job offer and salary discussion; not instructional.",
    "composite_score": 3.35471536692226
  },
  {
    "score": 49,
    "title": "The future of Cerner",
    "selftext": "I've been working on Cerner projects for 7 years, the last 5 as a contractor. After seeing so many projects switch to Epic i have been contemplating pivoting to something else. I was considering getting the PMP cert to allow me to manage both Epic amd Cerner projects. I also thought about getting a full time position with a hospital that has Epic to obtain a Cert, stay the necessary time and leave to consult again with Epic clients but that could take up to 2 years while making less money. Any suggestions? Is anyone else concerned about the future of Cerner? Also what do you guys consider a natural progression after being an analyst/consultant?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1703486682.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Career-advisory post with questions but no list or explicit model.",
    "composite_score": 3.1821212547196627
  },
  {
    "score": 48,
    "title": "One year in as an Epic analyst and I’m at my wit’s end (advice needed)",
    "selftext": "Hi all, \n\nThis may be a bit lengthy, so I apologize for that. I’ll try to make it quick. I started this position a year ago and moved to another state for it because I was so desperate for a job after graduating college. The organization I work for set me up and got me Epic certified. It’s been a little over a year now since I passed my certification exam. Truly, this opportunity changed my life and I will be forever grateful to them; however something is bothering me very much and I don’t know what to do. \n\nThe team I joined had just one other person in it and I was brand new. Literally had never done anything remotely close to this job in my life. The other team member is a very nice woman who is overworked, to put it lightly. Understandably, she tried and still tries her best to help me when I have questions, but from the day that I got certified, I feel like the training has been seriously lacking. I feel like there’s things I should know by now that I was completely unaware of until we get an email about something. I feel lost a lot of the time. I would say, though, that I know much, much more now than I did last year but yet it feels like I’m falling behind. \n\nHas anyone else ever been in a situation like this? What should I do? Just ride it out and try to just pick things up on the fly? I feel like a squeaky wheel a lot of the time. If you are in a leadership role, I would also like to hear from you. \n\nI’m truly not trying to complain. This opportunity really changed my life. I just don’t want to feel useless in my role. \n\nThank you for reading.",
    "subreddit": "healthIT",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1683246791.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional frustration about training and feeling behind; seeks advice but primarily venting.",
    "composite_score": 3.2133166987163073
  },
  {
    "score": 46,
    "title": "Patient question: how secure is the new Epic module that uses AI to record patient visits and generate dictation?",
    "selftext": "Hi, I’m far from a Luddite, but I’m also concerned about the security of my personal data. Within the past few months all of my providers have been asking me to consent to allowing them to use this new Epic module that helps them create their visit notes. \n\nNone of them have been able to tell me anything else about how this works, except that it goes in the “Epic cloud”. I’ve got a fair amount of IT-adjacent experience, and I’m not really sure that’s a thing. Also, “the cloud” just means someone else’s computer. \n\nIf I’m in the wrong place, please feel free to redirect me. Thanks for your time. ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1756329720.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Security/privacy question about Epic module; informational but not a how-to or list.",
    "composite_score": 3.1863320857255104
  },
  {
    "score": 48,
    "title": "Epic Analyst Entry Level Pay",
    "selftext": "Hi all, \n\nI recently got an offer for an entry level Epic analyst (Beaker) for a county hospital for \\~$82k/year in Southern CA. They said it involves full time in-person training and then hybrid once I'm more comfortable. I don't have much IT or Epic experience (except some end user experience, which was not that extensive and I actually don't even have Beaker experience). This is definitely a pay cut coming from my clinical lab background as CLS in CA pays decently well. I also know it's not easy to come across an opportunity to get my foot in the door for healthIT. I don't expect pay to be on the same level as my clinical job but it is a considerable decrease so I'm just trying to get others' perspectives. \n\nIs that a decent/ok offer?  Has anyone taken a decent pay cut to get into healthIT and it works out well/better in the long run?  I guess I'm just looking for any feed back regarding this.\n\nTIA ",
    "subreddit": "healthIT",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1748617422.0,
    "media": null,
    "is_video": false,
    "num_comments": 70,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Career/compensation question seeking perspectives; no structured steps.",
    "composite_score": 3.320825254388051
  },
  {
    "score": 46,
    "title": "Epic analysts - need input on our implementation",
    "selftext": "We're currently going through a foundation implementation of Epic, and it's honestly a complete mess. Not at all what I expected from the Epic team of AC/AM's. As a Bridges analyst I'm forced into daily calls to give updates about interfaces that we cannot build because other teams either haven't had any calls set up with the vendor, or the contract is still in process. \n\nOur Orion tasks and building blocks are a hodge-podge of random things to track down that other teams are responsible for, or that workgroups should be deciding but aren't.  \n\nFrustrated isn't even the right word. At this point it's just annoying. Does Epic just talk a good game or is this out of the ordinary? It seems like nobody at Epic is talking to one another and all they are concerned with is checking off boxes to meet deadlines and hammering our staff but providing next to zero help.",
    "subreddit": "healthIT",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1741399580.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Frustration with messy implementation and lack of help; critical tone.",
    "composite_score": 3.200976773776505
  },
  {
    "score": 48,
    "title": "Health Tech Jobs for Clinicians",
    "selftext": "Hey there! I'm a frequent lurker on this sub and have posted a few times about being a pharmacist in tech. For the last year, I've been creating resources to help more clinicians break into tech, and spreading the word.\n\nI'm really excited to announce that I'm in the process of getting some dedicated employers on board who are eager to hire mid-level clinicians to join their tech companies. Meaning, they are recognizing how valuable we are, and want to interview you, specifically! They'll be ready to start interviewing within the next few weeks.\n\nMy current mission is to make it as easy as possible to connect clinicians/providers to these employers. Joining the network + resume reviews are free for job seekers. You won't have to spend a dime to be specially considered for these roles.\n\nIf you're interested in joining the network of mid-level clinicians getting interviewed for health tech jobs (most of them remote), submit your resume one of two ways:\n\n1. a quick application to: medtototechpivot.com/job-seekers\n2. send as an attachment to: contact@medtotechpivot.com\n\nAnd if you have any questions or just want to chat, feel free to reach out to me. I'm here to support y'all every step of the way. 💞\n\n&amp;#x200B;\n\nEDIT: Top tip! Do not submit a CV-type document! Please submit a resume, no more than 2 pages and be sure to includes a \"skills\" section that incudes soft and technical/hard skills! If you're unsure, send me a DM, and we can go through a resume review together before you submit :)",
    "subreddit": "healthIT",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1682782238.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Announcement/post to recruit; informational/promotional rather than guidance.",
    "composite_score": 3.2340749958693005
  },
  {
    "score": 47,
    "title": "Fed up with trying to automate our old dental software. Nothing works properly",
    "selftext": "I work in a clinic and we're stuck with this ancient EHR system from the 90s. Every day, entering patient data is a grind. I tried scripting it with some basic tools, but popups and weird UI changes break everything. Spend hours fixing, and it still messes up half the time.  \n  \nTried no-code stuff too, but it doesn't handle the legacy crap well. On prem Windows machines, no APIs, just clunky clicks. It's killing our efficiency, and management's breathing down our necks for ROI. Wish there was a way to just describe the task and have it run reliably, learn from glitches, and not cost a fortune. Anyone else fighting this battle in healthcare or similar? How do you even cope?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1760936962.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.66,
    "category_rationale": "Frustration with old software and desire for automation; venting.",
    "composite_score": 3.0042868669034277
  },
  {
    "score": 45,
    "title": "New Epic Analyst and Anxious",
    "selftext": "Hello everyone!\n\nI’ve been a Epic analyst for about 7-8 months now and honestly feel really anxious. Though I am learning a lot every week, I find that for the past months I have not done much. There are days where I work 5-6 hours and lots of days where I work 1-2. My manager has told me that I have met their expectations for the months that I have been working but still feel that I am doing too little and someone will eventually notice. I am the only one that works in my module so I am very much on an island at times. I have definitely helped with others as well\n\nThis anxiety was heightened when I found out one other Analyst was recently let go (a way higher tenure)\n\nDid anyone else experience this?",
    "subreddit": "healthIT",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1754318671.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Personal anxiety and uncertainty about performance; emotional focus.",
    "composite_score": 3.155790135194824
  }
]