[
  {
    "score": 378,
    "title": "I invented a timelapse camera for houseplants and brought it to market",
    "selftext": "This is my biggest project so far. Today is September 15, 2025, and I first started tinkering with the idea back in November 2024. I got serious about it around February 2025.\n\nI’m incredibly proud of what I’ve built. It’s a complex piece of work, and it took countless late nights. I had to bring together so many different technologies and skills I’ve taught myself over the years. I’m 28 now, and when I was 18, I made the decision that I didn’t want to wake up at 30 full of regret. *The pain of discipline or the pain of regret.* Consume less, produce more.\n\nThe idea came after I started my first job as a software engineer and moved into my first apartment with big, bright windows. For the first time, I could actually have houseplants, something I’d wanted for years. Around the same time, I picked up two new hobbies: 3D printing and electronics. Those, combined with my software background, made this project possible.\n\nI made everything myself except the electronic module (ESP32-CAM, which I buy). Everything else, I built from scratch in just a few months:\n\n* Designed and 3D printed the case\n* Built the app\n* Set up the backend server with user management, authentication, image processing, video generation, AI models for enhancement &amp; interpolation, order management, password resets, device management\n* Programmed the ESP32 logic\n* Built the shop website (no Shopify)\n* Created and managed social media accounts to find customers\n\nMy product has been live for about 4 months now, and I’ve made double-digit sales. Not a lot yet, but I’m confident I can grow this with better marketing. I’m more of a maker than a marketer, so this part is challenging for me. You can check out my videos on Instagram @ [**plantcam.io**](http://plantcam.io)\n\nStarting today, I’m committing to posting one video every single day. The product is stable and delivers great results my main issue is that I’ll run out of money soon if sales don’t pick up. But honestly, I’m happy and proud of what I’ve built.\n\nI’d love to hear feedback. Please keep it constructive. I’ve had plenty of positive reactions, but there are always a few people who just throw negativity around. Otherwise, I’m happy to answer questions.",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 378,
    "downs": 0,
    "created_utc": 1757969955.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/li2hes307epf1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1920,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/li2hes307epf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/li2hes307epf1/DASHPlaylist.mpd?a=1770353725%2CYTQyMTg1NWEyNzdmZDE5MWVmZDVmNTQ4ZGQzOTIxMjZlNWYwNTlmNDY0NjhjMzhjYWJkODY0ZmRmMDUxNWJmMA%3D%3D&amp;v=1&amp;f=sd",
        "duration": 38,
        "hls_url": "https://v.redd.it/li2hes307epf1/HLSPlaylist.m3u8?a=1770353725%2CM2FjZTlkNmFiMjY3MGY0MzgzOTMwMGVlNTkzNGI0ODM5ZTA3OGU5NjhmNDdmZDExNGI4ZGJkNzkxMzY0ZmI2Ng%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Bullet list of built items suggests a curated list of project components.",
    "composite_score": 4.158737249982329
  },
  {
    "score": 344,
    "title": "I developed a dual-screen, ESP32-powered ereader",
    "selftext": "Some time ago, my old Kobo ereader broke, which led me to look for a new one. I’ve become increasingly interested in open and repairable hardware, such as the Framework laptop and Fairphone, but have been disappointed by the lack of an ereader equivalent. Additionally, I wasn't satisfied with the design of most ereaders: they typically have a single screen and require some form of case to protect them from damage (Something I didn't have for my Kobo, which explains why it broke ;) ).\n\nI just finished my engineering studies last summer, so I decided to take the leap and see if I could create something that solves these two problems. And now, after a few months of development, I’m excited to announce that the Diptyx E-reader is entering its pre-campaign stage on Crowd Supply!\n\nTo summarize the product: The Diptyx ereader is a dual-screen ereader that runs on an ESP32 and will be made open-source when the crowdfunding campaign has finished. It runs custom software capable of displaying EPUB files and uses two e-ink screens for a book-like reading experience. Through the built-in UI, you can scroll through chapters, add bookmarks, change the font type and size, and much more.\n\nWhen traveling, you can simply fold it closed, protecting the screens and making the device highly portable. But most importantly, the Diptyx uses no DRM and requires no accounts or cloud services, meaning you fully own the device and everything on it!\n\nI designed the hardware all myself, including the electronics and plastic case. The drawings on the outer panels are old ex-libris artworks (a sort of ownership-stamp in books). The software is partially based on prior open-source work, but mostly custom.\n\nFor future versions, I'm excited to try different types of artworks on the pcbs (using different silkscreen colors, plating types, etc), and to try different color schemes overall\n\nI'd love to hear your feedback or questions, and if you're interested you can read more about it on the crowdsupply page: [https://www.crowdsupply.com/diptyx/diptyx-e-reader](https://www.crowdsupply.com/diptyx/diptyx-e-reader)",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 344,
    "downs": 0,
    "created_utc": 1761244433.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Primarily explains design goals and features of the product rather than a list of items.",
    "composite_score": 3.9878057690586832
  },
  {
    "score": 123,
    "title": "$120M Down the Drain Because Nobody Checked if People Actually Wanted the Product",
    "selftext": "Just a PSA for anyone thinking about launching a physical product:  \n  \nDo not blow a bunch of money ordering 500 units right away.  \nProduction is stupid expensive, and nothing hurts more than seeing boxes of your “great idea” collecting dust in your apartment.  \n  \nA way better move is to get like 10–20 units made first. Make some content, show it around, try to sell a few, and see if the market even cares. If people are actually interested, then scale. If not, congrats, you just saved yourself a ton of cash.  \n  \nLook at Juicero. They raised $120 million to build a Wi-Fi juice press, hyped it up, manufactured a bunch, and then everyone realized you could just squeeze the juice packs by hand. The whole company imploded. Only lasted 16 months  \n  \nSo yeah, validate first. Produce later.  \n  \n",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1765217220.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Offers a cautionary lesson about market validation and spending; blends advice with a PSA.",
    "composite_score": 3.7071761415153537
  },
  {
    "score": 101,
    "title": "Hardware development is dying in the US",
    "selftext": "I have been thinking about what the future may look like for hardware startups/companies in the US.   \n  \nThe recent trend seems to be that more and more fully Chinese companies are popping up (Bambu Labs, xTool, NEEWER, DJI etc.) and less and less US based (even with Chinese CMs) are left behind. The laws dont seem to care for any US based IP being violated for most of the categories. And as such, I can only imagine this trend continuing except for maybe chip design (AI hardware) and very established players. \n\nSo I am inclined to think that with less and less demand for hardware development, hardware jobs for electrical engineers in the US would just continue to decline (other than chip design).\n\n  \nWhat are your thoughts on this? Am I correct to think this or am I missing something? Should I just pivot to more software side of things to make sure I stay relevant for the next 20 years? ",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 101,
    "downs": 0,
    "created_utc": 1767069940.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Opinion piece about industry trends; asks for others' thoughts; analytical but not actionable.",
    "composite_score": 3.6422664199775516
  },
  {
    "score": 90,
    "title": "Built a 3d sensor platform - launching tomorrow",
    "selftext": "A pi 5-powered 3d vision platform finally about to launch it tomorrow\n\nthe module has:\n\n* Raspberry Pi 5\n* rgb cam + LiDAR+ ToF depth\n* motorized pan/tilt\n* real-time object tracking\n* Python API or ROS 2\n\nGoal: make it drop in robots / labs component, not just \"hers a script\".\n\n[TEMAS: A Pan-Tilt System for Spatial Vision by rubu — Kickstarter](https://www.kickstarter.com/projects/temas/temas-powerful-modular-sensor-kit-for-robotics-and-labs?ref=discovery&amp;term=rubu&amp;total_hits=47&amp;category_id=338&amp;tab=prelaunch-story)\n\nGoing Live on Kickstarter tomorrow with a Super Early Bird. We'd honestly love to see some of you there as early supporters.\n\nHappy to answer questions in comments.",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 90,
    "downs": 0,
    "created_utc": 1761753567.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Bullet list of module features and launch details present a set of items.",
    "composite_score": 3.3801204079922034
  },
  {
    "score": 86,
    "title": "Excited to share my smart scale project!",
    "selftext": "I’ve been working in a vacuum here. No one I know understands PCB’s. It’s just a ‘frisbee’ to them. But I finally joined reddit and then saw there was this group. I’m nervous about posting this because I don’t want to just come across as promoty.. But I have no one else to share this with really. This definitely isn’t my first PCB but it’s my most complicated. As I’m self taught mixed signal pcb design has been a journey for me but I think I’ve gotten noise levels pretty good.\nThis PCB is for a bluetooth kitchen, coffee, mixology, baking scale I’ve designed. I’ve done the hardware and app myself. \nI went with a 4 load cell design to keep things super thin while also maintaining a large weight capacity. Current competition in the coffee scale space charging ALOT of $$ for their scales use an HX711 so it wasn’t hard to make a more precise scale. Just.. don’t use a 9cent ADC..\nThere’s a ring of 64 leds around the perimeter. They project downwards and turn your countertop into a progress display. \nAt the top is mostly power management, right side is cpu and a small piezo, left side is touch control and components for the SH1107 oled screen on the back side.\nI’ve had issues with the SH1107 flickering on camera so I don't like it. I find the SSD oleds are better but I needed the long skinny form factor to fit as close as possible and the long skinny SSD1309 etc are only 32px tall.\nThe cpu is an ESP32 just for TESTING. It’s already been replaced with a nordic chip in the new revision. Clearly the esp32 is terrible for battery but for developing the app it’s been easier for various reasons including enabling a BT classic mode so I can develop easier on my PC rather than reinstalling each little change on my phone.\nI’ve been designing and printing all the plastic parts in the basement as well on some mid range resin printers.",
    "subreddit": "hwstartups",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 86,
    "downs": 0,
    "created_utc": 1730042322.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Details and features presented as bullet points; primarily a project update with enumerated items.",
    "composite_score": 3.413098268289728
  },
  {
    "score": 79,
    "title": "Been working on a modular robotics system. Need advice.",
    "selftext": "For the last few years I’ve been working on this modular robotics system with the goal of creating something that can completely self assemble and reconfigure. \n\nThe prototype in the video is inspired by a paper I found called “Kubits: Solid-State Self-Reconfiguration With Programmable Magnets”. The same concept was later worked on in another paper I found called “Electrovoxels”. I thought the solid state robot design had the most potential for a modular system so I decided that I wanted to continue to improve on it.\n\nThe Electrovoxels design stated it was a 60mm side length cube while my prototype had a side length of roughly 45mm. I’ve recently began working on a V2 which has a side length of just 21mm although if I wasn’t limited by the tools available to me I could make it much smaller. At the same time I’ve been developing a communication protocol as well as the infrastructure to make this system expandable. \n\nThe advice I’m looking for is what do I do next. Should I open source it? How can I push for further development? Could I pitch this to a company ?\n\nI know absolutely nothing about any of these things so any advice would be greatly appreciated.\n\n",
    "subreddit": "hwstartups",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1752659549.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/k1khrgndk7df1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1920,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/k1khrgndk7df1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/k1khrgndk7df1/DASHPlaylist.mpd?a=1770353725%2CZWQ5ZDIzYTgzMDIzMWE4YjZlNDQ0MDZiYmZjMmZiNDM0ZDVjMmE4MzBjYWM4MDc5ZjZiNDQ1NGYxMzI3YmQwYw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 6,
        "hls_url": "https://v.redd.it/k1khrgndk7df1/HLSPlaylist.m3u8?a=1770353725%2CMmQxYjc3NzdiZTdjZTQ4MDk1NGQ0MWQ2ODBkYzFkYTE0Y2VmMTczYjY1NDA1ZmJlMjRiMDU2M2NiY2U5NGQyZQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": true,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Requests advice and input; primarily a question post without substantive content.",
    "composite_score": 3.39877083390908
  },
  {
    "score": 76,
    "title": "Update on My Coffee Scale Project: From Basement Prototype to Indiegogo",
    "selftext": "Hi everyone! Thanks for all the feedback, advice, and support on my previous post about my coffee scale project. I wanted to share an update and hopefully get your thoughts.\n\nWe launched on Indiegogo and were fully funded in the first hour, now with 200+ backers! Personally I think this is steller.  While a viral moment or hitting half a million would be amazing, it’s not essential to creating a shipping product—that’s the real goal. Get the product made so I can widen my audience beyond crowdfunding.\n\nFor me, having more than 200 people take a leap of faith, pre-ordering something five months from delivery. That’s huge. \n\nThis project has been fully bootstrapped—every step from soldering to filming was done in my basement (except the hero video, that wasn’t my basement but we still did it ourselves). My pre-launch email list converted at around 25%, which seems on par for small campaigns like this (I can expand more on this if anyone wants).\n\nManufacturing Insights (thus far)\nHere’s a quick breakdown for anyone curious or working on hardware:\n\nTooling Costs: My molds have come in at ~$10K for two plastic parts, a rubber top, and a metal ring. The bottom part is overmolded (two molds for one piece), which adds cost but I believe the extra cost is worth it. The difference is hard to describe, but the soft-touch bottom feels worlds apart from the cheap plastic on typical coffee scales.\n\nMaterial Costs: Plastics and rubber cost about $5/unit, including overmolding. \n\nPCB: It’s a big board with 65 RGB LEDs, a high-end ADC, temp sensor, and accelerometer, so costs are higher. This is what is driving up the per unit cost.\n\nAssembly: Still finalizing, but I designed it for efficient assembly. Worst case, I could hand-assemble 20–30 units/day myself if needed. This keeps things flexible.\n\nA note on the funding goal: we could cover the tooling, so the goal was set to produce the first set of units. Not an overall project goal that would cover marketing, tooling, etc etc etc. this is pretty typical.\n\nOne big advantage for me is having a friend in China (we went to school together) who can facilitate smaller production runs. Without that, the usual factory MOQs (minimum order quantities) could have been a deal-breaker. I think tooling and MOQ is where most crowdfunding projects fall apart and fail to ship.\nIf you’re interested in learning more (or grabbing a scale), here’s the campaign link:\n[Indiegogo: Measurrd](https://www.indiegogo.com/projects/measurrd-the-world-s-most-advanced-kitchen-scale)\n\nI’d love to hear your feedback or answer any questions. Thanks again for all the support—it means a lot!",
    "subreddit": "hwstartups",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1732225573.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Provides a breakdown of costs and insights in a bullet-point list.",
    "composite_score": 3.382171572089618
  },
  {
    "score": 58,
    "title": "I made a thing and it was hard to make.",
    "selftext": "I think what I did was difficult because I am feeling a little bit of mental burn, which the Holidays might help me recover from.\n\nI am an electronics hardware designer (analog background). I have designed and created the worlds first digital billiard ball. It is basically an IMU in a ball that measures exactly where the cue tip hits the ball. You can read more about it here: [www.digicue.net/digiball](https://www.digicue.net/digiball) The final design works and I now just need to finish working out the contract with my manufacturer and teach my electronic assembler how to make the sensors.\n\nThis effort has been a **part-time solo boot-strapped electronics hardware startup**. Starting this project in 2019, here are the things that I have done myself while already working a full time engineering job:\n\n* Designed prototype 1, using a PIC and an IMU, simple battery to test theory with a blinking light\n* Designed prototype 2, using a BLE module, to test wireless functionality and basic concepts. Made simple program on PC to analyze data.\n* Designed custom BLE meandering antenna to optimize for being encased in phenolic resin\n* Designed wireless charger and receiver, since a billiard ball can not have any plugs/ports\n* Designed prototype 3, using an nRF52 SoC, custom antenna, and custom wireless charger\n* Designed Android App for testing, developed a feel for how the user experience should be\n* Made a dozen prototypes by hand, drilling a hole in a pool ball, inserting sensor, potting and sanding smooth\n* Got some support and funding for a while by an external company\n* Impact / durability / balance tests. Made a robot to test accuracy.\n* Wrote and filed patent myself. Designed trademarks myself.\n* Designed prototype 4,5,6 with different wireless charging chips\n* Learned about EMC and requirements\n* Designed variations of wireless charger and freqency until I found good charge transfer at 10mm and a frequency within FCC pass limits\n* Performed pre-compliance testing myself with rented equipment in a chamber\n* Learned how to use Flutter and Dart, designed App #2 for iOS and Android\n* Designed auxiliary software that can run on PCs if needed\n* Designed many versions of the plastic enclosure for the wireless charger\n* Started working directly with billiard ball manufacturer\n* Redesigned the sensor multiple times to survive the ball manufacturing process\n* Ordered custom lithium ion batteries with special electrolyte to survive the phenolic resin curing process\n* Tweaked antenna since battery and components added a lot of ground-plane\n* Redesigned some more to perfect the density and balance of the sensor due to component distribution\n* Designed even more custom parts to ensure proper weight with center of balance (PTFE plugs, brass and nylon tubes)\n* Manufactured a lot of the parts myself while making the sensors\n* Shipped to manufacturer, and finally, production-ready-success with a launchable app.\n\n&amp;#x200B;\n\nNot to mention other PCBs I made like a 20-gang lithium ion charger, a battery tester and many weeks of temperature cycling and testing the custom batteries, BLE testers, the entire Nordic nRF52 SDK, and more that I will rememeber the more I type.\n\nI feel like this project design was challenging because everytime I made one change, it affected the weight / balance / density / antenna tuning of the entire product. It took a lot of iterations to get right. And on top of that, I needed to go through ALL of this just to see if the product was even manufacturable. From the small successes I kept having with cold potting I kept going.\n\nI did a solo startup before this one which saw success (8000+ units sold), also for pool, and also while working full time. The chip shortage killed that project with obs parts. But for this project, in the past two years, I got divorced, moved out, met someone new, moved again, got engaged, got married, paid off the wedding, finalized divorce, paid off divorce, moved a third time, and am saving for a house from scratch, and learned a fair bit of Portuguese.\n\nI am feeling tired, and looking back, I don't think people realize how much work hardware can be if you do it all yourself with zero budget.\n\nThanks for reading.",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1702501938.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.55,
    "category_rationale": "Shares the process and prototypes in a narrative with supporting bullet points; mainly experiential insight.",
    "composite_score": 3.1184882641937968
  },
  {
    "score": 53,
    "title": "After taking a consumer hardware product from conception to delivery, I'm happy to answer your questions or offer advice.",
    "selftext": "Hi! I developed a consumer hardware product from conception to delivery: Arpeggio, a portable electronic musical instrument [www.tangibleinstruments.com](http://www.tangibleinstruments.com) . Internal peripherals include USB, Bluetooth LE, SD-Card, audio output &amp; speaker, Li-ion battery, MIDI.\n\nSome of the things I did along the way in this long process include:\n\n* Led comprehensive product lifecycle process, covering aspects like ideation, industrial design, feature specifications, sourcing PCB and injection molding suppliers, BOM budgeting, packaging, fulfillment, and marketing. \n* Hired and managed external electrical and firmware engineers, wrote specification documents, reviewed milestones, and ensured alignment with the delivery roadmap.\n* Developed and coded high level firmware features in C language on STM32 platform with FreeRTOS library.\n* Sourced and communicated with Chinese manufacturers of injection-molded parts, PCBs, and electrical components to optimize costs, lead times, and quality. \n* Designed and iterated user interface, enclosure, and packaging. Coordinated translation of mechanical / industrial design prototype to DFM with manufacturers.\n* Collaborated with firmware engineers and vendors to troubleshoot and resolve software issues, electrical issues, and mechanical design / fitment issues. \n* Oversaw supply chain, logistics, import, and fulfillment processes, ensuring successful product delivery. \n* Launched the product to market, managed user feedback, met quality and reliability targets, and implemented iterative firmware improvements.\n* Wrote user documentation and designed visual [Quick Start](https://www.tangibleinstruments.com/cdn/shop/files/arpeggio_interface_and_quick_start.pdf) and [User Guide](https://www.tangibleinstruments.com/cdn/shop/files/arpeggio_user_guide_v1.pdf). \n* Shot product photography, launched online Shopify store, conceptualized and filmed advertisements, set up Meta ads campaign.\n\nHappy to answer questions about any part of this development process. Post your questions, or feel free to shoot me a DM. Also open to consultancy work.",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1758900596.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Describes end-to-end product lifecycle and offers guidance; value comes from lessons learned.",
    "composite_score": 3.452393759822969
  },
  {
    "score": 51,
    "title": "Launching an Open-Source, Affordable IoT Platform – Journey of a Startup Challenging the Big Players",
    "selftext": "Hi r/hwstartups, Ivan here from the land of the world's fastest electric car, the Rimac Nevera!\n\nI'm excited to share our journey in building an alternative to the Tuya IoT platform, especially after their hefty $25K monthly charge. Our focus? Accessibility and freedom from platform lock-in.\n\n**What We Do:**\n- **Simple API for Sensor Data:** Our sensors, powered by ESP32, are both open hardware and open source, ensuring no platform lock-in.\n- **Community-Driven Cloud Service:** Manage devices, track firmware deployments, and delve into analytics with our community version cloud service.\n- **Affordability Meets Innovation:** Our sensors are priced under $15, rivaling Tuya's offerings, but with a twist – we're diving into digitalization, from remote readings to energy management and corporate reporting.\n\nIt's a bold claim to take on giants like Tuya, but we love challenges!\n\n**Behind the Scenes:**\n- **Cost-Effective Production:** Thanks to a solid deal with electronics component distributors and our own assembly line (partially funded by my student loan!), we've managed to keep sensor costs low.\n- **The Setup:** We're talking about a central gateway with various add-ons like current, temperature, humidity, presence sensors, and more.\n\n**Sharing the Journey:**\n- I've started documenting our journey on social media, sharing insights, tools, distributors, successes, and failures. If you're interested, I'd be happy to share these resources.\n\nExcited to hear your thoughts, feedback, and maybe even some of your own experiences. Let's discuss how open-source can change the IoT landscape!\n\nCheers,\nIvan",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1702587201.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Explains the open-source hardware/IoT approach and rationale rather than listing how-to steps.",
    "composite_score": 2.840078968826621
  },
  {
    "score": 51,
    "title": "Making a HW startup work feels impossible",
    "selftext": "As a hardware startup, it feels impossible to make any significant progress without funding, but also impossible to get any funding without significantly more progress. Especially these days with AI and vibe coding being so popular and making building SW products so simple, every investor (even self-proclaimed pre-seed or extremely early stage investors) wants to see a basically finished product.\n\nFor context, I've raised $100k in f&amp;f so far. I've used ~$55k of that working with freelancers to complete our electrical and mechanical architecture, finalized BOM and component selection, comprehensive power study, and industrial design with some \"looks-like\" prototypes. I'm using the remainder of the funds for a crowdfunding campaign in the fall. However, with the pay-to-win state of crowdfunding these days, I don't expect to raise enough money to take this product to the finish line. Therefore, I'm using this crowdfunding campaign as more of a strategy to generate some traction (e.g. generate a waiting list, some pre-product revenue, social-media buzz, etc.) to then take to investors as evidence of early PMF. However, given my conversations with investors so far, I think even with that a lot of them would still be hesitant to invest without a fully-fledged product.\n\nAny advice on how I can approach next steps as a hardware startup? Or should I focus on executing the strategy as I described and just hope I come across the right investor?",
    "subreddit": "hwstartups",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1754437981.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Vent session about funding challenges with a request for advice, dominated by emotion.",
    "composite_score": 3.287729681877893
  },
  {
    "score": 44,
    "title": "Started a YouTube series on hardware startups. Would love feedback and guest suggestions",
    "selftext": "Hi all, I recently started a YouTube series where I sit down with hardware founders to talk through how they got started, what they’re building, and do a quick product demo.\n\nEpisodes so far include:\n• Matic Robots – autonomous home cleaning\n• Light Phone – minimalist distraction-free phones\n• Hyperice – recovery tools used by top athletes\n• Impulse Labs – AI-powered strength training\n\nThe goal is to tell real stories behind hardtech and make the space more accessible.\n\nWould love for you to check it out and let me know what you think. Also open to any suggestions on companies or founders I should feature next.\n\nThank you!\n\n",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1753669895.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Mostly a call for feedback on a YouTube series with little substantive content.",
    "composite_score": 3.111911512724822
  },
  {
    "score": 40,
    "title": "Finally ready to share my project: Autolith – A display autorotation system for computer monitors!",
    "selftext": "It’s been a long journey to get here. I designed, built, and prototyped everything myself from the ground up. It’s been a huge learning experience for me. From doing things I know and love like PCB design and coding, to getting completely out of my comfort zone to figure out things like logistics, certification and business. So here it is, Autolith: Autorotation for desktop monitors!\n\nIt’s a small device that attaches to the back of your computer monitor, and adds autorotation, in a very similar way to how your smartphone works. You can quickly change the orientation of your monitor to best suit whatever you are working on. Just rotate your display and Autolith automatically adjusts the display image. It’s wireless, rechargeable, and supports up to 3 displays. I also wrote another software for windows that the devices connect to, it allows you to control both your devices and monitors, view battery life etc. This is a quick demo I made if you want to take a look at how it works: [https://www.youtube.com/watch?v=yZ47HuhFJyU](https://www.youtube.com/watch?v=yZ47HuhFJyU)\n\nI started building this in university as a side project, I had a setup with two monitors, both on rotatable stands. Whenever I was programming, I found I would often switch between vertical and horizontal formats depending on what I was doing (e.g. vertical screen for code, back to horizontal for watching a guide/tutorial or design work). The problem was every time I did this, I had to go to into settings and arrange my display correctly, it was time consuming and really took me out of what I was doing, which got annoying after a while. I thought a much better solution was to make monitors autorotate in the same way a smartphone does.\n\nIt’s finally ready for the market, so I thought I’d post about it here first. This community has been a huge help to me throughout this process. I want to thank anyone who took the time to answer my questions here in the past. I’d love to hear what everyone’s thoughts on the project are, if you have any suggestions etc. I am also happy to answer any questions anyone may have about the process to get here! There was lots to do to get here after building the product, certifications, legal, distribution, injection molding etc. If you want to know anything at all, just ask.\n\nHere’s the website if you want to see a bit more about it ([Autolith](https://autolithinc.com/)), I would greatly appreciate feedback on it as well.\n\nThank you for taking the time to read this, I appreciate any feedback you have!\n\nhttps://preview.redd.it/d9jrbq6redyd1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=a203dcebacd8e4b5f6225938877f4e31405a875a\n\n",
    "subreddit": "hwstartups",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1730502293.0,
    "media": {
      "type": "youtube.com",
      "oembed": {
        "provider_url": "https://www.youtube.com/",
        "version": "1.0",
        "title": "Autolith Monitor Autorotation Demo",
        "type": "video",
        "thumbnail_width": 480,
        "height": 200,
        "width": 356,
        "html": "&lt;iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/yZ47HuhFJyU?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Autolith Monitor Autorotation Demo\"&gt;&lt;/iframe&gt;",
        "author_name": "Autolith",
        "provider_name": "YouTube",
        "thumbnail_url": "https://i.ytimg.com/vi/yZ47HuhFJyU/hqdefault.jpg",
        "thumbnail_height": 360,
        "author_url": "https://www.youtube.com/@AutolithInc"
      }
    },
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Project introduction and request for thoughts; no actionable steps.",
    "composite_score": 2.964843848047698
  },
  {
    "score": 40,
    "title": "The Complete Guide for Building Apps for Apple Vision Pro",
    "selftext": "The Vision Pro AR/VR headset is a game-changer in the digital world,  offering exciting opportunities for various sectors like manufacturing,  logistics, healthcare, and more. Its features like object and text  detection open endless possibilities for developers.  \nI find a detailed article on how to develop an application for Apple Vision Pro.  \nI think this kind of apps is a new trend. What do you think about this?  \n[https://code-care.com/blog/building-apps-for-apple-vision-pro/](https://code-care.com/blog/building-apps-for-apple-vision-pro/)",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1688405744.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Link-sharing / request for opinions about building apps; lacks substantive guidance.",
    "composite_score": 2.6113138523837165
  },
  {
    "score": 39,
    "title": "If you are building a hardware product, these lessons might save you a lot of money and pain:",
    "selftext": "I've made some of these mistakes myself and I've worked with a bunch of other founders who struggled with them as well. Please learn from this.\n\nBtw: with \"hardware\" I mean any physical product that needs manufacturing.\n\nIt's one thing to know it and another to actually act according to it. At least take it as a reminder:\n\n1. Most startups fail because they fail to meet the market needs. They only build for themselves. In hardware, you only have one shot, so this is even harder. DON'T develop anything before you have talked to customers for 1-2 months full-time. I've yet to see someone who did not pivot after doing this. Learn how to perform the Mom Test and always have the problem in mind. Not the solution you enjoy building.\n2. In most cases, Kickstarter will not be enough capital to get manufacturing going. Bootstrapping in hardware is thus a bad idea (unless you are already rich enough to pay for a year of development, the tools and the first two batches).\n3. This means you need funding. It is incredibly hard to get funded by VC. It seems like it takes at least half a year full-time effort to have a realistic chance at getting any funding (experience made in Germany).\n4. Do not try to do it alone. I've seen a few founders who tried to do it by themselves or with a meagre team. As a result, they burned out very quickly. IMO: one needs to hunt funding, another needs to build the product and a third team member needs to build the community and do the marketing.\n5. Once you have your team in place, focus relentlessly. Each team member should concentrate on their specific domain rather than spreading themselves thin. Developing and solving business stuff like marketing and funding at the same time is a waste of time. It's most efficient to do one thing after another.\n6. If you are a team of makers, marketing and sales will be your biggest problem. Consider building in public. Build a community.\n7. Actually commit to front-loading: Do not build the first solution that came to mind. At least find 3 solutions for every problem and evaluate them thoroughly. Most of the time there will be a cheaper or a higher quality solution if you actively search for it.\n8. Do not go for a final prototype at first. Use mockups and demonstrators to prove critical parts of the design and again: get customer feedback.\n9. Get help. There are official institutions, sparring partners, networks and business angels that actually want to see you win.\n\nThis is, of course, only my perspective on things. Some things will be different for your case, in your country etc. Still, it's probably a good idea to at least critically consider if there might be a challenge with any of the things I said.\n\nFeel free to disagree and please share some of your insights as well!",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1764122809.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Enumerated actionable lessons in a sequence addressing how to build hardware startups.",
    "composite_score": 3.00825899027744
  },
  {
    "score": 33,
    "title": "Where can I get a premium production style prototype made without 3D printing?",
    "selftext": " I have completed the industrial design for a new consumer product and now need a high quality cosmetic prototype. I am not looking for something rough or 3D printed. I need a model that closely matches the weight, feel, and finish of the final version so it can be used in marketing shoots, investor presentations, and early retail pitches.\n\nI am currently looking into Product Innov for detailed prototyping, finishing, and small batch runs for products that are past the concept stage. My priority is to get a sample that looks and functions like it came straight from production so I can validate market interest before committing to large scale manufacturing.\n\nIf you have gone through this process, did you use a specialized product development team or a local fabrication shop? Was the investment worth it in terms of presentation quality and early traction?",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1755636643.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Seeking advice on prototyping and whether investment is worth it; none of the above categories dominate.",
    "composite_score": 3.050370845402123
  },
  {
    "score": 31,
    "title": "14 Years Making Hardware!",
    "selftext": "Hi Everyone,\n\nI have extensive experience in designing and manufacturing hardware products (in the USA/China/Vietnam) and would love to connect with some of you to help with your projects. Whether you're facing challenges in manufacturing or just need guidance, I'm happy to offer my insights.\n\nIn return, I’m hoping to learn more about the pain points you face when designing and manufacturing hardware. I'm currently working on a software platform to help users better manage their production, and your feedback will be invaluable in making it a great resource for the hardware community.\n\nIf you’re interested in chatting or have any questions, feel free to DM me or comment below. Looking forward to hearing from you!\n\n",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1732287107.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Networking/offer to help hardware folks; largely a simple outreach post.",
    "composite_score": 2.8347099696478684
  },
  {
    "score": 31,
    "title": "Made a device that solved a personal problem at work and some of my peers have started using it as well. I have some questions about bootstrapping it into a business.",
    "selftext": "The device is similar to a Labjack DAQ, but takes fewer steps to use since it doesn’t require drivers or extra software to configure (uses usb-cdc), and it’s built for a more specific use case.\n\n1. Are 3D printed cases a deal breaker in a professional environment? I created and sold a device for hobbyists that had a 3D printed case, and that went well, but I’m not sure if the same applies to professional use. It’s been working for us since it’s used for R&amp;D only, and our customers never see it.\n2. Is it even worth pursuing if the device is super simple? It’s a 2 layer board with only 1 MCU, the rest are discrete ICs. It took me about 2 weeks total development time to finish, and I feel like an experienced maker could do it within a few days.",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1707458028.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.57,
    "category_rationale": "Question-driven discussion about product bootstrap and technical aspects; no clear model or steps.",
    "composite_score": 2.909119982655925
  },
  {
    "score": 27,
    "title": "Chinese copycats are crazy",
    "selftext": "I posted here a few days back about a new product I painstakingly designed from scratch. Well, I just found this $45 plastic knockoff of my latest product design on amazon..\n\nThe only problem is that they copied the design before I finished reworking my water-tight lid and so the copycat doesn’t even have one!\n\nThey did, however, add a cheap 5000mah battery that will die in a couple months! So they’ve got hat going for em…🤣\n\nLawyer already on it 😂",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.76,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1712875709.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Emotional vent about copycats and legal action; expresses judgment.",
    "composite_score": 2.848536947183006
  },
  {
    "score": 28,
    "title": "How I Brought My First Product to Market - Idea to Small Business",
    "selftext": "Hey guys, I've posted here before, but I wanted to throw out another update. \n\nBasically, around 570 days ago I decided to begin a journey of designing and launching my first product. I call it myTMJ Pen, and essentially it is a portable heated massager for the jaw. Because I personally dealt with TMJ Disorder (chronic jaw pain) for years and noticed how underserved the market was - myTMJ Pen is just one of the ideas I had/have for devices that could've helped me and others with jaw pain. \n\nIt took 11 months to iterate through PCB designs and casings, after which I was confident enough to ship my first 100 units to real customers. From then it's just been constant product improvements, and scaling production + sales. To the point where in January we managed to hit $50k/month in sales!\n\nI put together this video to tell the *entire* story from start to finish. It's really long, ngl. But honestly, I really wish I found a video like this back in the day. It's the real, sometimes embarrassing, but hopefully encouraging journey of bringing a product to life—completely solo bootstrapped.\n\nIf you're interested in that kind of stuff, check it out, and let me know what you think. I'll be answering questions in the comments.\n\n[https://youtu.be/TYcfC-adRvA](https://youtu.be/TYcfC-adRvA)",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1743226652.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Personal product-launch narrative with no explicit step-by-step instructions.",
    "composite_score": 2.913477013570066
  },
  {
    "score": 29,
    "title": "Apple built the iPod in 290 days, so my goal is to build and ship a wearable in 289 days.",
    "selftext": "I’ve been sitting on the idea of creating a health/fitness band without a display for nearly a year now. At the end of September, I decided to stop overthinking and start working on it as a side project alongside my main business.\n\nSince then, I’ve partnered with a talented product designer from Africa to bring the hardware design to life.\n\nLast week, I made the decision to allocate more of my workweek to this project – roughly two-thirds of my time – so I can give it the focus it deserves. Inspired by the story of Apple building and launching the iPod in just 290 days, I’ve set a bold goal: to build and ship this product within 289 days, starting yesterday.\n\nThat puts launch day on October 22nd.\n\nI’ll be documenting every step of this journey right here in this thread – wins, failures, challenges, and breakthroughs.\n\nA website with more details about the device is also in the works and should go live in the next few weeks.\n\nI’d love to hear your thoughts, feedback, or even questions about this project. Whether it’s ideas for features, ways to improve the process, or general advice – I’d be really happy to learn from this community.",
    "subreddit": "hwstartups",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1736290539.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Presents a goal and a sequential plan to design, develop, and ship a wearable within a deadline.",
    "composite_score": 2.986039867072248
  }
]