[
  {
    "score": 1179,
    "title": "Dream11 is shutting down its real money gaming business after the new Online Gaming Bill 🚨",
    "selftext": "One of India’s biggest fantasy sports platforms, Dream11, has decided to pull the plug on its real money gaming operations. This comes right after the government rolled out the Online Gaming Bill, which brings stricter regulations on real-money and betting-style games.\n\nWhat this means:\n\nStricter compliance + higher taxes = less viability for real money platforms\n\nStartups in the gaming space will have to rethink their models\n\nEsports, free-to-play, and skill-based gaming might see a bigger push\n\n\nThis is pretty huge considering how massive Dream11 is in India. Shows how fast regulations can change the game for even the biggest players.\n\n👉 Do you think this new bill is a good step for safer gaming, or will it kill innovation and investment in the Indian gaming ecosystem?\n",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1179,
    "downs": 0,
    "created_utc": 1755839224.0,
    "media": null,
    "is_video": false,
    "num_comments": 120,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains regulatory impact on Dream11's real-money gaming with reasoning.",
    "composite_score": 4.848274692464351
  },
  {
    "score": 917,
    "title": "Whistleblower Documents Reveal SEBI’s Chairperson Had Stake In Obscure Offshore Entities Used In Adani Money Siphoning Scandal",
    "selftext": "TLDR from Hidenburg Website\n&gt; What we hadn't realized: the current SEBI Chairperson and her husband, Dhaval Buch, had hidden stakes in the exact same obscure offshore Bermuda and Mauritius funds, found in the same complex nested structure, used by Vinod Adani.\n\n&gt; In brief, despite the existence of thousands of mainstream, reputable onshore Indian mutual fund products, an industry she now is responsible for regulating, documents show SEBI Chairperson Madhabi Buch and her husband had stakes in a multi-layered offshore fund structure with miniscule assets, traversing known high-risk jurisdictions, overseen by a company with reported ties to the Wirecard scandal, in the same entity run by an Adani director and significantly used by Vinod Adani in the alleged Adani cash siphoning scandal.\n\n&gt; We suspect SEBI's unwillingness to take meaningful action against suspect offshore shareholders in the Adani Group may stem from Chairperson Madhabi Buch's complicity in using the exact same funds used by Vinod Adani, brother of Gautam Adani.\n",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 917,
    "downs": 0,
    "created_utc": 1723310392.0,
    "media": null,
    "is_video": false,
    "num_comments": 180,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Analyzes potential conflicts and implications of offshore stakes in SEBI chairperson case.",
    "composite_score": 4.8041819686358345
  },
  {
    "score": 897,
    "title": "Budget 2024 - Specific tax changes - New regime, capital gains",
    "selftext": "NEW TAX REGIME\n\nStandard deduction at 75000 vs 50000 earlier\n\nTax rates changed in New Tax regime\n\n0-3lakh - Nil\n\n3-7 lakh -5%\n\n7-10 lakh -10%\n\n10-12 lakh -15%\n\n12- 15lakh -20%\n\nAbove 15Lakh -30%\n\nThis could save about 17,000 for all taxpayers\n\nCAPITAL GAINS\n\n(more information to be gleaned from the finance bill)\n\nFor equities and funds, STCG seems to be 20% and LTCG is 12.5%\n\nLTCG exemption of 1.25 lacs instead of 1 lac\n\nSpecified funds to be taxed at applicable rates (no change from last year)\n\nAdded later.\n\nFWIW, here is the full set of notes that I made during the speech.  Many important changes for specific sectors.  (Of course the initial focus would be on tax changes)\n\n# Introduction\n\n(speech started at 1105)\n\n* Standard references to results, mandate, etc.\n\n# Global Context\n\n* Performance better than expected\n* Still many uncertainties\n* downside risk for growth and upside risk for inflation\n* Indian economy stays strong\n* Core inflation is 3.1%; overall inflation is going towards target.\n* Recap from interim budget 4 major castes - poor, women, youth and farmer\n* Gave previous work done for each - higher MSP,\n\nIntroduction\n\n(speech started at 1105)\n\n* Standard references to results, mandate, etc.\n\n# Global Context\n\n* Performance better than expected\n* Still many uncertainties\n* downside risk for growth and upside risk for inflation\n* Indian economy stays strong\n* Core inflation is 3.1%; overall inflation is going towards target.\n* Recap from interim budget 4 major castes - poor, women, youth and farmer\n* Gave previous work done for each - higher MSP,\n\n# Priorities\n\n* Sustained efforts on 9 priorities - Viksit Bharat\n\n1. Productivity - agril\n2. employment and skilling\n3. social justice\n4. mfg &amp; services\n5. urban development\n6. energy security\n7. Infra\n8. Innovation, R&amp;D\n9. Next gen reforms\n\nSubsequent budget would build on these...\n\nThis budget gives some of the work for these priorities\n\n# Part 1\n\n# Productivity and Resiliency in agriculture\n\n* Specific research on agri\n* 109 new varieties for 32 crops\n* 1 cr farmers would be initiated into natural farming; branding support\n* 10k need based bio input centres\n* Oilseeds - production, storage and marketing - self sufficiency push for mustard, sesame, soyabean, sunflower\n* Vegetable supply chain\n* Digital public infra for agri\n* 400 districts to have digital crop survey\n* Details of 6 cr farmers to be part of farmer and land registry\n* Shrimp farming -  financing help from NABARD\n* National co-op policy\n* 1.52 trillion allocation for agri\n\n# Employment and Skilling\n\n* Employment linked incentives - enrollment in epfo, first time employees\n* Scheme A - 1 month wage to all persons entering the workforce in all formal sectors\n* DBT in 3 installments - salary limit of 1 lac per month\n* Scheme B - Job creation in manufacturing - incentive for first time employees, linked to epfo contributions over 4 years\n* Scheme C - Additional employment within salary of 1 lac pm - reimburse employers upto 3 k per month for 2 years for each additional employee\n* Women in workforce - Setting up of working women hostels, creches\n* Market access for women SHG\n* Skilling - new centrally sponsored scheme, in collaboration with states and industry - 20 lac youth over 5 year\n* 1000 ITIs to be upgraded - hub and spoke arrangement\n* Skilling loans - scheme to be revised upto 7.5 lac rupeers\n* Education Loans - Financial support for loans upto 10 lac rupees - domestic institutions\n* evouchers to be given to 1 lac students - interest subsidy of 3%\n\n# Inclusive Development, Social Justice\n\n* Saturation approach - cover all eligible people\n* Many schemes - vishwakarma etc, would be stepped up\n* Purvodaya - all round devt of east - Bihar, Jharkhand, Orissa, WB and AP!\n* Industrial node at Gaya on the Amristar-Kolkatta infra corridor\n* Development of road connectivity - Patna-Purnea, and 3 more in Bihar - 26K crore\n* Power projects - 2000 MW at Pirpainti\n* New airports, medical colleges, etc in Bihar; additional support for capital infra\n* And more stuff for Bihar\n* AP Reorg act - have made efforts to fulfill the commitments of the act\n* Special financial support for AP Capital - 15K crore in current financial year, additions in the future\n* Support for Polavaram irrigation project\n* Funds for essential infra like water, power, roads and railways - 2 nodes on Chennai-Vizag corridor and Hyd-Blr corridor\n* Grants for backward regions of AP as stated in the act\n* PMAY - 3 crore additional houses - allocations being made\n* Women led development - more than 3 lac crore for schemes benefiting women and girls\n* New scheme for tribal families - 63K villages, 5 cr people\n* More than 100 branches of IPB in north-east\n* 2.66 trillion for rural development\n\n# Manufacturing and Services\n\n* Special attention to MSMEs\n* Special financing measures - credit guarantee scheme for mfg msme - pooling of credit risk\n* separate guarantee fund - borrower has to pay guarantee fee\n* PSB would build in-house capacity to assess MSMS - new credit assessment model based on digital footprint\n* Credit support to msme during stress periods - continuation of bank credit while in SMA status\n* Limit of mudra loans enhanced to 20 lacs for people who have repaid loans\n* SIDBI new branches in MSME clusters - 24 this year...\n* Financial support for 50 multi product food irradiation units...\n* e-commerce export hubs in PPP mode - trade and export related services\n* Scheme 5 - comprehensive scheme for internship opportunities in 500 companies - 1 cr youth over 5 years\n* (almost the same scheme as in Congress manifesto)\n* Stipend of 5000 per month - companies have to bear training costs from CSR funds\n* Industrial parks in or near or 100 cities - supposedly plug and play\n* Rental housing with dorm type acco for industrial workers in PPP mode  - vgf support   (China model)\n* Schemes for shipping\n* Critical mineral mission - domestic production, recycling, and overseas acquisition\n* Offshore mining of minerals -\n* Development of DPI applications at population scale - credit, ecommerce, health, education, law and justice, etc\n* Integrated tech platform for IBC ecosystem\n* Voluntary closure of LLP - CPAYS would be extended to LLPs\n* NCLT - more than 1000 resolutions, 3.3 trillion recovery; many cases disposed of pre-NCLT stage\n* Additional tribunals -\n* DRT - reforms, additional tribunals\n\n# Urban Development - cities as growth hubs\n\n* in co-op with state govts\n* creative redev of existing cities\n* transit oriented dev for 14 large cities\n* PMAY-urban - 1 cr additional houses - central assistance of 2.2 trillion\n* support for interest subsidy\n* some schemes for rental housing\n* 100 large cities - water, sewage treatment. use treated water for irrigation\n* Street vendors - devt of 100 weekly haats in select cities\n* Stamp duty - encourage states to moderate duties, lower duty for women owned properties\n\n# Energy Security\n\n* Surya Ghar scheme as announce earlier - to cover 1 cr homes.  1.28 cr registrations so far\n* Pumped Storage - policy to promote this\n* R&amp;D for small and modular nuclear reactors\n* Nuclear energy would have more reach\n* Thermal - indigenous tech for advanced ultra super something - 800 MW commercial plant to be set up\n* Trad industries to go towards emission targets - Indian carbon market\n\n# Infrastructure\n\n* Maintain strong fiscal support for infra\n* Same budget as interim -  11.11 trillion\n* Encourage state to provide support for infra - 1.5 trillion for long term interest free loans\n* VGF for private investments\n* Phase 4 of rural roads - all weather connectivity to 25K rural habitations\n* Irrigation and flood control - 11,5 K crore support for flood control in Bihar\n* Survey for Kosi related floods\n* Support for Assam, Himachal Pradesh, UK, Sikkim\n* Tourism - additional measures - Gaya and Bodhgaya temples - Vishnupad temple corridor and Mahabodh temple corridor - on lines of Varanasi corridor; devt of Rajghir; Nalanda as tourist centre\n* Orissa - mentioned all factors - assistance for development\n\n# Innovation, R&amp;D\n\n* Support basic research, proto dev\n* 1 trillion support\n* Expand space economy by 5 times in 10 years\n\n# Next Gen Reforms\n\n* Economic Policy Framework for growth and employment\n* Reforms to cover all factors of production\n* Initiate these reforms with states - land related reforms and actions, rural land related actions - bhoo aadhaar for all lands, specific list\n* Digitization of urban land records based in GIS, Improve financial position of ULB\n* Integration of eshram portals with other related portals - include employment listing, connection to skilling providers\n* Financial Sector Vision and Strategy document -\n* Taxonomy for climate finance - enhance capital\n* Variable Company Structure - leasing of aircraft and ships, private equity\n* NPS Vatsalya  - parents can contribute to minors schemes\n* NPS for govt employees - work in progress, maintain fiscal prudence\n\n# Receipts\n\n* Net tax - 25.8 trillion\n* FD at 4.9% of GDP\n* Gross and net market borrowings at 14 trillion and 11 trillion - less than last year\n* Trajectory to decline fiscal deficit\n\n# Part B\n\n# Indirect Taxes\n\n* Further simplify and rationalize GST\n* Look to expand to other products!\n\n# Duties\n\n* Review of duty structure over next 8 months\n* 3 more cancer medicines exempt from duty\n* Reduction of duty on mobiles, kits and chargers\n* Exempt duty on 25 minerals\n* Some stuff in solar\n* Reduction in duty for some shrimp and fish feed to 5%\n* duty lowered on down from duck and goose\n* More specific stuff...\n* Gold and silver duty to 6%, platinum to 6.4%\n* no duty on ferro nickel, and some copper stuff\n* lower duty for resistors, connectors\n* Increase duty on ammonium nitrate, flex panels, PCB of specified telecom equipment\n* Extended timeframe for shipping and aircraft MRO\n\n# Direct Taxes\n\n* Reference to 'new' tax regime for corporate and individuals\n* 2/3 of personal tax returns under regime\n* Comprehensive review of IT act of 1961 - in 6 months\n*  Simpler tax regimen for charities, TDS, capital gains\n* Two regimes for charity to be merged to one\n* Reduction on TDS on some parts\n* TDS can be remitted till filing date\n* Simplify provisions for re-opening of assessment\n* Re-opening after 3 years only for escaped income &gt; 50 lacs, limited to 6 years of search\n* **Capital Gains -** short term on some financial assets at 20%, others continue at applicable rates\n* LTCG to be 12.5% instead of 10%. exemption to 1.25 lac\n* listed long term after 1 year, other financial assets are long term after 2 years\n* Debt funds, MLD continue the same way... - applicable rates\n* Some measures on assessment...\n* Angel tax cancelled for all classes of investors\n* Simpler regime for domestic cruises\n* STT increased to .02% and .1% on trade and delivery\n* NPS would be exempt upto 14% of salary - new tax regime would support deductions for NPS\n* non-reporting of 20 lacs of foreign assets to be de-penalised\n* New regime - Deduction from 50k to 75k;   3-7 lac - 5%; 7 - 10 lac 10%,  10-12 lac 10%, 12-15 lac - 20%, above 15 lac 30%\n* 17000 reduction in new regime\n* 37K crore revenue loss and 30K crore additional - net reduction of 7k crore\n\n",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 897,
    "downs": 0,
    "created_utc": 1721718470.0,
    "media": null,
    "is_video": false,
    "num_comments": 295,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.75,
    "category_rationale": "Presents a set of tax brackets and changes as a bulleted/numbered list.",
    "composite_score": 4.893922192196774
  },
  {
    "score": 760,
    "title": "Adani Group: How The World’s 3rd Richest Man Is Pulling The Largest Con In Corporate History (Hindenburg Research)",
    "selftext": "EDIT: Adani group has released an official statement in response to Hindenburg report. Including a link to their official tweet for everyone's reference: https://twitter.com/AdaniOnline/status/1618169673073451008?s=20\n\n----------------------------\n\nSharing this article here as I feel it might be of interest to a lot of us who're invested into Adani group companies, either directly or indirectly through index funds. Or have parked extra cash or emergency funds into a debt fund lending to Adani companies. \n\nI'll share a summary of the report here, while you can read the full report at this link: https://hindenburgresearch.com/adani/\n\n&gt; Today we reveal the findings of our 2-year investigation, presenting evidence that the INR 17.8 trillion (U.S. $218 billion) Indian conglomerate Adani Group has engaged in a brazen stock manipulation and accounting fraud scheme over the course of decades.\n\n&gt; Gautam Adani, Founder and Chairman of the Adani Group, has amassed a net worth of roughly $120 billion, adding over $100 billion in the past 3 years largely through stock price appreciation in the group’s 7 key listed companies, which have spiked an average of 819% in that period.\n\n&gt; Our research involved speaking with dozens of individuals, including former senior executives of the Adani Group, reviewing thousands of documents, and conducting diligence site visits in almost half a dozen countries.\n\n&gt; Even if you ignore the findings of our investigation and take the financials of Adani Group at face value, its 7 key listed companies have 85% downside purely on a fundamental basis owing to sky-high valuations.\n    \n&gt; Key listed Adani companies have also taken on substantial debt, including pledging shares of their inflated stock for loans, putting the entire group on precarious financial footing. 5 of 7 key listed companies have reported ‘current ratios’ below 1, indicating near-term liquidity pressure.\n    \n&gt; The group’s very top ranks and 8 of 22 key leaders are Adani family members, a dynamic that places control of the group’s financials and key decisions in the hands of a few. A former executive described the Adani Group as “a family business.”\n    \n&gt; The Adani Group has previously been the focus of 4 major government fraud investigations which have alleged money laundering, theft of taxpayer funds and corruption, totaling an estimated U.S. $17 billion. Adani family members allegedly cooperated to create offshore shell entities in tax-haven jurisdictions like Mauritius, the UAE, and Caribbean Islands, generating forged import/export documentation in an apparent effort to generate fake or illegitimate turnover and to siphon money from the listed companies.\n   \n&gt; Gautam Adani’s younger brother, Rajesh Adani, was accused by the Directorate of Revenue Intelligence (DRI) of playing a central role in a diamond trading import/export scheme around 2004-2005. The alleged scheme involved the use of offshore shell entities to generate artificial turnover. Rajesh was arrested at least twice over separate allegations of forgery and tax fraud. He was subsequently promoted to serve as Managing Director of Adani Group.\n    \n&gt; Gautam Adani’s brother-in-law, Samir Vora, was accused by the DRI of being a ringleader of the same diamond trading scam and of repeatedly making false statements to regulators. He was subsequently promoted to Executive Director of the critical Adani Australia division.\n    \n&gt; Gautam Adani’s elder brother, Vinod Adani, has been described by media as “an elusive figure”. He has regularly been found at the center of the government’s investigations into Adani for his alleged role in managing a network of offshore entities used to facilitate fraud.\n    \n&gt; Our research, which included downloading and cataloguing the entire Mauritius corporate registry, has uncovered that Vinod Adani, through several close associates, manages a vast labyrinth of offshore shell entities.\n    \n&gt; We have identified 38 Mauritius shell entities controlled by Vinod Adani or close associates. We have identified entities that are also surreptitiously controlled by Vinod Adani in Cyprus, the UAE, Singapore, and several Caribbean Islands.\n    \n&gt; Many of the Vinod Adani-associated entities have no obvious signs of operations, including no reported employees, no independent addresses or phone numbers and no meaningful online presence. Despite this, they have collectively moved billions of dollars into Indian Adani publicly listed and private entities, often without required disclosure of the related party nature of the deals.\n    \n&gt; We have also uncovered rudimentary efforts seemingly designed to mask the nature of some of the shell entities. For example, 13 websites were created for Vinod Adani-associated entities; many were suspiciously formed on the same days, featuring only stock photos, naming no actual employees and listing the same set of nonsensical services, such as “consumption abroad” and “commercial presence”.\n    \n&gt; The Vinod-Adani shells seem to serve several functions, including (1) stock parking / stock manipulation (2) and laundering money through Adani’s private companies onto the listed companies’ balance sheets in order to maintain the appearance of financial health and solvency.\n    \n&gt; Publicly listed companies in India are subject to rules that require all promoter holdings (known as insider holdings in the U.S.) to be disclosed. Rules also require that listed companies have at least 25% of the float held by non-promoters in order to mitigate manipulation and insider trading. 4 of Adani’s listed companies are on the brink of the delisting threshold due to high promoter ownership.\n    \n&gt; Our research indicates that offshore shells and funds tied to the Adani Group comprise many of the largest “public” (i.e., non-promoter) holders of Adani stock, an issue that would subject the Adani companies to delisting, were Indian securities regulator SEBI’s rules enforced.\n    \n&gt; Many of the supposed “public” funds exhibit flagrant irregularities such as being (1) Mauritius or offshore-based entities, often shells (2) with beneficial ownership concealed via nominee directors (3) and with little to no diversification, holding portfolios almost exclusively consisting of shares in Adani listed companies.\n    \n&gt; Right to Information (RTI) requests we filed with SEBI confirm that the offshore funds are the subjects of an ongoing investigation, more than a year-and-a-half after concerns were initially raised by media and members of parliament.\n    \n&gt; A former trader for Elara, an offshore fund with almost $3 billion in concentrated holdings of Adani shares, including a fund that is ~99% concentrated in shares of Adani, told us that it is obvious that Adani controls the shares. He explained that the funds are intentionally structured to conceal their ultimate beneficial ownership.\n    \n&gt; Leaked emails show that the CEO of Elara worked on deals with Dharmesh Doshi, a fugitive accountant who worked closely on stock manipulation deals with Ketan Parekh, an infamous Indian market manipulator. The emails indicate that the CEO of Elara worked with Doshi on stock deals after he evaded arrest and was widely known as a fugitive.\n    \n&gt; Another firm called Monterosa Investment Holdings controls 5 supposedly independent funds that collectively hold over INR 360 billion (U.S. $4.5 billion) in shares of listed Adani companies, according to Legal Entity Identifier (LEI) data and Indian exchange data.\n    \n&gt; Monterosa’s Chairman and CEO served as director in 3 companies alongside a fugitive diamond merchant who allegedly stole U.S. $1 billion before fleeing India. Vinod Adani’s daughter married the fugitive diamond merchant’s son.\n    \n&gt; A once-related party entity of Adani invested heavily in one of the Monterosa funds that allocated to Adani Enterprises and Adani Power, according to corporate records, drawing a clear line between the Adani Group and the suspect offshore funds.\n    \n&gt; Another Cyprus-based entity called New Leaina Investments until June-September 2021 owned over U.S. $420 million in Adani Green Energy shares, comprising ~95% of its portfolio. Parliamentary records show it was (and may still be) a shareholder of other Adani listed entities.\n    \n&gt; New Leaina is operated by incorporation services firm Amicorp, which has worked extensively to aid Adani in developing its offshore entity network. Amicorp formed at least 7 Adani promoter entities, at least 17 offshore shells and entities associated with Vinod Adani, and at least 3 Mauritius-based offshore shareholders of Adani stock.\n    \n&gt; Amicorp played a key role in the 1MDB international fraud scandal that resulted in U.S. $4.5 billion being siphoned from Malaysian taxpayers. Amicorp established ‘investment funds’ for the key perpetrators that were “simply a way to wash a client’s money through what looked like a mutual fund”, according to the book Billion Dollar Whale, which reported on the scandal.\n    \n&gt; ‘Delivery volume’ is a unique daily data point that reports institutional investment flows. Our analysis found that offshore suspected stock parking entities accounted for up to 30%-47% of yearly ‘delivery volume’ in several Adani listed companies, a flagrant irregularity indicating that Adani stocks have likely been subject to ‘wash trading’ or other forms of manipulative trading via the suspect offshore entities.\n    \n&gt; Evidence of stock manipulation in Adani listed companies shouldn’t come as a surprise. SEBI has investigated and prosecuted more than 70 entities and individuals over the years, including Adani promoters, for pumping Adani Enterprises’ stock.\n    \n&gt; A 2007 SEBI ruling stated that \"the charges leveled against promoters of Adani that they aided and abetted Ketan Parekh entities in manipulating the scrip of Adani stand proved\". Ketan Parekh is perhaps India’s most notorious stock market manipulator. Adani Group entities originally received bans for their roles, but those were later reduced to fines, a show of government leniency toward the Group that has become a decades-long pattern.\n    \n&gt; Per the 2007 investigation, 14 Adani private entities transferred shares to entities controlled by Parekh, who then engaged in blatant market manipulation. Adani Group responded to SEBI by arguing that it had dealt with Ketan Parekh to finance the start of its operations at Mundra port, seemingly suggesting that share sales via stock manipulation somehow constitutes a legitimate form of financing.\n    \n&gt; As part of our investigation, we interviewed an individual who was banned from trading on Indian markets for stock manipulation via Mauritius-based funds. He told us that he knew Ketan Parekh personally, and that little has changed, explaining “all the previous clients are still loyal to Ketan and are still working with Ketan”.\n    \n&gt; In addition to using offshore capital to park stock, we found numerous examples of offshore shells sending money through onshore private Adani companies onto listed public Adani companies.\n    \n&gt; The funds then seem to be used to engineer Adani's accounting (whether by bolstering its reported profit or cash flows), cushioning its capital balances in order to make listed entities appear more creditworthy, or simply moved back out to other parts of the Adani empire where capital is needed.\n    \n&gt; We also identified numerous undisclosed related party transactions by both listed and private companies, seemingly an open and repeated violation of Indian disclosure laws.\n    \n&gt; In one instance, a Vinod Adani-controlled Mauritius entity with no signs of substantive operations lent INR 11.71 billion (U.S. ~$253 million at that time) to a private Adani entity which did not disclose it as being a related party loan. The private entity subsequently lent funds to listed entities, including INR 9.84 billion (U.S. $138 million at more recent substantially lower exchange rates) to Adani Enterprises.\n    \n&gt; Another Vinod Adani-controlled Mauritius entity called Emerging Market Investment DMCC lists no employees on LinkedIn, has no substantive online presence, has announced no clients or deals, and is based out of an apartment in the UAE. It lent U.S. $1 billion to an Adani Power subsidiary.\n    \n&gt; This offshore shell network also seems to be used for earnings manipulation. For example, we detail a series of transactions where assets were transferred from a subsidiary of listed Adani Enterprises to a private Singaporean entity controlled by Vinod Adani, without disclosure of the related party nature of these deals. Once on the books of the private entity, the assets were almost immediately impaired, likely helping the public entity avoid a material write-down and negative impact to net income.\n    \n&gt; Adani Group’s obvious accounting irregularities and sketchy dealings seem to be enabled by virtually non-existent financial controls. Listed Adani companies have seen sustained turnover in the Chief Financial Officer role. For example, Adani Enterprises has had 5 chief financial officers over the course of 8 years, a key red flag indicating potential accounting issues.\n    \n&gt; The independent auditor for Adani Enterprises and Adani Total Gas is a tiny firm called Shah Dhandharia. Shah Dhandharia seems to have no current website. Historical archives of its website show that it had only 4 partners and 11 employees. Records show it pays INR 32,000 (U.S. $435 in 2021) in monthly office rent. The only other listed entity we found that it audits has a market capitalization of about INR 640 million (U.S. $7.8 million).\n    \n&gt; Shah Dhandharia hardly seems capable of complex audit work. Adani Enterprises alone has 156 subsidiaries and many more joint ventures and affiliates, for example. Further, Adani’s 7 key listed entities collectively have 578 subsidiaries and have engaged in a total of 6,025 separate related-party transactions in fiscal year 2022 alone, per BSE disclosures.\n    \n&gt; The audit partners at Shah Dhandharia who respectively signed off on Adani Enterprises and Adani Total Gas’ annual audits were as young as 24 and 23 years old when they began approving the audits. They were essentially fresh out of school, hardly in a position to scrutinize and hold to account the financials of some of the largest companies in the country, run by one of its most powerful individuals.\n    \n&gt; Gautam Adani has claimed in an interview to “have a very open mind towards criticism…Every criticism gives me an opportunity to improve myself.” Despite these claims, Adani has repeatedly sought to have critical journalists or commentators jailed or silenced through litigation, using his immense power to pressure the government and regulators to pursue those who question him.\n    \n&gt; We believe the Adani Group has been able to operate a large, flagrant fraud in broad daylight in large part because investors, journalists, citizens and even politicians have been afraid to speak out for fear of reprisal.\n    \n&gt; We have included 88 questions in the conclusion of our report. If Gautam Adani truly embraces transparency, as he claims, they should be easy questions to answer. We look forward to Adani’s response.\n\n&gt; *Initial Disclosure: After extensive research, we have taken a short position in Adani Group Companies through U.S.-traded bonds and non-Indian-traded derivative instruments. This report relates solely to the valuation of securities traded outside of India. This report does not constitute a recommendation on securities. This report represents our opinion and investigative commentary, and we encourage every reader to do their own due diligence. Please see our full disclaimer at the bottom of the report.*",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 760,
    "downs": 0,
    "created_utc": 1674619619.0,
    "media": null,
    "is_video": false,
    "num_comments": 186,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Shares a summarized investigative report with implications about Adani; explains the issue.",
    "composite_score": 4.729805460038822
  },
  {
    "score": 696,
    "title": "Ask Me Anything about investing in Mutual Funds",
    "selftext": "Hi Everyone!\n\nI am **Santosh Navlani**, **COO**, **ET Money**, one of India's largest wealth tech apps offering access to no-commission Direct Mutual Funds, NPS, Fixed Deposits, Term &amp; Life Insurance.\n\nWe also are India's largest Registered Investment Advisor for retail investors &amp; offer Investment Advisory service called ET Money Genius.\n\nI am here today to **answer all your questions related to investments in mutual fund**, possibly one of the best way to participate in India's growth story &amp; create wealth in the process.\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\nI want to express my gratitude to everyone who participated in this AMA. The level of engagement here has truly overwhelmed me. :-)\n\nIf you have any more questions in the future, feel free to email them to [help@etmoney.com](mailto:help@etmoney.com).\n\nAlternatively, you can **connect with me on LinkedIn** \\- [https://www.linkedin.com/in/santoshnavlani/](https://www.linkedin.com/in/santoshnavlani/)\n\nSigning off for today, a big thank you to u/ppatra (MOD) for giving me this wonderful opportunity.\n\nI wish you all the best for your investment journey!\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lcpixig2vx9b1.png?width=1000&amp;format=png&amp;auto=webp&amp;s=5267c590b1a7e1e1bfe1eafb992ce1b64b70ed5c",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 696,
    "downs": 0,
    "created_utc": 1688470207.0,
    "media": null,
    "is_video": false,
    "num_comments": 260,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Announcement of an AMA; minimal substantive content.",
    "composite_score": 4.77155303176715
  },
  {
    "score": 641,
    "title": "Gentle reminder that Gold has outperformed Nifty 50 over last 7-8 years (!)",
    "selftext": "That is all. Just realized my entire career has so far been about 8 years, I graduated in 2016.\n\nI think back to when I made the first bit of money to all the years of tedious research and optimization I had done compared to those that I was really prejudiced against that simply dump their money in jewelry and real estate - and I have to wonder, what was it all for?\n\nThe difference is not the big in returns, although there is a big difference in volatility with gold just about never going down.\n\nWonder how you guys think about this? That with even all the top influencers and \"best practices\" and e.g. putting it in index/ETF and not touching it, last 8 years Gold beat equities.\n\nThis is really making me rethink about how equities and company stocks and really everything works.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 641,
    "downs": 0,
    "created_utc": 1739205214.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal musing with a question; no clear actionable content or model.",
    "composite_score": 4.483848573714074
  },
  {
    "score": 591,
    "title": "Hey r/IndiaInvestments! I’m Ashish Kashyap, founder and CEO of INDmoney. I’m here for the Reddit AMA about the INDmoney app. Let’s discuss investments in Indian and US markets, and what it takes to build an all-in-one finance app for India amidst the country’s largest retail investment boom.",
    "selftext": "https://preview.redd.it/jfyo04gn593e1.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=e81284df4704a6504a6ff3c3ce70dede02b9ce01\n\nHi, I’m Ashish Kashyap, Founder of INDmoney. I’m here to chat about investing in Indian and US stock markets, personal finance, and the journey of building India’s SuperMoneyApp. At INDmoney, we’re empowering Indians to invest, trade, and manage their entire net worth seamlessly on one app.  \n  \nBefore INDmoney, I had the privilege of founding the travel giant ibibo Group—so if you’ve ever booked a ticket on Goibibo or taken a redBus ride, you’ve experienced a part of that journey. I also founded PayU India (ibibo Pay), a leading fintech payments platform, and was Google India’s first Country Head.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 591,
    "downs": 0,
    "created_utc": 1732629731.0,
    "media": null,
    "is_video": false,
    "num_comments": 336,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "AMA introduction with bio; announcement rather than substantive content.",
    "composite_score": 4.74863665715859
  },
  {
    "score": 552,
    "title": "Adani suspected of fraud by selling low-grade coal as high-value fuel",
    "selftext": "The Financial Times article reveals that Adani Group allegedly engaged in fraudulent practices by passing off low-quality coal as high-grade fuel to an Indian state power utility, Tangedco. Documents obtained by the Organized Crime and Corruption Reporting Project (OCCRP) and reviewed by FT indicate that Adani bought low-calorie coal from Indonesia and sold it to Tangedco at inflated prices, falsely claiming it was high-calorie coal. This practice likely led to substantial profits for Adani while contributing to air pollution due to the burning of low-grade coal. \n \nInvoices from January 2014 show Adani purchased coal with a calorific value of 3,500 calories per kilogram and sold it to Tangedco as 6,000-calorie coal, doubling its money after transport costs. Further documentation shows a pattern of similar transactions for 1.5 million tonnes of coal in 2014. Adani's activities align with a broader trend of coal price inflation involving offshore intermediaries to inflate prices supplied to utilities, which has been under investigation by India’s Directorate of Revenue Intelligence (DRI) since 2016. \n \nThe article highlights significant environmental and health impacts, noting that coal-fired power plants contribute heavily to air pollution in India, which is linked to over 2 million deaths annually. The revelations come amid Adani's efforts to pivot towards renewable energy, despite remaining one of India's largest coal importers. \n \nThe findings are expected to fuel political debates in India regarding the influence of wealthy business figures like Gautam Adani, especially during the election campaign for Prime Minister Narendra Modi's third term. Despite allegations and investigations, Adani denies wrongdoing, claiming rigorous independent testing verified the coal quality. \n \nThe controversy underscores systemic issues in India's coal supply chain, with claims of widespread fraud and inadequate regulation leading to inflated costs for utilities and consumers. An NGO, Arappor Iyakkam, has also highlighted these issues, estimating significant financial losses for Tangedco due to overpriced coal purchases, half of which involved Adani. The DRI's ongoing probe and historical reports raise concerns about the transparency and fairness of coal tender processes in India.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 552,
    "downs": 0,
    "created_utc": 1716352162.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Summarizes investigative reporting on Adani; presents claims and context.",
    "composite_score": 4.377755763000549
  },
  {
    "score": 508,
    "title": "I found this solid PPF advice and want to share with this community",
    "selftext": "💰 One of the Best Financial Moves You Can Make in Your 20s\n\nOpen a PPF (Public Provident Fund) account the moment you land your first job.\n\nEven if you’re not ready to invest big, just contribute the minimum ₹500 per year. That tiny effort starts the 15-year lock-in clock without straining your wallet.\n\nFast-forward a few years:\nYou’re earning more, you’re looking for tax-saving options, and boom — your PPF account is already 5–7 years closer to maturity. That means quicker access to a fully tax-free, government-backed corpus.\n\n✅ Safe returns\n\n✅ Full tax exemption (EEE status)\n\n✅ Great for long-term goals (retirement, home, kids' education)\n\nIt’s one of those silent wealth-building hacks that pays off big if you start early.\n\n",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 508,
    "downs": 0,
    "created_utc": 1751738699.0,
    "media": null,
    "is_video": false,
    "num_comments": 180,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Offers actionable PPF tips in a short bullet-style list.",
    "composite_score": 4.548057069771351
  },
  {
    "score": 509,
    "title": "Hello r/IndiaInvestments, I am Vishal Jain, CEO of Zerodha Fund House. Ask me Anything on Index Funds and ETFs.",
    "selftext": "Hello r/IndiaInvestments , I am Vishal Jain. I have over 25 years of experience in financial services building Index Funds and ETFs.\n\nI was part of the team that launched India’s first ETF in 2001 - Nifty BeES. Later in my career, as the Head of the ETF business of a major AMC, I scaled the Passive business from Rs.7,500 crore to Rs.55,000 crore. I am also part of multiple committees relating to the development of passive products in India. I was part of the “Working Group on Passive Funds” constituted by SEBI to recommend changes in Regulations and Market Infrastructure to foster the growth of ETFs and Index Funds.\n\nI strongly feel that a lot can be done when it comes to educating everyone about the power of index funds and ETFs. This is me doing my bit - Ask me Anything about Index Funds and ETFs and I will answer as many questions as I can.\n\nProof: [https://x.com/vishaljain2510/status/1818505417011466423](https://x.com/vishaljain2510/status/1818505417011466423)\n\n*Disclaimer: The Information provided during this Ask me Anything (AMA session is for general knowledge and informational purposes only and does not constitute financial advice.)* \n\n*Investing in mutual funds and other financial products involves risk, including the potential loss of principal. Past performance is not indicative of future results. Before making any investment decisions, investors should conduct their own research and seek advice from qualified financial advisors to ensure that the respective products and strategies are suitable for their specific financial situation and objectives.*",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 509,
    "downs": 0,
    "created_utc": 1722400096.0,
    "media": null,
    "is_video": false,
    "num_comments": 244,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "AMA-style introduction; lacks substantive content for classification.",
    "composite_score": 4.622153218280203
  },
  {
    "score": 478,
    "title": "Adani is accused of fraud, but we all knew something was wrong, so why did the stock price fall? And why did Adani force his FPO through only to cancel it and return money? An easy-to-understand read",
    "selftext": "Here's the link: [https://boringmoney.substack.com/p/adani-fraud-fpo-success-cancel](https://boringmoney.substack.com/p/adani-fraud-fpo-success-cancel)\n\nSummary:\n\n1. Adani's stock price first fell, not because of the fraud accusations (that's something we knew) but because of specific fraud accusations that show that he defrauded his investors (not just the government or banks!)\n2. Adani's FPO was successful even though the market price of Adani shares was below the FPO price. This is bizarre from an efficient markets point of view. But it made total sense when seen in the context of Adani's billionaire friends buying his stock. It was a prestige issue, after all\n3. But then the share price of Adani Enterprise fell *too* much. If the price fell lower than 50% of the FPO price, those investors in the future would face the same decision of investing in an overpriced stock all over again or losing 100% of their initial investment. Because the FPO issued partly-paid shares that could be called for more money at a later stage\n\nI tried posting my whole article here (I don't like posting summaries) but unfortunately auto-mod didn't let it through because of length. The summary above doesn't do justice to the article, so do visit and check it out.\n\nEDIT - I've also added an article voiceover on the same link for those who would like to listen to it. It is AI-generated though, so don't go with too high of an expectation.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 478,
    "downs": 0,
    "created_utc": 1675320356.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Post presents a 3-item summarized list of analysis points.",
    "composite_score": 4.367229427087341
  },
  {
    "score": 473,
    "title": "Will you still buy real estate after removing indexation benefits?",
    "selftext": "https://x.com/prosper_haven/status/1815713621684687034?t=OfUc-riN6WFZYgWmBwW8Sw&amp;s=19\nProperty bought for 36L in 2009 and if he sells today the max value is 60L. With indexation it's value is 88L i.e. -28L loss which he can carry but now he has to pay 12.5% tax on 24l for loss making property.\n\nThis tweet shows how much indexation benefits helped in justifying buying real estate which had always lower returns.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 473,
    "downs": 0,
    "created_utc": 1721737640.0,
    "media": null,
    "is_video": false,
    "num_comments": 303,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Central claim about indexation benefits and reasoning with examples.",
    "composite_score": 4.652215133478462
  },
  {
    "score": 466,
    "title": "I found out today that real estate has a CAGR of 18-19% in India. ",
    "selftext": "We all know that the general advice is to invest in equities/debts, etc. Real estate is not as highly recommended as these two. I have all my money in FD and mutual funds. \n\nToday, I found out that my father's one plot (no houses built, just land) has grown with 18.7% cagr(1996, 40k then, 43 lacs now after 28 years)  in the last 28 years. Another grew with 19.1%(1.2 lacs in 2010, 15 lacs now) cagr in the last 14 years. And these two are not in any tier 1 cities or something. These are in normal towns (municipalities). \n\nI feel like unless I want the liquidity, I should pump all my money into real estate ? I haven't heard of any other instruments growing  at 19% cagr for such an extended period of time. They say even Warren Buffet couldn't realise 15% annual growth for 30 years and that if you can, then forbes will take interviews of you. Well, here it is!! 18% for 28 years. \n\nEconomic Times says real estate in india is poised to grow at 18.7% cagr from 2020 to 2030. \n\nThen why isn't it talked about as much? I mean, with these growth figures, finance bros should be talking about nothing but real estate.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 466,
    "downs": 0,
    "created_utc": 1712904177.0,
    "media": null,
    "is_video": false,
    "num_comments": 265,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Personal analysis with CAGR data explaining why real estate may be attractive.",
    "composite_score": 4.556757698881646
  },
  {
    "score": 439,
    "title": "How Credit card alters your psche and punches hole in your finances",
    "selftext": "I was in impression that using credit card is discipline because never defaulted any payments. Payed everything on time with discipline. But I realized my mistake when looked at my spending behaviour. I realized that last seven months spent was total 1.4 L and on an average spend per month was 23K ! Which is about  30-40% of monthly household spend. This is too much for me. (Might not relevant for others though)\n\nhttps://preview.redd.it/np77gblbndgd1.png?width=497&amp;format=png&amp;auto=webp&amp;s=8c1fafa4a8b0bd6ec3c8a1523e41496013488e80\n\nI am very disciplined when it comes to buying things on credit. But strongly feel that credit card has altered my behaviour. From Frugal Hands to Casual hands. On analysing myself found that I say less NO to expenditures. I was in false impression that I was being discipline. Although my counscious mind knew I dont buy anything big, but sub-counscious mind was additicted to this harmful habbit of lose hands. I want to get rid of this now!  Now I know why companies insist on credit card !   \n\nIf I were to live on pure debit, I would be more cautious where I spend which ultimately get ingraved in behavior to reduce expenditure. Also, tried to find the cause. I was being stupid to believe finfluencers saying that paying credit card dues on time is good enough caution/discipline. But it is NOT! \n\n***Credit card alters the psyche, even for most disciplined ones, hence its a powerful instruments for that reason for companies.*** \n\nEdit: CC itself is not bad (emergency credit) but now i am convinced cc is a strategic business that targets the psyche. ✅✅ my brain first looks at CC limit not how much cost accumulated. And think \"its ok, i can manage as long it doesn't goes off limit\" instead my brain should have looked at the accumulated bill each time and prospect impact on my savings.\n\nAlso my brain automatically assumes that by buying i am not doing bad spending because I am rewarded by cashbacks so it feels all my spends are good spends.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 439,
    "downs": 0,
    "created_utc": 1722660357.0,
    "media": null,
    "is_video": false,
    "num_comments": 106,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Explains how credit cards alter spending behavior with supporting observations.",
    "composite_score": 4.363144565328792
  },
  {
    "score": 432,
    "title": "USD INR Relationship (for people interesting in understanding the concept rather than falling in propaganda)",
    "selftext": "USD INR is artificially maintained as if it's too lucrative, US Government will put pressure on India\n\nWhen we look at the return rate offered by the Reserve Bank of India (RBI) and the U.S. Federal Reserve (Fed), we notice that RBI offers a higher rate (6.5%) compared to the long-term average rate offered by the Fed (around 2%). This difference is attractive because an investor in the U.S. could potentially invest in India and earn a higher return.\n\nHowever, the value of the Indian Rupee compared to the U.S. Dollar usually depreciates over time, which means that over the long run, the Rupee loses value against the Dollar. This depreciation reduces the effective return that a U.S. investor would earn from investing in Indian assets.\n\nIn the past decade:\n\n• From 2004 to 2014, the Rupee depreciated against the Dollar by about 3.89% annually.\n\n• From 2014 to 2024, it depreciated by approximately 3.95% annually.\n\nIf this depreciation rate continues, it eats into the 6.5% return. For example, if an investor makes 6.5% in INR but loses 3.95% due to Rupee depreciation, the effective return becomes closer to 2.55%.\n\nNow, if the Rupee were stable (meaning it didn’t depreciate), then investing in India would yield the full 6.5%, making it more attractive than the 2% return in the U.S., making it a “no-brainer” for investors to choose the Indian investment over the U.S.\n\n\\------------------------\n\nHere are key inflection points in the USD/INR exchange rate history, along with the primary reasons for these shifts:\n\n1. 1947-1966 (Fixed Rate at INR 4.76/USD):\n\n• Reason: At independence, the Indian Rupee was pegged to the British Pound, effectively keeping it stable against the USD. India’s economic policy favored a controlled, closed economy.\n\n2. 1966 (INR 6.36/USD):\n\n• Event: Major devaluation.\n\n• Reason: Following economic pressure, high fiscal deficits, and reduced foreign exchange reserves, the government devalued the Rupee by 36.5% to attract foreign capital and promote exports.\n\n3. 1991 (INR 17.90/USD):\n\n• Event: Economic liberalization and devaluation.\n\n• Reason: India faced a severe balance-of-payments crisis, leading to reforms that opened up the economy. To stabilize, India devalued the Rupee, starting a gradual move toward a market-determined exchange rate system.\n\n4. 1993-1995 (Approx. INR 31/USD):\n\n• Event: Full float of the Rupee.\n\n• Reason: The Reserve Bank of India (RBI) allowed the Rupee to float in 1993, leading to a market-driven rate based on demand and supply. This marked a shift to a liberalized economy.\n\n5. 2008-2009 (From INR 43.51/USD to INR 48.41/USD):\n\n• Event: Global financial crisis.\n\n• Reason: Capital outflows and reduced foreign investments due to global recessionary conditions led to depreciation. A stronger USD due to safe-haven demand also impacted the Rupee.\n\n6. 2012-2013 (From INR 53.44/USD to INR 58.62/USD):\n\n• Event: Taper tantrum and fiscal concerns.\n\n• Reason: The U.S. Federal Reserve signaled a potential slowdown of its quantitative easing program, causing massive capital outflows from emerging markets like India, which further weakened the Rupee.\n\n7. 2020 (INR 74.10/USD):\n\n• Event: COVID-19 pandemic.\n\n• Reason: The economic impact of COVID-19 led to reduced exports, demand contraction, and capital outflows, weakening the Rupee. Additionally, low global demand hit India’s foreign exchange inflows.\n\n8. 2022-2023 (From INR 77.19/USD to INR 82.00/USD):\n\n• Event: Post-pandemic inflation and U.S. interest rate hikes.\n\n• Reason: High inflation led the U.S. Fed to raise interest rates, making the USD stronger globally. Combined with higher import costs and trade deficits, this pushed the Rupee to historic lows.\n\nThese inflection points highlight how global economic shifts, local fiscal policies, and market liberalization have significantly impacted the INR’s value over the years.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 432,
    "downs": 0,
    "created_utc": 1731351533.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Educational explanation of currency returns and depreciation with data.",
    "composite_score": 4.25207788334531
  },
  {
    "score": 430,
    "title": "Sinking Fund - an important overlooked factor in apartment purchase in Bangalore city ",
    "selftext": "Bangalore Apartment costs have increased disproportionate to the basic infrastructure and job opportunities. A lot of this is inflated costs meant to prey on the financially non-literate and vulnerable.\n\nIf you are buying a new apartment, make sure it is through RERA and make sure you know about National Building Code and fire requirements and do a thorough inspection before making a purchase.\n\nFor those who think they can save costs by purchasing an older apartment built 10 or 20 years ago, you may not be saving much at all. There are two costs you have to bear in mind - the cost of acquisition and the cost of ownership. Cost of acquisition is what you pay to acquire the apartment. The cost of ownership is often not considered when making such purchases.\n\nAs an example, Maharashtra state has a proper structure and set of rules for collection of Maintenance and Sinking Fund, and a proper body to oversee such collections and resolve disputes. Bangalore has nothing like that. Most older apartments are registered under KAOA Act 1972, if at all, and do not have any registrar to oversee anything. This has led to much misuse of funds over the years in many places.\n\nSinking Fund is collected for emergency purposes and is a long-term savings for an apartment. Any apartment that is 10+ or 20+ years should have a substantial Sinking Fund amount in their reserves. As a buyer, you should ask the owner of the apartment how much money is against his apartment in the Sinking Fund. If the amount is very low &lt; 1-5 lakhs (depending on the apartment complex), ask where the money has been spent over the years. If the Sinking Fund amount is low, your cost of ownership will be high, and your contribution to fixing the apartment will drain your pocket. Maharashtra has limits on how much % Sinking Fund can increase every year. Bangalore does not. One day, for any emergency, you can incur a huge bill which you will be forced to pay, especially for leakage or structural damage due to rains.\n\nSome apartments have recklessly used up Sinking Fund money to purchase new objects or develop the property. This has been in vain because no old property in Bangalore has been transferred legally in ownership from the builder to the Association. The residents own the apartments, but the land is still in the name of the builder. There is no benefit in using Association Funds to develop such properties.\n\nThe city is now run by tanker water mafia during the summer. Without emergency savings, more money will be spent by apartment owners for basic necessities. Buying a new apartment is not any better. Sometimes, they don't even have Cauvery water connection and have been on tanker water from day 1.\n\nPlease ask about Sinking Fund before purchasing any older apartments and ask for a list of items Sinking Fund has been spent on over the past 5-10 years. Every apartment should be given a personalized bill for their apartment with a list of spending. This will ensure security for those who purchase an apartment. Many people are spending their life savings on purchasing apartments without thinking and will end up with more debt even after the loan is paid.\n\nFor those who are selling, if you have a good amount against your apartment Sinking Fund, that is also a plus point during sale and re-sale. You should advertise this to buyers for sure. After all, it is your individual contribution towards a nontransferable savings amount.\n\nIf the Sinking Fund is large, you can get fair value for your apartment while selling. If the Sinking Fund is low, the buyer gets the advantage since it means bigger cost of ownership in the future for them.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 430,
    "downs": 0,
    "created_utc": 1736402117.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Advisory piece with guidance on sinking funds and costs when buying apartments.",
    "composite_score": 4.191203608403826
  },
  {
    "score": 414,
    "title": "Hello r/IndiaInvestments, I am Vishal Jain, CEO of Zerodha Fund House. Ask me Anything on Gold as an Asset Class.\n",
    "selftext": "Hello r/IndiaInvestments,\n\nI am Vishal Jain. I have over 25 years of experience in financial services building Index Funds and ETFs.\n\nI was also part of the team that launched India’s first Gold ETF in 2007 - GoldBeES. In India, there has always been a deep-rooted affinity for physical gold, whether for **consumption** or **investment**. However, I believe that in the coming years, the investment demand for gold will increasingly shift towards mutual fund products like **Gold ETFs** and **FoFs** due to their ease, efficiency and transparency.\n\nThis indicates significant potential for growth in gold investments via the mutual fund format. However, there's still much work to be done in terms of educating investors about these products—and that’s where I aim to assist.\n\nFeel free to ask me anything about **Gold as an Asset Class**!\n\n*The Information provided during this Ask me Anything (AMA) session is for general knowledge and informational purposes only and does not constitute financial advice.* \n\n*Investing in mutual funds and other financial products involves risk, including the potential loss of principal. Past performance is not indicative of future results. Before making any investment decisions, investors should conduct their own research and seek advice from qualified financial advisors to ensure that the respective products and strategies are suitable for their specific financial situation and objectives.*",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 414,
    "downs": 0,
    "created_utc": 1730178576.0,
    "media": null,
    "is_video": false,
    "num_comments": 207,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.45,
    "category_rationale": "AMA announcement; lacks substantive content to classify as other categories.",
    "composite_score": 4.467079764193474
  },
  {
    "score": 381,
    "title": "SEBI prefers investigating Hindenburg for insider trading instead of Adani for fraud",
    "selftext": "*Original Source:* [*https://boringmoney.in/p/sebi-prefers-investigating-hindenburg*](https://boringmoney.in/p/sebi-prefers-investigating-hindenburg) *(my newsletter Boring Money -- if you like what you read, do visit the original link to subscribe and receive future posts directly in your inbox)*\n\n*--*\n\nThe basic idea of insider trading is that if you’re an employee at a publicly listed company and you know stuff about the company that can move its stock price up or down, you cannot trade the company’s shares with that information.\n\nIt’s a straightforward idea but it gets complicated quickly. If you don’t trade the stock, but your wife does, it’s still insider trading. If your wife doesn’t, but her father does, hmm, it [might not be insider trading](https://boringmoney.in/p/mcdowells-insider-insider-trading). If none of you do, but a rando that overhears you at a restaurant does, don’t hold me to it, but I’d guess that it’s not insider trading either.\n\nThis particular complication is about how separated the trader is from the insider. If the person trading the stock is reasonably separated from the company insider, it might not be insider trading. (Not legal advice!)\n\nBut! The only reason being a company insider is relevant is because it comes with the assumption that you have non-public information. You could have non-public information anyway! Maybe you work at a regulator and you’re writing up some rules. Or you work at a company that’s a vendor to a listed company and figure that it isn’t buying as much from you anymore. If you’re in any of these positions and you trade the company’s shares, it’s probably \\[1\\] insider trading.\n\nLet’s extend this idea a little bit. You’re a short seller with a reputation. Any stock that you write about goes down, more so because you’ve written about it. Of course, you make sure to disclose that you’re short on a stock and that you’ll make money if it goes down. But you’re well aware that your research report will push the price down. Are you insider trading? SEBI seems to think so.\n\n&gt;The Hindenburg Report could reasonably be expected to have a significant impact on the price of the Adani Group securities upon publication, due to its overall nature and the reputation of Hindenburg as an activist short seller. The scheme of profiting from advance knowledge regarding release of the Hindenburg Report was further facilitated by making certain sensational or misleading statements in the Report to maximize its negative impact. Due to the global reach of a research report published online and disseminated to all investors at once, the impact was maximized by publishing the Report just before AEL's FPO.\n\nLast year Hindenburg Research published a report which accused Adani of fraud. Hindenburg is a short-seller, it’s in the business of figuring out which company is doing some fraud or is just overvalued, and shorting it. But also essential for the short-seller is to tell the world that it has shorted the stock. SEBI sent Hindenburg a show cause notice and Hindenburg made the entire notice public out of spite—that’s where I’ve quoted SEBI from.\n\nSEBI says that Hindenburg knew that when its report went out, Adani stock would go down. (Well, of course, that was the point.) But because Hindenburg knew that its reputation as a short-seller would have that effect on Adani companies, the knowledge of Hindenburg publishing a report itself was non-public information. No matter the facts of the report, Hindenburg knew that it possessed non-public information—the date and time of publishing its own report—so it couldn’t trade with that information.\n\n# Disclaimers, disclosures\n\nSEBI was supposed to be investigating Hindenburg’s accusations of fraud against Adani. It ended up investigating Hindenburg itself instead. Here are SEBI’s findings: \\[2\\]\n\n1. A couple of months before Hindenburg published its report, it shared a draft with an American hedge fund called Kingdon Capital.\n2. Kingdon would be the one shorting Adani stock, not Hindenburg. But Hindenburg would get 25% of the profit Kingdon made from the trade.\n3. Kingdom then went to Kotak Bank’s international arm and got itself a Mauritius-based foreign fund which was authorised to invest in the Indian markets.\n4. Hindenburg published its report! Kingdon make about $22 million in profit of which $5.5 million went to Hindenburg. \\[3\\]\n\nAt the end of Hindenburg’s report last year was a disclosure:\n\n&gt;We Are Short Adani Group Through U.S.-Traded Bonds And Non-Indian-Traded Derivative Instruments.\n\nThis disclosure threw people off! Adani companies were listed in India. Their stock prices were falling in India. How was Hindenburg shorting the companies outside India? One [Financial Times](https://www.ft.com/content/6a8a5548-0927-41e4-9818-1eb25c72d96f) report at the time suggested that Hindenburg could be using derivatives in Singapore, but was light on specifics.\n\nYeah, we know now that all of that was BS. Hindenburg disclosed that it wasn’t itself trading any “Indian-traded derivative instruments”, but it had just partnered with a fund that was. If SEBI didn’t like that Hindenburg was making money trading on the back of its own report, it really did not like that Hindenburg traded Indian derivatives via a proxy. From SEBI’s notice:\n\n&gt;It was observed that the specific disclaimer that Hindenburg held positions only through non-Indian traded securities was misleading since it concealed the complete extent of its financial interest in companies which were the subject of its research report, due to Hindenburg's direct stake in profits from positions taken by the FPI in the futures of AEL on the Indian stock exchanges, as part of a scheme involving Hindenburg and Kingdon entities.\n\nSEBI sort of has a point, until you read this:\n\n&gt;With respect to the general disclaimer regarding assumption of short position, placed towards the middle of the legal disclaimer, it was observed that it was a standard format disclosure contained in most of Hindenburg's published short Reports. This general disclaimer contradicted the specific disclaimer made regarding Hindenburg holding short positions in Adani Group Companies through U.S.-traded bonds and non-Indian-traded derivatives, along with other non-Indian traded reference securities.\n\nHindenburg had two disclosures in its report on Adani. The first one was the one I shared earlier, which said that it was not trading any India-listed derivatives. The second one was a general disclosure which said that Hindenburg, its partners, consultants, etc. could all be assumed to be short Adani and stood to make a lot of money if the stock price down.\n\nSo Hindenburg did disclose that someone could be short Adani in India? It just specifically didn’t disclose Hindenburg itself was going to split profits. SEBI apparently didn’t like that this was a “general” disclaimer that Hindenburg used across reports and not written out specifically for the Adani report. Sure, that makes a lot of sense.\n\nThe specifics of the disclosures aside, we’ve all known that Hindenburg was short Adani. That was always the point! SEBI has other plans. Here’s a snippet from SEBI’s [research analyst regulations](https://www.sebi.gov.in/legal/regulations/aug-2021/securities-and-exchange-board-of-india-research-analysts-regulations-2014-last-amended-on-august-03-2021-_34615.html) which it cites in its notice to Hindenburg: \\[4\\]\n\n&gt;Any person located outside India engaged in issuance of research report or research analysis in respect of securities listed or proposed to be listed on a stock exchange shall enter into an agreement with a research analyst or research entity registered under these regulations.\n\nUff, so this is the reason SEBI is being so anal about disclaimers!\n\n1. Hindenburg is not India-based but published a report about an India-traded stock. Going by SEBI’s regulations, it had to partner with a registered research analyst.\n2. Hindenburg didn’t partner with anyone. Instead it said it wasn’t trading any Indian derivatives and the report was about Adani’s US-traded bonds.\n3. But the hedge fund Kingdon was very much trading Indian derivatives, and Hindenburg had sold its report to it with an agreement to split Kingdon’s profits.\n4. So SEBI says Hindenburg’s report was indeed about Indian derivatives and it lied in its disclosures.\n\nWhy didn’t Hindenburg just partner with a research analyst? I don’t know. There are thousands of them, so it could have. Maybe it felt that it would be more trouble than it was worth. \\[5\\] But what would it have changed anyway? At best it’s a dumb technical violation, and even that’s not for certain.\n\nSEBI clearly just wants Hindenburg’s head.\n\n**Footnotes**\n\n\\[1\\] I say “probably” here but I really mean “almost certainly”. I leave some doubt because in the end this stuff is so subjective that everyone is constantly guessing.\n\n\\[2\\] SEBI’s investigation is based on information it sourced from the US securities regulator, the Securities and Exchange Commission, + an interview with Kingdon Capital.\n\n\\[3\\] Hindenburg has received only about [$4.1 million](https://hindenburgresearch.com/adani-update-sebi/#:~:text=~%244.1%20million%20in%20gross%20revenue) of this $5.5 million to-date. Kingdon apparently still has money in the Kotak fund which it has to get out.\n\n\\[4\\] I wonder what the rationale behind this regulation is. If there is a foreign entity publishing reports about Indian stocks, with zero presence in India, how is SEBI realistically going to stop them? I guess this is more so that Indian research analysts don’t think of registering abroad as a way around registering with SEBI.\n\n\\[5\\] Or maybe Hindenburg could foresee the harassment any Indian entity would’ve faced once the report was out.\n\n  \n*Original Source:* [*https://boringmoney.in/p/sebi-prefers-investigating-hindenburg*](https://boringmoney.in/p/sebi-prefers-investigating-hindenburg)",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 381,
    "downs": 0,
    "created_utc": 1720768266.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains insider trading concept and nuanced scenarios; educational.",
    "composite_score": 4.157500790747955
  },
  {
    "score": 376,
    "title": "Hello r/IndiaInvestments! We're Bloomberg equity reporters in Asia, Ask Us Anything about the year that was for the Indian stock market and what's in store for 2024.",
    "selftext": "Hi r/IndiaInvestments, \n\nWe are three equity reporters who spend our day tracking what's moving Indian and Asian markets. 2023 has been a record-breaking year with the Indian stock market hitting $4 trillion to become one of the biggest stock markets in the world. We're here to answer your questions on anything related to the markets in 2023 and what's in store for 2024. Ask us Anything!\n\nYou can sign up for our free to read India Edition newsletter [here](https://www.bloomberg.com/account/newsletters/india-edition) and follow our coverage [here](https://www.bloomberg.com/asia).\n\nProof: \n\nhttps://preview.redd.it/c3sywgdo3m7c1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=b6e05668ce8c287a759a44b677988a75b75977ac\n\nDisclaimer: All views of the reporters are their own. The AMA is not meant to be taken as an investment advice or a recommendation of any sort.\n\nedit: That’s a wrap! Thanks for all your questions!",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 376,
    "downs": 0,
    "created_utc": 1703148888.0,
    "media": null,
    "is_video": false,
    "num_comments": 161,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.45,
    "category_rationale": "AMA announcement; no substantive post content to classify as other categories.",
    "composite_score": 4.371098857477109
  },
  {
    "score": 368,
    "title": "There is now evidence that shows Adani invested in his own companies via Bermuda-based funds. A fun read that examines the report",
    "selftext": "*Original Source:* [*https://boringmoney.in/p/bermuda-funds-adani-invest*](https://boringmoney.in/p/bermuda-funds-adani-invest?utm_source=reddit&amp;utm_medium=social&amp;utm_campaign=adani+bermuda+funds) *(newsletter Boring Money)*\n\n\\---\n\nAdani Group is a multinational conglomerate comprising a bunch of Adani companies, seven of which are publicly listed. Adani is controversial. There are some political reasons for this, which I probably don’t need to get into, but also because of some financial reasons. One big financial reason for his controversy is that Adani (the person) owns too much Adani (the companies) stock.\n\nI’ve [narrated this story before](https://boringmoney.in/p/adani-stocks-only-go-up). If you want to buy, say, 80 shares of a company, but if there are only 20 shares available in the market, you’re going to have to keep increasing the price you’re willing to pay for those additional 60 shares. Your hope is that if the price hits a certain sweet spot, there would be more sellers that show up. You hike the price you’re willing to pay, until there are sellers willing to sell. It's just the standard way any market works.\n\nIf you’re the company whose shares are listed on the market, one (illegal) way for you to push your stock price up is by just buying up all the shares available to be sold. If you own most of the shares, other buyers will show up, but there won’t be any stock to sell. So the buyers will offer more, and your stock price will go up so long as someone is motivated enough to bid.\n\nThis really has been the story of Adani Group all along. Officially, *legally,* Adani owned only about 75% of his companies, the maximum legal limit. But unofficially, *illegally,* the claim goes that he owned more than 90–95% of his companies using some Mauritius-based funds as proxy. Because of which Adani companies’ stock prices went up, up, up, more than 1500% in 5 years.\n\nThe deal with these Mauritius-based funds is that no one really knows who owns them. Everyone’s guessing. Anyway, [here’s the Financial Times](https://www.ft.com/content/8d46b435-9725-46d4-80be-2cb3e276c4c9) last week filling in some blanks and giving us some names:\n\n&gt;From the outside, the Global Opportunities Fund in Bermuda looked like any regular investment fund: broad, bland, and uncontroversial.  \n&gt;  \n&gt;On the inside, however, two men were using the fund for a specific purpose — to amass and trade large positions in shares of the Adani Group, one of the biggest and most politically connected private conglomerates in India.  \n&gt;  \n&gt;The two men — Nasser Ali Shaban Ahli from the United Arab Emirates and Chang Chung-Ling from Taiwan — are associates of Vinod Adani, brother of the conglomerate’s founder Gautam. Their investments were overseen by a Vinod Adani employee, raising questions over whether they were front men used to bypass rules for Indian companies that prevent share price manipulation.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 368,
    "downs": 0,
    "created_utc": 1693983327.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Presents analysis of Adani-related funds and market manipulation; explanatory.",
    "composite_score": 4.031283336098004
  },
  {
    "score": 358,
    "title": "My journey of prepaying home loan - 2020-2023",
    "selftext": "In Feb 2019, I took a home loan of 30 lakhs at an interest rate of 8.95% for a period of 25 years (300 months) from HDFC.\n\nThis meant I would end up paying a whopping 44 lakhs as interest on the 30 lakh loan. That's 74 lakhs, a staggering amount that a lot of borrowers do not take into account even while applying for the loan. The meagre tax break on home loan doesn't even begin to compensate this hefty interest outgo, despite annualized.\n\nAnyway, I decided to prepay and fast.\n\n\\---\n\nThe initial EMI was roughly 25,000, which is also the base rate (meaning I can increase the EMI but not reduce it below this figure). I had been paying only the EMI till Nov 2020, when I researched and found out that HDFC's running rate at that time was a shallow 6.95%.\n\nCriminally, HDFC had only lowered my rate to 8.30%. It is only after I requested that they actioned the running rate on my account. I paid a one-time fee of 2.950 for the rate change.\n\nIn Nov 2020, before the rate was slashed, here's how the loan figures looked like:\n\n* Principal outstanding: **29.2 lakhs**\n* Total EMI amount paid: **5.5 lakhs**\n   * Total interest component: **4.7 lakhs**\n   * Total principal component: **80,000**\n\nJust take a moment to go over these figures to understand that even after paying \\~22 EMIs of 25,000 each, the principal outstanding had lowered by a meagre 80,000. That's less than 4,000 per EMI towards principal. This is the evil point of any borrowing.\n\n\\---\n\nThanks to my own research, I began prepaying and continuously applying to reduce the interest rate. This is what transpired from Nov 2020 till the end of 2022:\n\n* Total prepaid amount: **8 lakhs** (including the PMAY subsidy of roughly 2.7 lakhs)\n* Rate was back to 8.50% now\n* Total rate reduction fee paid to HDFC: **4,500**\n* Principal outstanding: **16 lakhs**\n* Total EMI amount paid: **16.8 lakhs** (including prepayments)\n   * Total interest component: **3.5 lakhs**\n   * Total principal component: **13.2 lakhs**\n* New adjusted EMI: **44,000**\n\nCompare this with the above figures and you'll realize that prepayments (which I always insisted to the lender as being adjusted against the principal) had reduced my outstanding drastically. From 29.2 lakhs to 16 lakhs in a matter of 2 years. Here, the entire 8 lakhs prepaid went against the principal. Not to mention the rate reduction helped a larger outgo from the EMI towards the principal.\n\n\\---\n\nNow for the 2023 part, the main point of this post. This year I did not make many prepayments, but I lowered my interest rate 4 times. This helped me stay within my comfort borrowing area because even though NHB (RBI's equivalent for HDFC before the merger) began raising the rates like it was the end of the world, my loan account stayed safe.\n\nHere's what's happened between Jan-Dec 2023:\n\n* Total prepaid amount: **1 lakh**\n* Rate reduced from 8.5% to 8.35% (across 4 times; partly possible due to 750+ CIBIL)\n* Total rate reduction fee paid to HDFC: **2,360**\n* Total EMI amount paid: **5.9 lakhs**\n   * Total interest component: **1.1 lakhs**\n   * Total principal component: **4.7 lakhs**\n* Principal outstanding: **11 lakhs**\n* New adjusted EMI: **38,500** (because after you have reduced a rate a specific number of times with HDFC, you cannot reduce your term. Instead, you must reduce your EMI)\n\n\\---\n\nThis whole exercise was to show how tracing your loan book using an amortization spreadsheet (see below) is critical to help you optimize your borrowing. So many of us take a loan and worry about paying timely EMIs. Even when we have surplus money, it's rarely earmarked towards loan prepayment. I'm not even getting into the prepayment vs equity investing debate because if you take a returns-based calculation, on theory, it may make sense to invest instead. My aim here was to reduce the overall interest outgo.\n\n[My amortization spreadsheet that I track monthly](https://preview.redd.it/ityvm2zdvl9c1.png?width=865&amp;format=png&amp;auto=webp&amp;s=287e84add4556d73ef27f2c75293a724e3a87557)\n\nThis exercise is for those folks who want to prepay, have the resources to prepay, and ultimately want to reduce debt as soon as possible. I plan to close down this loan by end of December 2024, which may or may not be possible. But I feel better than I was in December 2022 because:\n\n* Total loan taken: **30 lakhs**\n* Total EMI amount paid: **28.6 lakhs**\n   * Total interest component: **9.5 lakhs**\n   * Total principal component: **19 lakhs**\n* Principal outstanding: **11 lakhs**\n   * Total interest component forecast: **1.3 lakhs**\n\n**This means at the end of my loan, I would have paid a total interest of roughly 11 lakhs compared to the 44 lakhs had I paid only the EMI without prepayment and/or changing the loan rate.**\n\nLet RBI hike the rate as much as they want, but the fact that even a 10% rate won't take my debt dynamic beyond the staggering figures that appeared when I took the loan is what gives me a sound sleep his year end.\n\nI'll be coming back in Dec 2024 to show what has changed and if I was able to close my loan, so that I can go back to baser instincts and get another loan.\n\n\\---\n\nMay people have asked for it, so here's the amortization spreadsheet: [https://docs.google.com/spreadsheets/d/1HRL8uqNxS7uePpPmJR3Zshv6\\_rGyWLspZ464I3zkCkY/edit#gid=1](https://docs.google.com/spreadsheets/d/1HRL8uqNxS7uePpPmJR3Zshv6_rGyWLspZ464I3zkCkY/edit#gid=1)\n\nI'm not the owner. I happened to find this in this sub itself.",
    "subreddit": "IndiaInvestments",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 358,
    "downs": 0,
    "created_utc": 1704018767.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Explains how prepaying a home loan reduces total interest with supporting calculations and reasoning.",
    "composite_score": 4.220125080274169
  }
]