[
  {
    "score": 194,
    "title": "Join Our Food Simp Community: Calling All UGC Creators! 🍲",
    "selftext": "Hey everyone,\n\nAre you passionate about food and content creation? We're looking for talented UGC creators to join our community for Food Simp, a recipe app that helps people discover delicious recipes based on the ingredients they have at home.\n\nWhy Join Us?\n\n- Connect with fellow creators\n- Participate in exciting projects\n- Be part of our upcoming campaign\n\nJoin our Discord server to learn more about collaboration opportunities, pricing, and how you can get involved:\n\nhttps://discord.gg/5hDQEz8bjD\n\nLooking forward to seeing you there!\n\nBest, \nThe Food Simp Team",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 194,
    "downs": 0,
    "created_utc": 1728492237.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4550836313696465
  },
  {
    "score": 160,
    "title": "Paid an artist to wear our brand he only wore the cap, then we fought backstage.",
    "selftext": "I run a small streetwear label. Paid a semi-known artist (won’t name-drop) to wear our full outfit on stage — hoodie, tee, pants, cap. It was a simple promo deal: wear it, tag us, that’s it.\n\nHe agreed, took the clothes, got paid.\n\nShow night comes. He walks on stage wearing just the cap. No tag. No post. No shoutout. Nada.\n\nI followed up the next day, politely. No response. Tried again later — he finally replies with:\n\n“Bro relax, people saw the cap right?”\n\nAt that point, I was done. Ran into him at another event a week later — backstage, I confronted him. He brushed me off, laughed it off, said I was “acting like a manager or some sh*t.”\n\nTensions rose. Voices got louder. He shoved me. I shoved back. Next thing I know, it turned into a full-on scuffle — crew pulled us apart after like 10 chaotic seconds.\n\nNothing major, no punches landed (I think), no security involved, but still: Yes. I got into a fight with an artist over a cap. Yes, I regret it. But also: dude got paid. I expected the bare minimum.\n\nThat’s why I build [iKKipay.com](https://ikkipay.com) \niKKi holds the payment securely until you approve the content. You stay in control, they get paid when it’s right.\n\n⸻\n\nLesson learned: 1.\tNo more handshake collabs. \n2.\tContracts or it didn’t happen. \n3.\tA cap is not an outfit. \n4.\tKeep it professional \neven when the other person isn’t.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 160,
    "downs": 0,
    "created_utc": 1752145565.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8045072207789716
  },
  {
    "score": 153,
    "title": "Influencer Seeding made us $14K in 48 Hours",
    "selftext": "I launched a new product for my brand and was quite shocked with how well gifting influencers performed compared to a normal ads campaigns.\n\nInfluencers contacted - 3,200 emails sent (Used influencer database to find TikTok creators based in US with 12k-20k followers)\n\n\\- Response rate - **1,074**\n\n\\- Accepted product - **429**\n\n\\- Total video views received - **5,920,108** (TikTok defo did better than i imagined)\n\n\\- Total costs (including product cost + Outreach Tools) - **$5,392.80**\n\n\\- CPM: **$1.90** (Really good considering industry)\n\n**Overall summary:**\n\n\\- Micro Influencers reply way faster than Macro creators\n\n\\- Automate where you can using tools\n\n\\- Got a ton of UGC content we can recycle for our ads\n\n\\- Got a lot of useful feedback to improve product\n\nWas it worth it?\n\nDefo worth it but next time I’d probably get a VA to help manage it all tho. It’s a grind but if you reach out to enough influencers the odds are in your favor.\n\nFeel free to ask me any questions\n\n\nNote: I was inspired by another Redditor who posted their influencer marketing campaign on Reddit and thought as influencer seeding was working for them let me try it and to my surprise it went really well. Shoutout to that Redditor for the advice and also was inspired by their post layout!\n\n**EDIT: Didn't expect my campaign post to blow like this! A few people asking about how I reached out to influencers and if I used a database to find influencers.**\n\n# My setup (Free Apart from sending emails):\n\n\n\n**Sending emails to Influencers** \\- Instantly (instantly.ai - tbh can use your free gmail account if sending small amounts)\n\n**Sending Products to Influencers** \\- [Busterr](https://busterr.co) (can manually use google sheets if small scale gifting)\n\n**Finding Influencers email** \\- [Tiktok Creator Marketplace](https://creatormarketplace.tiktok.com) (Manually searching is better than expensive databases)\n\n  \nEverything I used was free apart from the sending email, tbh when I say free it took a quite a few days just to get 3200 emails and a database would have sped the process but it\\`s expensive and often outdated. \n\n\\* Remember even though your gifting products its still a cost (Product + Delivery) so finding the right influencers is cruital even if it takes time so would recommend do this manually! ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 153,
    "downs": 0,
    "created_utc": 1758838055.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.828686969052097
  },
  {
    "score": 148,
    "title": "Best Instagram Follower Bot recommendations that still work?",
    "selftext": "Hi all,\n\n Old automation tools used to work but now many get flagged. I’m looking for an Instagram follower bot that mimics real behavior and won’t cause shadowbans. Ideally, causing real growth.\n\n If you’ve tested any recently, which ones are still semi safe and what daily limits do you use? EDIT: Thanks everyone! I decided to go with Naizop based on what the recommendations below. So far so good!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 148,
    "downs": 0,
    "created_utc": 1762521895.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.966250286251393
  },
  {
    "score": 139,
    "title": "Where Can I Safely Buy TikTok Likes That Actually Help With Engagement?",
    "selftext": "Hi everyone,  \n  \nI’ve been creating content on TikTok for a while now, and I really enjoy it, but I’ve hit a bit of a plateau with engagement. My videos get views, but the likes, comments, and shares aren’t growing like I hoped. I post regularly, try trending sounds, use hashtags, and experiment with different types of content, but it still feels like some of my videos are just floating under the radar. \n\nI’ve done some research on Reddit and other platforms to see how creators boost engagement, and a friend recently told me that buying TikTok likes actually helped them get more visibility and reach real people who then engaged with their content.\n\nThat got me thinking this might be a smart way to give my videos a little boost and reach more of the right audience. I’m looking for services that provide real, active likes that can genuinely help my content get noticed without affecting my account. If anyone has experience with this—like a site that worked well for boosting engagement—I’d really appreciate your advice.\n\nI’m trying to find a practical way to grow without just hoping for the algorithm to notice me.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1762864943.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.984173665206079
  },
  {
    "score": 122,
    "title": "Brands that are actually PAYING creators (not just PR) - with budgets and emails",
    "selftext": "I've been researching which brands are actually paying creators (not just PR packages) and some of these budgets are genuinely crazy. Here's who's writing real checks:\n\n**THE BIG SPENDERS ($50k+/month):**\n\n* **Alani Nu** \\- $99k/month - Hired 1,459 creators - [partnerships@alaninu.com](mailto:partnerships@alaninu.com)\n* **Too Faced** \\- $98k/month - Hired 291 creators - [marketing@toofaced.com](mailto:marketing@toofaced.com)\n* **Women's Best** \\- $89k/month - Hired 113 creators - [social@womensbest.com](mailto:social@womensbest.com)\n* **Aritzia** \\- $85k/month - Hired 417 creators - [influencer@aritzia.com](mailto:influencer@aritzia.com)\n* **Amika** \\- $66k/month - Hired 116 creators - [social@loveamika.com](mailto:social@loveamika.com)\n* **Gisou** \\- $61k/month - Hired 112 creators - [partnerships@gisou.com](mailto:partnerships@gisou.com)\n* **Supergoop!** \\- $59k/month - Hired 122 creators - [social@supergoop.com](mailto:social@supergoop.com)\n* **Patrick Ta Beauty** \\- $58k/month - Hired 153 creators - [social@patrickta.com](mailto:social@patrickta.com)\n* **Oh Polly** \\- $54k/month - Hired 49 creators - [media@ohpolly.com](mailto:media@ohpolly.com)\n* **Revlon** \\- $54k/month - Hired 113 creators - [media@revlon.com](mailto:media@revlon.com)\n* **Brooks Running** \\- $53k/month - Hired 58 creators - [socialmedia@brooksrunning.com](mailto:socialmedia@brooksrunning.com)\n\n**VOLUME HIRERS (hired 200+ creators):**\n\n* **Kitsch** \\- $19k/month - Hired 264 creators - [marketing@mykitsch.com](mailto:marketing@mykitsch.com)\n* **BAGSMART** \\- $18k/month - Hired 215 creators - [marketing@bagsmart.com](mailto:marketing@bagsmart.com)\n* **IGK Hair** \\- $13k/month - Hired 200 creators - [marketing@igkhair.com](mailto:marketing@igkhair.com)\n\n**SOLID BUDGETS ($20k-50k):**\n\n* **Glossier** \\- $46k/month - Hired 75 creators - [brand@glossier.com](mailto:brand@glossier.com)\n* **Revolution Beauty** \\- $44k/month - Hired 41 creators - [influencer@revolutionbeauty.com](mailto:influencer@revolutionbeauty.com)\n* **NOCCO** \\- $36k/month - Hired 55 creators - [media@nocco.com](mailto:media@nocco.com)\n* **BTArtbox** \\- $35k/month - Hired 114 creators - [marketing@btartboxnails.com](mailto:marketing@btartboxnails.com)\n* **HEYDUDE** \\- $33k/month - Hired 362 creators (!!!) - [social@heydude.com](mailto:social@heydude.com)\n* **Pink Palm Puff** \\- $33k/month - Hired 57 creators - [team@pinkpalmpuff.com](mailto:team@pinkpalmpuff.com)\n* **Wonderskin** \\- $29k/month - Hired 118 creators - [brand@wonderskin.com](mailto:brand@wonderskin.com)\n* **Dermalogica** \\- $27k/month - Hired 93 creators - [marketing@dermalogica.com](mailto:marketing@dermalogica.com)\n* **Phlur** \\- $26k/month - Hired 168 creators - [partnerships@phlur.com](mailto:partnerships@phlur.com)\n* **Tower 28 Beauty** \\- $23k/month - Hired 182 creators - [partnerships@tower28beauty.com](mailto:partnerships@tower28beauty.com)\n* **Kopari** \\- $21k/month - Hired 34 creators - [marketing@koparibeauty.com](mailto:marketing@koparibeauty.com)\n\n**HIDDEN GEMS (under $20k but hiring like crazy):**\n\n* **Lattafa** \\- $18k/month - Hired 92 creators - [marketing@lattafa.com](mailto:marketing@lattafa.com)\n* **Ritual** \\- $17k/month - Hired 41 creators - [partnerships@ritual.com](mailto:partnerships@ritual.com)\n* **Showpo** \\- $16k/month - Hired 38 creators - [marketing@showpo.com](mailto:marketing@showpo.com)\n* **Pixi Beauty** \\- $14k/month - Hired 99 creators - [partnerships@pixibeauty.com](mailto:partnerships@pixibeauty.com)\n* **Firmoo** \\- $10k/month - Hired 99 creators - [marketing@firmoo.com](mailto:marketing@firmoo.com)\n\nThis is just from the last 30 days btw\n\nThe crazy part is that these aren’t even the highest ones I found… Lmk if you guys want a part 2\n\nEdit: Since so many people are asking where I got this from, I used the brand directory tool on [aureliatalent.com](http://aureliatalent.com/). Some of the stuff like exact budget numbers you have to pay for but you can search over 20k brands for free",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 122,
    "downs": 0,
    "created_utc": 1759350197.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.656284027280185
  },
  {
    "score": 98,
    "title": "Has anyone here actually tried to buy Instagram followers recently?",
    "selftext": "I’ve been trying to grow my Instagram for months and I’m still stuck around the same number. I see people jump from 300 to 1K overnight, and it honestly makes me wonder if people are buying Instagram followers just to look more active. I’ve been posting consistently, using hashtags, testing formats, all that but my growth still feels painfully slow.\n\nI’ve seen sites claiming you can buy followers safely, but I have no idea how true that is or if it ends up hurting your engagement. I’ve also read different takes on how to buy followers properly, but the opinions are all over the place. Has anyone here actually tried it, or found a more effective way to grow?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1766829572.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.639389650950668
  },
  {
    "score": 94,
    "title": "Influencer quoted me $5k for 50k followers - is this the going rate now or am I being taken for a ride?",
    "selftext": "\nRunning a small D2C brand and reached out to a mid-tier influencer (52k followers, beauty/skincare niche) for a single Instagram post + 3 stories.\n\nThey came back with $5,000.\n\nTheir engagement rate is around 3.5%, which seems decent, but this feels steep for our budget. For context, we’ve worked with micro-influencers (10-20k) and paid $300-800 per post.\n\nIs there this much of a jump once you hit 50k? Or should I be negotiating differently?\n\nWhat rates are you all seeing in 2025 for this tier?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1760112029.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6730412025876227
  },
  {
    "score": 89,
    "title": "What’s the best site to buy Reddit upvotes?",
    "selftext": "I’ve been thinking of buying reddit upvotes, but I don’t know much about sites, so I need some help figuring out what to choose. I am looking for a service that sends upvotes slowly so it looks natural, works on new posts without causing issues. I also want something that is easy to use when I check my order and progress. Right now, I am looking at a few popular options for buying upvotes, but I wanted to ask you first since I am still learning and don’t really know what I’m doing. Any help would be appreciated. Thanks!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1767189874.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.473134437799193
  },
  {
    "score": 85,
    "title": "Looking for Talented UGC Creators to Join Our Food Simp Community! 🍲",
    "selftext": "Hey everyone,\n\nI hope you're all doing well!\n\nI'm excited to share that we're building a vibrant community of UGC creators for our app, Food Simp. If you love creating content and have a passion for food, we'd love to have you join us!\n\nWhat is Food Simp? Food Simp is a recipe app that helps people find delicious recipes based on the ingredients they have at home. We're all about making cooking fun and accessible for everyone.\n\nWhy Join Us?\n\nCollaborate: Connect with other talented creators and collaborate on exciting projects. Get Updates: Stay in the loop with the latest updates and announcements. Share Your Content: Showcase your amazing content and get recognized for your creativity. Upcoming Campaign: We're gearing up for a big campaign soon, and we’d love for you to be a part of it. If this sounds like something you'd be interested in, join our Discord server for more information and discussions: https://discord.gg/5hDQEz8bjD\n\nLooking forward to seeing you there!\n\nBest, The Food Simp Team",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1716997877.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6769984512435676
  },
  {
    "score": 73,
    "title": "Has Anyone Tried to Buy TikTok Followers? Real Experiences &amp; Recommendations",
    "selftext": "Hey everyone,\n\nI’ve been working on my TikTok account for a while now, and honestly, the most frustrating part isn’t creating content, it’s getting people to take the account seriously in the first place. When the follower count is low, even decent videos don’t seem to get the same attention or trust. It almost feels like the content doesn’t get a fair chance.\n\nThat’s why I started looking into whether it makes sense to buy TikTok followers as part of an early growth strategy. I’m not trying to fake popularity or chase viral numbers. The idea is more about improving overall TikTok presence so the profile doesn’t look brand new or empty when someone lands on it. If followers come from authentic accounts, it feels like it could help with credibility and social proof, especially in the early stages.\n\nI know there’s a lot of mixed opinions about this. Some platforms clearly rely on bots or low-quality profiles, which is not what I’m interested in at all. What I’m curious about are affordable options that actually focus on quality and gradual delivery, something that supports growth instead of hurting it.      \n\nIf you’ve tried to buy TikTok followers from a platform that felt reliable and noticed real improvements in how people interacted with your account, I’d really like to hear about it. Did it help with engagement or make the profile feel more established over time? Also interested in knowing which platforms to avoid so others don’t make the same mistakes.\n\nLooking forward to hearing honest experiences, both good and bad.                  ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1766522096.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.379123518039381
  },
  {
    "score": 63,
    "title": "Our influencer fraud rate was too high",
    "selftext": "Did an audit of our creator campaigns from last year and discovered that almost half the creators we worked with had significant fraud indicators. Not just a few fake followers, like systematic bot engagement.\n\nWe'd been vetting creators manually by looking at engagement rate and comment quality which seemed fine on the surface. Comments looked real, engagement was high, content was good. But we weren't checking deeper metrics.\n\nRan everything through proper fraud detection tools and found patterns we completely missed. Sudden follower spikes from weird geos. Engagement pods where the same 20 accounts comment on everything. Bot networks liking posts within seconds. Audience demographics that made no sense for the content.\n\nThe wildest one was a creator with 85k followers who we paid $3k for a campaign. Turns out 60k of those followers were purchased and her real engaged audience was maybe 8k people. We basically paid 10x what we should have.\n\nWhat's frustrating is some of these creators are probably buying followers without realizing how obvious it is. They think it helps them get brand deals but it actually tanks their performance.\n\nMy suggestions for this to not be a problem for you: use a vetting tool before signing anyone, we are using upfluence but anything that allows you to look at follower growth patterns, audience authenticity scores, engagement consistency over time works, saves time and money.\n\nAlso start doing test campaigns before committing to big contracts. Send them product, see if they actually drive any measurable results, then negotiate larger deals with proven performers.\n\nThe fraud problem is way bigger than people talk about publicly because brands don't want to admit they got scammed. But I'm pretty sure most companies have the same issue and just don't realize it.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1764932768.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4183179087842817
  },
  {
    "score": 58,
    "title": "Anyone else notice the 'professionalism gap' in the creator economy?",
    "selftext": "So I've been running influencer campaigns for a few years now and and I keep noticing this weird trend. There's this massive divide forming between creators who treat this like a real business and those who... don't.\n\nLike, I'll reach out to two creators with similar follower counts and engagement rates, and the experience is night and day. One will have everything organized: clear rates, updated stats, professional communication, quick response times. The other will take 5 days to reply with \"lol idk what do u think I should charge?\"\n\nIt's getting to the point where I can predict which partnerships will actually work out just from the first interaction. The creators who are killing it aren't necessarily the ones with the biggest followings, they're the ones who've figured out that brands want to work with people who make their lives easier, not harder.\n\nI had one creator last month who sent me a proper media kit with current analytics, clear pricing, past campaign examples, and even content guidelines for their audience. Closed the deal in 2 days. Then I had another with twice the followers who couldn't tell me their engagement rate without \"checking later\" and never got back to me.\n\nA lot of the more professional creators I work with aren't even using fancy tools. Some are just really good with Canva and Google Sheets. Others use platforms like CreatorsJet or similar to stay organized. But the common thread is they GET that this is a business.\n\nMeanwhile, you've got creators complaining about not getting brand deals while their DMs are a mess and their \"media kit\" is a screenshot from their Instagram insights from 6 months ago.\n\nIs this just me? Are you seeing the same split? Because honestly, it feels like the creator economy is splitting into two groups, the \"pros\" who treat it like a business, and everyone else who's getting left behind.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1757512182.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.241591470163272
  },
  {
    "score": 59,
    "title": "PART 2: Which brands are ACTUALLY paying creators right now (and their emails!)",
    "selftext": "Highly requested part 2 of my [original post.](https://www.reddit.com/r/influencermarketing/comments/1nvjes9/brands_that_are_actually_paying_creators_not_just/) These are some bigger spenders + some comment requests. Enjoy!\n\n**THE WHALES ($700k–$2.5M+/month)**\n\n* **Tatcha** — $885k/month — Hired 728 creators — [info@tatcha.com](mailto:info@tatcha.com)\n* **NYX Professional Makeup** — $707k/month — Hired 1,109 creators — [info@nyxcosmetics.com](mailto:info@nyxcosmetics.com)\n\n**HEAVY HITTERS ($175k–$400k/month)**\n\n* **Christian Dior** — $344k — Hired 369 creators — [contact@dior.com](mailto:contact@dior.com)\n* **Celsius** — $343k — Hired 206 creators — [contact@celsius.com](mailto:contact@celsius.com)\n* **Tokopedia** — $326k — Hired 388 creators — [pr@tokopedia.com](mailto:pr@tokopedia.com)\n* **Starbucks** — $301k — Hired 834 creators — [contact@starbucks.com](mailto:contact@starbucks.com)\n* **OLIPOP** — $294k — Hired 134 creators — [partnerships@drinkolipop.com](mailto:partnerships@drinkolipop.com)\n* **mixsoon** — $283k — Hired 1,086 creators — [contact@mixsoon.us](mailto:contact@mixsoon.us)\n* **Coach** — $229k — Hired 507 creators — [contact@coach.com](mailto:contact@coach.com)\n* **Alo Yoga** — $225k — Hired 197 creators — [marketing@aloyoga.com](mailto:marketing@aloyoga.com)\n* **ColourPop** — $219k — Hired 356 creators — [pr@colourpop.com](mailto:pr@colourpop.com)\n* **Lululemon** — $184k — Hired 392 creators — [media@lululemon.com](mailto:media@lululemon.com)\n* **White Fox** — $393k — Hired 404 creators — [info@whitefoxboutique.com](mailto:info@whitefoxboutique.com)\n* **Ray-Ban** — $206k — Hired 201 creators — [info@ray-ban.com](mailto:info@ray-ban.com)\n* **DFYNE** — $173k — Hired 814 creators — [info@dfyne.com](mailto:info@dfyne.com)\n\n**SOLID BUDGETS ($50k–$150k/month)**\n\n* **Laneige** — $148k — Hired 318 creators — [info@laneige.com](mailto:info@laneige.com)\n* **Tarte Cosmetics** — $104k — Hired 624 creators — [info@tartecosmetics.com](mailto:info@tartecosmetics.com)\n* **Levi’s** — $103k — Hired 433 creators — [info@levi.com](mailto:info@levi.com)\n* **New Balance** — $61k — Hired 235 creators — [info@newbalance.com](mailto:info@newbalance.com)\n* **Nespresso** — $59k — Hired 289 creators — [info@nespresso.com](mailto:info@nespresso.com)\n* **Krispy Kreme** — $96k — Hired 135 creators — [media@krispykreme.com](mailto:media@krispykreme.com)\n* **ASOS** — $144k — Hired 112 creators — [marketing@asos.com](mailto:marketing@asos.com)\n* **Liquid I.V.** — $99k — Hired 189 creators — [info@liquid-iv.com](mailto:info@liquid-iv.com)\n* **Too Faced** — $98k — Hired 291 creators — [marketing@toofaced.com](mailto:marketing@toofaced.com)\n* **Olaplex** — $95k — Hired 116 creators — [info@olaplex.com](https:)\n* **Gisou** — $61k — Hired 112 creators — [partnerships@gisou.com](mailto:partnerships@gisou.com)\n* **Windsor Store** — $57k — Hired 131 creators — [info@windsorstore.com](mailto:info@windsorstore.com)\n* **Dr. Squatch** — $56k — Hired 44 creators — [info@drsquatch.com](mailto:info@drsquatch.com)\n* **Lacoste** — $50.8k — Hired 44 creators — [contact@lacoste.com](mailto:contact@lacoste.com)\n* **Lush** — $50.2k — Hired 54 creators — [contact@lush.com](mailto:contact@lush.com)\n\n**NICHE REQUESTS**\n\n* **Kabrita USA (baby/kids)** — $82.7k — Hired 3 creators — [contact@kabrita.com](mailto:contact@kabrita.com)\n* **Viva Raw (pets)** — $82.1k — Hired 4 creators — [info@vivarawpets.com](mailto:info@vivarawpets.com)\n* **BODYARMOR (fitness/bev)** — $64.7k — Hired 142 creators — [info@drinkbodyarmor.com](mailto:info@drinkbodyarmor.com)\n\nAgain this is just from the last 30 days. The numbers are from tiktok collab activity, I’m sure the entire marketing budget is much higher for some of these brands.\n\nSource: The brand directory on [aureliatalent.com](http://aureliatalent.com/). There’s over 20k brands on there, these are just the ones I found interesting.\n\nLmk if you guys want a part 3 and I’ll put up another one!   \n",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1761252816.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.920700270390772
  },
  {
    "score": 59,
    "title": "Notorious Foodie",
    "selftext": "I follow Notorious Foodie on social media. Today, I just think to myself, is he a professional chef? In fact, I don't even know his name. Googled around and found very little info about him and got me wondering how he is able to have so many subscribers and his face in his videos without any of his personal information floating around? It blew my mind, can someone educate me on this phenomenon? 🤣\n\n---&gt; I want to restate the intention of my post for clarification. I am interested in how any online influencer can conceal their identity so well.How does one do that with publishing online content?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1711486990.0,
    "media": null,
    "is_video": false,
    "num_comments": 201,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6658269351069555
  },
  {
    "score": 56,
    "title": "How to Actually Get Brand Deals (From Someone on the Other Side)",
    "selftext": "Yesterday I posted tips for brands to find influencers at fair prices. Today, let me flip it, here's how creators can find legitimate brand partnerships:  \n\n\n**Stop DMing Random Brands!** Most brands get 100+ pitches daily. You're noise, not signal.  \n\n\n**Instead, Do This**:\n\n**1/ Professional Media Kit**\n\n* Your stats, audience demographics, past collaborations\n* Include rate ranges (seriously, brands hate the \"what's your budget?\" game)\n* Create with Canva if you like designing, or use CreatorsJet if you want it fully automated and always up-to-date\n\n**2/ Target the Right Brands**\n\n* Look for companies already working with creators in your follower range\n* Check their recent campaigns on their social\n* Smaller brands &gt; Fortune 500 companies (better response rates)\n\n**3/ Lead with Value, Not Follower Count**\n\n* \"I can create 3 videos showing your product solving X problem for Y audience\"\n* NOT \"I have 50K followers, collab?\"\n\n**4/ Write Professional Messages** Most creators send messages like \"hey! collab? 😍✨\"\n\nIf you actually write polite, professional emails with proper grammar and clear value propositions, you'll have 10x better response rates. The bar is THAT low.\n\n**5/ Timing Matters**\n\n* Most brands plan campaigns months ahead\n* Q4 budgets get allocated in Q2/Q3\n* Follow up (politely) if no response in 2 weeks\n\n**The Reality:** Good brands want creators who understand their business goals, not just pretty content. Show them ROI, not just pretty photos.\n\nWhat's worked best for you when reaching out to brands?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1756830588.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3076090834622844
  },
  {
    "score": 55,
    "title": "How are you all speeding up brand payments? Mine keep taking 30–90 days.",
    "selftext": "I’ve been doing more brand deals lately, and something I didn’t expect is how long some companies take to actually pay. I’ve had a few that were super quick, but most seem to sit in that 30 to 90 day window, and a couple didn’t pay until I followed up multiple times. It really throws off planning, especially when you’re juggling content schedules and other income streams.  \n  \nFor creators, managers, or agencies here, how are you handling slow payouts? Do you build it into your pricing, use specific invoicing tools, negotiate tighter payment terms, or just deal with the wait? I’m trying to figure out how people keep their cash flow steady without being annoying to brands.  \n  \nAny advice or systems you’ve found that make the whole process smoother would be awesome.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1765386248.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.15929767437316
  },
  {
    "score": 55,
    "title": "High commission affiliate program for big tech and job seekers",
    "selftext": "Hi all. I’m the founder of SalaryScript, a negotiation playbook that helps software engineers and tech folks squeeze more out of job offers. It’s a straight-to-the-point ebook + templates + rebuttals they can use in email/phone negotiations.\n\nWhy it works\n\n* Clear pain point: candidates hate leaving money on the table.\n* Audience with spending power: engineers and PMs.\n* Social proof: 1,000+ copies sold to date.\n* Frictionless delivery: instant download, no onboarding or install.\n\nAffiliate details\n\n* Commission: 30% per sale (through LemonSqueezy).\n* AOV: around $100, so roughly \\~$30 per sale.\n* Payouts handled by LemonSqueezy.\n* Tracking: standard LS affiliate tracking and dashboard.\n\nWho tends to convert\n\n* SWE/PM/Data folks who are in interview loops now or about to negotiate.\n* People frustrated by lowball offers or “budget constraints.”\n* Recent grads jumping from first job to second, and mid-career folks switching companies.\n\nAngles you can try\n\n* “I used this framework to get +$X in equity” style case studies.\n* “Email scripts to counter ‘we’re at the top of band’.”\n* “How to stack competing offers without burning bridges.”\n* “Canada vs US pay: getting US-level comp while remote.”\n\nTraffic I’m cool with\n\n* Content sites, newsletters, YouTube, LinkedIn, Twitter/X, niche forums, Discords/Slack communities (non-spammy).\n* Paid search/social is fine as long as you don’t bid on the brand name.\n* Not allowed: coupon sites, brand-term bidding, spammy comment blasts.\n\nApply here  \n[https://salaryscript.lemonsqueezy.com/affiliates](https://salaryscript.lemonsqueezy.com/affiliates)",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1759972826.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.4531880270062003
  },
  {
    "score": 52,
    "title": "I'm an influencer with 500k followers—here’s how I actually make money (and what surprised me)",
    "selftext": "I’ve been in the content game for a few years now, and I recently crossed 500k followers across platforms (mostly Instagram + YouTube). People often assume it’s all brand deals and glam, but the income breakdown might surprise you. Here’s a transparent look at how I earn:\n\n# 💰 Income Breakdown (Monthly Average)\n\n* **Brand Deals** – 40% These are the big-ticket items, but they’re inconsistent. Some months it’s ₹0, other months it’s ₹2L+ depending on campaigns.\n* **Affiliate Marketing** – 20% I promote tools I actually use (like Notion, Framer, or skincare brands). Passive, but requires trust and good content.\n* **Digital Products** – 15% I sell Notion templates, presets, and a mini-course on content strategy. This is my most scalable income stream.\n* **YouTube AdSense** – 10% Not huge unless you’re getting millions of views, but it’s steady.\n* **Consulting/1:1 Calls** – 10% I do strategy calls with small brands or creators. It’s fulfilling and helps me stay grounded.\n* **Misc (Events, UGC, Licensing)** – 5% Random gigs, speaking, or licensing content to platforms.\n\n# 🧠 What I’ve Learned\n\n* **Diversify early**: Don’t rely on just brand deals.\n* **Build an email list**: Social platforms can change overnight.\n* **Your niche matters**: Finance, tech, and education niches earn more per follower than lifestyle or fashion.\n* **Transparency builds trust**: I’ve turned down ₹₹₹ deals that didn’t align with my values—and gained loyal followers for it.\n\nIf you’re a creator or thinking of becoming one, ask me anything. Happy to share tools, pitch templates, or even my first awkward brand email 😅",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1751136035.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.260560957649757
  },
  {
    "score": 53,
    "title": "Equity for Promotion - Looking for creators / influencers to take equity over cash to promoted my business?",
    "selftext": "Hey everyone,\n\nRunning a website around credit card reward points and banking sector (link in bio)\n\nHave a good dev team working,you can see my site and subreddit ,my team is handling backend side , operations, scaling, and strategy.\n\nIf you’re experienced or just love building great content and be part of something big DM us.\n\nThere’s real potential for profit-sharing or equity. Not offering any upfront payment currently\n\n[](https://www.reddit.com/submit/?post_id=t3_1okoewm)",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1762460701.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8964387533189404
  },
  {
    "score": 50,
    "title": "Why You’re Not Getting Brand Deals",
    "selftext": "I’ve been in influencer marketing for over a decade and run and sold an agency. Started a new agency a couple years ago.  We work on the brand and talent side so see both sides of the deals. \n\nI see a lot of influencers asking why they’re not getting brand deals in spite of outreach to brands.\n\nHere’s why:\n\n-Brands are very particular about category - 70-80% of brand deals go to female lifestyle and/or family channels because women generally buy more (clothing, home items, etc). If you’re a content creator in these categories then good luck. After that niches such as travel, gaming, entertainment, pets and few others are popular. Very specific small niches also can get sponsorships like hiking, running etc. \n\n-You have to be personality driven. E.g. not commentary or edits. You need to be the face and personality of the channel/content \n\n-Production quality is extremely important. Brands want their product to be seen in high quality well shot production videos. \n\n-In spite of all the hype around micro influencers, it’s a nightmare for brands to manage campaigns with 10x creators. We start to see the most brand interest over 100K followers on IG, 250K on TikTok and 50K subs on Youtube. But average views matter also. 100K+ on IG and TikTok and 50K+ on YouTube. \n\n-Engagement is super important. Brand shave tools now where they can just set filters to find influencers that includes content category, number of followers, growth over a period of time (trending influencers more popular), engagement rates, average views, views on sponsored content, audience male/female and country as well as other factors. \n\n-Brands can see if you buy followers or engagement so don’t. \n\nBrands are so overwhelmed by creator outreach (there are over 400K accounts on Instagram alone with more than 500K followers) that they generally just use a platform or tool when they want to run a campaign and filter down to select from a couple hundred creators that match qualities above \n\nIf you check all the boxes above, you won’t need to reach out to brands. They’ll find you. \n\nWhat you can do:\n\n-If you don’t check the boxes but have a decent following, then look at other ways to monetize such as affiliate deals, expanding content to paid categories like substack, patreon, courses, coaching etc. \n\n-Consdider starting a YouTube channel (it’s a lot of work). YouTube pays well on views. 10x or more what TikTok does. \n\n-If you’re a growing influencer and check the boxes but have a smaller following, then having management can help but most good management agencies won’t sign you until you have at least 50K followers on IG, TikTok or YouTube. Mediocre management agencies aren’t worth signing with. \n\n",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1739688079.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1657520581774294
  },
  {
    "score": 49,
    "title": "Looking for advice on influencer rates + management (wife’s IG, 128k followers)",
    "selftext": "My wife has been running an Instagram account for our dog for the past 5 years and has grown it organically to 128k followers (steady growth of ~2k/month for over a year now). She’s picked up some brand deals here and there, but I think she might be undervaluing her time and reach.\n\nRight now she charges &lt;$500 for reels and &lt;$250 for picture posts. Some national brands have recently offered her $2–3K without her even pitching, which makes me think she’s leaving money on the table when setting her own rates.\n\nA little context: She recently left her job to care full-time for our son, who has serious health issues. We’re living on my income, and while we’re managing, there are a lot of surprise medical costs. Even an extra few hundred dollars here and there would really help.\n\nThat said, this account is also her creative outlet. She wouldn’t want to turn it into nonstop brand work (too stressful), but since she’s already doing occasional deals, I’d like her to be compensated fairly.\n\nMy questions for you all:\n* How do you recommend setting fair rates at her level of following/engagement?\n* If you were in her shoes, what would you charge for reels/posts?\n* Has anyone here worked with management agencies? Worth it or not?\n\nAppreciate any advice or experiences you’re willing to share!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1758853484.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.142549020007128
  },
  {
    "score": 45,
    "title": "How to tastefully shoot down an influencer's rate?",
    "selftext": "Hi! I've slowly swayed into managing influencer campaigns for my company and I'm wondering what tips you all have for essentially telling a creator that their content isn't worth the ROI that they're proposing? \n\nFor ex: I'm in talks with a larger creator (350k on IG) who wants $6,000 for an in-feed reel. We worked with her last year for that amount (tbh I was still figuring out what rates are considered \"normal\" and we wayyy overpaid her) and she's requesting the same amount this year, but I know that her engagement is low (&lt;2%) and the results from our partnership last year were comparable to those of the smaller micro &amp; nano-creators we worked with. \n\nMy issue is that I don't know what wording to use or how to justify that I won't be paying her $6k again this year because the content didn't live up to what we had hoped for. I'm sure this is a common dialogue that happens, but I don't know how to reject a rate like that without coming across as rude or dismissive of the work she puts into content creation. Any tips on wording? Any other incentives you think I could throw in? TIA!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1758921047.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.135332820841527
  },
  {
    "score": 46,
    "title": "Why 90% of Influencer Pitches Get Deleted in 5 Seconds",
    "selftext": "So, I get about 50-100 influencer pitches every week, and honestly? Most of them make me want to throw my laptop out the window.\n\nJust this morning I got one that started with \"Hi! Love your brand! Collab? 😍✨\" followed by a blurry screenshot of their follower count. That was it. That was the entire pitch.\n\nAnd it's not just the emoji, though there are way too many of those. It's the copy-paste templates where they forgot to change the brand name from their last pitch. It's the engagement rates from when Obama was still president. It's asking me what my budget is instead of just telling me what they charge like a normal business person would.\n\nI actually WANT to work with creators. That's literally my job. But when someone sends me a pitch that looks like they wrote it during a commercial break, what am I supposed to think?\n\nIf you can't be bothered to spend 5 minutes writing a decent email, why should I trust you'll put effort into promoting my product?\n\nThe creators who get my attention are the ones who clearly looked at our brand first, have media kits that are actually UP TO DATE, made with Canva, CreatorsJet if they want it automated, or hell, there are hundreds of templates on the internet. They tell me something about who their audience actually is, include their actual rates instead of playing games, and show me examples of previous work that actually performed well.\n\nIt's not rocket science, but apparently it's rare.\n\nMost of these creators probably make great content. But I'll never know because their pitch made them look completely unprofessional.\n\nSo please, when you reach out to a brand, be professional, polite and send all the information needed. That's it, you'll already be in the top 5% doing this.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1757251984.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0258091983468205
  },
  {
    "score": 45,
    "title": "For creators running real businesses, how are you handling banking?",
    "selftext": "I’m running a business that’s built around content and influencer revenue, and I’m realizing pretty quickly that a traditional bank setup doesn’t really fit how this kind of business operates.  \nIncome isn’t always linear, payments come from different platforms and brands, and the financial side starts getting messy once things scale beyond just “getting paid.” I’m trying to figure out what a solid, long-term banking setup actually looks like for this space.  \nFor founders or operators working in creator-led businesses, what have you landed on? Did you stick with a traditional bank, or move to something more tailored once revenue became meaningful? Curious what decisions you’re happy you made early, and what you’d do differently in hindsight.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1765988562.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6513184590414056
  },
  {
    "score": 44,
    "title": "What I learned from running 50+ influencer marketing campaigns to grow my business.",
    "selftext": "Two years ago, to increase my Shoplazza store's visibility, I decided to allocate more of my budget to influencer marketing. After extensive experimentation and exploration, I’ve gathered some key insights:\n\n1. Quality Over Quantity. A micro-influencer with a small but highly aligned audience is far more effective than a big-name influencer whose followers don’t match your target demographic. \n\n2. Micro-influencers (5k-50k followers with at least a 2.5% engagement rate) are easy to work with and great for testing. Start small, identify what works, and scale up. Building relationships with these influencers can lead to mutual growth over time. \n\n3. Check the profiles of your most engaged social media fans to see who they’re following. If they follow micro-influencers, that’s a good starting point. \n\n4. Crafting the Collaboration \n\n\\- Once you’ve identified 15-30 aligned influencers, send them your product. \n\n\\- After they receive it, reach out via DM to request: \n\n\\- A feed post. \n\n\\- 2-5 stories. \n\n\\- A review on your website if they genuinely love the product. \n\n\\- Provide a custom link and a discount code for their followers. \n\n5. If the collaboration performs well and their audience converts, follow up a few months later. Offer additional incentives to maintain the relationship and drive continued success.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1735918236.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.148287502935297
  },
  {
    "score": 39,
    "title": "Why do gaming streamers get the best brand deals compared to other creators?",
    "selftext": "Every gaming streamer seems to have sponsorships from energy drink companies, gaming chairs, headsets, and keyboards. The partnerships look way more lucrative than what lifestyle or beauty creators get. Gaming audiences are super engaged and actually buy the products their favorite streamers recommend. Been looking at gaming brand partnerships on Afluencer and the budgets these companies have are wild compared to other industries. Energy drinks especially seem to throw money at anyone with decent viewership. Do gaming companies just have bigger marketing budgets or are gamers actually better at converting viewers into customers?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1753858086.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0007713317390654
  },
  {
    "score": 40,
    "title": "I lead influencer marketing at a Fortune 500 company! AMA",
    "selftext": "I've been working in the influencer marketing industry for almost a decade now, starting off my career in social media marketing. I have managed and led influencer marketing campaigns for multiple other Fortune 500 companies, worked with creators who have over 50-100M+ followers, and multi-million dollar marketing budgets. I won't give any details that pertain to my job or my field of work, but can answer general questions about influencer marketing, what brands look for, how to partner with brands and so forth.\n\nFeel free to ask away! I will let you know if I can't answer a question due to external factors.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1745355134.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.231740535041163
  },
  {
    "score": 41,
    "title": "My tested strategies for aspiring Influencers",
    "selftext": "Hey awesome influencers! Wanted to share my journey, hoping it sparks some inspiration and guidance for y'all out there.\n\n**Discovering My Niche:** For me, [choosing my niche](https://www.entrepreneur.com/leadership/5-steps-you-can-use-to-find-your-niche/272808) was everything! It's more than just popularity; it's about connecting with what you love. My journey really kicked off when I started sharing life's moments on TikTok and Instagram, aligning my content with my true passions.\n\n**Picking the Right Platform:** While Instagram became my primary playground, understanding where your audience hangs out is key. Each platform has its dynamics, so find one that aligns with your content and audience.\n\n**Create a Content Strategy:** It's not just about posting; it's about strategy. Plan your content to maintain consistency and keep your audience engaged. My go-to tools include [Canva](https://www.canva.com/), [Hootsuite](https://www.hootsuite.com/) for scheduling, and [Boost App Social](https://apps.apple.com/us/app/boost-app-social-growth-tools/id1551991915) for those killer captions and engagement.\n\n**Stay Updated:** Trends change faster than you'd think. Staying updated keeps your content fresh and relevant. Engage with the latest trends but make them your own.\n\n**Engage with Your Audience:** Conversations build connections. Engage with your audience through comments, DMs, and polls. It creates a sense of community around your content.\n\n**Network with Other Influencers:** Networking opens doors. Collaborate with fellow influencers to tap into new audiences and share experiences.\n\n**Create a Media Kit and Pitch Yourself to Brands:** Your [media kit](https://foundr.com/articles/marketing/what-is-a-media-kit) is your digital resume. Showcase your stats, audience demographics, and your unique style. Canva even offers templates to make this process a breeze. Don't be afraid to pitch yourself to brands you resonate with.\n\n**Getting My First Brand Collab**: The excitement kicked in when I consistently showcased my unique style and actively engaged with my audience. It wasn't long before brands, eager for authenticity, noticed and knocked on my door. *A pro tip: Stay true to your authentic self, and collaborations will naturally find their way to you.*\n\nI hope these tips light up your influencer journey! Drop your thoughts, questions, or share your own tips below. Let's build each other up!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1702115799.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.674279286061882
  },
  {
    "score": 37,
    "title": "How I generate 12.5M views/month with influencers at $2.20 CPM (no ads, no BS)",
    "selftext": "# Before we start…\n\nI’m not selling anything. No course, no coaching, no agency pitch. **I don’t want your money**.\n\nI’m just a guy who’s made a decent bit of $$$ running influencer marketing for brands at scale — and I want to show you exactly how I do it.\n\nAll I ask: **if you take this and try it yourself, come back and share what’s been working for you (your results, tweaks, or strategies) in this thread.** Or you have a different strategy that's been working, pop it in. I want to see what’s hitting, please out-execute me… \n\nI run a lot of different strategies depending on the brand side, but this post is **the exact playbook that’s been driving 12.5M+ monthly views at $2.2 CPM**. It’s not the *only* way I do things, I do lots of direct influencer posts on their own channels, but the following is one of the simplest, most repeatable systems I’ve seen work.\n\n# Here’s the playbook 👇\n\n**Step 1. Source creators... more than you think.**\n\nMost people fail because they don’t source enough. You need *volume*. I start with **20,000+ creator leads in month 1** — that’s my baseline.\n\nBut don’t just grab random influencers. The sweet spot for us is:\n\n* **&lt; 150K followers** (ideally &lt; 100K)\n* **5K+ avg views per post** (ideally &gt; 10K)\n* Indication that they are in the **right niche** (ie. \"tech\" in bio for ai product)\n\nThese creators punch above their weight. They’re affordable, hungry, and often outperform bigger accounts on engagement and cost.\n\n* Build massive lead lists (I use **CreatorLookup**).\n* Use automated but still personal-feeling outreach (name + niche is enough).\n* Run high-deliverability sequences (no links in first email — I use **Smartlead**).\n* Keep the pipeline clean &amp; automate intake through forms (**Airtable** for forms responses + pipelines).\n\n👉 The key isn’t finding “perfect” creators — it’s sourcing **so many** that the right ones *inevitably* surface, and self-select into your pipeline.\n\n**Conservative numbers:**\n\n* 20,000 leads → **10,000 opens** (50% open rate).\n* 2,500 replies (25%).\n* 250 actually onboard (10%).\n\n💰 You're doing something right if your cost per onboarded creator is $10 or less.\n\n\n\n**Step 2. Structure the deal right (and make it scalable)**\n\nGetting creators in the door isn’t the hard part — keeping it scalable is. You don’t want to be DM’ing, negotiating, and chasing creators all day.\n\nHere’s the **intake pipeline** we run:\n\n1. Creator fills out an **intake form** (socials, contact info, shipping if needed. Here they can also read the full deal terms).\n2. Info flows into **Airtable** → review/approve in under a minute.\n3. On approval, they get an **automated email** with next steps.\n4. If it’s e-com: their shipping address is piped directly into our order system (one extra integration, done).\n5. Creator spins up a **dedicated brand account**.\n\nFrom there, the **rules are simple**: *“Post as much or as little as you want — we’ll pay you $2 for every 1,000 views on this account.”*\n\nWe give them a short **account warm-up guide** to help posts perform faster. If they don’t follow it and their numbers suck, that’s on them — the CPM model self-corrects.\n\nBrand guidelines vary by client. Some want direct CTAs, others prefer adjacent, lifestyle-style posts. We’ve found non-direct usually drives better results, but it’s up to the brand. Either way, if a creator breaks the brand's rules, they don’t get paid *(for the video that didn't meet guidelines)*.\n\nAt month’s end, we just pull their account insights. No chasing, no haggling, no drama.\n\n👉 Net result: the entire process — from intake to approval — takes **less than a minute per creator**, and the machine runs itself.\n\n\n\n**Step 3. The Outcome**\n\nYou shouldn’t *expect* things to go viral. The goal is to run **enough volume** that virality becomes inevitable.\n\nWith **250 creators posting**:\n\n* You’ll average **1+ \"viral\" video per day** (but that's not even the main goal)\n* 50k average per account (250 accounts) = **12.5M monthly views**\n\nAt $2 CPM, that’s **$100 cost per creator per month**. Add the $10 sourcing cost, and you’re all-in at:\n\n* **$110 spend = 50K views → $2.20 CPM.**\n\nI’m simplifying here — in practice, some creators will only make $40 if they drop the ball, and others will clear $2K–$5K because they grind harder and get the views. That’s the beauty of the CPM structure: creators are **incentivized to perform**. \n\nAverages hide the spread. In practice, it looks more like:\n\n* 10 accounts pulling **500K+ views each**\n* 25 accounts around **250K views**\n* A chunk of mid-performers in the 50K–100K range\n* And plenty of small ones barely doing 10K\n* And every so often, a creator hits **multiple 1M+ videos back-to-back**, spiking totals fast\n\nThat’s why we **cap payouts at 3M views/mo per creator**. At $2.00 CPM, that’s **$6,000 max payout**. But if someone goes wild and hits **10M views**, the extra 7M views are basically free — dropping the effective CPM to **$0.60**.\n\nAll content links back to the brand’s accounts &amp; website, amplifying equity.\n\nThe CPM model self-corrects: the top performers get paid more, the weak ones naturally fade out. By **month 2**, we cut the bottom 80% (the ones who underperform), replace them with a fresh batch of creators, and double down on the ones delivering.\n\nOver time, you’re left with a compounding pool of high-performers.\n\nThe kicker: those **12.5M views cost under $30K**. The same brand spends **$125K/month on paid ads** for a similar reach.\n\nAnd while CTRs with organic are lower than paid ads, **CPC and CPA** ***still*** **crush paid ads** because the inventory is so much cheaper.\n\nIn other words, this system lets you **outcompete paid ads by orders of magnitude** — with creators driving distribution instead of algorithms you don’t control.\n\n⚡ **The takeaway:** Stop chasing “one-off creator collabs.”\n\nYou don’t need to go as crazy as I do with 20,000+ leads.\n\nStart small: pull a list of **500–1,000 creators** from a website like CreatorLookup. Run some outreach. By next week, you could easily have **5–15 creators posting for your brand**.\n\nFrom there, the same rules apply:\n\n* Incentivize them with CPM-based pay so performance is built in.\n* Cut the weak ones, keep the strong ones.\n* Repeat every month until you’ve got your own creator pipeline.\n\nThat's how you can **build a CPM pipeline, engineer virality, and scale distribution** for pennies.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1757378594.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0944215314172046
  },
  {
    "score": 39,
    "title": "What’s your process for invoicing brands and paying talent?",
    "selftext": "Curious how agencies and managers here handle this operationally.  \n  \nBetween invoicing brands, tracking who’s been paid, and then paying out creators or contractors, it feels like there are a lot of ways for things to break or get delayed.  \n  \nDo you use one system for everything, separate tools, or mostly manual workflows?  \nWhat’s been the biggest pain point, and what’s actually saved you time?  \n  \nInterested in hearing what’s worked (and what hasn’t).",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1765555964.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.741135616519784
  },
  {
    "score": 36,
    "title": "Tips for working with Fiverr/Similar platforms UGC creators?",
    "selftext": "I’m looking to validate a new product idea and figured UGC-style content might be the fastest way to test messaging. I’ve worked with UGC creators before, but never on Fiverr or similar platforms. I noticed Fiverr has quite a few people offering this service.\n\n\n\nSince I’m new to using Fiverr for UGC, I’m wondering if anyone has tips for working with creators there. What should I ask for up front, and what helps avoid endless back-and-forth?\n\n\n\nAlso, are there any other platforms you’d recommend for affordable and quick UGC content?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 36,
    "downs": 0,
    "created_utc": 1758047813.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.747246717562967
  },
  {
    "score": 37,
    "title": "A Creator’s No-Fluff Guide to Choosing the Right Collab Platforms (and Landing Paid Briefs That Actually Fit Your Niche)",
    "selftext": "Hey everyone, I’ve spent the past three years working with just about every creator-platform out there. Below is a straight-up field report: how often each one actually sends paid briefs, the kind of brands you’ll meet, and the real-world quirks I wish someone had told me on day one. I left out exact dollar amounts because rates shift, but I’ll tell you what “high,” “medium,” and “lean” feel like day-to-day. Hope this saves you some headaches.\n\n\n\n1. LTK  \n\nBrief flow: steady, especially if your content leans fashion or beauty.  \n\nBrand mix: fast-fashion drops, Sephora launches, big-box home décor.  \n\nHeads-up: payments land slowly—plan cash-flow accordingly.\n\n\n\n2. ShopMy  \n\nBrief flow: moderate; stronger in beauty than fashion.  \n\nBrand mix: prestige skincare, hair tools, niche fragrance.  \n\nHeads-up: long payout window; keep another platform active if you need faster turns.\n\n\n\n3. AspireIQ  \n\nBrief flow: selective—expect one or two solid offers per month once you clear their follower threshold.  \n\nBrand mix: high-ticket DTC wellness, premium home goods.  \n\nHeads-up: campaign briefs are detailed; treat the proposal like a mini pitch deck.\n\n\n\n4. Impact – Creator  \n\nBrief flow: sporadic but high-value.  \n\nBrand mix: global sportswear, audio tech, enterprise SaaS.  \n\nHeads-up: long attribution windows—book the revenue in your head, not your bank account, until the cookie clears.\n\n\n\n5. CreatorIQ  \n\nBrief flow: rare, oversized.  \n\nBrand mix: legacy beauty conglomerates, luxury fashion houses.  \n\nHeads-up: expect legal and insurance paperwork; have an LLC and COI ready.\n\n\n\n6. #paid  \n\nBrief flow: moderate.  \n\nBrand mix: beverage, travel, fintech apps.  \n\nHeads-up: they run whitelisted ads—clarify usage length up front to avoid surprises.\n\n\n\n7. Collabstr  \n\nBrief flow: steady trickle of small to mid-sized brands.  \n\nBrand mix: indie skincare, eco candles, boutique jewelry.  \n\nHeads-up: you set your own rate; pad it slightly to absorb platform fees.\n\n\n\n8. Upfluence  \n\nBrief flow: moderate; heavy in supplements, home fitness.  \n\nBrand mix: mid-market DTC labels.  \n\nHeads-up: half the fee releases on delivery, half on KPI sign-off—schedule reminders.\n\n\n\n9. Cohley  \n\nBrief flow: regular, content-heavy.  \n\nBrand mix: grocery private labels, snack startups, affordable home goods.  \n\nHeads-up: bundles often include stills + video—price the extra deliverables up front.\n\n\n\n10. Grin  \n\nBrief flow: low-frequency, long-term.  \n\nBrand mix: outdoor and lifestyle brands.  \n\nHeads-up: programs run 3-6 months; negotiate quarterly usage renewals early.\n\n\n\n11. Creator.co  \n\nBrief flow: steady; CPG-centric.  \n\nBrand mix: frozen food, hard seltzer, household staples.  \n\nHeads-up: expect whitelisting—ask for paid-media budget on top of your fee.\n\n\n\n12. Social Native  \n\nBrief flow: high volume, lower per-project budget.  \n\nBrand mix: rotating CPG launches.  \n\nHeads-up: quick turnarounds—keep raw footage folders organized for same-day edits.\n\n\n\n13. ShopYourLikes  \n\nBrief flow: constant, but compensation leans gift cards.  \n\nBrand mix: big-box retail, Amazon staples.  \n\nHeads-up: cash-out thresholds are real; treat it as supplemental, not rent money.\n\n\n\n14. Skeepers  \n\nBrief flow: moderate, EU-heavy.  \n\nBrand mix: European skincare, pharmacy chains.  \n\nHeads-up: invoices in euros—factor in conversion and VAT if you’re US-based.\n\n\n\n15. BrandClub  \n\nBrief flow: light but high-quality.  \n\nBrand mix: sustainable fashion, boutique pet brands.  \n\nHeads-up: invitation-only; polish your media kit before applying.\n\n\n\n16. JoinBrands  \n\nBrief flow: high, TikTok-first.  \n\nBrand mix: gadget dropshippers, novelty items.  \n\nHeads-up: flat-fee structure—clarify exclusivity windows to avoid stacking conflicts.\n\n\n\n17. StackInfluence  \n\nBrief flow: constant product mailers, no cash.  \n\nBrand mix: Amazon micro-brands.  \n\nHeads-up: useful for content filler; don’t rely on it for income.\n\n\n\n18. Influenster / Bazaarvoice  \n\nBrief flow: frequent sampling campaigns.  \n\nBrand mix: mass beauty, household goods.  \n\nHeads-up: treat as product seeding; paid follow-ups sometimes appear after consistent posting.\n\n\n\n19. onbento  \n\nBrief flow: occasional, location-specific.  \n\nBrand mix: upscale restaurants, pop-ups.  \n\nHeads-up: NYC-centric only—travel costs can eat the fee if you’re not local.\n\n\n\n20. newcollab.co  \n\nBrief flow: light, indie-heavy.  \n\nBrand mix: small-batch jewelry, candles.  \n\nHeads-up: PayPal cash-out minimum—stack two projects before hitting withdraw.\n\n\n\n21. hafi.pro  \n\nBrief flow: beta stage—expect sporadic offers.  \n\nBrand mix: tech-forward wellness.  \n\nHeads-up: keep deliverables simple; AI briefs can shift mid-campaign.\n\n\n\n22. Klear  \n\nBrief flow: infrequent, enterprise-level.  \n\nBrand mix: finance apps, VPNs, luxury travel.  \n\nHeads-up: follower-audit is strict; clean your audience before onboarding.\n\n  \n23. Social Cat  \n\nBrief flow: steady; expect daily email digests with 3–5 new brand matches, mostly micro-labels.  \n\nBrand mix: early-stage skincare, eco-fashion, pet accessories—founder-run teams looking for authentic UGC.  \n\nHeads-up: gifted and paid briefs sit side-by-side; always check the “paid” filter first. Verification unlocks paid-only campaigns and faster PayPal payouts.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1756390853.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8803292261446507
  },
  {
    "score": 34,
    "title": "Before I unsubscribe…",
    "selftext": "I’ve been following this subreddit for months but almost every post is straight out of ChatGPT and a good 70-80% of them are just poorly concealed attempts at promoting a tool. Even the replies seem to be mostly bots or fake accounts. \n\nAre there mods? Surely this sort of content should be banned?\n\nBefore I unsub, where are influencers/people who work in influencer marketing actually connecting/sharing valuable insights with each other? DMs welcome to keep the bots &amp; spammers from finding them! ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1762382169.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9326776917172355
  },
  {
    "score": 36,
    "title": "Do brands not pay well anymore or am I doing something wrong?",
    "selftext": "I manage around 10 creators who have great views and engagement, but when I receive brand offers and proposals and I let them know their rates, I get pushed down by 50-70%.\n\nFor example, one of you creators are a family of 3. They have 150k followers and average around 120k per video on IG. The most they’ve been offered for deals is around $1000-2000. This is after I’ve sent them their analytics which are really strong.\n\nI have other creators with 300k followers and an average of 40k views and 14% ER and they’re getting offers around $500-1000.\n\nI want the best for my creators and I keep pushing for better paid deals but being super unlikely. \n\nAnyone else having this issue? Or do I need to change tactics. \n\nThank you! ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 36,
    "downs": 0,
    "created_utc": 1760972316.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.068734027580245
  },
  {
    "score": 30,
    "title": "Looking for good tools to make finding influencers easier",
    "selftext": "Finding influencers over IG/tiktok search and filters alone is a pain, there's so many requirements I'm looking for and before I can see a qualified influencer I have to go through like 30 low quality ones.\n\nAnother problem is that if I do not have a way of getting high volume of influencers to send emails to,it creates this desperation where you trying to compromise so you can qualify some influencers which will increase the chances of the campaign flopping.\n\nI just need a service that can allow me filter based off niche,country where the influencer is in and if they have a public email they can be contacted with,if I can get this it will greatly reduce the amount of work I have to do,every other requirements can be met by manually going through each influencers profile.\n\nI checked out modash but their pricing is really not the best, $200 and I'm only allowed to view less than 200 emails a month? Even their $500 plan has a ridiculously low email limit,I don't mind paying $200/mo if viewing influencer's email isn't capped, would really appreciate if I can get better recommendations.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1757819325.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0359996286346673
  },
  {
    "score": 29,
    "title": "STOP ACCEPTING LOW BALL OFFERS!!!",
    "selftext": "Please I beg yall to know your value and your worth. I had a company come to me and say for a $100 they want me to do an entire webinar and I promote it for them.\n\nAt first I was like okay but then when I try to ask for more they said, \"Well we test people out first then we decide after if we pay more\". \n\nImagine you had a wedding and you reached out to photographers and you said, \"Before I can hire you, we're going to run a test wedding where you'll take photos. Afterward, we'll decide if you deserve payment for the actual wedding.\". That would be an absolute HELL NOOO.\n\nThat's basically what they're asking you to do to test you out before they give money. BUT THEY REACHED OUT TO YOU!! 🙅🏿‍♀️ That means they saw your audience, reach, and your social presence. That is good enough proof.\n\nI have been a creator for almost a year and have worked with some pretty cool companies. All I'm saying is don't let some company dangle a carrot and think that's all your worth.\n\nYOU ARE WORTH HELL OF ALOT MORE.\n\nMy Christmas gift to you🎁",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1766455265.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.825136252551653
  },
  {
    "score": 31,
    "title": "Small brands need to stop thinking “gifted collabs” will work with big influencers",
    "selftext": "Honestly, if your brand wants a big influencer to post, just pay the fee. Gifted collabs almost never work once someone’s past a certain level — they already have paid deals lined up and a set content plan.\n\nA free hoodie or handbag isn’t worth replacing a paid post that makes them thousands. It’s not ego, it’s business.\n\nIf you actually want reach and results, treat it like a real marketing spend. One paid collab with a big creator can outperform 100 small gifted ones easily.\n\nGifted only makes sense for micro influencers or if the gift is really substantial — otherwise, you’re wasting time hoping for a free shoutout that’ll never come.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1762156809.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7221216544733244
  },
  {
    "score": 31,
    "title": "50% of creators lying !! they’re young, unstructured, and not business-driven",
    "selftext": "Not sure who else is dealing with this, but I’m running regular influencer campaigns and it’s insane how many creators still don’t take the process seriously.\n\nLast Tuesday, I ran a mid-size campaign with 20+ creators.\n\nGuess what?\n\n**11 of them submitted videos with basic mistakes.**\n\n* No CTA\n* Wrong discount code\n* Bad lighting\n* Unmentioned brand name\n\nI had to go back and forth through DMs, send Looms, re-explain what was already in the brief… just to get a corrected version that should’ve been right the first time. In some cases, I waited 3–4 days for a tiny fix.\n\nI get that many creators are young and don’t have a “business mindset,” but this creates a real bottleneck for brands and managers.\n\nAnd the worst part? The creator swears they “included everything” - until you watch the clip and realize… they didn’t.\n\nAt scale, this becomes completely unmanageable.\n\nEspecially when you’re juggling 10–20 creators per campaign.\n\n# How do you handle this?\n\n* Do you manually check every draft?\n* Do you send them bullet points or record feedback videos?\n* Do you use any kind of review system or QA process?\n* Or do you just let it go live and pray?\n\nWould love to hear what’s working for others.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1758548364.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.001743991823006
  },
  {
    "score": 29,
    "title": "Influencer drove 50K views, zero sales - how do you track what actually converts?",
    "selftext": "Paid an influencer $3K for a post last month.\n\nStats they sent me:\n\n* 52K impressions\n* 4.2% engagement rate\n* \"Great brand alignment\"\n\nSales we can directly attribute to them: 0\n\nMaybe people bought later? Maybe the tracking is broken? I have no idea.\n\nThis keeps happening. Influencers show me engagement metrics, I pay them, then I can't prove they drove any actual revenue.\n\nHow are you guys measuring influencer ROI beyond \"impressions\" and \"engagement\"?\n\nIs there a way to track if someone clicked their link, browsed for a few days, then came back and bought? Because our GA just shows everything as \"direct.\"\n\nI'm about to get my influencer budget cut because I can't prove it's working - even though I THINK it is?\n\nWhat am I missing here?\n\n(I posted the same thing on tag manager group as well)",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.71,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1762936317.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9611662482156342
  },
  {
    "score": 31,
    "title": "Hiring: UGC Creator (Short-Form Videos)",
    "selftext": "Hey there! 👋\n\nWe’re looking for a UGC Creator to help us record short talking-head videos (under 30 seconds) for our text-to-speech app, [Frateca](https://frateca.com/).\n\nThese videos are script-based and simple — we’ll provide the script, and you just need to record yourself delivering it naturally and clearly on camera.\n\nWhat we’re looking for:\n\n* Native-level English accent\n* Comfortable speaking on camera\n* Can commit to recording 1–4 videos per day\n* Reliable and open to ongoing work\n\nNo editing needed — just record the clips (feel free to add your own touch) and send over the raw footage.\n\nIf you’re interested, please DM me with any sample work you have!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1759883684.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7947406013437184
  },
  {
    "score": 29,
    "title": "Here are the mistakes that are killing your videos",
    "selftext": "The harsh truth? Your videos look desperate. Every mistake screams \"amateur creator\" so loud that viewers scroll before giving you a chance. And you keep making the same errors expecting different results.\n\nHere's what's actually happening. People decide in under 2 seconds whether content is worth their time. Those 2 seconds aren't about your message - they're about signals that separate professional content from hobby posts.\n\nI tracked the exact failure points across hundreds of dead videos. Same problems everywhere. Fix these or accept that your content will never escape the 500 view graveyard.\n\n**1. Your opening screams low effort**\n\"Hey guys\" or \"Quick tip\" = immediate scroll. Compare to \"I just got banned from Walmart for doing this\" or \"This email template got me a 40% raise.\" Real hooks create information gaps that demand closure.\n\n**2. You're explaining instead of showing**\nTalking about results bores everyone. Showing transformation hooks them. \"I'll teach you to save money\" fails. \"Watch me turn $10 into $100 in one day\" succeeds. Action beats explanation always.\n\n**3. Your pacing drags like death**\nMore than 2 seconds without visual change loses 40% of viewers. Zoom shifts, text pops, cut angles - constant movement is mandatory. Static videos are dead videos, no exceptions.\n\n**4. You're leaving rewatch money on the table**\nSingle-view videos get buried. Multi-view videos get pushed. Fast text requiring pause, details revealed on replay, perfect end-to-start loops - these mechanics matter more than your actual content quality.\n\n**5. You're focused on pointless metrics**\nComments, likes, shares mean nothing for growth. Watch time percentage and replay rate determine everything. One highly rewatched video outperforms twenty single-view videos.\n\n**6. Your quality belongs in 2019**\nGrainy resolution, background noise, fluorescent lighting - these instantly categorize you as not worth watching. Modern standards are non-negotiable. Meet them or remain invisible forever.\n\nThe creators succeeding aren't more talented. They just stopped breaking these fundamental rules that everyone else ignores while complaining about algorithms.\n\nDiscovered these patterns using TikAlyzer to analyze exactly where and why people abandon videos. The data is brutal but clear.\n\nFix these issues or keep wondering why nothing changes. The formula isn't secret - most people just refuse to follow it.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1763509224.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6217425094393247
  },
  {
    "score": 30,
    "title": "Grin Influencer Marketing Platform - A Master Class in Deception and Underperformance",
    "selftext": "Sharing this as a cautionary tale for fellow entrepreneurs and marketers.\n\n  \nGrin misled us throughout the sales process. They hid critical information, oversold the platform's capabilities, and got us to sign a 12-month contract with recurring auto payment. This auto-payment feature is a nightmare to deal with, as you can't even stop the payments through your bank when you realize you've been scammed. As a result, we're left with a tool that utterly fails to meet our needs and doesn't come close to delivering what was promised.  \nOne of the most laughable aspects of Grin is their \"Curated lists\" feature, which they tout as a an white glove service for creator search. In reality, it's a team of people who seem to put in minimal effort, delivering \"influencers\" that don't meet the specified criteria or are duplicates of those already in the account. It's a far cry from the robust discovery tool they promised. Their discovery tool didn't even exist as promised, now they added a few filters that don't make a difference.  \nAt this point, Grin is nothing more than a drain on our resources. They are not solving any problems; they are only creating new ones and taking our money without providing any value in return.\n\nThe only thing Grin has mastered is the art of cold selling and running misleading demos. They are experts at coercing small businesses into committing to their platform, but the reality of the software does't even closely match waht the sales person promises.\n\nI implore you to avoid Grin and save yourself the frustration and wasted money. They are not worth the investment, and you'll likely find yourself in the same position we are - trapped in a long-term contract for a product that fails to deliver.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1712594077.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0639597338485296
  },
  {
    "score": 27,
    "title": "Best sites to buy Instagram followers - Any honest experiences?",
    "selftext": "Hi  \n  \nI’ve been researching buy Instagram followers options lately and wanted to hear real opinions from people who’ve actually tried it. There are so many posts claiming to be the best website to buy Instagram followers, but it’s hard to tell which ones offer real, active followers and which ones just send fake followers or inactive accounts.\n\nMy goal isn’t just boosting follower count for screenshots. I’m trying to improve my overall Instagram presence, build some social proof, and grow my IG account without completely killing my engagement rate or confusing Instagram algorithms. I already focus on high quality content, clean profile pictures, and interacting with other IG users, but growth has been slow.\n\nFor those who have experience with Instagram services:\n\n* Did the followers look like genuine followers or empty accounts?\n* Were they actually active, or just numbers added to the follower count?\n* Did buying IG followers help with popularity or lead to more followers over time?\n* How did it affect organic engagement and long-term growth?\n* Was there real customer support or a responsive customer support team?\n* Did the service deliver instantly, and did followers drop later?\n\nI keep seeing claims about premium followers, strong organic growth, and “safe” services that won’t hurt your IG account, but I’m skeptical. I don’t want something that gives instant delivery and then ruins reach or engagement a few weeks later.\n\nIf you’ve tried to buy Instagram followers (or seriously looked into it), I’d appreciate honest feedback, good or bad. I’m especially interested in whether any services actually helped maintain organic engagement instead of hurting it.\n\nNot looking for promotions, just real experiences from people who’ve tested this.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1766061745.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.06179767437316
  },
  {
    "score": 28,
    "title": "I need a unbiased company that can audit and consult why a social media content creator isn't getting brand deals. Does this exist?",
    "selftext": "My wife has been a content creator for 14 years. She has a large following on multiple different accounts with different niches, but she hasn't made real money in years minus a brief partnership that was earning her 5k a month for about 6 months. I'm taking on all the house bills and now have gotten to the point that I have to pay her bills as well. I don't understand why she isn't getting brand deals. Her engagment is high, she continues to be invited to events, she gets an exorbitant amount of PR to the point that I'm climbing over shit constantly. But isn't getting paid. She hasn't gotten paid or a deal in about 5 months. \n\nA couple of points to address because I know people will comment on this:\n\n1. She isn't going to quit and get a normal job. I've tried for years to have her consider this and I've given up on trying\n\n2. I can't leave, we have children, and as the sole income, I need to be around to provide for the. \n\n3. I'm not sharing the pages she has here, I need guaranteed confidentiality. \n\n4 I'm not looking for a manager or agent, I'm looking for and auditor/consultant. \n\n\nIs there any company out there that can help? ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1765563937.0,
    "media": null,
    "is_video": false,
    "num_comments": 61,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.026093842648083
  },
  {
    "score": 28,
    "title": "Am I the only one who feels like managing brand deals is actual hell?",
    "selftext": "I'm sitting here at 2am trying to organize my shit and I'm genuinely losing my mind. I've got like 47k followers and I've been doing brand deals for about a year now and honestly the money is decent but the PROCESS is making me want to quit.\n\nLike today I had a brand ghost me after I sent them three rounds of edits. Just... nothing. Radio silence. And I can't even remember which brands I'm supposed to follow up with because half my conversations are in IG DMs, some are in email, one brand only talks to me on LinkedIn for some reason??\n\nI'm using a spreadsheet to track everything but I forget to update it. I have a folder of invoices that are just named \"Invoice\\_Final\\_FINAL\\_v3.pdf\" because I keep having to change the deliverables. I got paid via Venmo, PayPal, direct deposit, and one time a literal check in the mail like it's 1997.\n\nAnd don't even get me started on figuring out what to charge. I quoted $800 for a brand last month and they said yes immediately and now I'm convinced I undercharged by like $2k. But I have no idea what the actual market rate is for someone my size.\n\nI guess my question is: what part of this makes YOU want to throw your phone? Is it just me being disorganized or is everyone else also held together with duct tape and prayer?\n\nWhat's the thing that makes you go \"there HAS to be a better way to do this\" but you just... haven't figured it out yet?\n\n(pls tell me I'm not alone in this chaos)",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1763156592.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.943998859932454
  },
  {
    "score": 29,
    "title": "Could this be the best time to become a content creator?",
    "selftext": "In Sep, we signed a $3000 deal for 3 sponsored reels with an Instagram creator who’s 1st video only went live 2 months prior. In fact, he only had 10 videos live when we signed the deal, albeit averaging at 200K views a video (!!!!) and 20K followers. Today, 30 days later, he has doubled his following and continues to grow daily. \n\nThis creator focuses his channel on AI tools, hacks and automations. \n\nThe AI hype is real. Technical and non technical audiences are thirsty to learn about AI tools, and this is true across all verticals and platforms. The number of use cases are unlimited and AI education is lacking. \n\nThis also means that this could possibly be the BEST time to become a content creator and close brand deals within months, as long as you combine AI tools and learnings into your content. If you’re a teacher, for example, why not open a Tiktok or Instagram channel about AI hacks for teachers? Create short videos on how teachers can benefit from ChatGPT or AI app building. You will never run out of content ideas as there are so many new tool being launch daily. Doing this, you suddenly become relevant to so many AI tech brands, some with very nice influencer marketing budgets, looking for authentic creators to work with. And, if you already have a channel with following and reach, why not start adding AI to your videos on a regular basis? It will open up a whole new avenue of brand deals.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1759463835.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.759845715408799
  },
  {
    "score": 26,
    "title": "Every influencer deal I’ve done feels like a gamble — is this normal?",
    "selftext": "Been running a few small influencer collabs for my ecom brand this year and… honestly, it’s messy.\n\nHalf the time I have no idea if a campaign actually drove sales. I’ll get screenshots, “estimated reach,” or a traffic bump I *think* came from them, but zero real proof.\n\nTried affiliate links, barely used. Tried discount codes , people forget. \n\nI don’t blame them either. I get that they hate commission only deals, because if my site underperforms, they earn nothing. But paying flat fees also feels dumb when you have no clue what actually worked.\n\nSo… how are you all making influencer deals *fair* and *verifiable*?\n\nDo you pay flat fees, use hybrids, or have some kind of system for tracking clicks/sales that both sides trust?\n\nGenuinely curious how experienced folks handle it, because I love the concept of influencer marketing, but the trust gap makes it feel like a bad bet for both sides.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1761826220.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9037555624673925
  },
  {
    "score": 26,
    "title": "I am micro influencer but am struggling to find brand to work with",
    "selftext": "I have 21,2k followers on Instagram while not posting for a quite a time my page visits are 5k engagement, I have recently opened a TikTok and is only a 1-2 week old and have in it 10k visits and 134 followers and the account is growing fast and am really interested in different categories as I have worked some skincare/makeup brands local and am looking for small business to work with or other businesses if anyone interested contact or comment to work together 🤍",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1754861177.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1110587674814436
  },
  {
    "score": 27,
    "title": "I bought the \"The Social Workshop\" Sosh School Course by Julia Broome so you dont have to.",
    "selftext": "If you are pondering on purchasing a course, I would highly advise to skip it.\n\n  \nThe content videos are very intuitive with the information that could be pulled from Pinterest boards (for example, a mock IG template, social media manager tools, etc). The video content reminded me of information I have found on YouTube , through the free courses on Coursea, Hubspot, Google, etc, or reddit.\n\nReviewing the comments on the video content modules, I have noticed users asking Julia question's with no response. Further, her facebook group has the same theme with only a sprinkle of her responding back. \n\n  \nIt was evident she has poured her heart into the content and I think if you are too lazy to find and exhaust all free resources - it could be a good entry point. I personally did not find the price point worth it ($280+) once I finished the course and realized all the info could be found online for free. Bummer she rarely responds to her paid students as well. ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1738111931.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.176678727502766
  },
  {
    "score": 26,
    "title": "Managing an influencer",
    "selftext": "I just started managing my first influencer and I’m having a really hard time even getting her PR, let alone collaborations. Her page is a mix of lifestyle, beauty, fashion, skincare and she has 27K followers on IG and 160k on TikTok. \n\nMy current method has been DMing brands from my personal account on her behalf and sending emails from my business account. I’ve got us set up on Aspire IQ, Upfluence, and #Paid. I also set her up with a ShopMy account (she never uses it though). \n\nI’ve tried honing in on the fact that she’s South Asian (so am I) and how she would help brands reach a diverse audience. \n\nAny advice or tips or leads? I truly believe she has what it takes. She’s super authentic and really deserves this.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1762438959.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.962988409357938
  },
  {
    "score": 27,
    "title": "Been mapping out micro influencers’ following activity to spot emerging collab trends",
    "selftext": "for the past few weeks iv been diving into creator behavior instead of just audience metrics trying to understand what influencers themselves are paying attention to.\n\nOne pattern i noticed is when a group of small or mid tier creators suddenly start following the same handful of accounts, that usually hints at a shift in what’s about to trend next. It’s like watching a creative wave form before it hits explore or tiktok’s for you pages. Iv been testing this using a tracker that lets me see recent follow activity in real time not for spying but for pattern mapping. When multiple creators from a niche (like skincare or fitness micro-coaches) start following the same new accounts or hashtags, it usually predicts the next pivot in their content style or brand direction.\n\nFor example, two weeks before de-influencing started trending again on tiktok, I saw a cluster of beauty creators start following smaller commentary pages that critique pr gifting. That overlap tipped me off way before it became a mainstream topic.\n\nNow I want to know if anyone else is experimenting with influencer behavior tracking rather than audience tracking?  \nAre there specific data points or patterns you watch for before pitching collaborations or predicting what kind of content will perform next?\n\nWould love to hear how others analyze creator ecosystems specially if you’ve found reliable signals beyond engagement rate and follower count.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1762377514.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6942180226701815
  },
  {
    "score": 26,
    "title": "How to monetize your social media audience effectively",
    "selftext": "I've been testing influencer outreach tools for the past 6 months and honestly? The marketing around these platforms is way better than the actual platforms themselves.\n\nHere's what I learned spending way too much money on trials:\n\n* Most \"influencer databases\" are just scraped Instagram data with fake engagement metrics\n* The ones that actually work are stupidly expensive ($300+ per month for decent features)\n* Half the \"verified\" influencers haven't posted in months or have terrible engagement rates\n* Email templates are generic AF and get ignored 90% of the time\n* \"AI-powered matching\" usually means basic keyword matching at best\n\nThe two that didn't completely waste my time:\n\n* One had solid filtering for micro-influencers in specific niches (but UI was clunky)\n* Another had decent email automation (but database was tiny)\n\nBut here's the real kicker: manual outreach through Instagram DMs still converts better than any of these tools. Takes longer, but the response rates are 3x higher.\n\nI'm starting to think the whole \"scale your influencer outreach\" promise is mostly BS. Quality over quantity wins every time, and these tools optimize for the wrong thing.\n\nAnyone else burned through influencer tool trials lately? What actually worked for you?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1761072732.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7008354403124057
  },
  {
    "score": 25,
    "title": "I made my Influencer Discovery database tool with 10M+ Global Creators 100% Free",
    "selftext": "**TL;DR**:  I scraped 10M+ Instagram, TikTok, and YouTube Influencer profiles (with contact emails + filters). It’s **100% free** – no subscriptions, no plans, just a simple signup.\n\n**👉 Link in the comments. Would appreciate an upvote and comment!**\n\nHey everyone,\n\nBack in university, while co-founding my matcha drink company (not here to promote it), we relied heavily on influencers for growth. The problem? Finding them was either painfully manual (scrolling through Instagram for hours) or insanely expensive. Tools like Modash, Heepsy, and HypeAuditor often cost **$500+ per month**, and as a new startup, that was money I simply couldn’t spend. Most of their features weren’t even relevant—we just needed a list of influencers we could filter through.\n\nSo I decided to build **Busterr**.\n\n# What is Busterr?\n\nBusterr is a **completely free influencer discovery tool** with over **10M+ creators** on Instagram, TikTok, and YouTube—complete with contact emails and filters.\n\n# Why is it free?\n\nAt first, I had a low-cost subscription model. But I decided to remove it entirely—I want to give back to the startup community and remove the financial barrier to finding influencers.\n\n👉 Check the link in the comments to try it out.\n\nWould love your feedback, upvotes, and comments to help more founders discover it!\n\n  \n**EDIT**: I didn\\`t expect my post to blow up like this. I spent several months to build this completely free for you guys. **To support my project and keep the database free I would appreciate Brands who do Influencer gifting to checkout my Shopify App called 'Busterr'**",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1758406131.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8648651462792234
  },
  {
    "score": 25,
    "title": "Tracking creator interest shifts to predict trends earlier",
    "selftext": "Im noticing a pattern lately when managing influencer campaigns, sometimes the creators who perform be⁤st aint necessarily the biggest ones but the ones who recently changed who they fo⁤llow or engage with.\n\nWhen a creator starts fo⁤llowing a new wave of niche brands or similar accounts, it often hints at where their content is headed next. Tracking those subtle shifts helped me spot upcoming trends before they showed up in explore feeds or keyword data.\n\nI started mapping small creator clusters based on new connections and found that when 3 to 5 mid sized influencers began fo⁤llowing each other, it often predicted an upcoming content trend in that space like clean girl beauty, AI journaling, etc within 1 to 2 weeks\n\nAnybody using audience behavior or network analysis as part of your influencer selection process? id lo⁤ve to know how you identify genuine creative shifts instead of random noise.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1761176649.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7518501484472324
  },
  {
    "score": 25,
    "title": "AI videos will eventually be 50-90% of all content",
    "selftext": "Ho take: AI will be 90% of all content online, including influencers.\n\nIMO we are the last generation that hasn’t had to compete with AI on social media.  \n  \nTotal viewer watch time across socials will stay roughly flat, but AI videos will eventually be 50-90% of all content.  \n  \nBecause short-form algorithms are zero-sum, virality becomes increasingly difficult as you have to compete with 10x more videos.  \n  \nThis does not even take into account that the already-famous/talented human creators will significantly increase their content output with the assistance of AI video editing.  \n  \nThis is great for the consumer because there will be so much amazing content in every niche you can imagine.  \n  \nBut it isn’t so great for the people who grew up wanting to be an influencer.  \n  \nWhat's your take?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1752648315.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7360829953377777
  },
  {
    "score": 23,
    "title": "How can we scale our influencer marketing effectively? (Currently ~€200k/month, fashion brand)",
    "selftext": "Hey everyone,\n\nWe’re running a fashion brand currently doing around **€200k/month in revenue**. About **10% of that comes from influencer affiliate sales** — the rest is mostly paid ads (IG, Tiktok &amp; Google).\n\nWe’re trying to **shift more towards influencer-driven growth**, both because of rising ad costs and because we think the brand trust from influencers could compound over time.\n\nHere’s our setup right now:\n\n* We work mainly with micro and mid-tier influencers on Instagram and TikTok.\n* They get a **10% commission on net sales** tracked through their unique code.\n* Average order value (AOV): **\\~€80**\n\nThe challenge:  \nEven though we’re happy with influencer ROI in general, it’s hard to **scale consistently**. We get bursts when certain influencers perform well, but can’t seem to make it systematic. We’ve tried outreach automation and some influencer platforms, but results are mixed.\n\n**Questions for anyone who’s done this successfully:**\n\n1. How did you scale influencer marketing beyond the “one-by-one” outreach model?\n2. Is there a better structure than flat % commissions (like tiered, or fixed + %)?\n3. Any tips for building a steady pipeline of creators who actually *convert* (not just post)?\n4. Have you seen success transitioning from affiliate codes to trackable links or whitelisting content in ads?\n\nWe’re at a stage where influencer marketing could realistically go from 10% → 60%+ of our sales if done right, but we’re missing a clear process to get there.\n\nWould really appreciate any insights or frameworks that worked for you.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1760193295.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8077862308715593
  },
  {
    "score": 23,
    "title": "What’s the most effective way to reach TikTok influencers for app promotion?",
    "selftext": "Hey everyone,\n\nI recently finished building a free app and I’d like to get some traction by promoting it on TikTok. I’ve seen a lot of apps blow up there, but I’m not sure what’s the best way to actually find and connect with the right influencers.\n\nShould I go through an influencer marketplace, agencies, or just DM creators directly? I don’t have a huge budget, but since the app is free, I think it could get good organic traction if I can get the right person to showcase it.\n\nIf anyone has experience with TikTok influencer marketing, especially for small/indie projects, I’d really appreciate your advice.\n\nThanks!\n\nThe app is a mobile text-to-speech tool. Users can upload any text or link, and the service converts it into natural-sounding speech. You can check it out here: [https://frateca.com](https://frateca.com/)\n\n",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1759596102.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6284075842907186
  },
  {
    "score": 26,
    "title": "I'm an influencer manager, ask me anything!",
    "selftext": "Hey there! \n\nI saw another member post the same type of post about a year ago and would love to do the same. \n\n  \nFor context, I previously worked at a well-known talent (influencer) management agency that represents many beauty influencers who are household names. Prior to that I worked on the brand side for an agency that would run brand's campaigns. Nowadays I'm a talent (influencer) manager at a new age talent management agency whose investors include large names in the tech world and a-list celebrities. ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1753317804.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.085770690350846
  },
  {
    "score": 24,
    "title": "Tell me your average views and I'll tell you how much I'd pay you",
    "selftext": "Hey, I'm from the brand side, my team and I partner with hundreds of influencers and UGC creators per year. I can see that many of you post about pricing and how much to charge for your brand deals. I am happy to help and tell you how much I would expect to pay for a partnership with you. All I need to know if the platform you are on, the type of asset you need a price for (post/tweet/video/etc) and your average views on your past 10 videos. Lets go!!!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1760193142.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.064194465025156
  },
  {
    "score": 22,
    "title": "📣 We're Looking for Influencers to Collaborate with FaceOnLive Face Search Tool!",
    "selftext": "Hey everyone!\n\nOur AI-powered **Face Search Tool (FaceOnLive Face Search)** recently went viral on TikTok — hitting **1M+ views overnight** 🎉. The buzz was amazing, and we realized it's the perfect time to double down on influencer marketing.\n\nWe’re now looking for creators, influencers, and content makers who are interested in collaborating with us — whether you're on **TikTok, Instagram, YouTube, Twitter (X)** or even running a niche blog or community.\n\nIf your audience is into:\n\n* Tech, AI, or privacy\n* Social media hacks\n* OSINT or online investigations\n* Catfish/dating scams\n* Digital safety &amp; verification\n\n…you’re a perfect fit!\n\n👉 **DM us or drop a comment if you're interested**, and let’s chat about collab options, perks, and how we can grow together 🚀\n\nThanks!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1744823731.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5663490907372553
  },
  {
    "score": 21,
    "title": "How Effective Is Influencer Marketing in 2025 Compared to Traditional Digital Ads?",
    "selftext": "I’ve been diving deeper into influencer marketing lately, and I’m noticing a big shift in how brands approach it. A few years ago, it felt like a side strategy; now it’s becoming central to how many campaigns are planned.\n\nWhat I’m trying to figure out is whether influencer marketing is actually outperforming traditional paid ads in terms of ROI and brand trust.\n\nFrom what I’ve seen, influencer campaigns seem to build stronger connections with audiences, but they can also be unpredictable; performance depends a lot on creator selection and content authenticity.\n\nFor those who’ve run or tracked campaigns recently, what’s your take?  \nIs influencer marketing proving to be more cost-effective, or do standard digital ad strategies (like Meta or Google campaigns) still lead when it comes to conversions?",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1762764333.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.697558933373859
  },
  {
    "score": 22,
    "title": "WHAT’S WORKING ON INSTAGRAM RIGHT NOW (OCTOBER 2025)",
    "selftext": "We reached 14.7M views in September.\n\n**WHAT WORKS ON INSTAGRAM:**  \n• Sharable and savable carousels  \n• Posts with a lot of value (e.g., guides, schedules, step-by-step tutorials)  \n• Repost your content 4–5 hours after you first share it  \n• Repeat one main keyword multiple times in the caption through natural repetition  \n• Posting consistently 4–6x a week  \n• Unique and valuable short 5–7 sec reels  \n• Use strong visual hooks, such as an instant zoom-in, holding a product in your hand, speaking into a microphone, or changing angles within the first 3 seconds\n\n**AND:**  \n• Sell through Stories  \n• Use a mix of Reels and Carousels for in-feed posts  \n• Share controversial content topics within your niche  \n• Maintain a branded and aesthetic feed and content style  \n• Set up ManyChat automations to run in the background every time someone replies to or comments on a post\n\nWant to learn how to turn your content into growth &amp; income?  \nComment **CREATE** and I’ll send you my free creator growth guide.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1761481731.0,
    "media": null,
    "is_video": false,
    "num_comments": 142,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.061895854750124
  },
  {
    "score": 21,
    "title": "What’s actually working for TikTok growth tools these days?",
    "selftext": "So I’ve been trying to grow my TikTok without doing anything sketchy or fake, and I keep running into tools that promise “organic growth”. Most of them either feel way too salesy or don’t actually deliver.\n\nRecently stumbled on Cloutify, from what I can tell, it’s supposed to help with audience targeting and engagement tracking instead of the usual follower dumps. I’m not here to advertise it or anything, just wondering if anyone here has real experience using it.\n\nDid it actually help your videos get more reach or was it one of those “meh” tools that sound better on paper? Also curious how it plays with TikTok’s algorithm since that thing seems to change every few weeks.\n\nWould love to hear honest thoughts or alternative tools you’ve had luck with. Trying to figure out what’s actually working for creators right now.",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1759856834.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8505432995099995
  },
  {
    "score": 22,
    "title": "Has anyone else had issues canceling Upfluence subscriptions?",
    "selftext": "\n\nI wanted to share my recent experience with Upfluence and see if others here have dealt with something similar.\n\nWe originally signed up with a clear 6-month Order Form/contract. But after the term ended, Upfluence kept charging our account based on an auto-renewal clause we never agreed to. I’ve contacted their support multiple times asking to cancel and refund, but so far they’ve refused.\n\nWhen I searched online, I found other people reporting similar billing/renewal problems with Upfluence. It seems like a broader issue.\n\nHas anyone here successfully canceled Upfluence or gotten a refund? What worked for you? Should I escalate this to my bank, a consumer protection agency, or even arbitration?\n\nAny advice or similar stories would be really helpful. Thanks in advance!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1758253090.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6837878273455553
  },
  {
    "score": 21,
    "title": "What’s the Safest Option for Buying TikTok Comments? Any Recommended Providers?",
    "selftext": "Hey all,\n\nI’ve been thinking a lot about patterns I’m seeing in how videos get traction on TikTok, and one thing that keeps coming up is early engagement especially comments. Engagement seems to play a big role in how the algorithm surfaces content, especially when a video is brand new.\n\nI know a few creators have mentioned that they’ve used services to buy TikTok comments in the early days to help their posts get noticed, and I’m genuinely curious about how this approach works. The idea isn’t to fake interaction, but to give a post some initial social proof, so that it attracts real users who engage naturally.\n\nSince I’ve never bought TikTok comments before, I’m cautious and don’t want to make the wrong choice or risk damaging my account. Before considering this, I’d love to hear from anyone who has:\n\n* Tried services that deliver comments in a way that looked natural  \n* Had experience with boosting early engagement using comments  \n* Noticed any difference in visibility, reach, or real engagement after  \n* Thought a provider felt *safe* and didn’t negatively affect their account\n\nI’m not here to promote anything, just trying to get some genuine insight into whether this method is worth trying, and which services are safest. If you’ve had any experience, I’d love to hear your stories and suggestions!\n\nThanks in advance!",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1765548005.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.733501696493316
  },
  {
    "score": 20,
    "title": "I jumped from 2k to 50k followers in six months using simple watch time trick",
    "selftext": "Six months ago, my TikTok was stuck. I had around 2k followers and I was trying all the wrong things like perfect lighting, overly produced videos, and trying to cover too many topics. I thought consistency was enough, but my videos kept around 300 views.\n\nEverything changed when I shifted my focus entirely away from production value and towards the viewer's retention. Here are the simple tactics that actually worked and got me to 50k. I stopped starting videos with long intros and began using a powerful, controversial, or benefit-driven text hook right on screen in the first 3 seconds. Instead of trying every trend, I narrowed my content to two specific niches. I stopped finding creators for collaboration. I started actively using the Duet feature on trending videos relevant to my niche. I tracked my analytics, focusing on completion rate. For that i used a tool where i set hashtags and demographics and my videos automatically pushed towards actual audience.If a video had a poor completion rate, I broke it down to see what part of the video caused people to scroll.\n\nAfter making these changes, my followers jumped from 2k to 50k in six months, and my average watch time improved over 60%.\n\n",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1764416465.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.608430635145022
  },
  {
    "score": 21,
    "title": "Brand refusing to pay me after delivered work",
    "selftext": "I am a digital creator and I agreed to work with a pet brand on advertising their harness on my Instagram. The agreement was done via email and they said that their expectations were as follows: 1 reel, 1 story, and a 14 day link in my bio. Once they approve my content they asked that I post on my Instagram ASAP and said payment of 300$ will follow 15 days after my post goes live. They asked if I would be willing to give them additional photos for commercial use or permission to use my video for advertisements and I told them no since their budget was already significantly lower than my rate so I didn’t want to add anything extra to what they were already getting. I submitted the video and they replied back that they want brighter lighting and more outdoor shots so I had to redo my entire video. I agreed to it and made the adjustments as requested and submitted it back and was told my video looks great and that I am set to post and was asked to send a link to my post once it’s live. An hour after this approval email they sent an additional email attaching a ‘collaboration contract’ for me to sign. Never once did they mention a contract and in the contract it said their company has usage rights to repost my content on their socials whenever, exclusivity that I can’t post other brands and is very vague, and said I am required to keep their video post on my Instagram for 12 months. None of this was part of the agreement we had via email. I explained to them I will not be signing a new contract as all my deliverables were met and already approved and I did not agree to what is stated in this contract and they said to me they cannot release payment unless I sign it and that all influencers grant them permission to repost their videos so I should be ok with it. I emailed again that adding additional terms after deliverables were met is unacceptable and that the contract either needs to reflect exactly what was agreed upon or they need to eliminate the contract. I have followed up 2 times and haven’t heard back from the brand and even sent a letter that I will take legal actions if I do not hear from them. At this point is taking them to court worth it? Has anyone else ran into this issue? I put in a lot of work for this 300$ video so I do not plan to just let it go, I want to make sure they pay me for my time. Any advice would be helpful! ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1757396062.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6717994812986205
  },
  {
    "score": 21,
    "title": "As a brand, what size influencer can I expect to work with for $500 per TikTok video?",
    "selftext": "Hi! We’re a e-commerce brand in the wedding industry that’s been growing pretty fast organically, and this year our strategy is to primarily use influencer partnerships as our marketing strategy. Our product value is quite high($200+), we have been offering PR packages via cold messages to micro/mid-size influencers on TikTok who are also bride to be, the response rate is about 10%. We had about 4 influencers with &lt;15K followers, and 1 influencer with &gt;200K followers to post about us, but to be honest, we’re not very happy with the quality of the video, they felt a bit too casual (some filmed in their cars). \n\nWe tried one paid collab so far with an influencer with good engagement for $500 per video, the quality, enthusiasm and result was so much better! So paid collab feels like the way to go.\n\nWe’re a new company and we don’t have a ton of budget for marketing so far. We were sent quote that goes all over the place from agencies. So I want to reach out to this community, specially the agency / talent managers: for $500 per video + $200 product, realistically speaking, what size of influencer can I expect to work with? This will help us reduce so much time in outreaching! ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1756097940.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8740473260211568
  },
  {
    "score": 21,
    "title": "What software tools do you use for searching and landing influencers?",
    "selftext": "Hi all, \n\nI'm the only marketer in a startup and I'm so frustrated finding influencers manually for my brand. We are launching a new AI product for gamers but I'm searching keywords in YouTube and TikTok manually. Agencies are super expensive and apparently want 10-30% of deal size.   \n\n\nAnd, is there a better way than DM-ing or emailing influencers? Most of the times I don't get any replies. I'm not sure if it's my message or they are overwhelmed.\n\nI'm curious if the community is using **software solutions** for this? What are good softwares and why? \n\nAre you also frustrated? What's your experience with this? There MUST be a better way than this. ",
    "subreddit": "influencermarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1711401334.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.051961727010243
  }
]