[
  {
    "score": 291,
    "title": "Finally Landed an IT Role With No Degree!",
    "selftext": "Hey everyone, just wanted to share that I finally received a job offer for an IT Help Desk Coordinator role and wanted to share steps I took.\n\nTo start of I had a basic background in troubleshooting and building computers. The first thing I did was I worked toward my CompTIA certifications earning the A+ and Security+, and later getting the AZ-900 after it was recommended to me.\n\n**Quick Tip***:* If you’re a recent graduate, use the CompTIA student site for discounted exam vouchers. Also, for the AZ-900, Microsoft sometimes offers free 100% discount codes through specific webinars.\n\nAfter certifications, I focused on hands-on projects:\n\n* I downloaded a ticketing system, created and documented tickets to show familiarity with help desk workflows.\n* I set up Active Directory in Azure, added and managed users, reset passwords, and practiced assigning users to groups. There was also a Linkedin course on active directory I followed which helped alot!\n\nAnother thing that helped a lot I asked my manager if I could shadow a help desk technician during my lunch breaks. Thankfully, they approved, and it gave me great insight and was able to get alot of questions answered and see day to day work.\n\nLastly, networking played a big role. I joined a few Discord groups for IT professionals, and through one local group, I got resume formatting help and even attended an event where I connected with a few IT managers and they shared advice and what they look for in a candidate.\n\nIt definitely took time and patience, but I’m grateful to have reached to receive the offer. My next step is to pursue a degree while working to keep building my future career.\n\n  \nIf you have any questions feel free to ask!",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 291,
    "downs": 0,
    "created_utc": 1762622847.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.167276765121196
  },
  {
    "score": 264,
    "title": "MY DAD GOT LAID OFF AGAIN FROM HIS JOB!! (IT WAS OUTSOURCED)",
    "selftext": "I swear my dad has the worst luck. He’s been laid off from his last three jobs, and every time, it takes him a long time to find another one. I’m very far from knowing anything about the IT world since I’m in accounting, but I was hoping to get some advice on where he can start looking for a new job. We know he can go on job boards, obviously, but these days that feels like such a scam. I’m thinking about recruiting or staffing companies that specialize in IT. I just feel so bad for him, and every time he gets laid off, it gets harder on them financially.\n\nAny suggestions?",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 264,
    "downs": 0,
    "created_utc": 1760732998.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.223809891775927
  },
  {
    "score": 200,
    "title": "Job hunting in tech is declining alot of people's mental health",
    "selftext": "Hello guys, this needs to be talked about. How many times have you guys opened reddit only to see someone with the CompTIA trifecta being unable to find a job? Or worse.. a full on degree. This is demotivating to those like me who are currently pursuing a career in IT. I'm pursuing an associates in IT but sometimes i dont even feel like pursuing it anymore. The problem is, i wouldn't know what other career to pursue. I've done sales &amp; hated not having a stable pay and being pushy. My mental health is declining &amp; even if i delete the app, that still wont eliminate the fact that the market sucks. Im sure alot of people here are going through the same thing. My question is how can i cope? I literally cannot stand going on linkedin or indeed anymore because it just feels like i'm throwing in a random resume for no reason. ",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 200,
    "downs": 0,
    "created_utc": 1698319722.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.998892399999601
  },
  {
    "score": 188,
    "title": "Why is IT seen as inferior than computer science?",
    "selftext": "I got a computer science degree and I considered taking some CompTIA certs. I would've also considered changing my degree if my college offered it. The professionals I discussed the idea to, such as my professors, scoffed at me saying that why would I consider that if I am already getting a comp sci degree. I also have noticed a lot of comments like these online. It really irritates me. Now I have little to no foundation when it comes to anything other than coding since I find it very difficult to learn independently and it's very frustrating.\n\nI became a software engineer shortly after I graduated and I was MISERABLE. I am very extroverted and having to code most of the day other than a meeting or two made me very depressed. There is no point in making more money if I cannot enjoy my life enough to use it. I had an IT support job in college and I want to continue growing in that area. I had a job after similar to a Technical/Application Support Engineer where I got to talk to clients more later on and I really enjoyed it, but I feel like I am lacking a lot of the knowledge that allows me to continue growing in that field.\n\nWhy is this considered inferior? Other than the pay of course, which I also think shouldn't be as low.\n\n  \n\\---\n\nEdit\n\nOriginally posted it in the CompTIA subreddit since I mention the exams at the beginning of the post and part of the reason why I posted it was because I am considering taking the exams, but it got deleted by admin. It is understandable though since the topic ended up straying from the exams. I hope this is the right subreddit. I read the rules in many of the related ones and I found it difficult to discern which one it belongs to.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 188,
    "downs": 0,
    "created_utc": 1746205161.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.039128688420747
  },
  {
    "score": 171,
    "title": "My first year in IT",
    "selftext": "1 Year in IT....\n\n\n\n\\- 3 Certifications\n\n\\- 400 tickets\n\n\\- Campus infrastructure upgrade\n\n\\- Building a new domain\n\n\\- Far too many manuals read\n\n\n\n\n\nIt is mind boggling to think I have been in IT for a year already. Since I took the position of IS Associate I have had to rapidly grow my skillset. Day one I stepped in and was handed the reigns to our entire IT ecosystem. Network, server, M365, you name it I got to touch it. Quite literally speaking its the dream of any aspiring IT student. However, I didn't only get handed the ecosystem. I was also tasked with running our in house help desk. The most notable \"soft skill\" I had to improve was my interpersonal communications. I had to learn how to switch from my server administrator hat to helpdesk technician. Not only did I have to quickly shift my mindset, but I also had to learn my individual users. No one person has the same level of technical understanding as the next, so it was crucial that I could communicate effectively over chats or the phone. I am beyond grateful for the opportunity I have been given to step into the field I have dreamed of working in my entire life. I'm happy to answer any questions about my experience so far.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 171,
    "downs": 0,
    "created_utc": 1760473332.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7336796972911923
  },
  {
    "score": 167,
    "title": "I GOT THE JOB. IT/ADMIN SPECIALIST",
    "selftext": "So, I've made two posts on here about this job, and after a month or so of the whole interview process, I start tomorrow. I asked for advice on here, and I thank each and every one of you. The pay is 65k a year. I have no experience, and I am just in the process of getting my network+, which honestly, I might skip and study for the security+ since I want to get into the security side of IT. Man, I guess I've finally broken into tech??",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 167,
    "downs": 0,
    "created_utc": 1744589191.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.712884270885816
  },
  {
    "score": 152,
    "title": "Just got laid off. Looking to start new career in tech",
    "selftext": "I’m 40 yrs old. My wife is about to get her masters in Data Science. I had a junk job but was able to afford supporting the family. It paid well. But I just got laid off.  I’m looking to start a new career whether is self taught or back to school.\n\nKnowing what you know now, what would you suggest as a field to get into? Front end developer? Software engineer? Full stack developer? Data analyst? Cybersecurity? IT tech?\n\nWhat would the road map be?\n\nI would like to follow her footsteps and get into data science but my math is horrible.\n\nPlease any advice will be great.\n\nPS. I took Internetworking back in high school and Some computer Science courses in College including A+ and command line, intro to PC, Intro To networking etc etc. just never got too far into it. So I’m not completely oblivious to the field.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 152,
    "downs": 0,
    "created_utc": 1760902903.0,
    "media": null,
    "is_video": false,
    "num_comments": 204,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.008068361345476
  },
  {
    "score": 144,
    "title": "APPLY FOR THOSE OUT OF YOUR LEAGUE IT JOBS! Trust me.",
    "selftext": "Hi everyone!\n\nI (23F) have been in (doing my own side gig) IT for about 5-6 years now. I do not have any certs, no degrees whatsoever. My first job was a help desk technician for a school district. It was an entry level like most, and it was a GREAT experience and looks good on a resume imo. I then moved locations and then got hired at another school district. Once I was kinda fed up or bored with help desk as it is very easy and only so much can be learned… I was on the hunt for something better, more challenging and rewarding. Cybersecurity. I again have no certs or degrees and I just recently (3 weeks ago) landed my DREAM cybersecurity job at a high end bank working from home, making around 80k a year. The people are amazing, and the work is rewarding. All because I applied to the job knowing I had a big chance of not getting it. But I was wrong. They love my personality in the interview and loved that I was honest with them about what I knew. I now am studying cyber and am loving it.\nPlease apply for the jobs you dont think youll get, it might surprise you.\n\nSincerely,\nA  Cyber Security Operations Center Analyst level 2 (CSOC)",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 144,
    "downs": 0,
    "created_utc": 1698370408.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.720246918075762
  },
  {
    "score": 133,
    "title": "My career feels absolutely fried 3 years in. Having so much regret.",
    "selftext": "I graduated in cybersecurity in 2022 and three years in I'm still in a role that requires me to troubleshoot level 1 issues. I see other people who work in the tech department (security and software devs) literally not work full days on the regular. Come to work after me and leave hours before me. Can't be remote a single day. I expressed interest and one of these roles and the role went to an external hire with less experience than me lmao. \n\nMy career feels absolutely fried. I'm adored by almost everyone here and while that's nice it hasn't done anything for my career. It's gotten to the point where I'm picking up some of security's work just so I can put it on my resume and use it to get another job. \n\nI've been researching all weekend things I can implement at work using AI just to justify me having a different role because I don't see anyone else here trying to implement anything using AI or trying to automate processes. \n\nI feel like my career is on a death spiral. I seriously can't take not progressing. I can't even get an interview now. 3 years ago I was getting a ton with ZERO experience. \n\nAny advice is appreciated.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 133,
    "downs": 0,
    "created_utc": 1762833256.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8064987120375857
  },
  {
    "score": 124,
    "title": "I dont want a career in IT anymore",
    "selftext": "The thought of working 9-5 in an office depresses me, idk how u guys do it. On top of that, talking to people all day over the phone and potentially being on call. Unsure where to go next?\n\nIm also not a morning person so i’m thinking of careers i can work the 2nd shift or 3rd shift like aviation or manufacturing.\n\nAlso, i live in south florida. Getting off of work at 5pm here is an extreme sport.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 124,
    "downs": 0,
    "created_utc": 1748887466.0,
    "media": null,
    "is_video": false,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8478318069804427
  },
  {
    "score": 122,
    "title": "I am proud.",
    "selftext": "Hello everyone who reads this, I am a ordinary dude who just wanted to change. \n\n  \nJust wanna give a little update and etc to potentially help anyone looking to break into IT, I was a low voltage electrician for about 4 years working for a security company. Age (19 - 23 ); one day I went into work and just had a crazy bad day like i'm talking it felt as if it broke me. I went home and instantly knew I needed to change because I didn't wanna do this for the rest of my life working 5 12 hour shifts a week and on call saturdays. \n\n  \nThis enticed me to call a recruiter for the MN National Guard, at the age of 23 lol. Everything went smooth scored high enough on my asvab and took a tech job mainly because it had a big bonus. But during my time in the army, my whole plan was to go back to college to finish my electrical engineering degree. Then during AIT I genuinely started to become insanely interested in IT specifically Networking, showing up to school everyday and running cisco packet tracer and doing things excessively was actually not bad to me I enjoyed creating networks and troubleshooting and so much more. \n\n  \nFast forward 7 months of army school (25H), I get home and throw a single application to a help desk position. Then tons of more low voltage jobs like I was doing prior. To my luck, I got chosen to come in and interview after many follow up calls on my end, I did my research though on who owned the company and he was a veteran. This was an instant social connection and I feel as if gave me tons of brownie points. I ended up getting hired about two weeks later over tons of applicants who even had bachelors and everything. \n\n  \nBeen working here about 4 months now, and I am the guy who sets up all the vlans for switches and setting up the routers configuring networks and still talking the calls to help people who forget their passwords too many times lol. Pursuing a degree through WGU ( Network + Cloud Engineering Cisco Track ). But bottom of the line of me telling my timeline of IT, is just be social make connections. And sell yourself as well as selling your skills. I know this was a ramble fyi, i'm trying to work on my writing skills still. Thank you ",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 122,
    "downs": 0,
    "created_utc": 1759885687.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4860147588063577
  },
  {
    "score": 117,
    "title": "What NOT to do in Active Directory",
    "selftext": "I’ve been in the industry for just over 17 years now. Worked with Active Directory for much of that. \n\nThere are some bad practices I’ve seen in environments I’ve inherited in various in-house IT jobs or worked with in an MSP capacity that I wanted to share here:\n\n- NEVER put GPOs on the root of your AD domain. It may seem simple and obvious when setting it up as a new domain but trust me later down the road as it grows into a bigger more complex beast, you will be much sorrier later\n- Avoid too many nested/sub-layer OUs. The more nested you go the more complex your GPO link schema becomes and the larger and hairier your AD object string becomes. Try to keep OUs minimal, organized, and efficient when it comes to nesting/sub-layers\n- Keep watch on your AD Connect if using Entra/Azure. Too many times in the past I’ve seen folks get burned by not realizing or paying attention to sync failure alerts because something broke either due to expired certs or an issue with the account or sync connection(s), and then all hell breaks loose with password changes, accounts needing disabled/enabled/ created, onboarding impacted, etc. . \n- DO NOT change or modify the default domain policy!! Trust me that is similar to point one above. It may seem easy and obvious now but ten years from now you will be cursing the day that decision was made. Make a separate “defaults for everyone” policy and link it to subsequent OUs as applicable instead so you can more granularly control its effect and change it as needed, even delete it without affecting a built-in GPO\n- Limit your domain admins. This one should be obvious but a lot of orgs out there take this for granted and waaaay too many people have master keys to the city as a result. Some not even realizing it. Accounts get compromised and well….its not pretty sometimes\n- Keep an eye on SYSVOL replication and make sure if there are any plans to demote domain controllers and replace them that everyone’s on the same page and communicates. I recall a few cases where someone failed to communicate, shut down a DC or two to deprecate and replace, and SYSVOL replication broke, causing all kinds of havoc for entire orgs\n- ALWAYS have a test OU with broken inheritance so you can test GPOs and troubleshoot issues to your heart’s content without impacting anyone else. Just make sure it’s not below an enforced GPO in hierarchy\n- Lastly make sure you make liberal use of “protect from accidental deletion”! That feature is a god send for insurance against overly-clicky sysadmins or over-ambitious help desk escalation folks that tend to nuke by accident or even yourself on a low-coffee day",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 117,
    "downs": 0,
    "created_utc": 1728922289.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.338972630329938
  },
  {
    "score": 110,
    "title": "It's all my fault",
    "selftext": "So, I have something to admit.  It's all my fault.  \n\nI work in IT and when relatives or friends ask me to help them with even the most obscure, mundane, technical support of any kind, I eagerly offer to lend a hand.  They come up to me all the time and I say \"sure, no problem, I do work in IT.\" \n\nFor all the other IT collegues out there, I apologize for any undue burden this behaviour this may place on you with your friends and family.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 110,
    "downs": 0,
    "created_utc": 1722272640.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.481401994457767
  },
  {
    "score": 108,
    "title": "Update: Got laid off",
    "selftext": "For context I posted a while ago with the title of “I feel guilty”. \n\nWell that day after work my company that I contracted through called me asking how it was going and I told her how I wished there was more for me to do and more for me to learn, and today I was pulled into the office and was told with there not being enough workload, and me not having the permissions to work on said workload they were going to have to cut my contract short today. \n\nBack to the job search, we all got this.\n\nEdit: just got a call back from my contracting company and here was some feedback:\n\n1. “Too many people saw you watching YouTube which made it look like you didn’t have the tenacity”\n\nWhile yes, I was on YouTube and i acknowledge that I shouldn’t have been so often, I asked over, and over, and over for work to do or even to give me minimal permissions to do help desk tickets, which was either met with a roadblock or ignored. I was also creating a .bat script that would go through the pre-determined bloatware to delete, then it would install the apps we wanted, and I requested for AutoHotKey to automate the wizard, which was also ignored. This was to get around the fact we didn’t have an imaging server and I didn’t have the permissions to create one.\n\n\n2. “When the other IT guy would show you something, you wouldn’t ask questions or even go back to try and do it yourself.”\n\n\nHe showed me 2 websites that I didn’t have access to, so I couldn’t go back and try and do it myself. I didn’t ask questions because they’re legit just websites for AD and RDP, which I’m pretty sure I could figure out how to use IF I HAD THE PERMISSIONS.\n\nThis just sucks so bad, and it hurts to hear that I “wasn’t doing enough”. I asked for more things to do, I asked for permissions, I tried everything I could. I did what the other IT guy asked of me, I did the tickets I was capable of doing. It hurts and it’s so disheartening to hear.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 108,
    "downs": 0,
    "created_utc": 1752778462.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5530471166284174
  },
  {
    "score": 103,
    "title": "First IT Job",
    "selftext": "One Month In\n\nI recently left a career of 28 years, passed A+ and found an IT job. I'm one month in, and this is what it is looking like. \n\nOne month has been a bit of a dumpster fire. They decided previous guy was too \"cancerous\" to keep on until I started. No other IT. \nFirst day was spent trying to find passwords, what programs are used, just basics... Until 10 minutes to end of day. One of the networks went down, stopping production. No clue where to even look yet. Scrambled for an hour before noticing a flashing red light on a server. Restart and all good. \n\nWalk in morning two, and office mate says, \"I suppose you know half the factory doesn't have Internet.\" Nope, not aware of that. I haven't even found all the switch racks yet. VP and plant manager start walking with me to find all of them. Of course, most are 10ft off the ground. Get to 6th cabinet and notice no lights. Get a 10 ft step to find that battery backup has gone completely bad. Temporarily plug switch into wall outlet and everything comes back up. \n\nWalking back to my office, pretty proud of myself, only to be told network is still down. \nI find server console, but we have no admin passwords. Try numerous versions of other passwords we found. Someone who was friendly with previous IT guy calls him. He claims he didn't remember any admin passwords. Someone remembers a temp admin password he had set up previously, and it looks like several of the other passwords. I start trying variations. One 'm' on the end. Two '!'. So on, into I actually got in! Meanwhile, VP is trying to reach IT service used before. They get a hold of me 5 minutes after I'm into console. They remote in. After 2 hours, he can't figure anything out. He escalates to guy who built the system after a data breach a few years ago. \n\nThey work for 2 hours, and suddenly VP runs in, \"I don't know what you did, but most of it is working!\" By this point it is 45 minutes after end of day. We agree to connect the next morning because they still can't even find 6 of our virtual servers. \n\nNext morning I come in and get busy digging. Before service calls, I manage to find the hidden servers and get them all spun up. Finally everything is working. I start hearing that there are wagers on if I'll be back for day 4, or week 2. \n\nFinally, at the end of week 3, I have access to all the vital systems, found a virtual server that previous guy had installed to give himself remote access, convinced Cisco to change admin so we can access our phones, and finally get backup server working correctly. \n\nAnd of course, the whole time I still have printers going down, copiers needing attention, and oh, did I mention new parent company wants me to install new anti virus on every machine in 8 days... and they took local access to Intune away! I had to physically go to all 121 computers to install. I held meetings to walk laptop users through the update all at once. That was worse! I would have been faster to just do them all myself.\n\nWow, I love IT!",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 103,
    "downs": 0,
    "created_utc": 1749306274.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.517772797819908
  },
  {
    "score": 107,
    "title": "I'm tired of working in a help desk job.",
    "selftext": "I earned my bachelor's degree in Computer Science. Right after graduation, I worked as a Test Engineer for a year as a contractor with Microsoft, followed by nine months as a Support Engineer, which I did not enjoy. However, after being laid off, I couldn't find a job for a year. During that time, to support myself, I worked as a security officer at minimum wage, which was a difficult period as I struggled to take care of myself. After a year, I applied for a Help Desk job, which is better than my security job, but I still don’t like it—especially in terms of salary and the repetitive audits I have to do. I don’t know what to do in this job market.I am still confused what should I do with my career?",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1746124683.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5725300123746218
  },
  {
    "score": 97,
    "title": "I F**** did it..",
    "selftext": "I managed to land my first InfoSec job...long story short..this new job is considered to be a department transfer so there will be no increase in pay unfortunately but I know breaking into this field is damn near impossible at the moment due to all the tiktok people who are trying to get in.\n\nOnce the market gets better I will attempt to find another opportunity that is more rewarding. For the time being though, I will absorb all the entry level info sec knowledge I can and take this as a great stepping stone in my career. I shouldve known that having 958320583209809583209850328532085320509832 certs along with a bachelor degree and security clearance will not guarantee me a job.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 97,
    "downs": 0,
    "created_utc": 1726002263.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3431028761689094
  },
  {
    "score": 95,
    "title": "Too much negativity",
    "selftext": "I get it. Its hard looking for IT jobs. It sucks, it makes people depress. I cant find a job in IT. Just finished my bachelor’s degree, about to start Master’s. Sometimes when i read all the negative things about IT jobs i start doubting if im making the right choice. But i think its all about mentality. We can only control what we do. Im studying to get my Comptia+ cert to give me a bit of an edge. I want to see more posts of people that have IT jobs about how they got into it. More advice and tips. I think if we start seeing more positive posts people are going to be more motivated to better themselves. Negative energy manifests negative energy. Same with positive energy. My 2 cents. \nPs. Anyone offering a job for recent graduate? Lol seriously?",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1708532851.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6619662363620247
  },
  {
    "score": 91,
    "title": "Fight End Users",
    "selftext": "Have any of you guys ever been challenged to a fight by an end user? This particular user is upset because the troubleshooting steps we give them require a reboot and this user would rather cut off their limbs than reboot their laptop. We told them that this is the best recommendation we have and it resulted in them wanting to fight...literally...they said \"we can go talk about this outside since you want to sound so tough.\"\n\nI am honestly very tempted to go through with it. This person is a POS and nothing would gratify me more than to knock some sense into him. I am leaving the company next week anyway so it would be a great departing gift.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 91,
    "downs": 0,
    "created_utc": 1713465430.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": true,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.491939077729199
  },
  {
    "score": 81,
    "title": "Fired out of the blue",
    "selftext": "I was just fired after my third month in a contract position. I was in a network analyst position and no one complained about the quality of my work. Even when I heard from my recruiter, they told him that they wanted someone with more experience, a CCNA and who lived closer to their other network analyst's home state. I'm just shocked right now, I know that I need to job search and I've been given two weeks but I was told that a car would be necessary for this job so I took out a loan and got a car. I feel so screwed.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 81,
    "downs": 0,
    "created_utc": 1711400771.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3758478745588545
  },
  {
    "score": 74,
    "title": "Sick of Power users",
    "selftext": "I'm tired of working with Point of contact's that don't know shit in I.T but have the highest technical title at the company. Like people jump into the field to get a check and aren't even interested in I.T. They don't know shit at all. How are you gonna be an internal IT manager for a whole company and not know how to map a network drive. They are glorified delegators. Delegate task all day. Then you have a people that have been in IT and tech for years and can't ever get a job like that. Like how are they getting these jobs. Then they always have an excuse like I know a bit but not all that that's what one of them literally told me. Like MF what do you know it seems like nothing. How can you be in charge of a dept and know a bit makes no sense. ",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1765551744.0,
    "media": null,
    "is_video": false,
    "num_comments": 106,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.527253152234305
  },
  {
    "score": 71,
    "title": "Your Major doesnt matter.",
    "selftext": "The question of \"should I switch my major\" keeps coming up.\n\nThe hard truth is your degree isnt going to differentiate you when you're looking to get hired.\n\nAll these questions about if you should switch your Major year 3 from CS to Information systems or the other way around or to Cy Sec are crazy.  Changing your Major is a waste of money, unless you can do so without taking additional courses.\n\nThe hard truth is college is NOT preparing people for the job they are about to walk into from what I am seeing hiring.\n\nIf you can say \"I have a bachelor's degree\" to pass the ATS filters, that is the extent your degree is going to help you.\n\nNo matter what you pick, you're going to have to apply for jobs for a long time, get lucky, or have connections.\n\nTLDR, what you Major in doesnt matter (as far as which tech degree) and it's not going to make you stand out from the others.\n\nSo pick the Major you enjoy the most that is tech related and just get your degree over with.\n\n\nBonus answer, getting your masters is a waste of money unless it's and MBA or in a future tech sector.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1760697377.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.321589466370212
  },
  {
    "score": 69,
    "title": "Veteran IT Guys",
    "selftext": "What’s something in the industry, that no matter how many times you’ve done it, you still hate.\n\nI’ll go first, terminating Ethernet cables…I hate it!!!  I’ve been doing this for 20 years and I loathe terminating cables.\n\nMy hands are too big, they cramp up, my eyesight has gotten worse…I hate it more now than I did when I started. \n\nI’m a coder now, but every once in a while I find myself having to do this, right now I’m rewiring my office and I had to walk out and smoke a cigarette out of frustration.\n\n/endrant",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1763504954.0,
    "media": null,
    "is_video": false,
    "num_comments": 168,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.664041392321094
  },
  {
    "score": 69,
    "title": "Switching careers to IT?",
    "selftext": "A little background; I’m 30, a CT technologist at the moment (aka CAT scans) and making about $36.50 an hour. I have over 7 years under my belt, I’m good at the job but the money is a problem. Living in CO feels impossible and plus, working in an ER feels like a toxic relationship. \nI had questions about switching over to IT. Since I already work a lot with computers, ever changing technology, different machines, IT is something I’m interested in. I’m aware of the starting wages for IT and that’s what concerns me. Trying to be realistic, but I’m already struggling with 36 an hour!! Does IT require taking a lot of call? What are the hours like (can I do 3 12’s for example)? Are you happy working in IT? What kind of certs are best? TIA",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1704494724.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.474857666323566
  },
  {
    "score": 68,
    "title": "FIRST IT JOB - Some stupidly simple but effective advice",
    "selftext": "Okay this is for those starting their first entry level IT job. These are only based on my first week of experience in my current job so this thread is primarily for new ITs (help desk/desktop support) looking for someone else in the same boat as them with some advice on how to set the tone in their job during their on-boarding phase. So here’s what I learned: \n\n1. **Be an extrovert** - this doesn’t mean tough luck to introverts but just in general, you need to be prepared to have a lot of interactions with people. I know a lot of us in IT aren’t the most social creatures but it’s good to set your expectations because you are working in an extremely social environment, most of us arent just answering calls and sending emails in an isolated cubicle in corner. It is also handy to set a strong impression on your co-worker’s and users off-premise you need to seem approachable and pleasant to talk to.\n\n2. **Emphasis on Soft Skills** - A lot of us pride ourselves in our fancy technical skills and such but that’s simply not enough. For instance, the reason I was picked over 9 others was because I did very well in the interview and they were able to tell how eager I was to work and learn. I know i have essentially the same qualifications as them because we were all graduates of the same program. Beyond the interview as well you will be communicating with users in-person, through emails, live chats, calls etc. and it’s handy to be able to communicate your thoughts across and be able to listen effectively. \n\n3. **Get over the impostor syndrome** - I know I suffered through this a lot before starting but it is absolutely a natural thing to feel. I would even say its better than going in a lil too confident in your skills. So It’s okay to feel like you’re not fit for the job but sticking to this mentality will definitely keep unfit for it. So acknowledge your weaknesses and find the room to improve to better suit your work.\n\n4. **Take great notes** - in IT, DOCUMENTATION is EVERYTHING. Everyone must understand this, from inventory and knowledge bases to incident reports, you really must take great documentation. Where I work we’re required to document and ticket everything even if they approach us in person we have to tell them to submit a ticket because these records are important for future troubleshooting and inventory allocation. \n\n5. **Get to know your company’s system** - a little bit more of a technical advice but one of the very first steps your should keep in mind is really get to know how your systems are set up. It’s not enough to just go through training, you need to know how everything works and connected to everything else. This could mean how workstations are set up, what devices you administer over, what type of tasks you are expected to do on a daily basis, how accounts are set up etc. Creating a comprehensive mind map is very handy in allowing you to visually understand how the different services your organization connect together. \n\n6. **Ask a lot of questions** - trust me you don’t look stupid asking questions they are actually more concerned when you don’t ask questions at all. Often times when they introduce you to their services and systems they don’t expose you to all details comprehensively (obviously), asking questions shows that you are able to find missing pieces and are eager to fill in the gaps no matter how small. So ask questions and know that theres nothing that they hate more than a newbie guessing around their systems. \n\n7. **Relax** - We are all eager beavers wanting to do our very best, sometimes we overwork ourselves in the name of our jobs but we all have to find that balance. You will be learning a lot during training and learn even more at work. So give your brain a rest and dont think too much about your job.\n\nNote: Special thanks to the people who responded to my previous thread on helping me feel more confident at the start. \n\n",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1720299898.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.265319095073274
  },
  {
    "score": 65,
    "title": "How hard is it to go from Helpdesk Technician to System Administrator?",
    "selftext": "Hello everyone. If someone who \"mastered\" being a Helpdesk technician (basically meaning he can do literally anything as far as job responsibilities without even resorting to any type of help) goes onto a system administrator role and literally shadows SysAdmins at that new job and keeps doing hands on duties under their supervision continuously, how long will/should it take before that person becomes \"comfortable\" at performing the SysAdmin roles without much help.? Thank you",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1739017609.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.383637949044969
  },
  {
    "score": 64,
    "title": "22M and a System Admin after just under 2 years with Company.",
    "selftext": "Hi, \n\nFor those of you struggling to get into IT, figured my situation could give you inspiration. I only have my associates degree and some bs non industry standard certs from community college. During college I worked in a factory while getting my degree. \nRight after college I just kept applying to IT jobs non stop till I finally got one. I worked remotely as a service desk technician. At the end of this month, I will have been with my company for 2 years. I recently got promoted to system admin and am currently getting trained in this role. I also already work with AWS Kubernetes sites and help our coding team with devopsish like tasks. Kinda that gray area where I don’t require coding knowledge. I don’t currently plan on going back for my bachelors as I’m already in a good spot and work for a great company that trains employees into new roles instead of hiring new. Overall im grateful to be in the position I am in. This is why when I always make sure to do the small things and wish everyone a good day after I finish their ticket. I think it’s important to not let any negativity get to you as often it’s just frustration from the end user. Even though it can be rediculous sometimes.\n\nMy advice to those just starting out:\nClearly define your plan of making it further in the industry\n\nJust because I didn’t get the standard certs, doesn’t mean you shouldn’t they can make it way easier to get your foot in the door\n\nTry to find a a company that will pay for your education \n\nTake anything that comes your way to start and just get experience for other jobs\n\nWork on being positive even though employees/customers can suck. Its part of the industry because people get frustrated with things they can’t understand. Just chuckle and laugh it off. \n\nWork on social networking, this will lead you to better opportunities down the road \n\nWork on public speaking and overall being friendly. This biggest thing with your first IT job is they want people that are bright and cheery and have good customer service. Im socially awkward myself but i try my best lol. \n\nIf you notice reoccuring issues that you think you can automate said task with a powershell script, look into it. Use chatgpt to help with the script if needed. Just make sure you aren’t putting in company sensitive data. \n\nIf anyone needs advice feel free to hmu. Or if you just want a friend. Im a christian, i like gaming and anime. Then obviously computers haha. I just wanna help where I can so people can thrive in what they enjoy\n\n",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1715402803.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.262170326581799
  },
  {
    "score": 61,
    "title": "Just got offered my first IT job!",
    "selftext": "\nTL/DR Got a job in IT and got to sit at my new desk already, even though I don’t start for almost a month. \n\nI know it’s a common thread on this sub. But I’m stoked! I’ve been going part time to HACC (Local community college) for the past three years. Started with the CIS degree and switched to Networking. During this time I’ve been working 1 to 2 jobs and taking two classes a semester. Been working my but off and am two classes away from my Associate degree. I work at a small private school for children with Autism. I have been working with the kids for the past 13 1/2 years and decided 3 years ago to go back for IT. My hope was to land a job in a school setting to start my career  in IT. I had hoped that a position at this school would open up but it wasn’t looking good. Then one of the IT techs who had done the same thing I am doing (worked same job and went back to school) texted me and told me he was leaving and I should apply. Well he, the other IT tech and the IT generalist kept dropping my name to the department head. I interviewed on Tuesday morning and was offered the job that afternoon! It’s blowing my mind. The department head is already watching out for me. I don’t start until 5/15 but he is setting me up to go to the local tech conference before I start. Made sure it was cool with my current supervisor. Told me to apply for tuition reimbursement since it apply to me now that I’m in IT. I even got to sit at my new desk already and was told I should start bringing my stuff to the office already. Now just to get my confidence up and realize that I can actually do this and everyone on my team has got my back and will train me well.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1682128152.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0819823125220664
  },
  {
    "score": 58,
    "title": "No internships. I give up",
    "selftext": "honestly just kind of wanted somewhere to vent. i’m a senior graduating with a b.s. in information technology in may 2026. no internship experience. i need an internship to graduate university. applied for 300+ internships with no luck. got my resume looked over multiple countless times from many professionals, tried networking, linkedin, handshake, job fairs. it feels so pointless clocking into my current job knowing it’s not what i want to do or where i’m meant to be. i’m only 21 but i just feel like i’m screwed. i’m extremely bubbly and consider myself a very confident, hardworking person. i just know, if someone GAVE ME A CHANCE i don’t care if i have to work myself to the bone, i’d treat a damn internship ljke it’s my final hope. i’m just so frustrated :(",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1755400534.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2690032620257874
  },
  {
    "score": 56,
    "title": "I got my first raise ever today!",
    "selftext": "I just wanted to share this good news. I've been working a Helpdesk position for a small company, its just me and two other guys for the whole IT team, and the other two have alot of experience. Just passed the 90 day mark recently and I am getting a 9% wage increase! From about 39,500$ to 43,000$ salary. \n\nThis is like my 6th or 7th job in my life, im 23 and have struggled to hold down jobs in the past for a variety of reasons. TBH ive been losing confidence in my ability to commit to a job long term, and never thought I would get a raise or promotion cause I thought I was too much of a slacker and didn't provide much value.\n\nSo more than the extra money, which is very nice, just receiving a raise makes me feel like I matter i guess? Apparently alot of people I have helped had really good things to say about me. Im not the most technically adept but I always treat people well and try my best to help. \n\nI dont have any questions, and sorry if this comes off as me trying to brag. Im just really happy and honestly proud of myself cause Ive never been given a raise before.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1678153784.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.122751656148906
  },
  {
    "score": 58,
    "title": "Is a Bachelor’s degree in Information Technology worth it? Is it difficult?",
    "selftext": "TLDR; Is an IT degree worth it for someone who has interest in technology but isn’t sure what they want to do for a career? How hard is an IT degree to complete?\n\nI’m currently attending community college with the intent to transfer to a four-year school after completing my general classes. I’ve been hopping between majors because I am honestly clueless as to what it is I want to pursue. Currently, I’m a business major and have to take a basic CIS (computer information systems) class. \n\nI’ve always been really interested in technology and I love to learn. Being enrolled in this extremely basic and easy CIS class has shown me that I love learning about computers and systems and technology in general. \n\nSo, my question is, would an IT degree be worth it? Have any of you gotten an IT degree? My only concern with pursuing this degree is that math hasn’t been my strongest suit. I’ve never been bad at it, just more of a C or B student rather than an A+ student.\n\nI’m aware that every degree is going to be difficult in some aspect, I’m just wondering if this particular degree is extremely difficult to the point of not being worth it.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1677706577.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2925862394319374
  },
  {
    "score": 56,
    "title": "Landed a IT position after quiting manufacturing job",
    "selftext": "After several years working in manual labour roles within the manufacturing sector—and feeling unable to progress due to management’s reluctance to allow younger staff to advance—I decided to leave my job and pursue a career in IT. I must admit that I was somewhat prepared for this transition, as I had completed a few IT-related courses in the past.\n\nFollowing my wedding in May, I committed fully to the IT path. During this time, I developed a SaaS platform for CompTIA students called PassTIA, and after successfully passing my CompTIA A+ exam, I began applying for IT roles.\n\nAfter two months of applying for entry-level positions and attending seven interviews, I secured a one-month contract as a Support Engineer. That short contract was enough to help me get my foot in the door. Prior to receiving that call from the agency, I had actually started to lose confidence and had begun applying for manufacturing jobs again.\n\nHowever, that contract significantly boosted my confidence, and after three weeks in the role, I received a call from another company offering me a full-time position as an IT Support Engineer.\n\nI finally made it.\nIf I could achieve this, you most certainly can as well.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1765320829.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9683748556724914
  },
  {
    "score": 57,
    "title": "Stop blocking copy/paste!",
    "selftext": "I work for a company who's IT department has recently disabled copy/paste in outlook on the web. WHY? I can still type it out, or take a screenshot and use an AI to regenerate the text, can probably even forward it to my personal email.\n\nEvery day now I try to re-organize an email I wrote and get an \"action blocked\" popup when I try to cut or copy something to move it to a different spot in the email. \n\nARGH.\n\n  \nThanks for listening to my rant.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1730912288.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.278853999384009
  },
  {
    "score": 56,
    "title": "This call had my blood boiling",
    "selftext": "\nSo yesterday was a great day at work. I had to call workers from our different locations to schedule times to update their tablets. I called this one guy the day before, and he told me he wouldn’t have time that day. I told him we could reschedule whenever he had at least an hour to spare, and he scheduled it for yesterday around 3. I called him at 3, and he picked up. I’m thinking everything is about to go smoothly. Boy, was I wrong.\n\nI asked him if he knew his work email password because we needed that to enroll his device. He then told me he didn’t have an email address. I’m thinking, how does he not have an email address? I told him, “Hey, can you please give me a minute to check some things on my side?” I looked him up on Microsoft Admin to find his email, and sure enough, he had one.\n\nI unmuted and told him, “Hey, I was able to locate your email account. Would you like me to change your password to something you like?” He said yes and told me what he wanted his password to be. I changed the password and asked him to sign in so the apps could download on his tablet. He told me the password was incorrect.\n\nI’m over here scratching my head, thinking he must have typed it in wrong. I told him, “Hey, I can spell it out for you,” and I spelled it out. He continued to say, “No, man, this is still saying incorrect. I know I’m typing it in right. You must be doing something wrong. You’re the IT guy. You need to get it together.”\n\nI apologized and told him I might’ve mistyped something while changing his password. So I reset his password again and tried logging in to the account. On my side, I was able to log in. I told him the new password, and he said it was still incorrect.\n\nI asked him to read the email address to verify that it matched, and it did. Then I asked him to read the password he was typing, and it wasn’t the same as the one I gave him. I told him I’d reset it again and make it something easier. This time, he was able to log in.\n\nNow it was time to wait for the apps to download. I told him, “Hey, this could take some time to download because the download speeds can vary depending on if you are on WiFi or not. I can set the tablet up remotely when the apps fully download because I can see the progress on my side. I can call you or Teams you when the tablet is set up.”\n\nI say this to everyone updating their tablets because I don’t want to stay on the phone for 3-4 hours on mute waiting for apps to download when the connection isn’t good. Everybody else is fine with me calling them or messaging them on Teams. But this guy said, “No, I need this done right now. Do you know who I am? I’m the Director of Chaplains and Bereavement.”\n\nNo sir, I don’t know who you are, and it shouldn’t matter who you are. I gave you respect, and you should do the same. Of course, I didn’t tell him that. I just said, “Yes sir, this can take some time to download.”\n\nHe insisted, “There’s gotta be something you can do. You’re IT!” I’m thinking, what do you want me to do? Use my mind to accelerate the download speeds? My blood started boiling, and my face got hot.\n\nFinally, the apps downloaded, and I set everything up. My coworkers were next to me during the call, and they told me they would’ve hung up on him because there was no reason for him to be rude, especially when I wasn’t being rude.\n\nLater, my boss found out about the situation. He ended up cc’ing the guy I was on the phone with, that guy’s boss, their boss’s boss, and the boss of their boss. My boss told me, “I have your back, and you’ve done nothing wrong. I’m glad you talked to me about this. That guy should’ve been respectful because you gave him nothing but respect.”\n\nThat made me happy—not because that guy is going to get what’s coming to him, but because people had my back.\n\n",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 56,
    "downs": 0,
    "created_utc": 1733610143.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8949504808643134
  },
  {
    "score": 52,
    "title": "I feel guilty",
    "selftext": "So I just graduated high school in May with CompTIA A+ and CompTIA Network+ while studying for my Security+. I landed, what I thought, an IT job that I would be able to get experience in. I’ve been here for a month since I’m contracted for 2, and I haven’t been able to do anything. I think I’ve done 3 things while I’m here. I’ve reached out to my manager and coworkers asking if I could get permissions so I could do some tickets and I was told no. There’s another IT Technician here hired the same time I was but since he’s here permanently, he has all the permissions so all the tickets just go to him. If there’s a physical issue I can go out onto the manufacturing floor and fix it, but I feel so guilty. I just sit in my cubicle (the other guy got the office) and basically do nothing, and I’m sure people walking by see that. I’ve reached out so many times asking for things to do. Next week we should be getting our 110 computers that I have to image/replace so I should be busy with that soon, but I’ve been coming to work and just watching YouTube for 8 hours a day and I feel unbelievably guilty.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1752150326.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.196850858760742
  },
  {
    "score": 49,
    "title": "Took a contractor job at the age 21 and it landed me a full time gig.",
    "selftext": "\nHello guys! A while back I recently got offered a contract gig for a Field Engineer Desktop Support Job at the wage of $30 hourly in South Arkansas.\n\nI am only the age 21 and only have a year and a few months experience, today I got offered a full time offer with benefits and a pay increase to $32 hourly and it could go up in time as my performance is good.\n\nI was told not to go down the contractor route but I am glad I did. \n\nI just wanna say thanks to everyone who told me to take this job.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1727827430.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.896091259055681
  },
  {
    "score": 51,
    "title": "Does anyone actually use burner emails/phones for everyday stuff?",
    "selftext": "A buddy of mine who works in IT was telling me the other day that I should be using burner emails and phone numbers instead of my real ones. Honestly, I’ve never done that before. Every account I’ve made since I was a teenager is tied to the same email and the same phone number.  \n  \nHe made it sound like I’ve basically been handing out my personal info to every website, app, and random company I’ve ever interacted with. He swears using temporary emails and numbers is the way to go if you want to cut down on spam and keep your info off shady lists.  \n  \nI’m curious though, is this actually something people do for everyday stuff like ordering food or signing up for shopping sites? Or is it overkill unless you’re really deep into privacy?",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1758191391.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3100973571378995
  },
  {
    "score": 47,
    "title": "I’m Leaving IT Management",
    "selftext": "&lt;rant&gt;\n\nI’m coming up on 18 years in the industry. 10 spent in higher education IT while attending university, and seven and a half in healthcare IT. \n\nThree years ago, I was a senior engineer working with technologies I loved. Virtualization (VMware, Citrix, AVD, etc.) and M365. I had a passion for it. Loved every minute of it. \n\nBut….then I was approached by our director about moving to management. A guy who had been a middle manager earlier had left the company, and I was asked to step in. “You’d be really good at it. Everyone has told us how cool it’d be if you’d be the new leader of the team. I know you can do it.” They said. I was promised a fat raise (which it did come with I’ll admit).\n\nAfter much pushing, being asked just about every 1-1 I had with them, and not seeing any other path forward there…..I made the worst mistake I’ve come to regret in my IT career: I said yes. I had ZERO management training or skills but I, in my stupidity, saw dollar signs and “career advancement” and didn’t see things in a practical light like I should have.\n\nThree years went by and I saw my virtualization passion and skills start to slip away as I sat in endless Teams meetings and Zoom calls and dealt with people management issues, taking anger and frustration on all sides because I was a middle manager and thus it was apparently my designation take it.\n\nStress levels went through the roof, my diet and personal life tanked and I began to lose sleep, wondering what I was going to be yelled at about the next day or the following Monday. It’s been a nightmare.\n\nFast forward to today……my previous company was bought out and I was desperate to get out and find whatever job I could pick up. So what did my smart self do? I took another management role through a friend’s referral, thinking it couldn’t possibly be any worse…….oh how wrong I was. 😑 \n\nThree months in to a a six month probation period and I’m done. I’m burnt out, overworked, once again the object of anger and frustration from all sides because “manager” is in my title and I’ve had to fight the temptation to just walk off the job many times now. \n\nI’ve found a couple virtualization engineer roles at smaller companies that I have interviews for and one is sounding very promising. I don’t care if it’s a pay cut. I’ll leave management for better people who have the right personality and skills for this chaos. I’m done being in people leadership. \n\nA word of advice to all you business owners and IT directors out there: DO NOT try to merge people leaders and technical leaders into the same role. Believe me, I am an example where that won’t end well. \n\nI’m being pushed to be the next “Captain Picard” and in reality….I’m just “Charles Barclay”. Very good at what I do, ZERO desire to lead. \n\nshutdown /l\n\n&lt;\\rant&gt;",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1695086833.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1538162265355405
  },
  {
    "score": 47,
    "title": "I landed my first Cybersecurity job with this script",
    "selftext": "Hey all, \n\nI recently landed my first job in cybersecurity using this following linkedin reach out. \n\nThe role is in GRC, and I reached out to the business owner. For context, I reached out to maybe 15 people in cybersec at varying levels (generally business owner or very senior). I aimed my reach out at smaller businesses as there would be a less formal hiring process i.e. I could skate in without going through 5 rounds of interviews. Out of the 15 reach outs I received 7 responses and 2 offers. Hope others find this helpful. \n\nHere it is: \n\n\"Hi XXX, \n\nApologies for the random reach out. \n\nI am a UNSW student in my last year of a computer science degree, and am very interested in pursuing a career in the cyber security industry. \n\nI have begun making steps in some extracurricular learning in GRC, but am struggling to discern the best career path to take, given it is such a large and evolving industry. \n\nI thought I'd reach out and see whether you'd be open to grabbing a cup of coffee or lunch some time to discuss your thoughts on the industry - and to pick your brain? \n\nI completely understand if you're too busy - please let me know either way. \n\nIn any case, have a great day and I look forward to hearing from you. \n\nKind Regards, \n\nXXXX\"",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1678878217.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6023018647354186
  },
  {
    "score": 48,
    "title": "Quickest way to get a job in IT.",
    "selftext": "Hey guy I've recently indulged myself in a lot of reading and study materials about 4 months or so at first find it cool to get to know about these IT stuff, them intended to prepare to CompTIA A+, I think I'm still on that road. At the same time I've got an annual subscription on Coursera in the hope to have a couple of certs, I'm almost done Google support specialist which I find it very helpful and it teaches a lot of beginner-friendly stuff. But that being said, is there any shortcut to get an entry level job in IT regardless of these certs? Because I've read somewhere that some ppl have done it. \n\n",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1752054365.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.207468047799448
  },
  {
    "score": 45,
    "title": "Worth staying at my helpdesk job?",
    "selftext": "USA, 24 Bachelors Degree in IT\n\nI’ve been working in a help desk role for about 9 to 10 months. Before that, I had around two years of very basic tech support experience as an intern while I was in college.\n\nMy current job has no growth. No raises. No real training for further roles. No realistic path beyond help desk. If I stay, I will probably be doing the exact same thing a year from now.\n\nI have enough savings to live comfortably for about a year.\n\nI’m seriously thinking about quitting so I can focus full time on:\n\n• studying for Security+\n• building hands-on cybersecurity labs\n• applying consistently for cybersecurity roles like GRC, analyst, or risk\n\nTechnically I could study after work, but this job drains me by the end of the day. I also feel like I’m not really gaining anything valuable at all from my current job. Just exact same things every day lol \n\nWanted to know what u guys think. \n\nFor anyone who has made a similar transition:\n\nDid quitting to focus on certs and labs actually help you, or did you regret it?\n\nI’m open to honest feedback. I just want to make sure I am thinking about this logically. Thanks in advance.\n",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1767060587.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2118518451846745
  },
  {
    "score": 48,
    "title": "Discord user knew what city I lived in even though I didn’t click any links ",
    "selftext": "\n\nI joined a server a couple weeks back. Everything was normal till this one mod who I believe was the server owner ( not sure if they were but they were a mod team member) casually name dropped the city I lived in and went offline after. The user was genuinely creepy and i myself freaked out given the fact that I clicked no links sent by them. They had interacted with me weirdly prior as well but other users seemed to like them.\n\nI did disclose the country I lived in and share a couple pictures of food in the main server however I didn’t click any links sent by them so how could they know of the city I live in? I deleted my account and the app for discord itself shortly after the incident, I just wanted to know how they got my city name and confirm if my device was secure or not, any advice would be greatly appreciated thank you. ",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1723329975.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.227366354755304
  },
  {
    "score": 45,
    "title": "Age shaming in IT",
    "selftext": "You are doing just fine! Don’t let anybody’s timeline or expectations define your life. A few days ago, I suddenly started thinking, “Am I doing enough in this stage of my life? Am I late on some things?” Why?! Who makes these rules? I’m grateful for the life I have right now and I’m working hard at every stage of it. So I shouldn’t feel like I’m behind. Live your life based on your standards and your situation. Don’t feel rushed to do anything until you’re ready. Remember, no matter how it seems, it’s only You vs. You!",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1687833139.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.978321849520693
  },
  {
    "score": 43,
    "title": "Is it worth getting into IT at 43?",
    "selftext": "I'm looking to change careers, as I really don't even have one right now, and long ago I used to work in IT. Now, this was in the early 00's, but I've been working with computers since the 80's. I got my CompTIA A+ done long ago and just realized that it's good for life, so I don't have to retake that.\n\nHowever, I'm 43 years old, and with all the new certs out I'll be starting at square one up against a lot of other, younger candidates. I've got no issues with taking the certs and getting up to speed, as I'm not THAT far behind, I just don't have any work experience in the field since like 2005, and I know that means I basically have no experience to most employers.\n\nAll in all, would it be worth even going down this path or will I end up in deep disappointment because I won't be able to find a job?\n\n\\*EDIT\\* - I just wanted to say that you all are an amazingly supportive group of people, and I appreciate the comments and support. I've signed up for Coursera and begun working on my Google IT Support Prof cert, and have found my CompTIA A+ GFL Cert I got back in 2002. I may go refresh the A+, but we shall see. I'm going to do this, and I thank you all for your input and support!",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1674846245.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.228954348303587
  },
  {
    "score": 45,
    "title": "How was the IT industry back in the 80s and 90s",
    "selftext": "I wish that I was born back then so I could be in the I.T/tech field in the 80s. I feel like things were honestly better. Things were probably not as fast and over saturated. You just had a bunch of people who loved what they did and read manuals and books all day to get better. This is what I imagine your guys were doing. How was the industry and back then were you getting paid a crap ton for that time?",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1742170828.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1801496299899794
  },
  {
    "score": 45,
    "title": "👀👀",
    "selftext": "Tech folks—how do you deal with people just staring at you while you work?\n\nSo here’s the situation that happens way too often…\n\nSomeone calls me down for tech support, and instead of walking away, going to the restroom, or giving me some space to troubleshoot—they just stand there and stare. Not in a helpful way. Not in a “curious and learning” way. Just full-on surveillance mode.\n\nI don’t think people realize how uncomfortable that is. Like imagine I just walked up to their desk and silently watched them work for 10 straight minutes—scrolling emails, clicking around Excel, whatever. It’s weird, right?\n\nDo y’all just ignore it? Crack a joke? Say something directly? Curious how other techs handle this without making it awkward (or more awkward than it already is).\n",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1745595689.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.007134632157989
  },
  {
    "score": 43,
    "title": "Tired of tech CEOs spreading fake propaganda to lure investors",
    "selftext": "Recently I feel like tech CEOs have become even more insufferable. The amount of disingenuous takes to hype up their technology is just out of this world.\n\nI completely understand they have to ensure their company grows, but do they really have to make such bold fake claims like \"AI replacing all devs\"? That would mean the code to generate every other job, including their own as CEOs, is also immediately achievable.\n\nI agree AI will change a lot of dynamics in dev jobs, but replace them? Nonsense.\n\nIn a world full of AI and technology one of the most valuable skills have to be the knowledge about how computers work. AIs are algorithms and the knowledge of their mechanics is paramount. Calculators did not replace mathematicians, it let them tackle harder problems by automating tedious parts.",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1736722489.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9289983060140283
  },
  {
    "score": 42,
    "title": "MY first IT Admin Specialist Interview!!!",
    "selftext": "I just returned from my IT Admin specialist interview, it went well. I was interviewed by the direct manager, the vice president of engineering, and the software engineer. I have no experience in IT nor am I certified yet, I'm just a college kid who works at the contact center. Using my free time to learn IT-related topics focusing on help desk/ support. This is my first official interview. Maybe I'm too excited but I feel like we are a fit. We had a great interview and cracked a couple of jokes about end users not restarting computers, then I was taken on a tour into the data room and around the building the interview was way chiller than I thought, with a couple of hot seat questions that I feel like I was well prepared for. Researched a lot the night before the interview, I only had two days to prepare. Advice I would give? JUST APPLY!!!",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1740601775.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.949014085107427
  },
  {
    "score": 43,
    "title": "What skills do most young adults lack that is important to learn ?",
    "selftext": "\nI feel so ashamed that I’m 27 now yet I don’t know anything about tech field. When majority of kids in college are pursuing for computer science or stem related majors. Here I’m in community college picked a random program called radiology tech becuase it’s 2 yr program and heard from family since your old and it’s gonna be too late to go university just get 2 yr degree and join workforce. They saying healthcare is good because of benefits and pay. But I was taking pre reqs for that program but I’m not even feeling it. I just gave up. I don’t even know what to do now. All I know is I need to get a degree that pays well. I also wished to get remote job or office desk job like my cousins. They have the flexibility of working remotely and have weekends off. They are not extremely worried about finances either. It feels so shameful working in retail job earning nothing at 27. Top of that hearing family taunts and being compared to successful people. ",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1734541259.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.117553538519685
  },
  {
    "score": 41,
    "title": "Self starters/researchers don’t belong in IT???",
    "selftext": "I’m very curious for peoples opinions on this. I currently work as an IT specialist- helpdesk, project manager, software/hardware research, purchasing and implementation, we do it all (unfortunately). \n\nMy boss and another I work with are of the opinion that those who don’t practice or research extensive IT topics at home either aren’t passionate enough, don’t care and therefore don’t belong in the career field. Self starters and researching/practice at home are the only key to success. \n\nApparently it’s like that “anywhere you go” in IT, which is totally fine with me. I definitely don’t have a setup at home and I don’t read articles about servers before I go to bed. I guess this means the field isn’t for me, I’m not interested in taking all my work home with me. I adore helping my end users, I love the people I work with and the actual work itself is fun for me.\n\nBut I am very fascinated by this topic, the concept that someone doesn’t care enough to devote their free time to the topic therefore they don’t deserve to be there seems insane to me. I’d love to hear others opinions. Are my coworkers just crazy or is it true? ",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1712074743.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.174705968719328
  },
  {
    "score": 39,
    "title": "Struggling 25 year old only making 32,000 should I go get my bachelors or find a different job?",
    "selftext": "I’m really struggling financially. I’m trying to cut back what I spend on but bills are just unavoidable. I really want to make more money either by going back to school or finding a different information technology job. I’m thankful for my current job but I’m sad here and feel like I’ve learned all I’m gonna learn here. I have an AAS in information technology is this enough or should I go get more schooling or find a different job? Any tips appreciated! Please don’t be rude :)",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1694446800.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1774859971490343
  },
  {
    "score": 38,
    "title": "Is becoming a Web Developer rn a waste of time?",
    "selftext": "Hi everybody, I (F24) am trying to get into web development because I've been doing some form of I.T. work...pretty much since I was 17. I don't have a job right now currently, but I found some motivation to complete this Full-Stack Web Developer course program, and the work is pretty fun so far. But today I found out from a friend that the market is overflooded with entry level I.T. workers and ppl are only looking for senior developers and I'd be lucky to get an interview as many are struggling. I'm a bit disappointed, I was gonna try applying for a work visa in Germany soon but I wanted to know if the disappointment is an overreaction or Full-Stack Web Developers have a shot in the current job market rn?\n\nThank u in advance for any replies, I suppose if it doesnt work out I can try something else, course wise. I have a CEH, maybe there's somethin there if Full-Stack Web Development doesn't work out, I've just been really enjoying the work so far compared to that,",
    "subreddit": "InformationTechnology",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1692300784.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1390662788438988
  }
]