[
  {
    "score": 1064,
    "title": "I worked at a modeling agency… the top 1% have a secret Meta backdoor.",
    "selftext": "I don’t work there anymore, so this feels like the first time I can say it out loud.\n\nFor years I managed **300+ influencer accounts** at a modeling agency. Most of the job was routine posting schedules, brand deals, cleaning up DMs until something happened that still doesn’t sit right with me.\n\nWhenever one of our top models got banned or flagged, we didn’t file appeals like normal people. There was no waiting weeks for an automated response, no desperate emails, no praying the algorithm noticed us.\n\n**The agency would tell me to “contact our person at Meta.”**\n\nNot support. Not the normal channels everyone else is stuck with.  \nA direct line to someone inside the company who could basically **snap their fingers and restore the account.**\n\nI never knew who they truly were always on private whatsapp or telegram channels but the results were real. An account could be nuked in the morning and fully restored by lunchtime. No review. No warnings. Just… back.\n\nMeanwhile, smaller creators 5k, 20k, even 100k followers would lose their accounts over nothing and never get them back. They’d get scammed by “recovery services,” send dozens of appeals, and eventually give up because the system just swallows them whole.\n\nAnd watching that contrast up close made something really clear:\n\n**There are two versions of social media: the public one… and the one the top 1% live in.**\n\nMost creators have no idea these backchannels even exist. They think big accounts stay on top because they’re perfect, or lucky, or “built their brand right.”\n\nBut the truth is a lot less magical.  \nAccess decides survival.  \nConnections keep you in the game.  \nAnd most people never even get a chance to play by the same rules.\n\nI left that job burned out and honestly kind of disillusioned. Once you’ve seen the strings behind the curtain, it’s hard to unsee how rigged the system is.\n\nI’m not saying every big creator uses a secret contact. But I am saying this:\n\n**If you’ve ever wondered why some people bounce back instantly while others disappear forever… it’s not an accident.**\n\nAnd no one is supposed to talk about it.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 1064,
    "downs": 0,
    "created_utc": 1763700894.0,
    "media": null,
    "is_video": false,
    "num_comments": 199,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.875364605606746
  },
  {
    "score": 1038,
    "title": "I followed 7,500 accounts to gain followers - Here's what happened",
    "selftext": "I started a fitness based Instagram in August of 2024 posting twice a day everyday.\n\nAt that same time, I started going to similar pages with much larger followings and following all the people that followed them. I followed about 100 accounts a day like this. My idea was that following people that liked similar accounts would give them a higher chance of following my account.\n\nA month later I had 600 followers and was following 1,500 people. This is a rough follow back rate of 40% which was great. I then went and used [this reddit thread](https://www.reddit.com/r/Instagram/comments/yhazli/how_to_see_who_is_not_following_you_back_without/) to clean out everyone who didn't follow me back. I did about \\~100 a day, as Instagram really only lets you do 200 per day. It was a little time consuming but worthwhile as I now was followed by 682 people and only followed 658.\n\nI then let my account grow organically for a month to 762 followers. Small growth but 80 people in a month felt like a lot. I decided to speed up the process and started following \\~100 people a day again, except this time I followed people like engaged with similar posts. This meant the account was active enough and interested in the same type of content I was posting.\n\nOver the course of 92 days I went from following 606 people to Instagram's limit of 7,500. My followers jumped all the way up to 2,981 and growth felt pretty good as a lot of these accounts were engaged in the content I was producing. I even had a reel to 25k views when I was normally getting 2-3k.\n\nNow I'm facing the tedious task of removing \\~100 accounts a day unfollow by unfollow. I made an excel sheet to help speed it up.\n\nThrough these few months I learned that you can can gain a few thousand followers just by following people and you can always unfollow the ones that don't follow you back. It's work but all aspects of growing a channel is work. This method might not work for everyone but if you're stuck and don't know what to do, this is atleast something really simple to start with.\n\nI will be doing this experiment again when I'm back down under 1,000 followers.\n\nEDIT: Thanks for all the support and comments! I really didn't expect nearly 300 upvotes and 90+ comments in under 24hrs. \n\nI want to restress that following people to follow back was not my only method of getting my Instagram to succeed. I was still posting good content with collabs nearly everyday and interacting with the home gym community. The main purpose of this method was for my account handles name to be in front of people that would be more inclined to follow. You can't follow what you don't know and Instagram isn't going to advertise for me. ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1038,
    "downs": 0,
    "created_utc": 1736975738.0,
    "media": null,
    "is_video": false,
    "num_comments": 350,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.016769105790089
  },
  {
    "score": 1028,
    "title": "Throwaway: Instagram’s entire future depends on automation (I saw it firsthand)",
    "selftext": "Throwaway for obvious reasons. Up until 2 months ago I was on the M&amp;A (mergers &amp; acquisitions) team at Meta. I left to work for another company in the social media space, but while I was there I saw enough on the inside to understand how Instagram really thinks about growth and where they’re steering things. Figured I’d share some context because I keep seeing the same bad advice and the same people getting burned.\n\nFirst off, I can’t tell you who you should use, but I can tell you who you should avoid.\n\nPath Social, Kicksta, Upgrow, Wolfgrow. None of these are real growth solutions. They’re glorified bot farms. They recycle fake accounts from overseas, route them through the same IP pools, and hammer Instagram’s flagged API calls until your account gets flagged too. They don’t build communities, they build fake shells that eventually collapse. And yes, Meta knows. These companies have been on compliance watchlists for years.\n\nSo why are they still around? Simple: ads. Path Social in particular spends a ridiculous amount of money on ads with Meta, and that basically buys them time. Meta cashes the checks while quietly banning or throttling the accounts tied to them. It’s a double dip. They profit from the ad spend, then profit again when those same customers crawl back into official ads just to stay visible.\n\nHere’s the bigger truth. Meta doesn’t care about your follower count. They don’t care about influencers gaming the system. The company lives and dies by two numbers:\n\n1. Average time on app. That’s the stat they brag about at quarterly shareholder calls. If they can say “time spent per user is up,” Wall Street is happy.\n\n2. Ad revenue. Because that’s the entire business model.\n\nEvery algorithm tweak, every policy change, every shadowban serves those two goals. Anything that doesn’t feed into them gets killed off. That’s why 99% of these “10k followers in a week” type tools never last.\n\nNow here’s the part most people don’t see. Without breaking NDAs, I can say this much: there are exactly two companies worldwide that Meta has quietly allowed to keep operating under a controlled test umbrella. Both are small AI-driven firms. One is based in St. Louis. The other in Scottsdale, Arizona.\n\nThese companies don’t blast bots or fake engagement. They built server systems that mimic human behavior so closely that Meta can pitch the results as “increased time spent on platform” in their shareholder decks. Both price their services at $300+ a month, not because it costs that much to run, but to keep the user base small and serious. Only accounts with deeper pockets and long-term goals get in. That exclusivity keeps them safer than the mass-market tools that draw attention.\n\nThe Scottsdale company has already been acquired by Meta. Their paying users were grandfathered in and now basically run the software for free under Meta’s controlled testing. If you dig around Crunchbase you can probably figure out which company it is by looking at Meta’s recent acquisitions.\n\nThe St. Louis company is still independent, but here’s the kicker: it already has investment money from Meta and is under contract for business marketing work across the Midwest. Part of me has always wondered if companies like this are basically shells Meta sets up to experiment through, but the outright acquisition of the Scottsdale firm kind of kills that theory. (Shells aren’t really my area, so I’ll admit that part goes above my head.) Either way, it feels inevitable the St. Louis one gets folded in soon too.\n\nThis fits into the bigger roadmap. Instagram has neglected the business and influencer space for years, and now they’re correcting course. Instagram also knows it isn’t the app people get “big” on anymore. Most creators blow up on TikTok first, then spin up an Instagram that just bleeds off followers from their TikTok links. And Meta hates that. Trust me, they know exactly where they stack up in the social media hierarchy right now. I had been with them for a long time, and honestly it’s kind of hurt to watch them morph from a photo app, to a video app, to a live streaming app, and now into a business app. That shift was part of why I left. It feels washed up to me. More power to the brands and business owners who get in early — I know a lot of big-name brands are already using the St. Louis company, so good for them — but it didn’t align with my own career goals. I’m a principled man, lol.\n\nGoing into 2030, Meta is clearly steering Instagram toward being the platform for brands, influencers, and businesses. TikTok will keep dominating the “average person” space with broad organic reach. Instagram is doubling down on being the go-to platform for businesses that need precision — targeting exact demographics, warming up leads, and converting followers into paying customers.\n\nSocial media is splitting into two lanes. TikTok for reach. Instagram for revenue. And Meta is betting heavy on automation to make it happen. Not bots, not spammy junk, but AI systems that drive engagement in ways that can be tied back to sales. From an M&amp;A perspective, this isn’t about giving small creators a fair shot. It’s about building a suite of business tools Meta can sell, scale, and present to Wall Street as the future of digital advertising.\n\nSo if you’re looking at the landscape long-term, hedge your bets accordingly. Instagram is positioning itself as the business platform of the 2030s. The tools they’re rolling out for businesses are way beyond anything they’ve done before, and honestly, they’re impressive.\n\nAt the end of the day, Meta doesn’t want to fight automation. They want to own it. And once these acquisitions are fully folded in, they will.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1028,
    "downs": 0,
    "created_utc": 1755794787.0,
    "media": null,
    "is_video": false,
    "num_comments": 113,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.7833678004306694
  },
  {
    "score": 818,
    "title": "I talked with meta directly yesterday about their algorithm",
    "selftext": "I got chosen from a small group of ppl over 10k at random to get a phone call from meta where they talk about their new algorithm. This isn’t really my niche on actual Instagram but I figured this sub might be interested. There were 6 major things I took:\n\n1. Consistency matters but you don’t have to post daily anymore. At least 3x a week (or at minimum every other day) they did emphasize you must post at least 3x a week or else you would likely fall off the algorithm. Last part is the main thing they told me out of everything listed. If you post daily nothing to worry about at all but helps imo if you work outside of content or need a health break\n\n2. Probably not a shocker but reels are best way to grow page organically.\n\nEdit: I wanted to add from personal experience in terms of paying for ads I think it helps before 10k but after its way more financially viable to try and hit the algorithm with reels. Meta didnt even mention ads on this call\n\n3. This one was surprising to me and I made this thread after seeing this question asked on my Reddit feed: hashtags do still matter but like 3-5 and niche.\n\n4. If your goal is engagement over growth then carousel posts (the static posts of more than 1 slide). They..didn’t say this directly but kind of insinuated one slide static posts don’t do much. \n\nEdit: if you are eligible for and rationing bonuses for static posts only single slide posts are eligible though. Carousel posts are not monetized in the bonus\n\n5. Schedule your posts around when your followers are on the most you can see in your page business stats. I’ll prob start doing this. \n\n6. Use trending audio.\n\nIf there’s any questions lmk and I’ll tell in comments if it was covered\n\nEdit:\n\n7. Don’t post watermarked content/crossposting. This was a question in the comments and they did emphasize this\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 818,
    "downs": 0,
    "created_utc": 1716903125.0,
    "media": null,
    "is_video": false,
    "num_comments": 296,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.884662126419025
  },
  {
    "score": 776,
    "title": "EVERYTHING ABOUT INSTAGRAM ALGORITHM ",
    "selftext": "Hi again!\n\nMy [last post ](https://www.reddit.com/r/InstagramMarketing/s/NCwyeGRU36)was about Instagram hashtags, and I mentioned briefly how the Instagram algorithm works. Now, I'll explain the algorithm in detail, starting with the example of a 1k followers Instagram account. \n\nWhen you post something on Instagram, that post is initially shared with the first 10% of your followers. But who are these first 10%?\n\nThey are the people who have been following you and interacting with your account from the beginning, such as liking, commenting when the post is live, or replying to your stories.\n\nNow, every post you make has certain parameters. When these parameters are met, the post is further pushed to the next set of followers. This phase is what I call the \"initial.\"\n\nSo, what is \"initial\"? \n\nIn simple terms, \"initial\" represents the average engagement of multiple posts. Here's an example:\n\nSuppose you have 1k followers, and on average, within 10 minutes, you're getting 70 likes and 5 comments. This average is obtained by analyzing the last 10-20 posts.\n\nWhy is \"initial\" so important?\n\nWhenever you make a post on Instagram, if the post fails to surpass the initial engagement, it acts as an instant result of whether or not that content is going to work on Instagram. This is because it reflects the reaction of your audience - the same first 10% of people who love your content. If the post fails to please them, it lacks something. So, for the next time, try to improve.\n\nContinue this process until you manage to increase your initial engagement from, for example, 70 likes to 80-90 likes. That's how you do it.\n\nAnd that's how I managed to grow from 100 to 360k followers on Instagram.\n\nYou should focus on this magical 10-minute data called \"initial.\" I've spent the last 7 years studying the algorithm, and while I don't claim to understand it 100%, I know enough.\n\nI've grown more than 10 accounts from 0-10k during the lockdown and sold them to other people.\n\nThis is just the tip of the iceberg; there is a lot more to this, and I don't want to bore you. So, I'll cover another topic in another post.\n\nIf you want me to cover other topics as well kindly let me know in the comments I'll try my best to provide the information \n\n\n\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 776,
    "downs": 0,
    "created_utc": 1713250253.0,
    "media": null,
    "is_video": false,
    "num_comments": 220,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.805117155643469
  },
  {
    "score": 756,
    "title": "$20,000 in 30 days. AMA",
    "selftext": "I made over 20k this month by following these steps. This is for content creators who represent their own page, this does t work as well for meme pages, themed pages, etc. \n\nI see a ton of creators with followings like mine (300k) or bigger, that fail to monetize or have serious holes in their funnels. Real fast a funnel is a system or series of actions performed by a software or app that moves a customer along your ecosystem. (Think “if they click this, than offer this”) \n\nI’ll leave screenshots in the comments, and feel free to look at my profile. I’m a real person who scales income. \n\nStep 1 - create a webpage, a blog post, etc. \n\nStep 2 - create a free product, and paid products. (You don’t have to make these, and these could be as simple as affiliate links, but the real money is in your own branded products) Read your comments on the post, this will help you create other products or services, like you’re about to find out below.\n\nStep 3 - Start using CTA’s (Call to Actions) in your post, comments, reply, videos, etc. It’s important to start getting traffic on your site, more followers, and email list together! \n\nStep 4 - use those email list to retarget, use the best performing CTAs in newer videos, understand the baseline and relationship between viral traffic to your website and normal traffic to your website. Viral traffic should be pushed toward the free items, and then FUNNELED down to the higher ticket items. \n\nIt’s very simple. I been doing this online for the past 2 years heavily and made over $400k online from social media. I’m self taught in my physical business as well as this marketing. I made a post about a week ago, where I gave a ton of value in the comments. These comments gave me that push to go ahead and jump in and begin offering my same systems I run for my pages, to other content producers. So, if you’re struggling to monetize let’s talk in the comments, and let’s work. ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 756,
    "downs": 0,
    "created_utc": 1727015838.0,
    "media": null,
    "is_video": false,
    "num_comments": 256,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.78156244116572
  },
  {
    "score": 699,
    "title": "A step by step guide to going stupid viral on IG Reels / growing your IG",
    "selftext": "Hey everyone! I’ve been a creator for 4 years. I first started during covid by posting educational videos about stocks and sharing my portfolio but I never really found traction with them. I was stuck at 7k followers and only a few hundred thousand views total after posting everyday for a year. I was basically in 500-1000 viewer jail.\n\nSince then, I’ve developed a framework that I follow every single day when posting to IG Reels + other socials. I’ve been fortunate now to grow my account to 4m+ views and 50k followers. I’m not claiming to be an expert by any means but I wanted to share what is working for me and some of my creator friends who have 100k+ followers. I’ve included specific tactics in this 8 step guide that you can follow.\n\n**The foundation: Viral content is either educational or controversial:**\n\nThis may be a dogmatic view of the world but I fully believe that the only way to go viral is to make deeply educational content or be controversial. Yes, I realize you can also go viral with other types of content (like dancing, memes, etc.) but this is a needle in a haystack. To maximize your odds, your content MUST be educational or controversial - this is just human nature - we like to be informed and we like controversy.\n\n# Step 1: Understand Your Niche and Audience\n\n1. **Identify Your Niche:** Decide on the specific topic or niche you want to focus on. For example, my niche is how AI is impacting software engineering. \n2. **Research Your Audience:** Understand who your target audience is, what they are interested in, and what kind of content resonates with them. For example, my target audience is the younger audience in Reels who are just coming into the job market. \n3. **Specific Tactics**\n   1. Take your 3 most recent posts and ask ChatGPT what your niche is\n   2. Ask your community - post an IG story and ask what your audience does for a living\n   3. Ask here on Reddit - I’m sure people would be happy to help (I will)\n\n# Step 2: Outline your Story\n\n1. **Outline Your Story:** Write a brief outline that includes a clear beginning, middle, and end. Make sure to include a hook at the start and a call to action at the end. The call to action is VERY IMPORTANT. DO NOT skip this. I’ve posted 1000+ times over 4 years and I have the data to back this up - when I have a CTA to follow, 28% more people will follow - this is the key to growing your IG and building a community in the long run.\n2. **Specific Tactics**\n   1. Draft a script for your video or written content that flows naturally and engages the audience. I usually ask ChatGPT to write a script for me. \n   2. I’ll then take the script into a google doc and make it fit my style. (You’re gonna find that asking ChatGPT is a trend in this post. That’s because I do it a lot. It’s like a personal assistant for me)\n\n# Step 3: Nail the Hook\n\n1. **Craft Compelling Hooks:** The first 3 seconds of your video or the first line of your caption are crucial. Write down 5-10 different hooks that are either controversial or deeply insightful. For example, the hook that has worked the best for my content was “Wonder why new grads are having such a hard time finding Software jobs. Let’s talk about it”\n2. **Test Your Hooks:** Make an IG story post with your hook as the caption and ask your community if they want to know more about it. I think of IG stories as being a great high level signal for what content could work in an IG Reel. \n3. **Specific Tactics**\n   1. Take your script, put it into ChatGPT and ask it - “I am filming a video with the following script: \\[insert your script here\\]. Please write 5 hooks that will catch my target audience’s attention in the first 3 seconds. My target audience is \\[insert target audience here\\]”. Then select a hook and ask ChatGPT to rewrite your script with your selected hook.\n   2. Nailing the hook is hard - it doesn’t come easy or naturally to most people (including me). This is a muscle that you will build over time so don’t get discouraged if it doesn’t work the first few times.\n   3. Look through your analytics to see at what point people drop off - make a note of this and aim to improve it for your next Reel. Retention is one of the key metrics that IG looks at when determining whether to show your video to the next cohort of people. Always seek high retention.\n\n# Step 4: Production Quality Matters - Don’t ignore this\n\nThis is especially important in the first 3 seconds. Remember, attention spans are short. There are 1.3 billion other posts that compete for attention every single day. A low quality video will result in an instant swipe away. I’m not saying you need a fancy setup (you really don’t) but have decent lighting and a decent camera (I have a 4 year old iPhone 12 Pro).\n\n# Step 5: Polish your Video\n\nAgain this comes back to competing for attention. Awkward silences, saying “um” or “like” too many times can ruin your video. I’m not saying you need a professional editor (you definitely don’t) but doing the simple stuff below will get you 80% of the way there:\n\n1. **Remove Awkward Silences:** Edit out any unnecessary pauses or filler words\n2. **Add Captions:** Use bold, legible captions to emphasize key points. Captions not only make your content more accessible but also help retain viewer attention.\n3. **Incorporate B-Rolls and Images:** Add relevant b-roll footage, images, or graphics to make your video more dynamic and visually appealing.\n4. **Specific Tactics**\n   1. I use tools like [lazyeditor.ai](http://lazyeditor.ai) (I point to this because it's free) to remove silences, add captions, incorporate b-rolls\n   2. It’s not hard to learn Premiere Pro - just look up a Youtube video\n   3. Consider tools like Capcut for captions\n   4. Do a google search for b-rolls/graphics or use tools like [lazyeditor.ai](http://lazyeditor.ai) to add them\n\n# Step 6: Optimize for Engagement + Retention\n\n1. **Include a Call to Action:** At the end of your post, encourage your audience to take a specific action, such as \"Follow for more tips,\" \"Share this with a friend,\" or \"Comment your thoughts below.\"\n2. **Specific Tactics**\n   1. Keep a close eye on your retention. For every Reel you post, you should know at what point people are dropping off in your videos\n   2. When you make subsequent videos, you should address those points and try to make your videos more engaging to keep people’s attention.\n\n# Step 7: Analyze Your Performance\n\n1. **Review Analytics:** At the risk of repeating myself to many times (but this is really the key so it’s worth it), check your retention on every post\n2. **Identify High-Performing components:** If certain hooks, topics, or visual styles performed well, make a note to use them more often.\n3. **Specific Tactics**\n   1. Also, keep a close eye on the content that others in your niche are posting and don’t be afraid to copy them. If big companies like Instagram and Apple can copy competitors then so can you. There’s no shame in doing this\n\n# Step 8: Rinse and Repeat\n\n* **Consistency is Key:** Continue posting regularly, at least 5 times a week. I do up to 2x a time. I also post to multiple channels (including TikTok) because the distribution is important for my business. \n* **Learn from Others:** This goes without saying but keep an eye on successful creators in your niche and adapt their strategies to fit your style. Again, there is no shame in copying what works. The biggest companies in the world from Apple to Google do it so why shouldn't you?\n\n**To summarize/TLDR:**\n\nKnow your target audience, nail the hook, professionalize your edits (use tools like [lazyeditor.ai](http://lazyeditor.ai) (it's free) or Premiere Pro), know your retention, and repeat. When in doubt, ask ChatGPT (I could probably write an entire post on how to use ChatGPT for IG content - it's that useful for me).\n\n**Do this EVERYDAY for 30 days and I GUARANTEE you will see results.**\n\nAgain, I’m not an expert but I hope this post will help at least a few people go viral from here! If you've had success on IG as well, I’d love to learn what works for you! Good luck!",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 699,
    "downs": 0,
    "created_utc": 1724767408.0,
    "media": null,
    "is_video": false,
    "num_comments": 120,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.621490725172483
  },
  {
    "score": 638,
    "title": "gained 115k followers in 72hrs ask me anything ",
    "selftext": "I started working with a creator who had been  stuck at 2k followers for years. In 6 months we reached 180k, but within the last 72 hours gained 120k followers. Now we’ve ended up hitting 300k. I do everything from editing the content to creating the content ideas and hooks. If you have any questions concerning Instagram (or TikTok) let me know!\n\nEDIT: Apologies if I sound crazy/incoherent in some of these replies. I haven't slept much and am trying to get to everyone's questions there are a lot.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 638,
    "downs": 0,
    "created_utc": 1723792540.0,
    "media": null,
    "is_video": false,
    "num_comments": 840,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.957898856057357
  },
  {
    "score": 624,
    "title": "How I make $4k/month with Instagram pages (350k+ followers)",
    "selftext": "In the summer of 2023 I started an Instagram page about the city where I live. At first it was just for fun, but it grew very quickly. After a few months, I reached 40K followers, and now the page has 170K followers. It is one of the biggest Instagram pages for my city.\n\nAs the page grew, I began working with restaurants and other tourism related businesses.\n\nThey paid me for promotions, and some became clients who I sold ad placements across my pages. This helped me make a good semi passive income, even while I was still in high school.\n\nSince this model worked well, I tried the same method for other popular cities in Europe. I created three new pages last spring. One page now has 100K followers, and the other two have 40K each.\n\nNow, I faced a problem. How could I make promotional videos for restaurants in other cities that are far away from me? I started looking for UGC creators who live in those cities.\n\nI pay them to visit the restaurants and create the videos in exchange for free food at the restaurants. These pages together make me €3K/month.\n\nTo make this work, I use a tool that automatically sends a free travel guide to people who comment a keyword under my posts.\n\nThis brings me more engagement and leads that is really important to go viral on Instagram these days. I get 100-120 leads every day from my page. I sell tourist services like tours and apartment rentals, making about €1.6K/month from this one page alone.\n\nI also manage social media and run lead generation ads for clients outside of the travel niche, using the strategies I apply on my own pages. This brings me another €1K/month.\n\nNow at 19 years old, I make €4K/month from Instagram while in my last year of high school.\n\nLet me know if you have any questions! 😊",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 624,
    "downs": 0,
    "created_utc": 1740584642.0,
    "media": null,
    "is_video": false,
    "num_comments": 147,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.601010875041554
  },
  {
    "score": 584,
    "title": "How to go viral as fuck. ",
    "selftext": "Hi im reid olson, my insta is _reidolson, over the last two months i’ve had over 20 viral videos (1m+ views) multiple of them reaching over 10m views. Here is some real shit that made it work for me. \n\n1. Settling the quality vs quantity debate\n\nWhen you start, you gotta get over the fear of posting, embarassment, failure, etc. you also generally dont know how to go viral, because youre new to the gameand thats fine. So post. A shit ton. Its fine if its bad. Nobody cares. It feels like they do, but they dont. And if they do, they aren’t the people who matter.\n\nWhen you can reliably go viral, and you have enough skills that you know, if you put in more time, you will get more views, go for quality over quantity. Its not a binary, you kind of slowly move over there the better you get. For example, i am not moving slowly to high quality shortfilms and teasers, after 1.5 years and 800 posts.\n\n\n2. Relax. Its not that serious. Its numbers. on a screen. That a few billionaires control. Its a game. Deep breath. \n\nYour mindset is the most important piece to any of this. You could have every technical skill, but if you dont post, you wont win. \n\nSocial media will kick the fucking shit out of you. Especially if youre below 25 (like me, our brains arent completely developed and we value other’s opinions more than when we’re 25, source, BEHAVE by robert sapolsky) prepare for negative effects.\n\nAs long as you keep going, you will grow. Then you will stop growing at some point. And that will fucking hurt. It is not fun to plateau. Remember, you just have to keep going. Only you can stop you. \n\nYour posts will flop. It will hurt. Its okay. Make posting and getting better the goal, not performance. That will come with time. \n\nIts harder than you think. Expect it to take 5 years, 2000 posts, 10000 dollars (courses and such) and blood sweat and tears. Expect hell. \n\nTruly, keep going. That is the answer.\n\n3. Tell stories. Show stories. Make jokes. Use humor. Be charismatic. Be social. Entertain. Give yourself time to learn the skills, but learn the skills. Become an actor. Make people feel. \n\nAnyway thanks ill post another one some day maybe. ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 584,
    "downs": 0,
    "created_utc": 1724522748.0,
    "media": null,
    "is_video": false,
    "num_comments": 115,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.49688486069564
  },
  {
    "score": 555,
    "title": "I gained more than 100m views in last two months with Instagram edits app (proof in comments)",
    "selftext": "I’ve got more than 100 million views in the last 2 months. \n\n\nNow let me explain how this works, properly.\n\nWhen you open the Instagram edits app and go to “View Insights”, there’s a small graph.\nThat graph shows how long people are watching your video.\nAnd where they drop off.\n\nLet’s say your reel is 20 seconds long.\nAnd people are leaving after 5 seconds.\nThat means your intro or your first line isn’t strong enough to hold them.\n\nNow this is how I check if a reel is doing well or not.\n\nIf at least 50% of your viewers watch more than half of the reel, it’s considered decent.\nSo for a 20-second reel, people should be watching at least till the 12 or 13 second mark.\n\nIf they’re dropping off before that, there’s a problem in the script or edit.\nAnd you can see exactly where the problem is using the graph.\n\nNow here’s what I do when I see a drop.\n\nLet’s say people are leaving at 8 seconds.\nI take that reel, and I remake it.\nBut this time, I add a second hook right before the 8-second mark.\n\nSo if my first hook is in the first 2 seconds, the second one comes around second 6 or 7.\nThis second hook could be anything. A new visual. A shift in music. A strong line. A zoom-in. A question. A surprise.\n\nWhatever keeps people interested.\n\nI usually put 3 hooks in total:\nOne at the start. One near the drop point. And one closer to the end.\n\nBecause attention doesn’t last. And you have to keep earning it again and again.\n\nNow if people are still dropping off even after you do this, then the script itself is weak.\nNo saving it with editing. You have to rescript. Rewrite. Then post again.\n\nI’ve done this process on multiple reels.\nEvery single time, views go up.\n\nThis graph tells you what to fix, when to fix it, and how your audience is behaving.\nIt’s literally a cheat code. And most people aren’t even looking at it.\n\nI’m posting proof in the comments.\n\nTry this once. You’ll see it yourself.\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 555,
    "downs": 0,
    "created_utc": 1752097022.0,
    "media": null,
    "is_video": false,
    "num_comments": 142,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.557742810314589
  },
  {
    "score": 546,
    "title": "UPDATE: Instagram Algorithm 2025 – Full Breakdown + Reel Strategy + Hook Templates",
    "selftext": "Hey folks This is an update to that post I made a year ago about how IG works. Since then? The algorithm's been through a full-blown personality change.\n\nIf your views tanked outta nowhere you’re not crazy. IG did change. I’ve been testing every damn thing for the past few months. What works, what’s dead, what actually makes content go viral in 2025.\n\nHere’s the full breakdown.\n\n\n---\n\nACCOUNT SETTINGS STUFF\n\n&gt; 1. Account Type If you're using a business account—switch to creator ASAP. Business accounts (esp. ones not running ads) get suppressed hard.\n\n\n\n\n&gt; 2. Verification Get IG’s in-app blue tick or  Get mega verification (media features, third-party PR). Helps with push and trust score.\n\n\n\n---\n\nHOW THE IG ALGORITHM WORKS (2025 VERSION)\n\nWhat matters now:\n\n1. Engagement quality: Saves + shares &gt; likes + comments\n\n\n2. Speed: First 30–60 minutes decide everything\n\n\n3. Content type: Reels &gt; Everything else (feed posts are just portfolio at this point)\n\n\n4. Interactions: The more back-and-forth with followers, the better your reach\n\n\n5. Content match: If your stuff matches a user’s past behavior, IG shows it\n\n\n6. Time posted: Drop at your audience’s peak active hour, not just \"morning\" or \"evening\"\n\n\n7. Hook: First 1–2 seconds of the reel = either scroll or stay\n\n\n8. Story: Reels that build curiosity always perform better\n\n\n\n\n---\n\nHOW CONTENT IS PUSHED\n\nPhase 1: Goes to a test batch of followers + 1–5% of similar non-followers\n\nPhase 2: If saves/comments &gt; 10% → gets pushed to Explore + Reels tab\n\nPhase 3: If retention is strong (&gt;70%), goes viral → snowball effect kicks in\n\nDead content = bad first 2 hours. It won’t recover.\n\n\n---\n\nREEL STRATEGY THAT’S WORKING RIGHT NOW\n\n1. Format\n\n\n\n9:16 vertical\n\nSubtitles (burned-in, high contrast)\n\nMax 20–30 seconds\n\nBold hook in first 2 sec\n\nCut every 1.5–2 sec to hold attention\n\nPunchline or payoff at the end\n\n2. Content Style\n\n\n\nStorytelling with a twist\n\n“POV” or “You won’t believe…” structure\n\nControversial opinion = more shares/comments\n\nBehind-the-scenes or “Did you know?” facts\n\nPersonal transformation/lesson\n\nUse trending sounds, but edit your way\n\n3. Engagement Hooks End with:\n\n\n\n“Agree or nah?”\n\n“Tell me I’m wrong.”\n\n“Save this for later.”\n\n“Who needs to hear this?”\n\n“This one’s gonna start a fight.”\n\n“If you’re not doing this, you’re invisible on IG.”\n\n\n---\n\nVIRAL HOOK TEMPLATES (COPY + TWEAK THESE)\n\nFor Education:\n\n“Most of you are doing this wrong…”\n\n“Let me break this down so a 10-year-old gets it.”\n\n“Everyone talks about X. Nobody talks about this.”\n\n“You’ve been lied to about…”\n\n“This took me 3 years to figure out. You get it in 20 seconds.”\n\nFor Curiosity:\n\n“Watch what happens at the end.”\n\n“This will mess with your head…”\n\n“No one’s ready for slide 3.”\n\n“This nearly got me cancelled…”\n\n“I wasn’t gonna share this, but here we go…”\n\nFor Authority/Proof:\n\n“What I learned after 100M+ views.”\n\n“We tested 34 posts. Here’s what worked.”\n\n“Client hit 100K in 60 days. Here’s how.”\n\nFor Relatability:\n\n“You ever feel like…”\n\n“If you’ve ever done this, you’re not alone.”\n\n“This is for the ones who feel invisible.”\n\n“The internet won’t tell you this—but I will.”\n\n\n---\n\nCAROUSEL + FEED POST TIPS\n\nStill useful, but for depth/trust building. Not growth. Use them to:\n\nDrop value (step-by-step stuff)\n\nSell your product/service\n\nRepurpose long-form content into bite-size info\n\nAdd a call-to-action: “DM me ‘GROWTH’ for the full system”\n\n\n---\nMore tips \n\nUse pinned comments with CTA\n\nCollab posts = combine both audiences\n\nTurn high-performing reels into ads\n\nDM everyone who comments (manually or automated)\n\nCreate mini content series (Ex: “Day 4 of growing from 0–10K”)\n\nSave your CTA for the last 3 seconds of the reel ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 546,
    "downs": 0,
    "created_utc": 1744053392.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4272298357727555
  },
  {
    "score": 535,
    "title": "5 Months Working in a Digital Marketing Team With 8M+ Followers — Here's What They Won't Tell You",
    "selftext": "I’ve been working full-time in a digital marketing team with over 8 million followers in one page. In just 5 months, I’ve created 5 pieces of content that each passed 10 million views and their likes range from 300K to 700K. Many with at least 800K views and of course many failed to even get past 500K views in an 8M page.\n\nHere's my take:\nNo, you don’t have to post 1–2 Reels a day.\nNo, follow unfollow isn’t a strategy, and it harms your page.\nAnd no, not every trending piece of content goes viral. Everything is about the content you post.\n\nEven if you’ve posted twice a day and one of them blew up, that doesn’t mean “post more” is the magic trick. It just means that one piece was aligned with your audience and with Instagram’s algorithm.\n\nNow here’s what most viral content (especially narrative or talking-head style) tends to have in common. Three factors I see again and again are:\n\n- Simplicity\n- Tangibility\n- Emotionality\n\n## Why simple?\n\nBecause people’s brains are cooked.\nWe’re all overstimulated. Every day, we're hit with notifications, conversations, side quests, and information overload. That means when people open Instagram, they’re not looking to think hard. And if your content makes them work too much to understand it, they’ll scroll right past.\n\nSo make it simple. But simple doesn’t mean dumb. It means say things in a way that’s clean, sharp, and quick to grasp. You can talk about complex ideas, but just do it in a way that feels like a smart friend explaining it over coffee.\n\n## Why tangible?\n\nBecause vague = forgettable.\nWhen you say stuff like “This strategy helped me grow”. Nobody cares. But when you say “This hook took my likes from 800 to 9,200 in 3 days”. Now we’re listening.\n\nPeople remember things they can picture. Real numbers. Visual details. Specific tools. When you bring your content down to the concrete, it becomes real. And real is what spreads.\n\nIt’s the difference between:\n\n&gt; “We saw engagement improvements.”\n\nvs.\n\n&gt; “We swapped our CTA from ‘Follow for more’ to ‘DM me ‘start’’ and saved 20 DMs in the first hour.”\n\nOne is air. The other is grip.\n\n## Why emotional?\n\nBecause the major users of Instagram have shown they often open Instagram to feel something or express feelings - be it relief, excitement, frustration, validation, inspiration, pain, or even sadness. Whatever the emotion is, if your content does trigger it, it has a higher chance to succeed and stick.\n\nWhether they realize it or not, most users go to the Explore page hoping to feel. That’s your job.\n\nAs Dan and Chip Heath said in their book Made to Stick:\n\n&gt; “Emotional engagement is a key principle for creating ideas that stick because feelings are more memorable and drive action than logic alone. People remember how an idea made them feel, even if they forget the details.\"\n\nSo if you want to create posts that land, that stick, that get saved, shared, and stitched: Make it simple. Make it tangible. Make it emotional.\nThese are the characteristics of someone we often call charismatic.\n\nThink of someone you can remember easily. You have probably thought of someone charismatic. If you watch charismatic people closely you’ll notice they do all three of these things naturally. They say things clearly. They ground what they say in specifics. And they make you feel something. So be charismatic in the way you create content. You’ll stand out.\n\nAnd even if you didn't think of a charismatic person, you have thought of someone who's often surprising, important to you or confident. And all these characteristics apply to different forms of viral contents. These three were only the most important and frequent ones.\n\nNow you know.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 535,
    "downs": 0,
    "created_utc": 1749679751.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.400331037908404
  },
  {
    "score": 507,
    "title": "I still make 4-6k per month as income on Instagram, but it took a lot...",
    "selftext": "In high school I was mindlessly scrolling through Instagram. I had no big plans, just an idea to create a random account where I could post funny memes and cool conspiracy theories. The account wasn’t anything serious, just a place for me to kill time and share some laughs with friends. I ended up creating it and spam posting on it without any structure or care.\n\nTo my surprise, the account grew. It wasn’t an overnight explosion, but followers trickled in steadily. By the end of a few months, I had thousands of followers and a stead flow of people liking and commenting on my posts. One day, out of the blue, I got a direct message from someone asking if I was willing to sell the account. I didn’t even know that was a thing, but the money they offered seemed too good to pass up. I sold it.\n\nThat transaction flipped a switch in my head. Social media wasn’t just a platform for sharing random thoughts... It was a business opportunity. I started thinking about why my first account worked and began experimenting with others. I didn't know what I was doing at the time, but I juggled creating content, engaging with followers, and managing now more than one account... all while keeping up with schoolwork.\n\nYears later, I found myself running a small network of comedy and model pages. This was when I began charging for story/ad promos and even affiliate marketing here and there. Companies were actually reaching out to me on at least one account every other day. It started becoming a lot to handle and I was lucky enough to find someone who had just started having the same passion for Instagram as I did back in high school. I made him a manager of the accounts and he helped out tremendously. This allowed me to focus more on strategy and reach out for more business, while he generated content and engaged with followers.\n\nFast forward years later again, I do less Instagram but I still barely lift a finger. The pages continue to grow due to always outsourcing quality people. Income rolls in from story promotions, affiliate marketing deals, and even the occasional sale/flipping of an account. What started as a random, high-school hobby has turned into a passive-income stream. And while I’ve ventured into other projects, I’ll always remember that first account and how one impulsive sale changed everything.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 507,
    "downs": 0,
    "created_utc": 1734603767.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.395623338593229
  },
  {
    "score": 465,
    "title": "Instagram Mass Add to Close Friends method",
    "selftext": "You have seen the Billie Eilish marketing trick to get all your followers into close friends. Why? Stories by close friends appear on your Instagram first. Thus your story will always be on top. This can easily 2x-10x your story views, engagement and reach. This also works extremely well for dead accounts with high number of followers with small numbers of story views. The best thing is this will permanently make your reach higher. I am sharing the method for free.\n\n**Method:**\n\n1. Scrape all your followers. I have used Givemedata but you can use any provider or scraping bot. This step is voluntary, but if you are trying to do this method to your main account, I highly recommed using external scraping to avoid getting flagged and banned by Instagram. It took them around 15 mins to scrape 50k followers from my account.\n2. For adding all followers to close friends, I've used app.fanzella.com. This is a paid bot, and you need the paid version for the close friends add feature. You can however use the discount code \"DISCOUNT\" or \"SALE\" to get it cheaper.\n3. In the app.fanzella.com, connect your Instagram account and go to Reactions Pro\n4. In targeting, select User IDs and then click on Targets list\n5. Put all users IDs your bot/givemedata scraped you in this\n6. Click on Close Friends - Enable, Bulk Add, 25 users, Delay 1 minute, Use Custom IDs list.\n7. You can add custom proxy in the Custom proxy settings (I used Airproxy)\n8. Start the bot and wait. With this settings, 50k followers took 2 days to add them all to close friends. It is important to keep the limits like this to avoid getting flagged.\n9. Once done, add a story to your close friends and enjoy the results.\n\n**Q&amp;A**\n\nQ: Is it safe?  \nA: I have tried this multiple times, on main accounts, without any ban. To be absolutely safe, use external scrape service and proxy, as suggested in the method.\n\nQ: How much growth can you see?  \nA: Normally it's around 2x-10x. If you used to get 500 story views, you can almost expect to get 1500-5000 story views from now on.\n\nQ: Are the effects also visible on public stories?  \nA: Yes! Once you post the first close friends store, you can expect the public stories to grow as well.\n\nQ: Can you provide support?  \nA: app.fanzella.com has a Telegram support page.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 465,
    "downs": 0,
    "created_utc": 1738761787.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.204415912353982
  },
  {
    "score": 467,
    "title": "Went from 0 to 20k in 2 weeks - Here’s exactly how I did it",
    "selftext": "I’ve now grown 2 IG pages quickly. One in December 2022 and now in June 2025.\n\n**My Track Record:**\n\n\\- First page: 0 to 10k in 1 month (December 2022). Currently over 100K followers \n\n\\- **Recent page**: 0 to 10k in 1 week, 20k in 2 weeks (started May 30, 2025)\n\n**Why I Started Over**\n\nLast year I noticed a major algorithm shift. My original page is a local foodie/events content, and the strategies that used to work just weren’t hitting anymore. Plus I’ve honestly outgrown that niche and lost interest in it. I still post there but I’m not as into it as before.\n\n**My 2025 Growth Strategy - Step by Step**\n\n\\#4 is a BIG one!\n\n**1. Research Phase**\n\n\\- Spent time studying successful accounts in my target niche (lifestyle/personal brand)\n\n\\- Analyzed which video formats were actually going viral\n\n\\- Identified common visual and content patterns\n\n**2. Content Strategy**\n\n\\- Created reels with strong visual hooks in the first 1-2 seconds\n\n\\- Used clear text overlays that immediately communicated value\n\n\\- Focused on retention - structured videos to keep people watching until the end\n\n\\- Recreated trending formats but added my own unique angle/personality\n\n**3. Batch Creation**\n\n\\- Filmed multiple videos in single sessions\n\n\\- Always had 5-7 videos ready to post\n\n\\- Maintained consistent posting without daily pressure\n\n**4. Audience Isolation (very important)**\n\n\\- Did NOT tell friends/family about the new page\n\n\\- Didn’t cross-promote from my existing 100k account\n\n\\- Why? Wrong audience engagement confuses the algorithm and hurts reach\n\n\\- Only share with people who genuinely match your target demographic\n\n**5. Profile Optimization**\n\n\\- Clear bio explaining exactly why someone should follow\n\n\\- It helps if they can see themselves in your bio (and content)\n\n**6. Do Hashtags matter?**\n\n\\- I’ve done a mix of hashtags and no hashtags. My must viral videos have no hashtags. However, keyword optimization is very important. \n\n\\- It is more important to use relevant text in the video and within the caption to help the algorithm know who to serve your content to\n\n(Edited to add):\nA few people asked how I got my first few followers. I forgot to mention it in the post originally, but I got 2 followers within minutes from my first IG reel and at least 3 from TikTok where I had my IG handle in my bio. I didn’t include it at first since I was focused on the overall growth strategy, but hope this helps for anyone just starting out!\n\nFeel free to ask specific questions below! If you want more personalized guidance for your particular situation, I’m also available for that - just shoot me a DM :)",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 467,
    "downs": 0,
    "created_utc": 1751228915.0,
    "media": null,
    "is_video": false,
    "num_comments": 157,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.489574396551335
  },
  {
    "score": 465,
    "title": "So I just went from 368 followers to over 11k in less than a week…",
    "selftext": "I am not selling a course or claiming to be an expert of any sort. But I just wanted to share this crazy growth that I’ve had over the past week and hope to inspire others. \n\nI have a tech/gaming account and recently I tried a new video format inspired by another creator I saw. And it has exploded the growth of my account lol. \n\nSo if you feel stuck like I was for months, keep trying new things! Find inspiration! Keep trying to get better and find what sticks! Then once you do ride that momentum and keep doing what works. \n\nMy IG is in my profile for this account. \n\nHappy weekend!",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 465,
    "downs": 0,
    "created_utc": 1725721873.0,
    "media": null,
    "is_video": false,
    "num_comments": 167,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.493540557552931
  },
  {
    "score": 452,
    "title": "Instagram Hashtags Are Basically Dead in 2025 — Here’s What to Do Instead",
    "selftext": "The CEO of Instagram just confirmed it: hashtags are no longer the magic growth trick they used to be. They barely move the needle for reach anymore.\n\nIf you want to grow faster on Instagram in 2025, here’s what you should be doing instead:\n\n1. Profile Settings → Account Privacy → Turn ON “Allow public photos and videos to appear on Google.”\nThis helps your content show up outside Instagram’s walls\n\n2. Profile Settings → Media Quality → Turn ON “Upload at highest quality.”\nInstagram prioritizes crisp, high-res uploads in recommendations.\n\n3. Before posting a Reel → More Options → Turn ON “Recommend on Facebook” and “Recommend on Explore.”\nThese push your content to more viewers without them following you.\n\n4. On desktop → Edit Profile → Enable “Suggest your profile to art lovers” (or relevant audience setting for your niche).\nThis makes Instagram actively promote your profile to people who care about your content’s topic.\n\nTL;DR: Hashtags aren’t dead because of a conspiracy — they’re just not how Instagram finds and recommends posts anymore. Turn on these settings and let the algorithm actually work for you.\n\nWant more than just reach?\nAt Layba.gg, we help small creators monetize their content across Instagram, TikTok, and YouTube Shorts. Join our creator community, learn growth strategies like this, and start turning your audience into actual income.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 452,
    "downs": 0,
    "created_utc": 1755237927.0,
    "media": null,
    "is_video": false,
    "num_comments": 61,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.257294046761959
  },
  {
    "score": 445,
    "title": "1.5M followers in 3 months. AMA",
    "selftext": "I have been running Instagram niche pages for around 8 years. In those 8 years there has rarely been time where I take a break for longer than a month, especially in the last 5 years. I've grown and helped other people grow in the millions of followers. There's been all types of pages I've grown but I definitely have a bias towards the meme niche. I will be posting photo proof in the replies here soon, ask any questions that come to mind and I will do my best to answer them!",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 445,
    "downs": 0,
    "created_utc": 1735246211.0,
    "media": null,
    "is_video": false,
    "num_comments": 622,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.751578882041727
  },
  {
    "score": 408,
    "title": "Guys, I’m gonna make blowing up EXTREMELY simple for you:",
    "selftext": "I blew up a couple months ago and have had decent success. Once you blow up, it kind of just clicks. \n\nIts gonna sound trollish but really hear me:\n\nJust make content people want to share. \n\nIts a tough pill to swallow but no one cares about you or what you care about. They want something crazy, funny, or hot enough to be entertained by and share. You need to fill that gap. So whatever you do in your niche, take it to a shareable level. Drop your ego. Usually its more fun this way anyway. \n\nIf I changed one life, you’re welcome.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 408,
    "downs": 0,
    "created_utc": 1722284314.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.300358924527126
  },
  {
    "score": 397,
    "title": "Went from 0 to 400k in 1 year",
    "selftext": "Built an IG page to 400K+ followers in 12 months and scaled multiple others past 100K. Decided to be useful to society today.\n\nIf you have a business or just an idea, but don’t know how to grow on Instagram or market it properly, drop it below.\n\nTell me what your idea is, who you want to serve, and I’ll give you a custom game plan to hit your first 100K followers.\n\nIf that’s you, let’s make today the day you finally move forward.\n\nLet’s go.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 397,
    "downs": 0,
    "created_utc": 1751131784.0,
    "media": null,
    "is_video": false,
    "num_comments": 404,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6386105836810225
  },
  {
    "score": 382,
    "title": "I analyzed 306 short-form videos with 1M+ views — this 1 format keeps going viral",
    "selftext": "The beauty of it?\n\nAny content creator in any niche can create this type of reel in less than 5 minutes.\n\nPlus, you’re about to get an AI prompt to write the entire script for you in 3 seconds.\n\nThe video I based it on is super simple — the creator sharing an “insider hack” to save money on accommodation.\n\n(5 million views, 574K likes).\n\nDon’t think I can share the link here - but there are no fancy shots/editing. \n\nJust pure value spoken straight into the camera.\n\nThe overlayed screen caption is an awesome hook:\n\n**“This travel hack is so good it feels illegal to know 😅”**\n\nExclusivity and secrecy are powerful motivators and build massive curiosity.\n\nIt’s why these “insider tip/hack” videos often go viral.\n\nI dug into the psychology behind why this video took off.\n\n**📔 Here’s the 30-second script template (it’ll work in any niche):**  \n\n1. **Hook**: Use a screen caption that makes the video feel like a secret — (“This \\[Niche\\] Hack Feels Like a Secret No One Should Know 😅”).\n2. **Position As Insider**: Open by saying it’s a “gatekept” tip or hack.\n3. **Highlight Unique Benefit**: Share why the hack is so effective.\n4. **Make It Relevant**: Link it to a relatable, common scenario.\n5. **Reveal Hack**: Explain it in one straightforward sentence.\n6. **Add Pro Tip**: Include a bonus detail to boost the hack’s usefulness.\n7. **Show Proof**: Add a one-sentence success story to increase the hack’s credibility.\n8. **Call To Action**: Invite them to follow you for more “insider” hacks.\n\nNow let’s speed things up.\n\n**Paste the following prompt into ChatGPT** after filling in your role/business and target audience in the first sentence.\n\nPress enter.\n\nIt’ll first suggest 10 ideas for non-obvious hacks that would fit well into this reel template. \n\nPick a hack you like and ChatGPT will then use the template to generate the reel script for you in seconds.\n\n# 🦾 AI Prompt: \n\n*\"I’m a* ***\\[ROLE/BUSINESS\\]*** *and a content creator, and my target audience is* ***\\[TARGET AUDIENCE\\]****.*\n\n*I’d like to create an “insider hack” short-form video script using the reel script below.*\n\n*First, please review the script and suggest 10 non-obvious, highly effective hack ideas that would fit well with it. These hacks should feel exclusive, like something only an insider would know, and shouldn’t be obvious.*\n\n*At the end of your response, ask me if I like any of the hack ideas. If I do, use the template to create the script for me.*\n\n*Use short, one-sentence paragraphs with clear spacing. Remove bracketed labels from the final script.*\n\n*\\[Screen Caption\\]* \n\n*\"This \\[Niche\\] Hack Feels Like a Secret No One Should Know 😅”*\n\n*\\[Opening Hook\\]*\n\n*\"I'm done gatekeeping—this is my biggest \\[topic\\] hack for \\[target audience\\] who want \\[benefit\\]\"*\n\n*\\[Emphasize the Benefit and Uniqueness\\]*\n\n*\"This one hack has saved \\[me/my clients or customers\\] \\[mention specific, tangible benefit, e.g., 'thousands of dollars' / 'hours of work''\\], and I can't believe no one is talking about it.\"*\n\n*\\[Build Suspense with a Universal Action Step\\]*\n\n*\"Every time—and I mean every time—you \\[common activity in my niche, e.g., 'launch a campaign,' 'book a stay,' 'plan a meal'\\], do this.\"*\n\n*\\[Reveal the Hack with a Simple Action Step\\]*\n\n*\"\\[Explain the hack in one sentence, emphasizing how easy it is and why it works so well.\\]\"*\n\n*\\[Add Extra Value\\]*\n\n*\"I always \\[describe specific detail or personalization that adds value, e.g., 'save it with this label' / 'use this shortcut' / 'mention this specific thing'\\].\"*\n\n*\\[Reinforce with Success Story\\]*\n\n*\"Just this \\[week/month\\], I \\[specific, concrete example of hack’s success in one sentence\\].\"*\n\n*\\[Call to Action\\]*\n\n*\"Follow me for more \\[niche\\] tips you won’t find anywhere else.\"*\n\n# ---------------END OF PROMPT----------------\n\nNow all you have to do is:\n\n* Review the script it generated — edit any inaccuracies.\n* Read the script on camera.\n* Add the main screen caption (hook) as an overlay.\n* (Ideally) add captions for the entire script.\n* No fancy video editing needed.\n* Post it as a Reel, Short, TikTok, or anything else.\n\nWhat do you think?\n\nGive it a go and see what you come up with.\n\nP.S. If you’re into these types of templates and prompts - I’ll post more of them here. You can also check out my profile for more if you're interested.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 382,
    "downs": 0,
    "created_utc": 1731596083.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.055773763128576
  },
  {
    "score": 375,
    "title": "i quit the brand but here is some free sauce",
    "selftext": "hi i used to run meta ads for clothing brand doing under $20K not there anymore (management sucked lol) but wanted to share what actually worked for us\n\nsimple setup- one campaign, one ad set, broad interest like t-shirts if that’s what we sold, No crazy lookalikes or exclusions.\n\nonly 2 main creatives most of the time.\n\nwinning offer: “free gift with your first order” outperformed discounts, bundles, and BOGO. felt like a bonus, not a sale.\n\nbest creatives: clean, high-quality photos from real shoots Not overproduced just well-lit and composed. Way better than UGC or graphic-heavy stuff.\n\none strong creative with a clear offer beat 10 average ones every time.\n\nhope this helps someone- just showing what helped us, happy to answer any questions.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 375,
    "downs": 0,
    "created_utc": 1750513726.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.2972085410882075
  },
  {
    "score": 376,
    "title": "This is what I’ve learned from posting 90 reels on Instagram",
    "selftext": "So after a month of posting 90 reels, this is what I’ve learned. Let me know if you agree! (FYI, I have 7 reels with 100k+ views)\n\nTips on how to grow viral/semi-viral on reels:\n1. An attention-grabbing hook is a MUST\n\n2. A long, informative caption that keeps the viewers from scrolling. \n-(OPTIONAL, BUT RECOMMENDED) \n-Type it yourself first, and then use AI (Chat-GPT) to refine it\n\n3. The reel should be no more than 15 seconds long\n        -Unless you are certain that the viewer will watch the majority of the video based on your experience\n\n4. The view rate past the first 3 seconds should be AT LEAST 80%\n- Videos &lt; 80% occasionally go viral, but it happens seldom\n\n5. Include a CALL-TO-ACTION (CTA) \nEx: “Follow for more content like this”\n\n6. Don’t continue to post reels blindly with the hope of one of them sticking to the wall\n- Develop a plan, and see what works and what doesn’t\n\n7. Informative reels tend to perform well\n\n9. Look from the viewers’ perspective. Ask yourself, “Would this reel grab my interest if I were a viewer doom-scrolling?”\n\n10. Use sound/background music that aligns with/enhances the quality of the reel\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 376,
    "downs": 0,
    "created_utc": 1748899517.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1929353637088935
  },
  {
    "score": 366,
    "title": "I'm a Professional Digital Marketer and Social Media Growth Expert - Free Advice and AMA",
    "selftext": "I've been managing social media and overall digital Marketing growth for various brands and creators since several years as a freelancer and I've helped accounts grow significantly across all social media platforms. \n\nI see a lot of you posting about algorithm changes, engagement drops, and content not reaching the right people. I faced all these same challenges when starting out. \n\nI'm happy to share what's worked for me and my clients over the years.\nIf you're stuck with your social media growth or just want someone to look at your strategy, drop your questions below or feel free to reach out!\n\nP.S. I am really glad that I was able to provide value to so many of you through this post till now. New comments and texts are always welcome!",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 366,
    "downs": 0,
    "created_utc": 1738582005.0,
    "media": null,
    "is_video": false,
    "num_comments": 435,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.604409308886382
  },
  {
    "score": 356,
    "title": "I Reverse-Engineered Those \"Brain-Rot\" Educational Videos and got 1 million views in 7 days",
    "selftext": "Like many of you, I've been grinding away, trying to crack the code on Instagram growth. We spend hours on content, and yet our reach flatlines. It's frustrating.\n\nBut lately, I've been obsessed with a specific type of content that seems to defy all logic: the \"educational\" or \"fact\" Reels with random gameplay footage (like Minecraft parkour or Subway Surfers) running in the background.\n\nIt's easy to dismiss them as low-effort \"brain rot.\" But I noticed some of these faceless pages were pulling in **millions of views per video** and growing by tens of thousands of followers a month. So, I put my analytical hat on and broke down exactly why this formula works.\n\nHere’s the 5-step system they all use:\n\n**1. The Hook: An Outrageous Claim or \"Secret\"**  \nThe video starts immediately with a hook that's impossible to ignore.\n\n* \"Why you've been peeling bananas wrong your whole life.\"\n* \"The 3 psychological tricks to make anyone like you.\"\n* \"Here's what Apple doesn't want you to know about your iPhone.\" It creates an instant knowledge gap and promises a quick, satisfying answer.\n\n**2. The Visuals: Dual-Stimuli Addiction**  \nThis is the key. While the \"educational\" content plays out, there's a visually engaging, unrelated video playing. This isn't a mistake; it's a retention hack. It gives the viewer's brain two streams of stimulus, making it incredibly difficult to scroll away. Your conscious mind wants the information, while your subconscious is captivated by the satisfying or suspenseful gameplay.\n\n**3. The Pacing: Zero Wasted Seconds**  \nThere are no intros, no \"hey guys,\" no fluff. The audio is fast-paced, and the subtitles are timed to appear just as the words are spoken. This relentless pace keeps the viewer locked in, always anticipating the next piece of information. The average watch time on these is through the roof.\n\n**4. The Audio: A Familiar Voice &amp; Viral Sound**  \nMany use a slightly robotic, text-to-speech voice or a cloned voice of a familiar character (I've seen everything from Peter Griffin to David Attenborough). This removes the \"human element,\" making the content feel like an objective fact being delivered. They pair this with a trending-but-not-distracting audio track.\n\n**5. The Animated Subtitles (The Real Retention Secret)**  \nThis is non-negotiable. The subtitles aren't static; they are animated to appear word-by-word (the \"karaoke effect\"), often with color pops, emojis, and subtle bounces. This forces the viewer's eyes to stay glued to the screen, tracking the words as they appear. It reinforces the audio message and makes the content just as engaging with the sound off, dramatically boosting total watch time.\n\n**6. The Loop: A Perfect, Unsatisfying Cut**  \nThe video often ends abruptly, right after the final \"secret\" is revealed. This makes the loop to the beginning almost seamless. Many users will re-watch it 2-3 times just to fully process the information, which sends powerful signals to the algorithm.\n\n**Why This Crushes the Algorithm:**  \nInstagram's main goal is to keep users on the platform. This formula maximizes two key metrics:\n\n* **Watch Time:** The dual-stimuli approach keeps people watching to the end.\n* **Engagement (Saves &amp; Shares):** The content is presented as a \"hack\" or \"secret,\" making it highly shareable and save-able.\n\n**My Experiment &amp; The Bottleneck**\n\nI decided to test this formula myself. I started making these videos manually. The results were insane one of my first test videos broke 100k views in 48 hours. But the problem was the workflow. Even for these \"simple\" videos, finding the content, generating the voice, syncing the subtitles, and rendering took hours. It wasn't sustainable.\n\nAs a developer, my first instinct was to automate the annoying parts. I ended up building a simple tool that handles the whole pipeline: scraping the educational text, cloning a voice, adding the gameplay, and animating the subtitles. It turned a 3-hour process into 3 minutes.\n\nThis post is already long, but I'm fascinated by how effective this strategy is. I'm happy to share what I've learned with this community.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 356,
    "downs": 0,
    "created_utc": 1753348621.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.113094221933265
  },
  {
    "score": 356,
    "title": "Social media is the biggest scam of the century",
    "selftext": "Millions of people are putting their time and money into adding value to a billion dollar company. User generated content is the most brilliant con ever invented. People work to build up their (the companies) followers to maybe reach some confirmation of their own worth. They see others “influencer” that are “successful”. But success is bringing more free content for instagram and the producers of content get free junk from advertisers for free content. Its digital prostitution that 99% of participants see no financial gain from. And yet, they plod ahead because of the confirmation bias of the algorithm. You are going to get more money opening up a lemonade stand on a street corner. You are being played.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 356,
    "downs": 0,
    "created_utc": 1761151986.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.199592761480821
  },
  {
    "score": 339,
    "title": "I'm a Professional Social Media Growth Strateist - AMA and Free Advice ",
    "selftext": "I've scaled several businesses over the years as a freelancer and honestly made pretty much every mistake you can imagine. \n\nI see a lot of small business owners and content creators struggling with same challenges I faced when starting out. \n\nI have learned a lot from all the amazing communities on reddit and I'm looking to pay it forward as I finally have some time on my hands. \n\nIf you are feeling stuck or just want a second opinion on your growth strategy, feel free to reach out! \n\n\n\nUpdate: It's amazing that I was able to help so many of you! New comments are always welcome on this post and I am regularly responding to all the comments that are still left unattended! ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 339,
    "downs": 0,
    "created_utc": 1734434774.0,
    "media": null,
    "is_video": false,
    "num_comments": 618,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.639824241552313
  },
  {
    "score": 336,
    "title": "Instagram just rolled out its new algorithm... and it stinks. [LONG POST]",
    "selftext": "\\[EDIT\\] It looks like they're rolling it back somewhat in the past 48h.  \n  \nHey folks, yesterday instagram rolled out a major change to their algorithm and it's the key reason why we're seeing reach plummet, particularly for smaller accounts.\n\nHistorically, Instagram's algorithm focused on promoting your content based on your existing followers. If the first 10% had a higher engagement than usual, then they will push it more aggressively to the next 10%. And so on. This approach obviously favoured larger accounts.\n\nAnd from Instagram's POV, there were a few problems with this:\n\n1. Led to lower engagement on the platform if all users see on their feeds are the same accounts -&gt; less opportunity to sneak in adverts\n2. Led to ad revenue leakage – if you know that sponsoring a few key influencers will have better results than paying for ads -&gt; lower ad spend\n\nSo about a year ago, they upgraded their algorithm to show your content to non-followers very early on, within 10-30 minutes of posting. If it's engaging, it will be promoted regardless of the account size or niche. A video with 75%+ view rate past 3 seconds almost guaranteed to be viewed 10x+ the amount of followers.\n\nThis levelled the playing field for smaller accounts. And we've seen some videos blow up in ways that would never have happened before – one of my accounts had 6 followers, yet its 3rd video blew up to 4.2m views with $0 ad spend.\n\nHowever, Instagram rolled out a new version of their algorithm yesterday. I don't have the full picture with larger accounts (150k+ followers), but it seems like somewhat of a reversal to the old algorithm. For the first several hours, the content is almost exclusively shown to followers.\n\nWeirdly enough it looks as though they added a negative weight for non-followers view rates, but forgot to set a floor of 0% in their UI. I'm not quite sure what to think of that yet (see screenshot in the comments).\n\nAll I can do is speculate why they've made that decision: protection against AI slop – a lot of the content that went viral in the past 2 months was veo3 generated, with many comments asking (or protesting) about AI triggering the algorithm into thinking it was highly engaging. But it seems that in the process they've hurt the reach of all new accounts, whether AI generated, quality or slop.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 336,
    "downs": 0,
    "created_utc": 1752761359.0,
    "media": null,
    "is_video": false,
    "num_comments": 160,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.351042838887263
  },
  {
    "score": 329,
    "title": "Went from 0-10K+ in under 90 days 4 times (here's the exact process)",
    "selftext": "I've now grown 4 IG accounts to over 10K relatively quickly, across completely different niches, and I'm going to break down the exact process that works every single time, and it'll work for you too\n\n**First: My Track Record:**\n\n* Our brand account: 0 to 10K in less than a month, now 100K+\n* AI app founder: 0 to 10K in 90 days (relationship content)\n* Doctor and longevity coach: 0 to 10K+ in 90 days, went from 60-100 views to 1-8K average views\n* Theme page creator: 0 to 12K in 85 days (started with literally 0 followers)\n\nMost people think growth is niche-specific. It's not. Human psychology and research will get you to where you want to be\n\nHere's the step-by-step breakdown...\n\n**The 90-Day Framework (5 Steps)**\n\n\\#5 is a is SUPER important! - without it you'll be putting in effort and seeing little to no results\n\n**Step 1: Idea &amp; Ideal Audience**\n\nWhy are you making content and who are you making it for\n\nIf it's a personal brand: You want to list down all the problems you've experienced in life and solved for yourself - this is what gives you value, eg. fat to jacked; homeless to 6-figure sales director; breakup to happily married etc..\n\nHere's what I did: Made a list of all the years from 18 to now 29 and listed the problems I solved for myself each year\n\nThey should fall into 1 of 3 categories (if it's a personal brand it can be all 3):\n\n\\- Health, Wealth, Relationships\n\n**Step 2: Research**\n\nWhere most of your time should be spent\n\nI find 10 creators in the niche:\n\n\\- 5 big accounts (50K+)\n\n\\- 5 smaller accounts (10K or less) that grew fast\n\nThen I use the \"sort feed\" Chrome extension to download CSVs of their best content. This gives me a database of proven viral formats, hooks and visual hooks\n\n**Step 3: Content Strategy**\n\n\\- Pick a format: b-roll, talking head, voice over\n\n\\- Create reels with strong visual hooks in the first 1-3 seconds\n\n\\- Use clear text on screen to immediately communicate value (acts as a double hook if it's talking head - text hook and audio hook)\n\n\\- Focus on retention - structured videos to keep people watching until the end\n\nhere's a quick example:\n\nI take the proven formats from Step 2 and adapt them with my unique angle. Same structure, different personality.\n\n**The formula**\n\n**1. Hook**: Information gap that creates curiosity (\"5 habits that cause brain fog according to neuroscience\"\n\n**2. Body**: Deliver exactly what the hook promise\n\n**3. CTA**: Clear next step that serves the audience (can be put in the caption too if it feels unnatural)\n\n**Step 4: Profile Optimization**\n\n\\- Simple clear bio explaining exactly why someone should follow\n\nhere's an example:\n\n\"Line 1: Science-based relationship advice\n\nLine 2: Download the AI relationship app\"\n\n**Step 5: The Feedback Loop**\n\nShort-form content is the only place you get instant feedback (24-48 hours max).\n\nPost -&gt; Analyze -&gt; Adjust -&gt; Repeat\n\nTrack:\n\nWhich hooks get the highest engagement\n\nWhat content formats perform best\n\nWhich CTAs drive the most action\n\nAfter each week there should be a couple that outperform the rest - double down on these\n\nThe biggest problem you'll face is finding clarity and have a proven framework - by following this you should be good.\n\n**P.s. hashtags really don't matter**\n\nGood luck :) also feel free to ask any questions",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 329,
    "downs": 0,
    "created_utc": 1751742662.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.192756449317212
  },
  {
    "score": 322,
    "title": "How can I make money with Instagram?",
    "selftext": "I see a lot of people saying they have thousands of followers (congrats!!) and wan't to start making a bit of money from their following. Instead of replying to everyone here's a post (from someone who's done it):\n\n&amp;#x200B;\n\n1. **Paid shoutouts/promotions**: You can use [Social Spot](https://social-spot.com/) to get connected with businesses wanting to hire influencers/big pages for promos.\n2. **Start a Patreon**: You can use [Patreon](https://patreon.com) to get paid directly from your followers monthly in exchange for exclusive content or merch etc. It's a subscription platform that only works if you're very niche with a loyal following (and willing to get creative).\n3. **Dropship products**: Find a product within your niche, build a [Shopify](https://shopify.com) store around it and market it through your posts, stories, and link in bio.\n4. **Sell merch**: Once again, if you're super niche specific with a loyal following, you might find success with merch. You can sell all sorts of merch using [Printful](https://printful.com) without having to buy inventory.\n\n  \nI'd say the list goes from most likely to succeed to least likely, so pick your method accordingly. Good luck everyone!  \n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 322,
    "downs": 0,
    "created_utc": 1705371425.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1253994022425875
  },
  {
    "score": 315,
    "title": "I made $432,483.50 from social media marketing. 9/22 to 9/24 AMA",
    "selftext": "  Wish I could add this screenshot I just took from Shopify but oh well, like the title states I made $430k the past 2 years from my IG mainly. This doesn’t include money from plays, or gifts, or anything direct from Meta. Those numbers alone are around $20k. Last month’s payment from Facebook was $1,100.  \n\n  I do this thing where I look back and see the trends from my social media to my stores and like to reflect on the progress made. I’m in the Urban Farming niche, and while the views have been nice, the ultimate goal is to be fully monetized. For those that are BUILDING an audience pay attention to comments, there’s money to be made from your following and as long as you’re doing it properly and ethically you’ll see year over year growth. \n\n  I like to network, if you’re building up a page and are looking to monetize it for yourself but don’t know how, I’d love to check your page out and help you narrow down a niche. Viral content pays in much more ways than just view count. Collecting emails, contacts and in general commanding attention can equate to real paydays! ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 315,
    "downs": 0,
    "created_utc": 1725920599.0,
    "media": null,
    "is_video": false,
    "num_comments": 328,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.403285031593391
  },
  {
    "score": 308,
    "title": "Gained around 50k followers in 2 months.",
    "selftext": "This is not to show off. I want to help. If your idea is super niche that you don’t see anyone else doing, you will gain 100k followers in a month. This is why accounts that have no competition in their niche will grow insanely. But if your niche is common, you will struggle and will need  to have 1- have a better or on par content with other big names. 2-put value in it. This is my motto for posting my own videos “I post what I want to see/watch” and that’s it. I don’t have hooks, crazy angles, top notch quality (I use iPhone 14) and do you know why I’m still growing…because my leverage is that I’m the only one in the world that post these kind of content and that’s my leverage. That’s why cricket catchers are growing too. Or people who build houses on an island. Not many are doing it and that alone is a hook. If you got questions I can help! ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 308,
    "downs": 0,
    "created_utc": 1743426535.0,
    "media": null,
    "is_video": false,
    "num_comments": 222,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.369110910948915
  },
  {
    "score": 300,
    "title": "Here's what you need to grow on ANY social platform minus the B.S",
    "selftext": "There's 3 categorie types of content,  there's filler, failure and full proof content.  Content that just lives on ig for decades and comes and goes gets reposted by everyone is considered filler content. Nobody follows these accounts despite the virality. Nothing screams attention addict like filler content posters.\n\nNext, failure content,  this is just posting content that has no flippen need to even exist because it's generic.  I've fallen for this myself.  Yes, sure, you can go viral and gain a following if you're lucky, but most likely, you won't.\n\nThink of people who have pages for their dog. Unless your dog is doing something people have never seen, nobody cares to follow you.  The video can prob go viral but won't equate to actual followings.\n\nFinally, the full proof content. \n\nWith this, you are guaranteed to grow on any platform. \n\nIt's not so much about the content but the theme of your account,  you must create an EXPERIENCE associated with your account. This starts from as little as your page name and profile picture to the tone and response of your replies.\n\nPeople subscribe FOR 1 of 3 things:\n\n1. EDUCATION  (are u valuable in providing information)\n2. EXCLUSIVITY (do people feel like they are in a secret club)\n3. ENTERTAINMENT (does your content have a storyline)\n\nIf you can't achieve 1 of these 3 things and execute them EXCEPTIONALLY well you will never grow rapidly on social media.\n\nIf you can achieve all of them, you will grow rapidly!  20k in 2 weeks is possible when u pull it off.\n\nP.s you don't need high quality cameras, hashtag strategies,  or anything like that,  you don't need microphones and all the mumbo jumbo ppl say you need. \n\nYou need a series. Why cause people subscribe to series.\n\nLet me know if you would be interested in seeing examples of this.  If at least 20 people show interest, I'll put a few examples of creators that do this exceptionally well.\n\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 300,
    "downs": 0,
    "created_utc": 1741980672.0,
    "media": null,
    "is_video": false,
    "num_comments": 191,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.347717109945618
  },
  {
    "score": 299,
    "title": "I grew 2 Instagram theme pages to 400K followers each in under a year - AMA",
    "selftext": "I’ve built two Instagram theme pages from scratch and both reaching nearly 400K followers each, one in 7 months (humanity niche) and the second in 9 months (animal/wholesome niche).\n\nSoId the first one,  the second one average around 50 million views/month. Reels get 100K minumum to millions of views and thousands of comments often. Both pages are faceless and built on pure storytelling and only on my passion. (I've been helping people and animals in need since before I even started doing Instagram)\n\nThe current, still growing rapidly, focuses on animals being heroes or showing emotional intelligence, and is already one of the top-performing accounts in its category.\n\nI had no followers to start, no shoutouts, no paid ads – just  a passion and clear niche, and consistent posting. ( 3 -7 times weekly)\n\nAsk my anything and do my best to answer as many of you as possible!",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 299,
    "downs": 0,
    "created_utc": 1748361110.0,
    "media": null,
    "is_video": false,
    "num_comments": 404,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4933487663269975
  },
  {
    "score": 300,
    "title": "This will help you grow in 90 days (guaranteed with proof)",
    "selftext": "Writing this because all I see is either people bragging with no help or people trying for months without results\n\n*(you get skip to the bottom for the full strategy)*\n\nFirst, the proof:\n\n1. 100K+ followers in less than 1 year (brand/ theme page + monetized) - handle: bekind\\_global\n2. around 3K followers in 1.5 months (personal brand + monetized; this was for proof of concept) handle: mikhailnadeson\n3. Charged someone $1 to help them grow; results: 10K+ in 3 months\n4. 0-900 followers on a new luxury real estate account + leads in 2 months (this was hard AF because it was pretty much stock footage)\n\nNow, the promise:\n\nThis strategy is simple, follow it blindly if you aren't getting results. You're going to get better as you work through it and get an \"eye\" for content.\n\nThe Strategy (5 Steps):\n\n**Step 1: Ideation &amp; Ideal Target Avatar (ITA)**\n\nBefore you even get started with creating content you need to understand why you’re creating in the first place and that’s where the idea comes in:\n\nYou need to ask yourself 3 questions:\n\n* Who do I want to attract?\n* What value can I offer them?\n* Why should they listen to me?\n\nThis will be the core of your entire profile so it’ll look something like this outlining all 3 of these questions\n\nThen based off the idea you will create your Ideal Target Avatar: this is ONE specific person that your content is directed at. For example: if you’re a fitness coach for overweight men\n\nYou need to get really specific about this one person, meaning:\n\n* How old are they?\n* Do they work in a 9-5 or are they business owners?\n* Are they married and do they have children?\n\nYou need to understand them so well that you know what their entire day-to-day life looks like. So that you can dig deep into both their pain points and desires and have your content resonate with them.\n\nAnd if it’s a personal brand it’s a lot easier because your Ideal Target Avatar is just you but 2-3 years ago.\n\n**Step 2: Research (MOST IMPORTANT)**\n\nOnce you understand your Ideal Target Avatar you’re going to start looking for accounts in your niche that are already doing well. And make a list of 5-10 of these creators.\n\nThen you’re going to take their best performing videos, ideally anything over 1M views. This should give you at least 15 viral video ideas.\n\n**Step 3: Transcribe &amp; Analyze**\n\nHere you’re going to download all the videos you’ve found in the research stage with a tool called SnapInsta, then extract the entire script with Turboscribe.\n\nNow you’ll have the entire script that you can break down into the:\n\n1.       Hook\n\n2.       Body\n\n3.       &amp; CTA (call-to-action)\n\n**Step 4: Steal and create**\n\nObviously not the whole thing! You’ll combine the video script with similar visuals from the original videos but remember to change it up with your unique twist and look for areas of improvement.\n\nImagine you're in school and someone gives you the homework they got an A+ on and you get to copy it and get similar results (you'll be dumb not to use it right?; same with content)\n\n**Step 5: The Feedback Loop**\n\nShort form content is the ONLY place you get to put something out and see whether it works or not.\n\nPost. Analyze results. Go back to research. Repeat\n\nI promise you'll get results.\n\nFor beginners this will take longer, focus on consistency and the process.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 300,
    "downs": 0,
    "created_utc": 1727368890.0,
    "media": null,
    "is_video": false,
    "num_comments": 116,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.240159426466924
  },
  {
    "score": 297,
    "title": "Is this the end of insta? ",
    "selftext": "Everyone seems so exhausted from producing content for Instagram and not being able to reach intended audiences. Myself included! Also I am getting nothing of interest and substance back in my feed. I don’t see anything from people I know, everyone is selling something to me and the viral content is rubbish. Overall the experience feels quite pointless - are they wrapping things up to end and switch to threads or what? ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 297,
    "downs": 0,
    "created_utc": 1725332421.0,
    "media": null,
    "is_video": false,
    "num_comments": 170,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.265714319272332
  },
  {
    "score": 288,
    "title": "Turkey just banned Instagram. Suggest me ways not to lose my job.",
    "selftext": "I'm a social media manager based in Turkey and I'm responsible of the Facebook and Instagram accounts of the company I'm working at.\n\nIt's not that much of a big company yet, so we don't have other channels like X or LinkedIn. Most of our audience is on Instagram (we're running a hypermarket/cash&amp;carry kind of store).\n\nThings go by, wars happen, global warming increases and suddenly, one day, you wake up to see your government just banned Instagram with 58 million active users from your country (more than half of our population).\n\nSo, thinking that 90% of my job was on Instagram, what do I do now? I'm thinking of creating a WhatsApp channel but it gets stuck and crashes whenever I try to create one. You guys have any other suggestions?",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 288,
    "downs": 0,
    "created_utc": 1722589082.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.142640352195873
  },
  {
    "score": 294,
    "title": "How I got 22m views and 1m likes a breakdown ",
    "selftext": "Many people say hitting 1m views on a reel is all about luck, but I beg to differ.\n\nSince the launch of reels, I've been experimenting with different formats, audios, aspect ratios, fonts, shadows, and borders to uncover the secret behind hitting that 1m mark. After experimenting and posting almost 3k reels, I've identified common findings among those hitting the 1m views mark. This is a detailed topic, and I'll explain each element in detail.\n\n1. Keep it short: The attention span of a person scrolling through reels is very short. Initially, I received an average watch time of almost 12-14 seconds on my reels, but that was 2.5 years ago. As time went on, the average attention span of the audience decreased. I realized that people were not interested in my long reels (20-22 seconds), so I adjusted. Now, the average attention span of the audience is less than 4 seconds. My new formula was to keep them short—really short. I reduced my reel length from 20 seconds to 9-10 seconds, and soon after, like a week later, I was back on track. It took a lot of experimenting with different video lengths to determine what topics needed a longer reel and what topics needed a shorter one.\n\nDuring the experimenting phase, I realized that the first 4 seconds of the reel are crucial. If you want 70-90% audience retention on your reels, you must add a hook (what is a hook? That's a different rabbit hole altogether) or a context builder. But if your reel has a bland ending, try to make it short. Make sure you build your context within the first 4 seconds and keep the rest of the reel engaging.\n\nHow do you keep the rest of your reel engaging? Insert editing. You can edit your videos and elements, add catchy music, B-rolls, and other elements to keep them engaging. The goal is to keep the audience hooked to your reel.\n\nInsert a prop. People love to watch others doing weird things, like holding a whipped cream can in your hand while continuing your reel. The audience gets curious about why you're holding a random object in the video, so they watch the reel to find the context.\n\nGive them a reward for watching till the end. Adding a supertext like \"Wait for the end\" or something related to the ending at the beginning of the reel also helps a lot. This makes the audience hooked to your video.\n\nRegarding how I hit that 22m views mark, I incorporated the above strategies for that particular reel:\n1. The reel was short (12 seconds).\n2. It had a 3-second catchy hook.\n3. A reward at the end.\n4. And it held 70% audience retention for the first 10 seconds.\n\nThere are multiple strategies, but listing them all would be confusing. I think I'll just break down my reels with my strategies in my next posts.\nThis post was all about keeping it short in the next post I'll cover another topic related to the same. ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 294,
    "downs": 0,
    "created_utc": 1714253944.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.096992290704954
  },
  {
    "score": 290,
    "title": "Went from 0-10K+ in under 90 days 4 times (exact process with one key element)",
    "selftext": "I've now grown multiple IG accounts to over 10K relatively quickly, across different niches, and I'm going to break down the exact process that works every single time, and it'll work for you too\n\nFirst: My Track Record:\n\n\\- Our brand account: 0 to 10K in less than a month, now 100K+ (mental health niche)\n\n\\- Creator founder, personal brand: 0 to 10K in 90 days (relationship content)  \n\n\\- Doctor and longevity coach (personal brand): 0 to 10K+, went from 60-100 views to 1-8K average views, only 1 hour a week \n\n\\- Theme page creato (brand): 0 to 12K in 85 days (started with literally 0 followers)\n\nMost people think growth is niche-specific. It's not. Human psychology and research will get you to where you want to be\n\nHere's the step-by-step breakdown...\n\n\n\n**The 90-Day Framework (6 Steps)**\n\nStep 1 and 6 is absolutely crucial and ties everything together - without it you'll be putting in effort and seeing little to no results \n\n\n\n**Step 1: Define Your North Star Mission (Most Important)**\n\nThis is what separates growing accounts from stagnant ones\n\nPeople don't follow accounts - they follow things/ people they believe in or want to be part of (we as humans are social creatures and seek belonging)\n\nEach piece of content should be in line with your mission - you can have multiple topics/ interests and this will tie it all together\n\nHere’s some examples based on the accounts we’ve grown:\n\nThe healthcare system is broken\n\nA promise to yourself\n\nTech for good\n\nHow to find yours:\n\n\\- List every major problem you've solved in your life\n\n\\- Pick the one you're most passionate about helping others with\n\n\\- Get specific about WHO needs this transformation\n\nThis becomes your content filter - everything serves this mission\n\n\n\n**Step 2: Idea &amp; Ideal Audience**\n\nWhy are you making content and who are you making it for\n\nIf it's a personal brand: You want to list down all the problems you've experienced in life and solved for yourself - this is what gives you value, eg. fat to jacked; homeless to 6-figure sales director; breakup to happily married etc..\n\nHere's what I did: Made a list of all the years from 18 to now 29 and listed the problems I solved for myself each year\n\nThey should fall into 1 of 4 categories (if it's a personal brand it can be all 4):\n\n• Health\n\n• Wealth  \n\n• Relationships\n\n• Happiness\n\n\n\n**Step 3: Research**\n\nWhere most of your time should be spent\n\nI find 10 creators in the niche:\n\n• 5 big accounts (50K+)\n\n• 5 smaller accounts (10K or less) that grew fast\n\nThen I use the \"sort feed\" Chrome extension to download CSVs of their best content. This gives me a database of proven viral formats, hooks and visual hooks\n\nTheir mission doesn’t have to align with yours - you just need hooks and ideas that you can take from them\n\n\n\n**Step 4: Content Strategy**  \n\n\\- Pick a format: b-roll, talking head, voice over (2 that are doing really well right now are the split screen and green screen formats)\n\n\\- Create reels with strong visual hooks in the first 1-2 seconds\n\n\\- Use clear text on screen to immediately communicate value (acts as a double hook if it's talking head - text hook and audio hook) - this lets the viewer know what value they will get\n\n\\- Focus on retention - structured videos to keep people watching until the end\n\nhere's a quick example:\n\nI take the proven formats from Step 3 and adapt them with my unique angle. Same structure, different personality.\n\n\n\nThe formula\n\n1. Hook: Information gap that creates curiosity (\"5 habits that cause brain fog according to neuroscience\"\n\n2. Body: Deliver exactly what the hook promise\n\n3. CTA: Clear next step that serves the audience (can be put in the caption too if it feels unnatural)\n\n\n\n**Step 5: Profile Optimization**\n\nSimple clear bio explaining exactly why someone should follow (add credibility if you have)\n\nhere's an example:\n\n“Line 1: Science-based relationship advice\n\nLine 2: Download the AI relationship app\"\n\n\n\n**Step 5: The Feedback Loop**\n\nShort-form content is the only place you get instant feedback (24-48 hours max).\n\nPost -&gt; Analyze -&gt; Adjust -&gt; Repeat\n\nTrack: \n\n1. which hooks get the highest engagement (check insights if you have the retention graphs - if the first 3seconds have massive drop off, get better hooks)\n\n2. What content formats perform best\n\n3. Which CTAs drive the most comments/ actions\n\nAfter each week there should be a couple that outperform the rest - double down on these\n\n\n\nThe biggest problem you'll face is finding clarity and having a proven framework - by following this you should be good\n\nP.s. hashtags really don't matter, you can use seo key words (one sentence should suffice but the algorithm really is smart enough to pick up what your content is about either way)\n\n\n\nGood luck :) also feel free to ask any questions\n\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 290,
    "downs": 0,
    "created_utc": 1755987376.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.158642214607691
  },
  {
    "score": 289,
    "title": "The New Instagram Growth Hack: Trial Reels is Lowkey OP",
    "selftext": "So Instagram launched *Trial Reels* to help creators test new content… but of course, people turned it into a **follower farming** strategy instead.\n\nLike, take this girl **chelsea\\_explains**—she hit **450K followers in two months** using this trick. She even said people keep DMing her like, “I tried this and finally started growing again after months of being stuck.”\n\nBasically, you can re-upload old viral videos as *Trial Reels*, and Instagram pushes them to **non-followers**. If they do well, you can keep them on your page or delete them. And guess what? The algorithm LOVES it.\n\nIs Instagram mad about this? Nope. Adam Mosseri literally confirmed that **watch time, likes, and shares** are key ranking factors. So even if this wasn’t the *intended* use… it’s working as a **growth hack**.\n\nHave you tried it yet? Does it actually work?\n\n  \nps: viral or hit videos previously created by you",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 289,
    "downs": 0,
    "created_utc": 1738265762.0,
    "media": null,
    "is_video": false,
    "num_comments": 235,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.368853999384009
  },
  {
    "score": 282,
    "title": "I believe I figured it out",
    "selftext": "No course. No fluff. Just what worked.\n\nI run a news page that shares content similar to Pubity, IGN, etc. I won’t drop my @ here, but I’m in the high-end collectible niche—pretty easy to figure out once you look around. Currently sitting at 93k followers and pulling 25M+ views a month, and still pushing to grow.\n\nNot long ago, my engagement tanked. Views dropped. Reach fell off. It felt like the page was dying—probably how a lot of you are feeling now.\n\nSo I did what most wouldn’t: I ran an audit. I took my top-performing posts and ran them through ChatGPT to reverse-engineer what made them work. \n\nEDIT: I also gave it worst posts to reverse engineer why they flopped. That contrast made the winning patterns clearer.\n\nHere are the three biggest takeaways:\n\t\n1.\tYour posts must evoke emotion. Doesn’t matter if it’s nostalgia, anger, awe, or hype—if it makes people feel, it makes people share.\n\t\n2.\tVisuals matter. A lot. Think bold, clean, scroll-stopping—like something you’d see on @Pubity. If it looks generic, it dies. \n\t\n3.\tIt has to be shareable. Ask yourself: Would this be sent in a group chat? If not, it’s not good enough.\n\nThat’s it. No gimmicks.\n\nHope this helps someone. If you’ve got questions, drop them below",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 282,
    "downs": 0,
    "created_utc": 1747385553.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.091402295389778
  },
  {
    "score": 273,
    "title": "Instagram announced Major Algorithm Changes here's everything about it ",
    "selftext": "Hey guys, this is a major change, so I'm going to explain it to you.\n\nBasically, I just saw the latest post on the Instagram creators' handle, and I noticed they've made a significant change to the algorithm and ranking system itself.\n\nMy first post on the Instagram algorithm and how it works, and how they rank content, was pretty much spot on. I was accurate at around 99%. However, since the beginning of April, I've noticed a 50% decrease in engagement within the initial 10 minutes of posting. I was wondering what went wrong. What was I doing wrong?\n\nAfter trying out multiple content formats and experimenting a lot, I realized the content that was working for me wasn't the type my audience typically prefers, but rather the kind that generally appeals to the masses. I was confused because that wasn't the type of audience I had built. My audience was very niche, and I just didn't understand what was happening.\n\nSo, I started posting content that the masses would love, but my audience got fed up and started to unfollow. I was stuck in a weird spot, not knowing what to do. That's when they dropped the bomb yesterday – they've made a major change to the algorithm and ranking.\n\nPreviously, the algorithm used ranking metrics. When you posted content, it was shown to the first 10% of your audience, and based on their reaction, it was shown to the next 10%, and so on, eventually going viral or getting stopped.\n\nRight now, they're trying to prioritize showing content in the first 10-20 minutes (the exact number is unclear and requires experimentation). During this time, most of the audience shown the content will be non-followers. This is done because accounts with fewer followers now have a fairer chance of competing with accounts that have a larger following.\n\nPreviously, the algorithm pushed content based on metrics. Now, the content seems to be more generalized, pushing content based on a broader appeal. This is a major change.\n\nI think most of you have also felt this since April. Your reach has either plummeted by 50% or grown by 2-3 times what you're used to. This is because content has become more generalized, and that's a weird spot to be in. Accounts that have worked for years to grow a significant following will suffer because their posts aren't initially shown to their followers. We have to craft posts considering what other people will love rather than our actual audience, the core base of our page.\n\nThis update is kind of 50-50 % in my opinion. I've spent years building my audience and getting that right, but I don't know how to create content for a completely unknown audience, which is what we're expected to do now, which is kind of thrilling and scary lol. \n\nThe previous system used calculated metrics, going through multiple data points like the initial audience reaction, and based on that reaction, the post was further distributed to a narrower audience who would love that specific type of content.\n\nRight now, the initial metrics that determine a post's ranking are based on how it performs for an audience we don't know. It's unclear how this will work out, but I guess the next few months will be a lot of experimentation for all of us. We have to appeal to these unknown people just to get our numbers back up.\n\nI was really worried because I thought my page was shadowbanned or something. It took me 20 days to figure out the content that was actually working on my very niche page, content that typically wouldn't work with the masses. I had a very selective audience that loved selective content, and this is very frustrating for me.\n\nBut yeah, guys, this is the update I wanted to give you on the algorithm change. I think you should all be aware of this and start focusing on broader appeal rather than just your followers, which is the complete opposite of what it used to be. But I guess it's the game of numbers and attention now, so I think the content that will work from now on will be very strong and capture the user's attention in the first four seconds. I plan on doing a lot of experiments and will update you guys on those as well. But for now, this was the major change I wanted to inform you all about. Thanks!",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 273,
    "downs": 0,
    "created_utc": 1714586353.0,
    "media": null,
    "is_video": false,
    "num_comments": 124,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.191205569324416
  },
  {
    "score": 272,
    "title": "Went from 0 to 400k in 1 year",
    "selftext": "Built an IG page to 400K+ followers in 12 months and scaled multiple others past 100K. Decided to be useful to society today.\n\nIf you have a business or just an idea, but don't know how to grow on Instagram or market it properly, drop it below.\n\nTell me what your idea is, who you want to serve, and l'll give you an help to hit your first 100K followers.\nIf that's you, let's make today the day you finally move forward.\nLet's gooo!",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 272,
    "downs": 0,
    "created_utc": 1753442601.0,
    "media": null,
    "is_video": false,
    "num_comments": 298,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.401498241202971
  },
  {
    "score": 266,
    "title": "I analyzed 1000+ viral hooks and found some patterns not enough people talk about",
    "selftext": "Built and trained an AI tool that creates viral hooks for any topic and went down a rabbit hole on what makes content perform. Here are some patterns I found that don’t get enough attention imo.\n\n(P.S. My background is in neuroscience + neurotech, and seeing those principles show up in content has been wild. Happy to dive deeper if you’re curious!)\n\n**Contradictions &amp; Contrast**\n\nHooks with contradictions just get the work done.\n\n\"I'm drunk, but Imma do my best to tell this story\"  \n\"Terrified? Absolutely. Ready? Not really. Worth it? 100%.\"\n\nYour brain can’t scroll past unresolved tension. Found this in \\~30% of top performers (and tbh these always get me too - I find myself watching the entire thing every damn time).\n\n**Specificity Is a Power Move**\n\nThe more weirdly specific you get, the more people relate. Speak to one person instead of an audience, and you'll see the magic happen.\n\nGeneric: \"If you ever get bloated after a meal...\"  \nSpecific: \"If you've ever secretly unbuttoned your jeans at dinner and hoped no one noticed - this is for you\"\n\nHyper-specificity creates instant credibility (people’s brains go, “This person actually lived this”. Works across every platform.)\n\n**There's Something About Timeframes**\n\nUnexpected timeframes are chef’s kiss:\n\n\"3 years of back progress in 30 seconds\"  \n\"Three months ago I had 0 followers, today I’m at 211K\"\n\nShort, punchy timeframes have major viral potential. The dopamine hit is insane; you kick off an elite curiosity loop and give the viewer hope that whatever this is, it’s possible. Found this in almost every major growth story hook.\n\n**POVs = Advice in Disguise**\n\nThe most engaging POV hooks aren’t actually real POVs, but rather advice disguised as scenarios:\n\n\"POV: you figured out how to not pay a fortune for drinks at festivals\"  \n\"POV: You don't feel like cooking, but still want a home-cooked meal\"\n\nThis is kind of genius, cause people’s defenses are down when they think they’re just relating to a scenario, not receiving instruction.\n\n\\-------------------\n\nOverall, there’s a shift away from “guru” hooks toward ones that don’t feel like hooks at all. Everything I’ve collected in 2025 points to the same trend: The best hooks read like genuine human moments someone just happened to articulate perfectly.\n\n\\* All examples are real viral hooks I’ve collected and used for AI training\n\nI have plenty more, let me know your thoughts (and if part 2 would be of interest) :)\n\n\\- Shani from Captain Hook AI",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 266,
    "downs": 0,
    "created_utc": 1756139755.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9716926061116977
  },
  {
    "score": 267,
    "title": "I monetized my IG account with digital products (made over $20K) - Here's what I learned",
    "selftext": "I started a year ago, in Jan 2024.\n\nMy goal: create an extra income stream \n\nThe plan: Grow an IG account and monetize it with digital products \n\nI had no experience doing this before, though I had IG and had grown IG accounts for prior businesses in the past.\n\nNever nothing like this.\n\nI actually don't particularly like to use IG but for business, I decided to suck it up and work there.\n\nWhat I did:\n\nI posted consistently, enagged with followers and commenters and other accounts, had tons of DM conversations and posted stories and highlights, for one year.\n\nWhat I learned...\n\nIG is still a place I don't particularly want to be but for business and for the money, you'll definitely catch me there.\n\nThe more you use it, the easier it is to...\n\n✔️Figure out what to post about\n✔️Create captivating video descriptions \n✔️Come up with story ideas quickly\n✔️Adapt and create your own DM script \n\nThese things were a struggle early on but now come easy.\n\nIf you're on a platform long enough, stuff happens.\n\nI did end up monetizing my IG and made multiple 5 figures in 2024 bc of it.\n\nAlso grew my IG from zero to 8300 followers.\n\nFollowers don't matter like you think, for digital products at least. I was making a FT income with less than 500 followers. \n\nThis year:\n\nThe goal is to hit 15k followers and I'm already exploring monetizing in other ways like sponsored content which I've already seen some moderate success with.\n\nDoes anybody else monetize IG with digital products?\n\nShare your experience? Tips?",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 267,
    "downs": 0,
    "created_utc": 1737391085.0,
    "media": null,
    "is_video": false,
    "num_comments": 240,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.331643315316223
  },
  {
    "score": 265,
    "title": "100K followers in 3.5 months?",
    "selftext": "I’ve just created a new Instagram account as part of an experiment. I’m starting completely from scratch with 0 followers, no shoutouts from my other pages, and I won’t even follow it from my existing accounts\n\nWhy am I doing this?\nRecently, I’ve been getting a lot of questions about growing Instagram accounts. Most people claim Instagram only cares about money, so they believe you need to run ads to grow. I want to prove that it's possible to grow without spending a dime. Instead of positioning myself as a creator, I’ll focus on running a theme page, which is often seen as the easiest way to generate content (no shade, just facts, lol)\n\nBut doesn’t each niche require a different strategy?\nAbsolutely! Every niche needs its own strategy and content style. However, I’m curious to see how far I can take an account from zero. Since it’s a theme page, I’ll be posting frequently, around 2-5 posts a day\n\nI’ll be sharing the results, including insights and details about the niche, on October 12th. Stay tuned!\n\nP.S. – As a social media strategist with 8 years of experience, I wanted to put my expertise to the test with this experiment. The goal? To hit 100K followers by December by posting mostly reels and the whole process will be Organic \n\nLet’s see how far strategy and consistency can take me!",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 265,
    "downs": 0,
    "created_utc": 1726215301.0,
    "media": null,
    "is_video": false,
    "num_comments": 364,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.418528068859304
  },
  {
    "score": 265,
    "title": "I analyzed 200+ growing accounts. Here’s what they do differently.",
    "selftext": "I’ve been analyzing accounts that actually blow up vs. everyone else, and the difference is massive.\nThe problem isn’t the algorithm. It’s that 90% of creators are following outdated advice.\nThe “Post Consistently” Trap\nMost advice sounds like: “Just post every day and use trending hashtags”\nIf consistency alone worked, every daily poster would have millions of followers. But most accounts posting daily are stuck at the same follower count they had 6 months ago.\nThe “Copy Everything” Problem\nOn the flip side, I see creators who:\n• Repost every trending format they see\n• Use the exact same captions as viral posts\n• Jump on every single trend 2 weeks too late\nThen they wonder why their content feels generic and gets no engagement. Copying without understanding why something worked just creates noise.\nHere’s what actually drives growth:\nThink of your content like starting conversations, not broadcasting messages. You need to give people a reason to stop scrolling and actually engage.\nThe accounts that blow up do this:\n• Specific value hooks - Instead of “Marketing tips,” they say “3 caption formulas that got me 50K followers in 90 days”\n• Relatable pain points - They call out the exact frustrations their audience faces daily\n• Clear next steps - Every post tells people exactly what to do with the information\nThe engagement rate difference is insane.\nFor Stories specifically:\nInstead of random behind-the-scenes content, successful creators use:\n• Polls that actually matter to their audience\n• Questions that start real conversations\n• Quick tutorials that solve immediate problems\nThat’s it.\nThe results are obvious\nCreators using this targeted approach are getting 10x the engagement with half the followers. Meanwhile, everyone else is still posting inspirational quotes hoping something sticks.\nMost people are either overthinking content or underthinking strategy.\nThe accounts that win focus on one thing: giving their audience exactly what they need.​​​​​​​​​​​​​​​​\n\nBefore you got your pitch fork these are just my finding, please share what you agree and disagree with. And at the end of the day this is my opinion; most advice and tips I see feel like the blind leading the blind including my post. ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 265,
    "downs": 0,
    "created_utc": 1754445926.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.993002255318861
  },
  {
    "score": 266,
    "title": "i posted 2 reels everyday for a week, here are the results",
    "selftext": "i posted 2 reels everyday for a week so here's my progress if it's any help\n\ni always hear stories of people going viral by following certain formulas and techniques and they bring up your expectations of views and likes to an unrealistic standard... so this post is just a reminder that slow growth is still growth.\n\ni started this account from scratch, 0 followers, didn't make any friends/family follow it either, it's reach is purely from the consistent reels i posted\n\nfor context, my niche is fashion-related, i post outfit inspiration, styling tips, moodboards and such.\n\n**here are the stats:**\n\n* 4.4k accounts reached in the past month\n* 310 accounts engaged\n* 720 profile activity\n* highest view count is 4,332\n* highest like count is 172\n\ni'm aware this isn't a lot but for a faceless account that was made in a week, i'm pretty satisfied\n\nhere are things i've found worked/didn't work for me:\n\n**1. trending audios don't work**\n\ntrending audios will not necessarily give you reach, i tried a range of trending audios from over 10k uses to under 1k uses and found that neither gave me as much views as the ones with regular audios\n\n**2. hashtags don't work**\n\nhashtags make your content lost among thousands of other reels, especially since instagram only showcases the top posts in hashtags now, i found that the reels with fewer, more local hashtags performed well, and the ones where i spammed hashtags had poor growth\n\n**3. building a community is important**\n\ni didn't realise how important it was to not only build a following, but a community. follow back your followers, like their content, start conversations, make group chats where you can support each other. i found 2 really supportive groupchats where people offered to repost each other's content on their stories, and this increased views a lot\n\n**4. quantity over quality**\n\ni always see people talking about how important quality &gt; quantity is but i disagree. instagram is a quantity game, if you post consistently everyday they will have more trust with you and provide you more viewership. i see a lot of creators post nothing for days because they only want to show the quality stuff and i've seen them lose followers in the process. and i've personally found that the reels i spend hours editing and working on will get 100 views whereas the ones i've rushed will get thousands. you're better off taking a chance on a reel even if you think it's not a quality one, because the algorithm is unpredictable.\n\n**5. cliché, but don't give up just because you're not getting the results you want**\n\nthey're right when they say consistency is key. i started off getting 100-150 views and for a moment i thought about giving up, i had seen so many content creators going viral in the beginning so i thought it wasn't worth it to keep continuing and wasting my time and energy... nevertheless the views increased through out the week, it just requires time and a LOT of patience\n\nfinal thoughts: consistency really works, take risks in your content, engage with your followers\n\ni'm going to continue posting 2 reels daily for the rest of the month, if this was helpful i'll do another update\n\ni'm open to any tips/feedback",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 266,
    "downs": 0,
    "created_utc": 1713459259.0,
    "media": null,
    "is_video": false,
    "num_comments": 141,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.230155433556104
  },
  {
    "score": 248,
    "title": "I put $200 into ads and went from 0 to ~2000 followers",
    "selftext": "I’m starting a clothing brand. My IG handle is @base.orbit\n\nI posted my initial grid of content and then spent about $10-$20 a day on ads for the past couple weeks. and also made a handful of new posts times during that time.\n\nI tested out a few different posts to promote, as well as a few different interest targets. \n\nMy profile visits were coming out to 5 cents per visit on the good ones and 10 cents per visit on the bad ones.\n\nabout 10-20% of the people who saw my ads would visit my profile. \n\nThis is my first time running ads on any social media platform. We’re my results poor? or better than normal. What can I do to improve them?\n\nI know if I put time into a nice video the ad will probably perform better. As of now I’ve just been promoting images. \n\nAlso, should I pause my ads during the night? I was only targeting the USA so naturally during the night they didn’t perform as well as the day.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 248,
    "downs": 0,
    "created_utc": 1706627803.0,
    "media": null,
    "is_video": false,
    "num_comments": 115,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1559283417091955
  },
  {
    "score": 246,
    "title": "How To Get Instagram Followers?",
    "selftext": "Hey everyone,\n  \nSo I’ve been trying to grow my Instagram for months now but it feels almost impossible. I post reels, stories, use hashtags, and engage with others but my followers barely move.\n  \nI see people go from 200 to 10K followers out of nowhere and I honestly don’t get how they’re doing it. Are people still using growth strategies that actually work? Or is everyone just buying followers now?\n  \nI’m not trying to fake engagement, I just want my page to look a bit more active so real people actually want to follow me as it feels like no one wants to follow small pages anymore.\n  \nIf anyone has legit ways to get Instagram followers that actually stay (or even recommendations for safe growth sites that worked for you), I’d love to hear it. What’s actually working for you guys so far?",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 246,
    "downs": 0,
    "created_utc": 1761307135.0,
    "media": null,
    "is_video": false,
    "num_comments": 233,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.3048048819647375
  },
  {
    "score": 249,
    "title": "Instagram is a scam",
    "selftext": "Many have complained that Instagram is dying, and there is a brilliant article on Wired discussing the \"Enshittification\" of TikTok, which also covers other platforms, including Instagram.\n\nI wanted to contribute to this debate with my own test—nothing unique, but sharing some data points might be useful.\n\n**Context:** I am a photographer, not the worst, but I won't pretend to be the best either. Let's say I have won a few awards, some of which had judges like Steve McCurry. I'm not as great as he is, but he recognized my images. I don't do ads, promotions, or follow-unfollow tactics. I have an old account where I stopped posting some time ago, with around 5,000 followers.\n\nI wanted to see what would happen if I started a new account and began posting there without connecting my two accounts on Instagram. Here are the key data points:\n\n- 4 months of posting\n- Did not invite friends\n- Engaged with my usual networks\n- Liked and commented as I felt appropriate\n- Posted 3 times a week, mostly galleries, sometimes single images\n- Posted on roughly the same 3 days at around the same time in the afternoon when people are active\n\nI would say this is what I would call \"good behavior\" and what should be normal, humanly speaking.\n\nWhat I noticed is that there are plenty of follow/unfollow types who started following me—people who follow thousands, sometimes just below the number of people who follow them. Many people like 10 images and follow you, expecting you to follow back.\n\nWhat I did was what would be normal: I looked at their profiles to see if their work inspired me. If it did, I checked how many people they followed. I don't care how many follow them; I just care if they follow fewer than 500 people. If I liked what I saw and they followed fewer than 500, I followed back. Otherwise, no—I consider that fake behavior.\n\n**The results after 4 months:**\n- 55 followers\n- Posts that are a week old have around 12-18 likes, sometimes more.\n\nReally underwhelming. The worst part is, it's actually spiraling downward.\n\nI know I should do more \"outreach,\" and I know I can boost posts, but frankly, why should I?\n\nThere is a minimum threshold where a platform is still valuable, and this just isn't it.\n\nI rarely get a print sale from Instagram, if at all. My networks are my networks; they don't rely on Instagram.\n\nHere's what I think is happening, based on the aforementioned articles and my own experience:\n\nInstagram pretends there is engagement, but it's fake engagement. The actual engagement is just people who do follow-unfollow and respond to your engagement with them. There is no merit whatsoever; it's all self-fulfilling.\n\nSure, my niche—photography—isn't exactly a product someone can buy like beauty products. Nor am I a good-looking person showing off a six-pack or an indulgent yoga pose. Nor am I a famous football player. These people may still see value.\n\nBut for the common user like me, there is no more direct value. The only value I get from my main account is simply to join networking events and use it like a business card.\n\nThat's my conclusion: Instagram is a glorified business card. Frankly, you may as well post some images, buy some followers and likes, and call it a day. /irony",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 249,
    "downs": 0,
    "created_utc": 1752829779.0,
    "media": null,
    "is_video": false,
    "num_comments": 131,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.170726974274963
  },
  {
    "score": 232,
    "title": "Grew an IG to almost 8K (making 4 figs)",
    "selftext": "I started from zero like everyone. In Janaury I started a new IG. Growth was slow in the beginning.\n\nOver time I started learning little tips and tricks to get the best results for my Instagram account growing the followers, improving engagement, getting leads and making sales which ultimately helped me create a new income stream earning an average of around $5k a month.\n\nNow I have just under 8K followers and I can appreciate the journey I went on.\n\nI became pretty obsessed with growing my Instagram account and so I heavily research ways to come up with viral post ideas, get the most engagement, drive leads to my email list and I bought a number of guides and courses to help me get here.\n\nI once heard in a podcast that if you have 10K followers you can make 10K a month and I can see that'd a real possibility for me in the future.\n\nI monetize by selling digital products and services.\n\nWhat are some other ways you think I can capitalize off this small IG acct?",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 232,
    "downs": 0,
    "created_utc": 1726341999.0,
    "media": null,
    "is_video": false,
    "num_comments": 255,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.231475903681944
  },
  {
    "score": 237,
    "title": "How To Recover A Hacked Instagram Account [ALL METHODS]",
    "selftext": "I wanted to share with you how to recover a hacked Instagram account, from someone with 7+ years of experience in social media marketing. No fluff.\n\nMethod 1)\n\nhttps://instagram.com/hacked\n\nThe first thing I recommend you do is go to the website above. \n\nSelect “my account was hacked”\n\nThen, put in your username / email / phone number. Also do anything else they request like a ‘selfie’ or photo of you with ID.\n\nOften times, Meta will get back to you very soon and assist you with recovering your account. If you don’t hear a response though, I recommend refilling this out once a week. Wait times public support forms can often be slow as you are one person on a very long list. It can take up to 30 days.\n\nMethod 2) \n\nBusiness/Meta Verified Support. Run ads or pay $15 for Meta Verified to get access to paid support. Open chat with representative. Ask them to assist you in recovering your profile which was hacked. Be very specific with your case and include any screenshots like the exact time the email was changed on the Instagram profile, if you still have access to your email. Your username, previous email/phone number on file, recent login locations, and include your ID or business documents if the page was not a personal. Reiterate that the Instagram.com/hacked form above did not work and see if they can escalate the hacked case to an internal team.\n\nThis method works best when you reach out from a profile that was added to the Accounts Center of the hacked account. If your profile which you’re reaching out from was never connected in the accounts center, many reps will not assist you in recovering your hacked account. I still recommend you try, however, because while rare, sometimes you can get a hold of a manager or somebody who is willing to help, but it is very rare that they assist you if you do not have a profile that was previously connected in the accounts center.\n\nStep by step instructions on how to open a chat with a Meta verified support. \n\n- https://facebook.com/help/178774494481770\n- https://help.instagram.com/261957349507759 \n\nMake sure to use a profile that was connected in the accounts center.\n\nOn the contrary, if you’re a business, you can still use the method above to badge your personal and contact support given profiles are connected in Accounts Center. If you’ve ever paid for ads, you can also reach out to a rep via Facebook Business Support or Commerce Manager Support if you have a catalog / shop to see if they can assist you in recovering your page after hacked.\n\nFollow up every 72 hrs Monday-Friday. Be polite and remember that you’re talking to real human being on the other side of the computer, who’s likely on an 8hr shift talking to people like yourself. If they offer a phone call, take the call. It has a higher success rate.\n\nYou can also request refund for the subscription via Apple or the Google play store to get your money back if the method doesn’t work for you.\n\n- https://support.apple.com/en-us/HT204084\n- https://support.google.com/googleplay/workflow/9813244?hl=en\n\nTIP: To protect your profiles from a future hack make sure you add your Instagram profile and your Facebook profile to the same accounts center so they’re connected. This way, if anything happens, you can use meta-verified support to reach out to a representative and they can assist you because you’ve proven ownership of the profile.\n\nMethod 3) \n\nUsing NON-PUBLIC support channels. While this won’t be possible for every person, there are non-public premium support channels, which are given to certain partners.\n\n- FORMS - There are some forms that exist which are not publicly advertised to fix issues like hacked accounts or perform unbans or verifications. While I don’t know any forms except public ones, I put FORMs under non-public because I’ve heard of some forms that exist for specific niches or are forms to other departments with faster processing times in Meta. Forms can be public or non-public which is why I mentioned them here in non-public support.\n\n- PORTALS - The most notorious portal is the Media Partner Portal or the Media Partner Panel, but there are many portals like the Musician portals, Government/GPA, Entertainment portals, Facebook Marketing Partner portals, ect. Each portal has requirements, and you can’t submit any account just because you have a portal, which is why these support portals are not viable for most normal accounts and regular people.\n\n- EMPLOYEE CONTACT - Notable brands, agencies, influencers, or advertisers are sometimes assigned an employee for direct contact to assist with any issues they or the brands they represent may have. You should not message any employee of Meta in hopes of recovering your hacked profile. Employees will not help users recover a hacked profile, unless officially assigned to your brand, business, or profile. Furthermore, Meta is a huge company with numerous departments and 50,000+ employees, most of which cannot even contact the department inside Meta to assist with a hacked recovery, but it is a non-public support that does exist which was why I mentioned it.  \n\nIf you have any questions, please let me know in the comments or inside r/bouc and I’ll help guide you on how to contact Meta’s official support to recover a hacked account on Instagram! \n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 237,
    "downs": 0,
    "created_utc": 1715101896.0,
    "media": null,
    "is_video": false,
    "num_comments": 1166,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6526123850791965
  },
  {
    "score": 230,
    "title": "Stop blaming the algorithm. The problem is you. How I went from 0 to 100k views in 1 month.",
    "selftext": "I made a goal in 2025 to focus on growing my personal Instagram page. I've always been active on Instagram but never took it seriously as an opportunity to grow my followers and possibly making a living out of it.\n\nIn January 2025, I hired several consultants, spent time on this Reddit forum, watched other Instagram influencers and finally made my first post on Jan. 27th, 2025. My personal account had many previous posts but this was my first post related to a specific niche I wanted to focus on (Buying and Selling Business through Seller Financing)\n\nBefore my post, I had practically zero engagement as I mainly shared stories and my last personal post was about 8 months prior.\n\nDuring the past 30 days I have learned so much about what works and also what doesn't work, I thought I would share my knowledge in the hopes that it could help someone (And no, I'm not selling a course)\n\nOne point to note - There is so much conflicting information out there, that you will drown in the conflicting views. Each opinion is right to a degree. Therefore, I don't claim that my advice below is the only way to grow but this is what worked for me.\n\nI am going to summarize this into 10 points:\n\n1. **Hook:** Must be a strong and controversial hook - I would go to ChatGPT, add the topic of my reel and ask for a controversial hook that would make people want to share or save my post. This helped tremendously as it got people to stop scrolling and watch my content.\n\n**2. Engagement:** I picked two accounts as my competitors and I would go through their followers list and engage with them 15 minutes before I post and 15 minutes after I post. This makes people come to my account, see that I am posting similar content and also follow me.\n\n**3. Number of Reels:** I started by posting 1 per day but now have worked towards 2 per day. The rationale is that I am training the algorithm at a faster speed to recognize my niche and that I am actively posting in that niche. Secondly, 2 reels per day means 60 reels per month. 60 opportunities for a reel to go semi-viral. My chances far exceed someone who only posts 2-3x per week.\n\n**4. Script:** Must be controversial or something people will talk about or share with friends. This is important. Don't make content for the sake of. Always ask yourself that the topic you will discuss, why would someone want to save or share the reel. This process helped me tremendously as I had many ideas for reels but couldn't see why someone would share the reel. Therefore, I didn't post the reel. Instead I posted reels that I was confident people would share.\n\nOn average for each of my reels I get anywhere from 10 - 30 people who share my reel.\n\n**5. Captions:** I have played with short captions and longer captions that are SEO optimized. I am leaning towards longer captions based on the feedback I am getting from other creators.\n\n**6. Reel Content:** Speak about a specific topic and to a specific audience. There are millions of people sharing general vague advice so you need to stand out.\n\n**7. Pace of Reel:** I still suck at this but it needs to be faster. Your cuts need to be faster so that people remain engaged. Even if you are recording in your basement, you can record from different angles.\n\n**8. Reel Cover:** I made a mistake in the beginning by not putting text on the reel cover. I believe this was a missed opportunity as it gives you an additional opportunity to hook someone with the text on the reel cover.\n\n**9. Competitors:** Each week I find a video from anyone on Instagram where their account has less than 10k followers but one of their videos got over 1 million views. I try to copy their hook, style, etc to a certain degree to see if I get similar views.\n\nThis led me to have my biggest hit where a reel of mine reached 112,000 views in a span of 2 weeks.\n\n**10. Target Audience:** You need to define your audience and their pain points. And then speak to those pain points in your reels.\n\nOverall in the past 30 days, I have had a reel hit 100k+ views, one reel hit 45k+ views and my account grew about 500 followers. I have had dozens of people DM me and I am in the process of trying to monetize the account by selling a product.\n\nAlso, to be transparent. Currently, I am stuck in a rut where my latest reels are only getting 500 - 2000 views. Therefore, I am still a newbie and learning the ropes.\n\nHowever, I thought I would share what I have learned as I actively follow this reddit forum but I tend to see the same comments on a daily basis of how to grow your account.\n\nIf anyone wants to view my account to get an idea of the types of reels I create, you can find me here (abidmirza89)\n\nIn the end all of the above strategies are meaningless if you don't provide high value content. This should be your ultimate goal. What I have shared are the strategies to gain your initial traffic but the ultimate way to maintain your traffic is to provide high value content. ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 230,
    "downs": 0,
    "created_utc": 1741187075.0,
    "media": null,
    "is_video": false,
    "num_comments": 256,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.071078541557792
  },
  {
    "score": 231,
    "title": "I quit my job to pursue Instagram full time!",
    "selftext": "I’ve made the biggest decision of my life.\nI’m both terrified and excited to start this new chapter. Over the last 6 months, I’ve averaged about $3K/month from Instagram’s bonus program, compared to the $3.5K I made at my 9-5. So…I decided to pull the plug and go all in on my dream.\n\nRight now, my page is at 122K followers and reaches about 50M views per month, mostly from carousels. I recently started dabbling with reels and my first one did great hitting 5M views.\n\nMy goal is to build this into a six-figure business by the end of next year.\n\nIf you’ve made this jump (or are planning to), I’d love your advice:\nWhat helped you make it sustainable?\nHow do you avoid burnout while scaling aggressively?\nAny tips for monetizing beyond brand deals?\n\nAppreciate any advice you can share!\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 231,
    "downs": 0,
    "created_utc": 1754167050.0,
    "media": null,
    "is_video": false,
    "num_comments": 120,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.111880670049125
  },
  {
    "score": 232,
    "title": "Instagram boss Adam Mosseri shares algorithm secrets and reveals hashtags don't work",
    "selftext": "The head of Instagram has lifted the lid on its notoriously secretive algorithm, revealing that one of the most popular user tricks for boosting likes and views doesn't actually work. \n\nAdam Mosseri, 42, who has led the Meta-owned social media app since 2018, shared some secrets to optimizing users' presence on the platform, in an exclusive interview with Daily Mail this week. \n\nSpeaking from New York City, Mosseri admitted that there is no magic spell or 'algorithm hack' when it comes to increasing engagement - at least not in the way most people expect. \n\n'No silver bullets. No silver bullets. You've got to experiment and make sure you're true to yourself, and also figure out what resonates,' he told DailyMail.com. \n\n'What works for this week might not work next year.' \n\nThough the tech executive was hesitant to disclose specific strategies, he did candidly address the effectiveness of Instagram hashtags - which many users have historically relied on to boost likes and reach. \n\nWhen asked if they still work, Mosseri replied emphatically: 'They don't! I'll tell you that. They don't work.' \n\nMosseri maintained that there's no secret formula for attracting more followers and likes, and advised users to 'find the overlap between what you want to get out of the platform and what's gonna resonate on the platform.' ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 232,
    "downs": 0,
    "created_utc": 1738352540.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.035262717166415
  },
  {
    "score": 227,
    "title": "I GOT MY INSTAGRAM ACCOUNT BACK !!!",
    "selftext": "6 days ago my Instagram account with over 50,000 followers that averaged 3-5 million impressions a month was suspended. My brand, my business, &amp; hundreds of hours of work all lost due to a wrongful banning. \n\nBased on the title - you are aware I got it back. I am going to tell you everything I did these past 6 days to get this account back so it can hopefully help someone reading this help get their account back. \n\nI was banned on June 13th for CSE (100% false and completely unacceptable Instagram would accuse anyone innocent of this) here is everything I did.\n\n1. I appealed the suspension on the Instagram. I had to submit a photo of my ID &amp; take a video of my face. I then got sent to an appeal screen that said it was in instagrams hands. \n\n2. I emailed appeals@fb.com and support@instagram.com every day, 5 times a day, without fail. At the end of this post I will attach the exact email I sent so you guys can copy and paste it and fill the info in where you need to about your account. \n\n3. For whatever reason I got my personal account back before my brand. I immediately subscribed to meta plus so I could access the meta support. The chat support is pretty terrible fyi but I constantly asked for my case to be escalated to a manager - they always told me no - and then finally they told me yes - and then I chatted with a manager and they never said “we will fix this for you now” but I was talking to a live person at least. \n\nDISCLOSURE: I have no idea if any of these things worked or if I just got lucky. But if for whatever reason these did work - I want to tell everyone the exact process of what I did so they can at least try the methods I was utilizing. \n\nIt f*cking SUCKS that anyone is going through this so just wanted to try and offer some help. \n\nHere is the email template I sent:\n\nSubject: URGENT: Suspended Account \n\nDear Instagram Support Team,\n\nI’m writing with urgency and concern regarding my Instagram account “ENTER IG NAME”, which was disabled on “ENTER DATE” for allegedly violating instagrams policies.\n\nTo be completely honest, I was shocked by this action. I’ve always made it a priority to follow Instagram’s guidelines and have never knowingly violated any policies. This account represents hours of consistent work building a trusted and highly engaged community around “ENTER CONTENT NICHE”. It’s not only my creative outlet — it’s the core of my business and livelihood.\n\nI truly believe this may have been a misunderstanding or a mistake, and I’m respectfully asking for a thorough re-review of my case. If I’ve unknowingly done something wrong, I would be grateful for the opportunity to understand and correct it.\n\nThank you for your time, and I hope to hear from you soon with a positive resolution.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 227,
    "downs": 0,
    "created_utc": 1750262749.0,
    "media": null,
    "is_video": false,
    "num_comments": 198,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.234861385205307
  },
  {
    "score": 222,
    "title": "I Grew Two Faceless Instagram Pages to 400K+ Followers Each (One Sold, One Valued at 6-Figures) - AMA",
    "selftext": "I'm back for another AMA, and a lot has changed since my last one! I've successfully grown another Instagram theme page to over 400K followers, following the same strategies that made my first page a success. Both pages were built from scratch, completely faceless, and driven by passion in their respective niches.\n\nMy first page, focused on the humanity niche, reached 400K followers in just 7 months before I successfully sold it for a significant sum. My current page, centered on animals and emotional intelligence, hit 400+K followers in 9 months and is still rapidly growing. This page averages 50 million views per month, with Reels consistently pulling in hundreds of thousands to millions of views and thousands of comments. It's quickly become one of the top-performing accounts in its category.\n\nThe core of my strategy is storytelling and some simple psychology wich I think everyone can learn pretty fast when it comes to the reels. Visible first line on caption, title to spike the curiosity and give a reason to find the sweet fruit furher into the reel etc.\n\nI've been getting acquisition offers in the $10,000 - $15,000 range for my current page, and I also regularly charge $500 - $1,000 for brands/companies collabs.\n\nI will do my best one to answer all of you here! And if you didn't get an answer in previous thread I'll make sure you'll get here. I'll do my best to provide actionable insights!\n\n\n\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 222,
    "downs": 0,
    "created_utc": 1750763098.0,
    "media": null,
    "is_video": false,
    "num_comments": 315,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.250648404357363
  },
  {
    "score": 213,
    "title": "I'm a Professional Social Media Growth Strategist – AMA and Free Advice",
    "selftext": "I’ve scaled several businesses and creators over the years as a freelancer and honestly made pretty much every mistake you can imagine. I see a lot of small business owners and content creators struggling with the same challenges I faced when starting out.\n\nIt was really amazing to know that my last AMA post helped so many of you through your DMs, which is why I’ve decided to do this again.\n\nI’ve learned a lot from the amazing communities on Reddit over the years, and I’m looking to pay it forward as I again have some time on my hands.\n\nIf you’re feeling stuck or just want a second opinion on your growth strategy, feel free to reach out!\n\n\n ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 213,
    "downs": 0,
    "created_utc": 1762860754.0,
    "media": null,
    "is_video": false,
    "num_comments": 492,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.396837232987806
  },
  {
    "score": 208,
    "title": "What worked for me to reach 30 million monthly views in 3 months.",
    "selftext": "\n\nIn November 2024, I had 700 followers. Now, I have 25K followers and hit 30 million monthly views this month.\n\nI watched countless YouTube gurus, Instagram marketers, and Reddit experts. I devoured so much content, and this might surprise you—but honestly, I don’t remember a single piece of advice from them.\n\nIt might sound simple, but I believe success boils down to three things:\n\n1. Post what you love and know. Talk about what excites you and what you have expertise in. Study successful creators in your niche—analyze their hooks, download their videos, and break down their structure. But don’t copy. Adapt it to your own style. You have character—let it shine. BE YOU. I cannot stress this enough.\n\n\n2. Post daily (at least at the start). The algorithm needs to label your content and push it to the right audience. Posting frequently helps train the algorithm faster—simple as that.\n\n\n3. Be unique. Even within your niche, find a way to stand out. You’re competing with people who have been doing this for years. If you post the same content as them, it’ll be harder to get noticed. Find a unique spin—yes, it’s tough, but with millions of reels uploaded daily, originality is key.\n\n\n\nThere’s no shortcut, no secret formula. Success comes from doing what you love, staying consistent, practicing, and yes—a little bit of luck. But I firmly believe you create your own luck.\n\nAsk me anything—I’ll be happy to reply!\n\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 208,
    "downs": 0,
    "created_utc": 1742061125.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9176953061181825
  },
  {
    "score": 206,
    "title": "How I used ChatGPT + Midjourney to generate 2 weeks of Instagram content for a small business — in under 2 hours",
    "selftext": "Hey folks,\nI wanted to share a quick case study for anyone running a small business with limited time and budget for content.\n\nLast week, I helped a local handmade candle brand create a full 2-week Instagram content plan using AI tools — and the entire process took less than 2 hours. Here’s how:\n\n1. Content ideas via ChatGPT\nI asked GPT to generate 20 post ideas tailored to the niche, split into reels, carousels, and stories. It also generated captions, CTAs, and hashtags.\n\n2. Visuals via Midjourney + Canva\nI generated aesthetic, lifestyle images of candles in cozy interiors using Midjourney. Then edited and branded them using Canva.\n\n3. Organized content plan\nI structured all the posts into a simple Google Sheet with post dates, formats, and goals (engagement, education, promo).\n\nThe result?\nThe client had 2 weeks of ready-to-post content in one afternoon. Their engagement jumped by 3x just by posting more consistently with better visuals.\n\nIf you’re bootstrapping a brand and overwhelmed by content creation, using ChatGPT like this can be a game changer.\n\nLet me know if you’d like to see the prompt structure or visuals — happy to share and swap ideas!\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 206,
    "downs": 0,
    "created_utc": 1746817070.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.988623278089303
  },
  {
    "score": 204,
    "title": "IG permanently disabled my account for growing too fast",
    "selftext": "This is actually crazy. I made an Instagram account 2 weeks ago and grew it to 3K followers with 1M+ reached accounts. I’ve grown many accounts in the past with insane analytics but this one was definitely my fastest growing. They temporarily disabled my account for vaguely saying that I was “pretending to represent an established business” when I was posting content of my own business? I submitted an appeal and they denied it without explanation and then permanently disabled my account lol. Sucks having to start over but it is what it is. ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 204,
    "downs": 0,
    "created_utc": 1743081163.0,
    "media": null,
    "is_video": false,
    "num_comments": 106,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.031445749898359
  },
  {
    "score": 201,
    "title": "Trial Reels Life Hack",
    "selftext": "I'm not sure if you guys knew this already, but if you take a viral video and repost it as a trial reel, you'll basically have new followers.\n\nI have a video with like 150k views which performed really well and got me 2.5k followers, and with the release of trial reels, I realized that I could repost the same video over and over again, and because it'll keep being shown to non-followers (and people who haven't engaged), it'll always generate new followers.\n\nI tested this out with a few more videos that performed well, and so far here's what I found:\n\nIt won't grow as big as an original reel, even if it's validated content. Instagram tanks it's reach after it reaches a good performance.\n\nYou can keep reposting it as many times as you want, it won't get shown to your followers or in your board.\n\nSo far, each video (despite getting cut off) managed to bring 100 new followers before slowing down to nothing, and I kept reposting it multiple times, and every single time it performed well.\n\nYou obviously need to have a piece of validated content before doing something like this, but if you're a serious content creator, this is practically you hacking the algorithm.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 201,
    "downs": 0,
    "created_utc": 1739510458.0,
    "media": null,
    "is_video": false,
    "num_comments": 194,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.170368675127882
  },
  {
    "score": 202,
    "title": "Trials is INSANE!!",
    "selftext": "A couple months ago, I came across a post claiming that Trials was one of the best ways to grow your page. Honestly, I was skeptical—until recently. Now that Edits has rolled out, I feel like the game has completely changed. You can see so much more behind the scenes—why a video flops, what actually holds attention, and where viewers drop off.\n\nTo test it out, I edited the same video five different ways, each with a different caption. The results were surprising. One version clearly stood out. So, I recreated that winning version with a few small tweaks based on the retention graph—and the next post performed nearly twice as well.\n\nThis got me thinking: if I just keep repeating this cycle—analyze, refine, re-post—I feel like it’s only a matter of time before I hit something truly viral.\n\nWhat excites me most is how this changes the posting game. With Trials, you can experiment freely without tanking your follower count. It feels like the platform is finally rewarding iteration.\n\nCurious—has anyone else been posting multiple times a day with Trials? Are there any limits or best practices I should know to push this even further and increase view count?",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 202,
    "downs": 0,
    "created_utc": 1747599532.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9742385473525377
  },
  {
    "score": 198,
    "title": "8 Trillion new followers in one week, all from a video of my toe...just like everyone else here seems to claim.  ",
    "selftext": "Why is it that this sub is flooded with people making wild claims with zero proof, asking for DMs.  \n\nI don't want to DM you.  If you are who you say you are and you get the results you say you get then post the damn results.   Can't there be some kind of rule in the sub that requires that anyone making any claim at all post the documentation, rather than just \"sure dude I can do the same for you. Just DM.\"  \n\nIt's just all so ridiculous that anyone can basically just say anything they want without being required to prove it. Actually that's not ridiculous because free speech rocks.  What's silly is that a zillion people comment on each post as through they have found the oracle of wisdom and knowledge and can't wait to send them money.  \n\nThoughts?  ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 198,
    "downs": 0,
    "created_utc": 1724015725.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8890179939150906
  },
  {
    "score": 195,
    "title": "I've figured out (in part) how the algorithm works [Could help you grow]",
    "selftext": "For about a month and a half now, I've been trying to get my business page off the ground organically through Instagram content.\n\nIn short - the page belongs to my dad's business where he creates menu covers for restaurants, and a whole bunch of other things. Had maybe 200 followers when I took over, and videos posted wouldn't get more than 200-ish views.\n\nThe account is now on 1200 followers, and I'm regularly getting 3k+ views per video, while I also cracked 10k+ twice, and one video is currently at 130k views and 1500+ shares\n\nI experimented with content format, and the one that works for now is making short, fun videos in cafes/restaurants - As mentioned, I've had growth, but the \"big hitting\" reels are still hit and miss\n\nIn any case, I'll share what I've found about the algorithm, along with general suggestions:\n\n* You MUST post reels. This is often echoed feedback but it's 100% true. Sure some accounts post images and get huge interaction, but those are mostly established accounts with an active follower base. If you're just starting out, you need to post reels\n* Don't do follow/unfollow and don't follow random accounts. Follow people who are most likely to interact with your content and enjoy it. Another option is to follow accounts even if they don't follow back - then like their posts, stories and leave commments + respond to stories. This might prompt them to follow you back. The important part here is that you need engaged followers. Will expand on this in the algorithm section\n* If you can, invite friends to follow your account and ask them to interact with your content when you post\n* Don't boost posts/pay for ads until you have reached some consistent performance with your reels and have at least 500+ followers\n\nNow, here's what I've figured out about the algorithm:\n\n* First, whenever you post - Instagram will show your reel to a % of your followers. If they engage with the content (like, watch full length, comment) - the reel will be slowly shown on Explore pages of people who don't follow you, who Instagram deemed a good fit for your content\n* At this point, the absolute most important metrics are shares and saves. This is THE MOST IMPORTANT thing to keep in mind. You can get watch time, likes, comments, none of this matters if your video lacks shares and saves. \n* This means that your content needs to be made within this context. Before you make a content strategy or want to create a reel - Ask yourself: \"Is my reel providing value for my niche that would prompt the person watching to save or share it?\"\n* You can test this out once you start posting consistently - Always check the number of shares and saves. If you're getting likes but no shares/saves - don't get excited as the post has no chance of going big if it lacks those two metrics. To truly grow, you need shares and saves\n* Going back to the first point, it's the reason you need engaged followers, and not random ones who won't engage. If they don't engage, instagram won't push your content to the Explore page, hence no organic growth.\n\n\n\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 195,
    "downs": 0,
    "created_utc": 1733761830.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.856482409599569
  },
  {
    "score": 196,
    "title": "How I generated $28,000 in 2 days",
    "selftext": "I scale OnlyFans models by promoting them on meme pages. A typical campaign will last about a week because everyone in the industry will start to copy the advert, causing it to become saturated. I specialize in creating native content that won’t be seen as an ad to the average user, increasing engagement and exposure.\n\nThis specific campaign lasted 6 days, with a budget of $6,000. The initial 4 days were spent testing different adverts on smaller pages between 100-500k followers. Once I found an ad that worked well, I scheduled posts on accounts with 500k-4m followers. The combined follower count across all pages was around 50 million followers. \n\nWhen working with a great ad that can be copied, it’s important to blast the ad as fast as possible to fill up the ad space and give the competition less time to react. This also gives the appearance of your ad going viral. If you’ve done this correctly, it will even be posted by other pages without them knowing it’s an ad. \n\nThe initial subscriptions generated $9,900 over the first 4 days, while the final two days brought in an additional $28,200. Keep in mind that this does not include recurring subscriptions, and the majority of OnlyFans income typically comes from chatting. Overall, my client made a $32,000 profit in 6 days with a 535% ROI. \n\nNative advertising is underrated. Most OnlyFans advertisers basically shove their ad down the users throat, and it’s only getting worse. Develop your own ads, be creative, and you’ll succeed.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 196,
    "downs": 0,
    "created_utc": 1723484675.0,
    "media": null,
    "is_video": false,
    "num_comments": 199,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.052481223993584
  },
  {
    "score": 192,
    "title": "Have you tried iggviral?",
    "selftext": "I recently started as a social manager and the company’s instagram account is messed up. \n\nAny reel they post gets 60-70 likes and a 200-300 views even though they have 50k followers.\n\nMy boss is mad and wants me to get this number up or else I will lose my job.\n\nAfter trying different post formats, giveaways, nothing seems to be working.\n\nI think they bought followers but will never agree they did. They just need more social proof and everywhere I looked, the sites promised followers but this company says followers with engagement.\n\nI don't care if its real or not because people don't care, just need to know if they actually deliver them.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 192,
    "downs": 0,
    "created_utc": 1726882973.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8272836472508676
  },
  {
    "score": 191,
    "title": "Unfollower App (No login needed)",
    "selftext": "\\*\\*UPDATE: Unfortunately, the app has been discontinued but I hope you all enjoyed it while it lasted :)  \n  \nFor people who care about who doesn't follow them back...\n\nSome of my friends got hacked on Instagram after typing their logins into unfollower apps...\n\nI as a CS major😼, also got tired of having to export all my unfollower data every time --&gt; so I'm developing a software that shows people who don't follow back without the need for any login details (figured I wouldn't gatekeep and it'd help out the resume lol🙏🙏)\n\nSome Pros:\n\n1. Completely 100% safe (I don't ask for your login details)\n2. FREEEEE (I'm a broke college kid myself so I understand)\n3. Easy to use (you just need to click like 2 buttons)\n\n\\-you can also see who others unfollow if you're nosy like me (ik toxic but o well)\n\nSome Cons:\n\n1. It'll be a chrome extension (so you guys don't need to run the raw code each time) but that means it only works on desktop\n2. Currently not fully developed yet so there's a waitlist\n\nHere if you want to check it out--&gt;  🔗  [https://unfollowed.lol/](https://unfollowed.lol/)\n\n(Currently a waitlist but I'll email you guys when it's ready!)\n\nfeel free to comment any questions :)",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 191,
    "downs": 0,
    "created_utc": 1711645270.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9936188260023244
  },
  {
    "score": 189,
    "title": "Have you seen how the youth scroll social media",
    "selftext": "Whatsup guys, yesterday I was on my way to the airport and I had to catch a tram. While sitting in the tram I noticed this girl on her phone. She must have been 18 to 21 ish years old.\n\nI watched how quick she was swiping through tiktok, not only was she swiping but she was engaging and shit at the same time. Liking vids without actually watching the content, saving vids, all at lightning speed.\n\nI figure mmm maybe this is just a special case. So when I was at the airport, I saw another girl probably the same age and she was doing the same thing. Speed scrolling, constantly locked in. \n\nThis has me wondering, what the hell do you really need to do to stop the scroll. And if you say better hooks id say your hooks dont mean shit. They dont even hear your hooks. \n\nWhat I wanna test this week is visual interruptions like completely having a bright visual. A color that stands out. \n\nI think the first second is literally all you have.\n\nAnother thing I was noticing is that every now and again the girls would stop scroll back briefly watch a few seconds of a reel then save it and proceed speed scrolling.\n\nThe vids they'd go back to always had some sort of public influencer. \n\nI think this is why the SORA boom took over. Because you'd be scrolling then randomly see MJ in diamonds sky diving.\n\nSo perhaps including wild antics and familiar faces in the first second of your video might be the key. Lol \n\nim gna try it and see. \n\nWhat do you guys think? And have you seen this speed scrolling before or is it just me.",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 189,
    "downs": 0,
    "created_utc": 1762271755.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.95699896353907
  },
  {
    "score": 187,
    "title": "Want to hit 1M views on Instagram fast, faceless?",
    "selftext": "Here’s a simple trick: \n\nevery day, find trending memes and turn them into 3-5 second video loops. \n\nPeople get busy commenting and debating, and your video keeps playing over and over!\n\nThis makes Instagram think your video is super popular and will push it to more people.\n\nOnce you go viral, check out \"Tap Refer.com\". Find a product you and your followers like, sign up, and start earning life recurring passive income, without ever showing your face!\n\n",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 187,
    "downs": 0,
    "created_utc": 1727411016.0,
    "media": null,
    "is_video": false,
    "num_comments": 114,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.949506769440486
  },
  {
    "score": 91,
    "title": "The algorithm loves one trick ponies.",
    "selftext": "Especially on reels. I've seen it time and time again. \n\nAlgorithm wants one trick ponies, I'm not talking niches either, I'm talking the same damn thing over and over. \n\nI follow a Japanese restaraunt, they have 500k followers, their entire feed is the same two tiktok songs with pretty waitresses in traditional Japanese attire. \n\nThey have been doing the same thing for months and their engagement is growing. \n\nI'm convinced at this point to win the algorithm, just find your one trick, then rinse and repeat woth very slight variation. \n\nTbe algorithm wants one dimensional characters with a si gular perspective. ",
    "subreddit": "InstagramMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 91,
    "downs": 0,
    "created_utc": 1726327701.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.406969709425049
  }
]