[
  {
    "score": 7,
    "title": "The 27% Loyalty Problem: Why Insurance is Finally Waking Up to Customer Experience",
    "selftext": "Here's a stat that should make every insurer uncomfortable: only 27% of customers feel loyal to their current provider.\n\nBut here's what's interesting - the companies that are fixing this are seeing massive returns.\n\nRecent industry data shows customer-centric insurers are outperforming competitors by 20-65% in total shareholder returns.\n\nThat's not a small edge - that's a completely different business model working.\n\nI've been watching this shift accelerate, especially with how data is being used.\n\nThe winners aren't just collecting more information - they're actually using it to understand what customers want before they ask.\n\n**Two things every insurance tech company should be thinking about:**\n\n1. **Centralized customer data isn't optional anymore** \\- scattered information across systems is why 60% of customers switch channels during purchase.\n\nThe friction is killing conversions.\n\n2. **Engagement beyond claims matters** \\- some companies are seeing 40x more customer interactions by gamifying wellness programs instead of waiting for the annual renewal conversation.\n\nThe mobile-first shift is real too.\n\nWith 5.8 billion mobile users expected by 2025, desktop-heavy processes are becoming a competitive disadvantage.\n\n**Here's what I think this means moving forward:** Insurance is about to split into two categories - relationship-focused companies that use data to genuinely serve customers, and transactional players competing on price alone.\n\nWhich side do you think will win long-term?\n\nAnd what data strategies are you seeing work in practice?",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 7,
    "downs": 0,
    "created_utc": 1751491533.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Provides an industry insight with supporting reasoning about customer-centric insurance; not a steps-based guide or list.",
    "composite_score": 1.9541199826559248
  },
  {
    "score": 6,
    "title": "Looking for insurance brokerages in the US to test our AI insurtech solution",
    "selftext": "Hi, Im Mohan - Founding team of Layerup (YCS22), We built something fascinating for insurance brokerages ([https://www.uselayerup.com/](https://www.uselayerup.com/)) and are looking for customers for our pilot. We already have 3 top brokerages signed up. I'm finding it hard with cold emails to reach out to brokerages. If anyone here works in a brokerage, please let me know - I could give a quick demo. ",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 6,
    "downs": 0,
    "created_utc": 1686663047.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Outreach post with minimal substantive content beyond a request for contacts.",
    "composite_score": 2.095098040014257
  },
  {
    "score": 5,
    "title": "How My Failed Startup Changed My Life",
    "selftext": "Not sure why, but I’ve been reflecting today on how my 2.5 years building a startup (2021-2023) that eventually failed completely changed my life.\n\nA bit of background: I had a comfy actuarial job for about 8 years, as a FSA. It paid well, occassinally rewarding projects, but overall monotone. I got bored out of my mind and decided to take a leap. I was lucky to raise some funding pre-product, and more throughout the journey, and spent the next couple of years trying to innovate in a really tough insurance space. I was the business cofounder.\n\nFast forward, the company failed, and I took full responsbility.\n\nI walked away with:\n\n* 2.5 years of minimal pay\n* zero equity\n* a strained relationship with my cofounder (also my best friend) but later amended\n* disappointed investors who saw us as the big bet in their portfolio\n\nAnd yet, I’d still call it the most rewarding period of my life. Here’s why:\n\n1. I learned how to actually run a business Being a cofounder forced me to operate at a much higher level than I ever did in corporate. I got to work directly with industry leaders, entrepreneurs, and partners on real deals and got to understand the dynamics I would otherwise never see. That kind of exposure would’ve taken me 20 years+, or never, to get if I’d stayed in my old job.\n2. The people Working with smart, curious, problem-solving people is addictive. The energy in startup land is completely different. In corporate, it’s meetings and middle management beating the same drums; in startups, it’s ideas flying everywhere and people who are curious and want to make things work. It’s contagious.\n3. Real leadership is built in chaos I used to think I was a decent leader. Turns out, leading in corporate is easy. You follow processes and check boxes. Leading in a startup means staying calm and collected through chaos and keeping your team level headed when everything is on fire, which is like 80%+ of the time. It humbled me fast.\n4. I found my own “product-market fit” This journey showed me what I’m good at, what I’m terrible at, and what kind of work actually energizes me and allow me to flourish now being a partnership leader that still taps into my analytical skills, and frankly, FSA still helps drive big deal through since my counterparts appreciate the analytical rigors we bring. It’s weirdly satisfying to figure that out, even if you learn it through repeated failure.\n5. Starting with my best friend was both a blessing and a curse He’s an accomplished, brilliant and shar engineer and I probably wouldn’t have started without him. But over time, it became clear that he didn’t want the 24/7 grind that startups demand. That misalignemtn deeply hurt our chances and strained our friendship. We’ve made peace since, but it was rough during the storm. You really don’t know how people (or you) will react under pressure and stress until you’re there.\n6. The good, bad, and ugly I met principled founders, loud talkers, and straight-up scammers. I learned how deals get made, how people really operate, and how to spot who’s serious. It made me sharper, more curious, and a lot less naive.\n\nWe hear so many success stories in startups. I figured I’d share the other side. The one where it doesn’t work out, but still ends up being one of the best decisions of your life.",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1761051023.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Narrative with personal lessons and insights rather than a step-by-step guide.",
    "composite_score": 1.6786662482156343
  },
  {
    "score": 5,
    "title": "Interested in pivoting from Insurance Carrier to Insurtech - give me the good/bad/ugly",
    "selftext": "Title sums it up. I’m 10 years in at a very large, global insurance carrier currently working in a sales/distribution role (think: business development + relationship management). I’m itching to pivot out of insurance and thought a good stepping stone would be some kind of BD or Partnerships role at an insurtech. \n\nAm I shooting myself in the foot by straying from stability right now or should I rip the bandaid and try it out? What types of Insurtech companies are growing vs shrinking in 2024? How can I leverage my skillset to break out of the traditional Insurance industry? Feel free to be brutally honest. All feedback is appreciated.",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1705511574.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Seeking advice on pivot rather than presenting a model or how-to steps.",
    "composite_score": 2.085122926537062
  },
  {
    "score": 6,
    "title": "The Digitization and Enablement of Insurance Agents by Adam Chadroff, VC at Equal Ventures",
    "selftext": "[Link to article](https://medium.com/@EqualVentures/the-digitization-and-enablement-of-insurance-agents-b3dbc11963da).  My TLDR notes:\n\n* the thesis of digital-only distribution fundamentally failed\n* agents have been difficult to disintermediate and will continue to play an important role in distribution\n* Ninety percent of P&amp;C products continue to be placed through agents, brokers and branches, and\n* the number of independent P&amp;C agents in the US increased by roughly 10% from 2020 to 2022\n* new technology turned out to improve agent and broker distribution more than threaten it\n* according to BCG, agents who “get by on charm…are a vanishing breed” and instead, top agents in the future will rely on “digital channels and AI-based insights.”",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 6,
    "downs": 0,
    "created_utc": 1675182051.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Summarizes industry points and implications about digitization; informs rather than detailing steps.",
    "composite_score": 1.7456130378462476
  },
  {
    "score": 3,
    "title": "Aviation Insurance Underwriting: Data Sources, Rules, and Rating Logic",
    "selftext": "Hey folks,\n\nI’m an engineer working on underwriting and decisioning systems, currently digging into aviation insurance (commercial, private, and GL).\n\nI’m trying to understand aviation from a data + modeling angle, not from a brokerage or placement perspective.\n\nSpecifically looking for:\n\n\\-Public or semi-public dataset sources relevant to aviation underwriting\n\n(accidents, incidents, aircraft, pilot history, utilization, weather, maintenance, etc.)\n\n\\-How underwriting rules and eligibility constraints are typically structured\n\n\\-High-level rating logic and variable sets used in aviation (no carrier IP, just frameworks)\n\n\\-Any prior art, whitepapers, or systems you’ve seen used in production\n\nI’ve tried adapting generic rating engines (TigerLabs, Aspire OSS), but aviation risk is highly domain-specific and doesn’t map cleanly without proper data and rule primitives.\n\nIf you’ve built, modeled, or integrated aviation insurance systems, or know where the data actually lives, I’d appreciate any pointers.\n\nThanks.",
    "subreddit": "InsurTech",
    "upvote_ratio": 0.72,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1767477573.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Request for datasets and design details; primarily a query for information.",
    "composite_score": 1.2925749891599532
  },
  {
    "score": 5,
    "title": "Exploring a new approach to verifying media authenticity in insurance claims — looking to chat with industry folks",
    "selftext": "Hi everyone,  \nI’m a machine learning engineer at a large tech company exploring a solution that aims to improve how digital evidence (like photos/videos) is verified and handled during insurance claims — with a focus on preventing fraud and streamlining workflows. I’m keeping the specifics under wraps for now, but I’d really value input from those with experience in claims, fraud detection, or insurance operations.\n\nIf you’re open to a quick chat or sharing insights, I’d love to hear from you—feel free to DM or drop a comment. Thanks in advance!",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1746729351.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Networking request to discuss a potential fraud-detection approach.",
    "composite_score": 1.9172268755754653
  },
  {
    "score": 4,
    "title": "I’ve optimized 70+ landing pages — I'll give you honest feedback",
    "selftext": "I’m a UX designer with 10+ years of experience. I’ve helped companies across InsurTech, reinsurances, SaaS, and marketplaces improve their homepages and boost conversions.\n\nLately, I’ve been focusing more on the InsurTech space.   \n  \nLately, I’ve been focused on InsurTech, working with companies in claims automation, digital policy management, and AI-driven risk assessment. I’ve helped teams building tools for brokers, SMBs, and end-consumers.\n\nThe biggest issue I keep seeing? Unclear messaging and homepages that confuse more than convert.\n\nSo if you’re building something, I’d love to help.\n\nDrop a comment with:\n\n1. Your company name\n2. What your product does\n3. Who it’s for (your audience)\n4. A link to your homepage\n\nI’ll reply with:\n\n* What’s working\n* What’s confusing\n* Quick tips to improve your messaging and UX\n\nJust here to give back and help more people build clear, high-converting landing pages.",
    "subreddit": "InsurTech",
    "upvote_ratio": 0.75,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1743092695.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Offers UX feedback guidance and tips for improving landing pages.",
    "composite_score": 1.7130149978319906
  },
  {
    "score": 4,
    "title": "Generative AI in Insurtech for generating SQL queries",
    "selftext": "Hi everyone!\n\nFor the past few months, we've been thinking with our team about ways to integrate Gen AI within the insurance software, and I think we've come up with a pretty smart and safe way to do it. It's called Reporting AI and is currently included in the [Openkoda Insurance Policy Management Software](https://openkoda.com/insurance-policy-management-software/) development kit.\n\nWith it, you can use natural language to automatically generate SQL queries based on your database schema, potentially saving you hours on the lengthy report generation process. The important thing to note is that the only things that we are sharing with the OpenAI API are the data types and table names - all sensitive data never leaves your organization's database.\n\nI've included a short demo below.\n\nWhat do you think about such an approach? All feedback is welcomed! Maybe you have other ideas for smart use of Gen AI in insurance enterprise software?\n\n[https://www.youtube.com/watch?v=oafdA2WXvEc&amp;ab\\_channel=Openkoda%3AOpen-sourcedevelopmentplatform](https://www.youtube.com/watch?v=oafdA2WXvEc&amp;ab_channel=Openkoda%3AOpen-sourcedevelopmentplatform)",
    "subreddit": "InsurTech",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1721979296.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Describes a GenAI integration concept and asks for feedback.",
    "composite_score": 1.6709550065040282
  },
  {
    "score": 5,
    "title": "Berkeley student learning about CV/ML in insurance",
    "selftext": "Hi everyone, I'm a student at UC Berkeley doing a class project on AI and computer vision in insurance. I'd super appreciate it if y'all could share some of your expertise with me either by answering my few questions or (even better) hoping on the phone with me for 15m to help me learn about insur-tech. I'm mainly looking to answer:  \n\n\n1. In what insurance process (claims, damage assessment, etc) is Computer Vision used the most?\n2. How is Computer Vision used in Insurance?\n3. Do Insurance firms build their own AI systems?\n4. What are the main challenges with using Computer Vision in Insurance?\n\nMany thanks!",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1690310717.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Simple information-seeking post from a student.",
    "composite_score": 1.877636252551653
  },
  {
    "score": 3,
    "title": "I’m building an insurtech MGA and just got my first LOI, what’s next?",
    "selftext": "\nI am building a micro-protection MGA focused on the college application process. Schools or districts would purchase group-level coverage for seniors who are not eligible for fee waivers. Students track their applications on a platform and, if rejected, submit a receipt and rejection letter to receive reimbursement.\n\nA while ago I shared the idea on Reddit and received mixed feedback. That pushed me to refine the messaging and deepen the research.\n\nWhat has happened since\n\nI conducted 150 interviews with high school counselors across about 20 districts. I focused on understanding how students build their application lists, how fee waivers actually function, and how often cost limits the number of applications a student submits.\n\nCounselors consistently confirmed the presence of a large population of students who do not qualify for waivers but still struggle to afford broad application strategies.\n\nEarly traction\n\nI shared my findings with a district counseling director. After reviewing the insights, he contacted one of the principals I interviewed and confirmed interest in a pilot. That school has now signed a Letter of Intent.\n\nCurrent status\n\n\t•\tValidated use case\n\n\t•\tOne LOI\n\n\t•\tCounselor champions in multiple schools\n\n\t•\tInitial underwriting and actuarial framework\n\n\t•\tProjected loss ratio of 53 percent\n\n\t•\tGroup distribution model at the school and district level\n\n\t•\tPlan to operate as an MGA\n\n\nMy next steps are securing additional LOIs, continuing operational research with counselors, and preparing for district-level conversations.\n\nWhat I am looking for\n\nFor those with MGA, carrier, or reinsurance experience:\n\n\t1.\tWhat is the best way to approach potential fronting carriers?\n\n\t2.\tWhat do carriers and reinsurers expect to see from a concept-stage MGA beyond the basic risk model?\n\n\t3.\tShould I engage actuarial or compliance partners before speaking with carriers, or after?\n\n\t4.\tWhat signals of readiness matter most at this stage?\n\nI have bootstrapped everything so far and plan to raise a small round in 2026 once I secure several more LOIs and finalize partnerships.\n\nAny guidance or introductions would be appreciated. Happy to share more details if helpful.\n",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1765228592.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Long-form business update with questions; no clear list, steps, or model.",
    "composite_score": 1.7746090113350907
  },
  {
    "score": 3,
    "title": "Looking for Sales Partner to collaborate and solve real world problems together",
    "selftext": "Hey everyone,\n\nI’m a cofounder of a small team of 4 experienced engineers all with strong backgrounds in building scalable products across startups and companies like Amazon, Google.\n\nWe recently built our first product: a RAG-based knowledge collection platform where companies can securely connect sources like Google Drive, GitHub, Confluence, SharePoint, etc., while preserving role-based access. It enables teams to query all their internal knowledge from one place.\n\nTechnically, it worked really well and received positive feedback, but we realized we couldn’t identify a strong enough use case that would drive real adoption or revenue.\n\nWe’re now pivoting and looking to partner with someone who understands on-ground business pain points ideally a sales or domain expert with insight into industries that aren’t yet deeply tech-driven (like insurance, legal, or real estate).\n\nOur goal is to find real, high-impact problems we can solve using tech and AI especially around automating workflows or reducing manual tasks to deliver clear ROI (for e.g. einvoice/commision statements reconciliation or transaction verification etc).\n\nIf you’ve seen inefficiencies or bottlenecks in your field that could use automation or AI, I’d love to connect and brainstorm potential solutions together.\n\nI can share the sources of my application to provide proof that we are geniunely focused and want to build something good.",
    "subreddit": "InsurTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1760962769.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Introductory collaboration pitch seeking a partner; not a how-to or list.",
    "composite_score": 1.3520599913279625
  }
]