[
  {
    "score": 87,
    "title": "50 Investors Who Beat the Market",
    "selftext": "We all know that beating the market consistently is incredibly difficult, even for the most successful investors. Doing this over 10+ years is even more impressive, given that underperformance rates typically rise as time horizons lengthen.\n\nMost investors struggle due to psychology, emotional decisions, poor timing, selling winners too early, and the ongoing challenge of finding great stocks at cheap prices.\n\nIn fact, according to the [2024 SPIVA U.S. Scorecard](https://www.spglobal.com/spdji/en/documents/spiva/spiva-us-year-end-2024.pdf), over the 15-year horizon ending December 2024, not a single category of active equity funds had a majority of managers outperform their benchmarks.\n\nSince sustained outperformance is so rare, I thought it would be interesting to compile a list of 50 investors who've beaten the S&amp;P 500 Total Return Index (SP500TR), net of fees, over extended periods (most are 10+ years).\n\nHere's the scatterplot visual and table with source data: [https://stablebread.com/investors/](https://stablebread.com/investors/)\n\nWill continue to update the visual and data sources every year. Let me know if you have any suggestions!",
    "subreddit": "InvestmentClub",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 87,
    "downs": 0,
    "created_utc": 1752171785.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3656940125612715
  },
  {
    "score": 69,
    "title": "Powell sees what retail investors don’t",
    "selftext": "U.S. stocks have already risen to a critical point. Retail investors don’t see it, but Powell does.\n\nAnd day ago he said the stock market is *Highly valued*, a rare and serious warning about equities.\n\nIn the past five years, there have been many episodes of similar euphoria as today. In 2020, it led to the pandemic crash. In 2022, it led to the rate hike crash. Earlier this year, it led to the tariff crash. Every time this trendline was breached, something happened.\n\nSo should we sell everything now? Currently just holding NVDA, PLTR, AIFU and CRWV",
    "subreddit": "InvestmentClub",
    "upvote_ratio": 0.73,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1758782712.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.327213899879745
  },
  {
    "score": 61,
    "title": "Long-Term Investors: What’s Your Highest-Conviction Position Right Now?",
    "selftext": "Long-term investors: what’s your highest-conviction position right now? With interest rates staying higher for longer, inflation proving sticky in services, massive AI capex spending starting to raise margin questions, and geopolitical risk becoming background noise rather than a shock, I’m curious how others here are positioning for the next several years. What is the one investment—whether a stock, ETF, sector, or broader strategy—that you feel strongest about right now, and what’s the core reasoning behind it?\n\nNot really looking for short-term trades or meme plays. I’m more interested in ideas built around durable cash flows, strong balance sheets, clear secular tailwinds, or asymmetric risk-reward setups. If you’re willing, it would be great to hear what you see as the biggest risk to your thesis and what your time horizon looks like. Let’s compare notes and learn from each other.",
    "subreddit": "InvestmentClub",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1766488027.0,
    "media": null,
    "is_video": false,
    "num_comments": 282,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7382849072603985
  }
]