[
  {
    "score": 31,
    "title": "Lakshmi Finance Center , anyone know?",
    "selftext": "I’ve been using Lakshmi Finance Center for a few months, and while it seemed reliable at first, I’m now facing major technical issues. The API integration no longer works—live data and automated orders fail, even after verifying keys and endpoints. There are also glitches in the charting tools, with indicators freezing or showing delayed data. Support hasn’t been helpful so far. Has anyone else had similar problems? Any fixes or workarounds you’d recommend?",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1754564139.0,
    "media": null,
    "is_video": false,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "User requests fixes/workarounds for a finance platform's API and charting issues.",
    "composite_score": 3.2560717722922927
  },
  {
    "score": 32,
    "title": "67 years old, 30 years of investing, reached a personal net worth milestone of $8 million, and about to begin my retirement.",
    "selftext": "Personal Retirement Milestone Record, January to May 2026\n\nMy main investments include Nvidia, Tesla, Google, Apple, VOO ETF, and various other companies, including some tech stocks and cryptocurrencies like Bitcoin. This is the main reason my assets have reached their current level.\n\nMain strategy: Reversal strategy, including mean reversion, extreme sentiment, liquidity traps, technical indicator \"divergence,\" price patterns, and candlestick momentum signals, used for investment and stock selection.\n\nI was born into a business family, and my father taught me business and investment thinking from a young age, giving me a keen sense for money. 30 years in the stock market have flown by. Many people might wonder why I chose to retire at 67. Because I feel that the meaning of my life is to make money. Currently, I am experiencing various health problems, so I plan to dedicate the rest of my time to myself, find a quiet place to plant flowers and plants, buy groceries and cook, and enjoy my later years. This might be my last appearance on Reddit. I'm not a banknote, so it's impossible for everyone to like me. Some people like me, some criticize me, which is all normal. I will reply to every private message and share these strategies for free, hoping to help everyone.",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1767659071.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Shares a personal investment strategy and mental model for stock selection.",
    "composite_score": 2.808738400567025
  },
  {
    "score": 27,
    "title": "Anyone Exploring Apex Finance Institute ?",
    "selftext": "I recently came across Apex Finance Institute and I’m very interested in learning more. Could you tell me what the main courses include? For example, do you offer foundational modules such as financial markets, portfolio theory, and behavioral finance, as well as advanced topics like quantitative modeling, derivatives, or AI-driven trading strategies? I’d also like to know more about your instructors—who teaches these courses, and which teachers are considered especially strong? I’m particularly curious about Maxwell Laurence, and would love to hear about his teaching style and experience in combining finance with artificial intelligence. Any information about your programs and faculty would be greatly appreciated.",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1763691023.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Requests information about a finance institute's courses and instructors.",
    "composite_score": 2.729882492031356
  },
  {
    "score": 29,
    "title": "What to do with $160000",
    "selftext": "So, let's say a person who is used to living from pay check to pay check suddenly comes upon a huge sum of money, around $160000 US. What would your advise be to someone who has no clue about finances or what the best ways to invest are. I generally don't trust people with my money so even if I do see a financial advisor, how do I make sure they give me sound advice. I'm so scared of losing all this money because I'm financially uninformed and financially uneducated. Look, I am a university graduate and not unintelligent, I'm just not money smart at all and not sure where to start researching. I've even considered enrolling in some kind of course, but not even sure which courses to look at. \n\nIdeally I'd like to take out some and keep it in an easily accessible place, in case of emergencies. But I'd like to invest the majority. I'm not interested in going on an elaborate spending spree, I'd much rather see my money grow. \n\nI think investing in gold might be something I'm very interested in, since gold will always have value, and will we live in very uncertain financial times. \n\nSo, your help is greatly appreciated.",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1701171896.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for financial guidance and investment planning for a lump sum.",
    "composite_score": 3.15523429256591
  },
  {
    "score": 24,
    "title": "AMA: I'm a retired Portfolio Manager at an Institutional Fund",
    "selftext": "Hey everyone,\n\nI'm a retired portfolio manager at a mutual fund (think Vanguard/Fidelity) and wanted to open up an AMA for anyone on this thread if I can be helpful. I’ve been retired for a few years now, and in that time I’ve seen both the markets and the way people invest change more than I ever imagined.\n\nBut before talking about what’s new, let’s start with the constants — the mistakes that trip up both professionals and retail investors.\n\n# The Biggest Mistakes I Saw (and Made) Over My Career\n\n1. **Chasing performance** — buying last quarter’s or last year’s winners without understanding *why* they ran.\n2. **Falling in love with a position** — getting attached to the story and ignoring the math of diversification.\n3. **No sell plan** — knowing when to enter but never defining the exit.\n4. **Letting dead money sit** — holding losers for years because you can’t admit the thesis is broken.\n\nThese are timeless — I saw $50k retail accounts and $5B funds make the exact same errors. The dollar amounts change, but the psychology is the same.\n\n# A Path to Investing Your Own Savings\n\nIf you’re managing your own money today, you have an advantage I didn’t see in my early career: you can build an institutional-quality process without working at an institution.\n\nStart by writing down your **investment philosophy** — what you believe about the market, risk, and opportunity. Then define **position sizing rules** (how much to put into each trade), **risk limits** (max drawdowns you’ll accept), and **sell discipline** (when to cut or take profit).\n\nYou don’t need 50 positions. You need enough diversification to survive bad luck, and enough conviction to let your winners matter. Review your portfolio monthly, not hourly. The point is to compound — not to get every single trade right.\n\n# Tools Worth Using Today\n\nBack when I started, if you didn’t have a Bloomberg Terminal and a $20k+ research budget, you were behind. Now the playing field is flatter — retail investors have access to:\n\n* **Koyfin** — macro dashboards, asset correlations, and real-time economic tracking. [koyfin.com](http://koyfin.com)\n* **Robinhood** — commission-free trades, fractional shares, and easier scaling for smaller accounts. [robinhood.com](http://robinhood.com)\n* **Oracle** — built by ex-hedge fund analysts, delivers institutional-grade trade ideas in a retail-friendly format. [oraclewlth.com](http://oraclewlth.com)\n* **AI &amp; scripting tools** — pull, clean, and analyze datasets in minutes that used to take analyst teams days. alpaca is one of these but also recommend openbb.\n\nI’m happy to answer questions about position sizing, building a process, using these tools together, or stories from the fund world.\n\n**Ask me anything.**",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1755019756.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.84,
    "category_rationale": "Offers a structured investing approach with defined steps and rules.",
    "composite_score": 3.010489028679166
  },
  {
    "score": 23,
    "title": "20M want to start investing",
    "selftext": "I'm taking control of my life. I’ve quit gaming, smoking weed, clubbing, drinking - basically cut out almost all of my bad habits. I’ve started working out, eating clean, resetting my dopamine levels, reading, and listening to podcasts.\n\nBut even after making all these changes, I realized something important: I still don’t know how to make money - or more accurately, I don’t have a clear plan. I want to learn how to invest and how to build long-term wealth. I know success doesn’t come overnight, and I’m not looking for a get-rich-quick scheme. I want to rewire my brain and take advantage of all the time I now have to learn something meaningful.\n\nRight now, I’m earning around $4,000 a month. My expenses are about $1,800–$2,000, so I have money I can put to work. I’ve been thinking about investing in ETFs and individual stocks, but I know there’s more to building a strong portfolio than just buying a few ETFs. I also plan to build an emergency fund.\n\nI just need guidance on where to start and how to create a solid long-term strategy.",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1753021112.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests guidance on how to start investing and create a long-term strategy.",
    "composite_score": 2.9257435452248552
  },
  {
    "score": 20,
    "title": "Anyone know VICBITGO crypto trading platform ?",
    "selftext": "I would like to understand how the VICBITGO crypto trading system is designed in terms of its technical architecture, including its matching mechanism, fund custody process, security features, and backend operations. I am also interested in whether its revenue model and user fund flow are transparent, and if its market data sources can be independently verified. If there are external concerns or questions about its operations, I would like to know whether there are official documents or technical explanations that address these issues.",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1763707421.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Asks for technical details about a crypto trading platform and related docs.",
    "composite_score": 2.66026492426176
  },
  {
    "score": 19,
    "title": "Anyone know Watsans Exchange?",
    "selftext": "Anyone know about Watsans Exchange? I’m interested in learning more about the platform, including how it works, its main features, and the technologies behind it. I’m particularly curious about its usability, interface design, and any unique technical approaches it might use. Additionally, if there are educational resources, tutorials, or guides related to the platform, I’d love to hear about them. Any insights, personal experiences, or technical observations would be greatly appreciated. Thanks in advance!",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1763447052.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Queries about a platform's features, usability, and educational resources.",
    "composite_score": 2.8036049848239344
  },
  {
    "score": 19,
    "title": "Copper is needed for a Net-Zero future and electrification...",
    "selftext": "**Copper sector right now:**\n\n* “The world’s appetite for copper to build most electronic devices will exceed supply over the next decade and imperil climate targets unless dozens of new mines are built”\n* “If we don’t have enough copper, it could seriously short circuit the energy transition,” Jeremy Weir, CEO of metals trader Trafigura AG\n\nThe world needs more copper mines and\n\n# Interra Copper (Tickers: $IMCX $IMCX.c $IMIMF)\n\nis staying ahead of the curve with their acquisition. Of Alto Verde Cooper and the subsequent acquisition of new mining sites in Chile (the world’s largest producer of copper)\n\n**Interview with CEO Chris Buncic here about the future of INterra and the exciting new exploration assets acquired in Chile:**\n\n[**https://www.youtube.com/watch?v=fpESBIueMJA**](https://www.youtube.com/watch?v=fpESBIueMJA)\n\n**Tres Marias:**  \n[**https://www.interracoppercorp.com/projects/chile/tres-marias/**](https://www.interracoppercorp.com/projects/chile/tres-marias/)\n\nThe Tres Marias Project is located 1,150 km north of Chile’s capital city of Santiago.  \nThe Chilean mining industry is extremely well developed. The results obtained in previous campaigns confirm the presence of mantle-style copper mineralization.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/o72ixbmxy2wa1.png?width=1740&amp;format=png&amp;auto=webp&amp;s=bdb69170031d1bde8a69979993ec02395388eee2\n\n**Posted on behalf of Interra Copper Corp.**",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1682450272.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Shares copper investment content and promotional material without instructional content.",
    "composite_score": 2.0510299956639813
  },
  {
    "score": 19,
    "title": "How did you actually learn to read financial statements? I feel like I'm faking it.",
    "selftext": "I've been trying to become a more informed investor for the past year. Read some books (Intelligent Investor, One Up on Wall Street), watched YouTube videos, followed some courses.\n\nBut here's my honest confession: **I still don't really understand financial statements.**\n\nLike, I can look at a 10-K and identify revenue, net income, and basic stuff. But when it comes to:\n\n* Understanding what the numbers actually *mean* for the business\n* Spotting red flags in cash flow statements\n* Knowing if debt levels are concerning or normal for the industry\n* Calculating intrinsic value without second-guessing every assumption\n\n...I'm just lost. I end up Googling every other term and still feel like I'm missing something important.\n\n**For those of you who actually understand this stuff:**\n\n* How long did it take you to feel confident?\n* What resources actually helped (not just \"read the 10-K\")?\n* Do you calculate DCF models yourself or is there a better way?\n* How do you avoid analysis paralysis?\n\nI want to invest based on fundamentals like Buffett preaches, but the learning curve feels impossible sometimes. Any honest advice would be appreciated.",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1761929058.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Requests practical advice on understanding and reading financial statements.",
    "composite_score": 2.6547413360750842
  },
  {
    "score": 17,
    "title": "Debt - How people manage !!",
    "selftext": "Debt is not the enemy. The way you use it decides whether it builds your future—or breaks it.\n\nFor the poor: Debt funds consumption. Credit cards, EMIs, personal loans—money borrowed today for things that lose value tomorrow. The result? A cycle of repayments, little savings, and no real wealth creation.\n\nFor the rich: Debt funds growth. Loans for real estate, business expansion, or investments that generate income. Here, debt becomes a lever—multiplying wealth instead of draining it.\n\n👉 The difference is not money—it’s mindset.\n\nDebt used for consumption = liability.\n\nDebt used for assets = opportunity.\n",
    "subreddit": "InvestmentEducation",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1755765809.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/3lupnlj65ckf1/DASH_720.mp4?source=fallback",
        "has_audio": true,
        "height": 1280,
        "width": 720,
        "scrubber_media_url": "https://v.redd.it/3lupnlj65ckf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/3lupnlj65ckf1/DASHPlaylist.mpd?a=1770354157%2CYzJlZDQ5YTcwZGQxNzZiZDAxMTU2ZTY4NjFiZDM3ZDM4NzJkYWM3MTYwMDM0ZDJmYzYyOGUzOTQ2Y2RjNjJjNg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 63,
        "hls_url": "https://v.redd.it/3lupnlj65ckf1/HLSPlaylist.m3u8?a=1770354157%2CMzg1MGYyNzBjNTc4OTAxODMyMmFlZTI1OWM0Yzc3ZWQxMGI5MGQxMDg1MzY2NDMxNzJlMmIxZTlkNTJkZGI4Ng%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Explains a mental model of debt: debt used for assets is an opportunity, while debt for consumption is a liability.",
    "composite_score": 2.1763331324631374
  }
]