[
  {
    "score": 2042,
    "title": "Ho capito a cosa servono davvero i soldi",
    "selftext": "Per la seconda volta nella mia vita ho perso il lavoro. Non entro troppo nel dettaglio: grosso gruppo IT vende il ramo d'azienda in cui lavoro, con annesso obbligatorio trasferimento presso altra sede a 200Km da casa, a seguito del quale decido di rassegnare dimissioni. Nelle mie stesse condizioni un altro centinaio di persone coinvolte nella cessione, molti colleghi storici.\n\nFaccio un post perché questa esperienza mi ha insegnato a cosa servono davvero i soldi. Non servono per accumularli, non servono per godersi la vita, non servono per bullarsi su IPF.\n\nLa prima volta che ho perso il lavoro è stata nel 2007. Primo impiego, l'azienda aveva chiuso per fallimento, dopo che mi ero bruciato gli stipendi dei 2 anni precedenti in cazzate. Avevo un mutuo di €200k da pagare, mi ero trasferito da poco in casa nuova, mia moglie aveva ancora un contratto precario, i nostri genitori non potevano aiutarci. Di notte ho letteralmente passato settimane senza dormire, mentre mandavo CV, e il giorno giravo in lungo e in largo per colloqui. Siamo arrivati ad avere €50 sul conto corrente il 20 del mese.\n\nLa seconda volta che ho perso il lavoro è stata settimana scorsa. Abbiamo una casa e due macchine di proprietà, mutuo estinto, no debiti, circa €400k tra fondo di emergenza, liquidità e investimenti, e lo stipendio di mia moglie.\n\nVenerdì pomeriggio, l'ultimo giorno, ho mandato una mail di saluti a tutti. Ho inviato un bonifico ad un (ormai ex) collega giovane che sapevo per certo essere nella stessa mia situazione del 2007, con causale \"Me li restituirai quando potrai\". A tutte le persone della mia (ormai ex) squadra ho invece mandato contatti per fissare dei colloqui nei prossimi mesi, che ho raccolto durante ricerche su LinkedIn e conoscenze personali.\n\nPoi ho restituito il badge e sono andato a casa. Ho contato tutte le mie fortune, mi sono fatto prendere per il culo da mia moglie che ha detto che è la seconda volta che le tocca mantenermi col suo stipendio, le ho detto che pagherò il debito a letto, e ho portato i figli al campo sportivo per gli allenamenti.\n\nPer la prima volta in 5 anni non sono tornato a casa per finire quella mail importante o quel documento di progetto, mi sono messo a guardare i miei figli mentre si allenavano. Ho passato due ore di nulla assoluto, seduto sugli spalti.\n\nAlla fine della fiera, c'è un'unica cosa davvero preziosa ed è la tranquillità: per comprarla non ti serve spendere soldi, ti basta tenerli da parte, a questo servono. Così ho pensato che mi rialzerò come ho fatto l'altra volta. Ho  tante conoscenze e le userò per tornare sul mercato. Tra qualche settimana sentirò i miei ex colleghi per sentire come va e dar loro una mano se ne hanno bisogno. Si va avanti, senza ansie questa volta.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 2042,
    "downs": 0,
    "created_utc": 1710173986.0,
    "media": null,
    "is_video": false,
    "num_comments": 236,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.2176425396375
  },
  {
    "score": 1451,
    "title": "Si gode? Si gode.",
    "selftext": "Scrivo per condividere questa piccola rivincita contro i proprietari selvaggi di Milano e dintorni.\n\nContratto stipulato con la madre dell'attuale proprietaria a Giugno 2021, €800 al mese spese incluse, per un bilocale nell'hinterland milanese.\n\nLa Signora ahimè è venuta a mancare 2 mesi fa'. Dopo la perdita sono stato contattato per parlare della \"voltura\" a nome della figlia, la quale oggi ci è venuta a conoscere (convivo con la mia compagnia e il nostro gatto).\n\nPassati i convenevoli e un (credo e spero) sincero pianto da parte sua, ricordando la Mamma mi prepara la stocccata:\n\n\"Dati gli aumenti dell'energia e altri cazzi vari, purtroppo sono costretta ad aumentare il canone a 800+300 di spese\", così de botto +300 euri, senza se e senza ma, a noi che in 4 anni abbiamo risolto in autonomia i grossi problemi di umidità e sempre pagando nei tempi prestabiliti l'affitto. Senza mai fare spendere un quattrino alla madre anche quando le spettava per Legge.\n\nAl che gli faccio gentilmente notare che per un eventuale aumento dopo i primi 4 anni avrebbe dovuto comunicarmi questa volontà ben prima di un mese dalla scadenza. In questo caso invece ho la facoltà di rifiutare.\n\nGelo, sua chiamata rapida all'agente immobiliare di fiducia, conferma di quanto detto da me. Stretta di mano, game-set-match.\n\nArrivederci e ci risentiamo tra 4 anni. Cordialissimi!!! \n\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1451,
    "downs": 0,
    "created_utc": 1747589647.0,
    "media": null,
    "is_video": false,
    "num_comments": 187,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.0340455409959155
  },
  {
    "score": 1018,
    "title": "Vi ricordate di me?",
    "selftext": "Ciao a tutti,\nqualche tempo fa ho scritto qui per sfogarmi, raccontando un momento davvero difficile della mia vita. Lavoravo tramite agenzia, prendevo poco, non arrivavo a fine mese e mi sentivo perso, con solo pochi euro in tasca. Più di 500 persone hanno commentato, cercando di aiutarmi, di darmi un consiglio, un conforto, anche solo un po’ di umanità. E io, che allora mi sentivo solo e pieno di vergogna, non ho trovato la forza di accettare il vostro aiuto.\n\nMa oggi, volevo tornare qui. Non per chiedere, ma per ringraziare.\nGrazie a quell’ondata di umanità, di empatia, di parole gentili, qualcosa in me è cambiato. Ho trovato la forza per non mollare. Adesso ho un lavoro stabile, mi sono iscritto all’università, e sto lavorando ogni giorno per diventare una versione migliore di me stesso.\n\nNon dimenticherò mai quel momento buio, né le persone che – senza conoscermi – hanno cercato di illuminare la mia strada. Reddit per me non è stato solo un app, ma un luogo in cui ho riscoperto che il mondo è pieno di persone buone.\n\nGrazie, davvero. A chi c’era, a chi mi ha letto, a chi mi ha scritto.\nAvete fatto la differenza.\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1018,
    "downs": 0,
    "created_utc": 1750885612.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.616871063917911
  },
  {
    "score": 1017,
    "title": "Il mio fidanzato passa troppo tempo qui sopra.",
    "selftext": "Come da titolo, il mio fidanzato passa troppo tempo qui sopra, purtroppo bevendosi le stronzate che gran parte della gente spara qui su questo sub - tipo il fatto che sembra che tutti gli italiani con RAL over i 100k stiano qui a raccontarlo (e siano veramente tanti!) - e complessandosi di non aver raggiunto determinati traguardi “patrimoniali” a una certa età. Amore, se mi leggi, per favore, staccati da qua e confrontati con un campione statisticamente rilevante proveniente del mondo reale ⚰️",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1017,
    "downs": 0,
    "created_utc": 1752613129.0,
    "media": null,
    "is_video": false,
    "num_comments": 184,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8688336422022465
  },
  {
    "score": 979,
    "title": "Come l'ABF mi ha salvato dalla rovina",
    "selftext": "Ciao a tutti, a gennaio di quest'anno ho subito una truffa che mi ha sottratto circa 10.000 euro.\n\nLa cifra rappresentava per me (M26) quasi tutti i risparmi da parte e rischiava di mettermi in serissimi problemi economici, oltre avermi fatto andare in depressione. \n\nIl truffatore era riuscito a recuperare tutti i miei dati personali grazie a una chiamata con mio padre, che li ha forniti senza dubitare - si era spacciato per un dipendente di Revolut (uno dei miei conti). Tutto nato probabilmente da una nostra, mia e di mio padre, imprudenza sul mettere la carta su un sito non affidabile. \n\nAttraverso una serie di pagamenti i truffatori - che conoscevano tutti i dati della mia carta - mi hanno sottratto 10k. Tuttavia, questi pagamenti erano stati effettuati senza la mia autorizzazione (banalmente la solita impronta digitale su notifica app) e subito disconosciuti da me, con denuncia allegata.\n\nIl reclamo era stato respinto da Revolut con motivazioni francamente assurde, ma grazie a Reddit vengo a conoscenza dell'Arbitro Bancario Finanziario (ABF). Mentre l'avvocato mi aveva chiesto quasi 2.000€ per procedere con l'ABF ho fattivo tutto sul sito che è ben organizzato, spiegato e funziona bene. Tempo qualche mese e ho riavuto la quasi totalità del mio denaro risarcito, oltre a un rimborso di 750€ a titolo di risarcimento danni e i 20€ per il ricorso all'ABF.\n\nSpesso si parla male dell'Italia, la nostra burocrazia e dell'arretratezza finanziaria. Ma l'ABF è uno strumento incredibile di cui dovremmo andare molto fieri ",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 979,
    "downs": 0,
    "created_utc": 1758804822.0,
    "media": null,
    "is_video": false,
    "num_comments": 127,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.787331060516428
  },
  {
    "score": 946,
    "title": "Un conoscente è morto. Ha risparmiato e investito per anni",
    "selftext": "Semi off topic ma questo sub potrebbe essere interessato.\n\nPremessa: il senso del post non è “investire non ha senso”, ma solo un piccolo reminder di come va la vita.\n\nUn conoscente, amico stretto di un mio amico, è morto. 43 anni, ha sempre fatto la cosa giusta. Paesino del sud Italia, da famiglia poco colta e con pochi mezzi. Sempre studente top, all’uni borse di studio per triennale in famosa uni italiana, master, sempre con borsa di studio in nota università inglese mentre lavorava come cameriere per pagarsi da vivere. Sempre voti top.\n\nSi è fatto tirocini mentre lavorava in call center, come cameriere, portando le pizze, dando ripetizioni… tutta la gavetta fatta nel suo settore, e quando aveva circa 31-32 anni era già manager. Con la sua lei hanno sempre risparmiato e investito. Quando l’ho conosciuto la prima volta, aveva circa 33-34 anni e già guadagnava sui 3k netti (dieci anni fa…). Lei era sui 1600. In pochi anni lui arrivò a 5k e lei vinse concorso per dirigenza e stava sui 3k.\n\nArrivato a 43 anni si è comprato, con lei, casa bella al centro di Roma. Casa vacanze in montagna. Hanno sempre risparmiato su tutto su sua iniziativa, in tutte le piccole cose. \n\nCi ho parlato a volte di finanza personale, risparmiavano 5-6k al mese dopo aver saldato entrambi i mutui. Lui voleva il FIRE, obiettivo lasciare il lavoro e vivere di rendita entro i 50 anni. \n\nCosì, all’improvviso, non c’è più. Tutti i risparmi. Tutti i sacrifici. La moglie ci ha chiesto aiuto su cosa fare con i PAC, ETF, ecc. \n\nNon si è goduto un cazzo, dopo una vita di sacrifici.\n\nSolo una riflessione, in un sub di risparmiatori e investitori (io per primo).",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 946,
    "downs": 0,
    "created_utc": 1756498447.0,
    "media": null,
    "is_video": false,
    "num_comments": 188,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.834580881089895
  },
  {
    "score": 949,
    "title": "Pago tante tasse, e sono contento",
    "selftext": "**Contesto:** famiglia di 3 persone, alto reddito (io \\[M40\\] sono uno dei fortunati in full remote con stipendio internazionale, mia moglie \\[F38\\] lavora in sales e guadagna bene pure lei). Entrambi siamo dipendenti a tempo indeterminato e negli ultimi 4 anni abbiamo pagato più di €400k in IRPEF e altri €200k di contributi INPS (includendo i contributi lato azienda).\n\n**E ne sei contento?**  \nSì.\n\n**Non preferiresti pagare meno tasse?**  \nSì, se ci fosse un modo per sostenere una società civile e assistenziale pagando tutti meno tasse, lo preferirei.\n\n**Facile parlare per te con il tuo \"stipendio internazionale\"?**  \nVero. Ma ho sempre pagato la mia parte di tasse con molta serenità. Quando prendevo 25k e pagavo 7k, quando prendevo 50k e pagavo 20k e anche quando prendevo 90k e pagavo 40k.\n\n**Come fai ad essere contento se metà di quello che guadagni è \"pizzo di stato\"?**  \n1. Il risparmio non è proporzionale al reddito. Diciamo che per vivere (non sopravvivere) uno abbia bisogno di 1.500/mese (18k/anno). Questo significa che una persona con un reddito netto di 20k potrebbe risparmiare 2k/anno, mentre una persona con reddito netto di 30k potrebbe risparmiare 12k/anno. Sono contento che chi ha una capacità di risparmio diverse volte più alta sia tassato significativamente di più.  \n2. Mi piace vivere in uno stato assistenziale. Salute, sanità, sicurezza, giustizia, sono tutte cose che diamo per scontate perché siano nati e abbiamo vissuti qui ma sono molto costose. Negli ultimi anni lo stato ha dovuto tagliare molte spese in questi ambiti a causa di spese folli nei decenni passati. Ridurre le tasse, o continuare questa narrativa che le tasse sono sbagliate, non aiuterà ad aumentare questi servizi.\n\n**Perché hai deciso di ammorbarci con queste domande che nessuno ti ha chiesto?**  \nPerché ho letto qualche giorno fa una persona poco più che ventenne che si vantava di fatturare 60k o più in P.IVA e pagare 4k o simile di tasse. Una persona che ha introiti per 5k al mese e che riteneva corretto che la società in cui opera abbia diritto a soli 400€/mese. Una persona che, quando qualcuno le ha fatto notare che la tassazione agevolata sarebbe stata temporanea, ha risposto che \"non era certo uno stronzo da rimanere in italia a pagare le tasse\". Quindi ho deciso di scrivere questo post per dirvi che io sono uno stronzo, e ne sono contento.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 949,
    "downs": 0,
    "created_utc": 1737043232.0,
    "media": null,
    "is_video": false,
    "num_comments": 427,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.983445489795434
  },
  {
    "score": 853,
    "title": "Ho creato TuttoCalcolato.it: un sito con decine di calcolatori gratis (senza ads, senza tracking)",
    "selftext": "Ciao a tutti 👋  \nHo sviluppato [**TuttoCalcolato.it**](https://tuttocalcolato.it), una piattaforma che raccoglie calcolatori di ogni tipo: finanza, salute, sport, utility, educazione e via dicendo.\n\nQualche nota importante:\n\n* Non è un “progettino fatto in due giorni” → ci ho lavorato per mesi (e NO, non è fatto con Lovable 😅).\n* È tutto **gratis**, senza pubblicità e senza tracking.\n* Non ci guadagno nulla: è un progetto personale a cui tengo, nato dal desiderio di avere qualcosa di mio da portare avanti.\n\n👉 So che alcuni calcolatori (tipo tasse P.IVA o stipendio netto) non sono ancora precisissimi. Per questo mi piacerebbe coinvolgere studi di commercialisti o professionisti che abbiano voglia di darmi una mano a renderli più affidabili. Ovviamente, chi mi aiuterà verrà menzionato direttamente nel calcolatore.\n\n**L’idea è continuare ad ampliare la piattaforma con strumenti utili per tante persone (non solo per nicchie specifiche). Ad esempio: un calcolatore pensionistico sarebbe super utile, ma al momento è troppo complesso e richiederebbe la collaborazione di molti esperti. Magari un domani.**\n\n  \nPer ora vi chiedo due cose:\n\n1. Feedback sincero su quello che c’è già.\n2. Idee per nuovi calcolatori che vi sarebbero davvero utili nella vita quotidiana.\n\nGrazie se siete arrivati a leggere fino a qui 🙏 cercherò di rispondere a tutti nei commenti!\n\nhttps://preview.redd.it/2lkz8b8sa4mf1.png?width=1420&amp;format=png&amp;auto=webp&amp;s=7e780ff80931da00fb4de2718325c0fb6dd01d4f\n\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 853,
    "downs": 0,
    "created_utc": 1756543114.0,
    "media": null,
    "is_video": false,
    "num_comments": 223,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.849081879856086
  },
  {
    "score": 819,
    "title": "Vi sembra normale una tassazione così folle?",
    "selftext": "In Italia riuscire ad arrivare a 2k netti come stipendio è già un impresa, da circa 1 anni ho raggiunto la fatidica soglia della RAL a 50k, circa 50345 precisamente, e quello che più mi fa incazzare è che ogni euro guadagnato over 50 sarà tassato al 46/47%.(43 scaglione IRPEF + add comunali e regionali)\nVi sembra normale? Per passare da 2450 a 3k netti da 50k dovrò arrivare a 65k. \nA me sembra una gran follia, paese di smidollati e poveri, ci credo con queste tasse come si fa a mettere da parte grosse cifre?\nScusate lo sfogo ma quando ci vuole ci vuole.\nLa cosa più triste? Che solo 1% dei contribuenti (su quasi 43 milioni di persone) dichiara tra 60k e 70k!\nSiamo un paese talmente di poveri che con 3k netti diventi tra la top 1% dei contribuenti in Italia che guadagnano di più! Circa 430k di persone si 43 milioni\nTi trattano come fossi un ricco ma con 3k netti sei una persona normalissima.\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 819,
    "downs": 0,
    "created_utc": 1730508105.0,
    "media": null,
    "is_video": false,
    "num_comments": 426,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.934027789896229
  },
  {
    "score": 794,
    "title": "Ho lavorato nel mondo dei mutui per un anno. È molto peggio di quello che pensate.",
    "selftext": "Ciao a tutti, \n\noggi volevo parlarvi di una cosa che da mesi mi fa ribollire il sangue: il mondo dei consulenti del mutuo. Ho lavorato in quel settore per un anno e da quando ho smesso, ho cominciato a realizzare quanto l’intero sistema sia marcio, manipolativo e basato su pratiche che definire poco etiche è un eufemismo. \n\nParlando con i vari consulenti dei mutui, sentirete dire che è la persona che vi aiuta a trovare la soluzione migliore per voi, che lavora notte e giorno per farvi ottenere condizioni vantaggiose, che negozia i tassi o che addirittura hanno dei tassi agevolati (gran cazzata) ma la realtà è che nella maggior parte dei casi vi sta solo vendendo un prodotto spinto da convenienze personali o aziendali. \n\nIl loro lavoro, tolto l'inoltro di documenti via email, è minimo. Tutto il resto è teatro: pressione psicologica, atteggiamenti da salvatore della patria e una recita continua per giustificare commissioni assurde. E il peggio è con le polizze: vi vendono assicurazioni \"obbligatorie\" (a volte nemmeno lo sono) che costano anche il triplo rispetto a soluzioni sul mercato. \n\nPerché? Perché lì fanno i veri soldi. In certi ambienti, metà della formazione ai nuovi consulenti ruota attorno a come piazzare queste polizze con tecniche persuasive molto borderline e manipolative. Qualche bell’esempio sono le classiche:  se non accetti, la banca potrebbe rifiutare il mutuo, se non fai questa polizza vita, il mutuo non passa l’istruttoria.., senza la nostra polizza il tasso potrebbe aumentare e davvero tante altre scuse.\n\n Se non si fosse capito,  il consulente non è dalla tua parte: è pagato in base a quale banca ti porta, e ogni banca paga provvigioni diverse. Indovina dove ti porteranno? Spoiler: non dove conviene a te, ma dove conviene a loro o alla loro società di intermediazione. E non parliamo delle polizze vita o incendio/scoppio (quest’ultima sì, obbligatoria per legge): anche lì spesso ti propinano assicurazioni legate alla loro rete, con costi gonfiati e scarsa trasparenza.\n\nIl lavoro vero lo fa la banca che si occupa di quasi tutto: il consulente fa da passacarte e prende la commissione. In questo schifo ci includo anche le grandi piattaforme come MutuiOnline: nessuna trasparenza sui costi reali, conflitti d’interesse evidenti, e alla fine anche loro lavorano per generare lead da girare alla banca, non per dare a te la miglior scelta. \n\nA forza di vedere tutto questo ho deciso di iniziare un progetto indipendente per aiutare le persone a confrontare i mutui in modo chiaro e senza commissioni nascoste. È ancora una beta, ho mille dubbi se sia troppo tecnico per chi non è del settore, ma se vi va nei commenti metto il link, mi farebbe piacere un feedback sincero. Perché davvero,mi stanno altamente sulle palle questi pseudo venditori di schifezza. \n\nC'è qualcun altro qui che ha avuto esperienze simili con consulenti o piattaforme “indipendenti”?\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 794,
    "downs": 0,
    "created_utc": 1750403703.0,
    "media": null,
    "is_video": false,
    "num_comments": 443,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.959058613713781
  },
  {
    "score": 788,
    "title": "Se porti il contante in banca ti trattano da criminale",
    "selftext": "Salve a tutti, vi racconto c'ho che è successo oggi in una banca di paese (15k anime). Spero possiate darmi un vostro giudizio.\n\nOggi verso le 11 sono andato in una banca locale, sono correntista da quando ho compiuto 18 anni (ora 21) per versare dei soldi e fare un bonifico con parte di questi. \n\nLa somma totale depositata è poco sopra ai 4k e con tutta la tranquillità del mondo sono andato allo sportello e ho tirato fuori i soldi. Alla vista dei denari la cassiera si è subito allarmata e ha chiamato la direttrice, mi fanno un controllo sul mio conto corrente (ho poco più di 2k e il resto in un PAC esterno alla banca). Viene da me tutta preoccupata e mi chiede da dove venissero i soldi con un fare molto sospetto e con la certezza che venissero da cose losche. Gli dico che questi sono i risparmi provenienti dai regali di compleanno di questi anni e che adesso voglio mettere in banca. Lei subito mi ferma chiedendomi se fossero soldi ''puliti'' e che dovrebbe avvertire la gdf facendo una segnalazione ma per questa volta chiude un occhio......\n\nIo rimango appietrito dalla situazione e procedo a versare i soldi, una volta versati faccio il bonifico verso un conto revolut e da quel momento RICOMINCIA il panico perché l'Iban inizia con LT. Mi fanno 1000 domande a cui rispondo si e no(anche perche sono cazzi miei di come gestisco i miei soldi). Dopo aver messo come causale il mio nome e cognome e il codice transazione (anche li mille menate) mi mandano via trattandomi come uno spacciatore/ragazzino ritardato che vende il fumo.\n\nNon ho mai commesso nulla di illegale e la provenienza di quei soldi è completamente lecita, ma onestamente capisco perché la nostra generazione preferisce le banche online senza rapporti personali con le ritardate allo sportello. Spero che il mio sia un caso isolato e buona giornata a tutti",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 788,
    "downs": 0,
    "created_utc": 1746196450.0,
    "media": null,
    "is_video": false,
    "num_comments": 320,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.855329519411856
  },
  {
    "score": 762,
    "title": "Bar di paese - edizione 2025",
    "selftext": "Ciao a tutti, l’anno scorso avevo pubblicato il   Sankey della mia attività commerciale, a grande richiesta lo ripropongo anche quest’anno. Specifico che:\n- si tratta di un bar di un piccolo paese del Nord Ovest\n- sono proprietario del bar, non pago affitti e non ho dipendenti\n- tutte le cifre sono comprensive di IVA per semplicità \n- risponderò a tutte le vostre domande tranne quelle troppo “personali” \n- il bilancio 2024 si era chiuso con incassi per 83k e utile 23k\n- si, accetto il bancomat e tutte le carte di credito, per qualunque importo \n\nRimango a vostra disposizione! \n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 762,
    "downs": 0,
    "created_utc": 1767421674.0,
    "media": null,
    "is_video": false,
    "num_comments": 330,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.862438534842739
  },
  {
    "score": 747,
    "title": "L'avete notato? Nel gruppo si sono infiltrate le banche.",
    "selftext": "Quanti post di bancari e promotori stiamo vedendo oggi, ieri e nell'ultimo periodo? Mai visti così tanti.\n\nE i commenti di alcuni utenti poi, che spingono le gestioni attive e le banche dicendo che \"loro\" ad esempio le preferirebbero ai consulenti indipendenti.\n\nAlcuni utenti l'hanno fatto notare. Adesso lo dico anche io, perché la cosa è diventata PALESE.\n\nSecondo me una banca in particolare ha incaricato un'agenzia di fare questo lavoro di digital PR, se così vogliamo chiamarlo. E sarebbe stato molto bello per avere un confronto, se non fosse che ogni volta questi post o commenti spudorati SPINGONO DISINFORMAZIONE.\n\nFra l'altro, sempre come fatto notare da altri utenti, stanno usando fake upvotes e downvotes nei loro post. All'inizio non ci credevo, ma se guardate la quantità di upvote che quei post e alcuni commenti hanno è completamente sbilanciata dalla media del gruppo, eh si che in teoria qui tutti dovrebbero, giustamente dico, \"odiare\" le banche. Com'è che invece hanno centinaia di upvotes mentre poi nei commenti per lo più sono sfondati di commenti negativi (salvo quello che poi comprano e spingono)?\n\nVe ne siete accorti anche voi?",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 747,
    "downs": 0,
    "created_utc": 1752510176.0,
    "media": null,
    "is_video": false,
    "num_comments": 185,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.74365806997342
  },
  {
    "score": 731,
    "title": "!!!!IPF IN CRISI!!!!",
    "selftext": "dopo le dichiarazioni del prof Coletti: ‘spendete più di €80 per vita sociale e di €150 per cura personale’ una nube di terrore è piombata su IPF. Community nel caos, portafogli svuotati per comprare una pizza margherita e una yaris CROSS. Addirittura un pazzo ha comprato due paia di scarpe in un anno, spese TOTALMENTE fuori budget per l’utente medio.\n\nScherzo amici, ma dopo che l’ha detto il mio primo pensiero è andato a voi 🫶🏻\n\nBuona serata a tutti\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 731,
    "downs": 0,
    "created_utc": 1761231969.0,
    "media": null,
    "is_video": false,
    "num_comments": 178,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.7184375965483385
  },
  {
    "score": 725,
    "title": "Inizierò a pretendere gli scontrini",
    "selftext": "Sabato, dopo l'ennesima volta in cui un ristoratore non mi ha fatto lo scontrino ho riflettuto e sono arrivato alla conclusione che sono stanco di dover lasciare il 30% del mio stipendio in tasse quando ristoranti, bar, officine e chi più ne ha più ne metta non fanno uno scontrino neanche a morire. D'ora in poi li chiederò espressamente. Cosa ne pensate? Qualcuno di voi lo fa già?\nPs. Abito nel nord Italia",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 725,
    "downs": 0,
    "created_utc": 1737485954.0,
    "media": null,
    "is_video": false,
    "num_comments": 298,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.803772214862309
  },
  {
    "score": 716,
    "title": "Mio marito finge di lavorare",
    "selftext": "Buongiorno a tutti. \n\nRubo l'account del prof. per presentarvi una situazione particolare e la presento a voi perché so che mio marito frequenta attivamente questo sub.\n\nSono quasi completamente sicura che mio marito stia fingendo di lavorare. Ogni mattina si veste con la cravatta ed esce prima che esco io, nonostante mi abbia detto che fa un lavoro full remote... e poi da quando in qua un informatico mette la cravatta al lavoro? Io poi sto al lavoro 12 ore per guadagnare abbastanza per pagare l'affitto e quando torno noto che Netflix è andato avanti di 4 stagioni...\n\nLa cosa che mi preoccupa però è il patrimonio. Lui possiede 600k, che gli sono stati regalati da mia madre, ma spende 2500 euro al mese. Ho trovato dei fogli pieni di calcoli a matita in cui cerca di determinare quante cedole e dividendi prenderà. Ha fatto 20 simulazioni e anche con inflazione zero finiranno sempre prima di percepire la pensione. Per altro ha scelto tutti strumenti a distribuzione e sta pagando un mucchio di tasse!\n\nVi prego aiutatemi, per sicurezza sto insegnando a nostro figlio di 8 anni a fare il suo lavoro, se continua così dovrò fargli fare lavori online a nome di mio marito. A proposito, da che età si può aprire partita iva?\n\n\nPS per quelli che mi scrivono preoccupatissimi, questo è un trend di Reddit per spiegare in modo umoristico all'autore di un ALTRO post quali sono le cose che non vanno. E anche il mancato congiuntivo è voluto",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 716,
    "downs": 0,
    "created_utc": 1713504870.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.514760629944767
  },
  {
    "score": 664,
    "title": "Mia madre entra in banca per comprare BTP. Ne esce con una polizza vita",
    "selftext": "Mercoledì mia madre (75 anni, vedova da poco) è andata in filiale Unicredit per reinvestire circa 50.000€, soldi provenienti dalla scadenza di un BTP acquistato anni fa da mio padre. Un amico le aveva consigliato di comprare altri BTP, quindi si è presentata dicendo espressamente che voleva investire in titoli di Stato. Oggi mi chiede di controllare se è tutto a posto. Apro l’app di Unicredit e trovo:\n\n* 20.000€ in AMUNDI INVESTIMENTO TRAGUARDO GARANTITO 11/26 (fondo)\n* 30.000€ in una POLIZZA VITA chiamata “My Selection”\n\nZero BTP. Solo prodotti ad alta commissione.\n\nSono furioso. Mia madre non ha alcuna competenza finanziaria e si è fidata della banca di cui era cliente con mio padre da 30 anni.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 664,
    "downs": 0,
    "created_utc": 1746912857.0,
    "media": null,
    "is_video": false,
    "num_comments": 183,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.690230556807873
  },
  {
    "score": 660,
    "title": "In Italia il job hopping non è più permesso: lo Stato ti vuole fermo e zitto",
    "selftext": "Fino al 2024, se cambiavi lavoro e il nuovo andava male, avevi comunque la NASpI perché ti agganciavi ai contributi già versati.\n\nDal 1° gennaio 2025 non più:\n- Se ti dimetti volontariamente e nel nuovo posto ti cacciano in prova (12 settimane) → non raggiungi le 13 settimane richieste.\n\nRisultato: niente NASpI, anche se hai alle spalle anni di contributi.\n\nIl messaggio è chiarissimo:\nNon rischiare, non crescere, non cambiare.\nAspetta la scadenza del contratto o fatti licenziare.\n\nQuesta norma non tutela i lavoratori, li incatena.\nE chi sperava in un’Italia più dinamica sul lavoro può scordarselo: il job hopping, qui, è morto.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 660,
    "downs": 0,
    "created_utc": 1756234791.0,
    "media": null,
    "is_video": false,
    "num_comments": 313,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.713666283522247
  },
  {
    "score": 621,
    "title": "Lo stipendio medio italiano è un insulto alla parola “merito”",
    "selftext": "In un paese dove il full time vale 1.100 euro, e i mutui sono bloccati a chi guadagna meno di 1.600, possiamo ancora fingere che “se ti impegni ce la fai”?\n\nI dati lo dicono chiaramente: i salari sono bassi, il costo della vita è salito, e il risparmio è un miraggio.\n\nChi ci riesce, spesso ha un aiuto familiare. Gli altri restano indietro.\n\nMa continuiamo a chiamarlo “fallimento personale”, per non parlare del vero problema: un mercato del lavoro che non premia né l’impegno né la competenza.\n\nA voi com’è andata?",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 621,
    "downs": 0,
    "created_utc": 1748351100.0,
    "media": null,
    "is_video": false,
    "num_comments": 402,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.823942907761373
  },
  {
    "score": 616,
    "title": "Rant: La ragazza che guadagna 140k ha ragione, siete voi gli stupidi/invidiosi",
    "selftext": "**VI PERDETE SULLO 0,1% DI TER E NON VEDETE IL BUCO NERO INPS? LA 140K di RAL CHE VALUTA L'ESPATRIO HA CAPITO MEGLIO DI MOLTI**\n\nAlcuni giorni fa una ragazza ha fatto un post in cui dichiarava di voler emigrare in seguito a dei video del drindrin sulla situazione economica italiana e sul sistema pensionistico. La maggioranza dei commenti si è scagliata contro questa ragazza con due argomentazioni: la prima è che una persona con quel reddito non dovrebbe preoccuparsi del sistema pensionistico perché può accumulare molto capitale velocemente, e la seconda era per il ragazzo che aveva la partita iva forfettaria (cosa estremamente stupida, stava parlando di lei ed è il fidanzato e non suo marito, per due lire di tasse risparmiate da un soggetto terzo avete scaricato una discreta quantità di bile, ma a qualcosa dovevate pure aggrapparvi)\n\nMa adesso passiamo alle cose serie, un'analisi basata sui numeri del perché chi guadagna bene in Italia ha solide ragioni economiche per guardarsi intorno. Per chi commenta senza guardare il quadro generale.\n\n# Premessa: La Strana Ossessione per le Commissioni vs. i Problemi Reali\n\nSeguo spesso le discussioni qui, su subreddit dove si analizza al microscopio lo **0,1% di TER in più su un ETF**, dove si ottimizza il portafoglio con una precisione quasi maniacale. È un'attenzione al dettaglio lodevole, in teoria. Ma poi vedo le reazioni a una persona che, guadagnando 140k lordi, fa **due conti concreti** sul sistema pensionistico e fiscale italiano – un sistema con criticità enormi – e valuta l'emigrazione, venendo etichettata come \"egoista\" o \"privilegiata\".\n\nC'è qualcosa che non torna. Come si può essere così attenti alle briciole percentuali delle commissioni e poi ignorare (o criticare chi ne parla) le **decine di migliaia di euro all'anno** che un sistema come quello italiano può sottrarre, specialmente ai redditi più alti, tra tasse e incertezze future? Sembra quasi che si perda di vista la \"big picture\". Questa analisi usa i dati (ISTAT, MEF, Bankitalia, RGS, OCSE, UPB) per spiegare perché la valutazione di quella contribuente non è un capriccio, ma una **riflessione economicamente fondata**, che forse meriterebbe più attenzione di un decimo di punto su un ETF.\n\n# 1. Demografia Critica e la Voragine INPS: Un Problema Strutturale che Va Oltre il TER\n\nPartiamo dai fondamentali, spesso trascurati. L'Italia ha una **demografia estremamente critica** (dati ISTAT): indice di vecchiaia record (193!), natalità bassissima (1,24 figli/donna), rapporto lavoratori/pensionati in costante peggioramento. Questo mette sotto stress enorme un sistema pensionistico a **ripartizione**. Non è un'opinione, è matematica.  \nInfatti, la gestione previdenziale dell'INPS presenta un **deficit strutturale significativo**, e come viene coperto questo deficit, insieme alle prestazioni assistenziali gestite dall'INPS? Con **massicci trasferimenti dallo Stato**: cifre che ormai superano i **130-140 miliardi di euro annui**. Per dare un ordine di grandezza, parliamo di un importo **paragonabile o superiore all'intero gettito IRPEF**. Una quota enorme delle tasse pagate da tutti (e in misura maggiore da chi ha redditi alti) serve a sostenere un sistema che, per ragioni demografiche e strutturali, non si regge sulle proprie gambe. E le proiezioni future (RGS, EU Ageing Report) indicano un **peggioramento inevitabile** nei prossimi decenni.\n\nQuindi, chi ha un reddito elevato non si preoccupa solo della propria pensione futura (che sarà probabilmente modesta rispetto ai contributi), ma anche del fatto che le sue tasse **oggi** sono essenziali per tappare falle crescenti, e che la pressione fiscale futura potrebbe aumentare proprio per questo. È una preoccupazione sistemica, non solo individuale.\n\n# 2. La Pressione Fiscale Complessiva: Non Solo IRPEF\n\nSentir dire \"guadagna tanto, non si lamenti\" non coglie il punto. È proprio per via del reddito elevato che si subisce una pressione fiscale particolarmente forte. I dati MEF mostrano che il **15% dei contribuenti più abbienti versa quasi il 63% dell'IRPEF totale**. Chi guadagna 140k è in pieno in questa fascia. L'aliquota marginale effettiva (METR) su quelle cifre supera facilmente il 50-60%, rendendo ogni euro aggiuntivo guadagnato molto \"costoso\" in termini fiscali.\n\nMa il quadro è incompleto se ci si ferma all'IRPEF. Bisogna considerare il carico totale:\n\n* **IVA al 22%**\n* **Imposte sui Capital Gain al 26%**\n* **IMU, Accise elevate sui Carburanti, Bolli, Tasse sulle transazioni immobiliari...**\n\n1. Lo Squilibrio del Sistema: Contribuenti Netti vs. Beneficiari Netti\n\nL'analisi dell'Ufficio Parlamentare di Bilancio (UPB) sul **saldo fiscale netto** (tasse pagate - servizi/trasferimenti ricevuti) evidenzia uno squilibrio notevole: circa il **65% delle famiglie italiane risulta beneficiario netto**, ricevendo più di quanto versa. Il sistema è sostenuto dal restante 35%, all'interno del quale i contribuenti con redditi medio-alti e alti hanno un saldo netto negativo particolarmente significativo (stimabile in 40-50k€ annui per un reddito di 140k). Questo dato aiuta a capire la prospettiva di chi sente di contribuire massicciamente a un sistema da cui riceve, in proporzione, molto meno.\n\n# 4. Il Confronto Economico: Quanto \"Costa\" Restare?\n\nVediamo l'impatto economico concreto, ipotizzando un realistico +25% di stipendio lordo all'estero (es. 170k CHF in Svizzera per un precedente 140k€).\n\n* **ITALIA:** Lordo 140k€ -&gt; **Netto \\~74.800€/anno**. Pensione basata su sistema INPS critico.\n* **SVIZZERA (Zurigo):** Lordo 170k CHF -&gt; **Netto \\~117.800€/anno**. Pensione mista con solida capitalizzazione personale. **DIFFERENZA NETTA: +41.300€/anno.**\n* **DUBAI:** Lordo 140k€ -&gt; **Netto \\~130.000€+/anno**. Pensione basata su TFR locale e investimento privato. **DIFFERENZA NETTA: +53.500€/anno.**\n* **AUSTRALIA:** Lordo 140k€ (\\~230k AUD) -&gt; **Netto \\~88.000€/anno**. Pensione robusta a capitalizzazione (Superannuation). **DIFFERENZA NETTA: +11.500€/anno**(con sistema previdenziale molto più sicuro).\n\nQuesti numeri evidenziano un **vantaggio economico netto annuo che va da oltre 11.000€ a più di 53.000€**. Anche considerando il maggior costo della vita, il margine è spesso considerevole. Inoltre, la **struttura del sistema pensionistico**estero (spesso con capitalizzazione personale) offre una sicurezza e trasparenza che il sistema a ripartizione italiano, data la demografia, non può garantire. A lungo termine, investendo la differenza netta, si parla di **centinaia di migliaia, se non oltre un milione di euro**, di potenziale ricchezza accumulata in più.\n\n# 5. Il Circolo Vizioso e le Prospettive Future\n\nSi crea un circolo vizioso: alta tassazione e incertezza spingono i contribuenti più mobili a emigrare -&gt; la base imponibile si erode -&gt; aumenta la pressione sui rimanenti o si tagliano servizi, incentivando ulteriore emigrazione. Il debito pubblico elevato (140%+) e il buco INPS richiederanno interventi futuri, ed è difficile immaginare che questi non si traducano, almeno in parte, in una maggiore pressione fiscale su chi già contribuisce di più.\n\n# Conclusione: ribadiamo il concetto, gran parte degli italiani letteralmente parassita il welfare, è ovvio che se uno ha un reddito da 30k lordi o meno e magari si sente un kulako si incazza leggendo quel post. Ma in realtà di tasse non paga un cazzo e pensa di essere lui quello vessato ma in realtà ha tutta la convenienza del mondo a rimanere in Italia. Sono le persone produttive che hanno tutta la convenienza del mondo ad andarsene, e leggere che uno non dovrebbe farsi problemi a regalare 4-5 milioni mal contati tra tasse e rendimento di capitale risparmiato dalle tasse fa piuttosto ridere.\n\nEdit: Non sono la ragazza del post originale",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 616,
    "downs": 0,
    "created_utc": 1746221124.0,
    "media": null,
    "is_video": false,
    "num_comments": 514,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.7686887785538365
  },
  {
    "score": 589,
    "title": "Utente di ipf esci allo scoperto!!",
    "selftext": "Ho letto questa storia, che vi lascio poco sotto, credo proprio che tu sia qua tra noi, palesati:\n\nMi chiamo Giulia, ho 36 anni. \nSono uscita con uno che al primo appuntamento mi ha chiesto l’ISEE.\n\nTutto inizia su Tinder. Profilo normale: foto in camicia, frasi tipo “Cerco una persona con cui costruire, non perdere tempo”.\nPerfetto, penso.\nMatchiamo. Chat educata.\nMi propone un aperitivo:\n— «Conosco un posticino tranquillo a Mestre. Ti passo a prendere io.»\nOre 19, arriva puntuale.\nGolf grigia, tappetino Hello Kitty. Io non chiedo.\nSaliamo.\n\nNel tragitto fa tre domande in sequenza:\n 1. Quanti fratelli hai?\n 2. Hai il mutuo o sei in affitto?\n 3. Hai mai fatto un investimento in ETF?\n\nIo rido, pensavo scherzasse. Non scherzava.\n\nArriviamo. Il “posticino tranquillo” è un’enoteca con menù da 12 pagine, ma lui prende una sola bruschetta e due calici d’acqua naturale.\n\nPoi, con la naturalezza di uno che ti chiede se ti piacciono i cani, mi fa:\n— «Comunque, se la cosa dovesse andare avanti, per me è importante confrontarsi sull’ISEE. Così si evitano sorprese.»\nIo:\n— «Scusa?»\nLui:\n— «È successo che uscivo con una ragazza, poi ho scoperto che prendeva il Reddito. Mi sono sentito usato.»\nIo deglutisco la mia burrata da 8 euro.\nLui continua:\n— «Comunque se vuoi mandarmelo in pdf, c’è anche l’IBAN per partecipare alle spese.»\n\nAlla fine del “date” mi riaccompagna, ma si ferma due vie prima.\n— «Così risparmio benzina per il ritorno. Sai com’è… con i prezzi di oggi.»\n\nL’ho bloccato prima ancora di chiudere la portiera.\n\nOra ogni volta che sento la parola “ISEE” mi parte un tic all’occhio.\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 589,
    "downs": 0,
    "created_utc": 1759078594.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.511987659470027
  },
  {
    "score": 581,
    "title": "Perché tutti noi dovremmo ringraziare la prof.ssa Fornero (e qualcuno dovrebbe scusarsi).",
    "selftext": "La riforma Fornero è stata per anni demonizzata, ma i numeri raccontano un’altra storia.\n\n📊 Dal 1995 al 2011 la spesa pensionistica italiana cresceva del 7% all’anno, una delle più alte in Europa. Dopo la riforma, la crescita si è ridotta a +1,8%, il dato più basso tra le grandi economie.\n\n💶 Grazie a questa stretta, la spesa pensionistica in rapporto al PIL è rimasta stabile: dal 15,4% nel 2011 al 15,5% oggi. Senza la riforma sarebbe esplosa, costringendo lo Stato ad aumentare ancora le tasse o il debito.\n\n👉 E ricordiamoci: l’Italia ha già oggi la spesa pensionistica più alta d’Europa (15,5% del PIL).\n\n⚖️ Ogni volta che parliamo di cuneo fiscale – tra i più alti al mondo – o di stipendi netti troppo bassi, non possiamo dimenticare che metà di ciò che le aziende spendono per un lavoratore finisce in contributi e tasse… soprattutto per finanziare le pensioni.\n\n📉 E no, i pensionati italiani non sono i più poveri: secondo Istat, la povertà assoluta è molto più diffusa tra giovani e famiglie con figli.\n\nForse allora dovremmo smettere di insultare la Fornero e cominciare a riconoscere che senza quella riforma oggi saremmo messi molto peggio.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 581,
    "downs": 0,
    "created_utc": 1762510947.0,
    "media": null,
    "is_video": false,
    "num_comments": 394,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.708221532463119
  },
  {
    "score": 569,
    "title": "Ieri ad un pranzo coi miei amici mi sono sentito un pezzente",
    "selftext": "Al tavolo avevamo un età compresa tra i 27- 29 anni.\nA una certa alcuni dei miei amici hanno cominciato a parlare della propria situazione finanziaria:\n\n- uno diceva di guadagnare poco (prende 1900 netti al mese) ha una macchina nuova comprata con l'aiuto dei genitori e diceva di avere 60 k da parte, ma al contempo nessuna voglia di lasciare il nucleo famigliare.\n\n- uno gestisce l'officina di famiglia ereditata dal padre morto prematuramente. Non ha però voluto rivelare il proprio fatturato quando gli è stato chiesto quanti soldi faceva.\n\n-un'altro fa l'operaio metalmeccanico. anche lui non ha voluto rivelare i suoi guadagni, per ora vive coi genitori ma tra poco andrà a convivere con la fidanzata in un'altra città \n\n-uno è laureato in statistica, da due anni viaggia nei paesi più disparati e non ha mai fatto un lavoro \"convenzionale\". Qui in Italia ha una casa di proprietà ereditata dai nonni, pare che guadagni molti soldi tramite scommesse sportive e investimenti vari.\n\n- l'ospitante è laureata anche lei e fa la maestra. Vive dai genitori che hanno una casa molto grande in provincia e che hanno pure una piccola azienda vinicola. Sta considerando di andare a vivere insieme al fidanzato che fa il corriere e che da quel che ho capito guadagna abbastanza bene. \n\n-poi ci sono io che sono cresciuto in una casa popolare e che vivo da solo in affitto guadagnando 1500 al mese e avendo meno di   3k da parte.\nHo una situazione famigliare di merda che mi ha praticamente costretto ad andarmene via da casa 3 anni fa. Part time insegno musica ai bambini guadagnando qualcosina, ma la strada è lunga ed è tutta in salita. \n\nE niente questo è quanto. \n\nEdit:\nRingrazio tutti quanti per il supporto 🥲, fa piacere avere qualcuno che ti tira su il morale ogni tanto. ",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 569,
    "downs": 0,
    "created_utc": 1766318108.0,
    "media": null,
    "is_video": false,
    "num_comments": 224,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.644466114728173
  },
  {
    "score": 564,
    "title": "Post di ringraziamento",
    "selftext": "Ciao, nessuna richiesta, volevo solo ringraziarvi, perché in solo un anno grazie a voi ho:  \n- chiuso conto Bancoposta, 5€ al mese risparmiati  \n- aperto conto presso banca digitale, con bonifici gratuiti (stimo comunque almeno altri 30€ che avrei buttato)  \n- evitato la soglia dei 5k sul CC per altri ~34€ risparmiati di bollo  \n- aperto conto deposito svincolabile, ottenendo 700€ di interessi  \n- mantenuto un budget annuale, vedendo che M30 44k di RAL ho risparmiato 8000€ quest'anno, ed ora so che posso permettermi più \"sezione divertimento\" senza problemi (magari togliendo qualcosa dalla sezione \"ristoranti\" ahah)  \n- imparato le basi della finanza personale, che male non fa: a breve aprirò il mio conto titoli, e presto (sfortunatamente) erediterò i soldi di un parente stretto che ha una discreta somma investita in banca e poste, che toglierò con enorme piacere  \n  \nPraticamente, questo sub ha reso oltre il 10% dei miei risparmi annuali, e chissà in futuro quanto altro tra commissioni e via dicendo. Senza contare la cultura, impossibile da prezzare. Grazie ancora!",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 564,
    "downs": 0,
    "created_utc": 1734512498.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.340833535868407
  },
  {
    "score": 552,
    "title": "Tu! Lo so che sei quì! Esci fuori!",
    "selftext": "Tempo fa ho comperato una tastiera meccanica usata su [subito.it](http://subito.it)  \nHo scritto con l'utente, contrattato sul prezzo da 20 a 15 euro e sono andato per ritirarla.\n\n~~Questo signore~~  Questa persona con più di quarant'anni arriva alle Poste di questo paesello con una Tesla Model Y e la tastiera sbagliata, mi dico, vabbé, può capitare.  \nGli mostro la foto con l'annuncio di quella giusta, siamo d'accordo che non è quella e mi dice che la vende il figlio ma quella dell'annuncio non me la vendeva per 15 che l'aveva acquistata a tanto.  \nLo seguo e arriviamo in un quartiere carino, casa nuova, entra ed esce con la tastiera giusta.  \nCioè io arrivo con la mia Fabia scatafascio con più di 300.000km, te hai auto e casa nuova e mi fai le storie per 5 euro?\n\nE niente, sono sicuro sia uno di voi.  \nMaledetto! Maledetti!",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 552,
    "downs": 0,
    "created_utc": 1737700836.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.448741800954088
  },
  {
    "score": 547,
    "title": "Non sapevo la situazione fosse così grave",
    "selftext": "Vi racconto una breve storia sperando di non tediarvi troppo. \nIo (M32) e la mia compagna (F31) ci siamo trovati a condividere un viaggio con un'altra coppia di amici. Noi siamo dei semplici dipendenti, io lavoro nel privato e la mia compagna nel pubblico. Questo amico è figlio di imprenditori e la sua fidanzata lavora con lui nell'azienda di famiglia, quindi abbiamo capito che a livello di disponibilità economiche siamo nettamente su due livelli differenti, sono però persone estremamente umili e non ostentano la loro condizione privilegiata. Fatta questa doverosa premessa, arriviamo al punto.\nSiamo a cena e l'amico, che chiameremo Adamo, fa uscire l'argomento; \"Ma voi investite in qualcosa?!\". Io sono sempre un po' restio a parlare di soldi con le altre persone perché in Italia sappiamo quanto sia taboo l'argomento, ma visto che mi hanno dato il via mi stava già salendo il Paolo Coletti e stavo per tirare fuori il mio spreadsheet e vantarmi dei miei 30k in ETF, ma resto buono e attendo. Adamo continua il discorso, come banca si appoggia a Fideuram che gli ha proposto dei fondi molto interessanti. \"Su cosa investono\" gli chiedo. \"Ah non so bene, dovrebbe essere su energie rinnovabili e intelligenza artificiale\". Inizia a tremarmi la palpebra. Gli chiedo i costi di questi fondi, non me lo sa dire. Proseguendo il discorso dice anche che ha dei BTP (non si sa bene quali), ma la cosa che lo ha reso più contento è stata quella volta in cui la banca lo ha chiamato per dirgli che c'era un'opportunità di investire nella lira turca, che c'era una grande possibilità di profitto. Lui ha seguito il consiglio e alla fine ha guadagnato il 33% su 10k che aveva investito.\nIo ero basito, ma mi sono trattenuto. Facendo un po' il giro degli altri, anche la sua fidanzata ha solo un piccolo BTP che le ha fatto comprare la nonna e un bel fondo in Mediolanum di cui non sappiamo niente ma che se ci dovessi scommettere è solo un bel modo di spillarle dei soldi. Sull'argomento fondi pensioni ancora più critica, entrambi lo hanno con la propria banca, Adamo ha scelto una linea azionaria e Eva invece è andata sul safe con una linea bilanciata, ovviamente non hanno saputo dirmi quali fossero i costi di gestione. Quando è arrivato il mio turno gli ho spiegato che anche io un BTP che scade nel 2029 così da poter usare quei soldi per estinguere anticipatamente il muto e il resto in due ETF. Manco a dirlo non sapevano nemmeno cosa fosse un ETF e dato che non ho la dialettica del Prof. Coletti non sono riuscito a convincerli che pagare lo 0.25% annuo al posto del 3/4% fa una bella differenza sul lungo periodo.\nE niente, questa è stata la mia realizzazione di come la maggior parte delle persone vive gli investimenti, del fatto che la fiducia nelle banche sia totale e del fatto che alla fine della fiera basta che alle persone fai guadagnare due spicci e sono contente, l'importante è che non si debbano sbattere per capire cosa sta capitando alle loro spalle.\nDal canto mio mi sento privilegiato nel fatto di essermi informato e aver studiato un minimo per avere adesso la capacità di capire che investire alla fine può essere facile e divertente anche senza essere dei laureati in economia.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 547,
    "downs": 0,
    "created_utc": 1764748821.0,
    "media": null,
    "is_video": false,
    "num_comments": 252,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6453408190722785
  },
  {
    "score": 545,
    "title": "Non chiediamo una villa, chiediamo di poter vivere senza essere spremuti",
    "selftext": "In molte città italiane gli affitti sono completamente fuori controllo.  \nStanze singole a 500€, bilocali a 900€, richieste assurde tipo “solo lavoratori stabili, no studenti, no smart working, no umani”.\n\nComprare casa? Peggio. Prezzi fermi ai livelli del 2008, ma stipendi reali che non sono mai saliti.  \nHai un lavoro dignitoso e un contratto regolare? Buona fortuna con la banca se non hai almeno 50k da parte o i genitori pronti a firmare.\n\nE gli studenti? Peggio ancora. Invece di essere incentivati a formarsi, vengono spremuti come limoni da proprietari che trattano le stanze come mini caveau: affitti fuori da ogni logica, anticipi, cauzioni, contratti ridicoli.  \nStudiare dovrebbe essere un diritto, non un lusso riservato a chi ha una famiglia ricca alle spalle.\n\nLa generazione che oggi affitta a caro prezzo spesso ha comprato negli anni ’90 con mutui decennali e salari più stabili.  \nOra però ci dice: “dovete solo impegnarvi di più”.\n\nMa qui il punto è chiaro:  \nvivere, lavorare, contribuire alla società, costruire un futuro, senza casa è impossibile.  \nE lo Stato? Tace.  \nNiente tetto massimo agli affitti, niente calmieramento, niente edilizia pubblica seria.  \nSolo bonus ristrutturazioni e incentivi a chi ha già immobili.\n\nAllora la domanda è questa:  \nSe anche il diritto all’abitare diventa privilegio, come possiamo parlare ancora di democrazia?",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 545,
    "downs": 0,
    "created_utc": 1748587600.0,
    "media": null,
    "is_video": false,
    "num_comments": 559,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.808786656207837
  },
  {
    "score": 528,
    "title": "Italia, paese della mediocrità. Chiudo P.IVA dopo 1,5 anni",
    "selftext": "Voglio solo sfogare qua una frustrazione infinita.\n\nSono un developer, appassionatissimo del mio lavoro. Da laureato in informatica, sono riuscito a fare della mia passione, un lavoro. Da dipendente.  \nEcco, mi piace il mio lavoro, mi piace di piu se fatto a modo mio, non per il capo, ma la pagnotta a casa va portata, quindi bisogna anche saper adeguarsi.  \nPiù di 10 anni di carriera, ho costruito tanto, studiato tanto. Il cervello che ancora è una spugna non appena legge/scopre qualcosa di nuovo. Questo fuoco interiore lo ringrazio perchè mi motiva.  \nAbbastanza bravo nel mio, trovavo un delitto rinunciare a usare le mie capacità nelle sole 8h di lavoro. Potevo fare di più. Parto svantaggiato, in un'isola, la Sardegna. I clienti non sono tanti, anzi, non sono proprio. Ma nel tempo conosco e riesco a coltivare una partnership con una web agency di Roma, divento il loro outsource, in quanto senza know how interno demandano a me tanti lavori e consulenze. Ma è un doppio giro, non si può strizzare troppo un cliente, ci si accontenta in due.\n\nL'anno scorso apro p.iva ad inizio anno, subito dopo nato mio figlio.\n\nOltre alla mia RAL, avrei fatturato più di 10k, quindi nella mia testa era un buon reddito globale.  \nRiesco anche a gestire economicamente abbastanza bene la cosa, nel senso che avendo due conti correnti, in uno confluivano tutte le fatture e con l'altro la mia vita normale, con lo stipendio.  \nLa mia idea era svoltare. Costruire un gruzzoletto da investire non appena se ne fosse presentata l'occasione.\n\nEd ecco che dopo un anno e mezzo, si presenta il famoso bivio.  \nMi scrive la commercialista e la faccio breve:  \n\\- hai fatturato 13k, ora devi pagare quasi 6k di IRPEF+INPS e quasi altri 6k di acconti 2026.  \nIn tutto ció, è dall'anno scorso che pago la commercialista che ha pesato per quasi 1,5k.\n\nPrecisazione, per via del reddito da dipendente, non avevo accesso al regime forfaittario quindi regime ordinario.\n\nPer cosa ho sacrificato le notti?  \nChe senso ha imparare sempre piu, oltre a soddisfare la voglia di conoscenza?  \nL'inps versata nemmeno la rivedrò, a meno di tenere la p.iva ulteriori 20 anni.  \n6k di imposte e 6k di acconto. Quando mai vedrò 12k di servizi sociali a compensare queste tasse? Senza contare l'IRPEF che prendono dal mio stipendio.\n\nTralasciando la polemica.  \nProbabilmente, l'anno prossimo, quando farò l 'ISEE, risulterà un reddito alto che magari mi penalizzerà e avrò meno aiuti, quindi pagheró di tasca, nonostante la tasca me la abbiano svuotata, mentre chi è rimasto fermo, vuoi per incapacità, vuoi per furbizia, si vedrà aiutato da uno stato assistenzialista.\n\nL'Italia cosa mi spinge a fare?  \nSemplice, mi spinge a non fare.\n\n\"Bravo sai fare? Bene ti facciamo passare la voglia noi\"\n\nMa ha senso? Se sono in grado, non sono una risorsa che produce per lo stato? Non è meglio strizzare meno e continuamente che tutta in un colpo?\n\nIo volevo elevarmi, invece faccio un bel passo indietro.  \nFaccio il mediocre come tutti e aspetto che lo stato mi aiuti rigirandomi una fetta delle tasse che preleverà a quegli scemi con la partita iva.\n\n**EDIT:**  \nChe dire se non darvi ragione.  \nChe ci ho sperato. Speravo di fatturare di piu, speravo di \"ok sono alte le tasse ma sono comunque soldi extra\".  \nUn punto di ingresso la P.IVA sempre lo ha, se più di cosi non potevo fare, ci dovevo almeno provare.  \nMi sembrava ingiusto non avere possibilità solo perchè sollevano dei warning sul \"quanto dovrò pagare\".  \nSapevo che se stavo fermo, il domani sarebbe stato uguale a ieri. E questo mi spaventava di piú.\n\n**EDIT 2:**  \nLa commercialista mi è costata circa 1.5k **sino ad adesso, contando trimestre di chiusura prossimo.** Mi chiedeva fattura di 200 + IVA a trimestre",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 528,
    "downs": 0,
    "created_utc": 1748291866.0,
    "media": null,
    "is_video": false,
    "num_comments": 387,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.677871534832289
  },
  {
    "score": 526,
    "title": "Vivere con 5€euro per 10 gg, è possibile?",
    "selftext": "Ciao, posso sfogarmi qui?\nLo prendo come un si...\nAllora ho iniziato un nuovo lavoro due mesi fa con stipendio 1200/mese tramite agenzia che letteralmente trattiene il 30% delle paga per i primi due mese. Io disperatamente ho accettato e non ho calcolato le spese successive. \nOra passato il primo mere e quasi il secondo, mi trovo con 5 euro in tasca e 0,19 cent sulla postepay. Mancano ancora 10 giorni per ricevere lo stipendio. Non vi nascondo nulla ma sono preoccupato e triste. \nGrazie per avermi ascoltato.❤️",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 526,
    "downs": 0,
    "created_utc": 1720046922.0,
    "media": null,
    "is_video": false,
    "num_comments": 264,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.660933552180951
  },
  {
    "score": 514,
    "title": "Ho sempre sognato di lavorare in banca. Oggi me ne vergogno",
    "selftext": "Account throwaway per ovvi motivi.\n\nScrivo per sfogarmi. \nLavoro come consulente bancario per uno dei principali gruppi bancari italiani, cresciuto molto negli ultimi anni e di cui, uno dei soci di maggioranza, è un gruppo assicurativo. \nLavoro in Calabria, dettaglio tutt’altro che secondario.\n\nDa bambino volevo fare questo lavoro.\nHo scelto gli studi solo con questo obiettivo. Ero affascinato dalla banca e dalla gestione dei capitali.\nOggi sono in un’età in cui odio profondamente quello che faccio e, più in generale, il mondo bancario.\n\nIl mio lavoro, nella pratica, consiste nel collocare prodotti di investimento mediocri, carichi di commissioni e con rendimenti spesso imbarazzanti rispetto ai benchmark.\nNegli ultimi anni, però, il vero focus non è più nemmeno l’investimento. È l’assicurazione.\n\nVuoi aprire un conto? Devi fare una polizza rami elementari. \nVuoi un prestito? Polizza protezione.\nVuoi una cessione del quinto? Polizza casa.\nSei un imprenditore e hai bisogno di liquidità? Polizza salute, anche da 15 o 20 mila euro.\n\nBisogna vendere la polizza, anche quando è completamente scollegata dalle reali esigenze del cliente.\nIl lavoro è diventato questo: cannibalizzare il cliente, spremerlo, infilare polizze ovunque possibile. Prodotti che io stesso farei fatica a sottoscrivere. Tutto questo mi provoca nausea, malessere e un senso costante di frustrazione.\n\nIl cliente non è stupido.\nCapisce perfettamente la situazione.\nPercepisce la pressione, la forzatura, la disperazione di chi deve portare lo stipendio a casa.\nA volte ci ride in faccia, perché le condizioni sono oggettivamente ridicole.\n\nOltre al disagio etico, c’è una pressione commerciale continua, legata direttamente agli MBO dei miei superiori.\nLe pressioni che riceviamo non sono solo “di filiale”, ma servono a far raggiungere i loro obiettivi personali, spesso a qualsiasi costo.\n\nAbbiamo budget annuali e “ambizioni” mensili che non comunicano tra loro.\nEsempio: budget annuo sull'assicurativo 100k, ambizione mensile 50k. È matematicamente illogico, ma non importa.\n\nVeniamo chiamati continuamente per numeri, dati, report, giustificazioni.\nVengo chiamato durante le ferie.\nVengo chiamato quando sono fuori dall’orario di lavoro.\nVengo chiamato anche in malattia.\nMessaggi, telefonate, pressioni costanti, come se il lavoro non avesse mai un confine.\nLavoro fino alle 16.55, ma se alle 16.55 me ne vado vengo visto male dai miei colleghi o superiori, per cui sono costretto a restare quei 15/30 minuti in più ogni sera (ovviamente non retribuiti). \n\nGli obiettivi cambiano di continuo.\nUn mese conta il gestito, quello dopo solo le polizze.\nPoi, all’improvviso, parte il “click day”: una giornata in cui l’unico obiettivo è sottoscrivere quante più polizze possibili, salute o infortuni, senza alcuna reale consulenza. Solo numeri.\n\nCapita di essere richiamati perché un cliente ha svincolato della raccolta gestita. \nOppure perché un prestito è stato erogato senza polizza abbinata.\nOppure ancora perché il cliente ha scelto un BTP invece di un prodotto pieno di commissioni.\nCapita di sentirsi dire che “si poteva fare di più”, anche quando il cliente non aveva alcun bisogno reale di quel prodotto.\n\nIn Calabria tutto questo pesa ancora di più.\nIl tessuto economico è fragile, i clienti fanno sacrifici veri, e noi dovremmo tutelarli.\nInvece spesso siamo spinti a fare l’opposto.\n\nLa conclusione è semplice, ma pesa.\nHo studiato una vita per fare un lavoro che oggi detesto. Non perché sia difficile, ma perché è diventato vuoto, forzato, lontano da quello che immaginavo.\n\nPensavo di fare consulenza.\nPensavo di aiutare le persone a gestire meglio i propri risparmi, a fare scelte sensate, a dormire tranquille.\nInvece mi ritrovo a misurare il mio valore solo in base a quante polizze riesco a piazzare, spesso a persone che non ne hanno reale bisogno.\n\nOgni giorno sento un conflitto costante tra ciò che so essere giusto per il cliente e ciò che mi viene imposto dall’alto.\nOgni giorno devo scegliere tra lavorare con coscienza o proteggere il mio posto, il mio stipendio, la mia serenità economica.\nEd è una scelta che logora, lentamente ma senza tregua.\n\nLa cosa peggiore è la sensazione di aver perso il senso.\nNon mi riconosco più nel ruolo che ricopro, né nei valori che l’azienda dice di avere.\nResto solo per necessità, non per convinzione.\n\nE questa, più di tutto, è la vera sconfitta.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 514,
    "downs": 0,
    "created_utc": 1765977147.0,
    "media": null,
    "is_video": false,
    "num_comments": 170,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.563305284237268
  },
  {
    "score": 516,
    "title": "Ho smesso di tenere traccia delle mie spese ",
    "selftext": "Non fregherà niente a nessuno, ma dopo anni serrati a tenere traccia di ogni singola spesa, stamattina mi sono svegliato e ho detto: mi sono rotto il cazzo. \n\nIl fatto è che all'inizio la cosa mi tornava utile perché non avevo la benché minima idea di quello che spendevo, ma ormai è diventato solo uno stress inutile e uno spreco di energie. Appena prendo lo stipendio metto via quello che devo mettere via, e il resto più o meno sono spese fisse e in caso di spese variabili, mi so gestire benissimo senza esagerare. \n\nCazzata? Me ne pentirò? Voi cosa ne pensate. Grazie.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 516,
    "downs": 0,
    "created_utc": 1733852327.0,
    "media": null,
    "is_video": false,
    "num_comments": 221,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.629167030319262
  },
  {
    "score": 508,
    "title": "Iniziare a fare \"sul serio\" con i propri soldi è molto meno glamour di quanto si dica",
    "selftext": "Non so voi, ma io pensavo che “occuparsi delle proprie finanze” significasse iniziare a investire in borsa, ottimizzare il portafoglio, leggere grafici e magari diventare ricco a 30 anni.\n\nIn realtà, il mio punto di partenza è stato molto più semplice (e brutale). Al netto di quanto ci propinano vari influencer su YT e IG: **capire dove andavano a finire tutti i miei soldi.** Spoiler: in cene fuori, l'ordine in più su Amazon, abbonamenti dimenticati e 'tanto è solo 5 euro'.\n\nHo cominciato con un foglio Excel e una sola domanda: quanto mi resta a fine mese senza toccare i risparmi?\n\nNon c’erano ETF, non c’erano piani pensione integrativi… solo tante piccole spese invisibili che messe insieme facevano sparire metà stipendio.\n\nOggi sto un po’ più avanti nel mio percorso (ho iniziato un PAC, ho un fondo emergenze, investo il TFR), ma sono ancora lontano da dove vorrei arrivare.\n\nLeggendo tanti post medi in questo sub di gente alle prime armi che poi finisce a fare PAC con 20 ETF e 100€/mese pensavo potesse essere utile condividere anche un pensiero basic.  \n  \nPer voi qual è stato il momento in cui avete “iniziato sul serio” a gestire le vostre finanze?",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 508,
    "downs": 0,
    "created_utc": 1745416437.0,
    "media": null,
    "is_video": false,
    "num_comments": 207,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.60074944981814
  },
  {
    "score": 506,
    "title": "Compro da mangiare o investo passivamente?",
    "selftext": "Ragazzi, ho un dilemma esistenziale.\n\nOggi ho aperto il frigo: dentro c’erano solo una cipolla, un dado vegetale e il sogno di una vita finanziariamente indipendente.  \nMi sono detto: “Puoi spendere 7,99€ per un poke, oppure puoi metterli in un ETF globale e lasciare che il potere dell’interesse composto ti nutra spiritualmente.”\n\nHo fatto due conti:\n\n* Se investo quei 7,99€ oggi, tra 40 anni potrei avere tipo… 74€ (forse).\n* Se li spendo in cibo, potrei sopravvivere fino a domani.\n\nMa poi mi è venuto il dubbio: e se domani i mercati crollano e io ho speso quei soldi per un avocado molliccio e non posso comprare il dip?\n\nQuindi ora sto digiunando, in attesa che Vanguard mi risponda se accettano cipolle come asset,. Ma intanto per portarmi avanti ho tokenizzato Ettore (il mio gatto), venduto quote del mio sonno REM su una DAO che ho fondato ieri notte e shortato il meteo di Milano, che mi sembravano le mosse più basilari da fare al volo. Che altri consigli avete?",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 506,
    "downs": 0,
    "created_utc": 1754904488.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.387507959333336
  },
  {
    "score": 489,
    "title": "Il mio PAC alla Sisal",
    "selftext": "Chiedo scusa in anticipo per lo shitposting.\n\nHo deciso di tracciare il rendimento della mia abitudine di spendere 1€ a settimana in una giocata del Superenalotto.\n\nGioco esattamente e rigorosamente una sola volta alla settimana, sempre e solo con giocata da 1€, sempre e solo numeri casuali.\n\nAl momento, grazie a un paio di ambi azzeccati in rapida successione che mi portano a galla di ben 2.1€, il rendimento si attesta a ben il 21% su circa 3 mesi.\n\nCon il passare delle settimane ovviamente il rendimento si assesterà rapidamente su un'onesta perdita.\n\nEcco i flussi ad oggi:\n\n| DATA     | FLUSSI |\n|----------|--------|\n| 08/01/25 | -1,0 € |\n| 12/01/25 | -1,0 € |\n| 19/01/25 | -1,0 € |\n| 27/01/25 | -1,0 € |\n| 27/01/25 | +2,0 € |\n| 03/02/25 | -1,0 € |\n| 09/02/25 | -1,0 € |\n| 11/02/25 | -1,0 € |\n| 16/02/25 | -1,0 € |\n| 23/02/25 | -1,0 € |\n| 25/02/25 | +5,0 € |\n| 02/03/25 | -1,0 € |\n| 04/03/25 | +5,1 € |\n\nRendimento: **21%**\n\nAppuntamento al mese prossimo.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 489,
    "downs": 0,
    "created_utc": 1741190301.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.421996165909473
  },
  {
    "score": 485,
    "title": "Come cambiare sesso a spese di American Express",
    "selftext": "Prossimamente otterrò dal tribunale una nuova identità, con un nome diverso ed un nuovo codice fiscale. Praticamente potrei benissimo essere mia sorella agli occhi di qualsiasi azienda privata, dato che per ovvi motivi la rettifica dei dati anagrafici non risulta da nessuna parte.\n\nIeri notte non riuscivo a prendere sonno così mi sono detta: ma chi me lo fa fare di chiamare American Express e raccontare a loro i cazzi miei, quando regalano una marea di soldi ai nuovi clienti?\n\nL'idea è questa:\n\n* Aprire una Oro con la prima identità sfruttando il codice invita un amico di qualcuno e ricevere 75k punti di benvenuto\n* Sfruttare i 100 euro di voucher della Oro\n* Chiedere l'upgrade alla Platino e ricevere altri 100k punti di benvenuto\n* Sfruttare i 500 euro di voucher della Platino\n* Aprire un account Emirates (poi capirete il perché)\n* Cambiare sesso e farsi assegnare un nuovo codice fiscale dal tribunale (questa è la parte più difficile in assoluto, PERÒ usando la Platino per pagare i vari esami, le visite, i farmaci e la medicina estetica si ricevono punti MR, cosa da non sottovalutare, diciamo 5k nel mio caso)\n* Usare la prima identità per invitare la seconda alla Platino. Attualmente la prima identità riceve 90k punti, mentre la seconda 180k\n* Sfruttare i 500 euro di voucher della Platino #2\n* Chiamare Amex utilizzando la prima identità (per non rischiare di essere riconosciute meglio fare il vocione), minacciando di chiudere la Platino #1 e cercando di farsi dare l'offerta di retention. Il tasso di successo dipende da quanto storico avete come clienti Amex, ma chi ha un buono storico riesce ad ottenere il canone gratis per sei mesi (quindi 90k punti)\n* Trasformare i punti MR della prima identità in miglia di Emirates\n* Tradire la fiducia con Amex e chiudere la Platino #1 dopo essersi intascati il bonus di retention\n* Chiamare Emirates e dire di aver cambiato sesso, facendosi migrare l'account, e quindi trasferendo a tutti gli effetti i punti (cosa che ovviamente non si può fare tra due account Amex distinti)\n* Una volta che Emirates è al corrente del misfatto, trasformare anche i punti MR della seconda identità in miglia\n* Profit\n\nFacciamo due conti:\n\n* In tutto abbiamo accumulato 540k punti MR, che però abbiamo convertito in miglia con un tasso di 5 MR = 4 miglia, quindi ci ritroviamo con 432k miglia\n* La carta Oro ha fruttato 100 euro di voucher\n* Le due carte Platino hanno fruttato 500 euro l'una di voucher, quindi 1000 euro\n* Un mese, però, abbiamo dovuto pagare il canone di due carte Platino (al posto di una sola come avremmo normalmente fatto), quindi togliamo il costo di una delle due (60 euro)\n\nQuindi, solo come cash ci abbiamo guadagnato 1040 euro, e in più abbiamo 432k miglia da poter spendere.\n\nOra, su come spendere al meglio i punti c'è un mondo, tuttavia cercando bene i voli e scegliendo la business class, si riesce ad arrivare ad un tasso di conversione che nel migliore dei casi è di 1 MR = 3 centesimi. Quindi 540k MR = 16.200 euro.\n\nTirando le somme, siamo a 17.240 euro guadagnati, ok che in gran parte sono voli in business class e non cash, però son sempre più di mezzo milione di punti, che schifo non fanno.\n\nOvviamente nulla vieta di utilizzarli per azzerare l'estratto conto, in questo modo il tasso di conversione è il più svantaggioso in assoluto (0.4%), ma possono essere usati per qualsiasi spesa, e non solo i voli in business class. In questo caso, 540k MR = 2.160 euro. Che aggiunti ai 1.040 di prima portano il totale a 3.200 euro cash. Ci escono agevolmente 30 sedute laser, una decina di punture di botox, due anni e mezzo di ormoni, 16 esami del sangue, 640 bandiere 🏳️‍⚧️, 128 [BLÅHAJ](https://www.ikea.com/it/it/p/blahaj-giocattolo-morbido-squalo-30373588/), 460 [smolhaj](https://www.ikea.com/it/it/p/blahaj-giocattolo-morbido-squalo-cucciolo-20540663/).\n\nA proposito, mi consigliate dei conti/carte/servizi con offerte simili al presenta un amico di Amex?\n\nUn bacino sulle labbra a chi è arrivato a leggere fin qui 😘💋",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 485,
    "downs": 0,
    "created_utc": 1724426192.0,
    "media": null,
    "is_video": false,
    "num_comments": 292,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.5800700794393485
  },
  {
    "score": 483,
    "title": "Ma voi, ve lo ricordate Iliad e il suo GRIDO di RIVOLUZIONE ?",
    "selftext": "Ancora me lo ricordo...maggio 2018 (quasi 7 anni fa).\n\nFino a quel momento i principali operatori italiani (TIM, VODAFONE e WINDTRE (fusi a fine 2016)) facevano  \ncartello.\n\nDovunque andassi (io l'ho provato sulla mia pelle) ti massacravano con le lore offerte (ti attiravano con offerte leggermente più economiche, ma poi ti addebitavano costi mostruosi per qualsiasi operazione extra, per rescindere dal contratto o anche per contattare l'assistenza).\n\nAll'epoca (quando avevo iniziato a usare il cellulare da poco tempo e non avevo esigenze importanti) era un continuo (un mese sì e l'altro pure) cambio di operatore, contrattando ogni volta con il gestore di turno.\n\nEstenuante, costoso, poco etico.\n\nPoi e arrivata Iliad in Italia...\n\n...il resto è storia.\n\n[https://www.youtube.com/watch?v=q-LhUqDY3xU&amp;t=621s](https://www.youtube.com/watch?v=q-LhUqDY3xU&amp;t=621s)\n\nQuando è arrivata un'offerta chiara, senza vincoli, per sempre.\n\n* Mobile &gt; 5.99/m, 30 GB (8 in Europa) sms e minuti illimitati;\n* Fibra &gt; anche qui è riuscita ad aver un'importante influenza. 15.99€/m.\n\nQuanto aveva risparmiato (direttamente e indirettamente con Iliad ?",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 483,
    "downs": 0,
    "created_utc": 1736341491.0,
    "media": null,
    "is_video": false,
    "num_comments": 289,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.64354436059389
  },
  {
    "score": 479,
    "title": "Piccola soddisfazione oggi in banca",
    "selftext": "Stamattina alle 9 avevo appuntamento in banca (ISP) per discutere di alcune cose e, visto che a fine mese mi scadeva il MIFID ne ho approfittato per aggiornarlo. \n\nLo compilo insieme alla consulente, arriviamo alla parte delle polizze, leggo e dico \"qui metti no per favore, non mi piacciono le polizze come investimento, le uso solo per fini assicurativi\"   \nlei mi risponde \"Ma se qui segnamo no, non possiamo neanche proportele\" e io, con un sorriso a 32 denti \"è esattamente quello che voglio\".\n\nSuccessivamente ho proceduto a disinvestire due dei loro fondi sottoscritti quando ancora non capivo niente (non che adesso sia meglio, ma almeno ho un po' di consapevolezza) e investirò tutto il ricavato in VWCE non appena arriva l'accredito sul conto. Poi andranno sicuramente a picco (Grazie Trump) ma visto che quei soldi non mi serviranno per almeno 20-25 anni, si spera che nel lungo periodo sia comunque la mossa giusta.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 479,
    "downs": 0,
    "created_utc": 1738575740.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.373482573450671
  },
  {
    "score": 477,
    "title": "\"Rutto.mp3\" e i risparmi di milioni di italiani",
    "selftext": "Magari sono solo io a trovarlo deprimente, ma quando ho letto questa notizia non ho potuto non fermarmi a riflettere...\n\n[https://www.hdblog.it/ios/articoli/n603153/app-banca-intesa-700-mb-spazio-file-rutto/](https://www.hdblog.it/ios/articoli/n603153/app-banca-intesa-700-mb-spazio-file-rutto/)\n\nSe la prima app bancaria del paese - quasi sicuramente per numero di utenti ma se non sbaglio anche premiata nel passato - è sviluppata con tale sciatteria, cosa si deve aspettare il risparmiatore italiano nell'interazione digitale con gli istituti di credito?",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 477,
    "downs": 0,
    "created_utc": 1734594726.0,
    "media": null,
    "is_video": false,
    "num_comments": 292,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.595361706789173
  },
  {
    "score": 470,
    "title": "Non il solito Sankey - L'evoluzione del mio patrimonio negli ultimi 10 anni",
    "selftext": "A differenza dei classici grafici Sankey annuali, ho deciso di condividere l'andamento del mio patrimonio nell'arco dell'ultimo decennio, dal primo giorno di lavoro a oggi. Alcune info:\n\n* Valori netti: le cifre degli investimenti sono già al netto della tassazione sulle plusvalenze.\n* Timeline: ho evidenziato i principali eventi salienti che hanno influenzato la crescita.\n* Altri asset: dispongo di un fondo pensione non incluso nel grafico.\n* Grafici: avrei preferito integrare i dati su RAL e fondo pensione con grafici sovrapposti, ma ho optato per questa visualizzazione perché sono una pippa con i grafici.\n\nSono a disposizione per domande nei commenti!",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 470,
    "downs": 0,
    "created_utc": 1767178084.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.393020907128896
  },
  {
    "score": 461,
    "title": "25.000 euro sono una RAL sopra la mediana italiana",
    "selftext": "Considerando solo le RAL dei dipendenti, se prendi 25.000 lordi hai una RAL superiore al 70% dei dipendenti italiani secondo il MEF:\nhttps://www.stipendee.it/\n\nI dati sui dipendenti sono raccolti dal MEF e difficilmente possono essere alterati, quindi c'è poco da discutere. La RAL mediana è più vicina ai 20.000-21.000 euro lordi, quindi ai 1300-1400 euro netti di stipendio mensile circa. In alcune regioni del nord come il Veneto sale a 23.000-24.000, ma si mantiene comunque sotto quota 25.000.\n\nQuesto perché vedo spesso qui su reddit persone dire che 2000 euro netti sono uno stipendio da fame, e mi sembra giusto far girare queste informazioni e diffondere consapevolezza su quelli che sono i dati ufficiali. \n\nC'è da dire che la situazione reale al sud è ancora peggiore di quella che emerge dai dati in quanto c'è tutta una coorte di lavoratori, soprattutto fra i giovani, che lavora a nero e percepisce stipendi ancora più da fame (spesso sotto i 1000 euro), ma il discorso diventerebbe troppo complicato. ",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 461,
    "downs": 0,
    "created_utc": 1757059087.0,
    "media": null,
    "is_video": false,
    "num_comments": 306,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6282111632947185
  },
  {
    "score": 454,
    "title": "Il Mega post sul RISPARMIO",
    "selftext": "Ciao a tutti, volevo creare con questa comunità un Mega post sul risparmio.\n\nSpero mi scuserete se mi discosto sui post riguardanti le ingenti somme ereditare da un parente che non si sapeva nemmeno di avere o dal problema di cosa fare con i miliardi fatti con le cripto, questo sarà un post terra terra che si potrebbe quasi definire banale.\n\nPartirei da una frase fatta, “un euro risparmiato è un euro guadagnato” questa massima è attribuita a un personaggio che di risparmio ne sa a palate il caro buon Zio Paperone. In effetti noi guadagniamo soldi sui quali paghiamo le tasse (a volte tante tasse) e spendiamo soldi per comprare cose/servizi sulle quali paghiamo le tasse (IVA 4-10-22%).\n\nAl risparmiatore vengono spesso attribuiti aggettivi qualificativi come taccagno, tirchio o spilorcio, come se fossero sinonimi, cosa per niente vera (o forse si 🤑).\n\nFatta questa doverosa premessa ecco l’inizio dell’elenco, il quale spero possa essere aggiornato dalle vostre considerazioni.\n\n•\tDOMICILIAZIONE BOLLO AUTO, per i residenti in Lombardia (non capisco perché solo per loro) c’è la possibilità di domiciliare il bollo sul conto corrente tramite SPID, oltre al fatto che così si evita di dimenticarsene e/o di pagare spese dei vari bollettini, si ha il non trascurabile vantaggio di risparmiare il 15% sulla somma totale, questo vuol dire che circa ogni 7 anni è come se non si pagasse il bollo, schifo non fa.\n\n•\tINVIO ELETTRONICO DELLE BOLLETTE, Scegliere di ricevere le bollette in modalità digitale fa risparmiare 36 euro l'anno.\n\n•\tRISPARMIARE SULLE BOLLETTE, utilizzare il portale delle offerte ARERA per confrontare quale offerta sia migliore per il posto in cui abitiamo, in alternativa ci sono applicazioni che lo fanno al posto nostro ma meglio sempre verificare.\n\n•\tFONDO PENSIONE DI CATEGORIA, iscrivendosi si ha la possibilità di avere, mettendo una cifra irrisoria, di ottenere il contributo obbligatorio del datore di lavoro (entrambi dedotti dalle tasse in busta paga). Se vi state chiedendo dove sia il risparmio, la risposta riguarda la tassazione agevolata sulla somma depositata negli anni che può variare dal 15% al 9%, in base agli anni di permanenza.\n\n•\tOTTIMIZZARE GLI INVESTIMENTI, guardare quanto costano i nostri investimenti e valutare di esporci allo stesso rischio/rendimento al costo minore possibile, su questa parte ci hanno scritto valangate di libri quindi vado via rapido.\n\n•\tASICURAZIONE ONLINE, valutare di fare l’assicurazione online, io ero restio a questa idea all’inizio ma poi ho ceduto e non credo che tornerò indietro.\n\n•\tUSARE BLA BLA CAR, quando viaggio in Italia o all’estero uso BLABLA che è molto più veloce e conveniente che muoversi con i mezzi, per chi avesse remore sulla sicurezza negli anni questo aspetto è molto migliorato.\n\n•\tFARE SCORTA DI SACCHETTI PER REGALI, raga questo mese sono andato in cartoleria per prendere un sacchetto e la carta regalo per impacchettare un maglione e ho speso tipo 2€ per il sacchetto, il che mi ha fatto pensare quanto fossi un babbo a non avere preso 15 sacchetti di carta allo stesso presso su AliExpress.\n\n•\tFARE SCORTA DI PRODOTTI NON DEPERIBILI IN CANTINA, personalmente in cantina ho degli scaffali destinati allo stoccaggio di beni non deperibili come carta igienica, conserve, vino, birra, olio intendiamoci non diventi milionario però se non altro vai a fare meno la spesa che personalmente reputo uno sbatti assurdo.\n\nQuesti sono solo alcuni modi di risparmiare, ce ne saranno molti altri, pur mantenendo uno stile di vita ottimale, fatemi sapere cosa fate voi. \n\nNON MOLLEREMO MAI !!!\n\nGrazie mille \n\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 454,
    "downs": 0,
    "created_utc": 1732781919.0,
    "media": null,
    "is_video": false,
    "num_comments": 284,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.620433826661368
  },
  {
    "score": 456,
    "title": "Crash del mercato di Counter Strike 2",
    "selftext": "Mi rendo conto di quanto questo possa essere OT, ma pur sempre si finanza personale si parla. \n\nValve, azienda di videogiochi proprietaria di Steam, ha rilasciato un aggiornamento a CS2 il 22 ottobre 2025 che ha modificato il sistema di creazione delle skin, permettendo ai giocatori di creare skin di alta rarità come coltelli e guanti, precedentemente ottenibili solo tramite apertura di casse (previo acquisto in-game di cassa e relativa key). Questa novità ha drasticamente aumentato l’offerta di skin molto pregiate, facendo crollare i prezzi sul mercato.\nIn poche ore, il valore complessivo del mercato delle skin è passato da circa 5,9 miliardi di dollari a 4,2 miliardi, con una perdita stimata di 1,7-2 miliardi di dollari. Molti investitori e collezionisti che avevano speso migliaia di dollari si sono trovati con asset pesantemente svalutati, mentre altri hanno apprezzato la maggiore accessibilità alle skin più ambite.\nQuesto evento ha scosso profondamente la community, tra proteste e discussioni, segnalando come un’operazione tecnica possa avere ripercussioni economiche enormi sulla virtual economy di CS2.\n\nDa subito hanno iniziato a circolare diverse testimonianze e notizie di utenti che, a seguito di loss di decine se non centinaia di migliaia di dollari di “investimenti”, si sono tolti la vita.\nA voi i commenti.\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 456,
    "downs": 0,
    "created_utc": 1761561385.0,
    "media": null,
    "is_video": false,
    "num_comments": 267,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.601483597084245
  },
  {
    "score": 456,
    "title": "Ho provato a concordare una RAL al RIBASSO [34.950 &gt;&gt; 35.000]",
    "selftext": "Vorrei condividere con voi quanto di simpatico ho provato a chiedere al reparto HR della mia attuale azienda.\n\nM27, esattamente 3 di esperienza anni nella stessa azienda di consulenza IT (no big4) su Milano, CCNL Metalmeccanico su 13 mensilità.\n\nAccolgo con un sorriso la mail che mi comunica che da questo mese riceverò un aumento di 3k lordi, da 32k a 35k.  \nPurtroppo, ben 4 euro lordi/annui sopra la famosa soglia (2692\\*13=34996euro lordi/annui) tale per cui si riceve mensilmente l'esonero contributivo IVS 6% (di fatto poco meno di un centinaio di euro netti mensili).\n\nVengo al dunque: chiedo un colloquio con HR per poter contrattare **al ribasso** la RAL.  \nDal mio punto di vista sarebbe stata una win-win condition, chiedendo una **piccola modifica** al ribasso (es. 50euro lordi/annui che mi avrebbero portato ad avere una RAL di 34.950 anzichè 35.000):\n\n- l'azienda avrebbe risparmiato un centinaio di euro annui\n\n- io avrei guadagnato circa 80 euro/netti mensili, continuando a percepire l'esonero contributivo IVS 6%\n\n(Un grazie agli sviluppatori di [stipendee.it](http://stipendee.it) !!!)\n\nRisposta da parte di HR: \"La nostra non è una *proposta*, ma una *modifica* già attuata a partire dal mese di settembre! Secondo te, quando proponiamo gli aumenti, stiamo a controllare che ogni risorsa sia sopra o sotto una tale soglia al centesimo?! No, non è possibile accogliere la tua richiesta, e non sarebbe corretto nei confronti dei tuoi colleghi\" \n\nFine della storia :(\n\nSpero di avervi strappato un mezzo sorriso :)\n\nBuona giornata a tutti!  \n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 456,
    "downs": 0,
    "created_utc": 1726739681.0,
    "media": null,
    "is_video": false,
    "num_comments": 220,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.559612336912406
  },
  {
    "score": 455,
    "title": "Vendevo AZIONI a SCUOLA e il mio compagno di classe era promotore finanziario.",
    "selftext": "Facendo seguito al precedente post su questo sub \"La mia prima MARGIN CALL, avevo solo 11 anni\" è giunta ora di raccontare come, al primo anno di un istituto tecnico, guadagnavo commissioni fornendo un servizio di brokeraggio ai miei compagni di classe dopo aver messo in piedi una rete di vendita assoldando un compagno.\n\nMa andiamo con ordine, correva l'anno scolastico 2011/2012 e dopo non poche difficoltà riuscii ad aprire un account sulla nota e ora non più attiva piattaforma \"Banc de Binary\" con i documenti sottratti dalla borsa di mia madre (pattern ricorrente). Depositai i primi 250 euro per mezzo di una carta prepagata PAYPAL aperta dal tabacchino già in mio possesso e in men che non si dica ero operativo.\n\nOPZIONI BINARIE 60 secondi, sappiamo tutti cosa sono e sappiamo tutti quanto fossero scam specialmente su quelle piattaforme con spread fumosi e prezzi di apertura e chiusura forse un pochino pilotati.\n\nProvai ad \"investire\", la posizione CALL o PUT minima offerta dalla piattaforma era di 1€, motivo per il quale scelsi proprio Banc de Binary, ebbi l'opportunità di sperimentare la mia consolidata e famosa strategia del \"è alto ora deve scendere ti prego\", \"è basso ora deve salire per forza\", \"fammi prendere questa posizione poi smetto lo giuro\", \"torno a 250 e poi ritiro tutto\", \"se raddoppio la posizione prima o poi torno in pari è sicuro\" con scarsi risultati come era facilmente prevedibile.\n\nIl caso volle che prima di bruciarmi l'intero conto un mio compagno di classe, vedendomi smanettare sull'applicazione da telefono durante l'intervallo mentre stavo cercando di capire se GBP/CAD sarebbe salito o sceso nei prossimi 30 secondi, si incuriosì e mi chiese come fare per aprire un account, ci provai ma risultò troppo complicato per lui, rinunciò, per fortuna.\n\nEd ecco il colpo di genio, io avevo qualcosa di più rispetto ai miei compagni, qualcosa di prezioso, l'accesso alla piattaforma e un saldo su di essa, potevo fare l'intermediario, accettare e liquidare posizioni in contanti comodamente senza lo sbattimento del deposito minimo e senza dover aprire un account, nasce cosi la più grande operazione di crimine finanziario organizzato che l'istituto tecnico statale della mia città abbia mai visto.\n\nIl piano era semplice, smettere di investire i miei soldi e offrire il servizio a terzi in cambio di una percentuale dei guadagni qualora l'operazione fosse stata di successo, avevo capito che conveniva sbarazzarmi del rischio connesso all'investimento e lavorare per la commissione, nel mentre la popolarità dei miei investimenti era aumentata e buona parte della classe ne era al corrente ed affascinata, inutile dire che come ho incominciato a proporre il servizio tanti curiosi con monetine in mano si sono resi disponibili a \"provare\" e cosi durante l'intervallo o prima di entrare a scuola mi facevo consegnare il denaro, aprivo la posizione CALL o PUT su qualsiasi strumento finanziario di loro gradimento (solitamente era EUR/USD, oro, petrolio), si attendeva il risultato e poi si liquidava la posizione, alcuni perdevano e incassavo la somma in contanti che andava a coprire le perdite sulla piattaforma, altri vincevano e liquidavo la posizione arrotondando per difetto e incassando la percentuale, ovviamente non si faceva credito a nessuno.\n\nStep successivo, assoldai un mio compagno di classe amici da una vita e ancora in contatto, il suo compito era quello di proporre per me gli investimenti, i clienti interessati e con i soldi in mano sarebbero poi venuti da me per aprire la posizione dal mio dispositivo in cambio di una parte dei profitti, la cosa funzionava ma degenerò presto.\n\nI clienti divennero ludopatici, dovevano recuperare i soldi che si erano mangiati, il mio gringo aveva capito che più clienti portava e più guadagnava cosi incominciò a proporre l'investimento anche al di fuori della classe, ben presto buona parte del piano era al corrente delle attività e il traffico fuori dall'aula incominciava a destare sospetti tra i docenti. Il picco assoluto è stato quando per pura gogliardia proposi l'investimento in azioni Apple al professore di fisica scatenando l'iralità dell'intera classe, egli si insospettì e ben presto venne allo scoperto il giro di affari losco che si consumava anche durante le sue ore di laboratorio.\n\nFu la fine, fortunatamente, dettata dall'intervento del docente in merito al giro di soldi e in generale all'attività decisamente poco consona all'ambiente scolastico, cessai di offrire il servizio anche perchè tenevo particolarmente alla mia condotta scolastica.\n\nLa settimana più elettrizzante dell'anno, ero diventato popolare per questa attività ma cosi come la fama arrivò la fama svanì, tornai ad aprire qualche posizione per conto ma non era più lo stesso, prelevai tutto e chiusi l'account.\n\nForse vi parlerò di quando importavo dalla Cina puntatori laser, è una lunga storia tra ispezioni doganali, francobolli sottocosto e dropshipping. Votate UP.\n\n",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 455,
    "downs": 0,
    "created_utc": 1715587978.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.162856771024303
  },
  {
    "score": 448,
    "title": "Lo spassionato consiglio di un (frustrato) 43enne ai più giovani: riflettete ATTENTAMENTE sulla vostra traiettoria professionale.",
    "selftext": "Scrivo  questo post per conciliare la necessità di sfogare un po’ di  frustrazione e la voglia di condividere la mia esperienza di vita con persone più giovani, sperando di poter far riflettere almeno qualcuno di loro su quella che è la traiettoria della loro vita.\n\nParto dalla mia situazione personale e professionale: 43 anni,  maschio, marito di una donna che amo e per la quale stravedo, padre di  due meravigliose bambine, dipendente di un’azienda stabile nel settore delle comunicazioni, che da anni  mi corrisponde uno stipendio rispettabile, di poco superiore ai 4,000 euro netti al mese.\n\nSe questa  presentazione può risultare pomposa, sappiate che io non vedo la mia situazione molto  rosea. Questo perché ho realizzato che, numeri alla mano, sto  “buttando” buona parte della mia vita.\n\nDa oltre 10 anni la mia routine è la seguente: da domenica a giovedì vado  ad dormire alle 11 per svegliarmi alle 7 del giorno dopo. Le 8 ore di  sonno sono purtroppo obbligatorie per me, poiché rientro fra I  fortunatissimi che se provano a dormire anche solo 7 ore al giorno, dopo  una settimana cominciano a sembrare degli zombie.\n\n**Dal momento in cui mi sveglio fino alle 19 la mia giornata ruota intorno a: prepararmi per il  lavoro, andare al lavoro, lavorare, tornare da lavoro.**\n\nLa mia professione non è la passione della mia vita. Sono bravo (o almeno così suggerirebbero i miei risultati), relativamente conosciuto nell'ambiente, ma nulla di più. Non sarà il lavoro della miniera, questo è vero, ma a volte mi interrogo sulla possibilità di sopportare questo impiego nel lungo periodo.\n\nNel  momento in cui torno a casa ho la necessità di cambiarmi, mettermi  comodo e sdraiarmi per qualche minuto per “decomprimere” e levarmi di  dosso la sensazione dell’ufficio. Fra una cosa e l’altra, si fanno  sempre le 19:30.\n\nAlle 20 mangiamo,  e finiamo per le 20:30. A quel punto ho un paio di ore scarse per stare con le mie figlie e con mia moglie, tutto questo mentre avrei semplicemente bisogno di rilassarmi.\n\nBuona  parte della mia vita ripiega sul week-end, 2 giorni scarsi nei quali mi  districo per trovare il tempo per stare con le mie figlie, con mia  moglie, con I miei genitori, e magari con un amico.\n\nHo  rinunciato quasi completamente all’hobby della cinefilia, e negli  ultimi due anni mi sarà capitato forse 5 volte di riuscire a guardare un  film in una sola giornata e non in 2-3 sedute. Ho smesso completamente di fare sport perché non ho materialmente tempo, ad oggi la mia attività  fisica è la passeggiata della domenica mattina con la mia famiglia. La  nostra vita sociale è ridotta al minimo, lo scorso anno ci è capitato di  non vedere gli amici anche per un mese intero.\n\nSono sempre di corsa. Ogni volta che rallento, qualcosa esce dalla mia vita.\n\nGuardandomi  intorno, non vedo situazioni molto diverse dalla mia. Sì, qualcuno è  più fortunato con le distanze dal lavoro, ma non mi pare che conducano  vite radicalmente diverse.\n\nIn  tutto questo, la nostra quotidianità è finanziariamente decorosa, ma  tutt’altro che sfarzosa, e dai 4,000 euro al mese riusciamo a  risparmiare al massimo il 20% (e la media è tristemente più bassa).\n\nQuesta  è la mia vita. 5 giorni a settimana cancellati dal calendario, altri  due in cui cerco di conciliare vita familiare, vita sociale, una visita  ai miei, e magari 5 minuti per leggermi un libro, e nessuna prospettiva  per un cambiamento nel breve periodo (non virtuoso, almeno).\n\nArrivo al sodo, che relego ad una sorta di appendice al mio sfogo: ad  oggi rimpiango di non aver utilizzato meglio I miei 20 anni. Avrei  dovuto probabilmente cazzeggiare un po’ di meno e “prepararmi” di più,  investire nell’acquisizione di competenze che mi avrebbero consentito di  essere un libero professionista ben remunerato e padrone del proprio  tempo.\n\nHo peccato di poca lungimiranza, non ho visto l'ovvio, e oggi sono legato mani e piedi ad un lavoro che non mi piace ma che mi consente di mandare avanti la mia famiglia. Certo, quando vedo che il mio vicino di casa, un  traduttore (dal cinese) che lavora mezza giornata da casa, guadagna  più di me... mi fa molto strano. Non ero invidioso a 20 anni dei figli di papà per i loro  macchinoni, e mi ritrovo ad esserlo di un coetaneo perché ha più tempo  libero.\n\nCavolo, a me diventare  ricco non è mai interessato. Non sputerei su un biglietto vincente della  lotteria, ma I soldi non sono mai stati un’ossessione per me. Però  l’idea di passare altri 20 anni in questa situazione la trovo piuttosto  deprimente.\n\nScusate lo sfogo, questa settimana ho dovuto rinunciare anche ai miei due giorni di libertà grazie al Covid.\n\n&amp;#x200B;\n\nEDIT: Ragazzi, non ho possibilità di chiedere lo smart working, né di rinegoziare il contratto rinunciando a parte del compenso per più tempo libero. ",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 448,
    "downs": 0,
    "created_utc": 1673195741.0,
    "media": null,
    "is_video": false,
    "num_comments": 448,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.653369511504985
  },
  {
    "score": 448,
    "title": "Spottato utente IPF",
    "selftext": "Sono sul treno e ho dietro un’utente di questo sub. Ha iniziato a parlare con una donna che non conosce di come conviene comprare l’abbonamento ai mezzi mensile invece dell’annuale per investire la somma in un indice azionario e guadagnare più della differenza di costo dello stesso. Poi si è messo a parlare del crollo dei mercati del covid e com’è stata un’opportunità pazzesca ma non sono riuscito a sentire tutto il discorso 😂",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 448,
    "downs": 0,
    "created_utc": 1739554926.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.227866959691117
  },
  {
    "score": 446,
    "title": "Far piangere la zia",
    "selftext": "Ieri ho avuto una discussione con una zia di mia moglie. Questa ha 5 case di proprietà, di cui 1 la sua che ci vive e 4 tutte affittate.\n3 le ha avute in eredità lei e 2 il marito. Non hanno mai pagato un mutuo o affitto in vita loro.\nIl marito è un piccolo agricoltore di uva da vino e hanno una sola figlia. \nSi lamentano in continuazione che i soldi non bastano, lui guadagna poco e a malapena arriva a fine mese. Quando le fai notare che ha ben 4 case affittate a una media di 500€ l'una.... PEGGIO! - Le case affittate sono una fregatura! Voi non avete idea di quante tasse pago tra imu, cedolare secca, isee altissimo e ogni 3x2 che ci chiamano per problemi e dobbiamo sborsare soldi!-\n\nAllora lì ho detto: - Ma scusami, dici di non arrivare a fine mese, ogni casa vale in media 200k€, quindi probabilmente hai oltre 1 milione di € di patrimonio immobiliare, venditi 1/2 case e vivi da pascià! Qual è il problema? -\n\n- Ma sei pazzo! Per noi [ cognome] vendere è un disonore. Sono tutte case che devo lasciare a mia figlia -\n\nLa figlia sta a Monza, quindi di quelle case si pulirà il culo un domani.\n\nAllora ho sbottato:\n- è un disonore vendere... E ti sembra onorevole stare sempre a lamentarti che stai senza soldi, non arrivi a fine mese e stai valutando di andare a lavare i portoni ( lo dice, ma non lo farebbe mai) per portare qualche soldo di più a casa?\nMa non vi vergognate? Siete degli ingrati, hai avuto tutto regalato nella vita e sputi tutti i giorni nel piatto dove mangi-\n\nEravamo a casa di mia suocera, si è messa a piangere ed è andata via.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 446,
    "downs": 0,
    "created_utc": 1713595215.0,
    "media": null,
    "is_video": false,
    "num_comments": 217,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.517035769934239
  },
  {
    "score": 443,
    "title": "Bollette del GAS gonfiate e un sistema che sembra favorire i fornitori: vi racconto la mia esperienza",
    "selftext": "Ciao a tutti,  \nvoglio raccontarvi quello che mi è successo con **Eni Plenitude** e cosa ho scoperto scavando nelle normative che regolano il *settore energetico*. Purtroppo, ho l’impressione che l’attuale sistema sia pensato per favorire i fornitori, lasciando i consumatori senza reali tutele.\n\nTutto è iniziato con una fattura che mi è arrivata il **17 dicembre**. Già questo sarebbe irritante, visto che era stata emessa il **4 dicembre** e prevedeva l’**addebito RID il 30 dicembre**, lasciandomi pochissimo tempo per contestarla.\n\nMa il problema vero era il contenuto della fattura: **mi hanno fatturato 809 mc di gas**, ignorando la lettura reale del contatore, che era di **586 mc** al 30 novembre. Insomma, hanno deciso di gonfiare i consumi basandosi su una stima arbitraria, anche se i dati reali erano già disponibili.\n\nPer darvi un’idea dell’assurdità: a ottobre avevo consumato 1 mc, e a novembre hanno calcolato un consumo di 224 mc! Un incremento del 22.400%, nonostante l’appartamento non sia stabilmente abitato e non abbia nemmeno una cucina installata.\n\nQuando ho contestato la fattura, mi è stato risposto che si tratta di **stime consentite dalla normativa ARERA**, in particolare il Testo Integrato Fatturazione (TIF). Questo mi ha spinto a documentarmi, e quello che ho scoperto mi ha lasciato senza parole.\n\n**Il ruolo di ARERA e del TIF**\n\nLe normative di ARERA, che dovrebbero tutelare i consumatori, sembrano invece giustificare questi comportamenti. Ad esempio:\n\n* Il **comma 5.3 del TIF** consente ai fornitori di ignorare le letture reali, anche quando sono disponibili, e utilizzare stime.\n* Il **comma 6.8** permette ai fornitori di applicare criteri di stima arbitrari.\n* Il **comma 3.2** concede deroghe che sembrano fatte su misura per i fornitori, aumentando lo squilibrio contrattuale a danno dei consumatori.\n\nQueste norme sembrano andare contro i principi fondamentali del **Codice del Consumo**, che vieta **pratiche commerciali scorrette** (art. 20-24) e **clausole vessatorie** (art. 33-34).\n\nMa c’è di più: nel 2021 l’AGCM ha multato Eni, Enel e altri fornitori proprio per pratiche simili, come fatturazioni gonfiate basate su stime irrealistiche. Tuttavia, oggi queste stesse pratiche sembrano legittimate dalle deroghe introdotte da ARERA.\n\n**Perché questo è grave**\n\nNon è solo una questione personale: sento che questo è un problema sistemico. Su piattaforme come Trustpilot ci sono centinaia di recensioni di consumatori che raccontano storie simili (che fanno puntualmente sparire), ma nessuno sembra ascoltare.\n\nE mentre i fornitori continuano a trattenere liquidità dai conti dei clienti con la scusa delle stime, i consumatori sono costretti a lottare per farsi rimborsare.\n\n# Cosa possiamo fare?\n\nSto cercando consigli su come agire. Ho intenzione di presentare un esposto all’AGCM per pratiche commerciali scorrette, ma mi chiedo se esistano altre strade per fare pressione o coinvolgere più persone.\n\n* Qualcuno ha vissuto situazioni simili?\n* Come posso portare avanti questa battaglia contro un sistema che sembra progettato per schiacciare i consumatori?\n\nGrazie a chi vorrà condividere la sua esperienza o darmi un consiglio. Non è solo una questione di bollette, ma di giustizia per tutti i consumatori.\n\n**Nota di aggiornamento:**\n\nCiao a tutti,  \npurtroppo devo segnalare che questo thread è stato colpito da uno **shadow banning**: tutti i nuovi commenti vengono nascosti automaticamente al pubblico. Posso vederli solo io, in quanto autore del thread, e gli utenti che li hanno postati, ma non sono visibili al resto della community. \n\nQuesto impedisce qualsiasi forma di dialogo e confronto, dando l'impressione che la discussione si sia fermata, quando in realtà non è così.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 443,
    "downs": 0,
    "created_utc": 1735176151.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.369403666275167
  },
  {
    "score": 435,
    "title": "Thoughts?",
    "selftext": "\nC’era una volta il mito dell’impiegato del catasto, o del dipendente pubblico in termini generali. Posto fisso, stipendio assicurato a fine mese, lunghe ferie, orari umani. Ma la favola non regge più, come spiega una ricerca della Cisl Funzione pubblica della Lombardia e realizzata da BiblioLavoro (il Centro studi regionale del sindacato), nell’ambito di una campagna di ascolto intitolata “I Care” che ha coinvolto circa 15 mila iscritti, con un questionario compilato da un campione di oltre mille persone, in sei casi su dieci donne, con laurea, attorno ai 50 anni, oltre 20 di anzianità, in un caso su tre o con figli o con anziani a carico.\nUn campione molto equilibrato che racconta come il lavoro nel settore pubblico — dalla sanità alla scuola, dai musei agli enti locali — sia tutt’altro che attraente oggi. Perché? «La retribuzione è insufficiente rispetto al costo della vita (83%), ci sono poche opportunità di crescita professionale e avanzamento di carriera (55%), non viene valorizzato il lavoro svolto (51%), l’ambiente di lavoro è poco motivante (35%)», spiega la segretaria generale della Cisl Fp Lombardia, Angela Cremaschini. Ma fra i fattori che mettono in crisi il “travet” c’è anche il fatto che nella società il dipendente pubblico non è ben visto.\nNe deriva una situazione di stress per sei lavoratori su dieci, che nasce dal carico di lavoro eccessivo (43%), dalle carenze di organico (28%) ma anche dal comportamento degli utenti: infatti il 12% lamenta problemi di sicurezza e aggressioni, un dato che cresce se si considera solo chi lavora nella sanità. Circa sette lavoratori su dieci sostengono di non ricevere alcun supporto per la gestione dello stress dalla struttura in cui operano (dirigenti e politici) e questo in nove casi su dieci influisce negativamente sul bilanciamento vita-lavoro, determina problemi fisici e disagio psicologico, provoca demotivazione e insoddisfazione e isolamento.\nTutti scontenti, dunque, in otto casi su dieci per le scarse opportunità di carriera, il mancato riconoscimento del merito, il poco supporto e le modeste risorse a disposizione per il lavoro. Anche gli stipendi per sette su dieci sono bassi, mentre alta è la frustrazione, soprattutto tra i sanitari a causa dei turni estenuanti, delle aggressioni verbali e fisiche da parte dell’utenza e da un senso di insicurezza costante.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 435,
    "downs": 0,
    "created_utc": 1744446910.0,
    "media": null,
    "is_video": false,
    "num_comments": 172,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.493509540832984
  },
  {
    "score": 433,
    "title": "Secondo me il problema non sono il numero di matrimoni a cui partecipi…",
    "selftext": "Ok che sarà stato in America, però parliamone un attimo:\n- guadagna 72000$ e ha da parte solo 4/5k\n- 900$ festa di addio al nubilato \n- 1200$ di hotel \n- 800$ di volo\nScusate, ma qui il problema non è participate al matrimonio ma non saper fare una singola spesa decente… in America i voli interni costano più o meno come i treni da noi, quindi chissà cosa ha preso… 1200$ di hotel? 200$ a notte ci fai 6 giorni, che è una piccola vacanza… se è rimasta tre giorni sono 400$ a notte: ha preso una suite??? 900$ di festa: ao, io ho fatto festa con gli amici ad Amsterdam e, incluso le busone, abbiamo speso meno di 400 a testa.\n\nA me la cultura americana fa troppo ridere: c’è la totale incapacità di prevedere e affrontare le spese, vivono di eccessi (in ogni senso), e gli viene inculcata l’idea di essere i migliori del mondo 😂😂😂\n ",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 433,
    "downs": 0,
    "created_utc": 1755168271.0,
    "media": null,
    "is_video": false,
    "num_comments": 221,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.50066621673783
  },
  {
    "score": 429,
    "title": "Anche con stipendi “da ricchi” sembra non bastare mai",
    "selftext": "Mi sto rendendo conto di una cosa che mi fa parecchio male: anche con stipendi che sulla carta vengono considerati “alti”, non si vive poi così bene. Parlo da persona che ha studiato, che si è fatta il mazzo, che ha sempre cercato di fare le cose per bene studio, lavoro, impegno. Ma più passa il tempo, più mi sembra che non sia mai abbastanza.\n\nLa mia idea di vita decente non è vivere in centro a Milano, andare a cena fuori tre volte a settimana o cambiare iPhone ogni anno. È molto più semplice, eppure sembra sempre più irraggiungibile:\n\n•\tuna casa in un paese di provincia, niente di lussuoso, solo un posto nostro, tranquillo\n\n•\tun’auto che non sia una Ferrari ma nemmeno un catorcio per cui tremi se devi fare 50 km in più\n\n•\tqualche vacanza all’anno, anche low cost, per staccare, respirare un po’\n\n•\te magari, un giorno, mettere su famiglia, con dei figli\n\nMi sembra il minimo. E invece, anche se lavoriamo in due, con stipendi nella media (anzi, sopra la media nazionale) 70k in totale, vivere senza la pressione costante dei soldi sembra quasi un sogno. Comprare casa? Un’impresa. Fare un figlio? Un lusso. Avere tempo e serenità mentale per godersi la vita? Un’utopia.\n\nA volte penso davvero di andarmene all’estero, non per rotolarmi nell’oro, ma solo per vivere una vita normale. Per non dover costantemente fare conti, rinunce e sacrifici anche quando, teoricamente, dovresti essere “messo bene”.\n\nÈ come se la società ti dicesse “ce la puoi fare se ti impegni”, ma poi, quando ti impegni davvero, ti trovi sempre col fiato corto, sempre a rincorrere qualcosa. E ti viene da pensare: ma allora a che serve tutto questo sbattimento, se comunque non si vive davvero?\n\nNon lo so, volevo solo sfogarmi un attimo. Magari qualcuno si riconosce.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 429,
    "downs": 0,
    "created_utc": 1749401498.0,
    "media": null,
    "is_video": false,
    "num_comments": 404,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.597195967186921
  },
  {
    "score": 430,
    "title": "A Milano è spuntato il presepe targato Vanguard",
    "selftext": "Sono passato in centro a Milano e mi trovo questo box rosso gigantesco di Vanguard. Tutto illuminato, con gli annetti ordinati tipo calendario dell’avvento, solo che invece dei cioccolatini trovi “1976: nasce il fondo X” e via così fino al 2025. Un vibe a metà tra museo delle madonne votive e showroom di ETF.\n\nDentro gente che guarda i pannelli come se stesse scegliendo il nome del figlio, fuori staff in divisa rossa che pare pronto a spiegarti la differenza tra accumulo e distribuzione pure se stavi solo andando a prendere un panino.\n\nSinceramente non ho capito il target: turisti? Millennials col senso di colpa finanziario? Noi di IPF che passiamo per caso e pensiamo “Ah ok, quindi sono in ritardo di mezzo secolo… perfetto”?\n\nSia mai che invece di ste minchiate abbassassero il ter di VWCE o creassero un fondo pensione per noi intaliani (quest’ultimo probabilmente non glielo permettono). 🫣\n\nComunque, qualcuno c’è entrato?\nSo che ti offrono i cioccolatini e caffè, quasi quasi entro a scroccare 😋🤣\n\n-Un Bogleheads.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 430,
    "downs": 0,
    "created_utc": 1764492982.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.168369198520599
  },
  {
    "score": 429,
    "title": "Mio figlio sta per cadere in una truffa: come lo convinco senza farlo allontanare?",
    "selftext": "Throwaway per ovvi motivi.\n\nMio figlio ha 19 anni ed è stato avvicinato da un coetaneo che gli ha proposto di entrare in quello che, a tutti gli effetti, è un sistema piramidale. Il meccanismo è il solito: si paga una quota di iscrizione per accedere a corsi che promettono di insegnare a fare trading con le criptovalute e a guadagnare soldi. Ma il vero guadagno non arriva dal trading, bensì dal portare dentro altre persone.\n\nIl problema è che mio figlio sembra crederci. È un periodo complicato tra di noi, e lui è in una fase in cui vuole dimostrare di poter prendere decisioni da solo. L'ho convinto ad organizzare un incontro io, lui e questo suo \"amico\", quello che gli ha parlato del “business”. A suo dire, questo ragazzo gli ha mostrato bonifici in entrata e sostiene di guadagnare davvero con il trading.\n\nNon voglio trasformare questa situazione in uno scontro. Se lo attacco direttamente, rischio solo di spingerlo a chiudersi e a fidarsi ancora di più di chi lo sta raggirando. Voglio fargli aprire gli occhi, ma senza farlo sentire giudicato o trattato da ingenuo.\n\nCosa posso chiedere a questo ragazzo per metterlo in difficoltà senza che mio figlio si senta umiliato? Quali domande lo porteranno a rendersi conto da solo che è una truffa?\nHo già parlato ampiamente di schemi a ponzi con mio figlio e mi sembra che qualcosa sia passato, ma sostiene che il suo amico guadagna dal trading.",
    "subreddit": "ItaliaPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 429,
    "downs": 0,
    "created_utc": 1739223967.0,
    "media": null,
    "is_video": false,
    "num_comments": 166,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.479826691153378
  }
]