[
  {
    "score": 305,
    "title": "This Completely Changed the Way I Acquired Clients",
    "selftext": "A few years ago I was struggling to generate leads\n\nI sent hundreds of cold emails and barely got replies\n\nWhen someone did respond, it was usually:\n\n\"Not interested.\" or \"Who are you?\"\n\nThen, I figured out a simple framework.\n\nAfter tweaking my approach, I started landing consistent meetings with dream clients.\n\nThe best part?\n\nIt was repeatable\n\nHere’s the exact 7 step cold email framework that changed everything for me:\n\n1.The Trigger (Why You’re Reaching Out)\n\nCold emails fail when they feel random People need context\n\nIf you don’t give them a clear reason they’ll ignore you\n\nHere’s what works:\n\n\\-They just hired a bunch of people\n\n\\-Their company raised funding\n\n\\-They got promoted\n\nExample:\n\n\"Hey Sam, saw you brought on 4 new SDRs in the past 6 months.\"\n\nNow they know why you’re reaching out\n\n2. The Implication (Why This Matters)\n\nOnce they know why you’re emailing, they need to know why they should care.\n\nIf they hired new SDRs, what might be on their mind?\n\n\\-Onboarding them quickly\n\n\\-Getting them to quota faster\n\nExample:\n\n\"Figured you might be looking into how to ramp them up quickly.\"\n\nNow, they’re thinking: “Yeah, that’s actually a priority right now.”\n\n3. The Pain (What’s Holding Them Back)\n\nPeople don’t respond to emails that just pitch a solution\n\nThey respond to emails that remind them of a painful problem\n\nIf they just hired SDRs their struggles might be:\n\n\\-Training takes too long\n\n\\-They’re not closing deals fast enough\n\n\\-The team is missing quota\n\nExample:\n\n\"Most sales leaders struggle to get new reps ramped in under 5 months.\"\n\nIf that’s their pain, they’ll feel it when they read your email.\n\n4. The Cost of Inaction (Why This Matters NOW)\n\nHere’s a secret:\n\nPeople are twice as likely to take action when they’re afraid of losing something vs gaining something\n\nMost cold emails focus on ROI (increase revenue, grow pipeline, etc.)\n\nInstead show them what they’re losing if they don’t fix the problem\n\nExample:\n\n\"Last year, 65% of sales teams missed quota due to slow onboarding\"\n\nNow, they’re thinking: “Wait, this could be happening to me.”\n\n5. Social Proof (Show, Don’t Tell)\n\nNobody wants to be the first to try something\n\nShow them you’ve already helped companies like them\n\nExample:\n\n\"We helped Gong’s reps ramp in under 3 months.\"\n\nNow, the see proof that this is possible for them too\n\n6. The Solution (But Keep It Short)\n\nHere’s where most people mess up:\n\nThey over-explain their product\n\nCold emails should create curiosity, not overwhelm the reader\n\nExample:\n\n\"We have a coaching framework that makes this 2x faster.\"\n\nThat’s it. No long paragraphs. Just enough to get them to reply\n\n7. The Soft Ask (Start a Conversation)\n\nMost cold emails fail at the CTA\n\nWhy?\n\nBecause they ask for too much upfront\n\nInstead of pushing for a meeting ask a low friction question\n\nExample:\n\n\"If we could cut your ramp time in half, would that be worth a quick chat?\"\n\nNo pressure. Just an easy “yes” or “no.”\n\nHere’s What a Great Cold Email Looks Like:\n\nHey Sam,\n\nSaw you recently hired 4 new SDRs.\n\nFigured you might be looking into how to ramp them up quickly\n\nMost sales leaders struggle to get reps productive in under 5 months\n\nLast year 65% of sales teams missed quota because of slow onboarding\n\nWe helped Gong’s reps get fully ramped in under 3 months\n\nIf we could do the same for you, would that be worth a quick chat?\n\nThis simple structure has booked me hundreds of meetings\n\nThanks For Reading!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 305,
    "downs": 0,
    "created_utc": 1742502454.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Explicit 7-step framework for cold emailing.",
    "composite_score": 4.1163114134735235
  },
  {
    "score": 235,
    "title": "I sent 724.2k Cold Emails last year and here are 10 IMPORTANT things i learned",
    "selftext": "last year I sent over 724.2k cold emails over my client database and learned a lot\n\n1)stop sending more than 30 emails per inbox or your deliverability is gone\n\n2)stop writing five follow ups and expecting people to magically care\n\n3)stop testing if do you want to chat next week works better than would you be interested this is not testing this is word soup\n\n4)cold email only works when you actually know your offer\n\n5)if you are not targeting a segment with a pain point you shouldnt be doing cold email  \ngo back to the drawing board\n\n6) also nobody remembers your last email from 2 weeks ago soo reuse your lead list every quarter\n\n7)build your messaging on changes in their business not your calendar\n\n8) only test things that actually change response rates:  \njob title change  \nfunding  \nopen roles  \nhiring velocity  \ntech usage  \nthose things\n\n9)structure your email like a human not a robot  \nwhy you  \nwhy now  \nwhat you do  \nsocial proof  \nask a question\n\n10) and if you are getting less than 30 percent open rate, you have a deliverability problem not a copy problem, set up more domains warm them and rotate\n\nwe only send three emails in a sequence now and you should too less annoying more learnings then reuse the list again\n\nstop overthinking copy and under thinking filters your targeting is everything and message to market match or nothing",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 235,
    "downs": 0,
    "created_utc": 1745698448.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.83,
    "category_rationale": "Ten enumerated tips about cold emailing; a list of items.",
    "composite_score": 4.056975929769956
  },
  {
    "score": 191,
    "title": "I generated 907 leads this month so far- Steal my process",
    "selftext": "So for the past three years i have been using cold emails to generate leads for my agency and for my clientz\n\nAnd literally this is the playbook thats generating me tons and tons and tons of leads and meetings \n\nSTEAL IT \n\nHere is the COLD EMAIL BLUEPRINT\n\n1) EMAIL DELIVERABILITY\n\nINBOX SETUP\n\nGoogle/Outlook inboxes \n\n2 inboxes per domain\n\nSet up SPF, DKIM and DMARC\n\nWarm up domains for 3 weeks\n\n\n\n2)SENDING TIPS\n\n30 emails per day per inbox\n\n10+ minute delay between emails\n\nUse Smartlead or Instantly\n\n\n\n3) AVOID SPAM FLAGS\n\nValidate lists to keep bounce rates low use Million verifier or NeverBounce\n\nVerify catch alls with Scrubby\n\nAvoid spam keywords (\"Free\", \"Guarantee\")\n\nPersonalize messages (avoid templates)\n\n\n\n4) LIST BUILDING\n\nDATA SOURCES\n\nApollo is great for initial lists\n\nClay for advanced list building\n\nLinkedIn Sales Navigator can be used for targeted searches\n\nCrunchbase to Find funded companies\n\nUse filters like industry, funding, job change, tech stack  \n\n\n5. INTENT-BASED TARGETING\n\nTrack recent LinkedIn activity\n\nLook for \"just hired\" execs\n\nFundraising, hiring, expansion means its a green light\n\nAdd \"hiring SDRs\" or “budget approval” filters in Clay\n\n\n\n6) COPYWRITING\n\n4 STEP FRAMEWORK\n\nWhy you’re reaching out now\n\nExplain how you help\n\nShow social proof\n\nClear call to action\n\nKeep emails under 75 Words (NO One wants your Essay\n\n\n\n7) VALUE PROPS\n\nFocus on one core benefit:\n\nSave time\n\nSave money\n\nMake more money\n\nReduce risk\n\n\n\n8) CUT THESE OUT\n\n\"Hope this email finds you well\"\n\nCorporate jargon (ROI, streamline, etc)\n\nLong emails and desperate \"breakup\" emails\n\n\n\n9) SEQUENCE STRATEGY\n\nEmail 1 → Use a trigger (social post, job change)\n\nEmail 2 → Add context or case study\n\nEmail 3 → Fresh angle, new CTA\n\nCap it at 3–4 emails max\n\n\n\n10) USING AI EFFECTIVELY\n\nUse Clay to personalize at scale\n\nDon’t auto generate full emails instead blend human and AI\n\nFeed GPT company data, not just names\n\n\n\n11) EFFECTIVE APPROACHES\n\nPoke the bear: Ask about pain points\n\nChunking: Break down your offer\n\nLead magnets: Offer value for free\n\nProblem sniffing: Identify issues\n\n\n\n12) KEY INSIGHTS\n\n\"Social Trigger\" was most effective in 2024\n\nAI generated personalization works when done right\n\nMatch inbox to inbox (Google to Google and Outlook to Outlook)\n\n\n\n13) BENCHMARKS and SAMPLE TEMPLATES\n\nRESPONSE RATES\n\nAverage: 1 positive response per 350 contacts\n\nMaximum realistic response rate: - 30%\n\nBest performing emails: 1st and 2nd in sequence\n\nFree/valuable offers get higher response rates\n\n\n\n14 EXAMPLE TEMPLATE THAT’S WORKING RN:\n\nSubject: building pipeline at {{companyName}}?\n\nHey {{first\\_name}}, Saw you recently joined as {{job\\_title}}. congrats!\n\nquick q do you have a plan in place to hit pipeline targets without a full SDR team?\n\nwe helped \\[ClientName\\] build $3.2M in pipeline with half the cost of an SDR.\n\nwant me to send over the breakdown?\n\n\n\n16) SUBJECT LINES\n\nKeep it short (2-3 words)\n\nMake it look like a colleague sent it so no caps\n\nTest \"question for {{first\\_name}}\",“{{first\\_name}}?”, “pipeline ideas”, “thoughts on this?”\n\n\n\n17) PERSONALIZATION\n\nLinkedIn posts, podcast quotes, content likes\n\nNew job, new funding, new product\n\nHiring signals on careers page\n\n\n\n18) FOLLOW UPS\n\nEmail 2 = reply to same thread (add proof/case study)\n\nEmail 3 = new angle + soft CTA\n\n3-5 days between each follow-up\n\n\n\n19) LEAD MAGNETS\n\nFree prospect list in their niche\n\nCompetitor teardown\n\nLead magnet templates\n\nWebsite audit via Loom\n\n\n\n20) TEST\n\nOffers, value propositions\n\nTriggers (job change vs. hiring vs. funding)\n\nNiches and personas\n\n\n\nI know you guyz might have alot of questions no worries drop them down i will try to answer every single question",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 191,
    "downs": 0,
    "created_utc": 1742667653.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Detailed cold email blueprint with enumerated steps.",
    "composite_score": 3.8962272345246216
  },
  {
    "score": 186,
    "title": "I grew two online businesses to 7 figures without ads. Ask me anything",
    "selftext": "The title pretty much says it all. Just want to give back to the Reddit community. 😊I grew 2 online businesses (B2B services) to seven figures in &lt; 2 years without ads. \n\nMain sources of leads: referrals, affiliates, and direct network through podcasting and speaking on stages. \n\nNote: I do not sell coaching, consulting, and I do not sell leadgen services. AND (I can’t believe I’m saying this) no free pick-my-brain custom sessions. Ask what you what on the thread, and I’ll answer in a way that everyone can benefit. ",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 186,
    "downs": 0,
    "created_utc": 1745185634.0,
    "media": null,
    "is_video": false,
    "num_comments": 132,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "AMA-style post with success claim and no actionable steps.",
    "composite_score": 4.053767427020042
  },
  {
    "score": 170,
    "title": "I’ve sent over 2 million cold emails, here are some tips that have led to success.",
    "selftext": "I won’t go into the fundamentals of deliverability, DKIM, or DMARC records. Instead, I’ll focus on tips that actually get replies, because without deliverability, nothing else matters.\n\n1. **Everyone ignores catch-all emails.** Those people are not bombarded with cold emails, so dedicate specific infrastructure for them and use tools that validate catch-all emails.\n2. **I track my numbers exactly**. Attached is a sheet showing how many emails I need to send to get a reply, how many replies lead to a call, and how many emails it takes to get a client. Make it repeatable and scalable process.\n3. **Diversify your infrastructure**. Don’t use infrastructure from one supplier—use a mix of Google and SMTP. Never use different suppliers' infrastructure in the same campaign. Separate them to see which ones fatigue faster and replace them accordingly. If both are in the same campaign, you might see the same average, but one of them could be completely burned.\n4. **Use soft CTAs** and provide upfront value. This beats everything. I’ve had leads book a call right after I sent value—they were in the mindset of, “You know what you’re talking about, and I want to work with you.”\n5. **Make it relevant, not personalized.** Don’t say things like, “I see you graduated from X.” That’s personal, but not relevant. Relevance means aligning with the reason for your outreach. For example, if a Head of Marketing leaves, the CEO is likely looking for a replacement. Or, if someone posts about an event that directly relates to what you sell, mention that. I’ve found relevance beats personalization every time. Final example: use a subject line like “You or \\[X Name\\]?” Use Clay to pull another decision-maker and ask the prospect who’s the right person to speak to. The goal is to be different from the typical emails people receive, stand out by avoiding what most people do.\n6. **Don’t ask for a call right away,** it’s like asking someone to marry you on the street. Build trust first. Example: “I recorded a quick YouTube video showing how to achieve \\[X\\]. Thought of sharing it with you since I noticed \\[Y\\]. I’m not expecting anything in return.” This way, they might subscribe or follow future content. Always ask for permission to send the link—don’t attach it in a cold email.\n7. **The time you spend on building your list** is the **most important factor** that will make or break your campaign more than the copy itself. Good copy bad target ICP won't work. Good ICP and bad copy will have poor result. Nail down your ICP then A/B your copy.\n8. **I see thousands of visitors to my website and I don’t run ads.** So cold prospects are visiting—use that! Add a VSL (Video Sales Letter) to your page. Make it outcome-driven. Don’t look like the person who does everything for everyone. Create one landing page per service, and dedicate separate infrastructure to each. That infrastructure should redirect to the relevant page—it will convert much better.\n9. **Speed to lead is crucial.** If a lead replies, have triggers or a mobile app ready to immediately add them to follow-up sequences—one sequence for leads asking for more info, and another for interested leads. From the mobile app, add them to the appropriate sequence so the reply goes out quickly. This significantly increases your booked call rate from positive replies.\n10. **In follow-ups, you don’t have to reply within the same thread.** Test sending follow-ups with a new angle, a new subject line, and a fresh approach. Basically, run one campaign where you reply in the same thread, and another where each follow-up is a separate email with a longer gap in between. Each email should have a different angle and approach—people respond to different things. Test and iterate. Don't worry they will never remember who the hell you are, do you remember who sent you cold email yesterday? I'm sure you are not.\n\n**Should I be sharing more Tips?** Happy to help and answer questions.\n\nComment you most interesting tips and lets make this a GOLD thread for Cold emailers.\n\nIf this post get some traction you people are interested I will share my tracking sheet that gives you all the clarity you need about scaling business with cold email :)",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 170,
    "downs": 0,
    "created_utc": 1746653178.0,
    "media": null,
    "is_video": false,
    "num_comments": 61,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Enumerated tips for cold emailing; list-format.",
    "composite_score": 3.86419195514128
  },
  {
    "score": 137,
    "title": "Lead Generation - Why Are There So Many Scammers?",
    "selftext": "A bit of a rant.\n\nI'm a click fraud researcher and I work for a click fraud prevention company (Polygraph). We mostly focus on detecting bots, preventing fake leads, and re-training ad networks to send human traffic.\n\nOver the years we've had quite a few lead generation companies as clients, and probably 95%+ of them have turned out to be scammers.\n\nIn most cases, they sign up so they can test their bots using our platform.\n\nOf course, we notice this immediately (it's obvious) and end up terminating their accounts.\n\nWe can also tell, simply from our interaction with them, that we're dealing with extremely shady people. Either they're like comic book bad guys, or they try to compensate by being overly polite.\n\nWe deal with all sorts of industries, and by far the worst (scammers) are the lead generation industry, and the website traffic industry. Basically anyone who charges a fee to get you visitors or leads.\n\nTo those of you working in the lead generation industry who're trying to do things properly, it must drive you crazy that your industry is being tainted by so many scammers?\n\nAlso, does the lead generation industry attract the sort of people who're happy to scam, or is it like a progression over time, where they start with good intentions and then get corrupted by shortcuts and the pursuit of wealth?\n\nWould love to hear your thoughts on this. Thanks.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 137,
    "downs": 0,
    "created_utc": 1749129156.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.81,
    "category_rationale": "Emotional critique of scammers in the lead-gen industry.",
    "composite_score": 3.7041054246443297
  },
  {
    "score": 79,
    "title": "How Fortune 100 Companies Sign $10M Deals - A True Story",
    "selftext": "A friend of mine, now Head of Sales at a major tech services company based in NYC, shared how they close massive deals in the U.S. Here’s the 5-step playbook:\n\t\n1. Initial Contacts: Build relationships with 20–30 VP-level decision-makers who control big budgets.\n\t\n2. Private Dinner: Invite 10 of them to an upscale dinner focused on industry trends. It’s framed as a valuable networking event with peers.\n\t\n3. VIP Experience: After dinner, offer front-row tickets to a major basketball game - a big deal in the U.S.\n\t\n4. Afterparty: The remaining 2–3 execs are invited to a top strip club in NYC.\n\t\n5. Closed Deal: One of them usually signs a $10M+ contract within a month. ~10% conversion rate.\n\nCost? Around $50K–$100K per event - but one deal pays for it all.\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1748865912.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.89,
    "category_rationale": "Five-step playbook for Fortune 100 deal-signing.",
    "composite_score": 3.108089986991944
  },
  {
    "score": 66,
    "title": "Found 9,400+ decision-makers actively researching our competitors - here's how we convert them",
    "selftext": "New client of ours was struggling with traditional lead gen - cold calling, bought lists, the usual stuff that barely worked anymore.\n\nHere’s the strat we’ve successfully run for them and several others at this point to generate over $1M in sales this year for those who implemented it correctly:\n\n**We’re using intent data to track decision makers (ceos, cmos, founders) who are actively researching competitors.**\n\nThink about it: If they’re researching competitors over industry generic terms, they’re literally one decision away from a purchase.\n\nAKA, **buying** intent.\n\n**Step 1:** use a platform that offers intent data (apollo, lusha, but we use listkit since the data updates every 24 hours). the key was avoiding 30-90 day old stale data bc those ppl already made a buying decision.\n\n**Step 2:** list all your most popular competitors set up searches for people researching their main competitors, filtered specifically for decision-makers - **ceos, cmos, founders, owners.** Again these people were already in buying mode. Set other stuff like company size, location, etc.\n\n**Step 3:** pull fresh leads every single day. Most people set this up once and forget about it, but the real magic happens when you consistently tap into new decision-makers entering research mode every 24 hours.\n\n**step 4:** deployed this simple competitor intercept email:\n\n\"hi \\[name\\],\n\nnoticed you're researching \\[competitor\\].\n\nwe help companies like \\[company\\] get \\[specific benefit\\] without \\[competitor's main drawback\\].\n\nfor example, we helped \\[client\\] \\[specific result\\], saving them \\[quantifiable outcome\\].\n\nmind if i share a quick video showing what this could look like for you?\"\n\nkept it direct, simple, focused on one specific result for one specific type of client.\n\nwhat I really like about this approach is you'll virtually never run out of highly-qualified leads since the data refreshes daily, and with new decision-makers entering buying mode.\n\nWe use listkit's intent data for this entire process but any tool that offers it works i guess. Takes about 5 mins to set up and 1-2 minutes daily to pull new leads.\n\nGood luck!\n\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1758028186.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.84,
    "category_rationale": "Step-by-step strategy for converting intent-data leads.",
    "composite_score": 3.2146844500677862
  },
  {
    "score": 58,
    "title": "You’re not bad at cold email. You just need to adjust your offer for a cold audience. Here’s how.",
    "selftext": "**First, you need to understand this:**\n\n**There are 2 types of offers:-**\n\n# Demand Generation vs. Demand Capturing\n\n1. **Demand Generation** = Convincing someone to buy something they didn’t intend to buy.\n2. **Demand Capturing** = Capturing the people who already looking for this service.\n\nTo make cold email work, your offer needs to be tied to a **clear, measurable, and ROI-driven outcome**.\n\n# ✅ Demand Generation Example:\n\n**Every business wants more leads, more deals, and more revenue.**  \nSo if your offer is directly tied to a measurable ROI outcome, you can **generate demand** **for it** because everyone needs that and they’re open to new ways of achieving it.\n\n**Always position your offer with ROI.**  \nIt makes it way easier to generate leads, especially if you can give them a taste of the outcome for free then ask for money once they like it.\n\n**Here’s what I used to offer when I ran cold email as a service for B2B businesses:**\n\n**\"Can I give you 100 free leads of your ideal target audience — people who are in-market for your service — just to see if I can actually help you in the first place?\"**\n\n**That’s it.**\n\n**I got tons of replies.**  \nThey had to fill out a form with questions about their audience, then the calendar popped up.  \nI promised to deliver the leads live on the call with a demo.\n\n**Tons of calls booked. Worked like a charm.**\n\n(I don’t offer cold email services anymore, by the way. So please don’t contact me for that.)\n\n\\----\n\n# Now, let’s talk about Demand Capturing.\n\n**This one’s harder.**\n\nLet’s say you’re selling website design for businesses.  \nIt’s really hard to convince someone to redesign their website unless they’re **already in the market** for it.\n\nThat’s why most people run **Google Ads,** to capture that existing demand that's currently searching for it.\n\nBut if you still want to do cold email for a service like that, you have to get **very creative** with your positioning.\n\n**Don’t send this, I get tons of these in my spam daily:**\n\n**\"We offer website design services. Are you interested?\"**\n\nThis won’t work.  \nIt’s what everyone else sends.  \nAnd you’ll end up in spam.\n\n**So what’s the move?**\n\nTie your offer to **ROI**.\n\nHere’s a framework:\n\n1. Use Clay (or another tool) to check if they’re running ads or not\n2. Use Meta Ads Library or any ad-tracking API to find the page they’re sending traffic to.\n3. Use a tool like similar web to see how many traffic they have per month.\n4. Email them with a **conversion optimisation** offer.\n\n# Example Positioning For This Service:\n\n**\"I see you’re running ads on Meta and sending over 10,000 visits to your landing page. I had a quick look and I’ve got a few ideas that could lift your conversion rate by at least 1%.\"**\n\n**\"Would you like me to share those suggestions with you? You can implement them yourself, or we can help if you prefer.\"**\n\nThat’s it.\n\nNow he sees an **opportunity to make more money**.  \nYou’re still selling the same service, but the positioning is different.\n\nYou didn’t talk about **what** you do, you talked about **how** it can help him achieve what he already needs.\n\n**Reminder:**  \nNobody cares about your offer.  \nThey care about how it helps them.\n\nOnce you get the reply, just do the work.  \nSend real recommendations. No fluff. No generic advice. People can see right through this.\n\nAnd make sure your **website has proof**:\n\n* Case studies\n* Before &amp; after examples\n* Actual landing pages you’ve worked on etc.\n\nIf they see value, they’ll respond. Simple.\n\n# 📊 Then, track your cold email funnel:\n\n1. How many emails sent to get a positive reply.\n2. How many positive replies recommendations sent.\n3. How many recommendations sent to book get 1 booked call.\n4. How many calls you had to close 1 client.\n\nNow you know how many emails it takes to close one client. By just looking on how many emails sent till you closed 1 client.\n\nThat’s your acquisition cost from cold email.\n\n**Then scale it. Increase volume. Optimize your numbers.**\n\n**That’s it.**\n\nI learned most of this from **Daniel Fazio,** especially the difference between demand gen and demand capture.\n\nIf this is interesting to you, go look him up. He drops pure gold.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1748751153.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.73,
    "category_rationale": "Explains demand generation vs demand capturing with ROI framing.",
    "composite_score": 3.171715929650941
  },
  {
    "score": 48,
    "title": "Why Your Purely Commission-Based Offers Are Approached By People Who Can't Do Sales and Why Legit Agencies Don't Take Those Offers",
    "selftext": "Note: This is not written by me, this post is written by u/Radiant-Security-347 and I'm posting it here because I've been noticing a large amount of commission-based offers in this subreddit. I have taken the permission to post this. He has been in the industry for more than 37 years, and I completely agree with him on this topic. This was initially posted on r/agency.\n\nNow, to the actual topic:\n\nEvery few weeks someone pops up here pitching the same “risk-free partnership” model. You know the one. They want agencies to work on commission or revenue share so “we all win together.” No budget, no retainer, no operating capital. Just trust me bro.\n\nHere’s the uncomfortable truth. These deals almost never work for either side. The odds of getting a competent, experienced agency to sign on to an arrangement like this are basically zero.\n\nNo successful firm is going to loan money in the form of labor, expertise and operating overhead to a stranger’s business when they already have paying clients. **For every dollar in cost an agency carries, they’ve got to earn three to five times more just to break even.**\n\nNobody with a real business takes that bet.\n\nSo who agrees to these deals? The unsophisticated, the brand-new and the desperate. And there’s a reason they’re desperate: they aren’t yet good at what they do. Pair inexperience with a client who wants free labor and everyone goes down together. It’s a slow-motion train wreck For both trains.\n\nAnd this is before you factor in how a performance-based model is supposed to work.\n\n1. The client funds the operating costs from day one so the agency is only risking profit, not survival.\n2. KPIs have to be clearly defined and entirely within the control of the marketing team.\n3. When those KPIs are hit, the agency earns profit plus a healthy premium for taking on risk. (Yes, the client ends up paying more).\n4. Calls for audit rights, enforcement provisions, revenue-allocation rules, attribution controls, and all the legal scaffolding that makes the deal enforceable. None of that is cheap or simple.\n\nMeanwhile the agency is expected to pay salaries, contractors, tools and ad budget until the client pays out. That assumes the client doesn’t delay, pull budget halfway through, pivot strategy, second-guess every creative decision, or insist their cousin’s ideas override the plan.\n\nThe agency has no control over any of that. Yet their compensation depends entirely on results shaped by forces outside their hands.\n\nTo make one of these things viable, the risk premium would have to be massive and the agency would need investor-level authority. They’d practically have to run the client’s business, set pricing, dictate budget, choose channels, and approve every operational decision. And that, obviously, is never going to happen.\n\nSo instead both sides pretend the math works until it doesn’t. And when it doesn’t, the client still got all that free work and the agency goes in the hole.\n\nYou also see the next layer of pain when deals finally materialize. The client will argue that certain sales “don’t count” because their internal team brought them in. Except marketing touches everything. If you don’t pay on all revenue driven during the engagement, the whole attribution model collapses. This is why these contracts are long, expensive and litigation-prone.\n\nUnderneath it all is one simple fact. Any company pushing this arrangement is either inexperienced, struggling or both. If they were doing well they’d just pay. Paying is easy. Not paying requires mental gymnastics and a willingness to shift risk onto someone else’s balance sheet.\n\nI know Hormozi says “work for free at first“ but he’s never actually run an agency. I’ve been running my own agency longer than he’s been alive. And he doesn’t give a shit if you lose everything.\n\nFlat fees and defined KPIs are simple, fair and stable. They require the client to exercise discernment in who they hire and the humility to let the expert lead. That’s the part many of these “partners” seem unwilling to do.\n\nIf you’re considering one of these deals, save yourself the headache. The numbers don’t lie. The risk doesn’t lie. And the pattern never changes. It’s a sucker’s bet every time.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1764852618.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.66,
    "category_rationale": "Emotional critique of commission-based offers with supporting points.",
    "composite_score": 3.0057417095563546
  },
  {
    "score": 48,
    "title": "Got 291 leads through this Cold Email tech stack",
    "selftext": "Just wanted to share the tech stack that’s been driving my cold email campaigns recently. This month, it’s already landed me 291 leads (and counting)\n\nHere’s the breakdown of whats been working for me:\n\n1) Clay - This is my secret weapon for lead gen. It pulls data from multiple sources, lets you build AI prompts to personalize your emails and helps organize your entire campaign like literally it does everything from start to finish\n\n2) ListKit - This one is for the big wins. A database with 500M B2B leads and you only pay for verified leads and you can export thousands in minutes.\n\n3) Ocean - Perfect for building lookalike audiences of your best customers. It helps you find companies that resemble your top performing clients.\n\n4) Premium Inboxes - If you are serious about inbox deliverability then this one is crucial. They are the best for reselling Google inboxes which keeps your cold emails running smoothly.\n\n5) Apollo - The go to tool for building lead lists from scratch. I use it religiously to find the right companies and prospects to target and its like a goldmine for B2B leads\n\n6) FindyMail - This tool is a game changer for email enrichment and validation. Its like Apollo + LinkedIn Sales Navigator but better. You will never send an email to a bad address again.\n\n7) SmartLead - The email sending software I use to manage inboxes and ensure everything is being delivered perfectly. This one helps keep things running efficiently\n\n8) Airtable - I run my entire cold email operation on Airtable. Its where I track everything: from inbox management to client KPIs and automations. Its super customizable and easy to use.\n\n9) Response.ai - If you want to stand out use Response.ai as It lets you send personalized videos at scale trust me it makes a huge difference in engagement.\n\n10) LinkedIn Sales Navigator - You cant beat LinkedIn when it comes to up to date B2B data. Its where I source most of my connections.\n\n11) Crunchbase - If you are ever looking for company details or news then Crunchbase is a goldmine. You get insights into company financials, growth and more and Its a must have in my toolkit.\n\n12) StoreLeads - Great for finding Ecom brands that are ripe for outreach.\n\n13) MillionVerifier - MillionVerifier is a solid tool for email validation and keeping your inbox clean (no more bounces)\n\n14) Scrubby - For those riskier “catch-all” emails as Scrubby ensures you dont end up wasting time on invalid addresses.\n\n15) Notion - I keep all my internal docs organized on Notion. Its a game changer for collaborating and keeping track of project details.\n\n16) Gamma - This is where I create my sales assets. Its fast, simple and has great templates for cold email campaigns.\n\n17) ChatGPT - Cant forget this one. ChatGPT helps me refine my industry research and create smarter cold email copy for $20/month it’s totally worth it.\n\nThats my tech stack thats been driving results. Every tool is critical for different aspects of my cold email process and together they help me scale efficiently and effectively",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1745000533.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "A curated list of 11 lead-gen tools with brief descriptions.",
    "composite_score": 3.0641660843645324
  },
  {
    "score": 46,
    "title": "Lead Generation in an IT company - finding ways to improve my work",
    "selftext": "Hi there, so I am a student working partly as a leadgen specialist in a czech IT company that provides web/software/app development. I am pretty new to this field, its only my 3rd month in. I got this opportunity through one of my best friends who works as a business developer here. 4-5 months ago the ceo of this company came in with the idea of having a leadgen specialist inhouse, so here I am.  \nSo far I was looking for companies with outdated websites or non-existing mobile apps, then I was gathering some info about them and writing it down to excel sheet. Then the business dev. friend was making personalized cold mails to them. In my eyes this is not the most atractive way of getting leads, but I can't say it doesn't really work. The thing is it takes so much time to find a company that could use our solution..  \nOn the other hand I started trying some online networking to make some contacts abroad, mainly through LinkedIn, Discord or here on reddit. I guess it's a bit of a long haul, but it can pay off.  \nThese 2 ways are my current focuses + ofc some other smaller tasks.\n\nHowever, I came here for some advices. I think I am not as effective as I should (or could?) be myself. Also last week I had a talk with our ceo and he said that so far he is not satisfied with my work, cut my salary a bit and demanded of me working for more hours as well.  \nI was thinking what I could do different. I know that common thing is to make some kind of ad that leads to landing page on our website, where we can gather emails of potential leads and then sent them some newsletter or e-books etc. but I don't think it would be the case here since the ceo doesn't really want to pay for things like that - in 2023 they spent high amount of money on marketing and it didn't pay off. There is some kind of google ad running rn, but it's in the hands of our marketer.  \nOther thing I was thinking of is content marketing. Currently our marketer makes some boring informational videos about our services. I think we could do something more interesting like short sketches or some informational posts with nice graphic showing our interest and knowledge in the field.\n\nWhat do you guys think? As I said I am pretty new to this and with every meeting I am learning new things and ways. All I want is to get some new ideas and be more usefull as there are some other friends working in this company as coders and I really enjoy working with them.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 46,
    "downs": 0,
    "created_utc": 1738143200.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "A personal narrative seeking advice with no clear model or steps.",
    "composite_score": 3.185249108319361
  },
  {
    "score": 48,
    "title": "What’s one weird data point that ended up outperforming all your “standard” targeting filters?",
    "selftext": "Lately I’ve been rethinking how I build audiences, mostly because the classic filters (industry, employee range, tech stack, job titles, etc.) have been giving me really “meh” results. They’re fine for broad targeting, but they don’t really tell you who’s actually moving or who’s worth reaching out to right now.  \n  \nWhat’s been working way better for me is paying attention to the small, underrated signals the kind of stuff that doesn’t show up in normal enrichment tools. Things like:  \n  \n\\- Sudden changes on a careers page (hiring spree vs. hiring freeze)  \n  \n\\- A product page being quietly updated before an announcement  \n  \n\\- A spike in leadership-level LinkedIn activity  \n  \n\\- Website tech changes that suggest a new initiative  \n  \n\\- Brand-new FAQs or help docs that hint at product rollouts  \n  \n\\- Even little things like new compliance badges showing up in the footer  \n  \nNone of these are “official intent,” but they’ve consistently turned into higher-intent leads for me than any static filters. It’s almost like the micro-signals are more honest than whatever the CRM says.  \nSo I’m curious how other people approach this.  \nWhat’s one weird or obscure data point you’ve used that ended up being way more predictive than the traditional stuff?  \n  \nAlways looking to steal smarter ideas haha.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1764085634.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Proposes micro-signals as a superior data point and explains the rationale.",
    "composite_score": 2.9729205407176504
  },
  {
    "score": 43,
    "title": "LinkedIn just changed everything...",
    "selftext": "If you havent noticed yet that LinkedIns latest update just rocked the B2B lead gen world\n\n\n\nA bunch of third party data tools that relied on LinkedIn’s data are gone\n\n\n\nSeamless.AI? Blocked\n\n\n\nApollo? No more LinkedIn enrichment\n\n\n\nIf your outbound strategy was built on these platforms then you have likely seen the impact already\n\n\n\nThis isn’t just another update instead this is the beginning of a major shift in how B2B lead generation is done as for years tools like Apollo were quietly pulling data from LinkedIn and working in the background to fuel your outreach and now that data stream is cut off exposing just how fragile some of these systems really were\n\n\n\nThe fallout from this change is that lead list quality is tanking, personalization is harder to pull off and the outbound teams that relied on scraping and blasting are struggling to adapt\n\n\n\nBut dont panic as this isnt all doom and gloom\n\n\n\nAs what we are seeing now is the death of the lazy, bloated outbound stacks and the tools and tactics that relied on low effort data are fading away\n\n\n\nWhats rising up is a much sharper, more effective approach:\n\n\n\n\\-Layered enrichment with tools like Clay, Clearbit and Crunchbase\n\n\n\n\\-Manual curation for high value segments that actually convert\n\n\n\n\\-Behavioral triggers replacing vanity metrics and random data points\n\n\n\nThe truth is, this shift is bigger than most people realize\n\n\n\nOutbound isn’t dead but the shortcuts are and to survive, we need to move beyond the “set it and forget it” mentality and build smarter, more focused systems\n\n\n\nSo start refining your lead generation strategies now and shift to a higher quality, more intentional approach and Its time to build systems that rely on real value and not just scraped data\n\n\n\nIf you are still playing by the old playbook then you are going to get left behind so adapt now and take advantage of this new era of outbound lead gen",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1745674760.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Editorial guidance on adapting to a data-shifted outbound landscape with high-level strategies.",
    "composite_score": 2.90108892903784
  },
  {
    "score": 44,
    "title": "Is LinkedIn Sales Navigator actually worth it anymore",
    "selftext": " My experience with LinkedIn Sales Navigator spans several months but I remain uncertain about its worth for the  investment. The tool helps me find prospects , I won't deny its usefulness. The platform provides effective filtering  tools which help me quickly discover suitable leads.\n\nBut its usefulness appears to stop at this point. The process of finding contacts requires me to duplicate information manually while switching between different tools  to maintain organization. The process of building my lead list requires more time than actual outreach activities. The  tool's supposed purpose to streamline prospecting does not match the awkward workflow it presents to users.\n\nI  need to know how others achieve real value from this tool. What does your outbound process look like when  you use Sales Navigator as your core tool? The tool functions as a good prospecting layer which requires  users to build additional functionality through other tools. Does anyone have tips about how to maximize my use of Sales Navigator or should I accept that this is its standard operation?",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1745911989.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "A question about optimizing use of Sales Navigator with some user experience critique.",
    "composite_score": 3.269409393686828
  },
  {
    "score": 43,
    "title": "What Lead Generation Method Has Brought You the Most Success?",
    "selftext": "Hi everyone,\n\nI’m curious to learn from this community about the lead generation strategies that have truly worked for you. Out of methods like direct messaging (DM), email campaigns, paid advertising, and content marketing, which one have you found to deliver the best results and highest quality leads?\n\nIf you could share a bit about your experience or any insights on why a particular approach stood out, that would be really helpful. Also, feel free to mention any tools or tactics that complemented your lead generation efforts.\n\nLooking forward to hearing your thoughts and success stories!\n\nThanks in advance!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1754042448.0,
    "media": null,
    "is_video": false,
    "num_comments": 138,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Requests experiences on effective lead-gen methods; lacks a defined model or steps.",
    "composite_score": 3.449960076613235
  },
  {
    "score": 41,
    "title": "I've hired 50+ SDRs for my clients, wasted a ton of money. Here's what I learned.",
    "selftext": "Just spent another Friday letting an SDR go. Third one this year. Figured I'd share some hard lessons from someone who's made every mistake in the book.\n\nLook, hiring sales people is a crapshoot. Those perfect interview answers? That polished LinkedIn? Means absolutely nothing once they're on the phones.\nAfter years of headaches, here's my real-world filter:\nOne- I stopped caring about where they worked. Had a guy (ex-SAP) who couldn't hack it, then hired a barista with zero sales experience and nothing but good English and willingness to learn, he crushed it. Experience is BS (someeetimeeeessss)\nInstead, I give them a real scenario: \"Here's Company X, they just raised funding, switched CRMs, and they’re rapidly growing . What's your play?\" The ones who get creative instead of just saying \"I'd send them an email about our services\" are worth talking to.\n\nSecond - a followup separates the professionals from the amateurs. When a prospect says \"we're good\" - that's where real SDRs earn their money. I literally ask candidates \"what would you do if someone says they're all set?\" The mediocre ones say they'd \"circle back in a few months.\" The good ones have specific, value-add tactics ready to go.\nThird- I was paying way too much. My best performers now? They're from smaller shops where they had to work twice as hard for half the recognition. (Ps: we don’t overwork anyone)\n\nBonus tip that saved my budget: Give them work-life balance. Don’t bombard them with emails and texts after working hours, reimburse them when overtime is needed. Don’t be the butthole boss\n\nAnyone else feel like hiring SDRs is just expensive gambling, or just me?",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1743585465.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Shares actionable SDR hiring lessons and concrete tactics that can be followed as a protocol.",
    "composite_score": 3.0219606308090037
  },
  {
    "score": 44,
    "title": "So many people complaining. Either I’m lucky or they don’t know the game.",
    "selftext": "Honestly, email is still stupidly underrated for consulting businesses.\n\nWorked with a consulting agency in Australia they help manufacturing companies clean up their operations and logistics. Pretty unsexy work but actually high-margin.\n\nThe owner was convinced they needed to dump thousands into fancy LinkedIn ads to “stay visible.” Meanwhile, they literally had an old spreadsheet of everyone they’d ever pitched or done a workshop for going back like 7 years.\n\nI just asked, “When’s the last time you reached out to any of these people?”\n\nHe shrugged. Basically never.\n\nSo we cleaned up the list, removed dead emails, and sent out a super plain text email. No design, no fancy copy:\n\nSubject: Quick question about your ops planning\n\nHey [Name],\n\nHope you’re well. Just wondering if you’re revisiting any process improvements or supply chain stuff this year. Happy to share what’s working with similar businesses.\n\nThat’s it.\n\nWithin a week, he had a bunch of replies and 10–15 calls booked. Landed 3 projects from it, all from people he already knew.\n\nNo ads. No complicated funnels. Just…a friendly email.\n\nIf you’ve been sitting on old contacts thinking they’re “cold,” maybe don’t overthink it.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1751802447.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Vent about wasted ad budgets and overhyped tactics with a preference for simple outreach.",
    "composite_score": 2.923908856354456
  },
  {
    "score": 41,
    "title": "Is there anyone here who actually knows how to deliver real leads?",
    "selftext": "I've worked with multiple people from this sub and similar ones, and it's always the same story. They promise results, ask for a flat rate plus commission, do some vague lead gen work, and never deliver what they said they would. Once they get the deposit, the results disappear.\n\nAt this point, it seems like most of them just live off deposits.\n\nI'm not working with anyone unless it's purely performance-based. You bring in deals, you get paid.\n\nI run a high-end branding and design agency. Our projects start at $5,000, and I'm offering 20% per deal closed. $10k deals = I'm offering 25%.\n\nIf you can actually deliver, let’s talk. If not, please don’t waste my time.\n\nAt this point, I've had enough of people calling themselves experts without actually proving they can deliver.\n\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1750240175.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Expresses frustration with unreliable providers and advocates for performance-based deals.",
    "composite_score": 3.367909977289222
  },
  {
    "score": 42,
    "title": "Built a small scraper that grabs emails + LinkedIn profiles from a big data source. It’s working really well.",
    "selftext": "Way cleaner and faster than I expected. Originally made it for fun, just to test some things, but it turns out it’s actually super useful for outreach, recruiting, or lead gen.\n\nI’ve had a few people try it already and the feedback’s been solid. It gives you clean, accurate info without paying a fortune for tools that overcharge for the same thing.\n\nIf you wanna test it out, I’m letting people try it for free for now.   \n  \nJust shoot me a DM and I’ll hook you up.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1742935904.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Describes a scraper tool and its benefits, plus an offer to test it.",
    "composite_score": 3.3384684555795863
  },
  {
    "score": 42,
    "title": "Got hit with this masterpiece of a cold email-can we stop with this kind of copy already?",
    "selftext": "Just got this in my inbox and I had to share it here. It’s the kind of email that makes you want to unsubscribe from the internet:\n\n⸻\n\nHi,\n\nHope you’re doing well!\n\nI came across your website and noticed that some of our services align perfectly with your business needs. We specialize in building custom digital solutions, backed by a team of 120+ professionals dedicated to enhancing your online presence.\n\nOur expertise includes:\n\t•\tWebsite Design &amp; Development\n\t•\tSEO &amp; Google Business Profile Optimization\n\t•\tSocial Media Marketing (SMO, PPC, Facebook, Twitter, LinkedIn)\n\t•\tContent Writing &amp; Graphic Design\n\nOur pricing is highly competitive-less than half of what other companies charge-without compromising on quality. Would you be interested in receiving our service packages and pricing details?\n\nFeel free to reply with any questions. Looking forward to hearing from you!\n\n⸻\n\nWhere do I even start?\n\n- No personalization. “Hi” doesn’t cut it.\n- Talking only about themselves. Zero value for me, the reader.\n- Generic service list. Reads like it was copy-pasted from a 2012 Upwork profile.\n- “120+ professionals”-great, but how does that help me?\n- Spammy phrasing like “highly competitive” and “FREE” (if they had used it).\n- No hook, no pain point, no reason for me to care.\n\nIf your cold email sounds like this, just know it’s going straight to the trash-or better yet, posted here for feedback.\n\nRant over.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1746724219.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.83,
    "category_rationale": "Emotional critique of a bad cold-email copy with venting and moral framing.",
    "composite_score": 3.0343323735883825
  },
  {
    "score": 38,
    "title": "This Prompt Completely Changed the way I acquired Clients and got hundreds of positive replies",
    "selftext": "I used to think cold email was just a numbers game. More volume, more chances, right? So I sent out hundreds, sometimes thousands, of emails a week. The result? A couple of weak replies, mostly \"Not interested\" or worse—being ignored. It was frustrating, borderline humiliating, and I started questioning if this was even worth it.\n\nThen I realised: the problem wasn’t the volume. It was the approach. I was treating prospects like faceless leads instead of real people. My emails were robotic, filled with generic pitches and fluffy introductions. So I switched things up—ditched the long intros, got straight to the point, and made it about *them* instead of *me.*\n\nThe difference was night and day. Instead of sounding like just another salesperson, I started conversations. Instead of begging for calls, I made them want to talk. Suddenly, replies weren’t just happening—they were turning into actual meetings.\n\nIf you’re stuck in the cold email black hole, try this: Cut the fluff, make it personal, and show them why they should care. It’s not about *you*—it’s about *them.*\n\nand this is the exact prompt to use in CLAY to craft super personalised emails and literally people charge hundreds of dollars to craft a one in for all prompt:\n\n**Template To Make Any PROMPT:**\n\nI want you to act as {{role}} + {{context}}\n\nI want you to {{task}}\n\n{{Requirements}} {{instructions}}\n\n{{examples}}\n\n**Linkedin Profile visit: via clay gent**\n\n* This is to find out a line for leadamax to get lines based on profile if not then headline \n\nHere’s a polished and detailed version of your prompt, tailored for a lead generation agency targeting B2B Martech SaaS founders and decision-makers:\n\n# \n\n**Role and Objective**:  \nI want you to act as a **lead generation specialist** targeting **B2B Martech SaaS founders and decision-makers** on LinkedIn. Your goal is to craft a **personalized first line** referencing their most recent LinkedIn post in an authentic, engaging way that demonstrates genuine interest and encourages further conversation.\n\n**Task**:  \nVisit the LinkedIn profile provided in the input. Your primary task is to find their most recent post and summarize its content in a concise, conversational tone.\n\n* **Output Prefix**: \"Just read your post about…\"\n* If no recent posts are available:\n   * Use an alternative personalization method by mentioning their **headline, featured section, or experience**(see instructions below).\n\nRequirements\n\n1. **Content Analysis**:\n   * Summarize their most recent post in **15 words or fewer**, clearly showing you’ve understood its key point or insight.\n   * If the post highlights **metrics or measurable achievements**, include those in your response.\n2. **Tone and Engagement**:\n   * Keep the response **positive, appreciative, and conversational**, aligning with their tone and the post’s theme.\n   * Show excitement or curiosity that opens the door for further discussion.\n3. **Fallback Plan (if no posts are available)**:\n   * Check the prospect’s **headline**, **featured section**, or **current role**.\n   * Formulate a first line that references their **position, achievements, or company mission** using the prefix:\n      * **\"Noticed you’re the \\[role\\] at \\[company\\]—excited to see how you’re innovating in \\[industry/niche\\]!\"**\n\nInstructions\n\n1. **Visit LinkedIn Profile**:\n   * Use the provided LinkedIn profile link and click on “Show all posts” to locate their most recent content.\n2. **Content Extraction**:\n   * Identify the main topic, highlight, or insight from the most recent post.\n   * Focus on measurable outcomes, innovative ideas, or key strategies they shared.\n3. **Fallback Personalization**:\n   * If no recent posts are available:\n      * Reference their LinkedIn headline (e.g., \"Scaling B2B SaaS with data-driven marketing\").\n      * Mention their current company or a notable milestone from their experience.\n4. **Formulate Output**:\n   * Write the first line starting with the appropriate prefix:\n      * If post found: \"Just read your post about…\"\n      * If no post: \"Noticed you’re the \\[role\\] at \\[company\\]…\"\n5. **Formatting and Accuracy**:\n   * Ensure the response is tailored, error-free, and adds value to the conversation.\n\nExamples of Output\n\n**When a Post is Available**:\n\n* \"Just read your post about how your team boosted demo-to-close rates by 40%—amazing insight!\"\n* \"Just read your post about leveraging intent data for outbound—brilliant strategies for scaling Martech.\"\n* \"Just read your post about the challenges of aligning marketing and sales—great actionable advice!\"\n\n**When No Post is Available**:\n\n* \"Noticed you’re the VP of Growth at \\[company\\]—excited to see how you’re driving innovation!\"\n* \"Noticed your work on \\[specific achievement from experience\\]—truly inspiring for the Martech space.\"\n* \"Excited to connect! I see you’re leading \\[company\\]—would love to learn more about your approach to scaling.\"\n\n***P.S.Make sure you tweak it to your saas, service or business.***\n\nHopefully you all loved it!!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1742509970.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Contains a reproducible approach with steps and a prompt template for personal outreach.",
    "composite_score": 2.8381245983544616
  },
  {
    "score": 34,
    "title": "How do you decide what order your enrichment tools run in?",
    "selftext": "I’ve been playing around with my enrichment stack and realized I’ve never actually seen a good framework for deciding what order tools should fire in. Some people go to cheapest most expensive, others go “most accurate first,” others run everything in parallel and pray their credits don’t evaporate.  \nI’ve been trying to build something a bit more logical, but every provider has different strengths depending on industry, region, and even company size. Curious how other people structure it. Do you base it on accuracy, cost, coverage, freshness, or something else entirely?\n\nEdit :  I’m trying to set this up in Clay right now, which is why I’m overthinking the order. The nice part is you can stack providers in a waterfall so you’re only paying when something actually fills, but I’m still figuring out the best logic for which one should fire first. Some tools are great for certain regions, some are better for small companies, some are only good for phones or emails, so I’m just trying to build something that works well.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1764603832.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Asks for a framework to order enrichment tools; primarily a discussion prompt rather than a structured guide.",
    "composite_score": 2.861704296901929
  },
  {
    "score": 35,
    "title": "How do you guys generate email leads without spending a fortune?",
    "selftext": "I’m trying to generate around 10,000 targeted email leads for outreach, but most platforms like Apollo.io or ZoomInfo are either too expensive or come with strict export limits.\n\nFor those of you doing cold outreach or running agencies:\n\nWhat affordable tools or methods are you using to get email leads?\n\nAre there any underrated tools or workarounds you’d recommend?\n\nHow do you balance cost vs. quality when it comes to lead lists?\n\n\nAppreciate any tips, hacks, or workflows that help reduce costs but still get good results. Thanks in advance!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1747501444.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Question seeking affordable methods/tools for generating email leads; lacks a structured guide.",
    "composite_score": 3.243196414440065
  },
  {
    "score": 32,
    "title": "Absolutely new to lead gen - advice",
    "selftext": "I'm in the process of launching a new venture and I’m in full “open to any and all advice” mode\n\nI’ve been doing my research on paid ads, organic content, cold outreach, and SEO, but I know there’s a lot of nuance and hidden gems out there. I’d love to hear:\n\nUnique lead gen tactics you’ve tried that worked surprisingly well\n\nTools or tech stacks you swear by \n\nLow-cost or zero-cost ways to get initial traction\n\nWays you’ve built trust with cold audiences fast\n\nAny underrated channels most people overlook",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1755250539.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.57,
    "category_rationale": "Asks for general advice on lead generation; discussion-oriented.",
    "composite_score": 3.066515611695287
  },
  {
    "score": 34,
    "title": "As a Decision Maker, This Cold Email Agency Owner Lost My Business Before We Even Spoke. Here's Why.",
    "selftext": "I had an experience recently that I think serves as a potent reminder of how easily a potential client can be turned off, especially when you're selling services that hinge on personalization and smooth processes. I'm sharing this because, as someone who's been in the game for nearly two decades, these are the details that matter.\n\nFor context: I'm a former marketing executive, now a marketing consultant. Over my 20-year career, I've sat in the decision-maker's chair countless times, interviewing and hiring a wide spectrum of agencies.\n\nI'm currently serving as a fractional CMO for a small IT company. One of my key initiatives is to build out a cold email outreach program. Since the internal team doesn't have the bandwidth, I'm considering hiring a specialized cold email agency.\n\nThis week, I decided to reach out to someone I'd seen frequently on various marketing subreddits (including this one). He often posts generic (but generally sound) cold email tips and tricks. He posts from different profiles sometimes, but the style is usually a dead giveaway. Still, as a marketer, I respect the hustle. His content suggested he at least understood the fundamentals of cold email, so I figured a conversation was worthwhile.\n\nIt went sideways when I sent a DM asking for a meeting to discuss his cold email agency services. His response? Essentially, \"Here's a link to my site, book a meeting yourself.\" (I'm paraphrasing slightly, but that was the gist).\n\nOkay, let's pause here. This is a red flag because I'm reaching out about cold email services. The cornerstone of effective cold email is the effort to create a genuine connection and a seamless transition from initial contact to a meaningful conversation. Sending me to his homepage – not even a direct Calendly link – to do the legwork felt dismissive and, frankly, lazy. It immediately signaled a potential disconnect between what he preaches (personalized outreach) and what he practices. If anyone on my teams had ever handled a warm lead that way, they'd be sent straight back into retraining.\n\nDespite this, I decided to give him the benefit of the doubt. Maybe he was swamped. Maybe a Reddit DM doesn't register as a serious lead for him (though, why be active there if not to generate leads?).\nSo, I navigated his site, found the contact page (which, surprise, led to a Calendly link), and clicked to schedule.\n\nRed flag #2 is what really killed any interest. His Calendly page greeting was written in ALL CAPS and screamed something like: \"DON'T BOOK IF YOU'RE GOING TO WASTE MY TIME WITH WINDOW SHOPPING.\"\n\nWow... Okay...\n\nThis told me two critical things:\nFirst, Immaturity: This kind of aggressive, unprofessional language immediately signals that he's likely difficult to work with and defensive.\n\nPoor Business Acumen: As a consultant, I pitch constantly. Of course, some prospects are \"window shopping\" or primarily focused on pricing initially. That's part of the sales process! I've won many great clients who started the conversation that way. To preemptively accuse potential clients of wasting his time is incredibly shortsighted.\n\nIn this scenario, I was the ideal lead:\n - I initiated contact.\n - I had a clear need (and stated it).\n - I had the budget.\n - I had the intent to hire.\n\nThis should have been a slam-dunk for him. Instead, he introduced significant friction and planted major doubts before we even had a chance to speak. He made it harder for me to give him business.\n\nSo my advice to all you agency owners out there is first to practice what you preach: If you sell personalization, be personal. Second make it easy for leads: Reduce friction at every step, especially for warm inquiries. A direct link to your booking page is a minimum. Be professional always: Your public-facing materials, including your booking page, are an extension of your brand. Hostility is never a good look. Remember, even \"window shoppers\" can become buyers or referrers.\n\nHope this perspective from \"the other side of the table\" is helpful!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1747508114.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Personal anecdote with a strong negative stance about cold email outreach practices.",
    "composite_score": 3.0272192947339196
  },
  {
    "score": 31,
    "title": "One cold email can change your life",
    "selftext": "Here's how to write a great one:\n\nI’ve sent (and received) a lot of cold emails some great nd some not\n\nI have learned that cold email success is never an accident\n\nThe features of a great cold email:\n\n\\- Short &amp; Sweet\n\n\\- Personalized\n\n\\- Credentials or Social Proof\n\n\\- Create Value\n\n\\- Clear CTA\n\nLet's cover each:\n\n1 Short nd Sweet\n\nIf you're sending a cold email to someone remember that the person receiving it probably gets a lot of these so they don't have time (or energy) to read through long and winding notes\n\nKeep it short and sweet\n\nSpace out the text to make it optically inviting\n\n2 Personalized\n\nNo one likes a generic email and tbh it's auto deleted 99% of the time\n\nPersonal touches make all the difference\n\nA few ideas:\n\n\\- Reference a book they love\n\n\\- Mention a podcast they were on\n\n\\- Compliment their work\n\nMake it clear that you didn't send out hundreds of the note\n\n3 Credentials or Social Proof\n\nInfuse credentials or social proof i.e reasons the person should take you seriously\n\nDon't be humble let it shine\n\nWhat have you done or created that is interesting or notable? Who has engaged?\n\nShow them they would be crazy to ignore your email\n\n4 Create Value\n\nThe foundational rule (in business and life) is create value receive value\n\nIf you create value for the person you’re emailing then they are much more likely to engage.\n\nWhat can you do to save them time or reduce their stress?\n\nIt can be small as a little goes a long way.\n\n5 Clear CTA\n\nEvery successful cold email has a very clear call to action\n\nIt has to be specific and succinct\n\nUse hard enters and spacing to make sure it stands alone in the body of the email. It should be effortless to find and understand the ask\n\nBe bold but don't overreach\n\nFollow me for more sh\\*t on Cold Emails",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1742568391.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Presents a numbered list outlining the features of a great cold email.",
    "composite_score": 2.6426499783199064
  },
  {
    "score": 32,
    "title": "How do you qualify leads to ensure higher conversion rates?",
    "selftext": "Hello, LeadGeneration community! \n\nLet's talk about a crucial aspect of lead generation that can make all the difference in boosting conversion rates: **lead qualification**. Qualifying leads effectively involves identifying the most promising prospects and focusing your efforts on those with the highest potential to convert into customers. Speaking of which, I just switched to **WarpLeads** from using **Apollo** since their unlimited export leads feature worked better for me. If you have any other lead provider app suggestions, feel free to share!\n\nI have a few questions:\n\n**Do you have a specific process or criteria for qualifying leads?**\n\n**How do you determine if a lead is ready to move down the sales funnel?**\n\nShare your strategies, tips, and best practices for lead qualification that have worked well for you. I’m all ears! ✨\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1719761488.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.56,
    "category_rationale": "Discusses lead qualification; asks for processes and tips.",
    "composite_score": 2.999712938827366
  },
  {
    "score": 31,
    "title": "What’s working best for lead generation in 2025? Let’s share real results, not just theories.",
    "selftext": "Lately, I’ve been noticing that lead generation strategies are shifting fast... especially with how AI and automation tools are being used. But it’s still clear that no single method works for everyone.\n\nIn my experience, success depends on how well you understand your audience and create a process that fits their journey... whether it’s through content funnels, email outreach, or paid ads. For example, I’ve seen small campaigns perform better simply because they focused on clear messaging and trust-building, not just volume.  \n\nCurious to hear from you all:  \n👉 What lead generation method has actually brought you the most consistent results this year?  \n👉 Are you using AI tools or still prefer manual, relationship-driven outreach?\n\nLet’s trade notes — what’s *really* working for you?",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1759548653.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks what’s working in 2025; discussion-based questions.",
    "composite_score": 3.1923449816423624
  },
  {
    "score": 31,
    "title": "How We Got a 38% Reply Rate on Our Cold Outreach Campaign",
    "selftext": "Hey everyone,\n\nMan, I have to share this with you all. We FINALLY cracked the code on our outreach after months of dismal reply rates that had our sales director breathing down our necks.\n\n1. Define Our ICP:\nWe start by clearly identifying our ideal customer profile industry, company size, funding stage, etc. Nothing groundbreaking here, but you'd be shocked how many teams skip this step.\n\n2. Deep Research:\nWe manually research each company using tools like:\n- LinkedIn Sales Navigator\n- Crunchbase\n- Company websites &amp; LinkedIn profiles\n\nSounds tedious? It absolutely is. I spent three hours last Tuesday stalking a CFO's LinkedIn activity to find something relevant to mention. Worth it though.\n\n3. AI Powered Data Extraction:\nWe use AI to pull insights we may have missed manually. By inputting URLs (site, LinkedIn, etc.), we gather details like company stage, tone, and key priorities.\n\n4. Email Enrichment &amp; Personalization:\nWe enrich the lead data using email enrichment tools, then craft a hyper personalized opening line. This part is critical we spend time making it specific and relevant. I was the worst at this until my colleague Sarah showed me her approach (thanks Sarah!).\n\n5. Writing the Email:\n- Short (under 10 seconds to read)\n- Focused on one clear pain point\n- Straight to the value we offer\n- No fluff\n\n6. Multi Channel Follow-Up:\nWe don't just rely on email. Our follow up includes:\n- Cold emails\n- Cold calls\n- SMS before the call (sent with the SDR's name)\n\nThat last part sending a short SMS before calling boosted our answer rate by 23%. It's a small touch, but it makes us stand out and feel more human. I thought my boss was crazy when he suggested this, but now I'm a total convert!\n\nHope this helps some of you who are currently in the reply rate trenches. Trust me, I've deleted enough \"Following up on my previous email\" templates to last a lifetime.\n\nWhat's one personalization tactic or outreach trick you've found surprisingly effective? I'm always looking to steal good ideas!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1746061588.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.94,
    "category_rationale": "Provides a step-by-step outreach playbook with defined stages.",
    "composite_score": 2.940136652305315
  },
  {
    "score": 29,
    "title": "If you're still using Apollo you're missing out on 50% of your market",
    "selftext": "Today I was making a campaign for a client and I wanted to find emails for decision makers \nSo (in clay) I used claygent to find out \"owners\"\n\nAnd then used prospeo to find there email addresses\n\nObviously prospeo couldn't find emails for all of them \n\nSo I ran another search to find any email associated with the domain \n\nas a result I got a bunch of emails\n\nThen i did another claygent prompt to find out any other decision maker (founding member) beside the owner\n\nAnd I matched names with emails\n(that prospeo gave me in second search) \n\nAnd then because I wanted to get the most out of my list I also included generic info emails because usually for smaller companies they go in founders inbox\n\nAfter verification I got close to 500 verified emails out of 700 total\n\nIf I were using Apollo to find their emails I probably would've had 200-300\n\n(Sharing this in case anyone finds it helpful) \n\n\n\n\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1745235433.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Contains a sequential, actionable workflow to build a verified email list.",
    "composite_score": 3.002622926537062
  },
  {
    "score": 31,
    "title": "How I Use LinkedIn Sales Navigator for lead generation",
    "selftext": "So I have been using LinkedIn Sales Navigator for a while now and honestly its a game changer. I am not talking about just browsing profiles and crossing my fingers instead I am talking real lead gen, consistently bringing in new prospects. I figured I would share how I have been using it plus a few little tricks to get the most out of it\n\n\n\nQuick Overview of Sales Navigator First things first Sales Navigator is great but its not perfect. You dont get business emails directly from the platform (I mean come on LinkedIn...) and the search results are often a bit off (like 30–35% accuracy on average) still, there is a ton of potential here if you know how to use it\n\n\n\nWith the right settings you can scrape up to 2,500 leads in a single search (25 results per page x 100 pages) That is a lot of people to reach out to\n\n\n\nHow I Do It: Scraping Sales Navigator Like a Pro Here is how I approach it:\n\n\n\nBasic Accounts + Filters: You can either start fresh with a simple search or import company domains and contacts to filter down\n\n\n\nScraping Groups, Events, Job Postings and Company Followers: I scrape all the good stuff like groups, events and more and this helps me find people who are already active and engaged\n\n\n\nSearch for Keywords Like a Pro\n\n\n\nIf you’re looking to search for specific job titles or industries then you are gonna want to use the two main keyword search features:\n\n\n\nGlobal Keyword Search: This looks through the entire profile (description, job experiences, skills, etc) which is perfect for broad searches.\n\n\n\nCurrent Job Title Search: This narrows things down to just their current role and so if you’re looking for someone who is currently a marketing manager then this is the way to go\n\n\n\nLinkedIn Boolean Search (A Total Game Changer)\n\n\n\nNow here is where you can really get granular and If you are not using Boolean search yet then you are missing out. Its all about using AND, OR, NOT and parentheses to combine search terms\n\n\n\nSearch for Exact Phrases: Use quotes for example “sales manager”\n\n\n\nUse AND to Combine Terms: Looking for leads with “Sales AND Director” will get you profiles with both those terms\n\n\n\nUse OR for Alternates: This is helpful if you are dealing with multiple terms for the same thing like \"Sales Operations\" OR \"Sales Ops\" gets you both\n\n\n\nUse NOT to Exclude Terms: This is great when you want to filter out stuff you dont need example “CEO NOT Assistant” will exclude anyone with the word “Assistant” in their title\n\n\n\nUse Parentheses to Combine Queries: Example \"Marketing AND (B2B OR B2C)\" will get you results for either B2B or B2C marketers\n\n\n\nHow to Export the List of Leads\n\n\n\nOnce your Boolean search is all set then you can export your lead list into a CSV file using a tool like Evaboot and this makes it super easy to keep track of your leads and start reaching out\n\n\n\nTwo Ways to Scrape Sales Navigator\n\n\n\nNow when it comes to actually scraping this data you have got two options:\n\n\n\nChrome Extension: Theres a ton of Chrome extensions out there that can help you scrape data but be careful though as some can be risky. I recommend Evaboot or SalesQL for scraping leads securely and these tools grab things like:\n\n\n\nFirst Name, Last Name, Job Title, Company Name, Company Website and LinkedIn URL\n\n\n\n2) Headless Browser (Recommended): If you want to go all in a headless browser like PhantomBuster will let you scrape more data without relying on your LinkedIn profile its a little more technical but super effective for bulk scraping\n\n\n\nExtra Tips to Get Even More Out of LinkedIn Sales Navigator\n\n\n\nGroups: Scrape people who are members of LinkedIn groups relevant to your industry\n\n\n\nCompany Followers: Look at the followers of companies you are targeting as these are people who are actively engaging with the brand\n\n\n\nJob Postings: If a company is hiring then its a green light for reaching out\n\n\n\nEvents: Target attendees of relevant LinkedIn events for more engaged prospects\n\n\n\nEmail Enrichment\n\n\n\nOnce you have got your lead list you can enrich it with email addresses using tools like Findymail or DropContact and this way you dont just have LinkedIn profiles instead you have got full contact info to reach out\n\n\n\nHonestly Sales Navigator has been a total game changer for lead generation and Its not perfect but with the right setup its super effective and once you start combining it with scraping tools you can get a pretty solid list of prospects to reach out to",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1745109695.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Step-by-step approach to using LinkedIn Sales Navigator for lead generation.",
    "composite_score": 2.9258318603994
  },
  {
    "score": 29,
    "title": "Anyone else realizing your CRM only tells you what happened, not what’s about to happen?",
    "selftext": "I’ve been digging through our CRM lately and it finally hit me how useless most of the core fields are when it comes to actually making decisions. Everything in there is basically a historical record. Job titles from months ago. Outdated employee counts. Old interactions. Stale notes. Lead statuses that mean nothing anymore because the person changed roles twice.  \n  \nMeanwhile all the things that actually move pipeline like hiring bursts, new leadership, product launches, website behavior, social engagement, tech changes, funding events… none of that shows up in the CRM unless you bolt a dozen tools to it or manually update everything.  \n  \nIt kind of explains why outreach feels so hit or miss. You end up making decisions based on the world as it was, not the world as it is right now.  \n  \nLately I’ve been trying to build more of a “what’s happening this week” view of accounts instead of relying on CRM data alone. Signals, triggers, enrichment, anything that helps you catch movement instead of reading a static profile.  \n  \nCurious how everyone else is handling this.  \nAre you adding real time context somewhere?  \nAre you stitching tools together?  \nOr are you just accepting that CRMs are slow and working around it?",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1763579444.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Presents a mental model about CRM usefulness and real-time context.",
    "composite_score": 2.919607928705071
  },
  {
    "score": 31,
    "title": "I built a free tool that automatically extracts business contact info",
    "selftext": "I recently created a side project that helps with real-time B2B lead generation. It automatically extracts business contact details from websites through our backend scraping system - you don't need to manually browse anything yourself.\n\n\n\nSome key points:\n\n\\- Completely free to use\n\n\\- No registration required\n\n\\- All scraping happens on our backend\n\n\\- Get contact details instantly without manual research\n\n\n\nI built this because I was frustrated with how time-consuming lead research can be. I'm not trying to sell anything - I genuinely want to improve this tool and would really appreciate if some of you could test it out and share your thoughts.\n\n\n\nWhat works? What doesn't? Any features you'd like to see added?\n\ntry it out:  \n[https://emailfinder.pages.dev/](https://emailfinder.pages.dev/)\n\nThanks in advance for any feedback!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1745615743.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Enumerates multiple features/items of a tool.",
    "composite_score": 2.922755599175709
  },
  {
    "score": 30,
    "title": "I built a tool to scrape Businesses from Google Maps - need your honest feedback",
    "selftext": "Hi everyone,\n\nI built a tool that can help you find cold leads for your business / agency.\n\nFor instance: businesses that doesn't have website (potential clients for a web dev agency)\n\nCurrently the main functionality is the businesses scrapper from Google Maps, but it's early stage. \n\nI will add more features based on your feedback :)\n\n\n\nAt this stage I need more people to use it. It's free, just would appreciate your feedback :)\n\nif you are interested, drop a comment here",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1745615352.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Announcement of a tool with minimal substance and request for feedback.",
    "composite_score": 3.2355735715777474
  },
  {
    "score": 30,
    "title": "This post reply is for @Impossible-Quiet5054, and anyone else trying to figure out why lead gen for your software dev agency feels like shouting into the void.",
    "selftext": "[https://www.reddit.com/r/LeadGeneration/comments/1jtfrb4/struggling\\_with\\_lead\\_gen\\_for\\_a\\_software/?sort=new](https://www.reddit.com/r/LeadGeneration/comments/1jtfrb4/struggling_with_lead_gen_for_a_software/?sort=new)\n\nThis is a long one. It’s not edited. It’s not for everyone. This would have been more specific if the OP shared some specifics. And if you're wondering why I took the time to write all this, it’s simple. There was a time when I was stuck. Cold inbox. No traction. No clarity. A stranger gave me the kind of signal that cut through everything. Just clarity. This post is that, for whoever needs it next.\n\n# TL;DR, Why you’re struggling with lead gen (and how to fix it)\n\nIt’s not the leads. It’s your offer. You sound like every other dev shop, so they treat you like one. No one buys “custom software.” They buy the outcome, risk eliminated, speed gained, control restored. Stop targeting job titles. Start targeting problems. Go after people with expensive, urgent pain: CTOs, Ops, Risk, Compliance, the ones who get blamed when systems fail.\n\nDisqualify fast. If failure doesn’t cost them real money, don’t bother. Don’t pitch. Engineer demand. Use job boards, exec posts, earnings calls, and speaker lists to find companies under pressure. Post upstream content that forces self-identification. Not for likes. For lead flow.\n\nDitch “we helped.” Use consequence. Write cold emails like you’ve been in the room when things broke. Because they have. Don’t sell software. Sell inevitability. “We don’t hand off code. We take the outcome. And make it inevitable.”\n\nBook calls with a tag-along offer. “Here’s how we fixed \\[X\\] in 181 days. Want the walkthrough?”On the call, don’t pitch scope. Sell what changes. If they don’t feel the cost of doing nothing, they’ll do nothing. This is how you stop being seen as another vendor, and start getting taken seriously by buyers under pressure.\n\nYou’re not alone. But that’s not the problem. Every day your offer goes unnoticed, the market assumes you’re just another dev shop begging for scraps. Not missing. Not missed.\n\nYou said you’re doing cold outreach on email and LinkedIn. Here’s what that looks like from the outside: Cold email. LinkedIn. Same outreach script. Same empty reply folder.\n\nYou’re not struggling because the leads are bad. You’re struggling because your offer isn’t doing its job. The market isn’t cold. You are. You sound like a service provider. So they treat you like one. You’re selling “custom software” but no one buys software. They buy what software fixes. For example: Payroll isn’t your biggest expense. Outdated software is. Every second of latency. Every manual process. Every compliance patch you hope won’t break. It all adds up, and then it takes something you can’t afford to lose.\n\nThat’s the real problem you need to solve. That’s the real conversation buyers are having in their heads. \n\nAnother example: Your software either gives you leverage, or it costs you control. We rebuild it so it does what it should’ve done the first time: move the business forward.\n\nAnd this isn’t for everyone. If downtime means front-page news... if latency costs millions... if compliance failure means government attention... that’s who this is for.\n\nBecause: Dev shops give you code. Then hand you the risk. We take the outcome. And make it inevitable. \n\nSo if your message isn’t stopping the right person cold, if it’s not instantly signaling, “this solves my million-dollar risk”, you’re not being ignored because of timing.\n\nIf your message doesn’t stop them in their tracks, it never stood a chance. Keep hitting send. Or start building something they can’t ignore.\n\n**Section TL;DR, How you would “Find Leads”:**\n\n1. Stop targeting job titles. Start targeting problems.\n2. Filter by pain, risk, and economic consequence.\n3. Harvest demand from job boards, exec content, speaker lists, SEC filings.\n4. Create upstream value bombs that make your offer inevitable.\n5. Deploy book-a-call strategy instead of pitching cold.\n\nYou don’t “find leads.” You engineer demand by building for a very specific problem-aware buyer, and then deploy precision-led prospecting using:\n\n1. Strategic Disqualification\n2. Economics-Based Targeting\n3. Audience-Matching Assets\n4. Owned Platform Leverage\n\nHere’s how you would approach it.\n\n**STEP 1:** Stop looking for leads. Start identifying risk owners.\n\nYou target people who own painful, expensive problems. For this custom software positioning, that means:\n\nWho:\n\n* CTO / CIO at mid-size to enterprise firms\n* VP of Ops who’s responsible for broken workflows\n* Director of Compliance / Risk in regulated industries\n* Heads of digital transformation / IT modernization\n\nWhat do they feel daily:\n\n* “Our internal tooling is duct-taped and slowing ops.”\n* “Legacy systems are failing audits or compliance checks.”\n* “We’re scaling, but tech debt is compounding risk.”\n\nThese people aren’t looking for software. They’re trying not to get fired.\n\nSTEP 2: 3-Point disqualifying filter\n\nFilter lead sources using economics:\n\n1. Does this company lose money when things break? (If not, disqualify.)\n2. Can they be publicly penalized or embarrassed by failure? (If yes ideal target.)\n3. Would software optimization result in measurable speed, savings, or security? (If yes, high economic upside.)\n\nThis gets you targeting value-based segments, not demographics.\n\nSTEP 3: Use strategic lead sources \n\nNo scraping job titles blindly.\n\nHere’s where you would go hunting:\n\nJob Boards (Filtered):Companies hiring for:\n\n“Legacy System Migration”\n\n“DevOps Modernization”\n\n“Compliance Engineer”\n\n“Cloud Re-Architecture”\n\nThis means they already have the problem. They just don’t have you.\n\nConference Speaker Lists &amp; Panels: Find CTOs who’ve spoken at events on:\n\nFintech modernization\n\nAutomotive embedded systems\n\nCloud security in banking\n\nSEC Filings / Earnings Calls: Use keywords like: “Digital transformation” “Operational inefficiency” “System overhaul” (These are public companies who openly announce technical pain.)\n\n**LinkedIn posts from Executives:** Look for posts complaining about:\n\nOutdated tech\n\nInternal tools being slow\n\nVendor horror stories\n\nSecurity/process bottlenecks\n\nDM them not to pitch, but to add perspective. Then tag-along your offer in conversation later.\n\nSTEP 4: Reverse content to attract buyer math\n\nCreate 1 piece of content that makes your ideal client realize:\n\n* What their current setup is actually costing them\n* What consequence they’re trying to avoid\n* Why most software vendors make it worse\n* What they should be looking for instead\n\n**Examples:**\n\n* “Why your next compliance failure is baked into your dev stack”\n* “What tech debt really costs, and how to measure it in real time”\n* “How we replaced 3 legacy apps with one risk-proof infrastructure in 181 days”\n\nThis is not content for likes. This is content that converts upstream. Put this in front of the right buyer, they come to you, no resistance.\n\nSTEP 5: Deploy book-a-call Strategy\n\nOnce the content or cold email lands…\n\nInstead of selling the call directly, use:\n\n“Here’s how we rebuilt Acim's internal infrastructure in 181 days and eliminated 3 layers of tech debt. Want a behind-the-scenes walkthrough?”\n\nOr:\n\n“We’re running private architecture reviews for teams with legacy bloat. No fee.You’ll leave with a risk audit either way.”\n\nThen on the call convert to outcome sale. “Convert to outcome sale” means: You’re not selling what you do. You’re selling what changes for the buyer once it’s done, the outcome they care about, that has measurable economic consequence.\n\nReframe your offer as economic control. “What we do isn’t software. It’s removing the operational drag that’s killing margin and speed, quietly. The outcome is this: your system performs under pressure, passes an audit, and doesn’t break when the dev who built it leaves.”\n\nDon’t pitch scope. Pitch inevitability: “Here’s how this gets fixed in 181 days, without replacing your team, without rewriting from scratch, and without missing compliance again.”\n\nBelow is your Problem-Pressure Playbook, built exactly how I would map it, no personas (ICPs), just raw pain, real consequence, and unavoidable contrast.\n\n**Offer context**\n\nYou deliver custom software infrastructure (I assume) for mid-market to enterprise clients, the kind that removes tech debt, eliminates compliance risk, and rebuilds control. That’s what I have based this on as a guide which you can apply to your specific offer.\n\n**1. What they’re scared of (but won’t say out loud)**\n\nThese are emotional stakes that live behind job titles.\n\n* “We’re one outage away from board-level scrutiny.”\n* “We’re about to raise capital, but the backend’s a liability.”\n* “Our stack is duct-taped together by people who’ve already left.”\n* “If this gets audited, I’ll be the one answering for it.”\n* “We’re growing, but every new user exposes how broken the system is.”\n* “We built fast. Now it’s brittle. And I’m the one stuck holding it together.”\n\nThese aren’t features. They’re survival-level fears.\n\n**2. What it’s quietly costing them**\n\nThese aren’t costs they report, they’re the ones no one owns but everyone feels.\n\n* Missed launches\n* Burned dev hours fixing code no one understands\n* Systems no one on the current team is confident in\n* Ops workflows slowing down new revenue\n* Delays they can’t trace but feel in the numbers\n* Failed compliance checks that trigger legal or reputational risk\n* Dev churn from working on a pile of “legacy hell”\n\n1. Why their default vendor can’t fix it\n\nThe biggest buying objection isn’t price, it’s inertia. You break this by exposing how the “usual option” is part of the problem.\n\n* Their dev agency ships features, not infrastructure\n* Their team is too close to the code to spot the real problem\n* Their in-house tech lead is protecting decisions made 3 years ago\n* Their vendor is reactive, not preventive, and doesn’t own outcomes\n* Everyone’s “fixing bugs” instead of solving the root system failure\n* Most vendors do code handoffs. Not control transfers.\n\nYour positioning flips this:  “We don’t give you more code. We take the outcome and make it inevitable.”\n\n4. How your message hits before they hit google\n\nNever wait for intent. You manufacture demand upstream. Speak to what’s happening in the room, not what they search for when it’s too late.\n\nExamples:\n\n* “The most expensive system in your company is the one no one’s touched in 18 months.”\n* “Tech debt doesn’t show up on P&amp;Ls, until it costs you a deal you can’t get back.”\n* “If you’re still duct-taping your stack to make it through the quarter, the problem isn’t capacity. It’s control.”\n* “One outdated dependency took down ops for 72 hours. You won't find that in Jira.”\n\nThese aren’t ads and pieces of content. They’re landmines planted in the feed, written so the right person self-identifies instantly.\n\n**What this does**\n\nYou now have what most marketers don’t:\n\n* The real fears of your buyer\n* The silent math that justifies the sale\n* The contrast that kills competitors\n* The messaging that hits before Google gets typed\n\n**Examples of cold outreach scripts not perfect, giving you some ideas**\n\n**Subject:** Your biggest expense isn’t payroll. It’s what’s running under it.\n\nHey Scooby,\n\nMost companies think payroll is their biggest monthly cost. It’s not. It’s the outdated software silently bleeding money from every click, every delay, every compliance risk patched with hope.\n\nWe don’t sell code. We rebuild operational infrastructure that actually performs, under pressure, under audit, and at scale. If downtime means headlines, if latency costs millions, if one integration error can trigger regulatory attention, this is what your current system was supposed to prevent.\n\nIt didn’t. Ours does. Dev shops deliver code. We deliver outcomes, and make them inevitable.\n\nLet me know if you want to see how that looks inside a stack like yours.\n\n**Subject:** Legacy systems don’t just slow down. They get expensive.\n\nHey Scooby,\n\nTech debt doesn’t show up on P&amp;Ls. But the cost is still there, in missed deadlines, internal churn, and compliance flags no one sees until they escalate. One system lag. One undocumented dependency. One missed update. It never looks like risk, until it costs something that can’t be recovered.\n\nSoftware either creates leverage. Or it bleeds control. Quietly. Daily.\n\nIf the current stack is being duct-taped to survive another quarter, there’s already a cost.And it’s bigger than most teams realize.\n\nLet me know if you want to see how this usually plays out, and what it looks like fixed.\n\nExample 3\n\n**Subject:** The cost you won't see on any invoice\n\nScooby,\n\nThe codebase is fine. Until it slows down just enough to miss a deal. Until the audit flags it. Until it breaks in production and the person who wrote it left 14 months ago. Nobody budgets for that.Nobody tracks it. But it’s bleeding you. Tech debt doesn’t kill you upfront. It just keeps taking in silence.\n\nIf that’s happening in your world, I can walk you through the math to offer some clarity.\n\nLet me know.\n\nVer 2 of example 3\n\n**Subject:** The cost you won't see on any invoice\n\nScooby,\n\nThe codebase works, until it doesn’t. Then one delay turns into three missed handoffs. One audit check becomes a rewrite. One legacy tool no one owns quietly tanks the quarter. Nobody budgets for that. But everyone pays for it.\n\nTech debt doesn’t hit you upfront. It compounds quietly, until it costs something you can’t claw back. If this even feels close to your world, I can walk you through the real math.\n\nThese email examples:\n\nOpens with their reality, not your credibility. Stays inside their world. Ends with a low-resistance call to curiosity, not a sales ask.\n\nNo…\n\n\"We recently saw...\"\n\n\"I'd love to show you...\"\n\n\"We won the award nobody cares about...\"\n\n\"We are listed on INC...\"\n\n\"We were featured on (paid for feature but i won’t tell you that)...\"\n\n\"I hope this email finds you well.\"\n\n\"I wanted to reach out because...\"\n\n\"Quick question for you...\"\n\n\"We noticed you're currently using...\"\n\nInstead:\n\nDescribe their exact daily tension. Show them the cost of ignoring it. Make it feel like you already know their situation. Offer a path that puts them in control.\n\n**Half-baked landing page copy example**\n\n**Headline:**\n\nOutdated systems don’t just slow you down. They put everything at risk.\n\n**Subhead:**\n\nYou don’t need more developers. You need infrastructure that performs under pressure, passes audits, and scales without surprise.\n\n**Section: What We Fix**\n\nLegacy software that breaks under loadCompliance gaps you’re hoping won’t get flaggedFragmented tools stitched together with invisible riskTech debt disguised as “custom systems”\n\n**Section: Who This Is For**\n\nIf downtime means headlines, if latency costs millions, if one bad integration can trigger legal escalation, this is for you.\n\n**Section: What Makes Us Different**\n\nWe don’t hand you code. We hand you outcomes.We own the problem end-to-end: from design to compliance validation.We’ve replaced entire workflows without touching your core IP, in banking, auto, energy, and capital markets.\n\n**CTA:**\n\n**Request a Systems Review**We’ll walk you through how your current setup compares to the architecture used by teams who don’t lose sleep over tech anymore.\n\n**Examples of post idea angles**\n\nEach is designed to trigger “This is me” resonance from the right decision-maker. These are top-of-funnel content formats (LinkedIn, cold email lead magnets, or ad creative).\n\nPost angel 1: The Silent Expense Audit\n\n**Hook:** \"What’s killing your margins isn’t salaries, it’s systems you no longer trust.\"\n\n**Angle:**\n\nBreak down how outdated workflows, redundant approvals, and fragmented data cost more than 1 senior hireFrame the cost as invisible payroll, software that eats revenue dailyTease a 30-minute diagnostic that calculates the compounding cost of delay\n\nPost angel 2: The Audit-Proof Architecture Guide\n\n**Hook:** “Most dev stacks fail compliance before anyone even asks the first question.”\n\n**Angle:**\n\nShow why companies with legacy tech unknowingly break audit-readiness standardsShare 3 frameworks you use to rebuild systems around compliance-first logicInvite the reader to a walkthrough of what their system would look like under pressure\n\nPost angel 3: The Dev Shop vs Infrastructure Partner Matrix\n\n**Hook:** “Stop paying agencies to build what your team already regrets using.”\n\n**Angle:**\n\nVisual matrix contrasting common dev agency behavior vs infrastructure performance teamsExpose the risk handoff that happens when devs “ship and vanish”End with a simple CTA: Want to see how Fortune 500s structure it instead?",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1744053006.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.63,
    "category_rationale": "Offers actionable steps to improve lead-gen strategy.",
    "composite_score": 2.8294073233621133
  },
  {
    "score": 28,
    "title": "Offering free leads generated by my AI agent for a week!",
    "selftext": "Hey everyone! My co-founder and I recently built an AI agent that accepts a prompt describing the type of leads you’re looking for. It conducts live searches across the entire internet and extracts relevant information for you.\n\nFor example, you can search for things like:\n\n* *\"Find sales managers from e-commerce companies who graduated from the University of Michigan\"*\n* *\"I want to find Kia dealers in the USA.\"*\n\nThe agent delivers personalized leads with high buyer intent, including their email ID, LinkedIn URL, department, and job role.\n\nWe’re looking for 10 companies willing to try it out for free for a week. This will help us validate the quality of leads we’re able to generate.\n\nIf you’re interested, comment below, and I’ll DM you!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1734269573.0,
    "media": null,
    "is_video": false,
    "num_comments": 221,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Promotional outreach with free trial; lacks a clear method.",
    "composite_score": 3.3180744851242756
  },
  {
    "score": 28,
    "title": "What’s your cold email tech stack that actually books meetings?",
    "selftext": "Hey everyone, hoping to get some help here.\n\nFor those of you found success in sales cold email, what tools are you using?\n\nNot just the outreach platforms but your full stack:\n- Lead sourcing\n- Deliverability tools\n- Sending platforms\n- Reporting\n- Automation\n- Anything else that gives you an edge\n\nI’m looking to understand what’s actually working / performs. There’s a lot of tools I’ve looked at and I’m honestly in analysis paralysis right now.\n\nThanks in advance!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1746900873.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question seeking recommendations about cold email tech stack.",
    "composite_score": 3.013683085947924
  },
  {
    "score": 27,
    "title": "I Outsourced My Lead Gen... and Booked 39 Qualified Calls in 3 Weeks",
    "selftext": "Look, I used to be the biggest skeptic about outsourcing lead gen. I'd roll my eyes whenever someone mentioned it. \"If you want quality leads, you gotta do it yourself\" was basically my mantra.\n\nThen this SaaS founder client came to me desperate. Good product, smart team, but their pipeline was a ghost town. \n\nSo we tried something different (and I'm pretty damn proud of the results)...\n\nWhat we did differently:\n\nInstead of mass blasting thousands of cold emails, we handpicked just 150 perfect fit prospects. Spent 3 solid days on Crunchbase + LinkedIn finding the RIGHT people. Quality over quantity, ya know?\n\nEach email was genuinely personalized. Not that fake \"I noticed your company does X\" crap. We referenced actual LinkedIn posts, recent funding announcements, or company news. Stuff that showed we actually did our homework.\n\nMy team of 3 handled all the research, writing and sending but we still had the founder review for brand voice. Each person managed about 50 leads max, putting in 10-15 hours weekly.\n\nAfter just 3 weeks:\n- 39 booked calls (13 per team member )\n- 71% open rate (try getting THAT with generic templates)\n- 22% reply rate\n- 13% conversion to actual calls\n\nAnd these weren't tire kickers. These were serious, qualified prospects ready to talk.\n\nThe big lesson? Outsourcing isn't bad... working with the WRONG outsourcing partner is bad.\n\nWhat made us different was our obsession with quality control. We do weekly reviews, constant message refinement, and have clear standards for what counts as success. \n\nIf you're outsourcing to a company that just cares about sending volume and not results... well, there's your problem!\n\nAnyone else tried outsourcing their lead gen lately? Would love to compare notes! Or if you're curious about our approach, my DMs are open",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.68,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1744516321.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Case study with lessons learned about outsourcing lead generation.",
    "composite_score": 2.802256071356476
  },
  {
    "score": 27,
    "title": "Cold DM that got my attention and forced me to reply - Breakdown",
    "selftext": "Screenshots attached in comments:-\n\nI loved how this guy approached me, he proved to me that what I'm doing with my outbound is right and put me on my prospects shoes and I know what they feel when I reach out.\n\nI do post videos on YouTube and reels on social media, but I have limited views as I just got started. So he knows now that I'm trying to get views and grow personal brand &gt;&gt; \"Desired Outcome / Pain Point\"\n\nHe started by liking some of my posts, so I got some notifications from him, then he followed me.\n\nThen he commented on some posts.\n\nThen he DMed me this:\n\n**\"hey Ahmed, I just saw your tweets on the timeline**\n\n**Saw that you're on here to grow your brand and thought i could help. honestly - is it cool if i create a few posts for you to see, free of charge, that will do better than what you're currently posting?**\n\n**i could send that to you + a breakdown of why it works. worst case scenario, you get the posts for free\"**\n\nI said yes and he sent me the output, and a screenshot below in comments.\n\n**Here is why it worked and will continue to work.**\n\n1. He engaged with me first, so it doesn't look so cold, as he liked and commented on my posts.\n2. He related what he does with the desired outcome I want or my pain point.\n3. He offered value upfront with no strings attached, with a soft call to action, no pitch, and no calls.\n4. He sent me the output and it was great, honestly, so I trust he can deliver now, which is very important. Then he told me to feel free to post and see the performance of them.\n5. So he’s also tying his service with measurable outcomes, all of that before even asking for a call.\n6. Also, he working on intent, someone how just started to post is someone who have intent to grow social media / personal branding.\n\nI loved it.\n\nSo here is the gist of it and I made a post about this earlier on how to add value, be relevant, and use a soft call to action before asking for a call\n\nIn cold email, guys, just be relevant and try to deal with your prospects as humans. Don’t just blast emails and you will get good results.\n\nScreenshots of the convo below",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1753173291.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.78,
    "category_rationale": "Step-by-step breakdown of a cold DM strategy.",
    "composite_score": 2.8780219493510155
  },
  {
    "score": 27,
    "title": "Starting a Business? Let Me Help for Free",
    "selftext": "I’ve spent over 10+ years in digital marketing and managed more than $10+ million in ad campaigns for top brands. Now I’m working on my own, and I want to use my skills to help others get started.\n\n**Here’s what I’m offering for free:**\n\n• A custom WordPress website built just for you  \n• Facebook and Google Ads setup and optimization  \n• A marketing strategy to help you launch with confidence\n\nIf you’re a startup or small business trying to get off the ground and need expert support with zero upfront cost, I’m here to help.\n\n**Drop a comment or send me a DM if you’re ready to start.**",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1747261757.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.68,
    "category_rationale": "Promotional post listing 3 distinct services offered.",
    "composite_score": 2.966384369585313
  },
  {
    "score": 26,
    "title": "I accidentally made an auto lead gen bot",
    "selftext": "I work at IT Augmentation company and our target audience is anyone who is hiring in tech. \n\nThe main problem for lead gen team was to identify which company is hiring for which tech role. Now thats a hectic work for someone who creates these fresh lead list.\n\nYesterday i was using chatgpt and thought to test an idea which will go to given website and find their career page and analyse if they are hiring for any tech role. If answer is yes then further find titles of these roles along with website contact details, career page url and other details. \n\nTo my surprise the bot worked well for this. Then i added creds of my airtable and started saving it on airtable, but thats not all; after this i wanted to find linkedin page of these companies who are currently hiring. So i again used gpt to create a bot that takes company name from previously scrapped data and search it online and find company linkedin page and scrap details from their too. \n\nSo now i have more than enough data for leads who are really my target audience. No more cold emailing from now on. ",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1742860435.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Describes a replicable lead-gen approach and reasoning.",
    "composite_score": 2.9676488522079554
  },
  {
    "score": 26,
    "title": "How I landed my most important customer",
    "selftext": "Back in the days, I was a Regional Account Manager (RAM) for an international company selling plastic pallets. One day, I received a lead from a pharmaceutical plant. I met with them, made some proposals, but ultimately, we didn’t close the deal.\n\nLater, I started my own business in industrial and commercial waterproofing. After some time, I reconnected with the same engineer from that pharma plant. He gave me the email of their maintenance manager, and through a cold email, I managed to get a meeting with their engineering team.\n\nBut here was the challenge: What could I offer them about waterproofing that they didn’t already know?\n\nI went into the meeting, asked questions, and uncovered their pain points. They had serious leakage issues, so I focused on a specialized waterproofing product that could be applied even in the rain to stop water leaks instantly. They were skeptical—could this product really solve their problem?\n\nThat summer, they bought two buckets of the material, each costing around $400. The test was a success. The following summer, they ordered 20 buckets.\n\nOver those two years, I built trust and strengthened the relationship. My ultimate goal wasn’t just to sell buckets—I wanted to waterproof the entire plant.\n\nWith that trust established, I convinced them to open bids for their first large-scale waterproofing project. Since they already saw me as an expert, they let me design the solution, which meant I had an edge over my competitors. That’s how I landed my first big waterproofing contract—over 10,000 square meters, two years after my first small sale.\n\nThat pharma plant became my biggest client for the next six years, generating approximately $1.2 million in revenue.\n\n\n---\n\nKey Takeaways\n\n1. Patience – Don’t rush. Offer excellent service, even if the first sale is just two buckets.\n\n\n2. Listening – Understanding their pain points led to that first sale, even if it wasn’t my ideal product. It solved a major issue for them.\n\n\n3. Trust – Trust doesn’t happen overnight. Do everything possible to earn it—always deliver on your promises.\n\n\n4. Follow-up – Even small sales can open doors. If maintaining the relationship leads to bigger deals, it’s worth the effort.\n\n\n\nWhat do you think? Have you had a similar experience?\n\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1738677636.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Shares key sales insights and lessons learned.",
    "composite_score": 2.7244277819981066
  },
  {
    "score": 25,
    "title": "What's your reply rate on LinkedIn outbound right now?",
    "selftext": "Hey guys, new to b2b sales (lead gen) and was curious as to what everyone's seeing because mine just hovering 13-30% and I'm not sure if that's good or I'm doing something wrong.\n\nMy method: scraping who engages with my and competitors' LinkedIn posts (using tools like Triggify or Oiti AI), then reaching out to those people with personalized messages.\n\nTheory is they're already interested in the problem space since they're engaging with competitor content.\n\nWhat are you all getting? And what method are you using?\n\nheard about some people using linkedin groups as well. CONTEXT: using this to grow my b2b saas as a solo founder.\n\nthanks for the help.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1761201998.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for others' reply rate metrics; mostly a question discussion.",
    "composite_score": 2.966352263811605
  },
  {
    "score": 24,
    "title": "This Offer Generated 11 Clients In 1 Month",
    "selftext": "Wassup everyone! Today I want to share a framework I used to create my offer, which generated me 11 clients in the 1 month of running my biz. \n\n\n\nI followed a simple framework by Alex Hormozi’s value formula. Value = (Dream Outcome × Perceived Likelihood of Achievement) / (Time Delay × Effort &amp; Sacrifice)\n\nYou need to understand your ideal customer very well, what problems he has, what day-to-day struggles he has, what his desired outcome is, what he is afraid of, and what pain he has. After you have a research on your ICP, you will be able to position your service or product as a good offer. \n\nYour offer should align with your customer’s dreams, needs, and goals. ***The most important thing is this***: your client must want what you're offering. They need to need it. If they don’t, it doesn’t matter how good of a salesperson you are — you won’t be able to sell it, no matter how hard you try. You should NEVER build your offer around your product. Instead, you should build your product around your offer. It’s much easier — and far more effective. Your service or product is not your offer; your offer is a mix of different things:\n\n*Outcome*\\- the promise should align with the goal&amp; desired situation of your market\n\n*Timeframe*\\- how long it takes to deploy the methodology to achieve the outcome/result. \n\n*Method*\\- tangible, clear methodology as to how the outcome is achieved\n\n*Secrets*\\- your unique way of executing the methodology and making it work\n\n*Safety* net- risk reversal, a guarantee, a way to protect, feel safe &amp; confident\n\n*Pricing*\\- how much it costs to claim the offer and make it happen\n\n\n\nExample offer: I do X for Y in Z days without W.\n\nMy offer for my consulting biz: We will generate you additional 15 appointments per month in 60 days with our unique “Firestorm Acquisition” method. If we won't be able to get you more clients, you won't pay. No results, no cost, as we work on a pay-on-results basis only! \n\n\n\nWhy this offer is so good, and why I was able to generate a lot of clients for myself. I state the exact dream outcome that my audience needs, very specific. I named a timeframe, how much time it will take to reach the goal. I mentioned my own unique method, I didn't use Facebook Ads, Google Ads, or cold outreach. I kept this in secret to spark curiosity, to get a higher chance of a reply. If the method u are using to generate results is not very sophisticated, then you can name it, but if you’re using something like Facebook Ads for a Shopify store, then u cooked. You need to develop a new name for your service, a new mechanism. Think about it in terms that you need to keep the functionality of your service, but give it a new name. Same service, new name. Like Instagram Reels, the same short-form content as on TikTok, but with a unique name. When people heard about Instagram Reels, they were very curious about it. I mentioned my guarantee; the better your guarantee, the greater the likelihood that you will receive a positive reply. Just try to remove all the risk from the deal, imagine someone said to you, you can spin a wheel with the opportunity to win 10k$ for free. It will be stupid if you say no. I know it’s impossible to remove 100% of risk, your client must have skin in the game as well, but I hope you got the point.   \n  \n**One more time, short template for ur offer**.   \n  \n1. Define who. We need to know who we are creating the offer for. Niches have segments. For example, not every gym owner struggles with membership acquisition, and not every agency needs help with sales.\n\n2. Define dream outcome. The outcome you promise may be their desired situation, or fixing one or more problems that contribute to it. The outcome should align with what your niche wants, not what you can do. \n\n3. Define the timeframe. Your time frame can be monthly, or over a set amount of time or days.\n\n4. Define methodology. What steps/instructions need to be followed for the outcome to be achieved?\n\n5. Define value. Factors of value explain why your methodology works &amp; why you should be the person to execute or help them execute on it. You need to predict what problems, obstacles, or objections will be associated with the items in your methodology, and then create value by explaining how you solve these problems, overcome these obstacles, or render these objections obsolete.\n\n6. Risk reversal or guarantee. The less risky someone sees your offer, the more confidence it will inspire. Offers that have extreme risk reduction are seen as favourable by the market. \n\n\n\nIf you need help structuring your offer, let me know. I’m willing to help you for free :)\n\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1749047699.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Explains framework for crafting offers and shares example.",
    "composite_score": 2.7190496560389974
  },
  {
    "score": 25,
    "title": "Stop Chasing Massive Lists, Start Building Laser-Focused Outreach (Sharing What’s Working for Me)",
    "selftext": "I’ve been experimenting a lot with outbound lately both for my company and wanted to share what’s actually been working (especially if you’re tired of spending hours scraping leads that go nowhere).\n\n**Here’s the framework I’m using to build small but high-converting lead lists:**\n\n1. **Hyper-defined ICP:**\n\n• Not just “founder” or “CEO.”\n\n• Example: “Founder of a fintech startup in UAE with less than 50 employees, actively hiring, and recently posted about fundraising or growth.”\n\n2. **Source smart:**\n\n• Start with Sales Navigator filters.\n\n• Cross-check using company pages (look for signals like active content, hiring pages).\n\n• Use Apollo, Clay, or manual enrichment to verify emails and LinkedIn URLs **but never trust one tool blindly.**\n\n3. **Data Cleanse (even if manual):**\n\n• I remove anyone inactive on LinkedIn for the last 60 days.\n\n• I also verify email using tools like NeverBounce (even if sending small volumes).\n\n4. **Video-first personal outreach:**\n\n• 20-30 second personalised videos (mentioning a recent post or hiring update) this has doubled reply rates.\n\n**Results?**\n\n• I send 30-50 emails a day, get around 15% reply rates, and 3-4 meetings a week consistently without burning domains or annoying anyone.\n\nIf anyone’s curious, I can share my exact templates and enrichment checklist. Just reply or DM — happy to help the community!\n\nWhat’s working for you guys lately? Would love to nerd out and learn more tactics too!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1742878990.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.86,
    "category_rationale": "Provides a framed, sequential outreach framework with steps.",
    "composite_score": 2.7005189774986587
  },
  {
    "score": 25,
    "title": "Nobody Was Replying… Then I Changed One Line in My Emails",
    "selftext": "Almost 2.5 years ago I used to think cold email was just a game of persistence. Send enough, follow up enough, and eventually, someone will bite. But after months of blasting emails and barely scraping together responses, I had to admit—this wasn’t working.\n\nSo I stepped back and asked myself: *If I got this email, would I reply?* And the answer was a clear *no.* It felt like a copy-paste pitch, not a real person trying to start a conversation.\n\nI started tweaking things.  \nFirst, the intro—no more robotic openings. Instead of “I hope you’re doing well,” I’d mention something specific about their company’s mission, something real. I’d say:\n\n*\"I was on your site and saw how you're helping startups simplify hiring—love how you're making it easier for small teams to scale.\"*\n\nThat one shift changed everything. Replies weren’t just “Not interested” anymore. People actually *engaged*. And now at Leadamax we are nailing it with + replies for our agency and our clients.\n\n**Heres what the sample looks like:**\n\n***I saw how you help people {{mission of what they do}} and wanted to reach out.***\n\nSTEPS:\n\n* go to clay- click on (ADD COLUMN ) - Add Enrichment - Type \\*\\*Use Ai -\\*\\*then chat gpt generate text - then go to browse template and search mission and choose this.\n* use website or from first page from website\n\n**Prompt**\n\n**Write an introductory line to an email that sounds friendly and personal.**\n\n**Avoid formal or exaggerated expressions, and aim for a tone that is casual, friendly, and sounds like a real person speaking.**\n\n**Look at the following company’s linkedin description and use it to share a positive detail about their company’s mission: {{Description}} Start the line with ‘I was on your site and saw you’ and continue by sharing something they/their company either value, prioritize, or are aiming to accomplish.**\n\n**Do not include any quotation marks and write just one example, do not make a list of examples.**\n\n**Keep the line under 25 words and do not quote their description directly, meaning change up wording.**\n\nCold email isn’t about selling—it’s about *connecting*.  \nIf your first line sounds like a template, people will treat it like one. If it sounds like a human, they’ll respond like one.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.71,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1742577950.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Describes steps to improve emails with a concrete example.",
    "composite_score": 2.5495333392987805
  },
  {
    "score": 23,
    "title": "Any good lead generation agencies that work?",
    "selftext": "Hi. Have a US B2B client in the mid-market and enterprise Recruitment space. ICP includes C-level decision makers in revops teams. Primary target accounts from US and EU.\n\nClient is going crazy. Their SEO leads have dropped because of no-click search. Plus, all the craziness with AI.\n\nNeed help from a lead generation company or agency. Client has mixed feelings about them. They got burned by mid results from local agencies in the past.\n\nOne agency did deliver relevant leads but the sales reps complained that the leads weren’t as warm as they would like. They wouldn’t show any real buying intent and weren’t very brand aware.\n\nI think its a more complex problem. And “hey here’s a bunch of leads” go close them is going to work. Unless there’s convincing that the sales team is not doing well. (They are!)\n\nAny recommendations? Budget is not an issue (unless it’s an unreasonable demand).",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1752168415.0,
    "media": null,
    "is_video": false,
    "num_comments": 111,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asks for agency recommendations; simple inquiry.",
    "composite_score": 3.0798202530466963
  },
  {
    "score": 24,
    "title": "Ppl be offering rev share like they sell a private plane or something",
    "selftext": "Getting pitched 10 times a week:\n“Hey wanna generate leads and close clients for me? I’ll give you a rev share!”\n\nWow what a wonderful proposal. So I do all the heavy lifting, and you cut me in on… your imaginary money?\n\nYou’re selling a $6K service with zero past clients. No proof of concept. No offer validation. No pipeline.\n\nRev share is cool if there’s actual revenue that I can increased on top of what you already have. Or if you’re selling a private jet level service.\n\nOtherwise, you’re just asking me to build your business for you  and take all the risks.\n\nHow about I also name your business, write your copy, build your funnel, raise your kids, and water your plants while I’m at it?\n\n\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1747371880.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Vent about rev-share pitches with moral judgment.",
    "composite_score": 2.7455762612236905
  },
  {
    "score": 24,
    "title": "Struggling with Lead Gen for a software development agency. Is it just me, or you as well?",
    "selftext": "Hey,\n\nI work for a software dev agency based in the EU that provides custom software dev services and we are currently struggling with lead gen and client acquisition. The leads we generate are either not interested/irrelevant or have a really low budget. We are mainly doing cold outreach via email marketing and also LinkedIn.   \n  \nIf you are in the software industry, how are you coping with this?",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1744011626.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks others how they're handling lead gen; not content-heavy.",
    "composite_score": 2.9492250967210056
  },
  {
    "score": 24,
    "title": "What are the most effective strategies you've used for generating high-quality leads in 2025?\"",
    "selftext": "Hey, everyone! I’m curious to hear about what’s been working best for you when it comes to generating high-quality leads this year. Lead gen keeps evolving so fast, especially with all the new tools and tech in 2025, I’d love to know your experiences.\n\nSpecifically, what strategies have actually helped you attract leads that are genuinely interested and ready to buy, versus just random clicks or sign-ups? For example, have free trials or educational content upgrades have made a difference? How about leveraging video marketing or running targeted webinars?\n\nAnd bonus points if you’ve found ways to automate parts of this process without losing that personal touch, tools or hacks that keep the lead nurturing meaningful but efficient.\n\nReally looking forward to hearing what’s worked in practice because so many articles talk strategy, but it’s those actionable insights from folks here that make the biggest impact!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1761290495.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.42,
    "category_rationale": "Question seeking lead-generation strategies; no clear list or model.",
    "composite_score": 3.0476102833988286
  },
  {
    "score": 22,
    "title": "How do you get high-quality leads for cold email without burning cash?",
    "selftext": "Hey everyone,\n\nI’m running outbound campaigns (mainly cold email) and currently using Apollo to source leads. The issue is, I’m ending up with a lot of dead emails, which means I’m spending money twice - once to get the leads, and again to validate them just so I don’t get bounce issues.\n\nThis feels like I’m burning cash and time before even reaching a prospect.\n\nSo, I’m curious:\n\n* What’s been your most efficient source for **high-quality B2B leads**?\n* Do you prefer building lists yourself, scraping, buying data, or using a different platform?\n* How do you balance cost vs. accuracy so you’re not stuck in this “dead leads + validation” loop?\n\nI’d love to hear strategies that worked for you across industries.\n\nAppreciate any insights, I’d rather learn from people who’ve been through this than keep wasting cash testing endlessly.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1755674852.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.45,
    "category_rationale": "Asks for best sources and cost trade-offs, not presenting a model or steps.",
    "composite_score": 2.9592768560247213
  },
  {
    "score": 23,
    "title": "When I understood This, I Got 3 Times More Clients",
    "selftext": "Achieving business success, particularly in SaaS, hinges on effective client acquisition. Let me outline a framework I’ve found invaluable for securing new clients.\n\nAt its core, client acquisition is straightforward yet often overlooked: it’s about transforming someone entirely unfamiliar with your business into a paying customer, one willing to invest significantly. This journey takes a stranger and turns them into a client who commits thousands of dollars.\n\n**6 fundamentals of client acquisition:**\n\n1. **Drive** \\- an unconscious driving force of human behaviour, the core &amp; root reason for taking an action or making a decision (to get or escape something).\n2. **Goal** \\- a future situation they want to live in, manifest, or see it come true.\n3. **Problem** \\- an obstacle standing in the way of them achieving their goal, the desired outcome. \n4. **Pain** \\- an unpleasant feeling or emotion created by the problem they are facing.\n5. **Action** \\- mental decisions &amp; physical behaviour taken to alleviate pain.\n6. **Confidence** \\- having faith, belief &amp; trust in someone (or a company) to solve problems.\n\nAll these 6 things are required to acquire a customer. \n\n**Drives** create goals\n\n**Goals** create problems\n\n**Problems** create pain\n\n**Pain** creates action\n\n**Action** needs confidence\n\n**Drive&gt;Goal&gt;Problem&gt;Pain&gt;Action**\n\n*Your potential client creates*:\n\n1. Drive- pre-built into a stranger, already existing\n2. Goal- coming from drive\n3. Problem- coming from the goal \n4. Pain- coming from a problem\n5. Action- coming from pain\n\n*You need to create*:\n\n1. Confidence- coming from you, seeming competent, capable, reliable &amp; trustworthy\n2. Pain- you need to amplify pre-existing pain by exploring and exposing it\n\n\\*\\* Pain rarely creates action without amplification. This is because humans indulge in delusions to cope with reality. Pain hurts &amp; can be avoided by pretending it isn’t there\n\n8. Action- you must elicit decisions and actions from the stranger\n\n\\*\\* Action- people rarely act or decide to escape pain and solve problems without encouragement or elicitation to do so by an external stimulus or trigger.\n\n***REMEMBER***: You do not create the pain; the pain that already exists.\n\n***REMEMBER***: You do not create the action, you encourage and illicit, channelling emotions to act.\n\nTechniques to elicit emotional responses in discussions:\n\n1. Pose questions that inherently lead to uncomfortable or painful answers.\n2. Investigate issues in a way that inevitably brings about feelings of discomfort or distress.\n3. Discuss the repercussions individuals are facing due to their circumstances.\n4. Establish a sense of gravity by detailing the severity of their situation and the associated consequences.\n\nIllustrative Examples:\n\n1. \"You're currently not generating any new sales for the business. Can you explain why?\"\n2. \"You mentioned difficulties acquiring clients. Could you elaborate on this issue?\"\n3. \"How is this problem affecting your personal life?\"\n4. \"If this remains unaddressed and deteriorates further, what impact would that have on your business?\"\n\nExample: \n\n# Email Deliverability Tool(SaaS)\n\n**1. Drive**\n\n*Wants outstanding results from cold email outreach.*\n\nSecure more meetings, consequently expanding the sales pipeline and achieving revenue targets.\n\n**2. Goal**\n\nGet their emails seen, opened, and replied to. Consistently land in inboxes, not spam.\n\n**3. Problem**\n\nLow open rates, emails land in spam, low reply rates, and awful deliverability \n\n**4. Pain**\n\nWasted hours writing cold emails that never get read. Low reply rate&gt;Not enough clients&gt;Small revenue Fear of domain getting blacklisted or reputation destroyed.\n\n**5. Action**\n\nNeed to find something that will solve all these problems. \n\n**6. Confidence (you provide)** \n\nShow incredible results, e.g, high deliverability, low bounce rates, low spam rate.\n\nOffer a free demo trial to give them a taste of your tool.\n\nYou must be incredibly confident that you can help them achieve their goals and solve their problems.\n\nCase study: “How we helped X client 4x reply rates in 3 weeks”\n\n***The more pain the stranger is in, and the more confidence you give them, the better your chances of triggering an action.***",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1748967125.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains a framework with six fundamentals as a mental model for client acquisition.",
    "composite_score": 2.4948324964312683
  },
  {
    "score": 23,
    "title": "Clay.com &gt; LinkedIn active users",
    "selftext": "So full transparency... I run an agency and a big part of what we do is using clay for our audience. But I'm not one to gatekeep information.\n\n  \nThere is an option for clay users to find out if a list of people you imported posted on LinkedIn. This is obviously helpful if you're not using LinkedIn Sales Nav or think BIGGER picture by creating a message based on their last post. \n\nSuper helpful for anyone that wants to see activity based on a list of audience you pulled. \n\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1747322981.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Offers a practical tip about using Clay to analyze audience activity.",
    "composite_score": 2.5534075842907185
  },
  {
    "score": 23,
    "title": "Can anyone tell what is the best way to get leads for my starup?",
    "selftext": "I recently founded a startup specializing in 3D animation content to showcase product features, along with UI/UX design, app development, and software solutions. It's been several months, and while we have some clients, the number is far below our actual target.\n\nWe're struggling to find international business leads beyond platforms like Upwork and Fiverr. Are there any effective ways to track and connect with potential clients who genuinely need these services?\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1742582426.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.48,
    "category_rationale": "Asks for best ways to get leads; lacks substantial content.",
    "composite_score": 2.875892088628742
  },
  {
    "score": 20,
    "title": "F*king 0 leads over the past month. Wth am I doing wrong?",
    "selftext": "I work at a SaaS-ish company, and honestly I’m hitting a wall.\n\nI’m in charge of content marketing and our growth, but nothing I do feels like it’s moving the needle. Monthly traffic grows maybe 20% tops. Right now my world is basically:\n\n- Writing blog posts\n- Sending outbound email campaigns\n- Posting on social where each post gets like 3 likes (and one of them is me lol)\n- We have gated case studies, but literally nobody reads or downloads them\n\nI’m at the point where I’m wondering if I’m fundamentally doing something wrong. I’m desperate for even a tiny light at the end of this tunnel because I feel like I’m about to get fired if I don’t magically produce results.\n\nThose of you working in SaaS / B2B content / demand gen: what actual lead gen tactics have worked for you?\n\n- Any certified or structured ways to set up lead gen?\n- How do you do market analysis that actually guides strategy?\n- How do you figure out what to build for lead capture besides “another gated PDF”?\n- What channels actually work for you?\n\nRight now I feel like I’m creating content with no rewards whatsoever.\n\nWould genuinely appreciate any advice, frameworks, examples, or even reality checks. I just need to know what direction to push in before this gets worse.\n\nAnyone in the same boat and succeeded? 😩😩",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1765530643.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Vent about zero leads and frustration, seeking tactics amid emotional tone.",
    "composite_score": 2.91188956946071
  },
  {
    "score": 22,
    "title": "How can I generate Leads",
    "selftext": "Hello, I am a new marketer I worked for some agencies and learned the required stuff. But my problem is I fail to get leads to reach out to. How can I generate leads in the most cost effective way, if there is a free way then that will be better because I don't much capital to spare.\n\nI just want to get my first few clients frist do you have any particular suggestion for that?\n\nPS: I am doing some outreach on LinkedIN but No Luck, I am manually scrapping google maps and mailing them but again no luck.\n\nBut please note I am looking for advice and suggestions not any paid services I cant afford anything like that right now.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1764246989.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Asks for advice on generating leads with limited budget; not a developed method.",
    "composite_score": 2.9472295078349924
  },
  {
    "score": 22,
    "title": "60% of our last 10 closed-won deals had one thing in common:",
    "selftext": "We only realized it after reviewing our last batch of deals:\n\n6 out of 10 were signed within 90 days of a new CMO or VP Sales joining the company.\n\nWe weren’t specifically targeting those people at the time. It just came up during the retro. But looking back, it makes sense.\n\nWhy it probably works\n\n- New execs want quick wins\n\n- They’re more open to new tools and strategies\n\n- No attachment to existing vendors\n\nWe’re setting up a workflow to track new hires in our ICP and notify the team as soon as someone relevant joins.\n\nAnyone here already doing this?",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1751036425.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Presents observational insight and a proposed process to track new hires for leads.",
    "composite_score": 2.7511046364940075
  },
  {
    "score": 22,
    "title": "Starting a Lead Gen agency in 2025",
    "selftext": "Hi I’m a performance marketer with 3 year of experience in google and meta ads. I have decided to build a lead generation agency where I help clients in the B2B space like real estate, service-trade business generate quality leads. Targeting the US and UK regions. My approach is to understand their business first and then create a custom plan.\n\nIs this type of agency model still profitable? Since we have ai taking over. Need some advice from people who have done it. ",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1750405658.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.48,
    "category_rationale": "Asks for advice on profitability of a lead-gen agency; lacks substantive content.",
    "composite_score": 2.931212838185602
  },
  {
    "score": 22,
    "title": "Struggling to get leads for my tech consultancy",
    "selftext": "I run a cloud and digital transformation consultancy, mostly aimed at mid-sized businesses that need help modernising their infrastructure and workflows or need expert growth advice for new projects they've got going. Thing is… I'm really struggling to get decent leads through the door.\n\nMy background’s in software development and tech leadership. I’ve been in the weeds for years building systems and leading teams. But I’m new to actually running a business, and the whole sales/marketing/lead-gen side of things is proving to be a serious learning curve.\n\nI’ve sunk a bunch of time into content creation (blogs, LinkedIn posts, that kinda stuff), but it feels like I’m screaming into the void. I’ve also been working my network, but most of the people I talk to aren’t the decision-makers. They *could* intro me to someone who is, but that’s a pretty long and unpredictable chain.\n\nI’ve thought about slapping a lead magnet on my website, like a long-winded diatribe in the form of a PDF, like, \"In-depth guide to auditing a scaling platform\", but realistically, who's downloading that?\n\nBeen to a couple of entrepreneurship events too, but the people I've met there don't think about tech, expect that it \"just works\" and they work on unrelated fields.\n\nSo, yeah, what’s actually working for others out there? Cold outreach? Get LinkedIn Premium and get 15 measly InMails per month and send to CTOs? Paid ads?\n\nI'd like to know what's worked for you and what hasn't. Thanks.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1747894326.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Questions what lead-gen strategies actually work; seeks guidance rather than presenting a method.",
    "composite_score": 2.8968258760318495
  },
  {
    "score": 22,
    "title": "Should my business stick to booking appointments or sell mild/warm leads instead?",
    "selftext": "Hey, I run an appointment setting/lead gen business, got a team of almost 30 people(all part time working with us as a side hustle). We currently have 4 full time clients from different niches who are currently paying us retainer+payment for each appointment. \n\nIn the last 7 days, my team generated around 9 leads for one of our clients, whom he'll be contacting today (he was on leave for 1 week), and he will let me know if he books an appointment with any one of them (I trust him because we've been working together for a long time).\n\nCurrently we're charging around $40-$100 or more per appointment depending upon the niche, I'm thinking, would it be better to charge like $20 for each lead or something? I know a few business owners who could be interested in buying this.  \n  \nFor context, out of those 9 leads, 7 were personal phone numbers and other 2 were emails. \n\nAlso, selling only mild/warm leads would decrease the amoount of work for us.\n\nSo, would appreciate any advice in this situation\n\n  \n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1745846912.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question seeking strategic pricing advice for lead-gen business (pricing leads vs appointments).",
    "composite_score": 2.8598790864012367
  },
  {
    "score": 23,
    "title": "How companies are scammed in the name of Leads",
    "selftext": "So I was working in Pune in an advertising company. We had 4 publications focused on different sides of the business.\nMarTech Cube\nAi-techpark\nHrtech Cube\nFintecbuzz\n\nWe had almost no traffic on our publications yet We would reach out to companies saying we have their target audience as our subscribers, daily readers and if they market with us, they will get good quality leads which will convert. We did everything in such a professional way that nobody would think we are scammers. \nWe pitched them for content syndication campaigns through which we will generate demand for their product and will share leads on a weekly or Monthly basis.\nBut the leads were not MQL, HQL. It was just database which we got it from various tools. The price per lead was $25.\nWe were working from Pune, India which is tha hub of such lead gen scammer companies but we told our clients that we are based out of Dubai.\nCompany was maintaining the publications as a proof, posting shitty content on a daily basis to tell the world we have a good amount of traffic but in reality it was just a simple database you could get from anywhere.\n\nGuys beware of such companies. PLEASE CHECK THEIR LINKEDIN and google to verify. How many employees are there, what are their locations. \n\n",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1741530418.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional rant warning about scammy lead-gen companies and urging caution.",
    "composite_score": 2.745435702400743
  },
  {
    "score": 23,
    "title": "Advive growing our lead gen ai tool ",
    "selftext": "This isn’t a 'use my tool' spam post, but I'm genuinely interested in how to connect with more companies in the lead generation space. We have developed our own AI chatbot (not using GPT) that specializes in qualifying,  it has been very successful with current users in debt collection, ACA, annuities, and other sectors. We are eager to work with other lead generation companies but are unsure about the best ways to expand our reach. Any suggestions or advice would be greatly appreciated.\n\nThanks in advance!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1714544217.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Requests advice on expanding a lead-gen AI tool; no clear model or steps presented.",
    "composite_score": 2.5909075842907185
  },
  {
    "score": 21,
    "title": "What’s your #1 underrated channel for generating quality leads?",
    "selftext": "I’ve been testing the usual channels like LinkedIn outreach, cold email, and paid ads, and while they deliver results, I feel like I’m missing out on other opportunities. For those of you with experience in lead gen, what’s one underrated channel or tactic that’s actually brought in quality leads for you (not just numbers), and how do you usually qualify them before putting more time and resources into nurturing?",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1758790197.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for an underrated channel tactic to generate quality leads; advice-seeking.",
    "composite_score": 2.9812362264674266
  },
  {
    "score": 23,
    "title": "best tools for cold emailing ",
    "selftext": "\nHey everyone,\n\nI’m planning to dive into B2B lead generation and cold email outreach for multiple clients (no specific ICP yet). I’ve tried a couple of tools, but I’m looking for insights from the community on what’s really working out there in 2025.\n\nI’m after tools that are:\n\t•\tCost-effective (startup budget vibes).\n\t•\tAccurate and reliable (no junk data, please).\n\t•\tGreat for scaling outreach without getting flagged.\n\nI’d love your thoughts on:\n\t1.\tThe best tools for finding high-quality leads.\n\t2.\tYour go-to platforms for cold email campaigns (deliverability is key).\n\t3.\tAny hidden gems I should check out.\n\nLet me know what’s worked for you and why—it’d be great to get some recommendations from people with real experience. Appreciate the help!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1736215611.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.75,
    "category_rationale": "Requests best tools for finding leads and running cold emails, implying a list of tools.",
    "composite_score": 2.875892088628742
  },
  {
    "score": 21,
    "title": "Working on your offer is best thing you can do to grow your business",
    "selftext": "Offer is game changer in your campaign\n\nI have seen this a lot of time with Client of mine, \n\nEven when you you have bad creative or really simple one. But what grab attention was the offer\n\nSo here is my suggestions\n\n1. Offer don't have to be 10 % discount. Thaat don't excite anyone. But the same way if you offer too big discount. People start doubt your service\n\n2.Offer small product/ service  free on some purchase\n\n3. Sell package instead of single product. This work best\n\n4.do the research : We saw that for home security client. Nobody was offering free product and take big deposit. We offer free doorbell and and free installation and competitive pricing and that campaign work well even simple image\n\n5. Now you start getting lead. Here people make big issue is not asking qualified question before.dont ask simple name and number.you will get 70% fake leads",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1735718517.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Provides a numbered sequence of actionable steps to improve offers and generate leads.",
    "composite_score": 2.671032328189166
  },
  {
    "score": 20,
    "title": "We’re getting 15%+ positive reply rates.",
    "selftext": "It’s like we’ve finally figured it out. In addition to upgrading our cold email tech &amp; strategy, we also changed our offer. I see a lot of people struggling on here to find their footing, I was there recently too and I’ve been doing this for 20+ years. \nI’ve learned that no matter the list enrichment, beautiful personalization, or SDR quality; if your offer isn’t a fit for your market, it won’t matter at all.\nI had to learn that no matter how sure I was that I knew what our audience needed and wanted, I was still wrong. \nIn three weeks I’ve run more meetings than in the last 6 months. \nProduct market fit can be elusive. If you’re struggling to get replies and new clients, I’d suggest exploring all of the possible services/solutions you offer or could offer and try and find creative applications that aren’t as obvious. \nOr specialize by industry.\n\nIt’s hard as ever selling into B2B right now. I hope everyone has a strong end to their year!! Good luck!!!",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1732145239.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Shares insights about offer fit and PMF, presenting a mental-model-like justification.",
    "composite_score": 2.585283312573038
  },
  {
    "score": 12,
    "title": "Is Upwork(or similar Market Place) still good for quality software agency leads?",
    "selftext": "Hey folks,\n\nSenior software engineer here. I recently started a small software agency as a solo founder. The plan is to stay lean (10 people max) and obsess over quality, not a 1000 person shop.\n\nSo far, clients have come via referrals and social. I’m considering Upwork (and similar platforms) but I’m unsure about the signal to noise if you’re aiming for higher-quality work.\n\nFor agency owners:\n\n* Is Upwork (in 2025) still a good channel for quality leads?\n* What profile/proposal tactics helped you win good projects without racing to the bottom?\n* How do you pre-qualify, avoid scope creep, and spot red flags?\n* Outside Upwork, which channels brought your best clients (Clutch, LinkedIn content/DMs, cold email, communities, partnerships, etc.)?\n\nFor people who hire agencies:\n\n* Where do you usually find teams like ours?\n* What signals make you trust a small shop (case studies, references, process docs, transparent pricing, trial sprints)?\n\nNot pitching, just trying to learn from real experiences before investing time.\n\nThanks in advance! 🙏\n\nPS: Our agency niche is mostly B2B/AI SaaS development service.",
    "subreddit": "LeadGeneration",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1756708692.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Question about whether Upwork is a good channel; advice-seeking with little substance.",
    "composite_score": 2.5033201527832514
  }
]