[
  {
    "score": 7320,
    "title": "Took a Crack at the Barrel",
    "selftext": "Figured I should get in on the action since the Cracker Barrel logo redesign is all anyone seems to be talking about.\n\nPersonally, I think it is a solid update and the outrage feels a little overblown. For fun, I explored how the new design might carry over a few subtle callbacks to ease the transition and keep some of that heritage intact.\n\nNot a critique, just an experiment in how small details can bridge old and new.\n\nSee this and more design fun on my insta http://www.instagram.com/VisuallyAW",
    "subreddit": "logodesign",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 7320,
    "downs": 0,
    "created_utc": 1756183143.0,
    "media": null,
    "is_video": false,
    "num_comments": 407,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Design-focused post exploring how a logo redesign might carry over heritage details.",
    "composite_score": 5.88990048839837
  },
  {
    "score": 4442,
    "title": "How AI is used to steal other people's work.",
    "selftext": "Today, having a day off, I decided to look at what's on Dribbble in current works and came across the work of one \"designer\", it seemed very familiar to me for some reason.  [https://dribbble.com/teamographic](https://dribbble.com/teamographic) . When I opened his profile, I had a feeling of deja vu, because many of the works were similar to mine, but not 1 in 1. And I realized that now charlatans have a new way, they don't steal your works, but ask AI to change them and thus fill their portfolio. So be careful. I hope Dribbble will respond promptly to the complaint.",
    "subreddit": "logodesign",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 4442,
    "downs": 0,
    "created_utc": 1754846737.0,
    "media": null,
    "is_video": false,
    "num_comments": 216,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Central claim about AI-enabled theft of artwork with reasoning and example.",
    "composite_score": 5.543406180165135
  },
  {
    "score": 3977,
    "title": "Chili oil logo",
    "selftext": "WIP Need input! I'm designing a logo for a family friend who's creating a chili oil. Had to convince her to hire me and not use an AI logo she made (attached here)😬... I want the luchadora to not look like a ski mask, but I'm trying to keep the icon fairly minimalistic... Stitching? No stitching? Her ponytail is also supposed to look like a chili pepper without being too obvious/cliche. I'm still messing around with the actual layout of the logo..\n\nAdditional tips/ideas also very appreciated 🫶🏼",
    "subreddit": "logodesign",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 3977,
    "downs": 0,
    "created_utc": 1739234651.0,
    "media": null,
    "is_video": false,
    "num_comments": 332,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Request for input on a WIP logo with design decisions; no clear model or steps.",
    "composite_score": 5.573386895541576
  },
  {
    "score": 2960,
    "title": "Branding noob here – logo for friend's jewelry hobby. Roast me / fix me?",
    "selftext": "Help me not suck before I gift it.  \nTIA\n\n\\-----------------\n\nThank you all for the thoughtful feedback and time - truly helpful. Quick recap:\n\n**Leg Ring**\n\n* Keep/refine: **3** (⬆139)\n* Ditch: **17** (⬆1243)\n\nIt’s my sentimental hill. I’ve known it’s messy; now I *see* it. Will redraw to earn its place.\n\n**Responsive System vs One-and-Done**\n\n* Keep system: **9** (⬆147)\n* Pick one: **28** (⬆1256)\n\nCan’t follow the majority here. This isn’t corporate - it’s a quirky hobby brand. Core memory: *“bird with necklace in beak.”* That sticks whether detailed or tiny. So: **full illustration for joy, simplified mark for tiny jewelry things.** Both stay.\n\n**AI Usage**\n\n* Supportive: **4** (⬆21)\n* Negative: **13** (⬆629)\n\nI get the “cheating” vibe. But AI illustration now beats 80% of humans, and I’m not in the top 20% - never will be. FWIW: started with my sketches → AI illustrations are derivatives of my vector logo, not the source.\n\nAll tips noted. Iterating now. Grateful.",
    "subreddit": "logodesign",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 2960,
    "downs": 0,
    "created_utc": 1761831005.0,
    "media": null,
    "is_video": false,
    "num_comments": 318,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Dense notes about branding decisions; primarily a request for critique rather than a how-to.",
    "composite_score": 5.345833748917889
  },
  {
    "score": 2626,
    "title": "Chili Oil PT. 2",
    "selftext": "CHILI OIL PART 2 🌶️🌶️🌶️\n\nThank you everyone who contributed to my last post looking for critique/feedback! Quick recap: Family friend was using an AI generated logo and I convinced her to let me design her something. My original luchadora design came across more dominatrix than Mexican Wrestler so that's what I've been working on.\n\nEdits include: Switching winking eye\nAdded flame design to mask\nAdded stitches around ear\nEnhanced Chili ponytail\nShortened/straightened chili pepper\nRemoved star from pony, replaced with chili stem\nOther small refinements\n \nHOW WE FEELING???\n\n",
    "subreddit": "logodesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2626,
    "downs": 0,
    "created_utc": 1740005421.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Progress update on design edits and design refinements; no explicit instructional steps.",
    "composite_score": 5.235024090625189
  },
  {
    "score": 2266,
    "title": "What do we think of my new personal logo? (My name is Sky)",
    "selftext": "I'm Sky and I'm a UI/UX and Graphic Designer and this is my new logo for my personal design practice!\n\nMy goal was to capture the fundamental ideas of my design style:\n\n* My designs are based in a strong understanding of design basics. To show that, I wanted to reference classic modernist logos by using bold, geometric shapes in repetition.\n* My design practice also relies on experimental and rebellious ideas, which I called to mind by the \"stretched\" look of the logo and the intentional illegibility of the letters.\n* My designs are trend-conscious, which is included by using a slight \"inkbleed\" effect that gives the letters a rounded look and connects the shapes together.\n* All the previously mentioned traits also combine to give it a futuristic/techy look, especially with the standalone square on the K which looks like a pixel (Sandisk redesign anyone?). That's important to me as my UI/UX skills also include coding in HTML/CSS/JS\n* Bonus: The white on blue looks like a cloud in the sky lol.\n\nIt was such a battle trying to brand myself in a way that covers everything I do, but I think I ended up with something really solid. It will mostly be used as a pfp and on my portfolio website (when I make one). Let me know what you think!\n\nAlso, it says it everywhere in the images but my instagram is @ sky\\_lr\\_design if you're interested in seeing my work.",
    "subreddit": "logodesign",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2266,
    "downs": 0,
    "created_utc": 1744228034.0,
    "media": null,
    "is_video": false,
    "num_comments": 230,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.75,
    "category_rationale": "Self-promotional post explaining design philosophy and branding choices.",
    "composite_score": 5.26475751007259
  },
  {
    "score": 2225,
    "title": "Rebranding my sister's manga shop - feedback wanted!",
    "selftext": "My sister owns a manga store and asked me to rebrand it! Currently working on the logo, afterwards some print work and a website. She wanted blue and a cute, anime style angel girl in the logo since it translated to Manga Angel. Second slide is the current logo.\n\nThis is my sketch, she already approved it, no comments about anything. I still need to re-draw the girl in illustrator but would love some feedback. Some points i'm unsure about:\n\n\\- Wings look a bit out of balance, maybe remove the swirl in the middle and add a bit more space between the girl and the wings?\n\n\\- I love the earrings but it might make it a bit cluttered?\n\n\\- Not sure about the font, sister likes it though. I wanted a bit of a comic/manga style but something feels off. \n\n  \nAny feedback is welcome! Thank you",
    "subreddit": "logodesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2225,
    "downs": 0,
    "created_utc": 1750945475.0,
    "media": null,
    "is_video": false,
    "num_comments": 227,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Request for feedback on a manga-store logo, lacking substantial instructional content.",
    "composite_score": 5.268992583498916
  }
]