[
  {
    "score": 917,
    "title": "Tip from a VP who's actually hiring right now.",
    "selftext": "Unfortunately for me, one of my star performers was poached, so I have an open seat to fill.  The job posting went up late last week.  I really feel for those you who are searching for a position right now.  I can't believe the number of applications I received in under a week.  It's overwhelming.  \n\nI don't use AI to comb through these, but I cannot give every resume careful consideration when I'm trying to go through a few hundred per day while also keeping on top of business as usual.  With that said, only about 1 in 50 or so bother to attach a cover letter.  While I don't have the time to read every resume beyond a quick 1 minute (or less) scan, I do read every cover letter.  I figure if someone takes the time to tell me why they think they're a good fit, I owe them the courtesy of reading it. On the other hand, I give the 1 click apply from Indeed applicants about the same amount of time they took to apply to the position. \n\nSo for those of you looking for a new position, If you find a job that you think is actually a great fit, I would encourage you to take the time to write and apply a cover letter.  That's your chance to explain why you think you're a good fit, and when hiring managers are giving resumes 30 seconds to 1 minute tops, we might miss something. ",
    "subreddit": "marketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 917,
    "downs": 0,
    "created_utc": 1763393792.0,
    "media": null,
    "is_video": false,
    "num_comments": 273,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Offers hiring advice and a concise takeaway about crafting cover letters as a job seeker.",
    "composite_score": 4.864217962611437
  },
  {
    "score": 870,
    "title": "Google is no longer a search engine, and it's dangerous times ...",
    "selftext": "Google is no longer a search engine, it's an answer engine.I'm sorry, but this needs to be discussed. \n\nI call bullshit on their claim that this leads to more clickthrough's. \n\nGoogle stores the cumulative knowledge of all mankind. Provided freely and willingly by billions of websites. The implicit understanding was:\n\n1. we submit our sites to google so we can be listed on their search engine\n\n2. in return, google monetizes the search result pages with ads.\n\nWith their AI search they are breaking this contract. Their move to become an \"answer engine\" instead of a \"search engine\" off the backs of billions of websites that entrusted them to the original search/result/ads relationship needs to be dealt with immediately.\n\nI don't have the answers, but in my opinion, this shift is going to put hundreds of millions of websites out to pasture.",
    "subreddit": "marketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 870,
    "downs": 0,
    "created_utc": 1715773542.0,
    "media": null,
    "is_video": false,
    "num_comments": 425,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.62,
    "category_rationale": "Strong critical argument about Google's AI shift with opinion and warnings.",
    "composite_score": 4.974722954559023
  },
  {
    "score": 850,
    "title": "The mistake that made my client $20,000 in one email",
    "selftext": "I have been doing email marketing for over a decade. Mistakes happen, but I got my biggest client ever last year: a dried fruit company that you may have seen on supermarket shelves. In one of my promotional emails that went out to thousands of people, I thanked people for ordering, but forgot to segment the right audience, so everyone received a thank you (even those who hadn't purchased). We received a flood of replies from confused customers.\n\nIn response, I decided to make an \"Oops!\" email that apologized for the mistake, and positioned it to link to our new sale. I also created a new character, a bird that nested in a fruit tree, and made it the mascot for error emails going forward. \n\nThat \"Oops\" email generated over $20,000 in sales, our biggest single-email sales message since the company started email marketing. **The lessons:**\n\n**1. You can make mistakes, but apologize quickly and be honest.**\n\n**2. You can make light of the mistake, and even turn it into a sales opportunity.**\n\n**3. Be humble, and be authentic. People appreciated the apology email more than the actual sales emails!**",
    "subreddit": "marketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 850,
    "downs": 0,
    "created_utc": 1760332363.0,
    "media": null,
    "is_video": false,
    "num_comments": 119,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Case study with explicit lessons learned about email marketing and mistakes.",
    "composite_score": 4.682020183108401
  },
  {
    "score": 766,
    "title": "Facebook and Instagram is no longer social media ",
    "selftext": "\n\nFacebook is already a sinking ship. Facebook has become a platform for boomers and spam. No young people use it anymore everyone is on TikTok. That’s why Zuckerberg is Trumps bootlicker now, thinking after Trump will ban TikTok users will return to Facebook and Instagram. \n\nAll of Zuckerberg’s platforms are terrible that's  why people leaving it. Instagram isn’t even social media anymore, it’s just a billboard for influencers promoting paid partnerships. It’s depressing and anybody who cares about mental helt stay away form Instagram.\n\nFacebook is outdated and full of spam, with no useful information.  \n\nThings will only get worse. Instead of fixing bugs on his aging platform and removing spam, Zuckerberg tries to lay off employees to cut costs and make the company look profitable to investors. Meanwhile, he’s losing users. To make things worse, he thinks AI-generated users will boost the platform. What a moron.  People aren’t as stupid as he thinks.  \n\nFacebook is sinking, and Zuckerberg is laying off employees to save money and pretend the company is performing well.  \n\n\n",
    "subreddit": "marketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 766,
    "downs": 0,
    "created_utc": 1736904456.0,
    "media": null,
    "is_video": false,
    "num_comments": 208,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional critique and frustration about Facebook/Instagram.",
    "composite_score": 4.734868507004509
  },
  {
    "score": 762,
    "title": "Warning: the r/agency subreddit is currently being auctioned off for $50,000 and is being used by mods to promote scams to marketers",
    "selftext": "First of all, I have been a long-time member and lurker of [r/agency](https://www.reddit.com/r/agency/) for a while. I’ve worked in marketing for quite some time and have been toying around with the idea of starting my own SMMA for a while now and that sub offered tons of useful info on that subject. There was always a little bit of self-promotion happening within the community by the owners (such as [u/ggildner](https://www.reddit.com/user/ggildner/) promoting his agency growth ebooks and whatnot) but it was interspersed between actually useful and valuable content so I saw no real harm there.\n\nHowever, a few weeks back, I noticed that a new mod was added to the subreddit. This was his very first contribution:\n\n[https://imgur.com/FNJ9F4v](https://imgur.com/FNJ9F4v)\n\nThis mod spoke in very obviously broken English which I thought was a little strange initially but I didn’t pay it much mind. He’s since edited this comment to make it a lot more legible but previously, it was literally incomprehensible gibberish as pointed out by [u/domestic-jones](https://www.reddit.com/user/domestic-jones/). It was weird but it can be overlooked as not everyone in this field is gonna be a great speaker (English is my second language too). However, at his level of proficiency, it was a bit ridiculous that he’d even be moderating an English-speaking community in the first place.\n\nThe thing that really put me on super high alert was this post here:\n\n[https://imgur.com/ZQhXsnK](https://imgur.com/ZQhXsnK)\n\nNot necessarily a strange post for this sub by any means, however, this comment was indeed highly strange:\n\n[https://imgur.com/079Qe4b](https://imgur.com/079Qe4b)\n\nJudging by the downvotes, it was clear I wasn’t the only one who immediately suspected this to be a scam. So you can imagine my surprise when I see this new so-called “mod” commented this in reply to the scammy comment:\n\n[https://imgur.com/J5aLDc8](https://imgur.com/J5aLDc8)\n\n[https://imgur.com/n787ec7](https://imgur.com/n787ec7)\n\nThis is when I knew for a fact that this wasn’t your average mod and this dude has just been given the ultimate license to promote whichever scams he wanted on this sub. I started monitoring this “mod’s” activity and found more examples of him advertising this scammy protonmail email:\n\n[https://imgur.com/b8H2s44](https://imgur.com/b8H2s44)\n\nHe published this on a post that was over a year old. On top of that, when I checked his account again, I then witnessed this new account (that has a suspiciously similar writing style to the “mod” I might add) replied the following beneath their obviously promotional comment:\n\n[https://imgur.com/fXOSTM3](https://imgur.com/fXOSTM3)\n\nIt seems I wasn’t the only one that thought that was strange judging by [u/nutag](https://www.reddit.com/user/nutag/)’s comment:\n\n[https://imgur.com/kUwiQyl](https://imgur.com/kUwiQyl)\n\nHowever, when I went to check the Reddit activity of this so-called “satisfied customer”, I realized that it was the very same account that had left the original comment promoting the scammy protonmail email in the previous thread:\n\n[https://imgur.com/YQdxr06](https://imgur.com/YQdxr06)\n\nSo basically, this guy was recommending a clearly legit service that he himself used a year ago and then he “rediscovered” the same service provider through the mod’s comment on a one year old post and just had to express his gratitude for the mod’s suggestion? How stupid does this “mod” think his audience is?\n\nI started doing even more digging and then discovered that this subreddit is actually up for sale on a popular digital assets transfership forum: \n\n[https://imgur.com/iTAhZXb](https://imgur.com/iTAhZXb)\n\n[https://imgur.com/W0l5VKr](https://imgur.com/W0l5VKr)\n\n[https://imgur.com/lwmqXsf](https://imgur.com/lwmqXsf)\n\nThis sales listing was posted right around the same time that this new “mod” joined the subreddit and to this day, he is attempting to sell his moderatorship rights to the subreddit for a whopping $50,000. I messaged [u/ggildner](https://www.reddit.com/user/ggildner/) about this, notifying him of the fact that the sub is being listed for sale on an external forum by pretending to be a potential customer to see if he was in on it. However, he simply accepted my chat request and then said absolutely nothing, which leads me to believe that he is well aware of what is happening. The fact that he didn’t get rid of the new “mod” after I sent him a screenshot of the sales listing says all I needed to know. I messaged all of the other mods as well but no one responded to me about this, which means the accounts either all belong to the same people or they’re no longer even active on the platform.\n\nNow, I see this same “mod” attempting to take over another sub by the name of [r/FakeGuru](https://www.reddit.com/r/FakeGuru/):\n\n[https://imgur.com/ZqL0AHe](https://imgur.com/ZqL0AHe)\n\nCall me crazy but I can already envision this “mod” getting paid hefty sums to decide which gurus are fake and which are real. A continuation of his behaviour so far in the [r/agency](https://www.reddit.com/r/agency/) sub.\n\nI just want to bring this community's attention to what's happening over there as I'm sure there's a big overlap between the two communities. Do not trust what you see on there anymore, the mods are actively deleting info that is truthful and promoting info that aims to scam members of the sub. Beware.\n\nEdit: u/ggildner has already deleted all of his accounts that were previously mods from Reddit. I guess he had to much PII that tied his agency to the sub so he scrubbed everything clean. Name and shame works folks. Now just gotta get rid of the remaining scammer on the sub.\n\nEdit #2: Some positive news to report, it appears that r/agency has been purged of its moderator team. However, the bad news is that there is currently a r/redditrequest thread that I strongly believe was made by an alt account of the previous mod:\n\n[https://www.reddit.com/r/redditrequest/comments/1hst5o4/request\\_ragency\\_because\\_no\\_mods\\_exist\\_there/\\\\](https://www.reddit.com/r/redditrequest/comments/1hst5o4/request_ragency_because_no_mods_exist_there/%5C)\n\nThe reason I suspect this is because this was the account that published the original thread ([https://imgur.com/ZQhXsnK](https://imgur.com/ZQhXsnK)) where the mod first introduced the scammy protonmail. I initially didn’t think much of it but after looking very deeply through this account’s history, the writing style and the misspellings are all very eerily similar to the previous mod’s writing style:\n\n[https://imgur.com/85HqHSr](https://imgur.com/85HqHSr)\n\nI believe he orchestrated this post as a precursor to the astroturfing campaign to introduce the “reputation fixer” protonmail address as the mod-approved savior. Why wait for someone else to post something relevant when you can just do it yourself to get your ad seen?\n\nI also find it strange that just like the mod account, this account’s last activity prior to becoming active on the r/agency sub was well over two years ago. Writing style was completely different from the comments they made back in 2022 in comparison to their writing style now. I obviously don’t have as much proof to back up these claims as I did in my original expose but my gut is telling me it is the same exact person behind it.\n\nOn top of that, I see u/ggildner attempting to become a mod in the sub again:\n\n[https://www.reddit.com/r/redditrequest/comments/1hsu47x/comment/m588jf4/](https://www.reddit.com/r/redditrequest/comments/1hsu47x/comment/m588jf4/)\n\nDespite literally commenting on the now deleted r/digital_marketing post that he was now “too busy” to moderate and gave away all his subs. He’s since edited the comment to say something completely but this is still pretty damning if you ask me:\n\n[https://imgur.com/MwrwDiq](https://imgur.com/MwrwDiq)\n\nWhy would you want to go back if you felt the need to leave in the first place? Please make it make sense u/ggildner. I tried to submit a new request on r/redditrequest but they didn’t allow me due to the 15 day rule:\n\n[https://imgur.com/5WWzuAY](https://imgur.com/5WWzuAY)\n\nI had submitted one yesterday trying to get them to replace the mods so I guess I’m shit out of luck. To be frank, I don’t have a super burning desire to moderate the community in the first place but I sincerely hope that none of these guys ever get added to the mod list again. In any case though, I consider this situation to be a win, just hoping there won’t be a round two of the same old.\n\n",
    "subreddit": "marketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 762,
    "downs": 0,
    "created_utc": 1735853788.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Warning/analysis about scams in a subreddit with concerns about moderation.",
    "composite_score": 4.528114524946823
  },
  {
    "score": 686,
    "title": "Whoever is handling Taylor Swift's Marketing is currently putting on a master class performance.",
    "selftext": "I mean goddamn. She's inescapable. I have heard more about Taylor Swift in the past two months than I did from 2009-2014 in Middle School and High School.\n\nThe way Taylor has reclaimed such mainstream relevancy again is impressive. She never faded into obscurity, however from 2015-2022 you barely heard about her unless you were a swiftie. It seems those who handle her marketing are using every tool at their disposal. The latest of which is the heavy exposure and involvement in NFL Games with the Kansas City Chiefs and her \"boyfriend\" Travis Kelce.  \n\nIt's not just this also. There's apparently academic researchers now holding \"academic symposiums\" discussing Taylor Swift. It seems like twice a week there's a well placed story like this about Taylor Swift in the news. \n\nAs overwhelming as it is I have to give them credit. It's very impressive .It worked. Taylor is apparently still very popular with teenage girls which is insane to me. It's as if when I was a teenager girls my age were really into Britney Spears. They weren't. They were instead into.....Taylor Swift. \n\nWhat are everyone's thoughts about this? I've never seen anything like this before. And if anyone sees this who is involved in any of the marketing, do Lady Gaga next!",
    "subreddit": "marketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 686,
    "downs": 0,
    "created_utc": 1696258409.0,
    "media": null,
    "is_video": false,
    "num_comments": 346,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Admiring overview of marketing mastery in Taylor Swift's campaigns with opinion.",
    "composite_score": 4.797121474454988
  },
  {
    "score": 617,
    "title": "A peculiar insight into the click fraud problem on Twitter",
    "selftext": "Hi all\n\nLet me first explain how click fraud usually works:\n\n1. A scammer creates a website and contacts an ad network like Google Ads, Microsoft Ads, LinkedIn Ads, Twitter Ads, etc. and opens a publisher advertising account. This allows him to monetize his website by placing ads on it.\n\n2. Instead of waiting for real people to visit his website and click on the ads, he uses stealth bots (e.g. puppeteer-extra and its stealth plugin) to visit his website and click on the ads.\n\nHe'll also use residential proxies to fake his IP address for every click, and fake his device fingerprint, but the basic idea is he sends bots to his website to click on the ads.\n\nWe look at over 100 million ad clicks every month (checking them for click fraud), so we have pretty good data about the state of the industry.\n\nMost ad networks have two places you can show your ads: on the platform itself (e.g. on the twitter app) or on the ad platform's audience network (e.g. third party websites displaying twitter ads). Since criminals earn their money by showing ads on their own websites, that means most click fraud happens on the audience network. As an example, LinkedIn Ads has a click fraud rate of 61%, and only 3% of those clicks happen on the LinkedIn platform itself. The other 97% occur on the LinkedIn audience network.\n\nTwitter is an exception. The majority of its click fraud is happening on the Twitter platform itself. There's *a lot* of bots clicking on the ads. This is peculiar, since scammers have no financial incentive to do this. In fact, not only will they not earn any money from this, but they'll lose money, as they have to maintain their bots, run servers, pay for residential proxies, and so on.\n\nI suspect activists are targeting Twitter with click fraud bots to damage the company by causing its advertisers to flee.",
    "subreddit": "marketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 617,
    "downs": 0,
    "created_utc": 1702978758.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.85,
    "category_rationale": "Educational explanation of how click fraud works with data and conclusions.",
    "composite_score": 4.25667035716831
  },
  {
    "score": 601,
    "title": "Billboard advertising",
    "selftext": "Hey everyone,\n\nI'm a real estate agent, and I'm planning to put up a billboard for advertising. But I want something far from the typical, overused phrases like \"Looking to sell?\" or \"Ready to buy?\"—you know, the same old stuff you see everywhere. \n\nRecently, I saw a few ads that really stuck with me because they were so creative and unexpected. For example, Burger King did one with a moldy burger to show they don’t use preservatives. Another was a dental office ad that said, “We do business in your mouth.”\n\nIt’s these kinds of out-of-the-box, attention-grabbing messages that make people stop and remember. That’s what I’m aiming for.\n\nSo, I'm brainstorming. Does anyone have suggestions for a creative, mind-blowing slogan for my real estate billboard that will really stand out? I’m looking for something unique and memorable!",
    "subreddit": "marketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 601,
    "downs": 0,
    "created_utc": 1729179928.0,
    "media": null,
    "is_video": false,
    "num_comments": 211,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Requests creative billboard slogans; primarily a prompt for ideas rather than a structured post.",
    "composite_score": 4.6402644217221996
  },
  {
    "score": 498,
    "title": "Marketing has changed into something I don’t enjoy doing anymore ",
    "selftext": "I’m a marketing veteran, 25 years working on consumer products and entertainment. I used to love marketing when it was all about consumer research, product innovation, brand building and big above the line campaigns. \n\nNow it seems that digital marketing has taken over the whole game, and honestly it’s so boring to me. I feel like it’s turned marketing into an IT job, or a pseudo-sales job, and put the focus on chasing leads vs brand building or awareness. It’s also led to the further rise in measurability and metrics, which feeds into performance reviews and makes me feel like a robot measured against numbers. \n\nIt’s hard because in my career the whole discipline has changed drastically, and I know it’s either evolve with it or be a dinosaur. I just have no interest in the digital side though. Idk if there are still pure play branding or strategy jobs out there or if the C Suite controls those levels of planning now. But i definitely can’t settle happily into a tactical lead chasing role anymore.\n\nAnyway just my own personal situation, and definitely not an objective criticism of digital, just that it doesn’t fit with me well and wasn’t what I signed up for when I chose a career on marketing. ",
    "subreddit": "marketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 498,
    "downs": 0,
    "created_utc": 1735661961.0,
    "media": null,
    "is_video": false,
    "num_comments": 176,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Personal vent about career dissatisfaction with digital marketing.",
    "composite_score": 4.542087178804293
  },
  {
    "score": 460,
    "title": "New b2b lead gen strategy is crushing ",
    "selftext": "The past couple of weeks, we have been applying a new b2b lead gen strategy and it’s been working so good. \n\nHere’s a break down of how it’s working so you can try it yourself. \n\nThe first thing we do is produce an article that is relevant to our ideal customer and their business. \n\nThen we send out an email to them asking for their input on the article in exchange for a brand mention and backlink in the piece. We do no selling or anything in the email. \n\nWe ask them to be the expert and feature their opinion in the article.\n\nLast week we sent out 40 targeted emails and had 23 people respond to our offer with comments!\n\nSo we added all their replies to our article which has made it even more unique in the search engine, and we know at least 9 of the people have re shared it on their social channels to show off their mention.\n\nOut of the 23 who replied two people have booked calls with us to learn more about our service and 8 have followed us on our socials and we’ve made real positive contact with each company.\n\nThere are so many upsides to this strategy it’s crazy. \n\nGive it a shot yourself. \n\nGood luck ",
    "subreddit": "marketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 460,
    "downs": 0,
    "created_utc": 1726766067.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Step-by-step outline for a new B2B lead-gen strategy with actionable steps.",
    "composite_score": 4.318316785255136
  },
  {
    "score": 445,
    "title": "To demonstrate the power of ChatGPT for the future of marketing, here's a sample of how you can generate entire campaigns for a dog grooming business -- in under five minutes",
    "selftext": "I've seen a lot of skepticism in the marketing world about the new AI tool ChatGPT and it's potential for use in marketing. I think a lot of this skepticism comes from people who've never used it, so I wanted to demonstrate it's power. Note: Everything in this post took less than five minutes to generate.\n\nHere's my initial prompt: \"Could you generated six unique, creative and innovated campaign ideas for marketing a new dog grooming business?\"\n\nThe ChatGPT response:\n\n1. Partner with local dog shelters and offer discounted grooming services to newly adopted dogs. This will not only help promote your business, but also give back to the community and support a good cause.\n\n2. Host a \"puppy pampering\" event at your grooming salon, where potential customers can bring their dogs in for a free mini-grooming session and learn more about your services.\n\n3. Offer a loyalty program where regular customers can earn rewards and discounts on grooming services. This will encourage repeat business and help build a loyal customer base.\n\n4. Create a referral program where current customers can refer friends and family to your business in exchange for discounts or free services.\n\n5. Collaborate with local pet stores and offer a \"bundle deal\" where customers can purchase grooming services and pet supplies at a discounted price.\n\n6. Host a \"doggy fashion show\" event, showcasing the before and after grooming transformations of your customers' dogs. This will not only be a fun and unique event, but also a great opportunity to showcase your skills and the quality of your grooming services.\n\nHere's a follow-up refinement: \"Could you tailor the campaigns for St. Patrick's Day promotions?\"\n\nThe ChatGPT response:\n\nSure! Here are six unique, creative, and innovative campaign ideas for marketing a new dog grooming business with a St. Patrick's Day theme:\n\n1. Offer a \"Lucky Dog\" package, which includes a full grooming service and a special St. Patrick's Day-themed accessory (such as a green bandana or bowtie).\n\n2. Host a \"St. Paws Day\" parade where customers can bring their dogs in costume and participate in a march around the neighborhood. Offer a discount on grooming services to all participants.\n\n3. Create a \"Pot of Gold\" referral program, where current customers can refer friends and family to your business in exchange for discounts or free services. For every successful referral, customers can \"find\" a virtual gold coin and redeem it for prizes or discounts.\n\n4. Collaborate with a local Irish pub and offer a \"Pint and a Groom\" package, where customers can enjoy a drink at the pub while their dog gets pampered at your salon.\n\n5. Host a St. Patrick's Day-themed doggy photo shoot, where customers can have professional photos taken of their dogs in festive costumes or against a green background. Offer a discount on grooming services to all participants.\n\n6. Offer a special St. Patrick's Day-themed grooming service, which includes a shamrock-shaped haircut or a green dye job. This will be a unique and memorable offering for customers looking to celebrate the holiday with their pets.\n\nAnother follow-up prompt: \"Could you generate six taglines to go with the campaigns?\"\n\n1. \"Lucky dogs get pampered at [Business Name]\"\n\n2. \"Celebrate St. Paws Day with [Business Name]\"\n\n3. \"Get your pot of gold at [Business Name] with our referral program\"\n\n4. \"Pint and a groom - the perfect St. Patrick's Day combo\"\n\n5. \"Get your dog in the St. Patrick's Day spirit with our festive grooming services\"\n\n6. \"Find your luck at [Business Name] with our St. Patrick's Day specials\"\n\nAnd one final prompt: \"Awesome. How about something even more creative, with metaphor and in six words or less each?\"\n\nThe ChatGPT response:\n\nSure! Here are six creative taglines, using metaphor and six words or less, for a new dog grooming business:\n\n1. \"Groomed to perfection, like a four-legged leprechaun\"\n\n2. \"Fur-tastic transformations at the end of the rainbow\"\n\n3. \"Where every dog is a pot of gold\"\n\n4. \"Your dog's mane-tenance headquarters\"\n\n5. \"Polished pooches, every time\"\n\n6. \"Bark less, wag more with a grooming from us\"\n\nNote: I just put \"six\" for simplicity's sake, but you could put as many ideas as you want it to generate. You can also refine prompts endlessly; this was just a quick demonstration. ChatGPT is an AMAZING tool, for ideation of nothing else.",
    "subreddit": "marketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 445,
    "downs": 0,
    "created_utc": 1673283056.0,
    "media": null,
    "is_video": false,
    "num_comments": 111,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Post presents a numbered list of six marketing campaign ideas.",
    "composite_score": 4.401443870047233
  },
  {
    "score": 442,
    "title": "The new Coca-Cola christmas ad is a load of ai-generated slop. Is it intentional?",
    "selftext": "The new coca-cola christmas advert is once again, second time, ai-generated. Last year was as well, and it somehwat usefula s you can see how AI has improved. It is far more stable in what it generates (objects dont jitter and flicker) even though theyre still completely wrong (as attached). After the first year went so shockingly badly, this year couldnt have gone much better. After the first one any sound marketing department would clean their hands of this and pretend it never happened. But they released another AI ad. And again, its awful.\n\n  \nIt must be intentional, get people talking about it, \"any press is good press\".\n\n\n\n",
    "subreddit": "marketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 442,
    "downs": 0,
    "created_utc": 1765467713.0,
    "media": null,
    "is_video": false,
    "num_comments": 137,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Angry/critical take on an AI-generated Coca-Cola ad with a clear opinion.",
    "composite_score": 4.391343269423688
  }
]