[
  {
    "score": 14349,
    "title": "After years of not knowing how to manage my money, I’ve finally learned self control and now have the most I’ve ever had. ",
    "selftext": "I (28m) just want to post this here to encourage everyone else who is seeing posts on here and getting discouraged. My entire life I never knew how money worked and my parents didn’t teach me. So I had to learn the hard way lol. But by building small habits I’ve learned how to change my situation. I know I’m far from being where I should be, but I’m also very far from where I started. If I can do it you all can too! Don’t worry about how long it takes, just focus on yourself and don’t compare yourself to others. 😇",
    "subreddit": "Money",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 14349,
    "downs": 0,
    "created_utc": 1712932917.0,
    "media": null,
    "is_video": false,
    "num_comments": 762,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Personal narrative about learning money-management habits and mindset.",
    "composite_score": 6.310614170047451
  },
  {
    "score": 13012,
    "title": "Daughter’s Apple investment milestone",
    "selftext": "Just hit a monumental investment milestone for my daughter’s account.  Bought 100 AAPL shares for around $1600 back in 1997 when she was 1 years old and this week it just passed the 200,000% mark (not including dividends).  I bought in just after Steve Jobs’s return to Apple and years before iPhones were even a glint in his eye.  Over the years AAPL has split multiple times and I have sold shares to pay for my D’s schooling and college and to buy other stocks like GOOG and FB, but if I had held onto all of the shares and reinvested the dividends it would be worth well north of $3,000,000.  My D’s stock account today is more than $1M and she’s still in her 20s, all a testament to a devoted buy-and-hold strategy.  (The other thing I like is that I have kept this in the same Fidelity account through thick and thin, so I can track the basis and return for all these investments down to the penny.).     ",
    "subreddit": "Money",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 13012,
    "downs": 0,
    "created_utc": 1764805451.0,
    "media": null,
    "is_video": false,
    "num_comments": 776,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Investing story illustrating a buy-and-hold approach and long-term gains.",
    "composite_score": 6.287087939186613
  },
  {
    "score": 12889,
    "title": "I just became a multimillionaire and don’t know what to do",
    "selftext": "I am a 24(m) I’m single, own a home and a car. I recently settled a big lawsuit which has completely changed my life. \nBefore this I was working hard labor, and made $18 an hour. I had plans on how I would build wealth as I got better at my job.\nBut I was in a recent accident that has landed me more money than I could ever imagine. No one in my family is a millionaire, nor do I know much people who are. But I now know that my approach to life, and plan has completely changed.\nMy question is not what to do with the money, but rather where can I invest my attention? In order for me to learn the ins and outs of money, and be able to manage it with confidence. What resources would you recommend? Anything, from mentors, books, videos, financial advisors, the proper banks etc",
    "subreddit": "Money",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 12889,
    "downs": 0,
    "created_utc": 1702870341.0,
    "media": null,
    "is_video": false,
    "num_comments": 6762,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Asks for resources to improve money management, seeking guidance.",
    "composite_score": 6.662822611066074
  },
  {
    "score": 11677,
    "title": "My parents passed away, i’m inheriting the house (it’s going to be sold immediately) and the entire estate. i’m 21, what should I do?",
    "selftext": "21, working full time, not in school. About to inherit a decent amount of money, a car, and everything in the house (all the tv’s, furniture, etc) I’ve always been good with money. I have about 12k in savings right now; but i’ve never had this amount of money before. (Probably like 200-300k depending on what the house sells for) I planned on trading in the car and putting the money into a high yield savings account. But i don’t know much more than that. I have no siblings, any advice? \n\nedit: i appreciate everyone suggesting i should keep the house or buy a newer, smaller house. however with my parents passing i’m not in the best mental state, and i’d prefer to be with my friends who are offering to move me in for like $300 a month. \n\nedit: alright yall! i’m reaching out to property managers. you guys have convinced me selling it is a bad idea! thank you for all your advice and kind comments! ",
    "subreddit": "Money",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 11677,
    "downs": 0,
    "created_utc": 1713229366.0,
    "media": null,
    "is_video": false,
    "num_comments": 3593,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Inheriting property/estate; requests broad financial advice.",
    "composite_score": 6.542657507301746
  },
  {
    "score": 8447,
    "title": "$69 per hour. I made it boys!",
    "selftext": "Just started a new job, I requested $95k per year. Hourly that came out to like $45.60 or so per hour. This new employer is cool and they just rounded up to $46 per hour without telling me and I just found out from my first check. \n\nTomorrow I'm working 10 hours of overtime and come to find out, $46x1.5 is $69. Evey hour I'll have something truly wholesome to be thankful for. \n\nI didn't have anyone else I could tell and my wife just rolled her eyes.. (Obviously ungrateful of a good joke) \n\n\n*Edit*\n\nHoly cow thank you guys for the support. To answer recurring questions, I'm in custom auto upholstery. This is not the normal pay for the industry and it's not actually a field I would recommend. \n\nAnd my wife rolled here eyes at the joke, not the pay. She's the best and very supportive of me! ",
    "subreddit": "Money",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 8447,
    "downs": 0,
    "created_utc": 1726805385.0,
    "media": null,
    "is_video": false,
    "num_comments": 1407,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Celebratory update on pay; no actionable content.",
    "composite_score": 6.228555232592783
  },
  {
    "score": 7731,
    "title": "My Mortgage is $425 a month. I dont know how others do it",
    "selftext": "I Kinda Inherited a 1956 house when my step moms mom passed away, I bought the house from my step mom for 50k, It was appraised at 80k when I bought it 10 years ago.  I took out a 15k loan to redo it all (Thats been paid off 5 years ago), Mostly inside, It had 30 amp electric, I upped it to 200 amp, redid all the electric, I redid all the plumbing to Pex. New Water heater and softener.  redid all the hardwood floors, Refloated all the Plaster walls, all new baseboards and trim, and paint.  Its only 1300sq ft, the 700 sq basement (other half is crawlspace) Im on 3/4 acre outside of a town.\n\nAnyways all these stories of small houses the size of mine selling for 250-300k for a house like mine,   On a $250,000 fixed-rate mortgage with an annual percentage rate (APR) of 6%, you'd pay **$1,498.88 per month** for a 30-year term or $2,109.64 for a 15-year one.\n\nI Had to buy a new car a few months ago for $650 a month, I was tired of buying used cars with 3 year warranty and the car only lasting 4 years before dumping money into them..\n\nSo Theres\n\n425 mortgage\n\n650 car payment\n\n125 internet\n\n50 for streaming\n\n150 for cell phone\n\n300 for electric\n\n1000 for groceries\n\n40 for chicken feed\n\n200 for vehicle gas\n\n100 for cat and dog food\n\n150 for car insurance\n\n150 for last years taxes i owed on\n\nwe each have 1 credit card and payments are $50 a month for both\n\nAll that is $3440 a month for just living.  Not sure where some other money goes, be we do stuff also. on weekends.\n\nI Make $28 an hour after everything is taken out i bring home $2900\n\nMy wife works part time for $1000 a month. We only have the one car and share it, She works til noon, Mon-Wed-Fri, And I work 2-10pm  One of us has to be home with the 3 year old\n\nThat leaves $460 a month to play with.  Thats not alot to be playing with... I think about an appliance going out or something and dont have 2k in the bank for that\n\nThe more I see tiktok videos on how Millenials cany buy a house,  the Stories are true...  there is no way an avg person making even $40 an hour can buy a house.  I Have younger neices and nephews still livng at home making decent money but cant buy a house thats worth a damn\n\nHere is my EDIT:  I did not expect this post to blow up like this.  Maybe I screwed up and did this wrong, When I bought the new Mistubishi outlander, My 2016 nissan rogue had 112k miles, Warranty ended, It needed all new tires, Heater core went out, (if you know anything about changing out a heater core, this isnt cheap) needed all new brake system, among a few other small things needed fixing. I Owed 1500 on the rogue so they tacked it onto the new loan, So that bumped it up abit.  I did a 5 year loan on the new vehicle because i didnt want to end up like the rogue, Being upside down on it if I wanted to trade it in.\n\nAs For My Credit Cards, I was 40k in debt in Credit cards at one point,  It took me over 5 years to pay them off,  I did it,  Now we have one each.  They arent that big, a few thousand combined, its better than I was over the last 12 years of my life when we were overwhelmed with them.  So Im not worried about 2 credit cards at all\n\nAs for groceries, Yes 1000 a month, im not getting rid of my cats and dogs, I have plenty of space and land for them in my house.  Cat litter isnt cheap, we dont buy crap cat and dog food, they eat the best, Its expensive and its not going to change.\n\nAs for my Internet, I have to have Xfinity/comcast, Like I said I live outside of town, Its the only service that was put here for High speed internet\n\nLastly, This post isnt about me, this post was supposed to be about the people that have to pay alot of money for somewhere to live.  If I had to pay $2000 for somewhere to live, Obviously my lifestyle would be different than it is now.  I wouldnt have Cats, Dogs, Chickens and ducks.  I Wouldnt have a $650 car payment, I wouldnt have 1000 monthly grocery bill,,  I have roughly $500 a month to spend on Us,  Could I modify it?  Yes I definitly could. Reading some posts on here I and going to look into everything and try to do some things to get me around $700 a month extra.  As for my Car payment, I did it, It is what it is, Im stuck with it for now",
    "subreddit": "Money",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 7731,
    "downs": 0,
    "created_utc": 1712591360.0,
    "media": null,
    "is_video": false,
    "num_comments": 5186,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Long personal budget/expenditure breakdown with no advice request.",
    "composite_score": 6.383249969353308
  },
  {
    "score": 6400,
    "title": "26yo, making 110k a year and completely underwater. Here’s my budget. Any advice appreciated.",
    "selftext": "These are my main bills before regular expenses like groceries and gas. I don’t spend much on myself. I have 50/50 custody of my child, I’m Cory ordered to pay the rent, internet, electric, and child support to his mom, that’s what’s blacked out. I rent a single room for 200 for myself at a family members house. \n\nAddressing  things that may look out of place-\nI work out of state, so I fly every 3 weeks, working locally would cause me to take a pay cut larger than my travel expenses, I would also need to get childcare and spend less time with my kid working locally. The “Alaska lounge” expense gives me free food and drink in airports, I also sleep there rather than booking a hotel during layovers. It pays for itself. \n\nAfter writing this out the biggest expense that looks unnecessary is the high truck payment. Like I said I have a kid, and needed something reliable and safe, I had to get something newer than my old single cab. I’m looking into refinancing. \n\nPlease help, be brutally honest. I need to get my finances right, I grew up in a bankrupt home and don’t want the same for my kid. The reason I came up with the idea to write it out is because I wanted to see what I could get rid of to start a savings plan for him.",
    "subreddit": "Money",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 6400,
    "downs": 0,
    "created_utc": 1707942777.0,
    "media": null,
    "is_video": false,
    "num_comments": 6041,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Budget sketch plus request for blunt advice on finances.",
    "composite_score": 6.281838187664421
  },
  {
    "score": 6208,
    "title": "Surprised to find out we’re millionaires",
    "selftext": "My wife and I both worked low paying nonprofit jobs. I bought a house in ‘01 and before that I sporadically put money in an IRA but since ‘01 I’ve more or less maxed out my IRAs.  We really didn’t do anything fancy. We just put money into IRA. I’m 57 and my wife is 50.  We also had a few orphaned 401k 503b\n\nI was very surprised when we decided to consolidate at fidelity and it turns out we had $650k.  These were super boring things like target date funds and EFTs like US large cap.  I was expecting $300k. \n\nWe also bought a distressed price of land and cleaned it up which is around $250k and the equity in our house. \n\nThat very boring set and forget autopilot saving was the big surprise though. ",
    "subreddit": "Money",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 6208,
    "downs": 0,
    "created_utc": 1711920162.0,
    "media": null,
    "is_video": false,
    "num_comments": 658,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Reflection on wealth and passive investing results.",
    "composite_score": 5.892464367142988
  },
  {
    "score": 5885,
    "title": "People who make $75k or more how did you pull it off? It seems impossible to reach that salary",
    "selftext": "So I’m 32 years old making just under 50k in inbound sales at a call center. And yes I’ve been trying to leave this job for the past two years. I have a bachelors degree in business but can not break through. I’ve redone my resume numerous times and still struggling. Im trying my hardest to avoid going back to school for more debt. I do have a little tech background being a former computer science student but couldn’t afford I to finish the program. A lot of people on Reddit clear that salary easily, how in the hell were you able to do it? Also I’m on linked in all day everyday messaging recruiters and submitting over 500+ resume,  still nothing. \n\n\nEdit - wow I did not expect this post to blow up the way it did, thank you for all the responses, I’m doing my best to read them all but there is a lot. ",
    "subreddit": "Money",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 5885,
    "downs": 0,
    "created_utc": 1713891639.0,
    "media": null,
    "is_video": false,
    "num_comments": 9148,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Asks for advice on reaching higher salary; seeking strategies.",
    "composite_score": 6.373007071560992
  },
  {
    "score": 5614,
    "title": "How are we supposed to afford living anymore? 20(M)",
    "selftext": "I am a 20yr old male living north of Atlanta in GA. I am currently making 22/hr about to be raised to 26/hr for 30-60 hours a week and occasional double time. I feel like for my age and area I am making well over average and yet I am still living almost paycheck to paycheck. I still live at home, paying about $1000 a month in bills, and I am pretty frugal with my money. It feels impossible to move out as rent for a one bedroom within an hour and a half of my job starts around 12-1300 not including utilities. If I was born ten years earlier I would be able to live on my own and still save a considerate amount of my income. What are you guys doing to stay afloat while living on your own in your early to mid twenties?\n\nEdit: I pay 250 for student loans 300 for car insurance 300 for rent plus my phone bill and money I owe to my parents for when I was unemployed which is $100 a month $2000 total. This is not accounting for gas for my 3 hour round trip from work, food, and occasionally my SO. I am less complaining about my situation and more so figuring out how you guys are making ends meet as I know people are in alot worse situations than I am. I am in millwright sanitary tig welding moving into aerospace in the future and will most definitely end up making enough to live comfortably",
    "subreddit": "Money",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 5614,
    "downs": 0,
    "created_utc": 1713460944.0,
    "media": null,
    "is_video": false,
    "num_comments": 2865,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Asks for advice on how to afford living; seeking strategies.",
    "composite_score": 6.085487853628139
  },
  {
    "score": 5412,
    "title": "Just hit 100k Salary! ",
    "selftext": "Just got promoted at my current job to 100k salary. \nMale 32.\n\nGrowing up, everyone dreamed of hitting 100k salary. Obviously with today’s inflation, it’s much different than it was. However, I set a goal a couple years ago to hit 100k salary by 35, just hit it at 32. \n\nMajor moment for me. I’ve worked hard for this. Just had to talk out loud for a second. \n\nEdit: Occupation: Healthcare Fraud Investigator (catch doctors committing fraud) (remote job with some travel to audit dr’s)",
    "subreddit": "Money",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 5412,
    "downs": 0,
    "created_utc": 1726269978.0,
    "media": null,
    "is_video": false,
    "num_comments": 589,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal milestone post about hitting a $100k salary; no list or guidance.",
    "composite_score": 5.846364032912134
  },
  {
    "score": 5304,
    "title": "Is a million dollars not a lot of money in this age?",
    "selftext": "I just recently had this conversation with my girlfriend who thinks and says that a million dollars is not a lot of money now. \n\nBut I disagree with her because I think a million dollars is life changing money for some people including myself. Now I told her that yeah if you live within your means with a million dollars then it could definitely be a lot of money for someone. Don’t go out and try to buy a mansion, Lamborghinis or Ferraris or even a 100 foot yacht. I live in Texas where it seems like the money could go longer than in other parts of the country. \n\nBut I guess I ask if other people think a million dollars is a lot of money? Or maybe now considering inflation and the rising cost of everything maybe it’s not a lot of money now?",
    "subreddit": "Money",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 5304,
    "downs": 0,
    "created_utc": 1712849315.0,
    "media": null,
    "is_video": false,
    "num_comments": 5115,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Opinion/discussion on whether a million dollars is still life-changing money, with inflation context.",
    "composite_score": 6.224150656140667
  },
  {
    "score": 5003,
    "title": "Would you define this as a “middle class mindset”?",
    "selftext": "What are the lower and upper incomes that you see as middle class? \n\n\nAre there any barometers besides income that define someone as middle class?\n\n\nI feel like since there aren’t any clear cut definitions, lots of people who make great money still define themselves as middle class. Just yesterday I was talking to a physician making &gt;250k a year who said that he is middle class, what do you think?  ",
    "subreddit": "Money",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 5003,
    "downs": 0,
    "created_utc": 1713555244.0,
    "media": null,
    "is_video": false,
    "num_comments": 1334,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks how to define middle-class income; lacks steps or a model.",
    "composite_score": 5.944557933871679
  },
  {
    "score": 4955,
    "title": "Working towards a goal actually does pay off. Hang in there. ",
    "selftext": "33m\n\nWhen I first moved to my current city in 2019, I was making $40,000 a year and spending 86% of my take home pay on rent. I took the job because it was in a field I was passionate about, and I knew had growth potential. \n\nIn 2022, I got a new job for $109,000. Those first 3 years were extremely difficult and degrading. I felt tired all the time and didn’t feel valued. After the massive pay increase, I could afford to breathe a little and move into a nicer place and enjoy my hobbies again. \n\nI just accepted a new position starting April 1 for $170,000. This is a mind boggling number to me. I’m not sure how I will adjust to this change in life style, but for the first time I feel like I might be able to afford a house/family. \n\nI know this isn’t an easy path, and I am lucky to have found these opportunities. I see a lot of doom on this sub of people thinking things can never improve, but they can. Make a plan and stick with it. \n\n",
    "subreddit": "Money",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 4955,
    "downs": 0,
    "created_utc": 1710352692.0,
    "media": null,
    "is_video": false,
    "num_comments": 693,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Motivational narrative about salary growth and planning.",
    "composite_score": 5.805811032931453
  },
  {
    "score": 4376,
    "title": "Update: I just broke $200K at 33 years old!",
    "selftext": "It’s been 125 days since my $100K post (I’m not allowed to share it here, it’s in my history). No, this wasn’t through any crazy investments in stocks or crypto that went gangbusters, this was largely driven by income and then some returns (roughly $8K) from my brokerage. No real estate or non liquid assets. I’m in a really fortunate position where I make a substantial steady income from my day job and then don’t have significant expenses because I don’t own a house or have kids. Again, I feel so fortunate because just 14 months ago, I had almost nothing to my name since I had just paid off $180K in student loans. Going to continue the grind!",
    "subreddit": "Money",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 4376,
    "downs": 0,
    "created_utc": 1760636769.0,
    "media": null,
    "is_video": false,
    "num_comments": 229,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Update on reaching $200k income; personal milestone.",
    "composite_score": 5.5570404646219105
  },
  {
    "score": 4278,
    "title": "27m - Lost my job early Dec.",
    "selftext": "Was loaned rent by a family member, have a little girl and another on the way. Was let go early December. Unemployment still hasn’t reviewed my case, although I’ve been to the office and called a few times.\n\nOnly thing getting us by is my partner’s part time grocery job, I’ve been the breadwinner for our relationship. \n\nBanking on an interview that went amazing with a municipality working in water. Would be $90k/year. In the background check stage, then references.\n\nRight now I hate myself and life feels impossible. Seeing everyone do well makes me feel like a failure. Credit limit is $500. I feel like a failure of a father, though I’m not looking for validation through you all, or anything of the sort, I just can’t stop feeling anxious.",
    "subreddit": "Money",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 4278,
    "downs": 0,
    "created_utc": 1705375787.0,
    "media": null,
    "is_video": false,
    "num_comments": 255,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Emotional vent about unemployment and self-worth.",
    "composite_score": 5.562962269139858
  },
  {
    "score": 4057,
    "title": "Dating someone who makes half as much money as you",
    "selftext": "I'm (27m) living with my girlfriend (27f) of several years and am thinking about marrying her.  I make double what she makes in a year.  We don't pay for any expenses the other has (car notes, gym memberships, student loans, etc), and on shared bills we split it 2/3rds, me and 1/3rd, her.  I find it difficult navigating shared financial situations with her because I don't want to contribute more than my 2/3rds, and sometimes she doesn't have the money to put towards it.\n\nAnyone else in my situation, and how do you navigate your relationship finances?\n\nEdit: Holy Comments!  I'm slowly reading through all of these and I appreciate all the feed back, but what seems to be the consensus is that I am looking at marriage and the relationship in the wrong way.  I'm definitely going to have a conversation with my GF about this so that we smooth out any potential financial headaches or concerns before going to the next steps in our relationship.\n\n  \nEdit 2: First of all, thanks everyone for commenting/voting on this post, didn't think my simple post would blow up like it did. Second, I've read a lot of the comments, I have a new perspective about talking with her about financial stuff.  I'm going to talk with her tonight about the idea of combining our finances and what she feels comfortable doing and start treating our finances as more of a collective than 2 individuals, and we will see what she wants to do.  I'll answer a couple of questions I've seen in the comments, for better or for worse!\n\nHow much do we make? I make gross approximately +or- 100k depending on bonuses, she makes 40k. I understand that's not 2/3rds, 1/3rd I took some liberties for brevity rather than giving the exact %.  I've got the exact amounts worked out to the dollar, and we both agreed on the amounts.\n\nWhat do we do for work/how long do we work a week? We both work in construction, she works 40 hrs, where I work 50-60hrs a week, I'm a civil engineer and she is a office admin.  \n\nAre there plans for kids now/in the future? We do not have kids, but are in discussions about having them in the future. With her being the one for not wanting to stop working to take care of the kids full time.\n\nWhat things do I pay for/she pay for? Our split, is the combined household bills; Rent, Utilities, &amp; Groceries.  I pay for all my own bills/fun stuff, plus almost all of the combined stuff like going out to eat, drinks, small event things (parking, ubers, fares, etcs) She pays for her own car bill, insurance, medical stuff, and her hobbies/fun activities.  If a shared activity that is a large expense then we pay for our own portion of it (airplane tickets, concert tickets, etc.)  If its \"my activity\" (example: A band I like but she only kinda likes) then I pay half of her portion as well as my own. If its \"her activity\" then I just pay for my portion.  To me this wasn't weird, it just felt \"fair\" but I probably will be reconsidering this in the future.\n\n",
    "subreddit": "Money",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 4057,
    "downs": 0,
    "created_utc": 1713791617.0,
    "media": null,
    "is_video": false,
    "num_comments": 3846,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal finance relationship issue; seeks perspective, no steps.",
    "composite_score": 5.985873135850735
  },
  {
    "score": 3653,
    "title": "Biggest dilemma of my life thus far",
    "selftext": "I’m in what could be called the biggest dilemma of my life thus far (30F). I’ve had a beautiful life filled with so much adventure and rare opportunities and I’m so incredibly thankful for that. One thing I feel eludes me as a person has been creating the financial stability I deeply need to be able to support myself and get out of feel like I’m a character in Mario jumping brick to brick when it comes to money despite being hardworking and unwavering about trying to build a career. Within the past 5 years I have built a tiny home out of a 30ft school bus in Hawaii. My intention was to have a space to live as rent out here can be astronomical, and my deeper intent was to motivate myself to learn how to tattoo and have this be my own personal studio one day. I just finished a year long apprenticeship, I also live in an apartment now and am at this huge crossroads of fallowing my head or my heart. I have the opportunity to sell my bus and make around 30k back. That would be enough to pay off my debts, have some savings and also invest in other financial persuits. Or I could go with my heart, find a way to finish the last of my build and invest in the equipment I need to have this a fully functional studio and do something no one has done on island before. I have been going over these options for years and have thought of everything in between. Would love to hear everyone’s view point as I’m dead set in the middle of what to do.",
    "subreddit": "Money",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 3653,
    "downs": 0,
    "created_utc": 1713215580.0,
    "media": null,
    "is_video": false,
    "num_comments": 615,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Dilemma about whether to sell bus or finish studio; asking for viewpoint.",
    "composite_score": 5.685058899098732
  },
  {
    "score": 3638,
    "title": "100k in my 401k!!! (27M)",
    "selftext": "Hi everyone, I was reviewing my account today and saw that about a few days ago I reached 100k in my 401k! Last time I check was about 6 months ago so this was a nice surprise :) I still have about 9k of debt to clear up (cc and loan) so I will be much happier when that is gone in a few months but this is amazing. I found it very hard when I would reach that milestone but I didn't think I could do it before age 30. I hope to double my retirement at a much quicker rate now but I am happy as I never had that much money for retirement. My other investments are my Roth IRA (sitting at 43k) and my HSA (at ~12k) so I feel relieved that I am in a better position than I was 5 years ago. So, if anyone feels like they will never reach that goal of hitting 100k for retirement while paying down debt I can attest that it is possible! ",
    "subreddit": "Money",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 3638,
    "downs": 0,
    "created_utc": 1724340668.0,
    "media": null,
    "is_video": false,
    "num_comments": 279,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Milestone reached in retirement accounts; inspirational.",
    "composite_score": 5.512061071257345
  },
  {
    "score": 3550,
    "title": "We have a slight spending problem",
    "selftext": "The income is set to just meet the expenses via distributions and selling off some funds, etc.  Almost forgot to what extent we pushed our limits until I found this screenshot in history/chat in Aug 2024, now we’ve reduced it to a healthier number just under 300k (BofA has a rolling 12mo cash flow counter).\n\nI keep trying to tell my wife a 400k annual spend is untenable and pretty insane.  She keeps saying it wasn’t just for her.  I wear old ass clothes and can just play video games to be happy so I know it’s rarely my spend. \n\nIn that rolling 12 mo period we had 3 overseas vacations and renovated our pool and backyard. \n\nI make an engineers salary of ~160k, my wife made ~110k last year as she took off to deal with one of our kids health problems.  The only thing keeping us afloat has been past investments.",
    "subreddit": "Money",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 3550,
    "downs": 0,
    "created_utc": 1749341244.0,
    "media": null,
    "is_video": false,
    "num_comments": 1315,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Reflection on spending and budget with personal details; no steps.",
    "composite_score": 5.799978616940584
  },
  {
    "score": 3507,
    "title": "I just broke $100K at 33 years old!",
    "selftext": "I’m 33M and feel way behind in the savings race compared to all the crazy high numbers (people breaking $1M way younger than I am). But I just had to share this milestone here since I felt proud of it. 10 months ago ago I had just paid off $180K in student loans without anything in retirement or assets and have been able to amass these savings since then. Still no house or anything material but I feel a lot better off financially than I was just a couple years ago. I am also fortunate to have a good salary so I’ll hopefully be able to break that $1M soon if it keeps up.",
    "subreddit": "Money",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 3507,
    "downs": 0,
    "created_utc": 1749829340.0,
    "media": null,
    "is_video": false,
    "num_comments": 332,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal milestone update without a clear actionable framework or explanation.",
    "composite_score": 5.541281701447163
  },
  {
    "score": 3483,
    "title": "Single dad hitting $100k net worth feels surreal. Started at -$32k in 2020.",
    "selftext": "https://preview.redd.it/gz093gtjhmee1.png?width=1170&amp;format=png&amp;auto=webp&amp;s=60e06f0ed6536213d4936307c444e0fcc991f3b5\n\nHard to believe I'm writing this. 4 years ago I was drowning in debt, raising my 6-year-old daughter alone, and barely making $45k. Today:\n\n* 401k: $58,341.23\n* Emergency Fund: $26,784.52\n* Daughter's 529: $12,453.89\n* Investments: $2,892.31\n* Total: $100,471.95\n\nNothing crazy compared to most posts here, but for a single dad making $65k in retail management, this feels huge. The journey:\n\n2020: Rock bottom after divorce. -$32k net worth (credit cards and car loan), living in a 1-bedroom apartment with my daughter sleeping in the bedroom while I took the couch.\n\nWhat worked:\n\n* Every tax return and stimulus check went to debt\n* Promoted twice (45k → 55k → 65k)\n* Found remote work = no more daycare costs\n* Meal prep Sundays with daughter (she loves \"helping\")\n* Automated savings the day paychecks hit\n* Daughter's mom started helping with expenses\n\nNot posting this to brag - honestly still paycheck to paycheck some months. But man, seeing that number hit six figures while my daughter sleeps soundly in her own room... worth every budget dinner and missed night out.\n\nNext goal: Building her college fund and maybe a house down payment. One step at a time.\n\n",
    "subreddit": "Money",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 3483,
    "downs": 0,
    "created_utc": 1737585423.0,
    "media": null,
    "is_video": false,
    "num_comments": 423,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Provides a sequence of concrete actions that contributed to reaching a $100k net worth, i.e., a reproducible playbook.",
    "composite_score": 5.598261074631991
  },
  {
    "score": 3301,
    "title": "What they say about the first $100k is so true",
    "selftext": "I recently crossed the 100k mark in investments and can finally see what the personal finance gurus have been telling me for years, happen in real time.\n\nMy portfolio gains in the market today were much larger than the weekly auto-investment amount that I have been doing for a year. So cool to see.\n\nThis post isn’t supposed to sound like I’m bragging by the way… I don’t have anyone else in real life to share this with so I’m doing it anonymously online. And hopefully this inspires other people to get to that 100k mark so they can see for themselves what I’m talking about.\n\nCheers! 🥂",
    "subreddit": "Money",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 3301,
    "downs": 0,
    "created_utc": 1715823819.0,
    "media": null,
    "is_video": false,
    "num_comments": 822,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Gives an insight about hitting $100k in investments and what it demonstrates, with reasoning rather than a list of steps.",
    "composite_score": 5.6814769865329104
  }
]