[
  {
    "score": 10214,
    "title": "If you're in the market for a home please IGNORE your realtor and LOWBALL whatever price you want.",
    "selftext": "We bought our first home a few months ago and I've never had much stake in real estate agents. One can browse all the listings on the internet this isn't 1950 anymore.\n\nUnfortunately you do need an agent to be taken seriously by most sellers so we got one to check that box.\n\nWe found a nice home listed for 660K. Our realtor suggested we offer 635K to be \"respectful\". We ignored and lowballed in at 595K. We knew this property was sitting for months so there was leverage.\n\nThey came back at 635K (I guarantee the buying and selling agent discussed this). But no - this isn't what we wanted. Came back at 610K final offer. There are other homes available, no home is so special that it's worth overpaying for.\n\nSure enough. Seller was desperate enough and sold for 610K. 50K under asking. And we kept our conditions too.\n\nSo please do not be afraid to lowball. Worst they can say is no.",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 10214,
    "downs": 0,
    "created_utc": 1754055046.0,
    "media": null,
    "is_video": false,
    "num_comments": 1071,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.236835763646843
  },
  {
    "score": 7037,
    "title": "Scammers ARE getting good - here's how",
    "selftext": "I got a call from a number that is exactly the same as the one on the back of my credit card. \n\nThe person knew my name and address, and asked me if I made \"x y z\" transactions to purchase electronics, stating that these appear to be suspicious transactions. \n\nI didn't make any of those transactions so I told them as such. They said thanks for confirming and let me know they'll be blocking the transactions and the card, and sending me a new one. \n\nThen they tried to confirm some card details, and I got suspicious. So I hung up. Called the exact same number, which is on the back of my card, and my actual bank confirmed there were no such transactions and the call I received was not from them. \n\nSo I blocked my card anyway. \n\nI'm very good at spotting suspicious phishing and scamming attempts but this one nearly got me. \n\nIf you receive a call, even if the number is exactly the same as the one on your card, always hang up and call the number back yourself to verify if your bank is indeed trying to reach you",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 7037,
    "downs": 0,
    "created_utc": 1678844370.0,
    "media": null,
    "is_video": false,
    "num_comments": 541,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.941948905768366
  },
  {
    "score": 4888,
    "title": "Are people really that clueless about the reality of the lower class?",
    "selftext": "I keep seeing posts about what to do with such and such money because for whatever reason they came into some. \n\nThe comments on the post though are what get me:\nWhat is your family income?\nHow do you even survive on 75k a year with kids\nYou must be eating drywall to afford anything \n\nIt goes on and on..... But the reality is that the lower class have no choice but to trudge forward, sometimes sacrificing bills to keep a roof over their head, or food in their kids stomachs. There is no \"woe is me I am going to curl up into a ball and cry\" you just do what needs to be done. You don't have time for self-pity, others depend on you to keep it level headed. \n\nI just see so many comments about how you cannot survive at all with less than $40k a year etc... Trust me there are people who survive with a whole hell of a lot less. \n\nI'm not blaming anyone but I'm trying to educate those who are well off or at least better off that the financially poor are not purposefully screwing over bills to smoke crack, we just have to decide some months what is more important, rent, food, or a phone bill, and yes as trivial as some bills may be, there has to be decisions on even the smallest bills. \n\nOne example I saw recently, a family making $150k a year were asking for advice because they were struggling, now everyones situation is different obviously, but I found it interesting that some of their costs were similar to a person's post making $40k a year and he was managing, yet I keep thinking that if you told the family making $150k to survive on $40k they probably would explode.\n\nJust my .2 cents. Sorry for the rant.\n\nEdit: Located in Ontario",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 4888,
    "downs": 0,
    "created_utc": 1689428168.0,
    "media": null,
    "is_video": false,
    "num_comments": 1090,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.8906324125580065
  },
  {
    "score": 3830,
    "title": "What is it gonna take to get cellphone companies to understand: we don't want more data - we want cheaper plans.",
    "selftext": "Holy shit I work from home, i.e. I probbly haven't used more than 3 or maybe 4 Gigs of data in over 3 years. Where are the 20$ for 10GB plans? Nowhere! Instead I'm paying 57.49 dollars a month for over 6 times the data I'm gonna use. What a waste! That shit adds up. How can we demand cheaper overall plans? They're gonna keep running up to what like 50gb, 60gb, 70gb like what could people even be doing on a phone to use that much fkn data? There's some real nonsense going on",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 3830,
    "downs": 0,
    "created_utc": 1686281078.0,
    "media": null,
    "is_video": false,
    "num_comments": 893,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.771480911381037
  },
  {
    "score": 3331,
    "title": "My bank account just had $40k randomly deposited into it - has this happened to anyone else?",
    "selftext": "For reference, I'm in Ontario.\n\nLast week I noticed a deposit from OLG into my bank account for $40k.  Since I did not win the lottery, I went into my bank to tell them about the problem.  They launched an investigation.\n\nThe next day they called me back, said they verified with OLG and the deposit was real.  I tried to again remind them that I would remember if I won the lottery but they just congratulated me and told me to enjoy.\n\nBUT I DIDN'T WIN THE LOTTERY LOL\n\nI moved the money into my savings account because I'm sure they are coming back for it.  Has this happened to anyone else?  How long do I sit on this money?  Not sure what else to do.",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 3331,
    "downs": 0,
    "created_utc": 1673451143.0,
    "media": null,
    "is_video": false,
    "num_comments": 1001,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.7356388535003635
  },
  {
    "score": 2934,
    "title": "Is this personal finance canada, or is this afluent finance Canada?",
    "selftext": "I've come across posts on here that talk about everyday situations, like one about buying boots. It got a fair number of upvotes, and people were really into giving their two cents about how good quality boots are absolutely worth it in the long run and which ones have worked best for them.\n\nI used to buy cheap boots, but that post convinced me to spend the extra money on a good pair, and it truly was a game changer. But the post was soon removed, apparently because it wasn’t considered relevant. I’ve seen this happen multiple times, posts about better ways to spend money or everyday financial problems get removed by the mods, even though they get upvotes and spark meaningful discussion.\n\nAt the same time, I see posts that say things like \"I just inherited half a million dollars\" \"Should I buy a third car?\" or \"What should I do with my $40K of disposable income a year?\" and those posts stay up forever.",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2934,
    "downs": 0,
    "created_utc": 1750737141.0,
    "media": null,
    "is_video": false,
    "num_comments": 346,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.45027284297907
  },
  {
    "score": 2741,
    "title": "I just paid off my 80K student loan! ",
    "selftext": "I started university at age 18. Did not have financial help from my parents. 8 years of university, 4 degrees (my masters degree was paid for in cash while I was working). Payments between 800-1100 a month.  It took me 8 years 5 months. My career is in the field I chose over 15 years ago. I honestly didn’t know if I could do this when I started but I gutted it out and I’m so proud of myself. I’M FREE!! ",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 2741,
    "downs": 0,
    "created_utc": 1712253251.0,
    "media": null,
    "is_video": false,
    "num_comments": 205,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.31500106063807
  },
  {
    "score": 2649,
    "title": "People in Canada do not make as much money as you think.",
    "selftext": "[Here is some data from statscan to prove it.](https://www12.statcan.gc.ca/census-recensement/2021/dp-pd/dv-vd/income-revenu/index-en.html)\n\nIf you are broke, you might be just like everyone else. Most people are not making close to 6 figures at any age. Earnings increase as you age and then decrease as you become a senior. \n\nIf you hear about successful people all the time, that is probably survivorship bias. Broke people stay quiet about their finances. \n\nJust a reminder, good luck eh!",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2649,
    "downs": 0,
    "created_utc": 1675392775.0,
    "media": null,
    "is_video": false,
    "num_comments": 1243,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.683156064114208
  },
  {
    "score": 2523,
    "title": "Invested 10k in TFSA 2022. Now worth 650k",
    "selftext": "Throwaway account for obvious reasons \n\nIn 2022 I put 10k USD in a single stock, and since then,  the stock has approx returned 6000% in total gains worth around 650k USD today. (Just under 900k CAD)\n\nI don’t really come from money, I make 80k a year. So I am not sure if I sell or keep holding. \n\nI would like to eventually buy a 1 bedroom condo this year, so is it wise to sell and withdraw the funds? Will I lose all my TFSA room? \n\n\n- Edit #1: People keep asking me what I bought and the stock was CVNA. \n\n- Edit #2: Decided to put a sell order tomorrow morning and buy 80% VTI and use 20% for a condo.\n\n\nAppreciate everyone’s help \n",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 2523,
    "downs": 0,
    "created_utc": 1748387254.0,
    "media": null,
    "is_video": false,
    "num_comments": 176,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.223575983753
  },
  {
    "score": 2444,
    "title": "Selling credit cards at a cashier line should be illegal",
    "selftext": "I just witnessed a Walmart employee trying to sell a Walmart credit card to what looked like a new immigrant and his family. The individual heard that they would receive 20% off their purchase and agreed to it. I truly don’t feel like the individual even knew that they were signing up for a credit card and clearly had a language barrier. This type of of sale should be illegal and should be done in a way that the individual knows what they are signing up for, including the interest rates. I just needed to vent because it blows my mind how much debt people are in and it sad that people who don’t know any better can be sucked in.",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 2444,
    "downs": 0,
    "created_utc": 1693522500.0,
    "media": null,
    "is_video": false,
    "num_comments": 451,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.43584808086533
  },
  {
    "score": 2439,
    "title": "Credit to CBC and Andrew Chang episodes for CBC News",
    "selftext": "They have been producing fact driven episodes on virtually every important topic that Canadians are thinking about on topics like; mortgages, housing, immigration, politics, and more and even people who do not follow the news and have no idea what is truly going on have appreciated the episodes that are covered on that platform, so I don't know if the producers at CBC and Andrew Chang will see this, but good job keep up the good work and quality episodes especially in an era of disinformation. \n\nRecent episode: https://www.youtube.com/watch?v=xoG0Eq6toNg",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2439,
    "downs": 0,
    "created_utc": 1741550696.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.130906495988119
  },
  {
    "score": 2429,
    "title": "The amount of car debt I've seen on here is astounding. Most of you are buying cars way out of your budget. Some helpful guidelines below:",
    "selftext": "I'm absolutely shocked at the prices and loans folks are taking out on cars here, and the justification as if this is normal.\n\nA good guideline is the 20/4/10 rule. 20% down. 4 year term MAX and no more than 10% of net income on payments.\n\nObviously if you have the cash to buy a car outright that's the best option. But even within these guidelines we see absolutely flagrent deviations from the suggestions.\n\nAlmost every post here is a 72+ month term. 500 to 600 dollar payments (I really doubt you're making 6K a month to meet the 10% rule) and we can only speculate on the down payments but 20% seems unlikely.\n\nThe reality is an \"average\" new car is not affordable for an \"average\" salary. I make over 100K a year and my cars have been a 2500 beat up minivan which I later sold and bought an 11K civic in all cash. I see people making HALF of what I do buying 35K+ cars.\n\nThe auto loan industry might be the single biggest wealth killer of the middle class.",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 2429,
    "downs": 0,
    "created_utc": 1766500463.0,
    "media": null,
    "is_video": false,
    "num_comments": 1803,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.658724540201273
  },
  {
    "score": 2288,
    "title": "Mom was just handed termination after 30+ years of working. Are these options fair?",
    "selftext": "My mom, 67yo Admin Assistant, was just handed a termination agreement working for 30+ years for her employer.\n\nHer options are:\n\n1. Resign on Feb 17th 2024, receive (25%) of the salary for the remainder of the working year notice period ( Feb 17, 2025).\n\n2. Resign on Feb 17th 2024, receive (33%) of the salary for the remainder of working notice period (Aug 17,2024).\n\n3. Resign Aug 17th 2024 and receive (50% of salary) for the remainder of the working period (Feb 17,2025).\n\n4. Resign Feb 17th 2025, and receive nothing.\n\nI'm going to seek a lawyer to go over this, but thought I'd check reddit first. These packages seem incredibly low considering she's been there for 30+ years.\n\nWhat do you think is a fair package she is entitled to?",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 2288,
    "downs": 0,
    "created_utc": 1676744809.0,
    "media": null,
    "is_video": false,
    "num_comments": 610,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.45016639779582
  },
  {
    "score": 2224,
    "title": "Report realtor to CRA?",
    "selftext": "Hi everyone! I purchased a house two years ago, during the height of Covid overbidding and all of that fun stuff. The seller both owned the house and represented themselves as the realtor as well. At the time, they told me that they had gotten a job in another city and simply couldn’t do the commute, hence the sale. Fine, none of my business really…I had always suspected it was a flip, but we loved the house and area.\n\nFast forward to this week, a video popped up on my TikTok feed of said realtor talking about how they had made over 200k on their first flip, and low and behold - it was our house! Learned some interesting details from the vid (way way overpaid for trades), but in the comments, a user had asked them about how they avoided paying capital gains on the sale. They fully admitted to putting the house as their primary residence “on paper only”. The length of time between when they purchased and sold was only really 4 months.\n\nIs it worth reporting her to the CRA as having potentially skirted paying capital gains tax? It seemed like they went on to do a bunch of flips after this one too, and had made millions in turn. Im worried about anonymity if reporting.\n\nEDIT: I went ahead and reported the Realtor to the CRA. Let them handle it and do whatever they do. For those of you saying I’m only doing this because I overpaid - I completely accept the overpayment, it was what it was! I have an issue with scumbag Realtors who skirt the rules and frankly make the housing situation for everyone way worse while expecting a hefty commission.",
    "subreddit": "PersonalFinanceCanada",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2224,
    "downs": 0,
    "created_utc": 1691502108.0,
    "media": null,
    "is_video": false,
    "num_comments": 566,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.436621544763403
  }
]