[
  {
    "score": 843,
    "title": "I did it. 73K of consumer debt gone..",
    "selftext": "I just wanted to share that although the last five years have been incredibly difficult, I’ve finally managed to pay off all my debt.. $73k gone. I feel like I’ve been released from its shackles.\n\nThis isn’t something I can really share with people in my life, so I’m giving myself permission to post it here in the hope that it might inspire someone else. Wherever you are on your journey, I want you to know that the hard work, exhaustion, and grind are worth it in the end.\n\nI also want to acknowledge that the advice I received on forums like this was invaluable in helping me make progress. Thank you ☺️",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 843,
    "downs": 0,
    "created_utc": 1764211309.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.643537449948111
  },
  {
    "score": 744,
    "title": "Chat GPT is saving me so much money/stress/time when it comes to food",
    "selftext": "I'm not sure if this will help anyone but sharing it just in case. I have a few things working against me when it comes to food; a tiring job, a lack of knowledge around cooking, being neurodiverse, and having some intolerances that limit my options. I go one of three ways: eat rubbish food that makes me feel yuck, skip meals because the planning and shopping feels too hard, or spend all my money on takeaways and uber eats (it's usually number 3, tbh).\n\nI have been using Chat GPT the last few weeks to plan my meals and oh my gosh, it's been life-changing for me. I ask for healthy, filling, cheap meals that fit my dietary criteria. If I don't like what it gives me, I ask for more. I end up with a full weeks worth of meals in 20 seconds or less. It even gives me a shopping list, so when I go into the store, I don't buy anything I don't need. \n\nI feel like a concrete block has been taken out of this part of my brain. It has relieved so much stress from me, which also means that I am no longer running to the dairy to buy \"stress chocolate\" every day as well. \n\nA couple of hints I've found that have helped: ask for recipes that exclude foods that aren't in season here (I.e., if you keep noticing it's giving you recipes with cucumber, ask for recommendations without). If you ask for a \"meal plan\" , then it will give you 7 days worth of different recipes which is expensive so I search for 1 meal at a time and make it in bulk. \n\nI don't know if anyone else struggles with this sort of stuff, but if you do, I highly recommend trying this!",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 744,
    "downs": 0,
    "created_utc": 1685388437.0,
    "media": null,
    "is_video": false,
    "num_comments": 132,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.661582093231836
  },
  {
    "score": 724,
    "title": "Hit a big milestone of mine today, 50k!",
    "selftext": "I am 20 and am my second year of study, so haven't been able to put as much in over the past couple years. Taking a gap year and investing as much as I could back then has certainly paid off for me, feeling very happy with myself especially with how hands off I am with it. What do I do in the future? Is it worth buying a property if I have this much in investments after I finish my degree or do I just let it sit and grow?",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 724,
    "downs": 0,
    "created_utc": 1751869308.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.480764012392066
  },
  {
    "score": 653,
    "title": "Nailed it",
    "selftext": "Please forgive me this tiny brag. I know lots of folks are doing it tough right now so I don't want to do it IRL, and this seemed like a safe place to cheer.\n\nI just bought and moved into my first home. I've had housing fears/anxiety for ages, so this is a mindblowing life moment for me. It's warm, safe, well built (1950s) and been cared for. Needs almost no work. It's better than I had ever hoped for in Aucklands markets.\n\nI'd almost bought at the top of the market. Just barely had a deposit when prices shot up by 200k. Then the stock market took a tumble and my sis and I decided to put large chunks of our income into the market to wait for the recovery, with the hope the sudden housing bubble would pop a bit with the expected post-pandemic recession. And boy did it work.\n\nGot the unit for 28% (edited) lower than the neighbour bought for at the peak, and our deposit had ballooned to 40% equity. Mortgage to live alone is about 40$ more a week than I'd been paying in a flatshare for a decade. I have a lot of coworkers and friends who have similar sized places and have twice the mortgage payment.\n\nTiming and luck and 15 years of roommates and savings have paid off.\n\nI just feel so grateful and happy. ",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 653,
    "downs": 0,
    "created_utc": 1760732382.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.447153373516089
  },
  {
    "score": 611,
    "title": "How I eat 3 meals 7 days a week for $20 or less per week (semi-balanced diet)",
    "selftext": "I noticed a lot of people on here have mentioned skipping meals due to budget being tight in this economy. I know, and so I wanted to share my budget backup shopping cart that lets me eat a full 3 meals a day, 7 days a week (1 person) in case it helps anyone.\n\nEach Week Buy:\n\n* 1kg Brown Rice (if you can buy upfront in bulk 10kg bags, that will save you even more money)\n* 400g Tin of Diced Tomatoes in any chosen flavor\n* 1kg Pams Peanut Butter (pick smooth or crunchy, whatever you like)\n* 1kg Pams Mixed Vegetables (peas/carrots/beans/corn)\n* 2x Pams Standard UHT 1L Milk (cheapest source of milk if you can't pay upfront for milk powder)\n* 425g Mackeral In Oil (or tomato sauce) - cheapest Omega 3 source\n\nYour Choice - Now pick 2 out of these 5 options:\n\n1. 500g of Pams Spaghetti Pasta\n2. 750g Pams Rolled Oats\n3. 1kg White Rice or Brown Rice\n4. 1x Brown Pams Bread Loaf\n5. 1x Pack of Sunvalley Brown Lentils (you can cook them in the same pot as rice)\n\nIn total, this costs $19.50-$21 depending on your choices.\n\nYou can of course combine this with any kitchen staples you already have (salt, curry powder, stock cubes, soy sauce etc).\n\nThis combination can also create many meals:\n\n* Satay Stir Fry w/ Mixed Veggies (and lentils if you picked them)\n* Tomato Stir Fry w/ Mixed Veggies and Fish\n* Tomato Pasta With Peas/Mixed Veggies/Lentils\n* Rice Pudding w/ Milk\n* Oatmeal w/ Peanut Butter\n* Peanut butter toast\n* Protein Smoothie (Milk, Peanut Butter, Oats)\n* Bonus: if you already have curry powder or curry paste, you could make a curry with milk/tomatoes. You can also mix in peanut butter to the curry to make it creamier and add in protein.\n* Bonus: if you have soy sauce you can make a Donburi rice bowl with Fish\n* Bonus: if you have Mexican seasoning you can make a Mexican Rice Bowl with either Lentils or Fish\n* Bonus: if you have some stock powder/cubes you could make a soup.\n* Bonus: if you have icing sugar you can combine it with peanut butter for a no-bake fudge\n\nIt is not fully balanced but it's close. Depending on which 2 choices you made, here is the nutritional breakdown per day:\n\n* CALORIES: 2300-2750 Calories per day (Note: Oats + Rice has the most calories)\n* PROTEIN: 95g-109g per day - most people need 0.8-1.2g per 1kg of body weight. So if you weigh 75kg you need 60-90g protein per day (Note: Oats + Lentils has the most protein)\n* FIBER: 39g-59g Per Day (women need 25g+, men need 31g+)\n* On average 2-3 servings of vegetables per day (Note: Lentils can count as 1 veggie per day)\n* Meeting Omega-3 requirements (that is the point of the mackerel - not to provide protein, but to provide crucial omega-3). If you hate mackerel you could see if you can add $3 to the fish budget to either get 2x 105g sardines or 1x 210g pink pams salmon to get the Omega-3 requirements.\n\nThe protein confuses most people. Where is it coming from? The biggest source is actually the peanut butter. The jar has 305g of protein so that is on average 43.5g per day. Probably the cheapest protein you'll ever eat. And it has lots of essential nutrients and fiber too!\n\nCalcium is low at 580mg per day (the mackerel has some in it's soft bones). To hit 1,000mg you can spend another $3.60 to buy an additional 2l of Milk which will also add 180 calories and 10g of protein per day.\n\nVitamin C requirements are met (no scurvy!) but only just (it comes from tomatoes and carrots). To get fresh vitamin c for free, check your local council for free public fruit tree maps for foraging in your city/town. Urban Foraging NZ is also a community group that tracks free public fruit trees you can forage and pick from.\n\nEDIT: I edited this list for clarity and added more food/meal options.\n\nEDIT 2: Added in lentils as an option. More expensive but they add 1 serving of veggies per day on average and can be cooked with rice.\n\nEDIT 3: A lot of people are a bit confused - what do you do with 1kg of peanut butter? Well, it's not just for peanut butter on toast. If you combine it with water, you can make a satay sauce to eat with rice. Eat it with oats to make them creamy: you could even add sugar to make it sweet. You can also mix it with milk and some curry powder if you have it to make it into a peanut curry. It's not just for toast. It is a budget food hack. It is a source of essential fats and omega-6 while also having protein &amp; fiber (unlike most other oils). Peanut Butter is like nutritional budget magic.\n\nEDIT 4: If you can stretch another $10 you can fix up leftover nutritional deficiencies:\n\n* Buy another 2L of milk to have 4L per week. This is $3.60.\n* 6 Eggs per week. You can buy 20 free range eggs at The Warehouse for $10. This works out to be 50 cents an egg ($3 for 6 eggs). They are a good source of Choline, an essential chemical our bodies needs. We do get some good Choline in the other food, but this should help round it out.\n* Spend $3 on leafy veggies. So a cabbage is often $3. Or a large cauliflower is sometimes $3. Or broccoli is sometimes on sale for $1-$1.50 per head. So you might be able to get 2-3 broccoli heads for $3.\n* Any extra money can then be spend on 600g seasonal fruit that is $3-4kg - but again, if you forage, you can often get this for free so I think of it as the lowest priority on the list.\n\nNOTE: If you add these in, you might not need to buy 1kg of Peanut Butter if you have lower calorie requirements (for example women on average need less, as in 1600-2400 per day). Check your calorie needs. You can save $2 by buying a 375g Peanut Butter Jar instead if you don't need the full 1kg with this supplemental food.\n\nSo let's say you have $40 to spend per week on food. You could spend $20 on the main food, and buy the supplemental food for $10, and still have money left over for treats like a block of chocolate and even buy an extra kitchen staple each week.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 611,
    "downs": 0,
    "created_utc": 1744236895.0,
    "media": null,
    "is_video": false,
    "num_comments": 136,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.590111705723765
  },
  {
    "score": 573,
    "title": "Update to the streamer asking for advice",
    "selftext": "Thanks to everyone who told me to stop being a cheap bastard and get an accountant for my $10k/month streaming earnings lol. Took your advice and it's looking like it's been a game changer.\n\n\n**What I did:**\n\n\nMet with 3 different accountants (shoutout to whoever recommended The Advisory Group - went with them). They sorted me out with sole trader setup since no company needed yet, separate \"tax jail\" account with 30% going straight in, GST registration sorted after I hit that 60k threshold real quick, and expense tracking system that doesn't make me want to cry.\n\n\n**The money stuff:**\n\n\nTurns out I can claim way more than I thought like internet, power, even part of rent since I stream from home. My RGB setup is apparently a \"business expense\" lmao. Withholding tax from overseas platforms gets credited back too. No provisional tax this year but will hit next year.\n\n\n**Best part:** Accountant only charges like $200/month to handle everything. Absolute steal compared to the stress I was having.\n\n\nStill doing well on Twitch/Kick, parents finally believe this isn't just \"playing games for pocket money\", and I can sleep without having tax nightmares.\n\n\nYou beautiful bastards saved my ass. 10/10 would ask reddit for financial advice again 😂\n\n\nP.S. - For anyone asking about the streams, not doxxing myself but streaming gaming/art stuff if you're curious",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 573,
    "downs": 0,
    "created_utc": 1749792707.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.133288692874388
  },
  {
    "score": 552,
    "title": "Diagnosed with Stage 4 Cancer, but WINZ Punishes Savers and Rewards Debt – NZ's System Feels Broken",
    "selftext": "I'm currently dealing with stage 4 cancer, and it's turned my life upside down. Naturally, I assumed that in New Zealand, there'd be decent support available if you face serious illness and cannot continue working full-time. But after visiting WINZ, the reality was a slap in the face.\n\nBecause my wife works over 30 hours a week, and we have savings above the $16k threshold, WINZ essentially told me I'm entitled to nothing substantial. Meanwhile, someone with debts (car loans, credit cards, etc.) or little to no savings would get full support immediately.\n\nWe have three children, and our savings are carefully set aside for their future, education, and ongoing support. It feels absurd and genuinely unfair: my wife and I have worked hard, avoided debt, saved responsibly, and paid taxes diligently for years. But now, in a moment of genuine need, the system offers next to no help simply because we've been financially responsible.\n\nOn top of that, consider ACC—where even minor injuries can qualify for 80% wage coverage. Yet here I am, facing a serious, life-threatening illness, getting almost nothing and being forced to continue working.\n\nI'm genuinely frustrated. It seems the message is: \"Don't save, don't be responsible; go into debt instead, and we'll help you out.\" How is that fair?\n\nHas anyone else faced this issue? Is there any strategy or approach I'm missing here?\n\nWould love to hear others' experiences or advice.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 552,
    "downs": 0,
    "created_utc": 1753298995.0,
    "media": null,
    "is_video": false,
    "num_comments": 106,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.477417020147303
  },
  {
    "score": 507,
    "title": "I analysed the latest Stats NZ wealth data - the top 10% own half of everything, the bottom 50% share just 6.7%, and 9% of households control $408 billion in trusts",
    "selftext": "Hi everyone\n\nStats NZ released their [Household Economic Survey data](https://www.stats.govt.nz/information-releases/household-net-worth-statistics-year-ended-june-2024/) (collected June 2024, published late 2024, corrected in late September 2025), and I went through **all of it**. This data is released only every 3 years, so it's worth understanding, as it is the best insight we have into much of New Zealand's economy and social mobility.\n\nThere is a **lot** that stands out - some headline numbers include:\n\n* Total NZ household net worth: $2.067 trillion\n* Mean household net worth: $1,041,000 (yes, the \"average\" household is a millionaire, but that is skewed - the median household net worth is $529,000 (the actual typical household)\n* The 97% gap between mean and median is an inequality indicator\n\n**The inequality story (warning - fairly depressing reading):**\n\n* **The top 10% own 48.5% of all wealth** (\\~$1 trillion between \\~199,000 households)\n* The **bottom 50% share just 6.7%** between them (\\~993,000 households sharing $138 billion)\n* The bottom 20% have a **negative** average net worth of around $9,000\n* I calculated the Gini coefficient at 66.1 (where 100 = one person owns everything), which is high by international standards\n\n**Homeownership is a HUGE driver:**\n\n* **Own home outright:** $1.81m average net worth\n* **Renting:** $185,000 average net worth (10 X gap)\n* And, even with a mortgage, homeowners have 5X the wealth of renters, hence the desire to get on the property ladder\n\n**Family trusts (posting this as data, not to give opinions or debate them) stand at $408 billion:**\n\n* However, only 9% of households hold assets in trusts\n* But trust-holding households average **$2.41 million** in net worth\n* Most of the money ($274.6 billion) is in \"non-financial equity\" (likely property and farms), while $133.4 billion is in \"financial equity\" (investments, shares, cash)\n* **These trusts make up is 17% of all household wealth** held by 9% of households\n\n**The inheritance effect (new data for 2024, shoutout to StatsNZ for adding it to the survey!):**\n\n* 45% of households have received an inheritance or substantial gift\n* **Their median wealth:** $984,000 (nearly double the overall median)\n* 24% of households expect to receive $100,000+ in future, and they already have a median wealth of $855,000\n* The other 55% is likely building from scratch with no family wealth behind them\n\n**There are a lot of things that stand out, including:**\n\n* Auckland has the highest mean wealth ($1.117m) but the **lowest** median ($444,000) – indicating extreme inequality within the city\n* Wellington has the highest median ($658,000) – wealth is more evenly spread there\n* KiwiSaver is still just 5.7% of total wealth. Property is 48.5%. New Zealand has built wealth through houses, not retirement savings.\n\n**My take:**\n\nThis isn't a \"work harder\" problem. The data shows wealth in NZ is primarily determined by:\n\n1. Whether you own property\n2. Whether your family owned property (inheritance)\n3. When you bought (timing)\n\n\\&gt;&gt;&gt; Those three factors explain more than income, education, or career choice. The median tradesperson is wealthier than the median university graduate. The median mortgage-free homeowner has 10x the wealth of the median renter.\n\n  \nI'm not making policy recommendations; I'm just sharing what the data says. and am happy to answer questions or be corrected if I've misread something.\n\n**Notes:**\n\n1. If you want the full breakdown with all tables and methodology, I've published a [comprehensive guide](https://www.moneyhub.co.nz/household-wealth-statistics.html) (**WARNING:** This is a MoneyHub link – I work there, so ignore if you prefer – all core data above is verifiable via Stats NZ directly)\n2. All figures are from Stats NZ's Household Net Worth Statistics – Year ended June 2024\n\n**Source:**\n\n* [**Stats NZ Household Net Worth Statistics**](https://www.stats.govt.nz/information-releases/household-net-worth-statistics-year-ended-june-2024)",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 507,
    "downs": 0,
    "created_utc": 1767318576.0,
    "media": null,
    "is_video": false,
    "num_comments": 181,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.570899406276457
  },
  {
    "score": 450,
    "title": "WTF Kiwibank?",
    "selftext": "Im about to come off a fixed mortgage rate of 4.29 with Kiwibank. Looking at the advertised rate it's sitting at 7.25, I think to myself there's no way I'm paying that so I call up Kiwibank and ask what the 1 year rate is, old mate replies with 7.25. I'm not impressed so asked him to sharpen his pencil....on hold I go. After a few minutes old mate comes back and says there's no movement on the advertised rate.\n\nUnimpressed, I say I'm going to shop around and based on what I've seen, other banks are offering 6.89 so the wife and myself will be moving all our business to whoever gives us the best deal. The reply I got was \"well you gotta do what you gotta do.\"\n\nFilled out an online form for ANZ, 30 minutes later I get a call from a lovely woman that actually sounded like she loves her job (not like depressed old mate from Kiwibank), I ask for a rate so sharp I'll cut myself just by looking at it and straight off the bat I get 6.89 for 1 year and 3.5k cashback.\n\nFuck you Kiwibank. 10 years of loyalty and you pull this shit. Good luck retaining customers with that up your arse attitude.\n\nI've finished my rant. Any one out there getting better than 6.89?",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 450,
    "downs": 0,
    "created_utc": 1710244469.0,
    "media": null,
    "is_video": false,
    "num_comments": 210,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.506317769526807
  },
  {
    "score": 404,
    "title": "I tracked most house price predictions vs reality for the last 3 years - they've been wrong every single time, always in the same direction",
    "selftext": "Hi everyone\n\nWell, it's three days into 2026, and the usual promo/property hype has started up again on news sites and blog posts. While I can confirm, based on research I've almost finished, that **mortgage lending volume was up significantly last year**, this does not mean \"house price increases\".\n\n**This post is not a rant** \\- I am not saying don't buy a house, I'm saying many of the stories about \"house prices 2026\" are marketing. I have insights and data that I want to share, hence this post. \n\n1. I'm always suspicious of the \"heads you'll win, tails you'll win too\" language in property 'insights' and reports.\n2. Bank economists release house price forecasts that the media picks up as if they're independent research.\n3. This has prompted me to track these predictions against actual outcomes, [**inspired by the work of RNZ's Susan Edmunds**](https://www.rnz.co.nz/news/business/572843/why-were-house-price-forecasts-for-this-year-so-wrong), and the pattern is stark.\n4. Here's what was predicted within the industry vs what actually happened:\n\nhttps://preview.redd.it/7vwm2k9ka1bg1.png?width=1913&amp;format=png&amp;auto=webp&amp;s=b38e108fc3e4a6e6077e24d4eb092b0e5b2a04b9\n\nThat's three years of predictions, three years of being wrong, and always wrong in the same direction – too optimistic!\n\n**Know This:** You can adjust your Google settings and find a bunch of date-stamped stories and reports, they don't age well!\n\nhttps://preview.redd.it/xw7g67v9a1bg1.png?width=1663&amp;format=png&amp;auto=webp&amp;s=eceee38ff159ed73c9cf8c18b98b9adb359dbb8f\n\n**Why this matters:**\n\nWhen forecasters are consistently wrong in one direction, my view is that it's systematic bias. And such bias makes sense, even if I am cynical, when you understand the business model:\n\n* Mortgages are banks' largest lending product and primary profit driver\n* Higher house prices = larger mortgages = more interest income\n* Bullish predictions encourage buyers to **buy rather than wait**\n* Optimistic forecasts support existing borrowers' confidence\n\n**The actual state of the market:**\n\n* Housing inventory is at a [10-year high in many areas](https://newsroom.co.nz/2025/05/26/too-much-of-a-good-thing-looking-into-housing-supply/)\n* Net migration has [dropped significantly since the 2023 peak](https://www.rnz.co.nz/news/ldr/578546/new-zealand-s-population-growth-dips-by-tens-of-thousands)\n* House prices are down **15-20% nominally** from the 2021 peak (lots of data on this, does depend on the area however)\n* In **real (inflation-adjusted) terms**, prices are down approximately **31%** from peak as per an [/NZ reddit post a couple of weeks back](https://www.reddit.com/r/newzealand/comments/1pnwd9o/real_new_zealand_house_values_down_313_since_2021/)\n* New Zealanders are leaving for Australia in record numbers – every family that leaves is one fewer buyer and potentially one more seller\n\n**Regional breakdown (because I believe the \"national average\" is meaningless given how different things are around New Zealand):**\n\n* **Auckland:** Oversupplied with townhouses, many developments are sitting unsold for ages, although quality standalone homes are holding better, but townhouse pricing is suppressed.\n* **Wellington:** Down \\~20%+ from peak. Public sector job losses, high council rates, and earthquake insurance concerns and costs that go with it.\n* **Canterbury:** Relative bright spot – everyone is bullish on CHC - essentially flat vs 2021 peak, benefiting from internal migration as people leave Auckland.\n* **Regional towns:** Mixed – some properties have been unsold for 12+ months as vendors refuse to meet market conditions (Mangawhai to Manapouri, etc.)\n\n**The investment property reality:**\n\n* Rental yields are typically 3-4% gross (guides coming on this too)\n* Mortgage rates are higher than that (OCR cuts may have ended for a while too)\n* This means investors are paying out of pocket, hoping for capital gains\n* Those capital gains have been negative for four years in many areas\n* Meanwhile, rising rates, bills, insurance costs, maintenance, compliance requirements - so many stories about it. \n\n**My take:**\n\nThis isn't about being bearish or bullish. It's about being realistic:\n\n1. **Nobody knows where prices will go -** so much media hype - Stuff/NZME have TM Property and OneRoof respectively - so that's something\n2. **The conditions that fuelled the 2012-2021 boom no longer exist** – higher interest rates and townhouses are flooding the market\n3. **Property price forecasts should be treated as marketing, not analysis** – three years of going back into Google and seeing the predictions support this\n4. **Buying a home does not mean you're making a property investment** – if you're buying to live in for 10+ years, timing matters less than finding the right property at a sustainable price\n5. **If your purchase only works when prices rise, you're speculating, not buying a home**\n\n**My view:** The era of broad-based, rapid house price growth driven by falling interest rates and expanding leverage is likely over. The \"property always goes up\" narrative has been comprehensively disproven since 2021. Yet, the same voices continue making bullish predictions - \"2026 will be the year, get in now as it's great timing\" is literally what I'm reading around the internet.\n\n**TLDR** \\- I'm pointing out that the forecasts being published as news are coming from organisations with a direct commercial interest in you taking out a mortgage.\n\n**Notes:**\n\n1. If you want the full breakdown with regional analysis, methodology, and links to all sources, I've published a [comprehensive guide](https://www.moneyhub.co.nz/house-price-predictions.html) (WARNING: This is a MoneyHub link – I work there, so ignore if you prefer – all core data above is verifiable via the sources below)\n2. Banks are currently predicting 2-5% growth for 2026 (I will not link to Oneroof who said this four days ago!). Given the bank track record, I suggest you treat such predictions as marketing.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 404,
    "downs": 0,
    "created_utc": 1767402711.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.424017322391899
  },
  {
    "score": 383,
    "title": "I have been spending 60% of my wage on nothing for 8 years",
    "selftext": "Hey 26m (chef) I have recently (2 months) quit smoking cigarettes and weed both cold turkey, started to knuckle down on actually saving and recently got a new job which net me a $5 pay rise \n\nHowever\n\nI can’t help but hate myself for realising that over the past 8 years (smoking 20p cigarettes a day and smoking roughy a 1/4 oz of cannabis in a week) I have spent roughly around $120,870 give or take over that time period. All while not saving any money and practically living week to week.\n\n3 months ago I was working in a place that paid very low ($25 ph for an experienced chef de partie) and have always been in low paying jobs as I understood it was “just part of hospo” but about the time I chose to quit I had started to realise that my colleagues even some earning less than me were somehow managing to buy very nice things/eat well AND save money. This most definitely made me start to wonder why I struggle so much and although deep down I knew ( it was my multiple expensive habits) I chose to ignore it for so long until I’d finally had enough. \n\nPut myself through a gruelling 2 months of quitting both habits cold turkey (and they say weed isn’t addictive lol) and now I cannot believe the money I have extra every week. Has anyone else experienced this? I feel like I’ve just been on autopilot my whole life and have no truly nice things or Tavel experiences/memories to show for it.\n\nMy reason for writing this is (although I am debt free) I feel like I have lost so much valuable time and possibilities e.g. a house deposit and am looking for any advice on how to move forward.\nCheers x",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 383,
    "downs": 0,
    "created_utc": 1692882465.0,
    "media": null,
    "is_video": false,
    "num_comments": 126,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.363733084845509
  },
  {
    "score": 379,
    "title": "This sub has ruined me..... thanks",
    "selftext": "Alright misleading title as it's good news, here it is: 5yrs ago I started investing $5 a week into stocks, I started working a 2nd job which gave me extra cash after bills (1st job paying &lt;$50k). Anyways I was going to use that extra money to buy a classic car, in the end I didn't bother as this subs knowledge is about growing your money. I did and now my portfolio hit $50k this week.\nSo now that car is within reach and I can't bring myself to close the accounts (hatch,sharesies,ibkr,investnow) and take it out to buy the said car. I feel like I would miss out on the potential gains over the next decades. I've never had this much access to spare money before so feels good, trust the process people and have a good evening peeps",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 379,
    "downs": 0,
    "created_utc": 1714807518.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.2518226428048465
  },
  {
    "score": 371,
    "title": "Grandads given me $500,000",
    "selftext": "Right, after the feeling of winning lotto euphoria leaves, what should/could actually be done with this kind of money when it hits my account in a couple weeks?\n\nContext! just because we’re all nosey bastards. \nGrandad sold his farm for 10+ million. Grand kids are getting $500,000 each. I’ve never been someone with a lot of money but I make what I have work for me. I’m 32M with partner of 5 years and no kids. Myself have 100k in savings and investments and 50k in kiwisaver. Partner freeholds half a $1.2million house in southern part of Auckland. \n\n\nEDIT: Grandad is fine! He’s still alive, he’s just spreading some love while he can still watch us live our lives a bit easier.\n\nI don’t have any debt whatsoever, I’m an employee electrician with a work van and my own $20k weekend truck. I’ve worked long hours most of my life so I know how much this money means, only found out yesterday so there’s no wrong answers really 😂",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 371,
    "downs": 0,
    "created_utc": 1728171521.0,
    "media": null,
    "is_video": false,
    "num_comments": 293,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4947166050879765
  },
  {
    "score": 374,
    "title": "Thank you for the hard words",
    "selftext": "I posted in here a while ago, and got given hard words from many wiser people. \n\nI went away after packing a sad and realised you were all correct, and in the 2 months since have redone my whole budget, tracking every cent, and have even managed to save, and made the decision to move out of my current flat to something much smaller to save money.\n\nThanks for kicking my arse\n\nEDIT:\nDidn’t expect such a response. Thanks all. \nI still have a long way to go. And have to mention Luke Kemeys from Keep The Change, which I have consumed over the break, he’s an absolute legend. \n\nFrances Cook’s instagram has been really great, and also read Mary Holm’s book “rich enough?”, and have “a richer you” on the way too.\n\nAnd MoneyHub, for a novice like me, has been amazing.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 374,
    "downs": 0,
    "created_utc": 1704512389.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.04009189508755
  },
  {
    "score": 349,
    "title": "First day back, feel like resigning",
    "selftext": "Anybody else in the same boat? Been feeling this way for a while but having a good break has amplified this.\n\n1. I feel like I’m not any good at my job. (My own thoughts, end of year review with management went quite well)\n\n2. I feel like what I get paid is not worth the responsibility/stress that comes with the role. \n\n3. I want to spend more time and have more energy for my kids (3yo, 2yo)\n\nI want to resign but don’t have a new job to go so I guess I’m looking for advice from anyone who has resigned unexpectedly then made it work either going out on their own or doing something they actually enjoy",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 349,
    "downs": 0,
    "created_utc": 1736147980.0,
    "media": null,
    "is_video": false,
    "num_comments": 150,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.35355651799686
  },
  {
    "score": 350,
    "title": "So sick of the real estate industry in nz",
    "selftext": "Its so stupid. I want to buy a house, I'm able to give someone a million dollars for a house to live in. \nCan I just do that? No. Of course I cant.\nNoone advertises the price they want, and heaven forbid a house get sold without going to auction. Its mind bogglingly annoying. \nthe process seems to be: \n\nAUCTION:\n\n* list house for auction but imply open to offers\n* make sale rules that say even if you offer the vendor an amount that they are willing to accept, the auction will still happen, just bought foward, and then, and only then, can you buy the house at the price that the vendor has already \"accepted\" \n\nNEGOTIATION:\n\n* list a house, no price. \n* book to auction. \n* get passed in at auction. \n* list for \"negotiation\" \n\n* make everyone email you asking about price\n* withhold offers or not respond to people making offers for a few days then announce the house is under offer\n* tell some story about how its probably going to fall thru anyway and how I should pay my lawyer and waste my banks time getting all the terms ready for purchase on the off chance that it falls thru and I can buy. \n\n\n\nNZ - I beg you, stop going to auctions. Stop buying at auctions. Just let them all get passed in first and only buy thru negotiation. The funny thing is by the time the property is that negotiation the agent is usually more than happy to tell you the price they want, they just wont advertise it for some reason - which is no doubt a sleazy psychological \"marketing people\" brain fart that everyone in their industry has elevated to gospel, but I guess that's another story. \n\nthanks for listening &lt;3\n\n\n.\n\nedit :  why everything must be advertised from the perspective of \"knock it down and put 5 houses in\" - complete with plans. They seem to be pathologically against the idea that someone would want to actually just live in the house, and have a little back yard. its so weird :(",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 350,
    "downs": 0,
    "created_utc": 1693512140.0,
    "media": null,
    "is_video": false,
    "num_comments": 295,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.478452971995293
  },
  {
    "score": 350,
    "title": "PSA: Coming changes to bank payments from 26 May",
    "selftext": "From 26 May most New Zealand banks: ANZ, ASB, BNZ, Kiwibank, TSB and Westpac (plus Bank of China, Citi, HSBC &amp; ICBC) will be moving to the processing of payments 365 days per year. \n\nIt means that payments will be processed on weekends and public holidays, rather than just on business days as they are now. (So no more waiting until Monday for a payment sent on the previous Friday.)\n\nIt does mean a change for personal and business banking customers - as payments previously made late on a Friday or over a weekend will now go through on **the same day**. It is important to note though that payments are not *yet* going to be made in real time, so there may still be a delay of a couple of hours before they go through. \n\nYou should review any existing automatic payments or scheduled payments so that you are ready for this change. For example, if you have payments currently lined up to go out on a weekend knowing they won’t currently be cleared until Monday, from 26 May you will need to **ensure that you have sufficient funds** available on the day the payment is scheduled to go out. \n\nFor businesses, it's also an ideal time to review your payments, along with your current systems and processes. We suggest having a chat to your payment provider or business advisor if needed about the potential wider impacts to your business and cash flow.  \n  \n\n*Are all payment types included?*  \n  \nThis change is limited to domestic payments such as direct debits, direct credits, automatic payments, bill payments and online/mobile banking payments.   \n\nHigh value transactions, such as house settlements, will continue to operate under the existing ‘five business days’ model and will not be affected by this move. International payments and credit card transactions will also not be impacted.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 350,
    "downs": 0,
    "created_utc": 1680490386.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.250066742775133
  },
  {
    "score": 340,
    "title": "Gave up booze",
    "selftext": "Recovering alcholic here....\n\nI have been dry for -9 months. Paid a ton in counciling to get off the bottle, but now just use AA and other activities to better my life.\n\nI was just working through my finances and I worked out I was spending $1k+ per fortnight in booze (I drank at home alone) over the last few years. \n\nI didn't go into debt with my addiction as I could afford it,  but how the fk i didn't lose my job is beyond me. I was a train wreck.\n\nI have stated to invest that extra income based on some of the suggestions on this (so thank you for the suggestions) but the point of this post is fuck, alcholism is expensive. Glad I've pivoted! \n",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 340,
    "downs": 0,
    "created_utc": 1751163475.0,
    "media": null,
    "is_video": false,
    "num_comments": 61,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.171450223741624
  },
  {
    "score": 340,
    "title": "Regret buying house",
    "selftext": "We bought in 2022, as the market was starting to turn. House has lost at least 10% of value, plus interest is still eating up a huge portion of our income. Things are improving slightly as we rolled over to a lower rate. We weren't in a position to buy until our mid/late 30s, by the time we'd saved enough deposit. We'll be late 50s/early 60s before we're debt free, assuming no major changes like job loss or illness. \n\nWe were pretty cautious, in the scheme of things. Had a 33% deposit (that's now fallen to around 25% equity). Loan is about 5x our combined incomes. \n\nBut the juice really isn't worth the squeeze. NZ housing market is cooked, and most of the gains have been made by earlier generations. I just want more of my life back. \n\nRant over.\n\n",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 340,
    "downs": 0,
    "created_utc": 1743008316.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.109496888431822
  },
  {
    "score": 324,
    "title": "Am I just winning?",
    "selftext": "I am 21M and basically everything seems to be going too well rn. I have a 70K wage and am about to put a 10% deposit in a house using Kainga Ora for a $600,000 house and did the math with boarders and my partner going to pay roughly $450 a fortnight on house repayments.with the option easily to increase to knock 10 years off loan. My student loan has $600 remaining and then no loan on my car or dependents. With an overseas trip at the end of the year and currently putting 1K a fortnight away with $500 of that in savings and the other in stocks\n\nHonestly I’m just waiting for shit to hit the fan because this seems to good to be true and I just wanted to share a bit of my happiness.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 324,
    "downs": 0,
    "created_utc": 1750887433.0,
    "media": null,
    "is_video": false,
    "num_comments": 115,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.189112355592334
  },
  {
    "score": 319,
    "title": "I'm a mortgage broker AMA",
    "selftext": "Hi there, I'm Richie, a mortgage broker who also used to be an economist and before that a finance lawyer.\n\nI’ve lurked on here for ages but started commenting on posts a few months back, and some people seem to have found what I’ve shared useful so far.\n\nSo, ask me anything!\n\nQuestions can be as detailed or high level as you like. Disclaimer that I will give general comments in here rather than financial advice (as I need to know more about your situation to give you financial advice).\n\nWhy am I doing this? Apart from the fact that helping people is nice, we’re building an app to make the process of buying houses including getting a mortgage sorted much easier. Your questions really help me get insight into what people are interested in. Also if anyone’s interested in playing around with early releases of the app let me know.\n\nEDIT: Thanks everyone for your great questions - I've got through almost all of them, will answer all the remaining questions tomorrow. For anyone that's just finding this you're welcome to still ask questions! Night y'all.\n\nEDIT: Alright breakfast has been had - I'm back and will keep responding. Will be a little more sporadic today as I'm cooking an Ottlenghi feast tonight.\n\nEDIT: This really blew up! I've gone through and answered all the questions. I'm on Reddit often so will get notifications of any new questions so you're welcome to ask more.\n\nhttps://preview.redd.it/uvvr9jf3liod1.jpg?width=2880&amp;format=pjpg&amp;auto=webp&amp;s=42e91ea14db65321e909673a76730dc28b1fc5fd",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 319,
    "downs": 0,
    "created_utc": 1726206209.0,
    "media": null,
    "is_video": false,
    "num_comments": 303,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.429086770124282
  },
  {
    "score": 317,
    "title": "Well this is a wake up call…",
    "selftext": "Decided to download 12 months worth of all our bank feed and categorise everything in excel… not quite the outcome I would have thought. This highlights a number of areas where we can quickly and easily reduce costs (meal prep will be a big one this year).\n\nAlso business income helps to top things up along with a significant pay rise, we have an emergency fund of $30k sitting aside and now am beginning to build a sharsies portfolio just starting with managed funds to begin with. \n\nNo debt to speak of other than mortgage and student loans that will both be paid off within 12 months. This year we want to build wealth and once the student loans are gone we will begin to hammer into the remainder of the mortgage.\n\nThe normal response is if I want something I will just make more money… now time is a more important factor so working more and facing another year of burnout is not on the cards, that is likely why the food costs were so high. \n\nThis is more of a post to help keep myself to account in 12 months time to see how much more I have improved!",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 317,
    "downs": 0,
    "created_utc": 1736383076.0,
    "media": null,
    "is_video": false,
    "num_comments": 262,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.432404994229311
  },
  {
    "score": 314,
    "title": "Kinda blows my mind you can’t fix for the entire length of a mortgage here…",
    "selftext": "Does everyone who bought a house just live in a constant state of anxiety of “hmm I wonder how much we’ll have to tighten our belt this year” regardless of if their job is stable and they’ve made consistent payments?\n\nThe “she’ll be right” attitude toward everything seems to have a profound negative affect on customer service and gives way to anti consumer practices.\n\nThere is no reason in my mind that people with great credit and half of their house paid off should have to pay the exact same interest rates (and sometimes worse) than FHB with 20% down. \n\nEveryone needing to do quick maths every time the OCR changes… seems kind of ridiculous.\n\nEdit: wow positive upvotes from being at zero with over 20 comments for a bit. Interesting",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 314,
    "downs": 0,
    "created_utc": 1680725698.0,
    "media": null,
    "is_video": false,
    "num_comments": 182,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.289536098654815
  },
  {
    "score": 309,
    "title": "People with ageing parents: take heed!",
    "selftext": "The last five years have been a bit of a nightmare, so I'm here to help you avoid the pitfalls of taking over your parents' affairs, managing their finances etc.\n\n1. Make sure they have an up-to-date will. Sounds easy, but the conversation can be hard. Start early.\n2. Get Enduring Power Of Attorney (doesn't have to be activated - just ready to go). Be prepared to supply certified copies to banks, etc.\n3. Do this \\*before\\* they get dementia and/or are unable to physically attend bank/lawyer meetings.\n4. Make sure they don't have any accounts you're not aware of. Eg, five years after we visited every bank to close her accounts, it was only blind luck I learned she had a TD with $11,000 in it!\n\nRight now I'm dealing with Mercer to try to get her Kiwisaver transferred to her bank account. Both her passport and drivers licence have expired, and Mercer say there's no way around it, other than for her to get a new licence or passport!\n\nWe've all become so used to electronic banking and everything being fast and easy, going back to signing bits of paper and getting other people to sign them and having to fuck around at the post office feels like such a massive chore.\n\nThat's why EPOA is so important.\n\nGet it done sooner rather than later. Have the conversation early - don't put it off. Good luck.\n\n\\*Edit: please do add any suggestions of your own to this thread\\*",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 309,
    "downs": 0,
    "created_utc": 1689741725.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.247058036413385
  },
  {
    "score": 314,
    "title": "Just hit $100k in my Kiwisaver",
    "selftext": "Just wanted to share a personal win.\n\n Late late 30's so approx 25+ years to retirement. I've posted prev but moved from Simplicity to I.N Total World Fund\n\nEdit- to everyone asking why I changed, it was in a big part to this blog - Ruth / thehappysaver.com\n\nHer goals/reasoning made sense to me 🙃\n\nEdit 2- I don't know the author or am suggesting/recommending anyone else to follow her advice. DYOR! ",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 314,
    "downs": 0,
    "created_utc": 1756103095.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.198051889864685
  },
  {
    "score": 304,
    "title": "Frustrated",
    "selftext": "I know that comparison is the thief of joy, but it's just hard not to compare.\nMy close friends were gifted a $2.6 million house by the bank of mum and dad this year. (Mortgage Free) and have now both bought brand new cars. My other friends were also given a sizeable 500k gift towards their first home.\nIs this normal? How do you even keep up with that? Just feels shit going over to either of their places with the kids and seeing all they have, while we're struggling to just make it. Feels like I'm failing my kids.\n\nUpdate: This was the first time I've posted on Reddit and I didn't expect to be bombarded with this much feedback, let alone this much kindness. I'm genuinely speechless and been in tears reading the responses. It will take a lot of hardwork to stop these negative thoughts and emotions, but on some self-reflection, we are truly very fortunate for everything we have. Thanks you everyone!",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 304,
    "downs": 0,
    "created_utc": 1699419939.0,
    "media": null,
    "is_video": false,
    "num_comments": 229,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.332663757355583
  },
  {
    "score": 303,
    "title": "My experience with BNZ compared to ANZ when it comes to mortgages!",
    "selftext": "Hi everyone, long time lurker, infrequent poster here but I simply must highlight the differences in user friendliness between both BNZ and ANZ when it comes to mortgages! I recently got a second mortgage with ANZ, and my god am I in shock at how little you can do. Make a lump sum payment on the app? Absolutely not. Change your repayments? Call the 0800 number and then have a million digital forms emailed back to you that you have to sign and return before that can happen. The amount you owe just sits there to look at and thats that.\n\nWHEREAS BNZ is soooo unbelievably user friendly and FULL of information to help you pay your mortgage off faster. I have included several screenshots which I will break down for you now.\n\nImage 1: Is when you click into the loan, you immediately have the option to either make a lump sum payment OR change your repayments. If one week you want the repayment to be $1000 for a few weeks, you change the repayment to that and then as soon as you want to drop back down to the minimum you do so within the app and the change is instant.\n\nImage 2: This is what you see when you select 'make a lump sum payment' as you can see I put in the figure of $20,000, and it tells me by doing this I will save $46k in interest over the life of the loan and the early repayment charge is $4.22.\n\nImage 3: Similar to make a lump sum payment, but this is changing my weekly repayments. Altering the figure from $100 to $150pw saves $28k in interest and reduces the loan time by 10 years. Amazing intel.\n\nImage 4: And finally, I have been following this thread for years and have seen so many questions about offsetting, so thought I would include this so people get a visual on a real life experience. I was made redundant from my job 2 years ago and got a payout of almost $60,000 which was obviously fucking amazing. I immediately offset it againt a part of my mortgage and haven't looked back!\n\nAs you can see I have $81,000 split from my main mortgage into a BNZ 'offset mortgage' and I have $83,000 in cash. And the unreal part is BNZ actually tells you how much interest you have saved over the years by doing this, in my case $14,479.93, and increasing each week!\n\nI cannot put into words how satisfying it is to see visual, tangible evidence of you saving money by offsetting. I am so obsessed with the thought of money in my pocket instead of the bank I honestly cannot ever see myself spending that money hahaha. Anyway, I hope this inspires other mortgage holders to shop around before refixing as I am telling you right now, ANZ ain't it!\n\n** I am in no way advertising BNZ or affiliated with them in any way, I simply wanted everyone to know there are superior banks out there that have the tools to help you clear debt faster.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 303,
    "downs": 0,
    "created_utc": 1746170335.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.2215868325790655
  },
  {
    "score": 304,
    "title": "Confirmed - OCR drops 0.5% to 2.5%",
    "selftext": "Next announcement is 26 Nov, when there will be a new Monetary Policy Statement that gives us more of an idea of the RBNZ's plans.\n\nMain banks have already reduced rates over the last week to 4.49% (for 1 year at &lt;=80% LVR. Not anticipating any further movement in fixed interest rates, but will have to wait and see. I’ll put any updates in the comments, and updates to floating and test interest rates too.\n\nReminder of how to calculate break fees: (Existing rate - new rate) * loan balance * number of years remains\n\nSo eg\n\n5.76% - 4.76% * 400,000 * 0.5 = 2,000 estimated break fee.\n\nBut it’s pretty rough - only way to know for sure is to ask the bank, which is free and easy. Interestingly I’ve recently found break fees to be lower than the avoided interest, which has made for some long loans being broken to refix at new rates. Conventionally you wouldn’t expect that to be the case but it was, so 🤷‍♂️\n\nWhat are you going to do with your lending - locking short or starting to lock for longer?",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 304,
    "downs": 0,
    "created_utc": 1759885335.0,
    "media": null,
    "is_video": false,
    "num_comments": 227,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.390767262847013
  },
  {
    "score": 298,
    "title": "A lot of people don’t realise their worth",
    "selftext": "This is a sad fact and I was a victim of this mentality as well. Talking to an old friend made me realise that a lot of people think they have to stick with their careers or jobs just because they’ve done it for so long. Its obvious that the biggest pay increases come from when you switch jobs. With unemployment currently sitting at 4.3% - my heart goes out to those people. I just wanted to bring some hope to anyone that thinks they’re stuck. I worked at the same place for 10 years and never thought I would be able to do anything else until an old boss shared a job with me that I didn’t think I would even be considered for. I applied and got it and instantly had a 75% pay increase. I realised that the only thing holding me back was my perception of my abilities. Just wanted to share that as a cautionary tale. \nBest of luck to all those feeling stuck! ",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 298,
    "downs": 0,
    "created_utc": 1714615895.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.125720208331558
  },
  {
    "score": 297,
    "title": "Green loan comparison",
    "selftext": "I've just done some comparative analysis for a client on green loans and thought I'd share as the banks are really quite different. \n\nIf you're looking at getting a new loan / refinancing and want a green loan, I'd take a look and make sure the bank you're looking at is best for you. It could be thousands in difference in cost depending on which bank.\n\nKey takeaways:\n- Green loans are generally available for your own home as well as investment properties\n- If getting a small loan (under $10k), Kiwibank will actually pay you to take the loan out (highlighted in green). That is, the cashback is greater than the interest cost.\n- Kiwibank's is structured quite differently. You pay a floating interest rate (and theirs isn't great), but then they give you $2k cashback regardless of loan size (min $5k), which is paid out $800 after year 1, then $400 per year after years 2-4\n- In the $10k - $50k loan range, Westpac is generally the best because they're interest-free though there are some specific things they don't cover e.g. ebikes\n- Above 50k (Westpac's cap), ANZ, ASB and BNZ are all similar but ASB offers the widest range of eligible things. But if only just over the 50k mark, you might still be better off with Westpac\n- The grey eligibility boxes are where their website and terms aren’t clear and the issue hasn't come up for a client so haven't asked the question directly yet.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 297,
    "downs": 0,
    "created_utc": 1753667632.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.229912606655368
  },
  {
    "score": 286,
    "title": "META: Does anyone else get blown away by the young wealth in this subreddit sometimes?",
    "selftext": "Sorry if metaposting is not allowed, please delete if so mods.\n\n  \nI think I might have to leave this sub, just because the posts depress me so much. I am in (what I thought was) a half decent position for your average early 30's Aucklander. Little bit of savings, renting a nice place for too much money with my fiancee, student loan debt but nothing else major, definitely not struggling but not wealthy by any standard.\n\nBut when I see a post every other day here along the lines of: \"19 years old, what should I do with $100k in my savings\", \"18 years old with $50k Sharesies account, advice needed\" I'm just baffled and miserable.\n\nI understand that your average debt-ridden family or struggling singleton won't be posting on here, but that's the kind of advice I usually am on the hunt for in this sub, especially in a city with a broken housing market and an expanding wealth gap for younger people.\n\nInterested in discussion, but again, sorry if this is not the kind of post that is encouraged here.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 286,
    "downs": 0,
    "created_utc": 1754948540.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.169017513253777
  },
  {
    "score": 283,
    "title": "Thank you Sharesies",
    "selftext": "This isn’t a flex, it’s a celebration. \n\nI’m a regular-ass salaryman, who until a few years ago knew almost nothing about money other than what my salary gave me. \n\nThen, in 2018, I downloaded Sharesies. \n\nIt took me a while to get a hang of it, and I’m sure there’s still lots of things I could do better, but compare this return to a savings account or whatever else I had previously (shithouse TD’s) and it’s a massive improvement. \n\nIn many ways the internet sucks nuts, but giving Joe and Jane Average the opportunity to benefit from a system that was previously for the exclusive use of the wealthy, is pretty fucking great. \n\nIf any members of the sub, or visitors to it do not have Sharesies or something similar, you absolutely need to crack into it. A few bucks a month. Whatever. Doesn’t matter. 20% of $100 is better than 2% of $100. Do it! \n\nHave a choice weekend everyone 🙂👍",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 283,
    "downs": 0,
    "created_utc": 1764984131.0,
    "media": null,
    "is_video": false,
    "num_comments": 77,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1043656413922776
  },
  {
    "score": 277,
    "title": "Reminder - You have ten days before the KiwiSaver deadline to receive the Government contribution",
    "selftext": "Just a friendly reminder that the deadline for receiving the KiwiSaver Government contribution is 30 June 2023. \n\nIn case you don’t know how this works, the Government will make a matching contribution to your KiwiSaver account that is equal to 50% of your employee contributions during the year ending 30 June 2023. The Government contribution is capped at a a maximum of $521.43\n\nIf you want to receive the maximum possible Government contribution of $521.43 then you have ten days to ensure that your employee contribution for the year ending 30 June has been at least $1,042.8\n\nIf your employee contribution is currently below this level then you can make a voluntary deposit to your KiwiSaver provider to reach the threshold. These deposits need to be cleared into your KiwiSaver account before the deadline - so don’t leave it until the last minute or you will potentially miss out.",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 277,
    "downs": 0,
    "created_utc": 1687208159.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.087799252271195
  },
  {
    "score": 269,
    "title": "I can't live with flatmates anymore",
    "selftext": "I'm 34. I can't live like this anymore. The stress of constant turnover and not being able to predict what group dynamic I'll be living with from year to year is wearing me down. After over a dozen flats, just when I think I've finally found a decent, friendly, considerate, tidy match, some other variable changes in the house (usually someone else moving in or out), and I'm back to square one: interviewing strangers, recalibrating habits, renegotiating every tiny domestic norm from scratch.\n\nAll it takes is one bad apple in a house for positive feelings to turn negative, and before you know it I'm yet again dreading the sound of a bad flatmate's key in the front door.\n\nAll of my friends my own age now own homes. Meanwhile, twenty-somethings who  dominate the rental market are less likely move in with someone outside of their generational bracket.\n\nIt's gotten to the point where in recent years I've repeatedly found myself fantasizing about living in a car or a van. That is, until I realise how inconvenient and generally depressing that \"alternative\" would be.\n\nI'm terrified of being in my fifties and still having to navigate flatmate politics. This shit has already shorn years off my life, I swear. At this point I've basically lost my faith in humans and I just want the world to leave me alone. Yet, I've never made much more than a minimum wage, so the prospect of buying a home seems utterly hopeless to me. What do I do?",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 269,
    "downs": 0,
    "created_utc": 1763637640.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.146976802005235
  },
  {
    "score": 271,
    "title": "Is everybody broke right now?",
    "selftext": "It feels harder now than a year ago in late 2024, despite lower interest rates and articles i am reading about better times, turning points and a hopeful bottom of the trough.\n\nWe own a fledgling retail business in Auckland and honestly, this year has been rough. It feels like the economic pressure hasn’t let up. in fact, it seems worse than a year ago. The general narrative is that things should get easier with lower rates, but that hasn’t translated into more money in people’s pockets or retail spending, at least from what we're seeing. There seems to be no liquidity in the consumer spending economy.\n\nThe economic signals for the next couple of years (2026-27) don’t seem that inspiring.\n\n* Household living costs are still rising (5.4% increase over the last 12 months), with basic expenses like food and utilities up for most people.​\n* Retail data shows a big squeeze: 1 in 8 central Auckland shops is now empty.​\n* Even with positive forecasts (2.1% average annual growth ahead), most experts think it'll be at least 2 years before individual living standards get back to previous highs.​\n* A recent survey says 1 in 4 Kiwis are struggling financially, and almost half are worried about job security, which means they’re holding back on discretionary spending.​\n* Retailers of all sizes, us included, are fighting really hard over what feels like a shrinking consumer dollar. Competition is absolutely brutal.​\n\nFrom a personal side, I’m in a pretty privileged position. I’ve got a stable day job, earning around $140k (which just covers our $650k mortgage repayments +living costs), and we live simply—don’t eat out much, no kids, and pretty frugal by Auckland standards. But after paying the bills and supporting the business (where my partner draws almost nothing after staff and reinvestment), there’s basically nothing left each month. We’re effectively running on a single income.\n\nIt does make you wonder: if things are this tough for us, what’s it like for everyone else? The rising cost of living, the relentless grind, the sense we're all just treading water. We're in our 40s and the “Kiwi dream” feels pretty stuck or maybe just run out? Sometimes it feels like there’s not much holding us here anymore, and that moving overseas might not be such a bad idea.\n\nAnyone else feeling this way? Is it just us, or does it feel like the good bits of living in NZ come with a pretty high price tag these days?",
    "subreddit": "PersonalFinanceNZ",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 271,
    "downs": 0,
    "created_utc": 1762891101.0,
    "media": null,
    "is_video": false,
    "num_comments": 307,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.383844262284421
  }
]