[
  {
    "score": 2316,
    "title": "Twitter/X links are banned",
    "selftext": "It probably doesn't matter much because there are so few of them, and most are removed for being low quality. However, it has been done.\n\n===============\n\nEditing on 22 January to address the following criticisms and questions.\n\n**Why the ban?** \n\nDuring a speech at Trump's inauguration Elon Musk used the Nazi salute. \n\n**That wasn't a Nazi salute.**\n\nSome like the ADL have said that it was not. However, there is good reason to believe that it was, and very little reason to believe it wasn't. \n\n* Over the past few years, Musk has made multiple racist and anti-semitic statements and has amplified the reach of others making similar ones\n\n* This doesn't appear to be random arm movment of flailing. If you compare what Musk did to Nazis and others performing the salute, they're nearly identical. \n\n* It has been celebrated by neo-Nazis and other members of the extreme-right. These are people who are used to dog whistles and are very attune to coded messages\n\n**What's the point? / There aren't many Twitter or X posts anyway.**\n\nSimply to reduce traffic to X. \n\n**This is censorship.**\n\nNot in the traditional sense. All of the ideas that have always been allowed on here still are. You just can't post links to a particular site. If you want to quote someone or post a screenshot, that's still allowed within the usual rules around quality and relevance. \n\nCuration of content has always been part of the role of the moderators here and it's necessary in order to create an environment in which useful and engaging discussions can occur. \n\n**Censorship is part of fascism.**\n\nThis is an ironic statement given that fascism is a far-right political ideology, and what's being blocked are links to a far-right figure's company and website. \n\n**You're creating division and echo chambers.**\n\nIncorrect. As stated above, the same kinds of content will be allowed, just like before. \n\nOne can also make a very supported argument that this is what Musk has been doing with Twitter since its acquisition. \n\n**Lots of other tech leaders were at the inauguration.**\n\nIf they also make it clear that they and their companies are righ-wing garbage like Musk, they will also be banned. Until then, Musk is the only one doing this openly and publicly. \n\n**The mods are left-wing. / The mods are delicate snowflakes. / Etc.**\n\nI can't comment on the others, but this doesn't accurately describe my ideaology. However, this shouldn't really matter when we're talking about Nazis and Nazi sympathizers, wherever Musk falls into that range. \n\n**This doesn't demonstrate a good product mindset.**\n\nI struggle to understand what this actually means. \n\n**This was done unilaterally. / There should have been a poll.**\n\nSorry, but this is a benevolent dictatorship.\n\nUser feedback is one aspect of decision-making. Nearly all (probably all, but I can't remember for sure) of the rules have been established without polls. \n\nBased on the response and voting that has been seen so far, the results would have been in favor of the ban. \n\n**You're politicizing a subreddit that is unrelated to politics.**\n\nMaybe somewhat, but calling out Nazis and their sympathizers is always the right thing to do.\n\n**This is just an emotional response.**\n\nNo, I spent a while thinking about it, and have spent more time since then. I haven't been able to come up with a good argument not to on my own and haven't seen an objection yet that has made me reconsider. ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 2316,
    "downs": 0,
    "created_utc": 1737506348.0,
    "media": null,
    "is_video": false,
    "num_comments": 174,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.146445058133123
  },
  {
    "score": 1868,
    "title": "My Advice on How to Be a Terrible but Valuable PM",
    "selftext": "One of the cruelest lessons I’ve learned as a PM is that success comes in two forms, and they rarely align:\n\n1. **Being a Good PM** – Driving meaningful impact on the business and its KPIs.\n2. **Being a Valuable PM** – Ensuring leadership sees you as valuable.\n\nIn an ideal world, focusing on #1 should be enough. But in reality, #2 often determines your career trajectory and job stability, regardless of actual impact.\n\nI’ve spent the last 9ish years as a PM across six companies of varying sizes (nothing FAANG). I have no pedigree and I'm sort of an average joe. I’ve been fired, I’ve quit, and I’ve been laid off. I’ve held multiple PM jobs at once, mostly working remotely. The longest I’ve stayed in one role was 5 years. I've never had trouble finding a job and there've been no periods of unemployment that weren't voluntary.\n\nI used to consider myself a solid PM, but I’ve become pretty detached from the \"impact\" part of the job and experimented the last few years with solely focusing on the \"appearing valuable\" part. I typically work 15-20ish hours per week. My salaries have ranged from \\~$140K to $300K per role. \n\n# Tips on Looking Valuable as a PM:\n\n* **Stay Positive.** Always highlight silver linings, no matter how bad things are. Don't say anything negative about ideas, people, or companies. Period.\n* **Focus on Vision, Ignore Execution.** Incremental improvements grow a business but don’t grow your profile. Talk 90% about the uncertain future, 10% about the present.\n* **Never Own Failure.** If a product or feature flops, don’t walk it back, just kick it down the road. Identify some hypothetical point in the future where it could be successful and get everyone on board with it.\n* **Signal Busyness.** Occasionally mention how slammed you are. Drop a weekend Slack message on Sunday night about how you've solved some problem and how it's great to have some quiet time to work on it.\n* **Speak in Big-Picture Terms.** Constantly reference “high-level priorities” and a “cohesive product vision.” Push back on tasks that require effort by questioning alignment with the long-term strategy.\n* **Prioritize Customer Meetings.** The bigger the customer, the better. Take every customer meeting you possibly can. Make yourself and your company synonymous in their eyes.\n* **Avoid Engineering’s Day-to-Day.** There’s no upside in the weeds. Praise them, but stay out of their decisions.\n* **Treat your Backlog as the Baseline Reality.** Don't stress it and don't justify it. Just take an afternoon, put everything in whatever order you choose. If stakeholders disagree, put the ball in their court to provide compelling reasons to change it. \n* **Don’t Overstep.** If engineering, UX, or marketing makes a bad call, let them own it. If asked for a decision, defer back to them.\n* **Exude Confidence, Not Uncertainty.** If leadership asks for an 18-month roadmap, don’t hedge—just give them one. If asked for an impact estimate, provide a number, not a range. Doubt is a career killer.\n* **Seek Low-Effort, High-Visibility Wins.** Organize fantasy football leagues, facilitate “post-it” brainstorming sessions, or run Friday show-and-tells.\n* **Find \"Resets\".** Eventually, this attitude is going to catch up to you. Find opportunities to press \"Reset\" on all the promises made and the future you've spun. New leadership, a changing boss, new technology (\"AI\"), a new key hire, or a promotion all work. These are the moments that let you keep up the charade.\n\n  \nI'm no longer losing my sanity trying to make a product successful or trying to single-handedly build a productive product culture. I've got an amazing work-life balance.\n\nProfessionally, I'm completely dead inside.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1868,
    "downs": 0,
    "created_utc": 1738470964.0,
    "media": null,
    "is_video": false,
    "num_comments": 195,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.16023733705707
  },
  {
    "score": 1786,
    "title": "I outperform other PMs that are smarter than me whilst working and stressing much less. Here is how I work...",
    "selftext": "There are so many posts about imposter syndrome, confusion, feeling lost and burned out. The common patten is to do more and care more. This positive feedback loop will only make things worse.\n\nI am a principal IC in a Fintech Unicorn and typically work in companies with roughy 30 to 50 product managers. I pretty much always outperform other product managers by the companies agreed success criteria, whilst stressing less, doing less and having more fun. I am not smarter than them, I am way lazier.\n\nHere are some bullets on how I like to work. It has served me and my direct reports well. If you're struggling, I hope there is something in there for you\n\n* I only ever agree to targets I am 90% sure I will hit within 50% of the time allotted. I will oversell the complexity of what we need to do and massively over deliver.\n* I *try* to only work on very fertile problem spaces that are within my circle of competence. If I am being asked to work on something outside of this, I immediately say it would be a waste of time and recommend a different PM.\n* I really really guard my time. I don't attend meetings but I ask for a summary of what was discussed. Mostly, nothing was discussed.\n* My sprints always start late. I refuse to spend dev resource on anything that I am not very confident in. Too many PM's have a huge cathartic release once a sprint plan is agreed, and then a week later stress about what to work on next. They end up with a bunch of filler tickets. Over and over I tell engineers that I cannot promise them a ticket-factory, but I can promise I will never waste their time. This is very well received.\n* Don't try to sound smart. I can tell who won't make it through probation by how many buzzwords they use. I speak simply so everyone can understand. That way, when I am being dumb it is clear and can be challenged and corrected.\n* I only ever have a rough idea of what is going to be worked on two sprints from now (at best).\n* The *few* things I care deeply about and never compromise on:\n   * *Excellent* test design.\n   * Absolute *minimal* build time\n   * Spending most of my time pairing with the designer and thinking through second order impacts and reasons for every change.\n   * Post-test analysis\n   * Understanding the highest impact levers\n* Spend a lot of time spend playing around with other products and scanning through Mobbin.\n* I spend time making my team feel that *they* are driving our success. I praise everyone publicly, no matter their contribution level constantly. I send their managers positive feedback when they do something good.  In turn, they work very hard and they trust me.\n* I use speach-to-text AI for 90% of coms. Why waste effort?\n* I avoid doing work outside of our scope *until* our targets are hit at all cost. I make sure devs do the same.\n* When I have a problem, I inform my boss immediately and that I am on it. You need freedom to do well. To get freedom you need trust which is earned through results and responding to challenges in public. If the problem snowballs, you will also be very glad they were brought in early. The problem will feel shared.\n\nSo, If you are not having fun being a PM, consider:\n\n* Setting goals you could actually hit\n* Focusing on impact at the expense of sounding smart, hitting artificial timelines and picking up other work\n* Praising your team\n* Doing less",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1786,
    "downs": 0,
    "created_utc": 1736007992.0,
    "media": null,
    "is_video": false,
    "num_comments": 263,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.1754265159405595
  },
  {
    "score": 1425,
    "title": "I just...stopped doing anything",
    "selftext": "Friends. I've been running an experiment. I work as a product manager in a fully remote company. All attempts to do anything that resembles product management have been undermined by executives who just want to tell teams what to build. It is a feature factory, and everyone is death marching while the company lurches along, not growing. \n\nAfter one particularly disheartening day, I just decided to stop doing anything. My team is rebuilding an app that already exists (don't ask me why, I still don't understand) so the project doesn't need me. So, I just attend meetings, and don't really do anything else. It's been 2 months. Nobody has noticed. \n\nIn fact, all I've heard is how pleased everyone is with the work I've been doing. It's insane. On the one hand, it's nice not to have the stress and pressure. On the other hand, it's mind-numbing. \n\nAnyone else experienced this? ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1425,
    "downs": 0,
    "created_utc": 1724796222.0,
    "media": null,
    "is_video": false,
    "num_comments": 274,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.108785872430979
  },
  {
    "score": 1212,
    "title": "Everything I hate about Product Management. An increasingly unhinged rant.",
    "selftext": "- Looking for PM jobs on LinkedIn and being forced to go through 5 pages of Aha! Product Success Manager openings that are clearly just marketing posts aimed at PMs for their shitty project management software\n\n- Seeing PM Influencers on social media bragging about being able to work 2 hours a day making $100k+ at their FAANG job\n\n- Astroturfing by PM ‘coaches’ taking advantage of people desperately trying to break in\n\n- Visiting /r/ProductManagement and seeing the weekly “Does anyone else experience imposter syndrome?” thread\n\n- Participating in said weekly thread\n\n- Dealing with prima donna engineers who were social outcasts in school but now compensate by thinking they’re god’s gift to man because they get paid six figures to fix CSS on the corporate website made by an agency six years ago that left no documentation\n\n- PMs who act [or are forced to act] as glorified secretaries\n\n- The flood of generalist PMs\n\n- The flood of ex-consultants/i-bankers/MBAs\n\n- Dealing with engineers who refuse to respect non-technical PMs and completely ignore the importance of building a sustainable profitable business\n\n- Going to Product conferences and listening to speakers jerk themselves off about how critical they are to their business' success. When everyone in the room knows its functions like engineering who actually build the product. Sales who make the deals happen. ETC. But Product people fight to stand on stage and bask in the glory because the role incentivizes optics above all else\n\n- Seeing your Head of Product be on stage talking about your work, but presenting it as theirs\n\n- Companies who treat their Product Managers as Project Managers\n\n- Companies who retitled their Project Managers to Product Managers because it would make it easier to fill the candidate pipeline\n\n- Having a father-in-law send you online PMP course suggestions since you’ve out of work and he thinks he's helping EVEN THOUGH YOU’RE NOT A PROJECT MANAGER AND YOU'VE TRIED EXPLAINING THIS TO HIM FOR THE LAST 8 YEARS\n\n- Companies that have no idea what Product even does, but we need someone to manage this project so let’s just hire one and let them figure it out. Then deny all their suggestions to improve the product because leadership already signed off on the PRD and assigned a budget.\n\n- “If you want to break into Product with 0 years of experience, you should check out Product Alliance”\n\n- Hiring Junior PMs and expecting them to handle senior PM responsibilities because the company failed to properly budget for the team\n\n- Hearing PMs call themselves the “CEO of the Product”\n\n- Marty Cagan\n\n- Finding yourself at a feature factory\n\n- Being powerless to stop a terrible product or feature launch\n\n- Management calls all the shots and product people are treated as silly little robots forced to implement everything, and if it fails they can conveniently shit on you for not doing it right because the feature was for sure the next iPhone of fitness apps using AI\n\n- Asking your boss “What does success look like?” and hearing back “Make the C-Suite feel smart and good about themselves”\n\n- “Hey it’s Mark from Sales. Sorry to be a bother, but just wanted to give you a heads-up that I already promised our largest client that the next product release would give them the ability to do a full data migration with one click. They’ve already signed the contract. No, you can not join the next client meeting.”\n\n- Having domain experts look down on you because you don’t also have 25 years of experience working in a super specific niche. And then proceed to avoid teaching you their trade. Then get mad that you made the wrong product calls.\n\n- “Hey it’s Tammy from Client Services. My client is dealing with a bug. Can you hop on a Zoom call? I promise it’ll only take 15 minutes.”\n\n- Always having to put on a happy face, even though everything is burning around you\n\n- Getting random LinkedIn messages from soon to be college grads asking how to break into Product. And when you ask them why they’re interested in Product they say “idk, it looks cool and I get to make stuff. Also, I’m graduating with my MBA in June and my undergraduate student loans are coming due so I need to make six figures ASAP”\n\n- Finding out your PM coworker lied about their PM experience because they went to and followed Product School’s advice to make up anything if it gets you the job\n\n- Marty Cagan\n\n- “Follow my newsletter to get tips on how to become a more effective product leader”\n\n- Opening up your backlog and seeing hundreds of tickets\n\n- “Thanks a lot for the feature suggestion, Janet. I created a JIRA ticket and will prioritize it according.”\n\n- “My Slack was set to ‘Do Not Disturb.’” “I know, but I have a question.”\n\n- Priorities shifting because the CEO read a Business Insider article\n\n- It takes six months to fully ramp up. You have 2 weeks.\n\n- “But have you considered this edge case that only has a .001% chance of happening?”\n\n- “Does anyone have resources to learn more about dark patterns? Why yes, I work as a mobile gaming PM”\n\n- Going to Product conferences and seeing all the booths hosted by business analytics startups\n\nI’m tired boss.\n\nI just want a job where I have the authority to help customers solve their problems that also pays six figures with a good WLB so I have time to make another six figures selling Coursera courses as a PM influencer on the side\n\nEdit: Wow, this post blew up! If you would like more insights on how to be a SIGMA Product Manager and hear more unhinged rants, check out my [newsletter.](https://www.lennysnewsletter.com/)\n\nEdit #2: I also offer resume review services to help aspiring PMs get into FAANG. Check out my [resume](https://i.imgur.com/33MrKQv.jpeg) if you have any doubts. ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1212,
    "downs": 0,
    "created_utc": 1707096230.0,
    "media": null,
    "is_video": false,
    "num_comments": 261,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.028011446526446
  },
  {
    "score": 1080,
    "title": "Today marks 13 years since I got my first PM job. Here's some reflections of what I've learned.",
    "selftext": "So some background on me briefly:\n\n\nLocation: East coast U.S.\n\nMy career started in desktop support, helpdesk basically. My boss set up some shadow days for me, and I became interested in business analysis.\n\nI landed my first \"real\" job, as a business analyst and worked with teams for about 3 years before I got my first entry level product management job.\n\nSince then I've worked in tons of different industries, and now currently work at a cybersecurity startup.\n\nMy starting pay was $55k, my current pay is $210k: reason I say this, is for my first reflection.\n\n1.) **Loyalty to one company is expensive**: staying at one company, especially early in your career is leaving money on the table. The absolute best thing you can do is to leave after 2-3 years and ask for at least $15k more than your current base. \n\n\n2.) **Product Influencers are bullshit, and I don't know how they came to prominence**: I'm a sucker for self-help and productivity hacks of all kinds. But I have never in my life seen more people have 2-3 years of total product experience transition into their own coaching business, course, book, or whatever else they're selling. This is a problem. It's pretty self-evident that it's a problem because many are pretty successful. It is not to say people can't have important things to say with so little experience, but it is ridiculous to think that C-level executives are hiring someone with 3 years of a niche SaaS product experience to coach their organization on how to become high functioning.\n\nSome of the top books that get recommended (ex. \"Escaping the Build Trap\") are pushed by people with the same level of experience. More power to them, but take all of the things these people say with a grain of salt. I can guarantee half the scenarios in this kind of content are made up - you can find their professional experience, and it doesn't track.\n\n3.) **As above, even Product \"OG\" advice usually shouldn't be applied**:  On the flipside, there are influencers and heavyweights with a ton of experience, but even they shouldn't necessarily be listened to. I'm talking specifically about Marty Cagan's and Theresa Torres' books that are literally molding how many companies run product orgs. But I trust people who ship features and ship product on a regular basis much more than those who haven't for the past decade; and no, consulting doesn't count. Most of those people are in the trenches, and aren't talking loudly.  \n\nThe way I look at the suggestions in these books is the same way I look at RPG class guides. He is teaching people how to min./max the class of product manager, but you don't need to min./max to play the game; and most companies cannot realistically do what he and others suggest without causing a substantial amount of turmoil.\n\nI have had to go into companies that tried, and unfuck those attempts on multiple occasions now. \n\nTo be fair, it isn't saying that Marty isn't correct - he often is - but again, it is easy being an observer - it's hard executing. We don't often have that luxury. \n\n4.) **Agile ruined software development**: I used to consult on agile best practices, coining it as \"digital transformation\", but the reality is this - agile and the management of it, were ways for people who don't know how to code, or have no real interest in technology, to get financial rewards off the backs of those that do. Plain, simple, period.\n\nThe whole tech industry is wrapped with people who just want to make a ton of money without doing much. It doesn't take much research to find evidence of people just doing barely enough to not get fired or push the envelope to rest and vest into retirement. \n\nThe amount of directors, product managers that are really project managers (this is something Marty Cagan is correct about by the way), engineering managers, etc. that do nothing but play hot potato with work is astounding. \n\nMany of the influencers I mentioned above (in both inexperienced and experienced categories) will claim they have some silver bullet solution, framework, or operating model to increase productivity. You know how I know that's bullshit? Because none of them suggest getting rid of everyone else that isn't directly on the teams building the features or selling the products. Why? Because it would put all of them (and us for that matter) in the crosshairs; and to be honest, that is what really needs to happen.\n\nTo summarize this one, agile frameworks have opened the door for people who have zero passion for the work, and add little value, to far outnumber those that do. It has recursively corrupted the entire industry to breed environments of apathy and unaccountability. \n\n5.) **Most of us are in bullshit jobs**: If the most valuable thing you produce is an email about what others have built over the past several months, you're in a bullshit job.\n\nIf you are able to show up to work, shut your office door, talk to no one all day, sit with your hands under your ass, and have no one complain? You're in a bullshit job. \n\nIf you are asking others to do what you can easily do yourself? And this is a big one: you're in a bullshit job. \n\nWe often talk about about imposter syndrome and existential crises in the product management community, and I find it quite prevelant regardless of industry. While it could be argued people are just hard on themselves, I think it's more that we don't know if we're valuable. As I stated before, often, we are not. \n\nThis might come across as cynical, but I view this as liberating. If someone is paying you, they're obviously doing it for a reason - you provide some kind of value more than what you're getting paid. But just don't be surprised if a trend happens when people who produce actual work aren't let go, but you are. Ride the wave as long as you can, and as fast as you can.\n\nThere is nothing wrong with getting as much money as you can, and just being kind to others you work with at a minimum. Just try and do good work, but don't be surprised if you get viewed as an unnecessary cost center at some point in your career.\n\n6.) **There's no such thing as being the \"CEO\" of a product\"**: I'll use a metaphor I've written here before, because it is 100% reality.\n\nThere is no such thing as the PM role being the CEO of the product in the real world.\n\nThe orchestra conductor is a more apt metaphor, but as I’ve stated publicly, it isn’t the right imagery. What you might be picturing is a conductor in a tuxedo in a packed opera house facing a classical orchestra.\n\nIn reality, picture the PM crawling out of the prison sewer pipe in Shawshank Redemption, being handed a conducting wand from the actual CEO, given directions to a bar called “Stakeholders”where a metal band waits for them. Then, once inside, the band explains they need the PM to conduct them, the PM then realizes there is no room on stage, so they now have to conduct the band from within the mosh pit.\n\nThen, while all that is going on, the CEO comes back in to whisper for updates from the PM while the band is playing over terribly mixed, overly loud speakers and the stakeholder denizens are recklessly flailing around.\n\nThen the VIP customers show up and quickly start complaining to the CEO, who for some reason is now taking on the role of also being the bar manager, that they were told this was a jazz club. The CEO/bar manager then approaches you and asks why you booked the wrong band at the venue.\n\nIt goes something like that.\n\n7.) **Most companies don't need a dedicated product function**: This is probably the culmination of everything I've said. The reality is most companies don't even know how to apply the function (even in the optimal min/max'd version I mentioned before), let alone have a need to do so. \n\nThe only time the function is valuable is when the company has scaled to a point where people need to focus on their core functions, product market fit (however a company defines that ) has been achieved.\n\nMost companies are not at that level. \n\nThat's all I have time for right now, but feel free to ask any more questions below.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1080,
    "downs": 0,
    "created_utc": 1712674443.0,
    "media": null,
    "is_video": false,
    "num_comments": 219,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.940037034364414
  },
  {
    "score": 826,
    "title": "Expectations of PMs in today's market",
    "selftext": "Just saw this post on LinkedIn and interested to get people's thoughts on it. As a PM with 12 years experience I read this and laughed. What's in your prompt library? Give me a break. But there are a lot of people agreeing with the sentiment of the post and it got me thinking about this kind of stuff. I'm a PM with a computer science background but I haven't written a line of code in years. My job is strategic and user-focused I'm not spending time writing code or automating my role because I don't do monotonous stuff that needs automating. Also this crap about passion projects, with what time? I work 50 hours per week and the rest of my time is for me, not spending more time in front of the computer playing entrepreneur. \n\nI have started using AI tools mainly for things like prototyping or just condensing my thoughts into slides etc. but that's not the kind of thing this guy is referring to here. Are PMs now starting to do all this kind of thing and I'm deluding myself in how the role is maturing? Or does this guy belong on LinkedIn Lunatics?\n\nGenuinely interested in getting actual PMs thoughts on this.\n",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 826,
    "downs": 0,
    "created_utc": 1747411893.0,
    "media": null,
    "is_video": false,
    "num_comments": 303,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.863942301356923
  },
  {
    "score": 760,
    "title": "I messed up my Google PM Vibe Coding Interview",
    "selftext": "I had my 2nd round of Google PM interview yesterday after doing well in my first round and was totally blindsided by the format. I had no clue there would be a vibe coding interview—I was expecting a traditional PM interview, but that didn’t happen.\n\nDuring the interview, I ended up being very unstructured. Having built AI applications at my own startup, I know the pitfalls of every tool out there, and in these situations, the main bottleneck is the backend. So, I focused all my energy on the backend during the interview.\n\nWhat I *should* have done was approach it like a product design interview: prepare a small PRD, use that to create a prompt, and then maybe run it in something like Firebase Studio, Lovable, or V0. Instead, I jumped into building my Langchain backend agent first and completely messed up the code for tool calling in Langchain. I was stressed and just blanked on the exact implementation.\n\nMy biggest regret is that, if I’d even had the slightest clue about the format, I would have come in with a structure prepared. I just didn’t manage my 45 minutes well. The knowledge was there, but the execution was honestly pathetic. Not sure what else to say—I guess I just needed to share.\n\nDeep down, what’s making me feel worse is that I don’t have too many opportunities—if I mess up the ones that come, it feels like I’m done for, especially since there are limited opportunities in India for AI jobs.\n\nEdit 1: Another reason for posting here is anyone who is planning on interviewing for a similar role knows there could be vibe coding interviews. In all my research I didn't find any mentions of a vibe coding interview, so hopefully this knowledge will help someone else in the future.\n\nEdit 2: I was interviewing for an L5 PM role (the JD mentions strong focus on AI/ML) so it is an AI PM role.   \nAlso the aim of the post has not been to garner sympathy (although I appreciate the positive and supportive comments), my aim was to solely narrate what the interview experience was like and what I could have done better. ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 760,
    "downs": 0,
    "created_utc": 1752145011.0,
    "media": null,
    "is_video": false,
    "num_comments": 252,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.802944917358482
  },
  {
    "score": 714,
    "title": "The unspoken rule of career growth that no one talks about.",
    "selftext": "I’ve been working in product for about six years now, currently leading a couple of squads at a fintech focused on payments. Most of my days are packed with meetings, trying to balance short-term delivery with longer-term planning, putting out the occasional fire with engineering, and making sure legal doesn’t hate us. You know, typical PM chaos.\n\nThere’s something I wish I’d learned earlier in my career: you don’t get promoted because you’re doing your current job well. You get promoted because you’ve already started doing the next job.\n\nWhen I was a mid-level PM, I thought if I just kept executing cleanly and kept things on track, someone would eventually say, “You’re ready for senior.” But that moment never really came. I got good feedback, sure, but nothing changed for a long time.\n\nWhat actually moved things forward was when I started acting differently. Not because I was told to, but because I started noticing problems no one else was fixing. I began flagging misalignment between teams and working across squads to fix it. I sat down with finance to understand the impact of our pricing model beyond just churn numbers. I helped newer PMs get onboarded and navigate our messy internal systems, mostly because I remembered how confusing it was for me when I started. I started thinking more about outcomes than outputs and challenged priorities when they didn’t make sense, even if that meant some awkward conversations with leadership.\n\nEventually, my manager said something like, “You’re kind of already doing the senior PM job,” and the title came not long after. But by that point, I’d been working at that level for months.\n\nThe same thing happened when I started moving toward leadership. No one gave me a formal nudge. I just started doing the work an d helpin other PMs think through problems, organizing knowledge that was scattered, bringing visibility to issues across squads that weren’t getting enough attention. The title came later.\n\nSo if you’re early in your PM career or even mid-level and wondering when your “next step” is coming, this is what I’d say: don’t wait. Promotions tend to come after you’ve already made yourself undeniable. Do the job before you have the title. That’s how people start seeing you as someone who’s ready. And once they do, it becomes hard for them to ignore it.\n\n",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 714,
    "downs": 0,
    "created_utc": 1747907273.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.554047377876165
  },
  {
    "score": 566,
    "title": "15 Cheat codes after 10 years in product management",
    "selftext": "**15 Cheat codes after 10 years as a product manager**\n\n1.**Don't pay too much attention to the \"PM is the CEO of the product\" stereotype.**\n\nWhile there is some overlap in what a CEO and a PM does, there is a larger part which separates the two roles. CEOs don't fire fight or create decks for investments. But PMs do that a lot.\n\n**2. Invest in learning effective communication.**\n\n90% of what we do is communication -- sharing ideas, motivating others, sharing progress, talking to customers.​ Not doing it well will make it impossible to be a good product manager.\n\n**3. Form genuine and long lasting relationships**\n\nThe other 10% of our jobs is getting shit done. And getting shit done is easier when other talented people support you. Build relationships with such people so they are there to support you when needed.\n\n**4. You do not need to know EVERYTHING**\n\nBut it always helps to know how to find answers to everything. As a PM, you should know the best person or the best resource to find an answer to any question about your product/domain\n\n**‍5. Don't do anything until you know the \"why\" of it.**\n\nAlways know the larger goals, and ensure you know if/how what you're doing contributes to the larger goals. This is the only way to create impact.\n\n**6.Don't get intimidated**\n\nPeople with a loud voice and fancy titles will try to override you (even when you're logical.) Don't let that happen. Instead: build confidence, build knowledge, build relationships\n\n**7. Ask for help**\n\nYou will be overwhelmed most of the time. You might not know all the answers. In such times, ask for help. There are always enough people willing to help\n\n**‍8. Don't say \"Yes\" to be nice**\n\nSay Yes when you mean it. Say NO when it is a NO, and explain why it is a NO\n\n**9. Don't doubt yourself**\n\nInstead, invest time to know your business and product better. Identify people and resources that can help you get all the relevant information. Get feedback and learn how to get better.\n\n**‍10. Don't fear making decisions**\n\nDecisions are a critical part of our jobs. The more we make them the more we learn. So make a lot of them and make them fast.\n\n**11. Use your time wisely.**\n\nTreat your time as you treat your money. Spend it wisely, save it, never waste it. How you treat your time is also how others will treat it.\n\n**12. Focus on outcomes/impact and not output.**\n\nTasks and effort are useless unless they drive an outcome and business impact. If you're not creating impact, you will not grow.\n\n**13. Embrace ambiguity**\n\nNever fear ambiguity or complexity of problems. Instead, learn how to reduce ambiguity by breaking complexity into small understandable chunks.\n\n**14. Don't avoid conflict**\n\nProduct managers have opinions, which are not necessarily well received by others. This leads to conflict. Resolve these conflicts ASAP\n\n**15. Drive alignment always.**\n\nYou need to get critical decision makers on the same page, even when it is tough. There is no way around it. Don't avoid it. Instead learn how to negotiate better.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 566,
    "downs": 0,
    "created_utc": 1687617749.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.382337515246025
  },
  {
    "score": 560,
    "title": "Rant: We are ruining the world",
    "selftext": "*Disclaimer - I’ve been drinking and I’m hitting the wall*\n\nYep - it’s us. We are responsible for all of it. It’s death by 1,000 cuts. We are responsible for all the waste. Landfills full of our last best products while our current and future products will only serve to make future generations dumber. I saw some tech shitbag talking about waiting to have kids so they can have ai implanted in their brain. If that’s the shit you are working on, where is your humanity? \n\nThey say info sec people retire off grid, but that’s already where I’m headed. Maybe I get 10 more years before I’m made redundant…maybe it’s 5. I hate AI with everything I have to hate. Call me alarmist, but do you really think your children are going to have a fighting chance at anything? The only thing holding tech back right now is battery life. When one of you figures that out, it’s over. \n\nI hate this timeline. Loki should prune this shit.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 560,
    "downs": 0,
    "created_utc": 1750725485.0,
    "media": null,
    "is_video": false,
    "num_comments": 114,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.454311781432968
  },
  {
    "score": 540,
    "title": "Our lead engineer quit and the whole company went into mini-panic mode",
    "selftext": "Last month, our lead engineer left for another company.  \nHe'd been with the product for 8 years and everyone relied on him for everything.\n\nAt first I thought \"we'll manage somehow\"... \n\nFrom customer support:   \n\"A customer is asking about this error message\"  \n → Before: Slack him, get answer in 5 mins  \n → Now: Engineers digging through code going \"maybe this...?\" \n\nFrom sales team:   \n\"I'm in a meeting, can this feature do XX?\"  \n → Before: \"Yes, but watch out for YY\" instant reply  \n → Now: \"Let me investigate... I'll get back tomorrow...\" \n\nThe worst part is seeing the engineering team burning out.   \n\"Another code investigation...\"   \n\"Spent all day investigating, no actual coding done\"   \n\"Honestly, I have no idea why half of this works the way it does\" \n\nBusiness teams are getting hesitant too:   \n\"They look busy, I feel bad asking questions\" \n\nBut they need answers to do their job,   \nand engineers' work stops every time they ask. \n\nHow do you all prevent this kind of single point of failure?   \nAlso, how much do you expect non-engineers to understand about how the product actually works?",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 540,
    "downs": 0,
    "created_utc": 1749822711.0,
    "media": null,
    "is_video": false,
    "num_comments": 199,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.62621226293856
  },
  {
    "score": 539,
    "title": "My 8 years of product lessons in one post",
    "selftext": "Lessons from my experience of working at 3 fast growing startups and from entrepreneurial endeavours.\n\n1. There are only two criteria for product success: Whether it solves a user problem well? Whether it helps business move forward?\n\n2. Users will only use the product if it solves problems in their lives, or addresses a desire, better than the alternatives.\n\n3. Business will move forward if it increases market share, or revenue, or builds competitive advantage.\n\n4. User Empathy is the no.1 skill you need as a product manager.\n\n5. Your team is the most important factor in your success. Fortunately, there are ways to learn to motivate and align people.\n\n6. Almost no product can satisfy all kinds of customers. Learn to separate noise from signals during user research and analysis.\n\n7. A product manager who doesn't talk to their users frequently, ends up becoming just a feature manager.\n\n8. On Stakeholder management: Involve leaders early. Get people to work on their ideas. Stand up for your team. Create a culture of meritocracy and quick feedback.\n\n9. Always decide on metrics before you start working on the feature. It's easy to fall for fundamental attributer error later.\n\n10. Quality of your mental health will reflect in the quality of your product. Working long hours all the time isn't sustainable.\n\n11. Always prioritize and filter before execution.\n\n12. Execution is an important skill, but shouldn't be the only skill that you have. Combine execution with strategy and see yourself grow.\n\n13. Asking the right questions is 90% of product discovery, and the rest 10% is structuring and analyzing your findings.\n\n14. Cracking a PM interview and doing a PM job well are two different things. That's a sad reality.\n\n15. It's possible to move from ANY DOMAIN to product management, but it's not easy.\n\n16. Do not be a slave of tools. Tools change, your expertise improves.\n\n17. Reflect often - feature is only failed if it fails to achieve metrics and you didn't learn anything from it.\n\n18. It's difficult to explain your job, even to your own team some time.\n\n19. All roadmaps change.\n\n20. Build relationships, and solid proof of work. This is probably not your last job or company.\n\nEdit 1: \n\nGlad that you folks found these so helpful.\n\nAs some people are asking for resources to improve their PM skills, here you go:\n\nList of recommended books: https://www.linkedin.com/posts/ankythshukla_productmanagement-books-activity-7071007721885507584-It1v?utm_source=share&amp;utm_medium=member_desktop\n\nJTBD, 5 Whys, First Principles and more resources in detail: https://hellopm.co/resources/\n\nHow to create a product portfolio: Super important for aspiring PMS: https://hellopm.co/product-manager-portfolio-guide/ + (How to become a PM in 2023: https://www.linkedin.com/posts/ankythshukla_how-to-become-a-product-manager-in-2023-activity-7059042609440145409-eClH/)\n\n50+ Awesome resources I've curated: https://ankits.gumroad.com/l/awesome-pm\n\nFeel free to reach out if someone is looking for any specific help.\n\nFellow PMs, What have been your major learnings in the product management career?",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 539,
    "downs": 0,
    "created_utc": 1686117669.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.291627987612761
  },
  {
    "score": 523,
    "title": "Here's how to be happy in Product Management",
    "selftext": "Accept reality as it is rather than how you want it to be.\n\nThe reality of Product Management is:\n\n- Features don't get built on schedule.\n- Priorities shift...often\n- Roadmap change\n- Stakeholders may not engage with your presentations.\n- You'll encounter resistance when proposing new ideas.\n\nYou will never be disappointed when you move in harmony with the nature of Product Management.\n\nYou feel disappointed, anxious, and unhappy in Product Management when you attach your happiness to outcomes.\n\n- If we launch on time, then I'll be happy\n- If the user adoption rate hits X, then I'll be happy\n- If I can finally ship this feature, then I'll be happy\n\nHappiness isn't something to chase only when things go perfectly.\n\nIn Product Management, there will be ups and downs.\n\nTrue happiness comes from enjoying the process, not just the end results.\n\nThink like a surfer: Every wave, good or bad is part of the ride.\n\nLet things be as they are.\n\nP.S. Keep your eye on the bigger picture but remember to enjoy the ride along the way.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 523,
    "downs": 0,
    "created_utc": 1731600780.0,
    "media": null,
    "is_video": false,
    "num_comments": 113,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.482783712651963
  },
  {
    "score": 498,
    "title": "When your product has an impact on the physical world",
    "selftext": "When your product has an impact on the physical world\n\nA lot of software people say that they want to work on a product that has the impact on the physical world. The problem is: your responsibility as a PM is much higher in products like these, see the screenshot.\n\nWhen I worked on an e-commerce website for a brand, sometimes we would release a feature that wouldn’t work well. We were doing quite shallow QA. \nWhen we were discovering eg buggy behaviour of add to cart button, we used to tell ourselves “that’s a nasty bug, but we are not working at the hospital, so this is not a big deal”.\n\nImagine working on a sewer management system, and letting in a bug that would release dirty water in the river. Or imagine doing an unintuitive onboarding for self-driving tractor module, so during the first launch the farmer would let the tractor hit the tree. Or imagine making a change to Tinder algorithm that makes certain group of people sad, and 0.0001% of them decide to commit $u!side.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 498,
    "downs": 0,
    "created_utc": 1683065435.0,
    "media": null,
    "is_video": false,
    "num_comments": 129,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.490072221776808
  },
  {
    "score": 493,
    "title": "A Lot of You Are Exposing Yourselves By Being Worried About ChatGPT.",
    "selftext": "So I was reading through this post yesterday [Is anyone scared of GPT plugins?](https://www.reddit.com/r/ProductManagement/comments/121owk7/is_anyone_scared_of_gpt_plugins/) and couldn't believe what I was reading. I don't want to mince words, so I'll just jump into it and hopefully we never have to talk about something as tired and boring as fear mongering about robots again (that's really where we are right now).\n\nIf you think that the reason you are valuable to your team and your organization is because you know how to...\n\n* Write sql/mongo/elasticsearch etc queries\n* Write user stories\n* Make a coherent slide deck\n* Write an interview script for user research\n* Pick copy for an ad\n* Evaluate the difference between a test group and a control group\n* Do market research\n* Wear clothes (seriously someone mentioned fear for fashion model jobs 🤣)\n\nYou were already doomed.\n\nTo those of you who are worried about a robot taking your job, I earnestly and urgently beg you to do the following. Not just for your sake, but for the sake of your teams and the companies you work for:\n\n* Read the following\n   * [Good PM/Bad PM](https://a16z.com/2012/06/15/good-product-managerbad-product-manager/) (but really read it this time and don't just dismiss the parts that \"aren't part of a modern PM's job anymore\")\n   * [Good GPM/Dead GPM](https://www.linkedin.com/pulse/good-group-product-manager-gpm-dead-talha-ko%C3%A7/)\n   * [High Output Management](https://www.amazon.com/High-Output-Management-Andrew-Grove/dp/0679762884)\n   * [Lean Startup Book](https://www.amazon.com/Lean-Startup-Entrepreneurs-Continuous-Innovation/dp/0307887898)\n   * [Endurance](https://www.amazon.com/Endurance-Alfred-Lansing/dp/0380006707)\n   * [The Hard Thing About Hard Things](https://www.amazon.com/Hard-Thing-About-Things-Building/dp/0062273205)\n* [Listen to this podcast](https://www.youtube.com/watch?v=0jIqF2_PFFM&amp;ab_channel=a16z) where Andreeson tells you why you're afraid of new technology and why every time there's new technology people freak out about it stealing their jobs.\n* Go to a conference or meetup (free) related to your industry and TALK TO YOUR CUSTOMERS.\n* Spend 3 hours watching every piece of content you can on LLMs on youtube, their history, how we got here.\n* Take a leadership course or something, IDK. Find a volunteer leadership position where you have to convince someone to do what you think is right and do that for a while. Church, PTA, kids baseball, I don't care. Just learn what it means to lead other people.\n\nAlmost 3 decades ago, Deep Blue beat Kasparov. 7 years ago AlphaGo beat Lee Sedol. We still play Go and we still play Chess. Why? Because at the end of the day it doesn't matter if a robot can tell you want to do and how to do it, because humans still have to execute on a robot's instructions to manifest them into reality. Modern passenger aircraft have autopilots and even auto landing systems (at airports with the right equipment) however pilots are still needed to monitor, to communicate and to take action when something goes wrong.\n\n**As a PM, your job, at its core, is a leadership position, not a technical one. Unless you think people are suddenly going to come around to the idea of taking orders daily from robots \"because they said so\" I'm 99.9999999999% sure we'll be fine.**\n\nSo please, I beg you, stop posting about being worried about chatGPT. All you're doing is reminding competent PMs that our jobs are secure. Or, you know what, ignore this whole post. Go back to worrying and not learning about how to use it to your advantage. The rest of us will thank you.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 493,
    "downs": 0,
    "created_utc": 1679785522.0,
    "media": null,
    "is_video": false,
    "num_comments": 111,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.415835960258738
  },
  {
    "score": 479,
    "title": "A little documentation hack for my fellow PMs with ADHD",
    "selftext": "If you're like me, writing documentation may be the bane of your existence.  I've always found it easier to talk something out vs write it out, and when it comes time to document something I hit a mental wall.  \n\nMy boss will sometimes send voice notes in Slack which gets auto-transcribed. So I got the idea to send myself voice notes going over everything I wanted captured in a document and having ChatGPT do the heavy lifting of editing and formatting. And it's been amazing! Something that would have taken me 1-2 hours (most of which is just staring at the screen yelling \"Just write it out!\" to myself) now takes 10 minutes. I've also found a GDoc extension that handles the markdown formatting from copy/pasting from ChatGPT. \n\nObviously I need to go back and edit some things, but it's been doing a good job of capturing my voice and removing a major hurdle I've always had in my career. \n\nI'm considering recording more zoom calls to have that transcription turned into meeting notes as well.  ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 479,
    "downs": 0,
    "created_utc": 1724987698.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.301678665211833
  },
  {
    "score": 478,
    "title": "Amazon RTO 5 days a week",
    "selftext": "I’m curious from some of you who might work for large Tech companies remotely, do you think this practice of calling all employees to the office 5 days a week in-person will continue? Has anyone already been forced to decide to move or quit? \nI’m a PM working at a large company in the finance industry who is open to one day working for a company in the Tech sector. I’m not too keen to move out of my MCOL city, so working remotely opens a lot more doors. Anyone else in a similar scenario? ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 478,
    "downs": 0,
    "created_utc": 1726519117.0,
    "media": null,
    "is_video": false,
    "num_comments": 150,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.489823987061148
  },
  {
    "score": 475,
    "title": "Technical jargon for PMs",
    "selftext": "I've seen a few post in the last few days asking about improving tech skills, so I wrote up a quick guide. \n\nMy personal opinion is that coding is optional as a PM but understanding the basics goes a long way in effectively communicating and managing risk. Hope this helps!  \n  \n\\--  \n**How internet software works**\n\nAs a quick reminder, all internet software products follow the same core patterns. They have 3 main components:\n\n1. Client – what your users interact with. Eg: website, mobile, tesla, smart fridge\n2. Server – processes requests to fetch and store data or perform actions, like syncing your google calendar\n3. Database - permanent storage of data\n\nEach section can be expanded into many smaller components. A lot of thought and effort goes into building scalable, well-organized software products. Let’s dive into those components and what they mean.  \n\n\n# Frontend\n\nOur frontend application refers to the code the user interacts with directly. This code can be written in different programming languages depending on the platform (web, mobile).\n\nThis code is distributed to the user by connecting to a website or downloading from the app store.\n\nThe simplest front end stack for the web is **HTML, CSS, and Javascript**.\n\n**HTML** is the structure of the page, outlining the order items appear in.\n\n**CSS** is the styling like fonts and colors.\n\n**Javascript (JS)** is the interactivity that allows you to play an animation or load new data on a page.\n\nWeb development has evolved as applications have become more complex to use frameworks. These frameworks provide tools to help developers organize their code better.\n\nCommon frameworks for front end web applications include **React, Vue, Angular,** which allow developers to split up their code into reusable components.\n\nIn order for your frontend application to get information from your database, it needs to send **HTTP requests.** These requests are received by your backend server and processed.\n\nCommon requests include:\n\n**GET -** retrieve information\n\n**POST -** submit information\n\n**PATCH / PUT -** update information\n\n**DELETE -** delete information\n\n  \nWhen your client submits a request to the backend server, it sends it to an **endpoint.** An endpoint is a location that has been set up to receive this request, like a mailbox that is created to receive letters.\n\neg: GET /weather \n\n# Backend\n\nYour backend contains all of the technical infrastructure. This code is not distributed to your users –  it stays isolated from the rest of the internet. The only way to access it is by making API requests. \n\nYour backend is likely hosted in the cloud by providers like **Amazon Web Services (AWS), Google Cloud (GCP), or Microsoft Azure.**\n\nThese services allow you to rent components of your backend application stack like your database or server. There are many components available for rent that can be connected together like legos to solve various problems. \n\nWhen you rent these services, you temporarily buy the use of some software and computing resources. You can add or remove resources based on your needs at any time.\n\nCommon examples include:\n\n* **API Gateways:** A service that receives API requests and sends them to other servers in your backend\n* **Caches:** A faster, more expensive data store. Used to speed up retrievals of commonly requested information from your database\n* **Queues**: If you are getting too many requests at the same time, or want to limit how many requests you send out, queues allow you to store requests until you’re ready to process them.\n* **Content Delivery Networks (CDN)**: Storage of files that don't change, like images and videos, around the globe to speed up load times for users \n\n# Scaling\n\nThe backend of a product that supports 10M+ users will look very different than 1000s of users. In order to handle additional users, we need to scale.\n\nScaling refers to adding more resources to our backend and adding new components to make sure nothing breaks under load. \n\nThere are two types of scaling:\n\n1. **Horizontal scaling:** This means adding more than one machine to do the job. For example, go from 1 to 10 servers to handle API requests from our users.\n2. **Vertical scaling:** This means making our machines better by spending more money on hardware. For example, renting a computer with 4GB of memory instead of 2GB.\n\nWhen we scale, we have to consider the impact on the entire system. It’s not uncommon that adding more resources in one area creates a bottleneck in another.  \n\n\nAs we increase scale, we may also need more components to help make our backend more stable. Each step in the sequence may be able to handle a different number of maximum requests. This is where adding queues can be helpful.\n\nIf our product has any interactions with other SaaS companies, these are built on our servers as well. These integrations are built with API requests between servers, rather than between client and server.\n\nFor example, if we wanted to integrate with Google Calendar, we would send a GET requests to retrieve our user’s calendar events.\n\n\n\nSome more common terms used in backend systems and scaling include:\n\n* **Pubsub:** A queue. A message is sent in to the queue (published) and one or more servers can receive it (subscribe)\n* **EC2:** A product offered by AWS to run a server (Elastic Compute Capacity)\n* **S3:** A product offered by AWS to store files (Simple Storage Service)\n* **SQS:** A product offered by AWS to run a queue (Simple Queue Service)\n* **SES:** A product offered by AWS to send emails (Simple Email Service)\n* **Lambda:** A product offered by AWS to rent a server for a very short period of time\n* **Containers:** Document everything you need to run your application in one file\n* **Kubernetes:** Deploy a container to a server and manage all your servers automatically\n* **Batching:** Grouping requests together instead of sending them one at a time\n* **Rate limit:** The maximum number of requests that can be processed in some duration\n* **Microservice:** A set of resources (server, database, queues,etc) that are built to do a specific task, like handling billing, notifications, recommendations, etc.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 475,
    "downs": 0,
    "created_utc": 1734379282.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.333773200936127
  },
  {
    "score": 474,
    "title": "I just vibe coded my way to win the hackathon at the eng offsite",
    "selftext": "Attended an Eng offsite as a PM with about 300 engineers and we did a hackathon. I vibe coded a new product and ended up winning! I’ve participated in both internal and external hackathons before but always felt like I couldn’t contribute much (like the kid who shows up to the group project but doesn’t do anything). \n\nSome of the engineers couldn’t believe I did it. \n\nI think it’s a huge miss to think you can’t build more than prototypes. \n\nUsed lovable for front-end + Claude code in the CLI for backend + cursor for some deployments. The DevEx team is going to clean up the product and release it as a tool for customers. ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 474,
    "downs": 0,
    "created_utc": 1753417812.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.360757536424716
  },
  {
    "score": 475,
    "title": "Some tips from a hiring manager (APM to SPM) ",
    "selftext": "I've recently started a new role running Product, Design and a few other more random bits and pieces.  I'm currently hiring product roles from Associate PM to Senior PM. Wanted to provide some insights on what to not do and what to do, based on my experiences. \n\nI know it's a rough market out there at the moment, I got 700 applications in the first week across the 3 roles. There's a few things that have consistently worked to get candidates interviews, and a few things that have prevented them. \n\nDisclaimer: this is anecdotal, and personal opinion. I'm not every hiring manager. \n\nResumes:\n\n- I spend 3-5 seconds max on a resume to determine whether to read it or move on. If I can't easily scan it and see stuff that interests me, I won't go further. Make sure people can quickly see company names, major achievements, a clear structure etc and it doesn't look dense and hard to read. \n\n- About 5% maximum are 1-pagers. Almost every single 1 page resume ended up on my shortlist. Anything that was 3 or more was an auto rejection (I manually review every application, a harsh reality of that is I need some arbitrary filtering.)\n\n- I know what a product manager does. Every word you spend describing the duties of your role is wasted. Just focus on outcomes, results and anything specific about the role that shows you're well rounded. If you did zero-to-one, say that. If you worked with ML models, say that etc but don't tell me you managed a backlog, determined vision and strategy etc. I know that because it says you were a PM at Amazon right there...\n\n- Skills sections should be actual skills. If you're a PM who can code, write SQL etc, this is where you put it. Fundamentals of being a PM aren't skills to list here, and neither is \"Microsoft Office\"\n\n- intros / about mes are 95% identical. I pick up on the 5% that aren't.  Either don't have this section, or say something unique about your approach. Hardworking, strategy and execution focused etc, everyone says that, it's not helpful to me. If you think PMs have lost sight of commercial focus, and you're an andidote to that, I want to hear it. If you're a podcaster or blogger, tell me and link me etc. \n\nGeneral application stuff:\n\n- You don't always need a cover letter, but if you're not a PM currently and you're applying for an APM role, for God's sake tell me why you want to be a PM eitger in your resume or in a cover letter. \n\n- I can tell when you've read something generic online about how to write a cover letter (or how to land a job in general) - 90% of cover letters look like a box ticking exercise. They all start by listing out my company's values and then saying they resonate and are important, and then they say I think I'm really qualified bla bla bla, I have done x, y and z bla bla bla...\n\nIt usually seems insincere.  I'm not giving points for the presence of a cover letter, or for Googling our values. If the values actually resonate, tell me why really specifically. Which one? What is it that you do or feel that makes that value exciting for you? I'd estimate this will actually be true for like 5% max of the companies you apply for. Also, if they're intriguing, don't be afraid to literally ask a question in the cover letter about it. In general, I've seen 1 cover letter with a question in it (they gave a perspective on strategy and asked if we thought it made sense) and it landed then an interview because I was excited to answer the question. If you're writing a cover letter, do it because youve really got something to say. Maybe you are really passionate about the company or industry, definitely tell them that and why. Maybe you've just got an excellent sense of humour that you can convey in it, as mentioned before, if you're making a career change, tell us why, I don't know - just use a cover letter if you've got something interesting to say. If you don't, it's not going to be held against you, I don't NEED people who love our boring industry. \n\n- If you know somebody at the company, get them to refer you by talking to the hiring manager of Head of. If we've interacted before, ask for some time to talk before applying.  If you have no connection whatsoever, the advice people give about going direct to the hiring manager I think is bad. I can't skip my process for you because you sent me your CV on LinkedIn, I think this has only worked once, and it was because it was somebody overqualified who wanted to talk about growth opportunities before applying.\n\n- Please, please don't try to guess someone's work and personal email address, it's creepy and it is 100% guaranteeing you don't get an interview.  I've had several people do this. \n\nInterview \n\n- We do full loop, no take home work. If it's clear you've put zero effort into preparing, even if you do quite well, it's noticeable and will get you knocked down\n\n- have good questions. Make sure you've got questions specific for the leaders and for your peers. We are all suckers for talking about what we love. People that use this time as an opportunity to put hypotheses about the industry and product to me and get my opinion leave a good impression, as to people who want to dig on my strategy.  The more you turn this into a back and forth conversation, the better. \n\n\nHope this is helpful and happy to answer any Qs. \n\nAssuming this elicits some interest in my open roles, that are based in Toronto, 2 days a week in office, need to be eligible to work in Canada already. I'll send company name in DM if you want to apply. ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 475,
    "downs": 0,
    "created_utc": 1728558750.0,
    "media": null,
    "is_video": false,
    "num_comments": 137,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.475046495921111
  },
  {
    "score": 456,
    "title": "After 6 years of PMing - I have a strange feeling",
    "selftext": "&amp;#x200B;\n\nI have a strange feeling that product management is a fake profession. PMs do not have clear requirements that are the same for all companies - some companies want you to be design-oriented, others data-oriented, or technical. Some want you to be the “voice” of customers, while in others you work on feature factories as a good old blue-collar boy. There are no clear hard skills other than reading and writing. There are numerous debates - product sense vs data sense, execution vs intuition, first principles thinking vs frameworks. And my favorite one - leading without authority. The skillset is so vast that Lenny’s needs to do polling to understand what’s even in area\n\nSomewhere, the product is responsible for the business and P&amp;L, and somewhere you are responsible for grilling the steak of your stakeholder. In the company next door, the product manager moves tasks in Jira and calls the elders in case of any problem. While dev - code, designers -design. We are doing something vague and thin that we even can't agree what exactly we are doing.\n\nAnd every PM influencer in twitter - starts  punch line with a \"many companies are making mistakes thinking that PM is... \"\n\n&amp;#x200B;\n\nMaybe I’m missing something?",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 456,
    "downs": 0,
    "created_utc": 1694194851.0,
    "media": null,
    "is_video": false,
    "num_comments": 163,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4723381240936995
  },
  {
    "score": 442,
    "title": "The weirdest part of PM: your success depends on how others see your job, not just how you do it",
    "selftext": "I learned this the hard way a few years ago. I was grinding through delivery, shipping sprint after sprint, cleaning up messy backlogs, unblocking engineering… basically doing all the “real” work that keeps a product moving. I thought it spoke for itself.\n\nBut when review season came around, my manager’s feedback was: “solid execution but not strategic enough”. I couldn’t believe it. The team was hitting goals, customers were happy but upstairs it looked like I was just… busy.\n\nThat’s when it hit me: nobody actually knows what PMs do unless you make it visible. To eng, you’re a project manager. To sales, you’re support. To leadership, you’re either a mini CEO or feature factory operator. If you don’t actively shape the story, people just fill in the blanks.\n\nIt’s not about bragging, it’s about framing. “We reduced churn by 10%” lands a lot harder than “we rebuilt the dashboard”. Same outcome, different perception. And perception is what sticks when decisions get made about promotions or opportunities.\n\nTook me way too long to figure that out. Now I spend almost as much energy showing the impact as I do driving it. Doesn’t feel natural but ignoring it cost me years.\n\nAnyone else been through this? ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 442,
    "downs": 0,
    "created_utc": 1757329484.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.313065156283297
  },
  {
    "score": 440,
    "title": "To the Apple Photos Team:",
    "selftext": "I hope you step on legos. \n\nWho ever approved this needs to be fired. I no longer can rapid fire off memes because my various reaction meme folders have been changed. \n\nA bit of an overreaction, but no seriously, it’s a horrible CX and I know Steve is rolling in his grave watching Apple repeatedly screw up. Launching a product (iPhone 16 Pro) without the main feature being pushed. . . Steve would’ve let the entire department go for that. ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 440,
    "downs": 0,
    "created_utc": 1733955474.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.331477635655876
  },
  {
    "score": 423,
    "title": "Companies Fake Hiring ",
    "selftext": "Market is still tough boys and girls and it’s been ten freaking depressing months since I last worked as a principal product manager building enterprise software SaaS products.\n\nHere is a list of fake hiring companies I want to share with those looking so you don’t waste your time. \n\nWhat qualities does a fake hiring company have ? Here you go:\n- reposts job over and over\n- changes requirements for same job after going through final interview\n- job requirements were inserted into test resume using AI to make it super attractive for recruiters and ATS and then compared to real resume with no AI help , no call back\n- company is laying off but still hiring , hmmm\n- hiring internal only but wanted to show they have a job to mess with you knowing you have no chance\n\n\nSo here is my list: (product management roles )\n- Ford Motor \n- Workday\n- Workiva\n- Gusto\n- Nice \n- OneTrust\n- Equifax\n- Workday and Ford again because they are repeat offenders \n- Walmart \n- Capital One\n- Mastercard \n- Microsoft \n- Atlassian\n- Ivanti\n- Altruist - they literally have a dumbass running product who only knows trading markets and offerings in the mutual fund world but he knows nothing about product and tech so don’t waste your time with this idiot \n- DoorDash\n- Rocket Money\n- MongoDb\n- Autodesk\n- Twillio \n- Zendesk\n- Zillow\n- US Bank\n- IXL Learning\n- Duolingo\n- Morningstar\n- Coindesk\n- Affirm\n- Angi\n- Toast\n- Hims\n- Lattice\n- EzCater\n- Aha, they are using their listings for lead generation. And their roadmaps suck ass and no pm should ever want to use them , it’s like using notepad notes as an IPad , it’s that bad \n- CoStar - smart ass product leadership that will give you a dumb what if scenario on last interview to trick you\n- Circle\n- New Relic\n- Group1001 - they have a very immature product org ran by someone who comes from a scrum master background, let that sync in. They are in “pods” and when they interview pms they aren’t looking for pms , the questions the dev team asks are more so for product owners or project managers because this is their first company and they have never worked with a real product manager so run away from this company!\n- EvenUp - they have a bunch of opportunities but they don’t give you detailed requirements on what an applicant should have as far as experience, instead they keep it cool and very generic so when they reject you , you ask “what the hell?”\n- FleetIo - the vp of product Esteban is on LinkedIn stating he is hiring under a post from Petra Wille , she is legitimately trying to help people get hired , but this fool Estebannnn has roles that are easy and he will not hire and the jobs are always open. The problem here is that you have a person in power not looking to qualify someone, he is looking to disqualify anyone and that’s not the way \n\n\n***Disclaimer- some of these companies may have hired for some roles but not for ALL the constant reposts and others will interview the hell out of you and then after making you feel good like you will join they will send email early morning saying we played you essentially \n\n\nHope this helps you save time and I’m praying and hoping we all work one day soon and the depression turns into joy one day really soon for all of us !\n",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 423,
    "downs": 0,
    "created_utc": 1710621685.0,
    "media": null,
    "is_video": false,
    "num_comments": 224,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.523457115648414
  },
  {
    "score": 421,
    "title": "The next time someone posts about sexism in this sub...",
    "selftext": "Folks, sexism exists. It is very common in the IT industry. Women are a small minority in most tech companies, and being a minority really has an impact on your experience working somewhere.\n\nI'm referring to [this post](https://www.reddit.com/r/ProductManagement/comments/14ca9pq/comment/jorez19/?context=3), where the initial version contained very few details about the OP's situation, and most of the comments were quick to dismiss the OP's experience, even with very limited information. And this came from both men and women.\n\nWhen someone posts here about sexism, **please at least try to imagine their experience is valid** (because it is). Please don't immediately conclude that it's most likely incompetence, or inexperience, or anything else people were saying in that thread. Please at least start with the idea that the person's experience is valid.\n\nAnd if you don't want to, maybe just ignore the post? It doesn't help the OP or anyone else to perpetuate the dismissiveness and contempt most women in tech face every day.\n\nEDIT: Typo",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 421,
    "downs": 0,
    "created_utc": 1687258421.0,
    "media": null,
    "is_video": false,
    "num_comments": 241,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.447220133951889
  },
  {
    "score": 402,
    "title": "Opened new PM role; 750 applicants within a week",
    "selftext": "We just hired a new PM where I work (SaaS, public, B tier, product led company). We had over 750 applicants before closing the rec within the week.\n\nThe person hired was a referral who had worked with two of us before. They’re great, but I’m not convinced they were the best out of all 750+ applicants. But no one has capacity to look through all those apps.\n\nIt’s tough out there for those seeking new roles… how do folks without a good network ever find something? How do folks without a good network field the mountain of prospective hires?",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 402,
    "downs": 0,
    "created_utc": 1711149608.0,
    "media": null,
    "is_video": false,
    "num_comments": 195,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.486433081819348
  },
  {
    "score": 402,
    "title": "Kind of done with Product",
    "selftext": "I've been at it for 20+ years. I've designed, built, and shipped some respectable digital and hardware products around the Globe. I’m unsure if I’m completely exhausted (one of the many challenges of long-term product management) or if I’ve just ticked the box, but I’m ready to wrap it up. This is, at times, a completely thankless role that doesn’t repay in kind for the skill and experience required to do it well. I had two significant burnouts during my tenure. I’ve slowly realised that product management is a thankless and, at times, an impossible task that requires so much energy and effort. \n\nSo, as I consider my plans and goals, feel free to ask me anything you might want to know about this career type. \n\nEDIT ✍️: So sounds like this post kicked off some interesting discussions. A lot of you folks are PMing me and asking great questions. As far as what I intend to do next I’m not sure 🤔 However I feel if people see value in it I’m happy to dedicate some of my time and experience to helping others if I can. Not sure if anyone is interested but I might setup a Whatapp Group or direct message system for people to ask me questions and I can try help. I find leaving voice notes more efficient than long text messages or scheduling calls. ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 402,
    "downs": 0,
    "created_utc": 1735485141.0,
    "media": null,
    "is_video": false,
    "num_comments": 198,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4897315843459635
  },
  {
    "score": 403,
    "title": "Steal my product updates to my leadership, I've been told they are great! (example deck included.)",
    "selftext": "By request, first here's the update I give (6 slides + some stats for details) to the SaaS Group Board leaders I report to. I share this with my \"boss\" on a bi-weekly basis. Would love to hear your ideas to make it even better.\n\n**I think senior leaders care about 3 things essentially:**\n\n1. **People:** state of our staff and their productivity or bottlenecks.\n2. **Product:** discovery learnings, roadmap progress, and recent impacts (leading).\n3. **Pay-offs:** business outcomes we see (lagging).\n\nIn the conversation part, I share things I need from the leaders, and we make plans together.\n\n# Here's what the outline of my deck looks like:\n\n1. **Agenda:** exec summary of the content in 1 sentence per slide.\n2. **People:** exec summary of how my folks are doing both in delivery and in happiness.\n3. **Product:** exec summary of **now**, **last**, **next** order to show what's ready to release, recent results, &amp; next steps. I prefer to use TARS to show impact in my stats.\n4. **Pay-offs:** exec summary of business impacts mostly lagging metrics.\n\nHere's what I write....\n\n[**And here is a sanitized sample google deck**](https://docs.google.com/presentation/d/1YYNurjfdJ4K67mElbsVF_Lk1bkU_IsxXVNmVcuhQQsA/edit?usp=sharing) **- literally built off my** ***real*** **reporting.**\n\n# 1. Agenda\n\n&gt;*For each \"P\" I give a 1 sentence exec summary. Sometimes I include \"Process\" if we're going through a lot of changes internally/ops.*\n\n***EXAMPLE OF THE CONTENT***\n\n* **People:** Mid-year reviews done, staff survey results were good.\n* **Product:** AI bets increasing CSAT, public beta in August, GA in Q4 on track.\n* **Pay-offs:** Churn down 1% QoQ, ICP sign ups +10% MoM, Conversion rate +2% MoM.\n\n# 2. People\n\n&gt;*I do a monthly anonymous team health check that measures the team across 10 core aspects. During review or hiring periods, I include those updates as well.*\n\n***EXAMPLE OF THE CONTENT***\n\n* **Mid-Year Reviews:** All are now complete, progress across the board especially {highlights}, work still needed in {lowlights}.\n* **Monthly health check:** Overall happiness is 80% 5/5, 20% 4/5, so good! Eng staffing still progressing slowly, team collaboration cited as going well.\n\n# 3. Product\n\n&gt;*I like to talk about it in terms of Now, Last, Later. I give some TARS metrics which are mainly leading metrics to speak about impacts of last cycle's work. Sometimes I check back on the past 2-3 cycles if some of the items require longer adoption rates. I always include mixpanel or amplitude links and graphs.*\n\n***EXAMPLE OF THE CONTENT***\n\n* **Now: In progress &amp; ready to launch: Green.**\n   * Focus is on {impact}, and we're on track to deliver our current scope by {date} including {project 1, project 2} (list all projects).\n* **Last cycle:** Focus is on {impact} and the Impact is green. Goals met include:\n   * **Project 1: Green** because adoption is {stat}, feature sat {stat}, impact to conversion {share that here if it applies}.\n   * **Project 2:** **Yellow** because adoption is slow {stat} but feature sat is high {stat}. To get to green we must promote it more to (audience).\n   * **Prev cycles: Green** because projects from the 2 previous cycles have continued growth as we anticipated. (or maybe they don't, in which case say why &amp; what need to do).\n* **Next cycle:** Coming up our focus is on {impact}. Projects planned include:\n   * Project 3: goal &amp; impact desired (TARS format - target/adoption/satisfaction first)\n   * Project 4: goal &amp; impact desired (TARS format - target/adoption/satisfaction first)\n\n# 4. Pay-offs\n\n&gt;*I look at a set of metrics I am calling the A-C-E method because I just don't like the ones out there right now. I bold key statements so it's very browsable.*\n\n&gt;***ACQUISITION:*** *What is our ability to see new interest in our product and sign ups in our ICP.*\n\n&gt;***CONVERSION:*** *What is the new business conversion or growth rate across our segments.*\n\n&gt;***CHURN:*** *analyze the churn or contraction rates across our segments.*\n\n&gt;***ENGAGEMENT:*** *what is DAU/MAU and the success/completion rate of our key flows that show good customer health.*\n\n&gt;***ECONOMICS:*** *how is our MRR, ARR, margin, EBIDA, and profit ratios - are we meeting our economic goals.*\n\nHere's the example (note this is not real data):\n\n* **ACQUISITION: GREEN** because **sign up rate is {+X% MoM}**, and our **ICP is {X%}** of those. Main channel for acquisition is {channel} and most growth is in {package}.\n* **CONVERSION:** **YELLOW** because the **SEO CTR is low over the past 2 months**, but we are seeing upticks in AEO by {x%} that are promising.\n* **CHURN:** **YELLOW** because while decreasing by 2% over the past 3 months compared to April, fluctuation is still a risk. Churn highest on segment {name of segment} because {reason}. To get to green, we will continue current shift and expect to see the churn rate stagnate at {X%} by {Date}.\n* **ENGAGEMENT:** **GREEN** because adoption of our new features hit targets, and retention is maintaining MoM. Feature sat surveys are above {#} on average. MAU on target for the past 2 months {#}.\n* **ECONOMICS: YELLOW** MRR fluctuated slightly last Q but is rebounding in the past 2 months, we're still slightly behind our sales targets and EBITDA is suffering due {REASONS}.\n\nHope this helps you know how I think about our team/product/business impacts. Feel free to share yours for the benefit of the community, and also myself :)",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 403,
    "downs": 0,
    "created_utc": 1754497041.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.234046282615989
  },
  {
    "score": 395,
    "title": "Instagram repost button shows poor product management",
    "selftext": "Not only does it get released without any warning or one-time informative button, but it also is placed right where comments were(most people are mistakenly pressing the repost option instead of the comments button), but it basically doesn't even have a good animation to make it clear you have indeed,  reposted something. The white can barely be seen on most videos. Bad UI/UX experience for a feature that could have been implemented in a much smoother way and without replacing the location of the comments that is very widely used, causing frustration. ",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 395,
    "downs": 0,
    "created_utc": 1754913026.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.238232587275926
  },
  {
    "score": 391,
    "title": "Duolingo's product-led org handbook",
    "selftext": "Yesterday Duolingo's product team published their operational handbook, which I thought was pretty cool. You can find it here: [https://handbook.duolingo.com](https://handbook.duolingo.com)\n\nThey break down their five key operating principles:\n\n1. Take the long view\n2. Raise the bar\n3. Ship it\n4. Show don’t tell\n5. Make it fun\n\nSome are fluffier than others (they identify that although they are a 'product-led org', they try to have principles that apply to the entire org which, imo, waters them down a bit), but I do like these 2:\n\n# Principle #3: Ship it\n\n*“For a good idea to become reality, we need to move with a sense of urgency. So Go, Go, Go!”*\n\nOne of the things I love about Duolingo is that they always seem to be experimenting. They're quite known for that in the product community, likely thanks to people like Ali Abouelatta, PM at Duolingo, and his 'First 1000' newsletter &amp; Lenny’s guest post by Duolingo’s ex-CPO Jorge Mazal covering Duolingo's experimentation process (he's done more posts on Duolingo since).\n\nI really respect fast-paced product work, it's interesting to see it cemented in their principles.\n\n# Principle #4: Show don’t tell\n\n*“We use clear, concise communication that is grounded in data and real impact.”*\n\nThis one doesn't surprise me given how intuitive the app is. They clearly know how to show, don't tell. I like this quote in the handbook:\n\n\"The best way to present work is to pretend you’re showing it to real humans who use Duolingo. Users won’t read through long decks — they just want to see the thing.\"\n\nI find it fascinating that a $17B company shares this kind of 'behind-the-scenes' insights. Reminds me Valve's leaked employee handbook back in the day, or Roblox's.\n\nFun stuff. Thought you might enjoy it.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 391,
    "downs": 0,
    "created_utc": 1739287980.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.230558034791391
  },
  {
    "score": 388,
    "title": "The most unexpected part of my career so far",
    "selftext": "I thought I’d be spending my days building, designing, and strategizing. I imagined I'd be in flow states, cranking out specs and solving complex user problems. But the most unexpected part of my career as a PM has been realizing how much of it is just explaining the same thing in different formats to different people.\n\nThink about a single feature. You explain it to your dev team with a spec and user stories. Then you explain it to the marketing team for a blog post, highlighting different benefits. You explain it to the sales team for a one-pager, focusing on how it helps them sell. You explain it to your leadership in a 3-slide deck, and you explain it to your customer support team for an internal knowledge base.\n\nIt’s all the same core thing, but each audience needs it framed differently, with different details and a different tone. It’s less like building a product and more like being a professional translator for your own work. It feels like you’re constantly re-writing the same story, just in different languages for different countries.\n\nAnyone else feel this? If yes, thenHow do you handle these things?",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 388,
    "downs": 0,
    "created_utc": 1758709430.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.234721569096642
  },
  {
    "score": 385,
    "title": "Is this the future of prototyping &amp; UI design? First look at OpenAI's 4o image model",
    "selftext": "Okay, so OpenAI just dropped their 4o image model, and holy crap, its a big deal for UI design. Here are some initial impressions.  \n  \nAI generated images have bene a thing for a while now, but the've all been useless for UIs for two big reasons.\n\n1. AI image models suck at text.  \n2. Models can't handle edits, i.e. making changes based on previous interactions.\n\nWhile not perfect, 4o is a step change on both of these. \n\nThis is what it came up with based of a very simple prompt \"Create an image of the listing screen for a hotel booking app.\"  \n\n\nhttps://preview.redd.it/ubfnke8h65re1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=e470acdbf7d4c5443865695a36bc61f9b6f9fa18\n\nOn first glance, the design is clean and intuitive. What immediately stood out was the quality of the text generation. While previous models would jumble letters into gibberish, spelling here is spot on. The other thing to mention is that alignment and kerning is close to perfect as well. This alone was a promising start.\n\nBut real design isn't one and done, it's about iteration. Other than a list of hotels, there were no other elements in the initial design so I made this the next prompt.\n\n\"Add a tab bar at the bottom of the screen so users can navigate between different views of this app.\" \n\nHere is the result...\n\nhttps://preview.redd.it/hpjbvar485re1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=d2dcce09eebcde5ec6bede792a3f0554341426cd\n\nI think the 4o model nailed it. The tab bar appeared with a logical layout, crisp icons, and readable labels.   \n  \nAlso notice that the photo thumbnails, text and ratings all remained consistant from the previous image. Unlike previous models that treated each prompt as a standalone task, generating disjointed outputs, 4o maintains a memory of its prior work. This ability to build iteratively unlocks AI as a tool for prototyping and UI design and will redefine how teams work moving forward.  \n  \nAs the next challenge, I wanted to see how it handled working with different component libraries so I promoted it to...   \n  \n\"Update the style, use components from Shadcn, a popular component library.\" This is what it came up with.\n\nhttps://preview.redd.it/aw8lq5en95re1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=31964de6c375c973c32aa491a8720954e390f8c8\n\n  \nThe result was a solid stylistic overhaul, though it inexplicably dropped the main menu from the previous iteration. This hiccup suggests that 4o is not infallible.  \n  \nOne practical note. Generating each image takes about 30 seconds to a minute so its not exactly \"fast\" in the AI sense. To optimize this, I experimented with bundling multiple changes into a single prompt:   \n  \n\"Styling and layout is spot on. Tasks for next iteration.   \n  \n1. Add a tab bar at the bottom of the screen to navigate to different views of the app. 2. Add a filter icon in the search bar.   \n3. Add some icons to each of the hotel cards that represent amenities available at each of these hotels.\"\n\nhttps://preview.redd.it/kjb8h7naa5re1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=40d2102821b1ad38efabfe458dd658e0846ed0d0\n\n  \nWhile 4o did perform all 3 tasks, on closer look revealed some flaws. The amenity icons were poorly positioned, and the booking tab icon is a bit funky. These are fixable with further prompting, but they highlight areas for refinement.\n\nCurious about its range, I asked for a lo-fi mockup of the same design. \n\nhttps://preview.redd.it/awxndo2sa5re1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=d4b21d2a3e64a363c8049f09b0dea6c45038957a\n\nAnd a desktop version:\n\nhttps://preview.redd.it/jxw4hghwa5re1.png?width=1536&amp;format=png&amp;auto=webp&amp;s=ed01fb729010af212d4fa9fee9c9988c31969997\n\nThe point of this post was to test AI's capabilities as a prototyping tool. It drops stuff sometimes, screws up icons and is definitely not 100%. But the way it builds and iterates is unreal. For rapid prototyping, this could be a total shake-up. Design’s about to get a lot more accessible.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 385,
    "downs": 0,
    "created_utc": 1743043795.0,
    "media": null,
    "is_video": false,
    "num_comments": 106,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.32877919351436
  },
  {
    "score": 374,
    "title": "4 month job search - things do get better!",
    "selftext": "My 4 month search in a very tough market. I have 7 YOE (all in PM). Switched jobs 2 years ago, where I applied to 6 different roles, and received 3 offers. 2 years later, I’m around 3/125 lol. Mostly found roles on Linkedin, but also searched on company portals. 0 networking and 0 referrals unfortunately, which I’ve heard doesn’t really help much anyway in this market. \n\nI mass applied with a decent resume at first and saw some traction, but things weren’t really reaching the next interview/round. I then decided to craft 3-4 versions depending on the industry, domain, and work I was applying for (strictly PM roles). That’s when I saw more recruiter calls, and also fell into a better rhythm interviewing. A few harsh rejections and ghostings along the way; really puts you back mentally when you prep and study hard for them. BUT, things do turn around. Keep pushing if you’re out there searching, it’s honestly a numbers game.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 374,
    "downs": 0,
    "created_utc": 1686765787.0,
    "media": null,
    "is_video": false,
    "num_comments": 123,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.355742110308837
  },
  {
    "score": 369,
    "title": "To junior folks, please stop lying and be honest in your interviews.",
    "selftext": "I am hiring a PM and just rejected a candidate who was evidently reading out from ChatGPT.\n\nAll their responses were accurate textbook definitions, all the right buzz words, and I could see them typing in and clear eye movements signalling me that they were reading through.\n\nInstead of calling out their bullshit, I started to grill them further in a specific topic and I was amazed on quick they were to enter the prompt in the GPT and read out the responses. After a certain point, they were unable to defend/justify their rationale and kept blabbering.\n\nTo all the junior folks who are actively interviewing, please be honest by mentioning whenever you don't know anything. We would appreciate and respect that more than lies. It's easier to detect bull crap than you think.\n\nA lot of times, we expect you to not know things and ask clarifying questions. We often screen for whether you are able to think right or not, everything else can be taught and we are ready to invest in such candidates.\n\nThat's all folks! I hope you all land your dream gig soon.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 369,
    "downs": 0,
    "created_utc": 1689173509.0,
    "media": null,
    "is_video": false,
    "num_comments": 123,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.297412566648113
  },
  {
    "score": 368,
    "title": "Top 5 things I learned in 10+ years of product management (the hard way)",
    "selftext": "I’ve been in product for over a decade, across B2B, SaaS, some messy startups and one too-big-to-move enterprise. I’ve shipped things I’m proud of and plenty I’d rather forget.\n\nHere are 5 lessons that stuck with me, not from books but from actual scar tissue:\n\n**1. Alignment isn’t a meeting. It’s a process**  \nJust because everyone nodded in a kickoff doesn’t mean they’re on the same page. Real alignment happens when you revisit priorities after things get messy, not just before.\n\n**2. No roadmap survives real stakeholders**  \nThe roadmap is a negotiation tool, not a contract. Sales will bring last-minute deals. Leadership will shift direction. Good PMs don’t just manage the plan, they manage the expectations around the plan.\n\n**3. Most blockers aren’t technical**  \nThe hard part is rarely engineering. It’s clarity. It’s approvals. It’s lack of ownership. The best product teams I’ve worked with weren’t the fastest, they just had fewer silent bottlenecks.\n\n**4. If you don’t define success, someone else will**  \nEvery feature, every project, every launch – define what “good” looks like. If you don’t, you’ll either overbuild or underdeliver. Usually both.\n\n**5. Trust is built when you say “no” clearly and respectfully**  \nEarly in my career, I thought good PMs always said yes. Now I know that consistent, strategic no’s build way more trust than stretching the team thin trying to please everyone.\n\nHappy to unpack any of these if people want to dive deeper or hear what others would add to the list. Curious what’s stuck with you over the years.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 368,
    "downs": 0,
    "created_utc": 1751450218.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.179952371980132
  },
  {
    "score": 363,
    "title": "3 months of A/B testing our onboarding flow - here's what moved the needle",
    "selftext": "Been running continuous experiments on our signup flow since September. Finally have enough data to share what actually impacted our conversion rates.\n\nKey metrics:\n\n- Signup completion: improved from 34% to 52%\n- Time to first value: reduced from 8 minutes to 3 minutes\n- Day-1 retention: up from 45% to 61%\n\nWhat worked:\n\nProgress indicators made a huge difference. Adding a simple \"step 2 of 4\" increased completion by 18%. People need to know how much work is left.\n\nRemoving optional fields during signup. Cut our form from 8 fields to 4 required ones. Massive impact on drop-off rates.\n\nWhat didn't work:\n\nAnimated transitions. Looked cool but actually slowed things down and didn't improve any metrics.\n\nSocial proof elements. Added testimonials and user counts but saw no meaningful change in behavior.\n\nUsed mobbin to research how other products structure their onboarding. Helped identify patterns we hadn't tried yet.\n\nNext quarter we're testing progressive profiling and personalized onboarding paths. Will report back with results.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 363,
    "downs": 0,
    "created_utc": 1758120863.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.161603055466456
  },
  {
    "score": 362,
    "title": "Marissa Mayer's apparently poor product management",
    "selftext": "In [this post](https://www.platformer.news/marissa-mayer-sunshine-shine-app-design-cofounder-quits/?ref=platformer-newsletter) Casey Newton and Zoe Schiffer write about  Marissa Mayer's troubles with her startup studio and its apps, represented by the latest one launched, Sunshine.   \n\n\nThe article presents citations from employees that point towards poor Product Management basics:\n\n\\-No clear vision or roadmap\n\n\\-Decisions based on personal intuition\n\n\\-Mercenary mindset, opposed to missionary\n\n\\-No GTM strategy \n\n\\-etc..\n\nAll of this from one of the worlds most famed and successful product person. Marissa Mayer worked on Google's Search offering and led the development of GoogleAdwords. She was also CEO at Yahoo. At Google she founded the ongoing Associate Product Manager program.\n\nHow could such a renowned product person now be making rookie mistakes  on what seems to be the basics? I am wondering if anyone has more context to her start up studio or anything surrounding it, to make sense of this.",
    "subreddit": "ProductManagement",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 362,
    "downs": 0,
    "created_utc": 1712400112.0,
    "media": null,
    "is_video": false,
    "num_comments": 173,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.385181249177412
  }
]