[
  {
    "score": 1988,
    "title": "I tried a ridiculous number of productivity apps... so you don’t have to",
    "selftext": "After months of bouncing between task managers, planners, and schedulers (seriously too many), I pulled everything into a [free community spreadsheet](https://docs.google.com/spreadsheets/d/10R0OW5JhsZrjLK1PF2XY9SglpPTjWOVjAuWQvAGgvck/edit?usp=drivesdk) comparing them side by side. It’s run by a small group of productivity nerds and we keep it updated constantly.\n\nIt covers:\n\n* Price (USD/month)\n* Discount Codes / Extended Free Trials\n* Student Discounts\n* ADHD Friendliness\n* AI Integration\n* Focus Modes\n* Offline Access\n* Calendar Integrations\n* Team Plans\n* Platforms\n* Refund Policies\n* Support Options\n* Overall Summary\n\nIf you’ve ever fallen into the “maybe this next app will fix my life” loop, this will save you a ton of time.\n\n👉 [Google Sheet Link](https://docs.google.com/spreadsheets/d/10R0OW5JhsZrjLK1PF2XY9SglpPTjWOVjAuWQvAGgvck/edit?usp=drivesdk)\n\nWe’d love your feedback, and if you know a tool that fits the list, email [contact@sortedaf.xyz](mailto:contact@sortedaf.xyz) and we’ll check it out.\n\nRequirement: it must be a completed app (not in beta).\n\nThanks, and I hope it helps!! :)",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1988,
    "downs": 0,
    "created_utc": 1762932231.0,
    "media": null,
    "is_video": false,
    "num_comments": 115,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Resource post linking to a comprehensive productivity-app comparison spreadsheet rather than a how-to or model.",
    "composite_score": 5.073363777737894
  },
  {
    "score": 1397,
    "title": "Looking for a perfect to do list app",
    "selftext": "Hello! So I've tried a lot of different apps, and I can't find the perfect one 🥲 I hope you could help me!  \nI want to have one list with my partner - something we can use to sit down together on Sunday evenings and organize tasks for the upcoming week. Here are my requirements:  \n1. Calendar / week view  \n2. Shared lists  \n3. Ability to set repetitive tasks  \n4. Android and PC versions  \n5. Preferably minimalistic  \n6. Free or very affordable 🙏  \nPhone widget would be great too!  \nDoes anyone know something like this? Thank you!! :)",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1397,
    "downs": 0,
    "created_utc": 1759744876.0,
    "media": null,
    "is_video": false,
    "num_comments": 104,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A request for app recommendations; lacks substantive content.",
    "composite_score": 4.906101820944632
  },
  {
    "score": 1341,
    "title": "What's the simplest productivity app that actually works for you?",
    "selftext": "I love trying different productivity apps, because sometimes a small tweak here and there in how I work can make a big difference. But lately it feels like most apps are packed with so many features that I'd need another productivity app just to manage all of my productivity apps.\n\nSo, I'd like to know what's the simplest productivity app you've used that actually stuck with you long-term? Bonus points if it's something you still use today.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1341,
    "downs": 0,
    "created_utc": 1758798099.0,
    "media": null,
    "is_video": false,
    "num_comments": 152,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for the simplest productive app; question-based post with no substantive content.",
    "composite_score": 4.9700982312417725
  },
  {
    "score": 511,
    "title": "🚀 [$99.99 → Lifetime FREE] Mental Health App Alera is Free for 24 Hours!",
    "selftext": "*Alera is an AI-powered mental-health app built with clinicians that creates personalized weekly therapy plans and routines → It’s* ***Lifetime FREE for the next 24 hours*** *(normally $99.99) →* ***Limited Promo Codes*** *available* ***(read below)****.*\n\nHey folks 👋\n\nIn 2018, I lost a close friend to depression. That moment changed everything. It pushed me to build something for people who struggle to open up.\n\nI teamed up with psychologists, and since 2020 have been building Alera, a mental-health app designed to make therapy more accessible (read full story below). Over the last year, we’ve shaped Alera into a tool that creates a personal weekly therapy plan from a short chat → And then guides you with tiny audio &amp; chat exercises each day + **(new) guided routines** for more productivity.\n\nAlready trusted by users in 50+ countries 🌍, and still evolving → we’d love your feedback.\n\n👉 Download Alera iOS (Lifetime Free for next 24 hours ***with promo code***): [App Store](https://apps.apple.com/app/id1642957083)\n\n👉 Download Alera Android (Lifetime Free for next 24 hours ***with promo code***): [Google Play](https://play.google.com/store/apps/details?id=com.statsy.statsy)\n\n# What is Alera?\n\nAlera helps your mental health with a personalized weekly therapy plan. It guides you with **tiny audio &amp; chat exercises** each day.\n\n* 💪 **Reduce stress fast** → Clinically proven CBT-based micro-exercises help you feel calmer\n* 📅 **Weekly therapy plan** → Alera creates a 7-day plan that adapts to you over time\n* 💭 **Cognitive restructuring techniques** → Helps you reframe your mind for lasting change\n* 🔄 **(NEW) GUIDED ROUTINES** → Daily guidance to keep your focus and just DO IT!\n* 🔒 **Private &amp; safe** → No account, no ads; built since 2020 with clinicians in Germany 🇩🇪\n* 🌍 **Available worldwide** → trusted in 50+ countries and available in 10+ languages\n\n[Our newest feature: Guided routines! Let me know, what you think :\\)](https://preview.redd.it/68x80e43e1xf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=3acd5485dafb66bfc333c1d59aa09ca9ca62a5dc)\n\n# ⏳ Lifetime Free Promo Codes\n\n→ For **next 24 hours**, Alera’s Lifetime Plan (normally $99.99) is completely FREE ($0.00).\n\nI have a small number of **PROMO CODES** for Free Lifetime Pro Access, and would love to share them with those interested in using the app!\n\n**HOW TO GET A CODE:** Comment below and upvote this post, and I’ll reply with a code. Make sure you have the app installed so you're fast to redeem it before someone takes it.\n\n*We’d love your honest feedback: what works, what doesn’t, and what you’d love to see improved. Thank you 🙏*\n\n# Links\n\n iOS: [App Store](https://apps.apple.com/app/id1642957083)\n\n🤖 Android: [Google Play](https://play.google.com/store/apps/details?id=com.statsy.statsy)\n\n🌐 Website: [alera.app](https://alera.app)\n\n⚠︎ Alera isn’t a substitute for professional care. If you’re in crisis, please seek local help or emergency services.\n\n[Yep, this is me, Finn. I'm very excited for your feedback :\\)](https://preview.redd.it/twwwmso8e1xf1.jpg?width=5712&amp;format=pjpg&amp;auto=webp&amp;s=35f62292a5848aadb55f94d8c12ab91e4ca16027)\n\n# 💬 My Story\n\nI’ve struggled with my own mental health too.\n\nAfter losing my friend Niklas to depression out of nowhere, I started digging into why people suffer in silence and I found that over 300 million people worldwide live with depression, and around 800,000 take their own life every year. That number is devastating.\n\nI thought: *If I can learn something that helps me, why not build something that helps others too? 👀*\n\nSo, I started reading self-improvement books, studying psychology, and eventually wrote my bachelor’s thesis on artificial intelligence and psychotherapy. Last year, I even published my first research paper at an international conference in Bangkok, focusing on depression apps and **I’m now fully committed** to this field 💪\n\nWorking with clinicians and psychotherapists, we’ve been improving Alera step by step — building something that’s not just “another app,” but scientifically grounded and genuinely helpful!\n\n**But it hasn’t been easy! 😰**\n\nWhen I first started in 2020, I had no coding experience. I spent 16-hour days learning, building, testing, sometimes close to burnout (one year ago). It’s kind of ironic building a mental-health app while you’re trying to manage your own mental health 😅\n\nBut I’ve made this **my mission**, to honor Niklas’ memory and help as many people as possible.\n\nNot just by talking to friends or sharing what I’ve learned with people around me, but by creating something that can reach anyone, anywhere: across countries, languages, and cultures.\n\nGetting emails from users around the world thanking us for helping them through hard times… that’s what keeps me going every day. It makes me tear up, no joke.\n\nSo yeah — if you try Alera, I’d love to hear what you think.\n\nYour feedback helps us grow and make Alera even better.\n\nThanks for reading 🙏\n\n\\~ Finn\n\nP.S.: Operating our AI is very expensive, so YOUR review in the AppStore/GooglePlay would help us more than you can think, thank you so much! :)\n\nEDIT: Thank you so so much, I'm overwhelmed. Can't put this into words, I'm chatting and replying here for over 8 hours now. It's midnight in Germany...\n\nFor everyone using ANDROID: Please send me a DM (I can't send DM's anymore), I'll give you a code (they are limited by Google). For everyone using iOS: You can get Alera Pro (Lifetime) without a code.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 511,
    "downs": 0,
    "created_utc": 1761310099.0,
    "media": null,
    "is_video": false,
    "num_comments": 2107,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional post describing features of a mental health app; not a how-to or model.",
    "composite_score": 5.083705264246085
  },
  {
    "score": 494,
    "title": "Have an AI planner or daily scheduler? Get featured in our free community spreadsheet!",
    "selftext": "Hey everyone👋\n\nI'm building a free community resource that brings together the best AI planners, schedulers, and productivity tools in one easy-to-compare Google Sheet.\n\nIt's made for anyone tired of jumping between apps, trial periods, and endless \"which one is best?\" questions. The sheet lets you compare things like:  \n✨Price (USD/moth)  \n🆓Free trials  \n🎓Student discounts  \n🗓️Calendar integrations  \n📶Offline access  \n✅Focus modes  \n💻Platforms supported  \nand more, all in one place.\n\nIf you're a founder, team member, or even just a power user who loves a tool, I'd love to include it. It's a great way to help more people discover what works for them, and you can share any special deals or trials for our community too.\n\nWhy add yours?  \n✔️100% free, no ads or spam  \n✔️Helps people find your tool organically  \n✔️Gives your project a trusted spot in a real community resource\n\n💡Want to be added? Just DM me or drop the link in the comments and I'll help get the tool on the list. You can also find the link to the spreadsheet in my bio if you want to check it out.\n\nLet's save people from the \"productivity app rabbit hole\" together. 😅\n\nCheers!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 494,
    "downs": 0,
    "created_utc": 1751811841.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Proposes a free community spreadsheet to aggregate tools and explains the benefits.",
    "composite_score": 4.152091872918978
  },
  {
    "score": 491,
    "title": "I made the simplest notes app: no AI, no folders, no subscription. Free for everyone here!",
    "selftext": "A few months ago I read [this blog post](https://karpathy.bearblog.dev/the-append-and-review-note/) by Andrej Karpathy, about his note-taking method.\n\nEssentially, you have a single long stream of notes, and you just append things to the top. Every few days you review the notes you made, and anything still interesting or important gets moved back up to the top of your list, while less important things gradually drift downwards.\n\nI was using Apple Notes for this, which was *fine*, but cutting and pasting notes was getting a bit boring and it was difficult to search to find something I knew I'd taken note of.\n\nSo, I made this app that streamlines the process. You just append your notes, and swipe to rescue them to the top of your list. Shown on the notes are their original creation date, the date they were last bumped, and the number of times you swiped them.\n\nIt's all offline, no subscriptions or AI features, just text stored in a very fast database on your device (tested up to 10,000 notes: no problem).\n\nIt's $4.99, but just send me a message if you'd like a promo code for free lifetime access, in return for feedback or an App Store review. \n\niOS only, but Android coming soon (I need testers - again send me a message if you're interested). \n\nWebsite: [https://www.gravitynotes.app/](https://www.gravitynotes.app/)  \nApp Store link: [https://apps.apple.com/us/app/gravity-minimal-notes/id6756236079](https://apps.apple.com/us/app/gravity-minimal-notes/id6756236079)",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 491,
    "downs": 0,
    "created_utc": 1765438922.0,
    "media": null,
    "is_video": false,
    "num_comments": 559,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Product announcement with features and pricing; promotional content.",
    "composite_score": 4.80105911627046
  },
  {
    "score": 411,
    "title": "After 9 years building my all-in-one life organizer, it's finally ready for a real launch",
    "selftext": "Been building this app for years. It's been out there, but something always felt missing. This version finally feels ready.\n\nI started journaling to stop forgetting things, then realized it's way more than that. It helps me think clearly and live more intentionally.\n\nThen I got into bullet journaling and second brain stuff, and it clicked: what I want is more than just journaling, it's a tool to organize my life.\n\nThat's what Journal it! is: a life organizer. Journal, planner, notes, trackers, habits, goals, all connected in one place. No more juggling apps.\n\nIt's offline-first, so your data is always accessible. Optional end-to-end encryption means your data stays truly private. Put everything in without worry.\n\n**Heads up:** There's a bit of a learning curve. To make everything work together, I had to introduce some concepts you won't find in other apps. Check out the [Getting Started videos](https://youtu.be/Z6iYYArfjQE) if you want a quick intro.\n\nSolo dev here, been at it full-time since 2017. Would love to hear what you think!\n\nHere's the app: [Journal it!](https://home.journalit.app) (Android, iOS, macOS, Web)\n\nAlso launching on Product Hunt today. If you have a moment, an upvote would mean a lot!\n\n**Giveaway:** I'm giving away 100 1-year Pro subscriptions to r/ProductivityApps. Just drop a comment.\n\n**Links:**\n- Google Play: https://play.google.com/store/apps/details?id=org.de_studio.diary\n- App Store: https://apps.apple.com/US/app/id1501944799\n- Product Hunt: https://www.producthunt.com/posts/journal-it-all-in-one-life-organizer\n- Community: r/journal_it\n\nEDIT: all 100 codes sent. Thanks a lot for your feedback and encouragement! There is still a 1-month pro code for all on the Producthunt launch page if you want to grab: https://www.producthunt.com/posts/journal-it-all-in-one-life-organizer",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 411,
    "downs": 0,
    "created_utc": 1766305153.0,
    "media": null,
    "is_video": false,
    "num_comments": 597,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Product launch post with multiple links; promotional content.",
    "composite_score": 4.73074780802734
  },
  {
    "score": 393,
    "title": "What’s one productivity app you can’t live without?",
    "selftext": "I’ll start: WillowVoice.\n\nI used to hate writing emails. I’d spend 10 minutes over-editing a three-sentence reply, or worse, spend forever writing Slack messages. Two weeks ago I watched a YouTuber casually dictate an entire blog post in real-time using his voice. Blew my mind you can just use your voice and AI is now good enough to automatically format and correct sentences.\n\nI gave voice dictation a shot, and holy—it’s my biggest lifehack in years. I draft emails super fast and sending messages is so fluid because Willow Voice has near instant latency. I pretty much never touch a keyboard anymore. Now I’m looking for more apps that are this good...",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 393,
    "downs": 0,
    "created_utc": 1741674507.0,
    "media": null,
    "is_video": false,
    "num_comments": 196,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question asking for a productive app; lacks substantive content.",
    "composite_score": 4.45522933490637
  },
  {
    "score": 334,
    "title": "Top 10 not so popular (free) apps I actually use daily",
    "selftext": "Seeing a lot of the same apps get recommended, so here’s a list of some slightly less popular ones I actually use:\n\n* Flux – Eases my eyes at night, shifts the screen warmth after sunlight.\n* Linear – Super clean project management. Way faster and less bloated than some of the big names.\n* Deta Surf – Been playing with this new browser. I’m usually an Arc user.\n* Shottr – Screenshot tool that’s just better than the built-in one.\n* AlDente – Lifesaver for battery health. Keeps my MacBook from charging to 100% all the time.\n* Hyperduck – Makes file sharing between devices super easy. even when your devices are offline.\n* Neetorecord – It's basically a free loom alternative, helps me avoid unnecessary meetings.\n* Brosix – Team communication app I use with my small crew. Not as hyped as Slack/Teams, but solid and secure.\n* Raindrop.io – Bookmark manager that actually makes me *want* to organize stuff. Way better than browser bookmarks.\n* Dropover – Great for dragging/dropping files between apps.\n\nLet me know your favorite not so popular tools. I would love to give it a try.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 334,
    "downs": 0,
    "created_utc": 1756760986.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Explicit list of 10 not-so-popular apps used daily.",
    "composite_score": 4.186969352405472
  },
  {
    "score": 307,
    "title": "AI tools for personal productivity",
    "selftext": "I’ve spent unreasonable amount of time with AI tools and here’s curated list of ones I recommend for productivity:\n\n# General assistants\n\n**ChatGPT** \\- You probably know it. It’s a great tool for ideating, brainstorming, document summarization and quick question-answer work.\n\nThere’s a desktop app available so you can quickly pop it up by pressing control + space, which makes it even better for productivity.\n\n**Claude** \\- Another chat interface, similar to ChatGPT.\n\nIt’s a different model provider so the answers and behavior might be different.\n\nFrom my experience, Claude 3.5 Sonnet is performing better than GPT-4o (but not o1) in tasks that focus on reasoning, code writing and copywriting.\n\nThere’s also a desktop app available.\n\n**Gemini** \\- Honestly, I’m not even sure where to put it.\n\nIt’s Google’s model, one of the most powerful in terms of multimodal capabilities (text, image, audio).\n\nAnd it’s tailored for your Google Workspace.\n\nEmail, docs, spreadsheets, meets, presentation. Anything.\n\n# Research\n\n**Perplexity** \\- Perplexity is an AI search engine that provides answers to questions with up-to-date information.\n\nSo, forget Google. Use Perplexity to get answers to questions and dive down the rabbit hole.\n\n**Exa AI** \\- Exa is another advanced search engine that combines AI-driven neural search with traditional keyword search.\n\nIt understands the semantic meaning of queries and documents.\n\nAnd you can also choose what you want to search: academic articles, news, reports, tweets etc.\n\n# Productivity\n\n**ABY Journal** \\- best AI journal so far.\n\nIf you're a person who likes writing down their thoughts, experiences and tries to become your best self, ABY will help.\n\nIt's a smart journal that provides insights into your personality, thinking patterns and dealing with your emotions to be a better you.\n\nOh, and the design is slick.\n\n**Granola** \\- Great AI notepad for meetings.\n\nIt’s a desktop app, so there’s no bot joining your meetings.\n\nIt automatically transcribes and enhances meeting notes, helping organize and summarize key takeaways and generates action items, follow-up emails, etc.\n\nIt also allows you to ask questions about the transcript and get answers.\n\n**Reclaim** \\- AI-powered calendar that optimizes for productivity.\n\nEssentially, it automates meetings, tracks tasks, and protects deep work time.\n\nCool thing is that it syncs with Google Calendar and Slack.\n\n**Cora** \\- Batch processing emails is one of the main productivity tactics.\n\nCora enables that.\n\nYou only see emails that you need to respond to.\n\nAnd it generates automatic replies for you.\n\nAll other emails are summarized twice a day.\n\n# Knowledge summarization &amp; learning\n\n**Particle News** \\- Short summaries of the daily news. Pretty straightforward.\n\n**Snitchnotes** \\- Create structured notes from study material and get personalized quizzes. Saves time if you're in college / school. \n\nI use it when I want to retain what I'm reading and prep for exams. \n\n**Notebook LM** \\- Notebook LM helps process and summarize various types of content, such as PDFs, websites, videos, and more.\n\nThe cool thing is that it provides insights and connections between topics, cites sources and offers audio summaries.\n\nI use it when the content to read is too long and I’m on the go.\n\n**Napkin** \\- For creating visuals from text.\n\nYou can easily generate and customize infographics, diagrams etc.\n\nSo, if you’re brainstorming, writing or preparing for a presentation, Napkin will work well.\n\n# Writing and brainstorming\n\n**Grammarly** \\- Well known grammar checker.\n\nIt helps improve writing by focusing on clarity and tone.\n\nSometimes the Grammarly icon popping up is annoying though.\n\n**Flow** \\- Flow helps you write and edit notes by speaking.\n\nAnd it integrates across all the apps you use, adapts to your tone and style.\n\nCool tool for just yapping!\n\n# Automations\n\n**Gumloop** \\- Think AI-first Zapier, but 100x more powerful.\n\nIt's is a platform for automating complex work using AI via a no-code drag and drop interface.\n\nIt’s very easy to automate work without needing engineers.\n\nAnd they have loads of templates.\n\nI strongly believe that technology is leverage. And with AI we can be in top 0.1% of people.\n\nIf you want bit deeper dive into the topic, I shared that on my substack (available via link in my profile)\n\nAny other recommendations for apps I could use?",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 307,
    "downs": 0,
    "created_utc": 1736676016.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Structured list of AI productivity tools and subcategories.",
    "composite_score": 4.250089938242154
  },
  {
    "score": 284,
    "title": "a 16-key keyboard designed for faster mobile typing",
    "selftext": "Hi everyone!  \nI’ve been working on **QWERTY mini**, a new mobile keyboard layout with only **16 keys**.\n\nIt’s designed to:\n\n* Reduce typos and thumb fatigue by making keys bigger (about 66% larger)\n* Use a **double-tap** input method and **simultaneous key presses** for faster typing\n* Optimize for thumbs with a compact 2-row layout\n\n**Development Background :** [**Introduce-the-product Link**](https://k-keyboard.com/Introduce-the-product)\n\nI would like to hear your opinions.\n\n",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 284,
    "downs": 0,
    "created_utc": 1754883070.0,
    "media": null,
    "is_video": false,
    "num_comments": 244,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Provides a conceptual explanation of a product's design and reasoning.",
    "composite_score": 4.384427902190777
  },
  {
    "score": 260,
    "title": "What productivity apps have genuinely changed the way you work?",
    "selftext": "I’m really curious—what are the productivity apps that you can’t live without? The ones that actually made a difference in how you work, stay organized, or manage your time?\n\nI feel like there are so many options out there, but I’d love to hear real experiences. Do you have a favorite task manager, note-taking app, or time tracker? Maybe something underrated that more people should know about?\n\nWould love to hear what works for you and why!\n",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 260,
    "downs": 0,
    "created_utc": 1741519362.0,
    "media": null,
    "is_video": false,
    "num_comments": 225,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Open-ended inquiry seeking user experiences about productivity apps.",
    "composite_score": 4.336194726911981
  },
  {
    "score": 255,
    "title": "Assume someone has been in a cave for the last 2 years: Aside from chatbots, what productivity tools are must-haves right now? What actually saves you time during the week?",
    "selftext": "My partner has spent the last 2 years out of the workforce. She’s been at home with our kiddo! Light usage of chatbots here and there. She is re-entering a field that has undergone a pretty big AI adoption (marketing and advertising) and wants to catch up running and spend some time becoming fluent with some AI productivity tools.\n\nI consider Claude desktop, a pro subscription, with some Google integrations and a handful of useful MCPs a must have (that’s basically all I use now) but what else is out there that actually saves you time during the work week?\n\nI am thinking of things like meeting notes agents, calendar agents, worker productivity, but personal productivity is also good. Any suggestions? Phone apps, Mac apps, web apps, workflows, etc. The landscape is so big and so many great new tools every day it seems.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 255,
    "downs": 0,
    "created_utc": 1751160480.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Open-ended request for tools; not a how-to.",
    "composite_score": 3.797616765788264
  },
  {
    "score": 251,
    "title": "My Top 5 Productivity Apps",
    "selftext": "1. I use Notion to take notes, manage my life and to store all my knowledge in one place.\n\n\n2. The Arc browser has the cleanest UI, integrated AI features and the best tab management.\n\n\n3. I use the pikr.io AI integration to manage my email newsletters for me. It summarizes everything for me so I can read an article in 20s and stay up to date with my newsletters. Additionally, it provides a minimalistic reader view and can integrate directly to my Notion workspace.\n\n\n4. Tick Tick is my go-to ToDo app because it is free and has a great desktop app for my MacBook.\n\n\n5. For background music during focus work I use brain.fm which serves science-based music specifically designed for work.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 251,
    "downs": 0,
    "created_utc": 1746213987.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Explicitly presents a numbered list of five productivity apps.",
    "composite_score": 3.9574494697494025
  },
  {
    "score": 222,
    "title": "🚀 [$89.99 → Lifetime FREE] Learning App Amuse is Free!",
    "selftext": "*Amuse is a learning app built with learners that creates a personal learning experience → It’s* ***Lifetime*** *(normally $89.99) →* ***Limited Promo Codes*** *available* ***(read below)****.*\n\nHey folks 👋\n\nIn 2018, we started compiling ideas from books, subs, educators about learning techniques. It's pushed us to build something for people who are curious and love to learn.\n\nI teamed up with professionals, and started building Amuse, a learning app designed to make learning easy and fun. Over the last year, we’ve shaped Amuse into a tool that creates a personal weekly learning course → And then guides your learning with curated quizzes and suggestions.\n\nAlready trusted by users in 50+ countries 🌍, and still evolving → we’d love your feedback.\n\n👉 Download Amuse iOS &amp; Android (Lifetime Free ***with promo code for first 100 only***): [Amuse.so](https://www.amuse.so/?utm_source=reddit&amp;utm_medium=social&amp;utm_campaign=lifetime_free)\n\n# What is Amuse?\n\nAmuse helps your learning with a personalized learning journey. It guides you with **tiny knowledge cards &amp; quizzes** each day.\n\n* 💪 **Start quickly**→ Proven atomic-based learning helps reduce friction in starting\n* 📅 **Weekly learning plan** → Each topic has 3 cards a day across 7 days.\n* 💭 **Active recall** → Quizzes force you to think about what you learned strengthening neural pathways\n* 🔄 **Super Review** → Spaced repetition to prevent knowledge decay\n* 🔒 **Private &amp; safe** → No ads\n* 🌍 **Duo Mode** → Learn with friends and use them as accountability partners.\n\nhttps://preview.redd.it/xr1bids0mi3g1.png?width=1140&amp;format=png&amp;auto=webp&amp;s=5a5968294b2b6bda0df7cefd07e533eb996240bf\n\n# ⏳ Lifetime Free Promo Codes\n\n→ For **first 100 DMs**, Amuse's Lifetime Plan (normally $89.99) is completely FREE ($0.00).\n\nI have a small number of **PROMO CODES** for Free Lifetime Pro Access, and would love to share them with those interested in using the app!\n\n**HOW TO GET A CODE:** Comment below and upvote this post, and I’ll reply with a code. Make sure you have the app installed so you're fast to redeem it before someone takes it.\n\n*We’d love your honest feedback: what works, what doesn’t, and what you’d love to see improved. Thank you 🙏*",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 222,
    "downs": 0,
    "created_utc": 1764125267.0,
    "media": null,
    "is_video": false,
    "num_comments": 499,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Promotional product announcement with feature bullets; lacks instructional or explanatory framework.",
    "composite_score": 4.41778986521617
  },
  {
    "score": 222,
    "title": "We built the Apple Health for your brain and it is lifetime free for the next 24h",
    "selftext": "Hey everyone,\n\nWe built Apple Health for your brain:[ brainpower.now](http://brainpower.now)\n\n1. It automatically tracks your productivity (similar to rize)\n2. You can add daily notes or journal entries\n3. Every day, we combine those two and send you an email report that shows patterns and insights\n\nIt’s great for people who want to track their productivity and cognitive health, especially for everyone with ADHD. More integrations like Apple Health coming soon.\n\nSome users have been tracking for 50+ days and I've been using it for myself too.\\*\n\nOriginally, Brainpower was just a productivity tracker, but we’re shifting focus to make it a proper ADHD tracker instead.\n\n**If you want free lifetime access, comment or DM me for the link — available for the next 24 hours**, keeping it limited so I can manage access and won’t be surprised by huge bills.\n\n\\------------------------------\n\n**However, I do have one tiny ask in return: if you have (or think you might have) ADHD and don’t have a coach or therapist yet,** [please reach out here](https://cal.com/lilian-brainpower/brainpower-adhd)**.** I’d love to help find you the perfect ADHD professional, **no additional cost on any side and see if brainpower could be helpful to track progress** together with a professional (e.g. we have a feature where they can add notes too).\n\nLet me know if you have any questions. :)\n\n\\*For example, brainpower noticed I started working until 7 a.m. right after dislocating my finger and told me it might be a way to cope with not being able to work out, since that’s usually where I get my “success” feeling from. That realization hit me hard.\n\nP.S. Going to sleep now (midnight in Europe) but will reply to everyone tomorrow",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 222,
    "downs": 0,
    "created_utc": 1760040363.0,
    "media": null,
    "is_video": false,
    "num_comments": 728,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Promotional tool introduction with features; not a how-to.",
    "composite_score": 4.5071686272071485
  },
  {
    "score": 221,
    "title": "Built my personal dream productivity app, just for myself, wanted to show it",
    "selftext": "I'm not here to sell or advertise anything, but i did want to show my own productivity app that i built for just me, myself and i. I hope maybe it'll get someone to either build something like this that is \"better\" or inspire someone to build their own.\n\nAll of this was built with help from Claude or Cursor, i have very little app development knowledge myself so i'll be honest about that.\n\nThe app is a bit of a Frankenstein of things since i always felt no app did all of the little things i wanted just right.\n\nThe structure of the app is mainly around the usage of tags. A tag can be connected to a note, task, or app.\n\nNotes can contain mentions of both people as well as backlinking to other notes, with references of when they do reference or backlink to another note. If there's only one note, it's previewed, otherwise it just shows the amount of references.\n\nNotes can also be connected to a specific tag and even project.\n\nEach note can be edited in-line on the home page, which shows the last 20 created notes, but each note also has its own individual note page for not just editing but also to show its own activity drawer. Tasks also support in-line tasks, that are in sync with the Tasks page.\n\nThe notes and the left top sidebar are inspired by Supernotes, as i really liked the idea of also having a \"Thoughts\" page for all the quick notes that didn't have any added context. If context is added to a note, such as a tag, project, it moves out of projects. Think like an inbox for fleeting notes to be processed later.\n\nThe three dot menu of a note also allows me to copy the contents of the note, duplicate, archive and delete them of course.\n\nThe \"Deleted\" and \"Archived\" buttons on the left sidebar are just for quickly accessing deleted and archives notes of course.\n\nTasks are inspired by Things 3 and their task management approach but i also styled the tasks to be similar to Todoist, specially in editing mode.\n\nTasks of course can also be connected to tags and projects. I can create both individual tasks unrelated to a note, but all tasks created from a note also appear in Tasks and can be managed there.\n\nProjects are larger undertakings that can involve both tasks and notes. Each project can have notes and tasks added to them from the project page, and you can also apply a tag to a project.\n\nBut best of all is that you can apply associated tags to a project, meaning any tasks or notes that use the associated tags show up here automatically. Then i can filter by both direct tasks and notes and the associated ones, but also directly link a note or task if i find it useful and it's not already associated.\n\nProjects also have their own activity feed but also people feed, meaning i can then see any time i have a mention of a person in any of the tasks or notes using the directly or indirectly associated tags, i.e i have a note about my doctor appointment using the tag \"health\" for example, and i mention my doctor. They'll show up in the mention feed. Useful for tracking down when and where i've mentioned someone.\n\nSpeaking of People, i have my own little crm/contact list that is very basic, but each person has now just their details there but also an activity feed of mentions of them across notes and tasks of course.\n\nBut my favourite feature has to be the Connections page, which is where all the usage of the tags come into play. Here i can find all the tags i use but also what and how many notes, tasks, and projects are related to it. Clicking on each section shows a dropdown that lists all related content. But clicking on the tag itself though takes you to a more in-depth view of all the relationships of that specific tag.\n\nThere is of course also a tag manager, but i've not included it in the images.\n\nThe Explore page is a simple page showing how many notes i have and a simple graph showing the connections. Nothing fancy but felt i wanted one.\n\nSome things aren't completely there just yet though, such as for example the Links page. The idea there being that it'll host my quick saved links and serve as a mini-bookmark spot. It'll be largely work-related though as i use Anybox for almost everything else.\n\nThe other main function that isn't there but i am trying to get completed is a universal keyboard shortcut to trigger a Quick Add menu, for me to add tasks, notes, and even links in the future. For now i'm likely looking at using my own Raycast extension to get it going but in the near future i want something like the Things 3 quick add, namely having the options of having a normal quick add or a quick add with a url of the web page you're on.\n\nI'll happily take any thoughts/feedback y'all might have. There's probably things i haven't thought about or should consider.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 221,
    "downs": 0,
    "created_utc": 1752621747.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal project showcase with feature descriptions; lacks actionable steps or model.",
    "composite_score": 3.9911249422215733
  },
  {
    "score": 210,
    "title": "I turned my PhD research on procrastination into an app :)",
    "selftext": "EDIT: IT IS NOW OUT - [https://apps.apple.com/us/app/dawdle-ai/id6742461709](https://apps.apple.com/us/app/dawdle-ai/id6742461709)\n\nI’m a psychology PhD student researching procrastination, and I built dawdle to help people actually start the tasks they’ve been avoiding.\n\nIt uses AI trained on 100+ research papers to give interventions for your personalized reason for procrastinating. No more random hacks - just real science.\n\nI’m giving free lifetime access to 10 people on the [waitlist](https://www.thedawdleapp.com/waitlist). Dawdle launches **Sept 15**, totally free… at least until my bootstrapped money runs out 😂",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 210,
    "downs": 0,
    "created_utc": 1757474258.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Announcement of app with description; promotional.",
    "composite_score": 4.117918103125575
  },
  {
    "score": 212,
    "title": "My Productivity App just Won an Official Apple Award!",
    "selftext": "Hey everyone!\n\nSuper excited to share that my app **Screenless** just won an **official Apple award — Swift Student Challenge 2025 Winner** 🏆\n\nThis is a huge milestone for me, just wanted to share it!\n\nIf you want to know more about the App, you can visit it on the [App Store ](https://apps.apple.com/de/app/screenless-app-blocker-fokus/id6738100496)or the [Website](https://www.screenlessapp.com).\n\nTo simplify it, Screenless combines the Apps one sec, Opal (and to be coming Brickapp), while enhancing Opal with way more flexibility and adding it's most requested features - all in one app!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 212,
    "downs": 0,
    "created_utc": 1747045578.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Announcement of award; promotional.",
    "composite_score": 3.7394892508056974
  },
  {
    "score": 207,
    "title": " I built an AI secretary and now I can’t live without it",
    "selftext": "I created [Secretary.my](https://secretary.my) because I was drowning in productivity apps. Now, I just text my iMessage assistant “Remind me at 2pm to check the budget” or “Add a meeting tomorrow at noon,” and it’s done—no extra steps. It handles group reminders, syncs seamlessly with Google Calendar or sends ICS files, and even learns my routine so I don’t have to constantly re-explain my preferences. The best part: I’m not just the founder; I’m the most grateful user. If you’ve been craving a frictionless way to stay on top of everything, give it a shot. Curious what you guys think.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 207,
    "downs": 0,
    "created_utc": 1733797011.0,
    "media": null,
    "is_video": false,
    "num_comments": 127,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Promotional about AI secretary; promotional.",
    "composite_score": 4.024168319786695
  },
  {
    "score": 202,
    "title": "Took 8 months but made my first app!",
    "selftext": "Hey guys so I've made this free app where you can store your websites, social media posts and online content together in one space, rather than keeping all your bookmarks on like 10 different platforms. And I've just got the [collaboration](https://www.youtube.com/watch?v=y45D2aH5L_M) feature with live updates done, so you can now store and share everything with your friends too!\n\nSo you can use it as a shared information hub to store Tweets, youtube videos, websites, Instagram posts, tiktoks, blogs etc, to plan together for a trip or just to keep content organised together across platforms.\n\nAgain, free to use, and if interested, here's a [demo](https://www.youtube.com/watch?v=y45D2aH5L_M) on how the collaboration feature works, and here's the [App Store](https://apps.apple.com/gb/app/showcase-co/id6740991352?platform=iphone), [Play Store](https://play.google.com/store/apps/details?id=co.showcaseapp.frontend) and [web app](http://showcase-app.co/) links too if you want to check it out!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 202,
    "downs": 0,
    "created_utc": 1757077839.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/dpw5joegicnf1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1920,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/dpw5joegicnf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/dpw5joegicnf1/DASHPlaylist.mpd?a=1770430748%2CZjI0MDI4Zjg1YmE2ODc4MDAzYzEyOWViOTc0NjIxMDdmY2YxZDQ4ODFlMzM5MmEyMzhiMDUxYzFlZThjMzJmYg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 25,
        "hls_url": "https://v.redd.it/dpw5joegicnf1/HLSPlaylist.m3u8?a=1770430748%2CNDNlZmI3NGU4YTllM2M5NmYzMzNiMDI2NzQwZjQ3MTIyNmJjYzAxODBjOWFlODVlNjcyZjk4NzE3MzQ5NmE3Yg%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 114,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Promotional app announcement without a clear stepwise method or list.",
    "composite_score": 4.072844958090019
  },
  {
    "score": 200,
    "title": "Thanks r/productivityapps for your support in 2025! We’re bringing back our 50% off lifetime deal (50 codes)",
    "selftext": "Hi everyone!\n\nI wanted to share a quick update and say thank you to this community.\n\nWe’ve been building Lifestack ( https://lifestack.ai/ ), a daily planner that uses wearable data like Oura Ring and Apple Watch to estimate your energy levels and help you plan your day more realistically. Some of you might have seen or commented on our earlier posts here, and the feedback we got from this sub genuinely helped shape the product.\n\nThis year, we’ve grown our user base by almost 10x and made a lot of improvements to the experience. A meaningful portion of that growth came from people in this community, so I really wanted to say thanks.\n\nAs a small holiday thank you, we’re bringing back our 50% off lifetime plan. We ran this once during Black Friday and all the spots were taken pretty quickly. After that, a few people reached out asking if we’d do it again, so we decided to open it up one more time.\n\nThis time we’re offering 50 codes. If you’re interested, leave a comment in this thread and I’ll reach out directly.\n\nThanks again for all the support and honest feedback this year. Hope this helps you kick off 2026 on a strong note!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 200,
    "downs": 0,
    "created_utc": 1766576305.0,
    "media": null,
    "is_video": false,
    "num_comments": 158,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional update with discount offer; no how-to or model.",
    "composite_score": 4.131394619580715
  },
  {
    "score": 185,
    "title": "🚀 [$9.99 → Lifetime FREE] Clipboard Copy-Paste Manager APP",
    "selftext": "**NEW V1.4.0 update launched!** (edited 29th Oct 2025)  \n  \nI've shared my app on /iOSApps twice and reached close to **100k people.** I got really good response, so I think you will like this app too!\n\nI created a **clipboard copy-paste manager** with a keyboard shortcut because I would constantly copy something in one app and then something else in another app, and then lose the first thing I copied.\n\nSo I built ClipVault fully in SwiftUI. It can store clips and organise them based on folders.\n\nWith a **keyboard shortcut**, I would send a lot of DMs at my day-to-day job, so now having a message draft that I can just paste from the keyboard without having to jump between apps has saved me a lot of time. Just make sure to PIN the clips you want to see in the keyboard.\n\n👉[ Download ClipVault App](https://apps.apple.com/us/app/clipvault-clipboard-manager/id6749858841)\n\n**Features:**\n\n\\- It's **privacy-focused**, so we DO NOT collect any information about how you use the app. All clips stay stored locally on your device.\n\n\\- You can **enable iCloud sync** to keep your clips on your personal iCloud. It's OFF by default.\n\n\\- **Available on iPhone &amp; iPads.** If you are signed into the same iCloud, you could sync to both devices.\n\n\\- **Create folders** for easy organisation.\n\n\\- **Keyboard shortcut:** access all your pinned clips via your keyboard. Paste your clips with just a tap.\n\n\\- **Auto-Organise**: It's a NEW feature released today. It auto-organises Links/Images etc into their own folder. Can be turned off in settings\n\n**You can install it FREE,** but folder creation is capped at 10 max. However, you can store an Unlimited Number of clips inside the home page.\n\nIf you want unlimited folder creation and access to the keyboard shortcut, it's only .99c a month for Pro or 9.99 for lifetime access if you don't like subscriptions. Comes with a 3 day free trial\n\n👉[ Download ClipVault App](https://apps.apple.com/us/app/clipvault-clipboard-manager/id6749858841)\n\nBUT because you're reading this, I have a small number of **promo codes for free lifetime access** and **1 month free**, and would love to share them with those interested in using the app!\n\n**How to get a code:** Comment below and upvote this post, and I’ll reply with a code. Make sure you have the app installed so you're fast to redeem it before someone takes it.\n\nOnce ALL codes are taken - if you subscribe to a 3 day free trial, I'll grant you lifetime access to PRO from my side. You can cancel the trial subscription so you don't get charged.\n\nPS: I'll first share lifetime codes, when I run out I'll share one month free.\n\nNo android app unfortunetly, no plan to make one since I don't own one.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 185,
    "downs": 0,
    "created_utc": 1761574037.0,
    "media": null,
    "is_video": false,
    "num_comments": 639,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Promotional app with feature list; no instructions or mental model.",
    "composite_score": 4.385102931209859
  },
  {
    "score": 182,
    "title": "Happy New Year r/productivityapps! Plan your 2026 goals (+ giveaway)",
    "selftext": "Hi everyone,\n\nHappy New Year!\n\nA couple of months ago I posted about Griply here. The feedback and discussions in this subreddit influenced what we worked on next, so I wanted to check back in at the start of the year. I’m also doing another giveaway below for anyone who missed out last time.\n\nFor anyone new: I’m Amber, and together with a self-funded team I’m building [Griply](https://griply.app). It’s a goal-oriented task manager that combines goal planning, habit tracking, and daily task management in one connected system.\n\n**The problem Griply tries to solve**\n\nMost task managers are very good at execution, but bad at context.\n\nYou end up with flat task lists where long-term goals live somewhere else, habits are tracked separately, and daily planning becomes reactive. As task lists grow, it gets harder to tell which tasks actually move a goal forward and which ones are just maintenance.\n\nGriply is built to make that connection explicit.\n\n**How planning for 2026 works in Griply**\n\nPlanning in Griply starts top-down:\n\n* You define Life Areas (e.g. Work, Health, Personal Projects).\n* Within those, you create Goals with clear success metrics.\n* Goals can be broken down into Subgoals, Habits, and One-off Tasks.\n* Every task and habit is linked to a goal or life area. There’s also an inbox for unassigned tasks.\n\nFor planning:\n\n* Tasks and habits appear in daily and weekly planning views (calendar)\n* You can group or filter by goal, life area, priority, deadline, or date\n* Planning your week always happens based on what matters\n\nThis makes it easier to see what you’re actually working on and where your time is going.\n\n**👩🏼‍💻I’ve written a more detailed guide on how I plan goals for 2026** [**here**](https://griply.app/guides/plan-your-goals-for-2026) **and a video** [**here**](https://youtu.be/l_fI4xmgYmg?si=RO7MpsGO9cqJ_iVT)**.**\n\n**What’s new since my last post**\n\nSince my last post, we’ve focused on improving speed and task management:\n\n* A lot of new task filters and grouping (goal, life area, priority, deadline, date)\n* Life area summary view showing goals, habits, and tasks together\n* Improved goal and subgoal views with clearer structure and progress\n* Faster task editing and multi-select for reorganising plans\n* Learn more on [our changelog](https://griply.app/changelog)\n\n**🎁 Giveaway**\n\nI’m giving away **20 × Lifetime Griply Premium** again.\n\nIf you want to join, just reply and share:\n\n* A goal you’re planning for 2026, or\n* Something you want to structure more clearly this year\n\nI’ll randomly pick 20 people later\n\n(Please make sure you’ve created a Griply account so I can assign the lifetime access)\n\nIf you don’t win and still want to try it, I’m happy to set you up with a free month. There’s also a free version.\n\nGriply is available on iOS, Mac, Windows, and web: [https://griply.app/](https://griply.app/)\n\nThanks again for the thoughtful feedback here.\n\nHappy to answer questions or go deeper into specific features.\n\n**EDIT: Thank you all so much for your replies, that means a lot! Since there's still a lot of replies coming in, I will pick the winners early next week. I need some time going through all of them 🩷**",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 182,
    "downs": 0,
    "created_utc": 1767362389.0,
    "media": null,
    "is_video": false,
    "num_comments": 547,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Provides a planning framework and explanation of how Griply planning works.",
    "composite_score": 4.351841368972614
  },
  {
    "score": 176,
    "title": "I created a calendar app that turns each week into a project board (Windows beta just launched)",
    "selftext": "Hey everyone,  \n  \nI recently launched [nocal](https://nocal.app), a calendar app that turns each week into a **project board**. It’s built for people who live in their calendar but also need a space to think, plan, and take notes—**without jumping between tools**.\n\nnocal is all about **focus and calendar minimalism**: it hides the noise and helps you stay productive, even on your busiest days.  \n  \n**Core features:**\n\n* 🗓️ Notion-style **notes alongside your calendar**\n* 🧩 **Note embedding**: nest interactive notes within notes\n* 📝 **Markdown**, rich text, tables, checkboxes, headings\n* 🔁 Close the loop between **time, meetings, and tasks**\n\nnocal is **totally free** to use. If you’re into it and want to support the project, there’s an optional upgrade—and even a **lifetime plan** if that’s your thing.\n\n**I just released v1.4** and includes a boatload of updates, but notably:\n\n* Windows beta\n* New light theme\n* Layout streamlining\n* Auto-formatted markdown pasting\n* Full event support for secondary calendars\n\n**In the works:**\n\n* iOS and Android companion app\n* MCP server\n* Sync with drive\n* MS Graph and CalDav support\n\nLet me know what you think. Most of the development has been driven by community feedback and ideas. Feel free to subscribe over at r/nocalapp for more regular release updates.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 176,
    "downs": 0,
    "created_utc": 1744472083.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Promotional post for a calendar app with feature highlights.",
    "composite_score": 3.821852182202594
  },
  {
    "score": 173,
    "title": "🚀 [$29.99 =&gt; Lifetime FREE] Shelver: AI Home Organization is FREE for 48 Hours!",
    "selftext": "[https://apps.apple.com/us/app/shelver-home-organization/id6756636954](https://apps.apple.com/us/app/shelver-home-organization/id6756636954)\n\nHey everyone! 👋\n\nI’m the indie dev behind Shelver: AI Home Organization, a convenient organization app made to help you keep track of everything in your home, storage unit, or any other personal space!\n\nFor the next 48 hours, I’m giving away FREE LIFETIME PREMIUM using referral codes to thank the community, get your feedback, and because it’s Christmas!\n\n⸻\n\nHow to get Lifetime Free\n\n    1. ⬆️ Upvote this post\n    \n    2. 💬 Leave a comment about what room in your home is most messy\n    \n    3. 📩 I’ll DM you a lifetime referral code\n\n  \n⏰ 48 hours only — after that, no more codes.\n\n⸻\n\nWhat is Shelver?\n\nShelver allows you to divide your home or space into locations, boxes, and items, and search for anything to know exactly where it is.\n\n    • AI knows exactly what each item is, even if you search it up by different names each time\n    \n    • Click on any of your bins or boxes to see what's inside WITHOUT having to open the box and dig through it\n    \n    • Add others to your space so that you all can work on the same shared inventory without needing to share passwords\n\nSimple, easy, and extremely smart.\n\n⸻\n\nFeatures:\n\n    • AI itemizing\n    \n    • Universal item lookup\n    \n    • Native mobile functionality, with web live in a couple days\n    \n    • Location pathes for items and boxes\n    \n    • Shared spaces\n    \n    • No ads\n\n\n\nPremium (Unlocked FREE for Life Today)\n\n    • Unlimited items per space\n    \n    • Own up to 4 spaces\n    \n    • Join unlimited spaces\n\nNormally $2.99/month or $29.99/year → FREE lifetime today\n\n⸻\n\nIf you're looking to be more organized and do a better job of keeping track of what you own, and where things are, try out Shelver.\n\nHappy organizing!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 173,
    "downs": 0,
    "created_utc": 1766643000.0,
    "media": null,
    "is_video": false,
    "num_comments": 697,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Includes explicit, numbered steps to obtain free lifetime access.",
    "composite_score": 4.389976959594181
  },
  {
    "score": 173,
    "title": "I built an AI Agent to Find and Apply to jobs Automatically - What I learned and features we added",
    "selftext": "\nIt started as a tool to help me find jobs and cut down on the countless hours each week I spent filling out applications. Pretty quickly friends and coworkers were asking if they could use it as well so I got some help and made it available to more people.\n\nWe’ve incorporated a ton of user feedback to make it easier to use on mobile, and more intuitive to find relevant jobs! The support from community and users has been incredibly useful to enable us to build something that helps people.\n\nThe goal is to level the playing field between employers and applicants. The tool doesn’t flood employers with applications (that would cost too much money anyway) instead the agent targets roles that match skills and experience that people already have.\n\nThere’s a couple other tools that can do auto apply through a chrome extension with varying results. However, users are also noticing we’re able to find a ton of remote jobs for them that they can’t find anywhere else. So you don’t even need to use auto apply (people have varying opinions about it) to find jobs you want to apply to. As an additional bonus we also added a job match score, optimizing for the likelihood a user will get an interview.\n\nThere’s 3 ways to use it:\n\n1.\t⁠⁠Have the AI Agent just find and apply a score to the jobs then you can manually apply for each job\n2.\t⁠⁠Same as above but you can task the AI agent to apply to jobs you select\n3.\t⁠⁠Full blown auto apply for jobs that are over 60% match (based on how likely you are to get an interview)\n\nIt’s as simple as uploading your resume and our AI agent does the rest. Plus it’s free to use and the paid tier gets you unlimited applies, with a money back guarantee. It’s called SimpleApply",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.58,
    "subreddit_type": "public",
    "ups": 173,
    "downs": 0,
    "created_utc": 1746464461.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Describes product features and usage approaches; mainly explanatory.",
    "composite_score": 3.346760588693703
  },
  {
    "score": 171,
    "title": "Pocket is shutting down, here are the best alternatives",
    "selftext": "Pocket officially goes offline on July 8, 2025, and if you're like me, you've probably saved half the internet in there. I've been trying out other tools to fill the gap esp ones that offer more than just bookmarking. Here’s what I found:\n\n**1. getrecall.ai :** The best Pocket alternative I’ve used so far. You can save articles, PDFs, and YouTube videos, and it doesn’t just store them. Recall summarizes everything into clean note cards, lets you chat with your content, and automatically builds a self-organizing knowledge base. Still free as of now and works across devices.\n\n**2. Matter:** Polished interface, great for reading saved articles. It offers highlighting and some AI features, but most of the good stuff is behind a paywall. Ideal for a clean reading experience.\n\n**3. Raindrop.io:** More of a visual bookmarking tool. Great for organizing links, tagging, and archiving, but it doesn’t summarize or help you review content in any meaningful way.\n\n**4. Instapaper:** Still around, still solid. Good for saving and highlighting, but not actively evolving and lacks any real AI features.\n\nIf you were using Pocket just to save stuff, most of these will do the job. But if you actually want to understand and retain what you save, Recall is probably your best bet right now.\n\nCurious what others are switching to, open to more recs!\n\nEdited: Removed Omnivore, was an oversight. Thanks a bunch! ",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 171,
    "downs": 0,
    "created_utc": 1748025589.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Explicit enumerated list of Pocket alternatives.",
    "composite_score": 3.969164063427333
  },
  {
    "score": 169,
    "title": "Thanks r/ProductivityApps ❤️ for helping shape Griply! Here’s what we’ve built since summer + Giveaway",
    "selftext": "Hi everyone,\n\nA couple of months ago I shared [Griply](https://griply.app) in this subreddit, and the feedback I received from this community had a real impact on what we built next. So first of all: thank you!\n\nFor anyone who hasn’t come across Griply yet: it’s a purpose-driven planning system. Most productivity tools are great at managing tasks, but they don’t help you understand *why* a task matters or how it contributes to the bigger picture. That’s the gap we’re solving.\n\nGriply is built around a simple idea:\n\n**When your goals shape your habits and tasks and everything connects back to what you actually care about staying consistent becomes much easier.**\n\nThat’s why Griply starts with clarity. Your vision and life areas define direction. Your goals become structured plans with visual progress, subgoals, habits and tasks. Your daily and weekly planning then flows naturally from that. It’s a full system, not a list of features.\n\nAs we’re nearly at the end of the year, it’s the perfect time to set priorities and start mapping out 2026.\n\nHere’s what’s new since [my last update](https://www.reddit.com/r/ProductivityApps/comments/1lkzuil/we_just_added_time_blocking_a_goal_roadmap/):\n\n* **Griply for iOS 26:** A fresh new look with liquid glass.\n* **Quick entry:** Press CTRL+space from anywhere to quick add a task to Griply.\n* **Natural language input:** Griply will automatically detect dates, times, priorities, goals, tags, and more.\n* **Increment goal progress:** No more overwriting totals, just add increments to your progress.\n* **Subgoals in subgoals:** Break down even the most complex projects.\n* **Goal descriptions:** Add context/the why/motivation to each goal.\n* **Outlook integration:** See your calendar events alongside your tasks.\n* **Habit scheduling:** Plan habits weeks ahead on the calendar or set different times each day (there’s no other productivity app that allows you to do this flexible habit scheduling).\n* **A lot of keyboard shortcuts:** Faster navigation for power users.\n* And we’re working on soooo much more… we’d love to hear what you’d like us to build next, you can view everything on [our changelog](https://griply.app/changelog).\n\n**For anyone new here: what Griply includes today**\n\nAlongside the new updates, Griply also gives you:\n\n* A goal timeline / Gantt-style roadmap to map your year (perfect for 2026 planning)\n* A daily and weekly planner that pulls in your tasks, habits, and calendar events\n* A full calendar view where your goals and schedule connect\n* Goal dashboards that make your progress visible, not abstract\n* A system where everything (vision, life areas, goals, habits, tasks) works together\n\nThis way you’re not just tracking what you need to do, but actually building momentum toward the outcomes you care about.\n\nMany people are moving over from Todoist, TickTick, and Things because Griply doesn’t just track tasks, it connects every action to the bigger picture.\n\n**🎁 Giveaway**\n\nI’m also planning my own goals for 2026, one of them is to bike from Utrecht to Berlin. It felt fitting to turn this giveaway into a little accountability thread for all of us.\n\nI’m giving away **25 × Lifetime Griply Premium**.\n\nIf you want to join, feel free to share your **biggest goal or project for 2026 in the thread**.\n\nI’ll randomly pick 25 people at the end of the day (14/15 nov depending on the timezone).\n\n(And if you want to try Griply earlier, just DM me and I’ll set you up with a free month). We also have a free version.\n\nGet started here: [https://griply.app/](https://griply.app/)\n\nThanks again for the support and feedback!!\n\nHappy to answer any questions :)",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 169,
    "downs": 0,
    "created_utc": 1763045337.0,
    "media": null,
    "is_video": false,
    "num_comments": 522,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Product update explaining philosophy and new features.",
    "composite_score": 4.317199765811911
  },
  {
    "score": 164,
    "title": "We built the Apple Health for your brain. Skip the watlist &amp; get it for free (next 24h)",
    "selftext": "Hey everyone,\n\nWe built Apple Health for your brain:[ brainpower.now](http://brainpower.now)\n\nIt automatically tracks your productivity, your typing speed, and context switching and shows it as a nice graph.\n\nYou can also connect it to Apple Health, so your productivity stats get linked to your biomarkers and you can start seeing patterns\n\nWe’re starting with performance - tracking how well your brain is working day to day. But if this works out, brainpower will be the way we track and help improve your brain health (for example, Alzheimer’s detection &amp; prevention, ADHD tracking, ...) across a lifetime.\n\nWe launched on[ twitter](https://x.com/lilianbuilds/status/1926027004928762161) and within our network about a month back and got over 1k signups; opening up the waitlist now for[ r/ProductivityApps](https://www.reddit.com/r/ProductivityApps/) users!\n\n**The app will be free forever for you if you download it in the next 24h. Comment or DM for the link!**",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 164,
    "downs": 0,
    "created_utc": 1752177941.0,
    "media": null,
    "is_video": false,
    "num_comments": 697,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional waitlist and free access offer.",
    "composite_score": 4.351911655525487
  },
  {
    "score": 164,
    "title": "Official launch: Doco — bring AI into Word. Thanks r/ProductivityApps ❤️ (20 Pro seats)",
    "selftext": "  \n**tl;dr:** We launched **Doco** today — an AI that actually lives *inside* Microsoft Word. It understands your doc, can pull context from your library, and writes back without wrecking formatting. **First 20 folks who sign up and comment get a Pro seat.** We’re also trending on [Product Hunt](https://www.producthunt.com/products/doco-2) if you feel like supporting!  \n\n\nHey folks — quick follow‑up.\n\nI posted here about a month ago with a rough version of what became **Doco**. The idea came from years of shuttling text between Word and AI tools and wondering why the “real work” was still happening in one app while the “AI magic” lived in another tab.\n\nThis sub gave us honest feedback (thank you). A few themes stuck:\n\n* “Keep it in Word and stay out of the way.”\n* “Don’t mess up styles.”\n* “Let me point the AI at the right files, fast.”\n\nWe took that to heart and pushed for a proper launch. **Doco is live today.** It sits in Word, lets you use @ to reference a file or folder to bring the right context in, and drops results back with the document’s formatting intact. That’s the whole promise.\n\nTo say thanks for the nudge last month, we’re giving **Pro seats to the first 20 people** here.\n\n**How to claim**\n\n1. Sign up: [**trydoco.com**](http://trydoco.com)\n2. Comment **“Signed up”** \\+ your role + what you’d use it for\n3. We’ll DM the upgrade\n\nWe’re also **live on Product Hunt today**. If the story resonates, we’d really appreciate you checking it out and sharing any thoughts: [**https://www.producthunt.com/products/doco-2**](https://www.producthunt.com/products/doco-2)\n\nWe’re still early. Tell us what’s clunky, what saves time, and what button you wish existed. We’ll keep shipping. 🙏",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 164,
    "downs": 0,
    "created_utc": 1753726707.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/yjmwr8bspnff1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/yjmwr8bspnff1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/yjmwr8bspnff1/DASHPlaylist.mpd?a=1770430748%2CMTNhZDJmMzU3NjQ4NDdiNWU5M2JhODQzZDM4Y2RmMTEzZjU0OTkzYzQ5NWVkMTE3ODdmMzhiMmM0NThhNzk4ZQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 141,
        "hls_url": "https://v.redd.it/yjmwr8bspnff1/HLSPlaylist.m3u8?a=1770430748%2CY2I2MDFhMmQ5ZmU5OTE1MzE5MmVlNzcyMjNjYmM4MDVmZmE2Y2IwZThhNmRjZDVmZTZjMzUxMzBkYjljZmQ4ZA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.58,
    "category_rationale": "Includes a brief, actionable sequence to claim the pro seats.",
    "composite_score": 3.8719084895825335
  },
  {
    "score": 160,
    "title": "We just added Time Blocking, a Goal Roadmap &amp; Calendar to Griply - here’s what’s new [+ Giveaway &amp; LTD]",
    "selftext": "Hi everyone,\n\nI’m Amber, founder of [Griply](http://griply.app) – a goal planner and task manager I started out of frustration with how disconnected most productivity tools felt.\n\nI had my long-term goals in Notion, habits in one app, and daily tasks in another. Nothing showed how it all fit together. I kept losing sight of what actually mattered.\n\nSo we started building what I wished existed.\n\n**What Griply does**\n\nGriply connects your goals, habits, and tasks in one system – all aligned with your bigger vision. You can:\n\n* Break down big goals into subgoals, habits, and actionable tasks\n* Set measurable targets (e.g. read 12 books, lose 5kg, save $5k)\n* Organize everything around your life areas (like health, career, relationships)\n* Track progress visually with charts on a dashboard\n* Use widgets on iOS to keep goals, habits, and tasks top of mind\n* Available on Mac, Windows, Web &amp; iOS – all synced (join the waitlist for Android on our website)\n\nIt’s built for people who want to stop just checking off tasks and actually start making consistent progress on *what matters*.\n\n**What’s new in Griply 3.0**\n\nThis is our biggest update yet – and it finally closes the gap between long-term goals and daily actions.\n\n* **Goal Timeline** – Plan goals months and years ahead on a roadmap\n* **Calendar &amp; Time Blocking** – Schedule tasks, goals and life areas with drag &amp; drop\n* **Goal Time Slots** – This is really unique, plan slots on the calendar for your goals or life areas instead of single tasks\n* **New Daily Planner** – Focus each day around your goals, habits, and tasks\n* **Google Calendar Integration** – Show your Google Calendar events\n* **Completely Redesigned Desktop App** – Easier planning on big screens\n\nI’ve attached a short video here showing everything that’s new. And we've shared [all the details on our launch page](http://griply.app/v3).\n\nAlso, Francesco from Toolfinder featured us in a video yesterday where he highlights everything that’s new (which was a nice surprise!): [https://www.youtube.com/watch?v=FGgFQ0waUR4](https://www.youtube.com/watch?v=FGgFQ0waUR4)\n\n**🎁 Lifetime Giveaway**\n\nTo celebrate the 3.0 launch, I’m giving away Lifetime Premium to the **first 25 people who upvote and reply** to this post (DM me your Griply sign-up email so I can grant you the lifetime access).\n\n* Next 25: 1 year Premium\n* Next 50: 6 months Premium\n\nWe’ll also randomly give away 10 extra Lifetime subscriptions to anyone who replies to this post, including those in the first 100.\n\nPlease DM me with your Griply sign up email address. You can sign up here: [http://griply.app](http://griply.app).\n\n(If you’d like to support us, there’s also a limited Lifetime Deal available on our website for $89.99 → [https://griply.app/pricing](https://griply.app/pricing))\n\nWe’re a passionate bootstrapped team of four building this based on user feedback and closely with our community. If you have thoughts, feedback, suggestions, I’d love to hear from you.\n\nThanks so much for reading!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 160,
    "downs": 0,
    "created_utc": 1750943691.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/qrc81wojs99f1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1494,
        "scrubber_media_url": "https://v.redd.it/qrc81wojs99f1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/qrc81wojs99f1/DASHPlaylist.mpd?a=1770430748%2CNWRkNTc2Y2Y2YzllYjZkZmFlODZhMzkwNGQ3OWNkYzE2YmVmMTI4YWY0YzQwZGI2ZmZkYzg2ZDZkYTRjMGM1Zg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 102,
        "hls_url": "https://v.redd.it/qrc81wojs99f1/HLSPlaylist.m3u8?a=1770430748%2CYjc3YWU5YTMzZjM4Y2Q0YjBmYzVlYjE5N2ViYTE0MmVjMWZlNWUzMjIzMzY4N2RjYjk0OTQwYzNhMmNiYjFkMA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Explains the product update and the reasoning behind its features.",
    "composite_score": 4.032984543405937
  },
  {
    "score": 162,
    "title": "Free lifetime access to LifePath",
    "selftext": "Hi all, just introducing something I’ve been working on for a few months. I’ve called it LifePath. It’s a Life OS for those who value both high-end design and functional power.\n\nWe put your projects, tasks, and ideas in one simple Kanban board inspired place. It helps you turn a busy mind into a clear plan, making it easier to focus on what matters most.\n\nSpecial Founder Offer:\n\nSign up before our launch on January 1st to get free lifetime access. This offer expires at midnight on December 31st.\n\nCheck it out here: [https://getlifepath.com](https://getlifepath.com)\n\n**UPDATE:** Thankyou so much to everybody who took up my offer of free lifetime access. The feedback has been amazing and I'm glad so many of you are enjoying it. We received over 2,000 new users in 48 hours, my mind is blown and I'm so grateful.\n\nTo show my appreciation I am now offering 50% discount on annual memberships until the end of January. That means that you just pay £15 UK or $21 US per year.\n\n# ",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 162,
    "downs": 0,
    "created_utc": 1767047190.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Promotional launch post with signup offer and discount; not a explained concept.",
    "composite_score": 3.9557042740533475
  },
  {
    "score": 151,
    "title": "I built an AI coach that makes it impossible for you to ghost your goals (Would love some feedback 🙏 )",
    "selftext": "Hi!\n\nI’ve built an AI accountability partner called coachcall.ai (You can find it by Googling it) that works like a real coach or motivational friend. Here’s what it can do:\n\n* Call you at times you choose to wake you up or motivate you **(talks to you like a real person would)**.\n* Chat with you on WhatsApp for check-ins and reminders.\n* Track your goals and progress.\n* Remember what you share with it for more personalized support.\n\nI originally created it because I wanted someone to call me at 5 AM to wake me up and give me a motivational push. There’s really nothing else like this around right now!\n\nI've made it free for 7 days (no credit card required bs) and you're more than welcome to create second accounts should you incur limits! **Would anyone be able to try it out and give me lots of feedback so I can make it better?** **:)**",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 151,
    "downs": 0,
    "created_utc": 1762369451.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Product introduction with features and a feedback request; primarily promotional.",
    "composite_score": 3.7048758914580224
  },
  {
    "score": 150,
    "title": "Building a minimal pomodoro Focus wrist band",
    "selftext": "I’m looking for feedback on my minimalist Pomodoro wristband concept with a single tactile button. When the button is pressed, it starts a 25-minute countdown, indicated by 25 small LEDs embedded along the band—each LED turning off every minute. At the end of 25 minutes, the device emits a soft beep or vibration to tell you that 25 min are up. What do you guys think. Would this be something you’d be interested in?",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 150,
    "downs": 0,
    "created_utc": 1751654540.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Short product idea post asking for interest/feedback.",
    "composite_score": 3.8105525724849914
  },
  {
    "score": 138,
    "title": "Wrapped up my journey with Liven here’s what actually helped",
    "selftext": "I gave the Liven app a try after hearing good things, and it turned out to be surprisingly helpful. I’ve tried a bunch of self-help tools before but always felt overwhelmed or didn’t know what to focus on. Liven breaks things down simply like walking you through real-life scenarios, helping you figure out what you’re feeling, and how to respond instead of just reacting.\n\n\n\nThe daily reflection prompts made the biggest difference for me. I started noticing patterns in my behavior and finally got some clarity around boundaries and emotional triggers. The exercises at the end of each section are super doable too, and they actually stick.\n\n\n\nIt’s not a magic fix, but if you're the kind of person who learns by doing rather than just reading advice, this gives you a solid structure to work with. It helped me be a little more intentional with how I go through the day, which honestly made a big difference.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 138,
    "downs": 0,
    "created_utc": 1763791124.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Shares insights on what helped and why, offering guidance.",
    "composite_score": 3.520651052805748
  },
  {
    "score": 138,
    "title": "I got tired of chasing windows around — so I made Spencer to restore them across all desktops",
    "selftext": "Hi everyone,\n\nI’m the author of [Spencer](https://macspencer.app) — a different kind of window manager that restores your window positions **across all desktops** (virtual spaces).\n\n\n\nI was always frustrated with dragging, dropping, and resizing windows every time I switched between display setups — whether at work or at home.\n\nAnd the mess after a restart used to drive me crazy.\n\nSo, I built an app that takes care of all that.\n\n\n\n**Spencer features:**\n\n* No setup needed — just **one click to save your current layout** across all displays and desktops\n* A few seconds to restore everything as it was\n* **Hide or minimize** unsaved apps and windows\n* **Auto-launch saved apps**\n* **Custom number of spaces** — Spencer can add or remove spaces so each layout can have its own setup (e.g. work: 2 displays with 8 spaces, home: 1 display with 4 spaces)\n* Create **profiles for different workflows** to stay focused — coding, design, meetings, etc.\n\n\n\nCurrent limitations:\n\n* It can’t yet restore closed windows — it launches apps the same way as clicking their Dock icons (so if you had two open windows and closed both, only one will reopen with default content)\n* Not yet compatible with Stage Manager\n* Fullscreen support is limited — layouts with fullscreen windows can be saved, but restored windows will only simulate fullscreen (Dock and menu bar remain visible)\n\n\n\nSpencer is a **one-time purchase** ($20, lifetime license for up to 3 devices) with a 14-day money-back guarantee.\n\n\n\nThe app is still in active development, and I’m working to remove all current limitations in future updates.\n\nI’d love to hear your feedback — please let me know in the comments which limitation is the top priority for you!\n\n[https://macspencer.app](https://macspencer.app)\n\n",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 138,
    "downs": 0,
    "created_utc": 1761907386.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Product launch with features and pricing; seeks feedback.",
    "composite_score": 3.4950747915820575
  },
  {
    "score": 136,
    "title": "This AI Agent can read your resume, find matching jobs online and start applying on it's own.",
    "selftext": "Built a simple AI agent that reads your CV, finds jobs that match, and can apply to them automatically (directly on company websites). You can try it [here](https://laboro.co) (for free).\n\nPS. If you're just curious about how it works and don't want to share you personal data, feel free to try it with a fake CV, the system doesn’t even use those info for matching, just general experience and overall profile",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 136,
    "downs": 0,
    "created_utc": 1749415249.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 1200,
        "fallback_url": "https://v.redd.it/15pcdq0yhr5f1/DASH_480.mp4?source=fallback",
        "has_audio": true,
        "height": 480,
        "width": 850,
        "scrubber_media_url": "https://v.redd.it/15pcdq0yhr5f1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/15pcdq0yhr5f1/DASHPlaylist.mpd?a=1770430748%2COWYxMjYyODFmNmYyZDYwNGFlMTI3YWQ1Y2VmOWM0NmE0Yzk4NjdmNmE5MWMwNmY4NjIxYzk5YjVhNzM0NWY3OQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 11,
        "hls_url": "https://v.redd.it/15pcdq0yhr5f1/HLSPlaylist.m3u8?a=1770430748%2CMWY0ZDhlMzkzMTM2ZmY2MTYwZjI2ZTYwMmNhMmI3ODMyOTYzODBkMDdjMzViZTIzZmM0MDlmOTQ0YTRmNGExYQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional pitch for an AI job-applying agent with a link.",
    "composite_score": 3.413692243309825
  },
  {
    "score": 132,
    "title": "I built a radial clock app that visualizes your entire day at a glance – free to download, no account needed",
    "selftext": "**Quick note:** I know some of you have seen my posts before. I've implemented every piece of feedback from my previous post into this new version, from the sync improvements to the dial behavior you asked for. If you tried it before and it wasn't quite there, this one's different.\n\nEvery planner I tried had the same issue: they display time as endless vertical lists or grid blocks. But that's not how a day actually *feels*.\n\n**What I built:**\n\n* **Radial clock interface:** tasks become color-coded segments around your day\n* **Apple Calendar sync + ICS imports**\n* **Custom gradients and themes**\n* **Shareable day-dials**\n* **Analytics:** weekly, monthly, and yearly breakdowns\n* **Time insights:** category totals, peak hours, busiest days\n\nFree to download, no account required. If it doesn't click in 5 minutes, delete it. But if you're a visual thinker, it might change how you plan your day:\n\n[https://apps.apple.com/us/app/dialed-radial-day-planner/id6755455859](https://apps.apple.com/us/app/dialed-radial-day-planner/id6755455859)\n\n**Would love feedback:** Does the radial view feel intuitive, or does it take getting used to? What's missing? I'm reading every reply.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 132,
    "downs": 0,
    "created_utc": 1765772125.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/qzgzpea2na7g1/CMAF_720.mp4?source=fallback",
        "has_audio": true,
        "height": 720,
        "width": 964,
        "scrubber_media_url": "https://v.redd.it/qzgzpea2na7g1/CMAF_96.mp4",
        "dash_url": "https://v.redd.it/qzgzpea2na7g1/DASHPlaylist.mpd?a=1770430748%2CYTBkMjdmNGY4MTA3YWFhMTdhNmNkMTRlODE5Y2Q3MmIwYTU3N2QyNzlkNGU1MGNmZjFkYjc0NTUzMDU5ZmYwMw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 37,
        "hls_url": "https://v.redd.it/qzgzpea2na7g1/HLSPlaylist.m3u8?a=1770430748%2CNzY0NGVkYzAwYWFiNTkzMjlkOWE3YmEyYThjZDQwN2IxMThkMDQwYzUyMDM5N2I5NDQ4NWYzZjFkODhhNmMyZQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional update for a radial day planner with user feedback request.",
    "composite_score": 3.5445335230465798
  },
  {
    "score": 131,
    "title": "Critique my to-do app :)",
    "selftext": "My job has me getting hammered left, right, and center with requests and asks. I used to just write things down in a notebook, and for a while I tried ToDoist. The problem was that important tasks always got pushed to the next week because I’d end up doing urgent or easy things instead. Honestly, I just wanted the satisfaction of checking something off, so I’d go for the easy win.\n\nTo help myself focus, I created a super simple app with one core function: your to-do list is limited to just 5 tasks. That limit forced me to stop wasting time on the 0.1x or 1x tasks that felt busy but weren’t meaningful.\n\nA few of my close friends have tried it, and they told me it really helped them focus. They also liked that there are no fancy labels, tags, folders, or other distractions that end up becoming time sinks. Instead of fiddling around in the app, they just got down to doing the actual work.\n\nSo I wanted to share it here and see what people (who were not my friends :p) thought. Do you find this approach useful? How would you use it, or do you feel it wouldn’t really help you?\n\n**I’ve got a few coupon codes to share if you’d like to try it. DM me and I’ll send them over.**\n\nApp Link (Availalble on iOS and macOS): [https://apps.apple.com/us/app/focus-to-do/id6746972162](https://apps.apple.com/us/app/focus-to-do/id6746972162)",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 131,
    "downs": 0,
    "created_utc": 1757866744.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Presents a mental model for why a 5-task limit helps focus and invites feedback.",
    "composite_score": 3.802316440645175
  },
  {
    "score": 131,
    "title": "15 Underrated (Free) Productivity Apps I Actually Use Daily",
    "selftext": "I keep seeing the same tools recommended everywhere, so I pulled together a bigger list of the *less-hyped* apps I’ve actually used across different workflows. Most of these are free or have solid free plans, and they’ve genuinely helped me stay organized and sane.\n\nHere’s the list:\n\n* Shottr- Super fast screenshot tool. Way better than the Mac built-in one.\n* Flux- Adjusts screen warmth automatically at night so my eyes don’t burn.\n* Raindrop.io- The only bookmark manager that actually made me organize my chaos.\n* Brosix- A simple, secure team chat app I use with my small crew. Not as mainstream as Slack or Teams, but lightweight and reliable.\n* Neetorecord- A clean, free Loom alternative. Saves me from unnecessary meetings.\n* Anytype- Privacy-first workspace for notes/tasks. Feels like a decentralized Notion.\n* Mixpanel- If you like insight-heavy analytics without the HubSpot bloat.\n* Deta (Surf Browser)- A privacy-focused browser with a smart notebook vibe. Been experimenting with it.\n* Alfred- My Spotlight replacement for quick app launches and workflows.\n* Dropover- Lets you “hold” files temporarily and drag them across apps easily.\n* AlDente- Helps keep MacBook batteries healthier by avoiding 100% charges.\n* Hyperduck- Underrated file-sharing tool that works even when devices are offline.\n* Agenda- Date-focused notes app that’s surprisingly great for meetings.\n* Cap.so- Insanely simple screen recording for quick walkthroughs.\n* Timeout- Gentle break reminders so I don’t sit like a statue for 6 hours.\n\nI’m always trying obscure and underrated tools, so if you have any hidden gems, drop them below.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 131,
    "downs": 0,
    "created_utc": 1763647907.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "A numbered/bulleted list of 15 distinct tools/products.",
    "composite_score": 3.6719528470466374
  },
  {
    "score": 123,
    "title": "I made a free and private productivity apps. No account needed, all your data stays on your device.",
    "selftext": "**You can try it here:** [https://zenscape.tsuchiya-dev.com/](https://zenscape.tsuchiya-dev.com/)\n\nI've always been frustrated with the state of modern productivity apps. It feels like everything requires:\n\n* Creating yet another account.\n* Logging in every single time you want to use it.\n* Your personal data and logs being stored on someone else's cloud, out of your control.\n* Paying a monthly subscription fee, even for simple tools.\n\nI wanted something different: a truly personal, private, and frictionless space to focus. So, I built ZenScape.\n\nMy goal was to create a service that puts you back in control.\n\nZenScape is a customizable workspace, but it's built on a few core principles to solve the frustrations above:\n\n1. No Sign-up, No Login: Just open the site and start using it instantly. No friction.\n2. 100% Private &amp; Local-First: All your data (notes, to-dos, settings) is saved only in your browser's local storage. Nothing is sent to a server. I, thedeveloper, can't see your data even if I wanted to.\n3. You Own Your Data: You can export all your data to a single file anytime for backup, and import it on any other device. Your data is truly yours.\n4. Completely Free: No subscriptions, no trials, no hidden costs. This is a passion project meant to be useful.\n\nOf course, it also has all the tools you need to get into a state of flow:\n\n1. ✍️ Zen Mode for Notes: This is the core of ZenScape. Click the Focus icon within the Notes widget to enter a fullscreen, distraction-free writing sanctuary.The interface fades away, leaving just your text on a beautifully blurred background.\n2. Customizable Workspace: Drag, resize, and arrange widgets however you like.\n3. Pomodoro Timer: Stay on task with the classic time management technique.\n4. Ambient Sounds &amp; Music Player: Block out distractions with background sounds or your own music.\n5. To-Do List: Keep track of your daily tasks.\n6. Digital Whiteboard: For when you need more than words. A powerful canvas (powered by tldraw) to sketch ideas, create mind-maps, or just doodle.\n7. Beautiful Backgrounds: Choose from a selection of serene backgrounds.\n\nBecause it's free and requires no signup, there's no risk in giving it a try. I would be incredibly grateful if you could check it out and let me know what youthink. I'm eager to hear your feedback!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1759892084.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/gc7jl1lfystf1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/gc7jl1lfystf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/gc7jl1lfystf1/DASHPlaylist.mpd?a=1770430748%2CNTJiNmMyMGI1ZDFkOTE2NjFkNzc1YTI0NGNjYTQxNjRiN2Q1MWQ2MGU5MzUyZjJlOWJkMjY0NTFiN2IwOTlhNQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 53,
        "hls_url": "https://v.redd.it/gc7jl1lfystf1/HLSPlaylist.m3u8?a=1770430748%2CODU4YzY1MTU5OTA4NjIxOGEwOTZhZjZiMDc3YmFkMDY3NzhlYzk5MzEwMDI3ZjNmNTdhMzYxZmQ3OTY5MjQ0NQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Primarily explains the product's privacy/local-first design with enumerated principles.",
    "composite_score": 3.738193652933169
  },
  {
    "score": 123,
    "title": "I spent 2 years building a morning routine app - would love your honest feedback",
    "selftext": "Early last year I left my job to start my own thing.\n\nMy biggest blocker? Mornings. I wanted a lot from myself, but I’d sleep in, miss my rhythm, and roll out of bed at 11am.I tried every trick, habit stacks, alarms, cold showers, you name it. Nothing stuck. So I started building the app I wished existed.\n\nI’ve always believed a true morning routine actually starts the night before. That’s why I decided to create a *whole package*,\n\n* evening planning\n* sleep tracking\n* a smart alarm\n* morning routine tracking\n\nAll in one flow.\n\nMy goal wasn’t just to wake user up at 5am, but to guide the *entire* cycle so mornings feel effortless.\n\nI thought it’d take 2 months. It took almost 2 years. Turns out “helping someone follow through on willpower” is way harder than shipping features.\n\nI almost quit… but I got obsessed. Now the beta is live. and I’m waking up at **5:30 AM every day** and actually *crushing* my routines. I can’t tell if it was the app or the whole 2 years of process, but it finally clicked for me.\n\nNow I want to know if it will work for you.\n\n\n\n**Try the beta (iPhone, iOS 18+)**\n\n👉 [https://testflight.apple.com/join/M3MbygWv](https://testflight.apple.com/join/M3MbygWv)\n\nIf you try it, I’ll read all feedback and iterate fast. Rip it apart. I’d rather hear the hard truth now than ship something forgettable.\n\nAnd even if you don’t download the beta, I’d still love to hear your thoughts. Do you think this idea has a shot at working? I’d rather face reality sooner than later.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1755261038.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Narrative about building an app and asking for feedback; explanation with CTA.",
    "composite_score": 3.7130919598890255
  },
  {
    "score": 121,
    "title": "Thank you for all the support so far - a different take on using AI with productivity.",
    "selftext": "This app was inspired by how I like to organise my time, I posted about it on here and got a great response so I decided to build it. I now have 300+ users, with some paying! I think everyone has their own oppinion on what a productivity app should be, me personally, I don't need much just somewhere I can access notes and tasks quickly, and where I can edit the formatting of my notes with AI.\n\n**What does it do?**\n\nInstead of using AI to \"organise my schedule\" or \"make me more productive\" this app just uses it to save time. It stores notes and information in Note Pages (see slide 3), and you can create tasks for each day and add a reminder for each task. So you just make entries and it generates tasks and notes from your entries, a much more natural way of self organising. \n\n**AI used for what its actually good at:**\n\nThe AI part of the app (last slide) just allows you to do all this by just making an entry (prompt). So instead of using the UI, you can say in the entry: \"go running at 7pm remind me 15mins before\" and it will do that (create the note page/task, fill in the info etc). It uses all your notes and tasks as context for each entry so you can refer to anything you already have written down, e.g. an entry can be \"get milk\" and it will add milk to your shopping list if you have one. Or you can say \"remind me to go running after shopping\" and it will use the time you have set for going shopping to know when to remind you about running. It supports photos, which is great for noting down information you need to keep for later.\n\nAlmost all these features were requests on this sub, so thank you to everyone who suggested features.\n\nLink: [https://apps.apple.com/gb/app/datebook-ai-organiser/id6746894841](https://apps.apple.com/gb/app/datebook-ai-organiser/id6746894841)",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 121,
    "downs": 0,
    "created_utc": 1754476155.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Describes how AI is used in a productivity app; explains features and approach.",
    "composite_score": 3.761766626815144
  },
  {
    "score": 119,
    "title": "What’s the one productivity app that actually worked for you in 2025?",
    "selftext": "We’re a few months into 2025, and I’ve already tried a bunch of productivity apps.\n\nHonestly? Most of them just made things *more* complicated.\n\n**Notion** is cool and all, but let’s be real — sometimes it feels like you need a Notion course just to stay organized.\n\nLately, I’ve gone back to basics: just using **Apple Notes**. It’s simple, fast, and surprisingly effective.\n\nCurious — what’s the one app that’s *actually* made you more productive this year?",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1744250870.0,
    "media": null,
    "is_video": false,
    "num_comments": 212,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Audience question seeking the one app that actually worked, with little substantive content.",
    "composite_score": 3.9783710477669936
  },
  {
    "score": 120,
    "title": "What Are the Best Productivity Apps You've Used and Actually Stuck With?",
    "selftext": "I’ve been on a bit of a quest lately to optimize my workflow and cut down on distractions. I’ve tried a handful of productivity apps, but most of them end up abandoned after a few weeks. I’m curious what productivity apps have actually worked for you long-term?\n\nWhether it’s a to-do list, habit tracker, focus timer, or even something more niche like finance tracking or journaling drop your favorites below. Bonus points if you explain how you use them and why they’ve stuck!\n\nFor context, I’m looking for something that doesn’t just feel like another chore to update. Simplicity, minimal notifications, and actual results are key.\n\nThanks in advance!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1746524641.0,
    "media": null,
    "is_video": false,
    "num_comments": 159,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Requests recommendations with criteria; a discussion prompt rather than content to classify.",
    "composite_score": 3.919845361644412
  },
  {
    "score": 120,
    "title": "I couldn’t find a tool that connected my goals, habits, and tasks - so I built Griply",
    "selftext": "Hey everyone,\n\nI’m Amber, and I’ve always been into setting goals, but I kept getting frustrated with building a good tracking system. My goals, habits and tasks were scattered across different tools. It felt disconnected, and I constantly lost sight of the bigger picture.\n\nSo I decided to build something I wish existed: Griply. **An app that brings goals, habits, and tasks together in one simple system.**\n\nMany of our users have come over from Things, Todoist, or Notion. They liked those tools, but missed seeing how their daily actions actually connected to their bigger goals and visual progress tracking for those goals.\n\n**What makes Griply different:**\n\n* Goals are connected to your habits and tasks\n* Visual progress tracking with charts for goal targets, habits, and life areas\n* Break down goals into subgoals, habits, and tasks with clear metrics\n* Life area reflection to help you stay aligned with what matters\n* Widgets for tasks, habits and goals\n* Cross-platform: iOS, Mac, Web, Windows\n\nWe’re a small indie team of 4 (fully bootstrapped), and we’ve been building this based on user feedback from day one. Griply’s been featured by Apple, 9to5Mac, and AppAdvice - and we’re just getting started.\n\nIf this sounds like something you’d use, I’d love your feedback! **I’m also happy to unlock 1 month of Premium for free**, just sign up and drop a comment or DM me with your account email, and I’ll activate it for you.\n\n📱 iOS App Store: [https://apps.apple.com/app/griply-goal-setting-tracker/id1556692747](https://apps.apple.com/app/griply-goal-setting-tracker/id1556692747)\n\n🖥️ Web/Mac/Windows: [https://griply.app](https://griply.app)\n\nThanks for reading and I’d love to hear how *you* manage your goals too.",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1743006100.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Intro to a new product and its features; marketing/pitch rather than a how-to guide.",
    "composite_score": 3.862737926036149
  },
  {
    "score": 119,
    "title": "Tried 5 Popular Productivity Apps, Here’s My Honest Take",
    "selftext": "I’ve been on a mission to fix my productivity chaos, so I went deep testing apps this month. Here’s the good, the bad, and the ‘meh’:\n\n• Notion\n\nThe hype is real for customization, but I spent more time building templates than actually working.\n\n\n• Todoist\n\nSuper clean for quick tasks, but I kept wishing it could automatically prioritize or break down my goals.\n\n\n• Obsidian\n\nLove how lightweight it is for notes, but it’s not a task manager. Linking notes is cool, but I still needed another app for deadlines.\n\n\n• TickTick\n\nThe calendar + task combo is slick, but the interface feels cluttered after a while (too many buttons, tags,\n\n\n• Fabric\n\nFound this one after seeing a Reddit comment. It’s AI-heavy but in a quiet way; auto categorize projects, you dump in notes and it tries to figure out priorities/projects without making you label everything. \n\n\nNow I’m curious—anyone else mix-and-match apps? Or found one that actually ‘clicks’?",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1749561440.0,
    "media": null,
    "is_video": false,
    "num_comments": 89,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Honest app reviews presented as a bullet list of apps with pros/cons.",
    "composite_score": 3.791302500767287
  },
  {
    "score": 119,
    "title": "🎁 [Giveaway] ListItem - App made for anyone struggling to stay consistent",
    "selftext": "After over a year of planning and building, I’m thrilled to finally launch **List Item**—a productivity tool designed to do much more rather than just logging your tasks.\n\n**List Item** helps you stay truly accountable in real time. Instead of simply recording what you’ve done after the fact, you can start sessions directly, making you more aware and intentional about your work and your progress.\n\n# 🎉 Launch Celebration: 100 Free Premium Codes!\n\nTo celebrate our launch, I’m giving away **100 premium annual subscriptions**—totally free!\n\n**How to claim:**  \nJust **upvote** and **leave a comment**— I’ll DM you a code!\n\n🔥 Features\n\n* **Live Activity:** Real-time progress on lock screen using live activity.\n* **Apple Health Integration:** Sync your mindfulness and workout sessions directly from Apple Health into your items.\n* **Monthly &amp; Daily Progress:** Monthly Snapshots to avoid burnouts , long-term trends, and daily breakdowns.\n* **Offline Access:** All features work offline—stay productive anywhere.\n* **Web App:** Full-featured browser version for seamless cross-device access. I’ve also added pop-up window support on the web.\n\n🎁 Want a free code? Just upvote and comment and I'll DM you a code!!\n\n[https://apps.apple.com/in/app/list-item-your-progress-pal/id6743630731](https://apps.apple.com/in/app/list-item-your-progress-pal/id6743630731)\n\n# 💬 Your Feedback Matters!\n\nShare your thoughts, suggestions, or ideas for what you’d like to see next!\n\n**Thank you for being part of this journey from day one. Here’s to your progress—let’s build something amazing together! 🚀**",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1749631726.0,
    "media": null,
    "is_video": false,
    "num_comments": 206,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Launch post with a bulleted feature list and promotional giveaway.",
    "composite_score": 3.979666418776083
  },
  {
    "score": 114,
    "title": "Top 10 not so popular (free) apps I actually use daily- Part 2",
    "selftext": "Since most of you loved my previous post, here I am again, sharing 10 more slightly less popular tools I actually use:\n\n* Capacities – I love how self-organizing this notes program is. With links, tags, AI and powerful querries. It's easy to find anything.\n* Granola – It's the stickiest product I've ever used. I now rely on it, heavily, for note taking during meetings. Couldn't live without it.\n* FlowSavvy – Could not recommend it highly enough for anyone who has multiple personal/work calendars\n* Spike – This email client has completely transformed my inbox experience. Its sleek interface and intuitive design make managing emails a breeze.\n* xTiles – Great minimal Notion alternative with a slow learning curve.\n* Brosix –Team communication app I use with my small crew. Not as hyped as Slack/Teams, but solid and secure. \n* GQueues – It syncs beautifully with Google Calendar and Drive, so everything stays perfectly in step (no more missed deadlines...in theory).\n* KYZON Space – Well if you need a video call tool Kyzon works pretty well. I have been using it for some time and it suits our company's needs.\n* Raycast – It has always been reliable and has a lot of plugins which you can use for various stuff for. Really, you can just do anything, even code a plugin extension for your own needs.  \n* Tally Forms – It's a free form builder with amazingly complex conditioning logic.\n\nLet me know your favorite not so popular tools. I would love to give it a try.\n\n",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1759269339.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.93,
    "category_rationale": "Part 2 with a clearly enumerated list of 10 tools.",
    "composite_score": 3.673623846174684
  },
  {
    "score": 112,
    "title": "What apps actually made a difference for your productivity?",
    "selftext": "I’ll start with a couple:\n\n**Workdeep** – I've tried literally everything to boost my focus and attention, but always ended up forgetting what actually helped. Workdeep tracks exactly what improves or ruins my productivity, and seeing these patterns in real-time has been a game-changer for me.  \n  \n**Notion** – My brain was cluttered with notes, bookmarks, project ideas, and tasks scattered everywhere. Notion provided one centralized, flexible space that streamlined my workflow and boosted my productivity immensely.  \n  \n**Sunsama** – My to-do lists used to be impossibly long. Sunsama has taught me to be realistic about my daily workload, greatly reducing overwhelm and making me feel more in control.\n\n**Pomodoro Timers**  –  Simple, accessible timers that keep me focused and productive by breaking work into manageable intervals. There are plenty out there, but Pomodoro YouTube videos usually do the job.\n\n**.. And of course, any AI Chatbots like ChatGPT**\n\nI'm looking for more great apps like these! Any suggestions?",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 112,
    "downs": 0,
    "created_utc": 1748245063.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Explicit enumerated list of productivity tools with a request for more suggestions.",
    "composite_score": 3.7958519241796846
  },
  {
    "score": 111,
    "title": "If you love productivity apps, check out these 5 apps covered by Tool Finder",
    "selftext": "Hey fellow productivity nerds! If you’re into productivity apps, you’ve probably come across Tool Finder. I’ve been binging his reviews lately, and here are my top 5 picks from the apps he’s covered:\n\n* Blitzit - Thought it was just another task app at first, but crossing off todos here is weirdly satisfying. Still using it today.\n* Griply - Not your usual daily task list. It’s built around long-term goals, so it actually complements other task managers really well.\n* Recall - I was a hardcore Obsidian user, but recently switched to this. The AI literally feels like a second brain that remembers what I’ve read and watched online.\n* Lifestack - As a WHOOP user, this one stood out. It’s the only planner I’ve seen that schedules around your energy levels.\n* Abode - Discovered this one on Product Hunt before Tool Finder covered it. Super clean design - probably geared a bit younger, but I still really like it\n\nWhat apps are you using right now, or which ones do you think Tool Finder has to review next?",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1757969518.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Explicit enumerated top-5 list of apps.",
    "composite_score": 3.6080969385109687
  },
  {
    "score": 113,
    "title": "🎁 Giving Away ANOTHER Batch of Free LifeTime for a Low Friction Productivity App",
    "selftext": "Hey everyone! I'm giving away another 50 **free lifetime access** codes to **Proxii**, a new kind of productivity app built for people who want to stay organized *without the hassle of pressing many buttons*. Looking for a new batch of tested so **To get your code:**\n\n1. **Sign up** at [https://proxii.ai](https://proxii.ai/)\n2. **Upvote** this post\n3. **Comment** below or dm once you've completed I’ll DM you your lifetime access code! 👇\n\nFirst come, first served – don't miss out last time we ran out within 1 hour!",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 113,
    "downs": 0,
    "created_utc": 1749629973.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/b3gnpp6bb96f1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/b3gnpp6bb96f1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/b3gnpp6bb96f1/DASHPlaylist.mpd?a=1770430748%2COTQzOGZkMGVjZjhiYjY0ZTBmMGQ4MTkxNDk2ZTgyZmNkMDVlZDJkMTM3Yjk0NGJkYWY0NTVjY2MyYzAyYTIyMw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 23,
        "hls_url": "https://v.redd.it/b3gnpp6bb96f1/HLSPlaylist.m3u8?a=1770430748%2COWYxZjYzODBmMDY4NmUyYzcwNTkzY2JjMzZhMGE3NDM4Y2RkN2UxNjRmNDEyMjBkODRhM2UzMjMzOGQ4NWEwYQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Step-by-step sequence to obtain a prize.",
    "composite_score": 3.814678332032738
  },
  {
    "score": 109,
    "title": "One month into 2025. Discovered any new apps?",
    "selftext": "I set a goal for myself this year to explore new productivity apps—especially ones that have launched recently rather than traditional ones. So far I’ve come across a few interesting ones and have already tested some.\n\n* Joi Planner: A beautifully designed calendar, to-do list, and habit tracker\n* Lifestack: A calendar that integrates health data for smarter scheduling\n* BeforeSunsetAI: An AI-powered planner\n* Blitzit: A to-do list with built-in focus sessions\n* Hero: A calendar with an AI-driven daily assistant \n\nAny other apps worth trying?",
    "subreddit": "ProductivityApps",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 109,
    "downs": 0,
    "created_utc": 1738439831.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.83,
    "category_rationale": "Enumerated list of new productivity apps.",
    "composite_score": 3.7310323281891655
  }
]