[
  {
    "score": 12,
    "title": "How are teams approaching Custom AI Solutions in Real Estate and PropTech today?",
    "selftext": "There seems to be a shift happening where companies are starting to move past generic AI tools and instead build Custom AI Solutions that solve very specific use cases inside real estate, PropTech, insurance and lending. Instead of just using surface-level outputs, these systems are integrating deeper property data, renovation logic, investment analytics and underwriting signals directly into products.\n\nFor example, platforms like [Homesage.ai](http://Homesage.ai) are working with real estate, proptech, insurance and fintech teams to build custom AI stacks that support automated investment scoring, renovation cost modeling, property condition analysis, or risk evaluation inside a company’s own workflow.\n\nHas anyone here done custom AI builds in this space? I’d like to know what outcomes you’ve seen, what was worth the investment, and whether building custom vs using off the shelf tools actually meaningfully improved performance for your users.",
    "subreddit": "PropTech",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1764143388.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.196492372313965
  },
  {
    "score": 6,
    "title": "Looking for solid MLS API options for investment property searches",
    "selftext": "I’m working on a project to flag new investment opportunities across different markets and I’m looking for a reliable MLS API to feed the data. Zillow has an API but access is restricted and approval can take a while.\n\nHas anyone had success using other MLS API sources? I’ve seen options like HomesageAI provide listing and property level data nationwide, but I’m trying to get a sense of accuracy and update frequency before I commit.\n\nIf you’ve tried something that gets close to real-time MLS-style data without hitting a wall on access, any feedback would be appreciated.",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 6,
    "downs": 0,
    "created_utc": 1766564141.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.896128035678238
  },
  {
    "score": 4,
    "title": "Feedback on Our New Prodcut?",
    "selftext": "We are launching an AI-powered real estate platform soon and are looking for some feedback. It is designed to help home buyers (in the US) purchase a house without an agent, or augment their experience if they are working with an agent. Using AI and a system designed by real estate experts, it has tools buyers can use to schedule showings (without having to sign a long-term or costly agreement), enter offer terms and generate their offer on state approved documents, connect with local professionals (lenders, inspectors, insurance agents, etc), manage the escrow process, review disclosures and property documents, plus a lot more.  \n  \nWe think this is going to be a huge hit with FSBOs (people who already want to work without agents), investors (people who know enough about the industry and want to streamline their deals), and anyone who's just had a bad experience with a realtor before (people who want to take control of the process).  \n  \nTake a look at our website at [tryhoma.com](http://tryhoma.com/) and let us know what you think. Is this something you would use? Something you would suggest to people who aren't licensed and who are interested in buying their own home or investment property? Thoughts on what we should have that we don't already?   \n  \nHappy to answer questions if needed as well. And if you want to give feedback on the actual product once it launches, don't forget to sign up for the waitlist. Thanks!",
    "subreddit": "PropTech",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1743092587.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.63
  },
  {
    "score": 5,
    "title": "Affordable Property Data API",
    "selftext": "Hey everyone,\n\nSpent over the last year aggregating property data from over 3,000 counties. Initially wanted to purchase the property data in order to mess around with different AI tools using the property data. The quotes I got were insane. \n\n  \nDecided to collect it myself, with my business partner, so we would have the property data to build out those tools and give other people an option for more a reasonably price data source. We have gotten a lot of good feedback from early users. I was surprised by all the different industries that are using this data. With all that being said, I would love feedback from other professionals in the prop tech space. Let me know your thoughts: [https://www.realie.ai/real-estate-data-api](https://www.realie.ai/real-estate-data-api)\n\n",
    "subreddit": "PropTech",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1742066606.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.772636252551653
  },
  {
    "score": 4,
    "title": "92% probability vs 100% certainty: Why Monte Carlo beats deterministic property analysis",
    "selftext": "**Why Excel fails at real estate analysis and what I built instead**\n\nAfter countless hours of building property models in spreadsheets, I realized the fundamental problem: Excel gives you deterministic analysis when real estate has too many variables for single-point estimates.\n\n**The Excel Problem:**\n\n* Static projections that ignore market volatility\n* No integration with neighborhood data\n* Manual comps research for every property\n* False precision (\"this property will return exactly 12.5%\")\n\n**What I built instead (CompStacker):**\n\n**Automated deal scoring** \\- Search properties and get instant investment scores based on cap rate, cash flow potential, and neighborhood metrics\n\n**Monte Carlo simulations** that show probability ranges instead of false precision (capped at 95% - no unrealistic guarantees)\n\n**Integrated neighborhood data** including crime stats, walkability, and demographic trends\n\n**Multiple strategy calculators** \\- BRRRR, Buy &amp; Hold, Fix &amp; Flip\n\n**10-year cash flow projections** with risk analysis\n\n**Real example:** A $54,900 Cleveland property shows 92% chance of positive cash flow with $1,250/month projected income. The platform automatically scored it based on cap rate (22.47%) and market comparables.\n\n**The search feature** lets you filter by investment metrics that actually matter instead of just bedrooms and bathrooms. Find properties by minimum cap rate, cash flow potential, or neighborhood appreciation trends.\n\nIf you're interested in beta testing or providing feedback: [www.compstacker.com](http://www.compstacker.com)",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1759766145.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.68753063169585
  },
  {
    "score": 5,
    "title": "Building an AI-powered self-guided touring app — looking for PropTech feedback",
    "selftext": "Hey r/PropTech,\n\nWe’re building [TourByte](https://www.tourbyte.io/) — an AI-assisted self-guided touring platform that helps property managers and owners boost tour volume, reduce repetitive Q&amp;A, and improve lead-to-tour-to-application conversion rates.\n\nBackground:  \nI’m an ex-Meta ML engineer; my cofounder and I are applying our experience to a problem we’ve seen repeatedly: coordinating tours is a huge operational drain. Scheduling, unlocking units, handling no-shows, and managing messages eats hours from each week — while renters want flexible, self-paced tours.\n\nTourByte:\n\n* Identity verification for renters\n* Smart access with temporary codes/locks\n* AI assistant guides renters and collects feedback\n* Manager dashboard tracks tours, renter info, and follow-ups\n\nOur goal: reduce no-shows, save staff time, and lease units faster — without sacrificing security or renter experience.\n\nQuestions for the community:\n\n1. Biggest concerns about unsupervised tours?\n2. What would make you comfortable offering them (ID verification, insurance, smart locks, etc.)?\n3. How do you handle after-hours or repeat showings?\n4. How do you handle manual Q&amp;A today?\n5. Who feels this pain most - small landlords, PM teams, or leasing agents?\n6. Which integrations (CRM, PMS, access control) are essential?\n\nIs this a must-have or a nice-to-have? Happy to share a short walkthrough if anyone’s curious!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1759431784.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.877636252551653
  },
  {
    "score": 4,
    "title": "(Uk based) Looking for Tech Co-Founder – PropTech Opportunity Aligned with Rent Reform Bill",
    "selftext": "\nI'm a UK-based real estate professional with 10+ years of experience in residential property management, lettings, and investments. With the upcoming Rent Reform Bill, I see a significant opportunity to build a PropTech platform that bridges the gap between landlords, tenants, and regulatory compliance.\n\nI’m looking for a technical co-founder (preferably UK-based) with experience in building scalable platforms. You’d lead product and development, while I bring deep domain expertise, operational insight, and a strong network in the property space.\n\nIf you’re passionate about it (or you’ve had a shocking experience with estate agents and you want to be apart of revolutionising the sector - lol) I'd love to connect. Drop a comment or DM me!",
    "subreddit": "PropTech",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1751812400.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.7180456295278406
  },
  {
    "score": 5,
    "title": "I got tired of using Excel so I built an app to help landlords like me manage properties. The app is called Propell! [UK]",
    "selftext": "Hi everyone, as a landlord, I’ve spent way too much time wrestling with spreadsheets, trying to track rent payments and managing maintenance requests. It was a constant struggle to keep everything organised and I knew there had to be a better way.\n\nSo, I decided to create Propell, an app designed specifically for landlords like me who want to simplify property management.\n\nHere’s what Propell offers for Landlords:\n\nProperty Management: Easily manage all your properties in one place with intuitive dashboards.\n\nTenant Communication: Send messages and updates directly to tenants without the hassle of email chains.\n\nMaintenance Tracking: Keep tabs on maintenance requests and their status to ensure nothing falls through the cracks.\n\nFinancial Overview: View rent payments, late fees, and overall income with just a few clicks.\n\nI’d love your feedback on this project! If you're interested, I’ve created a short explainer video that goes through the app’s features in detail. You can check it out here.\n\n[https://www.youtube.com/watch?v=jT0yoTobI94](https://www.youtube.com/watch?v=jT0yoTobI94)\n\nI’m really eager to hear your thoughts:\n\nWould this be helpful for you as a landlord?\n\nWhat features would you find most beneficial?\n\nHave you used similar apps, and if so, what did you like or dislike about them?\n\nYour insights would be invaluable in shaping the future of my app Propell, so feel free to drop your comments below! Thank you in advance for your input! 🙏",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1731849713.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.8291812460476249
  },
  {
    "score": 4,
    "title": "Built a system that generates virtual tours for every unit in an unbuilt building. Market doesn’t care. Am I delusional or early?",
    "selftext": "I’ve spent the last few years building a pipeline that can generate photorealistic virtual tours for **every single unit** in a building *before it’s built*.  \nNot just hero units — literally every floor, every view, every layout.  \nInvestors can “walk” the building, compare views, explore amenities, etc.\n\nIn my head, this felt like the future of pre-construction sales.\n\nBut… I launched the product 4 months ago and the market’s reaction has basically been: **meh**.  \nDevelopers keep spending millions on fancy sales galleries, then sell units with a handful of renders and a floorplan.  \nAlmost nobody seems to care about full accuracy or per-unit visualization.\n\nSo I’m trying to understand:\n\n* Did I build something the market fundamentally doesn’t want?\n* Am I solving a problem that only *I* think exists?\n* Or is this one of those ideas that needs a different angle / timing / wedge?\n\nHonest feedback is appreciated.  \nEspecially from people in real estate, prop-tech, or anyone who’s been early with a product the market wasn’t ready for.",
    "subreddit": "PropTech",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 4,
    "downs": 0,
    "created_utc": 1765486794.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.8214700043360188
  },
  {
    "score": 3,
    "title": "Solving document chaos for real estate pros. The lightweight layer that keeps your deals organized",
    "selftext": "Hey everyone 👋\n\nI’ve been building something for agents and transaction coordinators who are tired of juggling PDFs, emails, and cloud folders across multiple systems.\n\nit’s built to quietly clean up the mess behind every transaction. Instead of replacing your CRM or compliance tools (like Skyslope or Dotloop), it connects to them, along with Google Drive, Dropbox, and your email, and keeps everything organized automatically.\n\nHere’s what it does:\n\n* Renames and tags files by property, deal stage, and type (disclosure, inspection, etc.)\n* Detects duplicates and flags which version is signed or final\n* Makes everything searchable by meaning, not just filenames (e.g., “find reports mentioning roof repairs”)\n* Works on both web and phone, with optional no-login upload links for clients or vendors\n\nNow that it’s live in early beta, I’d love to open up a discussion with you:\n\n* Is this a real pain you’ve seen in your workflow or your users’?\n* What would make this more valuable to brokerages or teams already using CRMs?\n* Any gaps you’ve noticed that we should think about solving next?\n\nNot trying to spam, genuinely curious how this fits into the broader proptech ecosystem and what integrations would make it more useful.",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1762720264.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.5906206186877936
  },
  {
    "score": 3,
    "title": "[RentCast API Update] New Search Queries, AVM Improvements &amp; More",
    "selftext": "Hey everyone,\n\nFirstly, thanks to all who have been sending us feedback and suggestions for improving our [RentCast property data API](https://www.rentcast.io/api) over the months and years.\n\nWe've added over a dozen items in our latest update, including new property and listing search queries, automatic subject property attribute lookup for AVM endpoints, AI integrations and more:\n\n* Our [properties](https://developers.rentcast.io/reference/property-data) and [listings](https://developers.rentcast.io/reference/property-listings) endpoints now support searches by property type, beds, baths, square footage, year built, listed price and other fields\n* Our improved [query engine](https://developers.rentcast.io/reference/search-queries) also supports setting the min and max numeric ranges, as well as multiple values for many query parameters (making it super flexible)\n* Our [valuation endpoints](https://developers.rentcast.io/reference/property-valuation) can now look up subject property attributes without the need to make a separate API request to retrieve them first (this was a big pain point)\n* Responses from the AVM endpoints will also return the address, attributes, and other public record information about the subject property (simplifying many use cases)\n* You can now request the total number of records matching your queries to assist with [pagination of large datasets](https://developers.rentcast.io/reference/pagination)\n* Our API will now return the FIPS codes assigned to each property's state and county\n* We've added several new [AI integrations](https://developers.rentcast.io/reference/ai-tools), including our own MCP server, for connecting our API directly to AI code editors and agents (works great in Cursor, VS Code and Windsurf)\n\nIf you're one of our 5,000+ API clients, I highly recommend reviewing the full [release notes](https://developers.rentcast.io/changelog) because this was a big update with a lot of changes (nothing breaking, however).\n\nAnd if you need a reliable source of nationwide property data at a fraction of the cost of other major vendors, check out [this guide](https://developers.rentcast.io/reference/getting-started-guide) on how to get started with no contracts or talking to sales.\n\nHit me up with any questions, or if you have ideas for what we should work on next!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1757537931.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.3520599913279625
  },
  {
    "score": 3,
    "title": "MezAgent: Real or Not?",
    "selftext": "I came across a platform called MezAgent that focuses on referral and deal tracking specifically for real estate professionals. From what I understand, it is designed to help agents, wholesalers, and investors manage referral partnerships and keep track of deal stages without using a full CRM.  \n  \nI am curious if anyone here has actually used MezAgent and what their experience has been like. Does it really simplify referral tracking and partner management, or is it just another software that sounds good on paper but falls short in practice?  \n  \nFor those of you who have tried it, how has it compared to more traditional CRM tools or custom spreadsheets? Is it reliable and worth investing time into, especially if referrals are becoming a bigger part of your business?",
    "subreddit": "PropTech",
    "upvote_ratio": 0.72,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1753924406.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.4430899869919436
  },
  {
    "score": 3,
    "title": "Been building would love feedback",
    "selftext": "Hey! I’ve been in GTM Tech/Cyber security my whole  career. Bought my first home with my wife in 2021, it’s a leasehold property and having dealt with management companies that are stealing a living I felt the need to stop complaining and do something about it.\n\nThere is also some significant legislative momentum in the UK that encouraged me to build a solution for homeowners\n\nWe’re aiming to take over the right to manage/residential management company sector in the UK think leaseholds and share of freehold and eventually expand to countries with similar setups across Europe.\n\nStarted building in March and am at this stage with it  https://app.manage.management \n\nWould love some honest feedback \n\nAnd would be great to connect with fellow proptech builders ",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1751066067.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.5906206186877936
  },
  {
    "score": 3,
    "title": "Get AirBnB pricing stats direct from AirBnB itself as you scroll (better than AirDNA, Rabbu, Price Labs, Statista, Mashvisor, etc)",
    "selftext": "Quick background: I built, own, and manage \\~30 rental homes/units personally, and am involved in a short-term property management company that manages 200+ client homes.\n\nI built this to provide the best (freshest, most accurate, and fast) pricing insights for AirBnB, period. We have used AirDNA for years, but have caught them multiple times calculating on the non-discounted pricing (big no-no if you want real #'s), we have no idea where or when they get/update their data, etc.\n\nIt pulls **directly from live Airbnb data from your browser**, giving you faster, more accurate pricing insights than any third-party aggregator can offer. We use it daily to:\n\n* Estimate pricing for new client homes\n* Quickly verify revenue for existing listings\n* Analyze projected returns for development deals\n* Export all the listings &amp; data captured\n\nIt's not on the Chrome Web Store yet, but you can download and try it today at [**www.airbnbextension.com**](https://www.airbnbextension.com/)\n\nWould love your feedback — open to thoughts, feature requests, or questions",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1749425860.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/b20wl51rgs5f1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1632,
        "scrubber_media_url": "https://v.redd.it/b20wl51rgs5f1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/b20wl51rgs5f1/DASHPlaylist.mpd?a=1770354714%2COWFlMjlhZDY5OTMzNGZmNGNjYmNhZTA5ZTQ3ZTRiMTc0NDE3OWY2ODhiMmIzMDk0MzQzMjJlNTY5M2VkMWQ4OQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 139,
        "hls_url": "https://v.redd.it/b20wl51rgs5f1/HLSPlaylist.m3u8?a=1770354714%2CZDU0NTkzM2Y2ZWVkZjBjMDFkYWE5ZjExNDNmM2U5MTkyMTA2ODJkYzlkNGFmOWRkNGZiNWNjNmFmN2RiZTc4OQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.7746090113350907
  },
  {
    "score": 3,
    "title": "New to PropTech, what should I read or listen to?",
    "selftext": "Hey all, I just started a role in product marketing at a PropTech company, and I’m looking to build a strong foundation fast. We work on helping commercial buildings cut energy use and emissions, using AI and data to optimize building operations and meet sustainability regulations.\n\nSince I'll be translating product value into market-facing messaging, I need to really *understand* the space: who the buyers are, how they think, what drives decisions, and what’s noise vs. signal in this fast-moving industry.\n\nWould love any recommendations on what to read, listen to, or follow!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1745579638.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.8916506143517748
  },
  {
    "score": 2,
    "title": "Looking for a Co-Founder to Build a PropTech Startup",
    "selftext": "Hey everyone,\n\nI’ve been working in and around startups for the past five years—two-time founder and first employee at a venture-backed restaurant tech startup. Now, I’m diving into PropTech and looking for a technical co-founder to help bring a new idea to life.\n\nI’m exploring opportunities at the intersection of real estate, data accuracy, and automation. The industry has a lot of inefficiencies, and I see a huge opportunity to build something valuable in this space.\n\nLooking for someone who is ideally:  \n\\- Technical (AI/ML, data engineering, or full-stack development)  \n\\- Entrepreneurial and comfortable with 0-to-1 product building  \n\\- Interested in real estate, PropTech, or solving outdated industry problems  \n\\- Able to commit time and energy to an early-stage startup  \n\\- Able to commit full time\n\nI have a background in product and experience building software. I'm looking for a co-founder who not only brings complementary technical skills but also aligns with my work ethic and collaborative style. The right person is someone who’s willing to put in the effort, iterate quickly, and work well together as we build from the ground up.I have strong insights into the space, a plan for early validation and traction, and I’m looking for the right person to build this with me.\n\nIf this sounds interesting, let’s connect. Drop a comment or DM me. Would love to chat.",
    "subreddit": "PropTech",
    "upvote_ratio": 0.63,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1740614666.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.537666884247503
  },
  {
    "score": 3,
    "title": "Prop Tech Tool for Streamlining the Pre-application Process",
    "selftext": "Hey everyone,\n\nI’ve been really frustrated by how much time and effort the pre-application process takes. Between digging through municipal codes, city council minutes, and planning commission records, it feels like you need a law degree just to understand how your project might fit into a city’s plans or how the community feels about new development.\n\nIt seems like such a manual process—hours of reading and trying to interpret scattered information just to get a basic sense of how a municipality will respond to your project. Has anyone seen a tool or solution that helps with this? Or is it still mostly about grinding through documents?\n\nI’ve been working on something that could help streamline this by analyzing municipal code and public records to give developers a clearer picture of local sentiment and zoning requirements. If this resonates with anyone, I’d love to chat and get your thoughts on what I’m building.\n\nLooking forward to hearing how others approach this challenge!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1739469286.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.5025749891599531
  },
  {
    "score": 3,
    "title": "Best API for Tracking Price Changes in Residential Listings in California?",
    "selftext": "Hi everyone, I have a technical question I’m hoping to get some help with. What’s the best API for tracking price changes in residential real estate listings in California?\n\nI’m looking for something that would allow me to compile a list of homes being sold and get notifications (or some sort of update) whenever the price of any of those homes changes. Ideally, the API would offer real-time or near real-time data on price adjustments.\n\nIf anyone has experience with this or can point me in the right direction, I’d really appreciate it! Thanks!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1725511672.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.6530899869919435
  },
  {
    "score": 3,
    "title": "What's your proptech in a sentence? Successfully did this in another sub",
    "selftext": "I was searching for proptech when this sub popped up. Seems like most proptech's are just hibernating over here.\n\nI recently just thought of asking people to describe their business in a sentence [like this post](https://www.reddit.com/r/smallbusiness/s/cpSmoMREPS)\n\nSo would like to do this too in here. May be that will amp up the essence of this sub? Seems to be it's a goldmine.\n\nWhat's your proptech in a sentence?",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1717346986.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.872756333907075
  },
  {
    "score": 3,
    "title": "A marketplace for real estate agents to offer flat fee services",
    "selftext": "My co-founder and I want to create a platform for real estate agents to offer their services for a flat fee. The platform will connect buyers, sellers, and renters with agents and then charge a small service/referral fee when the deal closes.  \nNo law requires agents to charge a specific commission amount. It depends solely on the policy of the brokerage, and most brokerages will actually allow their agents to charge whatever rate they want.  \nJust wanted to get people's opinions and feedback on the idea. Given everything that is happening now with NAR, seems like it might be worth pursuing.",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1707939532.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.7411356165197842
  },
  {
    "score": 3,
    "title": "Property Ownership Database",
    "selftext": "I don't know if this is of interest - I have created a tool, initially for investigative journalists and corporate investigators, which aggregates planning application data for the purposes of identifying property ownership in the UK.\n\nI am not a real estate guru but I wondered if this data would have other applications; possibly identifying property ownership information to explore new development opportunities or investment.\n\nThe tool is called [ReversePP](https://reversepp.com)\\- check it out!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 3,
    "downs": 0,
    "created_utc": 1698393839.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.3520599913279625
  },
  {
    "score": 2,
    "title": "Looking for a co-founder to build and scale a London based managed home services platform",
    "selftext": "Hi everyone,\n\nHappy New Year. Hope 2026 has started well for all of you.\n\nI’m currently building a managed home services platform that owns pricing, execution standards, and customer outcomes, using vetted providers as supply. This is not a free-form marketplace. The product, operating model, and groundwork are already in motion. What I’m now looking for is the right person to take real ownership over growth and early execution alongside me.\n\nI’ve spent the last 15 years working hands-on in property maintenance and residential environments in London. I’ve seen how jobs actually get quoted, delayed, under-delivered, and argued over in the real world, not just how platforms say they work. That experience is the reason this isn’t being built as a typical marketplace. The failures are structural, not marketing-related, and the model reflects that.\n\nHome services is a massive, fragmented market. In London alone, it’s worth billions annually. Demand is not the problem. The problems are trust, reliability, pricing clarity, and operational consistency. That’s where most platforms fail, and that’s exactly where we’re building differently.\n\nThe model is deliberately simple and execution-driven. Clear pricing, no bidding wars, no race to the bottom, and no vanity metrics. The focus is completed jobs, happy customers, reliable providers, and unit economics that actually make sense.\n\nWe’ll be starting with a geographically focused launch in London to build proper density before expanding. How you think about early traction, how you convert demand into real completed work, and how you build operational discipline early matters far more than buzzwords or theory.\n\nI’m already speaking with candidates through multiple channels, including YCombinator’s co-founder matching, and I’m being very selective about who I spend time with. This is an equity-based role with real ownership and responsibility from day one. It’s not an advisory position and not a short-term engagement.\n\nI’m looking for someone who wants genuine co-founder-level ownership across growth and operations. Someone comfortable in messy early stages, willing to move fast, test channels, speak directly to customers and providers, and be accountable for outcomes, not just ideas.\n\nIf this resonates, send me a DM with your LinkedIn and include the following:\n\n- How you would approach the first phase.\n- Where you would start within London and why. \n- How you would get the first real customers and ensure jobs actually get completed. \n- Which acquisition channels you would test first. \n- What success would look like in the initial phase.\n\nThis probably isn’t a fit if you’re only looking to advise or if you’re uncomfortable with hands-on execution early on.\n\nIf there’s mutual fit, I’m happy to share more detail privately.\n\nRegardless of whether this resonates or not, hope you have a great year ahead!\n\n- Eddie",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1767362828.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.377636252551653
  },
  {
    "score": 2,
    "title": "Would large real estate or brokerage firms actually want something like this?",
    "selftext": "I’ve been working on a **Predictive Buyer Intent &amp; Conversion Automation System** something that helps real estate and home-financing teams know which leads are most likely to close, which properties fit best, and when a buyer’s ready to act.\n\nIt uses automation to:\n\n* Score buyer intent from forms, tone, and browsing patterns\n* Match leads to the right properties\n* Forecast who’s likely to convert in the next 7 days\n* Spot upsell opportunities\n* **Help sales agents focus their time on the right clients** instead of chasing every lead\n\nBasically, turning sales intuition into a data-backed process with dashboards and continuous learning.\n\nDo you think large real estate or brokerage firms would actually adopt something like this? Or is human instinct still too important in the sales cycle?",
    "subreddit": "PropTech",
    "upvote_ratio": 0.75,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1762497765.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.5167425094393248
  },
  {
    "score": 2,
    "title": "What sort of Solutions are people relying on to find Rentals in the US? from NZ here",
    "selftext": "Hey guys, I am super interested in knowing what solutions you guys use in order to find long term rentals (year long) to stay in. I know its a space with a mix of different sorts of solutions but I really want to know what sort of solutions have been working and why? Would love to understand it a bit more deeper. I am currently doing some research on a startup project of mine you can find it here \n\n👉 [rintr.com](https://rintr.com)\n\n",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1760586842.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2271212547196624
  },
  {
    "score": 2,
    "title": "Looking for partners and Testers",
    "selftext": "Hey everyone,\n\nI’m working on a new prop-tech project that helps small investors actually complete their real estate deals — not just learn about them.\n\nRight now, I’m looking for a few people who’d like to test the system and possibly get involved as we build it out. You don’t need to be an expert — just someone interested in real estate, startups, or trying something new.\n\nIt’s performance-based (no upfront fees) and we’re keeping it small for early testers.\n\nIf that sounds like something you’d want to check out, here’s the form:\n👉 https://app.suitedash.com/frm/2qQuG6cfhpAsAPxRC",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1760447038.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2271212547196624
  },
  {
    "score": 2,
    "title": "PropTech Startup looking for Co-Founder (Business Development &amp; Growth)",
    "selftext": "EU PropTech Startup looking for Business Development &amp; Growth Co-Founder  \nStarting with Property Management but the plans are for a bigger system, step one is to identify target (Residential, Commercial, HOA &amp; Community Association, Hospitality &amp; Resort, Industrial, Corporate &amp; Institutional, Specialized Niches)  \nThe tech side is covered, most of the software is build, needs user flows and whatever other changes come up from market research and feedback.\n\none and only requirement - ability to go from 0 to 100 sales\n\nAt this stage  \n\\- there is no funding  \n\\- not applying with incubators\n\nNeed a partner to build a business, not looking for quick exit or people looking for a free ride.",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1752488711.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.576606256887672
  },
  {
    "score": 2,
    "title": "How do you handle tenant communication?",
    "selftext": "Hey everyone,  \n  \nI'm building a communication tool for landlords, property managers, and Airbnb hosts who still rely on texting/calling tenants directly, or who want to make it easier for tenants to reach out without requiring them to log into another portal. I’ve managed a few units myself, and I always found it frustrating to screenshot text threads or keep old conversations mixed in with personal messages just in case I needed them later.\n\nThis tool gives you a dedicated business number and automatically logs all texts and calls by tenant and property/unit. It’s designed specifically for property management, not just another generic tool with a separate phone number. More rental-focused features are planned, but I’d really appreciate feedback before it goes live.\n\nA few things I’d love to learn from others here:\n\n1. Do you use your personal number or a separate line for tenant communication?\n2. Have you ever needed to provide message history for court or documentation?\n3. How do your tenants usually submit maintenance requests? Text, portal, something else?\n\nNot trying to promote anything here, just looking to understand how you currently manage communication and where the biggest gaps are. Happy to talk more or connect privately if you’re open to it.\n\nThanks in advance!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1750521288.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.576606256887672
  },
  {
    "score": 2,
    "title": "Industrial Property Search Parameter Ranking",
    "selftext": "I am trying to compile a hierarchy list for industrial property search parameters. For example: How important is proximity to freeways? How important is \"number of loading docks\"? How important is parking availability? Essentially, I need to figure out what the most important parameters are when investors, brokers, and developers are looking for industrial properties. Would anyone be able to help me out?",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1729291386.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.377636252551653
  },
  {
    "score": 2,
    "title": "Looking for APIs to Download Real Estate Documents by Address in California",
    "selftext": "Hi everyone,\n\nI’m looking for reliable sources or APIs that allow me to download real estate documents (like deeds, releases, and mortgages) for residential properties in California, based on their address. I don’t need bulk data, just the ability to access documents for specific properties. Paid APIs are perfectly fine.\n\nAny recommendations or suggestions would be greatly appreciated!\n\nThanks in advance!",
    "subreddit": "PropTech",
    "upvote_ratio": 0.75,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1725344981.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2781818820794937
  },
  {
    "score": 2,
    "title": "PropTech and the Development of the Circular Economy Ecosystem",
    "selftext": "Excited to announce the launch of a new venture! [Circular](https://youtu.be/tTGAEBx7A1E) is a real estate company developing an ecosystem of sustainability-driven projects across agriculture, hospitality and housing that embody the principles of regeneration and the circular economy:\n\n👩‍🌾 A landmark agritourism resort community in the Catskills centered around regenerative agriculture &amp; conservation → Grows food for…\n\n🍽️ An organic farm-to-table zero-waste restaurant &amp; bar in the Hudson Valley driven by a celebrity chef → Upcycles food waste at…\n\n🍄 A state-of-the-art vertical gourmet mushroom in Harlem NYC in partnership with an urban agriculture company → Grows mushrooms for restaurants and composts byproducts on farm\n\nReach out if you'd like to learn more, we've also opened an offering so that anyone in the community 18+ can invest at [smallchange.co/projects/circular](http://smallchange.co/projects/circular)",
    "subreddit": "PropTech",
    "upvote_ratio": 0.66,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1717694819.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.122636252551653
  },
  {
    "score": 2,
    "title": "Real estate sentiment survey - Proptech voices needed!",
    "selftext": "Everyone is invited to take the Inman Intel Index survey (Triple-I). The Triple-I survey is used to understand what really matters to proptech pros, Realtors/agents, broker-owners, and others in the residential real estate space.  \nThe Triple-I takes about 4 minutes on average to complete, and it is completely anonymous. \n\n[https://www.research.net/r/Feb-Triple-I](https://www.research.net/r/Feb-Triple-I)\n\n&amp;#x200B;",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 2,
    "downs": 0,
    "created_utc": 1708540549.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2271212547196624
  },
  {
    "score": 1,
    "title": "Would you consider investing in real estate without buying the whole property",
    "selftext": "Hey everyone,  \nI’m a currently building around an idea around fractional real estate investing — basically, owning a small piece of a property and earning from its appreciation or rental income, without having to buy the whole thing.\n\nI’m trying to understand how people feel about this concept, especially in the Indian market. If you’ve ever thought about investing in property, it would mean a lot if you could take 2 minutes to fill out this short [survey](https://el-dorado-7s31.vercel.app/)\n\n\n\nIt’s super quick, and your input would really help shape what we’re building. Thanks a lot in advance!",
    "subreddit": "PropTech",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1753833997.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.1045599913279625
  },
  {
    "score": 1,
    "title": "Building a platform just for investment real estate — curious what PropTech folks think",
    "selftext": "I’ve been working on a platform called **HigherCaps** — it’s a community-driven marketplace focused specifically on investment properties.\n\nThe idea came from frustration with how mixed and generic most real estate platforms are — you have to sift through tons of irrelevant listings just to find one deal that fits investor criteria. HigherCaps is built to solve that: only investment-focused listings, with room for comments, discussions, and community input under each property.\n\nStill in the early stages, but curious to hear from folks here:\n\n* Where do you see gaps in the investment property discovery experience?\n* What role do you think community features (like comments, reputation, or crowdsourced insights) can play in real estate platforms?\n* Any features you’d *want* to see in a tool like this?\n\nAppreciate any feedback — always grateful to learn from others building in PropTech.",
    "subreddit": "PropTech",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1753316212.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2260790156711097
  },
  {
    "score": 1,
    "title": "Built a real estate yield and analytics tool — would love your feedback",
    "selftext": "Hi everyone,\n\nI’ve been building [**bestyieldfinder.com**](http://bestyieldfinder.com) — a tool designed to help real estate investors and professionals quickly analyze and compare properties with actionable insights.\n\nSome of the key features include:\n\n* Gross &amp; Net Yield, Price per square meter, ROI, and more\n* Market and location‑level trends to benchmark performance over time\n* Property‑specific reports you can generate and share\n* Built‑in ROI calculator to evaluate potential returns quickly\n\nWe’re focused on making it easier to identify high‑yield opportunities and explain the numbers clearly, even for those who don’t have advanced analytical tools.\n\nWe just opened a **free demo** — no registration needed — and I’d appreciate feedback from this community on what we’re building and where to take it next.\n\n[**bestyieldfinder.com**](https://www.bestyieldfinder.com)\n\nI’d especially like to hear from this group:\n\n* What metrics and insights do you rely on most when evaluating a property?\n* Are there PropTech tools you already use for this? What do you wish they did better?\n* Any features or analytics you’d want to see added?\n\nThe goal is to build this platform around real investor needs. Any suggestions, feedback, or critique are welcome and much appreciated.",
    "subreddit": "PropTech",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1752697875.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 0.8035299956639812
  },
  {
    "score": 1,
    "title": "Built a real estate market data tool — would love feedback from this community",
    "selftext": "Hi everyone 👋\n\nI’ve been building **RealEstateRadar** — a tool designed to give **real estate agents and investors** better access to:\n\n✅ **Hyperlocal market trends**  \n✅ **Property-level insights**  \n✅ **Neighborhood dynamics**  \n✅ (Coming soon) zipcode-level &amp; historical trends\n\nWe just launched an **open Demo Mode** — no registration required — and I’d love feedback from this community on what we’re building and where to take it next.\n\n👉 Try the demo here: [RealEstateRadar.Net/demo](http://RealEstateRadar.Net/demo)\n\nWould especially love to know from this group:\n\n* What market insights would YOU find most valuable in your work?\n* Are there PropTech tools you already use for this? What do you wish they did better?\n* Any features you’d want to see added?\n\nTrying to build this platform based on real feedback — and I know this community has a lot of great perspectives on PropTech &amp; data products.\n\nAppreciate any thoughts, suggestions, or ideas 🙏",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1749398690.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.5281512503836436
  },
  {
    "score": 1,
    "title": "Budget tight for Turns or Renovation Upgrades?",
    "selftext": "Hey everyone, I have been working on a proptech app focused on multifamily housing (apartments, etc.) and want your thoughts! Imagine a tool that gives you exact costs for turns and renovations—no more guessing or ballparking. It’d connect directly to manufacturers like Shaw, Mohawk, and Tarkett for real-time material prices and use a database of 40,000 actual invoices to nail down market pricing for everything from quick turnovers to major renos. Property managers could budget precisely, and vendors could price jobs competitively.  \n\n\nWould this be valuable to you as a property manager, owner, or vendor? Any features you’d want to see? Thanks for your input!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1744063000.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.0510299956639813
  },
  {
    "score": 1,
    "title": "Born and raised in Turkey, still living here — but for how long? How do cities, housing, and living conditions shape who we become? (And can PropTech really help?)",
    "selftext": "I’m 37. I’ve spent most of my life in Turkey. And honestly, I’m surprised I’ve made it this far here. With the growing cost of living, housing becoming less accessible, and city life more stressful by the day, I find myself questioning not just where I live—but who I’ve become because of it.\n\nI wanted to ask the PropTech community:\n\t•\tHow much does the city you live in shape your identity, choices, and opportunities?\n\t•\tIf you had grown up somewhere else—another country, another kind of city—how different would your life look?\n\t•\tCan PropTech play a real role in not just solving real estate issues, but also in making urban life more humane, accessible, and dignified?\n\t•\tEspecially for people considering MIM or MIM Europe: Is relocation simply about lifestyle, or survival?\n\nWould love to hear your experiences and perspectives—especially from those who’ve relocated, or are thinking about it.",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1743489879.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2015449934959719
  },
  {
    "score": 1,
    "title": "Imagine Skyscanner, but for real estate.",
    "selftext": "I built PropScanner, a hobby project that lets you compare property listings across different sites, just like Skyscanner does for flights. No more jumping between tabs—just a streamlined, smarter way to search for homes. Would love to hear your thoughts! \n\nCheck me out here \n\nhttps://www.linkedin.com/posts/bharathwajvasu_reactjs-buildinpublic-proptech-activity-7306968956530040832-oO-C?utm_source=share&amp;utm_medium=member_ios&amp;rcm=ACoAACrEsscBStMrvn6XH5WHv1jzvsWx-QbQdHo",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1742235784.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/1zsqxd6elape1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1440,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/1zsqxd6elape1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/1zsqxd6elape1/DASHPlaylist.mpd?a=1770354714%2CYTZiM2Q4ODk5NjA3NDczY2U5NjhlODU0NjNiOWU3YzM2ZjkwYjFmYzFkZjI3MDAzNWY1MzQzN2EyM2NiYzZjMA%3D%3D&amp;v=1&amp;f=sd",
        "duration": 48,
        "hls_url": "https://v.redd.it/1zsqxd6elape1/HLSPlaylist.m3u8?a=1770354714%2CNmJiNmMxMWUyMmFiZWUzNjZiZWQ3YzUyNDI2MGJkMjgzNWFmN2Q4MTJiZDgzNTQ5YjRiNWJiNTNiMjY0MGU3Nw%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.0510299956639813
  },
  {
    "score": 1,
    "title": "DNA, Quantum, and More: The Future of Data Storage Devices\n",
    "selftext": "Data is exploding. Traditional storage methods are reaching their limits. We need new, better ways to store data. By 2025, we'll see exciting innovations that will change how we handle data. This post explores these innovations and their impact.\n\n**Current Landscape:**\n\n* **HDDs:** Old-school, magnetic storage. Cheap, but slow and fragile.\n* **SSDs:** Flash memory. Faster, more durable, but pricier.\n* **Cloud Storage:** Storing data on remote servers. Scalable, but security concerns.\n\n**Emerging Technologies:**\n\n* **3D NAND:** Stacking memory cells for higher density.\n* **NVMe:** Faster SSD interface.\n* **Hybrid Storage:** Combining HDDs and SSDs for balance.\n\n**Innovations to Watch:**\n\n* **DNA Data Storage:** Storing data in DNA molecules. Extremely dense and long-lasting.\n* **Quantum Storage:** Using quantum mechanics for massive storage capacity and speed.\n* **Edge Computing:** Processing data closer to where it's created.\n\n**Challenges and Opportunities:**\n\n* **DNA:** High cost, slow read/write, specialized equipment.\n* **Quantum:** Experimental stage, error correction challenges.\n* **Edge:** Security concerns, and infrastructure requirements.\n\n**The Future**\n\n* **Data Security:** Encryption, biometric security, homomorphic encryption.\n* **Sustainability:** Green data centers, and recyclable materials.\n\n**Conclusion:**\n\nThe future of data storage is bright. Innovations like DNA and quantum storage promise to revolutionize how we handle data. Businesses and consumers need to adapt to these changes. The next few years will be exciting for the data storage industry. Spring into savings with **Technology Traderz.**",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1729750274.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.0510299956639813
  },
  {
    "score": 1,
    "title": "Realtors: We Need Your Insights on New AI Tool!",
    "selftext": "Hey realtors!\n\nWe’re developing an AI tool to help streamline your work by automatically extracting property details and creating 3D virtual tours from videos. Additionally, it will sync this information with various real estate platforms.\n\n# Why We Need You:\n\nWe’re looking to conduct 30-minute interviews with realtors to understand your experiences and gather insights. Your feedback will be crucial in shaping a tool that meets your needs.\n\n# What’s In It for You:\n\n* **Early Access:** Try our technology first.\n* **Lifetime Free Access:** Enjoy the tool for free.\n\n# Interested?\n\nIf you’d like to participate, please send me a direct message.",
    "subreddit": "PropTech",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1719327216.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 0.9540449934959718
  },
  {
    "score": 1,
    "title": "Are you a Real Estate Investors and Real Estate Creatives?",
    "selftext": "I've been working on something cool called Wisegods, and I wanted to give you the lowdown. \n\nSo, here's the deal: managing my small property portfolio has been a bit of a hassle lately. Every time a tenant moves in or out, I find myself doing property inspections, snapping pictures, timestamping them, and then creating reports. It's a whole ordeal!  \nThat's where Wisegods comes in. With just a few clicks on my phone, this app handles all of that for me. But here's the kicker: am I the only one facing this issue? Are there other property managers out there dealing with the same headache?  \nLet's talk about it! And while we're at it, what other problems do you think could be solved with a handy app? I'm all ears for your ideas!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1708125141.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.0510299956639813
  },
  {
    "score": 1,
    "title": "PerfectPayRent: A New PropTech Platform for Multifamily properties that guarantees ALL rent is paid on time regardless of tenant missing their payment",
    "selftext": "PerfectPayRent is a new payment platform that collects all your rent and guarantees payment on-time every month regardless of tenant making or missing their payment.  \n\nWe are opening to the following markets FL, TX, GA, SLC with more cities opening in Q1.  \n\nIf you'd like to learn more check us out at [www.perfectpayrent.com](https://www.perfectpayrent.com) or book a time to connect [Calendar Link](https://meetings.hubspot.com/jason1111/perfectpayrent-intro-call)",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1705341126.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2895906230238126
  },
  {
    "score": 1,
    "title": "US Listing information access",
    "selftext": "Hi all, \n\nWould love your advise! We are building a product which requires access to real-time listing information on the US market. Ideally we could do this via one single API, instead of scraping or multiple APIs, without an agent/broker license.\n\n(We do have a team member who has access to New York MLS, however since we are looking for national coverage this is far less than sufficient.)\n\nAny suggestions in terms of which data provider we should look into? Thank you so much!",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1705045198.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.3520599913279625
  },
  {
    "score": 1,
    "title": "Looking for feedback on our GPT-Powered Chatbot for Websites - In Private Beta",
    "selftext": "Hey guys,  \nWe're developing 'Utter', a **GPT-powered chatbot that sits on your website** to enhance visitor interaction, provide support, answer product questions, capture leads, book appointments and much more.  \nAs we're in private beta and still figuring out pricing, we'd love your feedback on **what you'd use it for and what are you using right now.**\n\n  \nCheck it out and share your thoughts: [tryutter.ai](https://www.tryutter.ai)  \n*Please be honest and brutal with your feedback!*   \n",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1701553363.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2015449934959719
  },
  {
    "score": 1,
    "title": "New video showing app",
    "selftext": "My team, and I have just launched the beta version of our new app, Reel-T. Reel-T allows agents to host live, remote virtual showings over a Zoom-like video call. Reel-T also centralizes communication to reduce disjointed correspondence. Pin useful links and even documents directly into the video to provide convenient access for important information. Please download and sign up for FREE. Currently raising seed capital so any and all feedback is valuable and appreciated! Thanks all! https://www.flowcode.com/page/reel-t-beta",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1700333995.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.0510299956639813
  },
  {
    "score": 1,
    "title": "Software to automate property management workflow",
    "selftext": "Hello,  \nMy team and I are building a prop-tech software that is aimed at connecting property managers, vendors and tenants. We in early development and are inviting early testers,adopters or listing partners to help us build and test our software. We currently host  the following features:   \n1. Real time cash-flow monitoring and projections/prediction.  \n2. Automated accounting.  \n3. Automated rent collection.  \n4. Property listing and Tenant On-boarding  \n5. Property Owner dashboard,  \n6. Integration of AI(large language models) to assist in analyzing property data(financials,legal documents and aid)\n\n  \nWe want to automate the property management workflow  and for that we also have a ton of features we are still working on such as:  \n1. Tenant verification/credit checks.  \n2. One time property listing.  \n3. Marketplace for vendors.  \n4. Tenant portal.  \n5. Fine tune Large language models.  \n6. All in one communication\\[Emails,Messages etc\\]  \n7. sales,marketing and customer relationship manager.  \n8. Legal aid for different countries or states.  \n9. Streamlined accounting.  \n10. Your suggestions.\n\n  \nWe know that building good software takes time and that's why we are inviting you guys to join us  on this journey. We have opened our wait list and would be glad to have you guys join in. Reach out to me for further details..cheers!!  \n",
    "subreddit": "PropTech",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1698593584.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2260790156711097
  },
  {
    "score": 1,
    "title": "Buyer: have an agent asked you to pay 2-3% for representation?",
    "selftext": "The recent lawsuits excuse the seller from paying commissions to both buyer and seller agent- meaning now buyer agent needs to get paid from the buyer.\n\nSince the buyer is already coming up with downpayment, closing fees, inspection fees, etc - this will be a tough ask.\n\nCan the buyer work with NO Agent, but instead with an attorney? \n\nBuyer can make their own appointments of properties he/she wants to see (if the listing agent ever answers, but that’s a different topic). Attorneys can write up a contract -better than any agent ever could-, and colab with Title to close.",
    "subreddit": "PropTech",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1,
    "downs": 0,
    "created_utc": 1698416361.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.2015449934959719
  },
  {
    "score": 0,
    "title": "Built a tool to fix the tenant-texting mess I went through as a landlord...",
    "selftext": "Hi all!\n\nWhen I started out as a landlord, I did what most people do...I texted and called tenants from my personal phone, saved old text threads from tenants who had moved out, and screenshotted messages to have proof. Everything was mixed with my personal texts and it got disorganized fast.\n\nI ended up building [Rentros](http://www.rentros.com) to solve that. It gives you a dedicated business number to text and call tenants, keeps your personal number private, and automatically organizes conversations by property, unit, and tenant. You can easily export message history if you need it for a dispute or misunderstanding.\n\nI’m sharing it here because I know a lot of you have dealt with the same situation. Curious to hear how others are currently managing tenant texts and calls or what your process is for tenant communication.  \n  \nHappy to answer any questions about how Rentros works!",
    "subreddit": "PropTech",
    "upvote_ratio": 0.5,
    "subreddit_type": "public",
    "ups": 0,
    "downs": 0,
    "created_utc": 1759351239.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 0.6135606273598312
  },
  {
    "score": 0,
    "title": "Ex-Google ML engineer building tenant pre-screening tool - need PropTech community feedback",
    "selftext": "Hey r/proptech, solo founder here looking for honest feedback.\n\n**Background:** Ex-Google engineer, published several Machine learning papers. Spent the last few years getting good at shipping end-to-end AI products. Now applying that to solve my own problem as a landlord.\n\n**The Problem:** Managing 3 rentals and Facebook Marketplace is insane. Last vacancy: 150+ messages, 95% unqualified, spent 15 hours over a weekend just asking for basic info. Meanwhile, qualified tenants found other places. Lost 3 weeks rent (\\~$2,100) due to inefficiency.\n\n**What I'm Building -** [**PropZella Tenant Screener**](https://propzella.com/tenant-screener) [**https://propzella.com/tenant-screener:**](https://propzella.com/tenant-screener)\n\n* Landlords share one link in listings → collects structured applications\n* AI scores applicants using 20+ signals (income ratios, employment stability, rental history)\n* Detects non-obvious red flags through pattern recognition (clustered applications from same address, unusual application velocity, timeline inconsistencies)\n* Customizable scoring based on landlord preferences (pets, move-in date, lease length)\n* Shows WHY someone scored high/low, not just a black box number\n\nThe goal is to turn 150 random messages into 5-10 pre-qualified, ranked candidates who've already provided all their information.\n\n**Questions for the community:**\n\n1. Is pre-screening enough value or do landlords need full screening (credit/background checks)?\n2. What's the minimum viable data for accurate pre-qualification?\n3. Freemium model (10 free applications/month) or pure SaaS?\n4. Any legal/compliance gotchas with AI scoring tenants?\n5. Is the small landlord market (1-10 units) worth targeting or should I focus on property managers?\n\nCurrently testing with my own properties - reduced time-to-qualified-tenant from 2 weeks to 3 days.\n\nWorth pursuing or is this a nice-to-have that landlords won't actually pay for?",
    "subreddit": "PropTech",
    "upvote_ratio": 0.5,
    "subreddit_type": "public",
    "ups": 0,
    "downs": 0,
    "created_utc": 1757285686.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 0.8521212547196624
  },
  {
    "score": 0,
    "title": "Revolutionizing Real Estate: How AI is Changing the Game – Introducing Sell4Me",
    "selftext": "Hi PropTech community,\n\n\n\nI wanted to share a project we've been working on in Israel called Sell4Me – a digital real estate agent powered by AI. Our goal is to streamline the process of buying and selling property by combining all the information a buyer or seller needs with an intelligent chatbot called Shlomke. The bot asks targeted questions (budget, location, property type, etc.), filters out irrelevant listings, and then presents matches with full details, including local schools, health services, and recent sales data. For sellers, the bot guides you through listing a property, including uploading photos, videos, and even AR walkthroughs.\n\n\n\nWe built Sell4Me to address some of the core pain points we encountered: lack of transparency, reliance on expensive brokers, and the tedious back-and-forth of traditional platforms. By automating the first stage of the conversation, we can weed out tire-kickers, save both parties' time, and still keep the human touch when needed.\n\n\n\nWe're currently live in Israel and plan to expand. I'd love to hear feedback from this community – what features would you like to see in a digital agent? Are there specific integrations or data points you find essential? And if you have thoughts on the viability of AI-driven real estate platforms, I'm all ears.\n\n\n\nFeel free to check out the platform at [sell4me.co.il](http://sell4me.co.il) (Hebrew) and let me know what you think. Thanks for reading!",
    "subreddit": "PropTech",
    "upvote_ratio": 0.5,
    "subreddit_type": "public",
    "ups": 0,
    "downs": 0,
    "created_utc": 1753634459.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 0.6135606273598312
  },
  {
    "score": 0,
    "title": "People interested in AI/PropTech (CRE) in Dallas Fort Worth area?",
    "selftext": "I'm a software engineer (15+ years) really interested in the intersection of AI and CRE. I'm already doing some SWE consulting work to a few organizations in the space.\n\nI was wondering if there are more people in DFW interested in AI/PropTech/automation in CRE.\n\nFeel free to DM me or comment with any meetups or spaces I should be aware of. I'd love to meet people that have ideas in the space and might be interested potentially in working on them together.",
    "subreddit": "PropTech",
    "upvote_ratio": 0.5,
    "subreddit_type": "public",
    "ups": 0,
    "downs": 0,
    "created_utc": 1752190584.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 0.5255149978319906
  },
  {
    "score": 0,
    "title": "What are the most critical metrics to look at for an investment property?",
    "selftext": "Hi all,\n\nI am a data scientist and  recently launched propertydealfinder .com, it a tool to find underpriced properties by zip code/area. \n\nI have some metrics like cap rate, price per square feet and a few other basic ones, but I want to know what kind of metrics do you look at when you invest in a property?\n\nI think a cool feature could be a property score based on numerous things, so what are some rules of thumb and numbers that green light new investments. \n\nWould really appreciate your insight!",
    "subreddit": "PropTech",
    "upvote_ratio": 0.25,
    "subreddit_type": "public",
    "ups": 0,
    "downs": 0,
    "created_utc": 1745595077.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 0.5369850021680094
  }
]