[
  {
    "score": 129,
    "title": "I just realized that the sites I build cost about as much as a car",
    "selftext": "I often get the question: how much do you charge to build a site? \n\nAnd because the scope of that question is so broad, I can't really answer it. A site could be a one-page brochure, or it could be a site that integrates with dozens of API's and does some really clever things with that data. Or anything in between.\n\nSo: I realized that the answer is that I charge the price of a car. Client asks: \"Yeah. but what kind of car, brand new luxury model with all the options, or an old second-hand that will only last a year?\" And I say: there's your answer.\n\nI can build you a site for € 1000. I'll be basic, but it will run. For a year, maybe two. The seats won't be super comfortable. I'll get you from A to B. But then probably maintenance costs will start to pile up.\n\nOr, we can go for the full luxury Tesla package with cruise control, air conditioning and factory warranty. With matching price tag. But, the ride will be smooth, and for the first couple of years, maintenance will be low cost or covered by warranty.\n\nThe analogy is so accurate, I think I'm going to keep it.",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 129,
    "downs": 0,
    "created_utc": 1706740519.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Provides a central pricing insight and reasoning rather than a list or steps.",
    "composite_score": 3.5805442143403345
  },
  {
    "score": 67,
    "title": "Who is WordPress now for?",
    "selftext": "First of all, I'd like to set some context. I run two companies in the UK which use WordPress extensively. The first one (now in its 12th year) is a small digital agency, offering consultancy, training and website development to our (niche) client base. Projects are reasonably big, always bespoke (ie no off the shelf themes, all done from ground up, project managed, \"big picture\" thinking around strategy, branding, workshops, etc - typical project 6-9 month duration). The second one is a more productised solution for our niche, offering much lower cost WordPress based sites with our own \"special sauce\" components and functionality, typically (but not always) using GeneratePress and WordPress multisite to deliver. \n\nI have been involved in WordPress development for 10+ years and have thus been watching the development of Gutenberg since the outset. \n\nOur original MO was (like most agencies / individuals I know) to make custom ACF Flexible Content fields. All good - lots of flexibility, but (and I'll come back to this in a moment), lots of **control** \\- you could design row by row, test row by row, make sure that everything worked ok across devices - all good. Also lots of options to add new stuff as the client asked for it - although sometimes a bit clunky to have to delve right into what is essentially your own page builder - reasonably ok to support and design / develop for. \n\nWith Gutenberg we (again, like many agencies) held off for a bit - the initial Gutenberg was pretty terrible but after a couple of years it had matured enough to be practical for large and reasonably complex sites. With it came some pretty major concerns that I have talked through with fellow agency owners - and in fact got looped in to Matt Mullenweg at one point - but basically these concerns (as I say, not just me but for pretty much everyone I've spoken to) revolve around issues of **freedom and design control** and, correspondingly, **audience**. Gutenberg (certainly at first - it's a *bit* better now but not 100% solid) gives unprecedented levels of control to your site editors. Even at its most locked down - as in, turning off pretty much all blocks, the \"block locking\" options available - it's still relatively easy to - frankly - really badly balls up a page. All it takes is a copy-paste from one of the hundreds of (sometimes - *really* bad) block / block pattern sites, or even from another page on the same site - and your whole page falls apart - it's literally Frankendesign, a hotch-potch with no visual purpose at all. \n\nAlthough the editing experience is much more fluid now (images are a dream compared to previous iterations, copy-paste is a joy when populating a big site, etc etc), these layout issues are considerable. With full \"lock-down\" they can be bearable - but still - I don't think anyone would argue that what you want your clients to have is **full control** over their site. They're not designers, they're not tech people - they're (in my 20+ year experience anyway!) people who want to *edit their content* which is, after all what a **content management system** is actually about - managing content... You don't want them to have access to change the site fonts or colours, in the same way building in controls to move the logo from the left side to right is almost always a waste of time because it is extremely rare that anyone wants to do that...\n\nAnd then... here comes FSE. \n\nNow - I've tried really hard to understand who this is pitched at. Is it the \"Wix / Squarespace\" market - in other words, lowest possible denominator - ie \"business owners\" who now don't need to go and employ a designer or developer - guys with agencies or running single-person WP houses seem remarkably redundant in this world, and although it is arguably cheaper for the end user - it isn't necessarily easier. Like - in this world, surely you'd just recommend [wordpress.com](https://wordpress.com) which has not only all these tools but also does the irritating hosting / maintenance / etc side of things...?\n\nOr - is it that us agency / design &amp; dev individuals are literally now supposed to design in the browser, lock down everything then save out using the *Create Block Theme* plugin?\n\nDoes the core development team *really* think that end-users understand concepts around styling a page, implications around layout when thinking about block styles, padding, margins, grids? Let alone theme.json or the wider, more complex picture stuff like global styles vs local ones? The clients I work with want to make things bold and maybe add a link and an image - they have zero concept (and why would they...) of what a \"cascading style sheet\" even is, let alone how to use one.\n\nI would really appreciate anyone's thoughts on this. I just don't understand, strategically, where and why WordPress is heading in this direction. What worries me most is that what seems to be the core motivation: **give everyone more control** is actually a dangerous simplification of reality. I don't want to think that the core team is ploughing ahead making things just because they can rather than because they should - but, honestly, I don't see much evidence that there is deeper thinking going on.\n\nWould love - genuinely - to be proved wrong, and would love to understand everyone else's thoughts on this. Apologies for the insanely long post, too ;-)",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1679312337.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Offers a central claim about Gutenberg's impact on design freedom with supporting context.",
    "composite_score": 3.336609774739734
  },
  {
    "score": 67,
    "title": "17 years in WordPress and frustrated with the current market. Is anyone else feeling the same?",
    "selftext": "Hi everyone,  \nI just needed to get this off my chest.\n\nI’m a WordPress developer with more than 17 years of experience. I’m 48 years old, and I’ve loved technology my entire life. But lately, the market has completely changed… and not in a good way.\n\nEvery week I see “marketing agencies” popping up everywhere—people who learned how to upload TikTok videos and suddenly call themselves digital strategists. They sell businesses a cheap, poorly-built website thrown together in a few hours, and clients believe it because it looks “trendy” on social media.\n\nMeanwhile, real developers—the ones who understand structure, performance, SEO, accessibility, conversions, UX, and long-term results—are getting pushed aside.\n\nWhat frustrates me the most is this:\n\n**These agencies generate zero real conversions.**  \n**Zero sales.**  \n**Zero SEO.**  \n**Zero long-term value.**\n\nYet they dominate the market because they know how to make noise, not results.\n\nAs someone who has spent nearly two decades building real websites, optimizing performance, and helping businesses grow organically, it’s painful to watch the industry get flooded by people who honestly have no idea what they’re doing. The amount of “content creators” and “marketing gurus” selling smoke has seriously damaged our niche and our profession.\n\nClients don’t realize that likes aren’t sales, trends aren’t strategy, and a copy-paste template is not a website.\n\nI’m not giving up—I still love what I do. But I’m genuinely curious:\n\n**Is anyone else feeling the same frustration?**  \n**Have you also seen the market downgrade real work in favor of flashy shortcuts?**\n\nWould love to hear your experiences.",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1765570062.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Clear emotional stance about market changes and devaluation of real developers.",
    "composite_score": 3.341993914874246
  },
  {
    "score": 59,
    "title": "Can we talk about WordPress \"professionals\" who are really just plugin installers?",
    "selftext": "I've worked with enough agencies and freelancers at this point to know the pattern. Someone calls themselves a WordPress developer, charges professional rates, and their entire workflow is: pick Elementor template, install 15 plugins, call it custom development.\n\nThe problem isn't that page builders exist - it's that half the people using \"Pro WordPress Developer\" in their title can't write a single custom function. They panic when you ask them to modify a hook. They treat the theme editor like it's radioactive.\n\nWhat kills me is the documentation excuse. Yeah, WordPress docs could be better, but if you're charging $100/hour and you can't figure out `add_action` without a YouTube tutorial, maybe you're not actually a developer. You're a really expensive installer.\n\nI get it - clients don't always need custom code. But when the industry standard becomes \"throw plugins at it until something works,\" we end up with 20-plugin sites that load in 6 seconds wondering why conversions suck.\n\nAnyone else tired of competing with people who think knowing how to use Yoast makes them a developer? Or am I just being unreasonable here?",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1762990294.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.9,
    "category_rationale": "Expresses frustration with \"professional\" developers and overreliance on plugins; moral judgment.",
    "composite_score": 3.4016679200330335
  },
  {
    "score": 50,
    "title": "F*ck it.. I just start!",
    "selftext": "The time has come.. I am developing (custom coding) WordPress and WooCommerce websites/plugins for 13+ years now. \n\nI have always had the feeling of knowing quite a lot in this area, but couldn't share my knowledge with enough people in the world... and that frustrates me.\n\nThat is why I decided to start a YT channel where you can watch and learn from an experienced dev working on a WooCommerce shop (from scratch), 1 hour a day. \n\nThis includes custom coding, but also automations, decision making and using AI to speed up processes.\n\nI have just started and created the first 8 video's now. \n\nPlease don't (fully) roast me, but I am looking for some form of feedback and first impressions to keep sailing in the right direction. Can this be(come) valuable for people??\n\nThank you and I hope you will learn something from it.\n\n[https://www.youtube.com/@RobbertVermeulen](https://www.youtube.com/@RobbertVermeulen)  \n\n\nhttps://preview.redd.it/mpbmcbojeljd1.png?width=2718&amp;format=png&amp;auto=webp&amp;s=0d81e2468c135cfc05c821916ba0bce1f047bdbc\n\n",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1724061042.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Personal update about starting a channel; lacks a clear model or steps.",
    "composite_score": 3.08325205817743
  },
  {
    "score": 50,
    "title": "I wrote a plugin that writes plugins with AI",
    "selftext": "WP-Autoplugin can quickly create functional plugins from simple descriptions, addressing specific needs without unnecessary bloat.\n\n- Free to use – no Pro version, no ads, no account required.  \n- Supports OpenAI &amp; Anthropic API.  \n- BYOK (Bring Your Own Key) policy.  \n- Full control over the generation process.  \n- Can also fix and extend plugins.\n\nHere is a quick video showing how it creates a plugin and then how it fixes a bug in it:\n\nhttps://reddit.com/link/1e76kqu/video/jspjm4y1vhdd1/player\n\nIt's available on Github: [https://github.com/WP-Autoplugin/wp-autoplugin](https://github.com/WP-Autoplugin/wp-autoplugin)",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1721403130.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Describes a tool's capabilities and benefits, informing readers about a new approach.",
    "composite_score": 3.1366710381314338
  },
  {
    "score": 48,
    "title": "Roots/Sage is fantastic!!",
    "selftext": "TLDR: Roots/Sage theme is super cool and you should check it out if you like developing custom themes with PHP.\n\n\nI am a senior developer in corporate 9-5 and have started a small freelance web dev business on the side.\n\nI have never been a ‘no-code’ WP user, always opting for doing custom vanilla classic themes in PHP, css and js.\n\nI love to code but thought my wp approach was a little out of date and over-the-top for the average client. I don’t want to just be a theme installer but I want to make the return on hours-invested make sense.\n\nThen I found roots/sage… what a dream! Full blade templating, great docs, tailwind integration, asset bundling/compilation, the list goes on. This feels like I’m developing a modern full-stack app/website!",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1728563031.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal endorsement and narrative about a framework; not a guide or model.",
    "composite_score": 3.2019224182716073
  },
  {
    "score": 47,
    "title": "I had a client request for a custom block that used ChartJS, so I documented the process in hopes it might be helpful for others!",
    "selftext": "I was pretty surprised I couldn't find an existing block that did what I wanted, so I wrote one custom and thought I might as well make a tutorial about it, since I still see the custom block workflow discussed as being somewhat elusive. Hope it helps someone else (and happy to hear any feedback for improvement, as well!)\n\n[https://cheewebdevelopment.com/pie-chart-wordpress-block-react-chartjs/](https://cheewebdevelopment.com/pie-chart-wordpress-block-react-chartjs/)\n\nEdit - wow guys, thanks for the feedback! I didn't expect this post to gain much traction. It's pretty amusing that it doesn't have a single upvote on r/wordpress, but that community seems to be more Elementor than Block Editor. 😅Anyway, super happy it's helpful! I have another custom block tutorial that I have in mind and this has motivated me to get that one going next!",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1720624626.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares a documented process to create a custom block, aiming to help others.",
    "composite_score": 2.8933624920952496
  },
  {
    "score": 42,
    "title": "What’s a small but powerful WordPress plugin you recently discovered?",
    "selftext": "Let’s skip the big names for a second (ACF, Elementor, WooCommerce, etc.).\n\nWhat’s one underrated WordPress plugin that genuinely improved your workflow or saved time on a client project?\n\nI’ll start:  \n\"WP Code\" - super clean interface for adding custom code snippets (JS/PHP/CSS) without touching theme files.\n\nWould love to hear your favorites - especially ones that are lightweight or solve niche problems",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1752553878.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for recommendations; simple question without substantial content.",
    "composite_score": 3.237862369252364
  },
  {
    "score": 39,
    "title": "What tools do you use to sync content between WordPress environments (dev/staging/production)?",
    "selftext": "Hey everyone!\n\nI'm going a bit crazy trying to figure out the best way to sync content between my WordPress environments. Right now I have the usual dev/staging/production setup, but honestly, moving stuff between them is becoming a nightmare.\n\nLike, I'll spend hours getting everything perfect in development, then when I try to push it to production I somehow always manage to break something. Media files disappear, URLs get messed up, or worse - I accidentally overwrite content that was added directly to the live site.\n\nCurrently I'm doing manual database exports and imports like some kind of caveman, and it's driving me insane. There has to be a better way, right?\n\nWhat are you all using? I keep seeing WP Migrate DB mentioned everywhere, but is it actually worth the money? I've tried some free plugins but they either don't work reliably or miss half the content.\n\nAnd don't even get me started on media files - why is syncing images so complicated??\n\nThe worst part is my client keeps adding blog posts directly to production while I'm working on updates in dev, so now I have this constant back-and-forth sync problem.\n\nI'm sure I'm overthinking this, but I'd love to hear what's actually working for you folks. Especially if you have something that doesn't require a computer science degree to set up!\n\nThanks!",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1756296713.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Asks for tools to sync content; discussion prompt with no recipe.",
    "composite_score": 3.0295466653133714
  },
  {
    "score": 38,
    "title": "Moving from ACF flexible content to block editor - doesn't feel right",
    "selftext": "Hey all,\n\nLooking for some advice here on what others are doing.\n\nI've previously built extensively with ACF, using flexible content modules to create custom themes that feature various page templates. These pages templates have various content modules available for the client to edit, all with there own custom fields etc.\n\nWe can then build this out with our preferred file structure in the theme. Using webpack to build and compile all assets into a neat little theme for the client.\n\nThe client has the control they need (through ACF fields) and we keep the design in check through the custom theme.\n\nNow I've tried my best to move to the block editor, but I've always felt I've done this half-heartedly.\n\nACF blocks have been great so far. A perfect match of old-school PHP and the new block editor. We can still use Webpack to crawl through all our custom blocks and build the final asset files required. But I feel like going all in in custom blocks might be the way to go.\n\nMy main issue though is with the block editor itself. We've gone from a tightly managed theme/website for the client, to something they have way to much freedom over.\n\nI know you can disable core blocks, remove settings from core block where possible. But this seems so counter intuitive. The client now has so many customisable options per block, on every page/post of the website, and can mess with things. Fast forward months down the line, and new content etc has moved away from the tight brand guidelines we had in the past.\n\nOn-top of this, customising the block editor feels so \"hacky\". Overriding default block styles via CSS (if they can't be set via theme.json), dealing with the HTML outputted by core blocks and working within these constraints. It feels way less \"custom\" to me and more like I'm trying to force a horrible page builder website to look the way I want it to.\n\nMaybe this is a learning curve with modern WP that I'm still on, but each time I try to push into \"full\" modern WP, it doesn't feel right.",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1723530781.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Personal analysis and reasoning about moving from ACF to the block editor and design constraints.",
    "composite_score": 3.0853215769654425
  },
  {
    "score": 38,
    "title": "This Sub's Intent",
    "selftext": "I've been in this sub a couple weeks now and despite it being named \"Pro Wordpress,\" I'm\nMostly seeing very inexperienced questions and lots of \"throw plugin at it\" for things that have simple solutions. Hell, a recent post actually explains the basics of how to t/s WP which I think would be in r/wordpressforbeginners\n\nMy question, is this a sub for actual Wordpress professionals or is it for the \"Wordpress devs\" that don't know a thing about development and just toss plugins and Envato themes on site, pretend they can develop, but shit their pants when it comes time to write PHP, JS, or create a plugin? I'm beginning to think it's the ladder, and if so then does anybody have recommendations for a sub for actual WP professionals?",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1711554060.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Emotional critique of the subreddit’s audience and development focus with frustration.",
    "composite_score": 3.0690969105397485
  },
  {
    "score": 34,
    "title": "Wordpress.org launches a developers-focused blog",
    "selftext": "Found at [https://developer.wordpress.org/news/](https://developer.wordpress.org/news/) \n\n(You can read a formal ['PR-like' news release](https://wordpress.org/news/2023/03/introducing-the-wordpress-developer-blog/) published today announcing it). \n\nFor the first couple years of Gutenberg, there was a real lack of documentation and current tutorials explaining the philosophy and ideas behind the block editor and as well how to adopt it. \n\nOver the past year or so, Automattic has hired several employees to write content (tutorials, updates) to improve and also to keep broader track of the changes in the block editor. \n\n(Not a paid Automattic employee, just a developer who appreciates the tutorials being written and wants to share it).",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1680110812.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.75,
    "category_rationale": "Announcement about a developers-focused WordPress blog with explanatory value.",
    "composite_score": 2.2715680443502757
  },
  {
    "score": 35,
    "title": "Will Gutenberg keep deprecating blocks?",
    "selftext": "I work at an agency that builds about 20 bespoke websites per year.\n\nRight now we build with ACF flexible content and our sites can be easily maintained and updated without programmer help. Our marketing team is able to self-serve for most site changes, which I love.\n\nWe try to follow the main path, so updates are easy. With the exception of a few plugins, most of our sites went from php7 to php8 with no problem. Yay!\n\nI'm loving the idea of Gutenberg so our marketers will have a visual representation of the site in the admin, I think that would make their lives easier. But I worry about the side effects of that. When I was reading about Gutenberg, I noticed some blocks that were deprecated. Is that part of the growing pains of being new? Or do you think lots of blocks will be deprecated in the future?\n\nMy big worry is that we switch over to this and then in a few years I have 60 tickets to update 60 sites that use old blocks or patterns that can no longer be updated when WordPress updates to the latest version. Maybe I'm overthinking it?",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1707127249.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Presents concerns about Gutenberg block deprecation and its impact, with reasoning.",
    "composite_score": 2.8268665186064066
  },
  {
    "score": 33,
    "title": "What’s A Solid Modern Workflow for Professional WordPress Development?",
    "selftext": "Hey everyone,\n\nI’ve spent the last few years working in web development with JavaScript/TypeScript frameworks, Python, Docker, and other tools. Before that, I freelanced building WordPress sites using Elementor, back when I was just starting out and didn’t have much coding experience.\n\nNow I’m diving back into WordPress, but Elementor doesn’t really fit after getting used to more code-heavy workflows. I haven’t kept up with WordPress trends lately, so I’m looking to approach WordPress development in a more “professional” and modern way.\n\nI’m open to learning PHP and other relevant tools, but I’m not sure where to start. Any recommendations for a solid development stack, tools, or best practices for professional WordPress development?\n\nThanks so much!",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1734351621.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.64,
    "category_rationale": "A request for recommendations on a solid WordPress development workflow rather than substantive content.",
    "composite_score": 2.9671597639593914
  },
  {
    "score": 29,
    "title": "Are Security Plugins Worth it?",
    "selftext": "I've been slowly trying to become more adept at developing on WordPress builds, and relying less on 3rd party tools. My first step has been shifting from 3rd party Themes to building custom Themes myself.\n\nI'm now looking into how I manage other aspects of putting together WordPress websites. For instance, right now I tend to install three plugins: a security plugin, a backup plugin (although I often do manual ones for redundancy), and an \"optimizer\" plugin.\n\nFor now I'd like to tackle the security functionality on my builds.\n\n**I was wondering if it's a good idea to keep using something like Wordfence, or (on siteground) the \"Security Optimizer\" plugin - and not reinvent the wheel. Or if It'd be better to secure it myself without using third party plugins?**\n\nIf you think the later is better, could you comment on how you'd approach it securing the site without third party plugins? For example, would you suggest building a plugin myself, or something else entirely.",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1758028565.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Evaluates security plugin approaches and outlines reasoning for DIY vs third-party plugins.",
    "composite_score": 2.9787275116073344
  },
  {
    "score": 28,
    "title": "What’s your CMS fallback?",
    "selftext": "I want this to be drama free, no WPE, no talk about Matt or the current situation.\n\nFrom a purely objective standpoint, If it all falls apart, what would be your next CMS if Wordpress wasn’t on the table?\n\nOne that would be the easiest to move to while trying to keep an easy to maintain system, with easy barrier to entry for devs.\n\nUpdate: Thanks for everyone’s feedback on this, it’s been great to see all the different perspectives.  From the feedback I think will start looking at picking the cms to fit the site, instead of always just going with WP for the sake of it.  Shopify, Craft and Sanity seems to be the winners here to me.",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1728819998.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.63,
    "category_rationale": "A question about fallback CMS options, seeking opinions.",
    "composite_score": 3.0616394721759237
  },
  {
    "score": 25,
    "title": "I can't deal with Bricks. I bought a lifetime license, and clicking to build a website seems like insanity.",
    "selftext": "Myself, 4 devs, and 1 UI/UX designer in my team all spent two days trying to build a website using Bricks, and while it's WAYYY better than anything I've used before, we're just too far down the custom theme rabbit hole.\n\nOur current process involves building sites locally with Lando, Bedrock, and Twig with BootStrap as a boilerplate for our themes. Everything is 100% custom in terms of design. We're so much faster with Twig (and sometimes Blade) that switching to a page builder is slower. I'm sure we could dev faster if we got the hang of Bricks, but after experiencing the ultimate freedom of coding everything, I don't think I could go back. Not to mention how sad my team would be using a page builder lmao.\n\nIf I could sell this damn license I would. Don't get me wrong, the Bricks team are SO good, and they have an amazing product, but they have built something that we're not the target audience for.\n\nAm I missing out here? Should I just throw my license in the bin? lol.\n\nHas anyone made a \"backwards\" step towards page builders from custom themes?",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1714713080.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Expresses frustration about Bricks and licensing with humorous tone.",
    "composite_score": 3.0170892078363063
  },
  {
    "score": 26,
    "title": "Transitioning from ACF Flexible Content to the Block Editor",
    "selftext": "Are there any devs out there who can share their experience transitioning from building bespoke themes using ACF flexible content or an equivalent to building custom themes with the native block editor/full site editing? I have seen the block editor in use a lot with pre-built themes, and can definitely see the benefits from the clients point of view, however I'm yet to meet anyone who is building bespoke themes on a client by client basis that have adopted it. My main questions are:\n\n1) How do you usually make custom blocks, do you use ACF's block management? Or do you build out the whole component in react, and if so, does this significantly increase you dev time?\n\n2) How do you manage the inbuilt block types, for example lets say you want a text section, but you want it to look different from the standard styling, or you want to limit access to certain blocks for one reason or another?\n\n3) How do you manage content that isn't displayed as a page, for example let's say you have a custom post type of Testimonials that you use in a carousel on the homepage with a name and some text, do you disable the block editor for that post type?\n\n4) How do you deal with styles breaking of conflicting in the admin editor view, for example elements that are based on the viewport width?\n\n4) Do you think it provides a better experience for the amount of extra work that's involved?\n\nI'd love to make the move to the native block editor, but up to this point everytime I've given it a go I've hit some issue and due to deadlines I haven't had the time to dig deeper and find good work arounds. I also find the block editor kind of slow to load which has put me off even further.\n\nIf anyone has any insight or experience to share I'd greatly appreciate it!",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1675697720.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Long questions about migrating from ACF to block editor seeking experiences and guidance.",
    "composite_score": 2.77900001671064
  },
  {
    "score": 24,
    "title": "Moving Servers, ugh.",
    "selftext": "We host about 100 sites on multiple VPS servers at GoDaddy (originally MediaTemple, which was bought by GoDaddy, please don't judge me)\n\nSome servers have CentOS 7 as their OS, which will stop receiving updates on June 30. I'm trying to get ahead of it before it's urgent.\n\nRight now all DNS is managed/owned by our customers, and they point their A record to our IP address.\n\nTo migrate them, I was hoping GoDaddy could spin up a new VPS and assign the old IP Address to the new machine. Easy peasy. But not so, says GoDaddy. No matter what, I'm going to have to migrate code &amp; DB, and coordinate with the client to change DNS.\n\nFor those of you who host your clients, how do you handle DNS?\n\nDo you use your own nameservers so you can update your server whenever you need? But then deal with requests from them for new MX, SPF, etc each time they switch their CRM, mass email tool, etc\n\nOr do you just have them point their A record at your server and deal with the pain on the rare occasion you need to move them?\n\nOr is there an option 3 that is super amazing I'm missing?",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1708390237.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.63,
    "category_rationale": "A practical hosting/DNS question asking how others handle DNS during migrations.",
    "composite_score": 2.9801102833988287
  },
  {
    "score": 23,
    "title": "Switching from WP Engine to Kinsta",
    "selftext": "My agency was hosting mainly on VPS servers for a while and we have mostly transitioned everything over to managed hosting. A lot of our SMB sites have been moved to Flywheel and it's been great, no issues. \n\nOur larger sites have been moved to WP Engine and I haven't been happy with the service provided and I am thinking about making the switch to Kinsta for at least one for now to test.\n\n1. What has your experience been with Kinsta, and how do they compare if you've used both?\n2. Any other managed hosting providers I should look at?",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.77,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1729865296.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Discussion prompt about hosting providers; not a how-to or list.",
    "composite_score": 2.7587412373755873
  },
  {
    "score": 23,
    "title": "HIRING: mid level WP engineer salary range is $100k-135k and full benefits (health/401k matching)",
    "selftext": "I'm in need of another WP engineer on my team! I've been at this company for over 3 years and its a pretty sweet gig.  We run the headless WP for a editorial team of hundreds creating articles for some of the highest traffic sites in the world such as [healthline.com](https://healthline.com)\n\nHit me up if you apply! Link is here: [https://rvohealth.com/careers?gh\\_jid=4201648005](https://rvohealth.com/careers?gh_jid=4201648005)\n\nUS Only, fully remote, computer provided",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1679413133.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Standalone job posting; content not providing steps or a model.",
    "composite_score": 2.716320889078566
  },
  {
    "score": 21,
    "title": "Introducing Thorn: A Lightweight WordPress Starter Theme Inspired by Sage 8",
    "selftext": "Why Thorn?\n\nThorn is what happens when you want the clean build system of Sage, but without the overhead of Blade, Laravel-style service containers, or rigid folder structures.\n\nWe built Thorn for devs like us:\n\nFreelancers who just need to spin up a theme fast\n\nAgencies with teams that don’t want a deep Laravel learning curve\n\nWordPress developers who loved Sage 8 but want Webpack 5, Yarn, and Composer\n\nIt’s a respectful nod to the old Roots stack, rebuilt from scratch to be easier to extend, scale, and maintain—while keeping it human.\n\nGitHub: https://github.com/synmekthorn/thorn_wp\n\n",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1748739793.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains the Thorn starter theme and its design choices.",
    "composite_score": 2.4289983060140283
  },
  {
    "score": 21,
    "title": "WP 6.7 seems to break ACF blocks in  a small annoying way.",
    "selftext": "Just tried 6.7 on a test site where I register ACF blocks with a block.json, render them with a php file.\n\nIf I switch from preview into edit and then back again, then back into edit, I get errors in the browser console, sorry didn't copy them,  and see \"This block has encountered and error and cannot be previewed.\"\n\nRolled it back to 6.6.2 and all was as it should be.\n\nI guess ACF need to check this and do an update but just in case anyone using ACF blocks was considering an upgrade you might want to check this first.\n\nUpdate:  \nIt was Tab fields that were causing the issue, and it was due to SCRIPT\\_DEBUG being enabled.  \nMany thanks to [lgladdy](https://www.reddit.com/user/lgladdy/) for the answer.  \n",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1731513691.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.58,
    "category_rationale": "Frustration about WP 6.7/ACF issues with a tone of complaint.",
    "composite_score": 2.679299481298621
  },
  {
    "score": 21,
    "title": "New version of the GraphQL API for WordPress",
    "selftext": "After almost 1.5 years of development, and over 16000 commits, plugin \"GraphQL API for WordPress\" (which transforms the WordPress site into a GraphQL server) has a new version:\n\nhttps://github.com/leoloso/PoP/releases/tag/0.9.3\n\nThis release maps the whole WordPress data model into GraphQL, makes the schema more extensible, allows to assign categories to custom endpoints and persisted queries so we can organize them by client or application (or any other), and adds plenty of improvements (including compelling features that will be added to the GraphQL spec soon).\n\nEnjoy!",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1673711530.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Announcement of a GraphQL API version with explained improvements.",
    "composite_score": 2.421498306014028
  },
  {
    "score": 20,
    "title": "I've made something: private GitHub repository plugin updates via admin panel",
    "selftext": "Hi guys,\n\nI've been building WordPress plugins for quite some time now and up until now, I've used a GitHub actions workflow to build and clean up the final zip file for the plugin. Every plugin iteration was sent to the client to be installed manually.\n\nTo make life easier I've made a proof-of-concept implementation where the core plugin update system is hooked into to connect with the GitHub API to deliver plugin updates to the client. The only thing needed is a personal access token with sufficient rights to the repository.\n\nI know there are solutions to this problem that already exists, but personally I only need a very bare bones implementation to suit my needs.\n\nI'm aware that this is only useful in very specific scenarios, but I wanted to share nonetheless. Maybe people find it useful. I've tried to keep it API agnostic, so different API implemenations can be added without too much hassle.\n\n[https://github.com/fabrikage/git-updater-test-plugin](https://github.com/fabrikage/git-updater-test-plugin)\n\n",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1746367144.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Describes a proof-of-concept plugin update system and its rationale.",
    "composite_score": 2.5691909708873375
  },
  {
    "score": 20,
    "title": "Alternative to WordPress PHP CMS",
    "selftext": "With all the recent drama surrounding WordPress, I had to pause work on a lightweight, custom headless WordPress theme I was building from scratch for a client.\n\nThe reason I’ve found WordPress as a headless content management system (CMS) to be so effective is its low resource cost. Typically, I can set one up on AWS Lightsail for under $10 a month. I’m also very familiar with WordPress, custom themes, and leveraging both the RESTful API and Advanced Custom Fields (ACF).\n\nHowever, the current issues in the WordPress community have me concerned. I’m curious if others share this concern, and if anyone has thought about creating an alternative: a low-resource, non-WordPress PHP-based CMS.\n\nImagine a PHP-based CMS with a RESTful API, an administrative UI, and Advanced Custom Fields baked in from the start. This system could also include the usual setup with a MySQL database and be quick to spin up on a server, essentially replacing a WordPress instance.\n\nDoes something like this already exist? Or would it make sense to start building such a CMS to fill the potential gap if WordPress’s popularity continues to decline?",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.67,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1728652348.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Discusses an idea for a lightweight non-WordPress PHP CMS and asks questions.",
    "composite_score": 2.7944789210432286
  },
  {
    "score": 19,
    "title": "The 2024 ACF Annual Survey is now open!",
    "selftext": "**📣 The 2024 Annual Survey for ACF is now open!**\n\nWe want to know how people use ACF, how they’re building WordPress sites, and what needs to be improved or added to make ACF even better. In addition to guiding development, the survey will allow us to build a more accurate picture of our users and how they use WordPress and ACF.\n\nThe survey is open until the end of July. We will publish an aggregated and anonymized version of the results soon after.\n\n[https://www.advancedcustomfields.com/annual-survey/](https://www.advancedcustomfields.com/annual-survey/)",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1719488198.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.45,
    "category_rationale": "Link-driven announcement for an annual survey with minimal substance.",
    "composite_score": 2.5306206186877938
  },
  {
    "score": 21,
    "title": "site editor / block theme stuff sucks. Is this really how wp developers build sites?",
    "selftext": "Edit: I don’t have a strong opinion on Gutenberg. My real issue is with the FSE thing.\n\nI’m kind of at a loss. I keep telling myself I’m going to make it through the whole theme development handbook before posting, but now I’m in the section where they’re pushing me to use this visual “site editor” thing and I hate it so far.\n\nIt feels like a really shitty version of wix. And the docs keep suggesting that I don’t need to write code, instead I should do all my theme design work in this crappy visual editor and then copy paste it into the template file.\n\nAre Wordpress developers (the ones who write code) actually doing their “figma to live site” coding by not actually coding, and instead using this visual site editor?\n\nI’m trying to do some freelance work, and I want to provide professional grade websites, (not Elementor) so I thought I would do it the “standard” way first, which the docs are saying is block themes and the visual site editor.\n\nThe classic theme strategy feels much better for developers, but I didn’t want to get into an outdated method. I would like to go headless, but I thought it would be smarter to start with the “normal” way (block themes) first, since most existing websites are probably done that way.\n\nAre wp developers actually using this block theme &amp; visual editor stuff? I just don’t see how I’m going to be able to take an advanced Figma design and turn it into an actual website with this visual editor.\n\nPlease advise a new freelancer (but fairly experienced developer) on how to properly break into the Wordpress space.",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1706944857.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Expresses strong frustration with the site editor/block themes.",
    "composite_score": 2.709997669982159
  },
  {
    "score": 19,
    "title": "The Events Tribe Calendar Documetnation and Framework is so overly complicated.",
    "selftext": "it took 5 hours or more to figure out how to save extra attendee meta data\n\nthe hook provided did not work. You would think the following would work flawlessly:\n\n# tribe_tickets_plus_attendee_save_meta\n\n\n\nfinally had to use \n\n    tec_tickets_commerce_flag_action_generated_attendee\n    \n\nto get it to finally add meta data correctly.  \n\n\nThis plugin is the exact example of when developers try to get to cute.\n\nJust make it work man holy shit.",
    "subreddit": "ProWordPress",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1752482827.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Vent about plugin documentation and overall complexity with sharp language.",
    "composite_score": 2.6530899869919438
  },
  {
    "score": 18,
    "title": "New block type registration APIs to improve performance in WordPress 6.7",
    "selftext": "[https://make.wordpress.org/core/2024/10/17/new-block-type-registration-apis-to-improve-performance-in-wordpress-6-7/](https://make.wordpress.org/core/2024/10/17/new-block-type-registration-apis-to-improve-performance-in-wordpress-6-7/)\n\nI have a site with 9 custom blocks, and using the new block manifest the time to load them reduced by over 1/3. It does this by pre-parsing all your `block.json` files into a single PHP manifest, so you just need 1 additional build step, add a call to `wp_register_block_metadata_collection()`, and you're done.",
    "subreddit": "ProWordPress",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1729602618.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Provides an explanation of a WordPress performance feature and how it works.",
    "composite_score": 2.4912536009528288
  },
  {
    "score": 18,
    "title": "Corporate WP hell (horror story)",
    "selftext": "Have an ongoing horror story that I had to share. I haven't been able to find a proper dev role in over a year and took this contracting gig and it's a cluster so far.\n\nStarted contracting for a large corporation recently and they gave me my first WP site task and it's been a nightmare so far. I'm used to working with small teams in marketing agencies and I can't believe how this company has their WP sites setup.\n\nAzure server running Docker with the site in a container. I don't have FTP or SSH access to anything. I don't have a local dev environment. I'm having to use a plugin in the WP admin to view and edit the filesystem and I can't see or change file permissions. I can't access the server logs and WP debug log is only working half the time. I cannot install or modify anything about the server (wanted to install phpdotenv but one of the guys on the internal IT team was able to setup some Azure env vars for me, so that's alright).\n\nThey asked me to setup a vanilla HTML form to post to an external API that I have no visibility on and the team managing the API is overseas and takes hours to respond. As far as I can tell from the API schema they gave me, I've got my post request going through correctly and should be getting an integer back (I assume 1 for success, 0 for error?) but the API is returning 200 along with an internal HTML page for the platform the overseas team built the API on. I have no idea if my request is going through correctly and it's their API that's broken or if the schema and endpoint they gave me is incorrect or what. Doing a pretty standard curl post request off an AJAX call from the front end. I've tested my code every which way I can think of and without hearing anything different from API team, I believe my stuff is fine. Just spinning my wheels knowing that this whole task needs to be done ASAP.\n\nNo one on any of the internal or overseas IT teams knows WP and overseas team doesn't know PHP at all. Overseas team handling the API refused to even give me the API details at first and then completely changed the entire API from REST to GraphQL last second. I have a feeling their stuff is just a pile of jank. I've never used GraphQL before but as far as I can see I'm setting up my request right.\n\nI'm just nervous because I wanted to make a good impression but the setup I'm working with is making that a slim chance. I don't want to come off as a shitty craftsman blaming the tools but this is the most chaotic and wonky setup I've ever worked with.\n\nHave you had to work with a big corporate outfit that had dumpster fire dev setups with no standardization, organization, or proper communication? What did you do?",
    "subreddit": "ProWordPress",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1727980817.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Emotional vent about a frustrating corporate WordPress project with little constructive content.",
    "composite_score": 2.736240274938238
  }
]