[
  {
    "score": 407,
    "title": "After 20 years I’m done! ",
    "selftext": "Why did you raise the price so high? Why did you make it less beneficial to be a pro advisor? After a long shitty relationship that was kind of abusive with you, QB I out of here.  I’m moving on without you. I wish I could say it’s me not you but I can’t. It’s definitely YOU &amp; not me. I wish I could say it wasn’t a mistake staying so long with you. I’m afraid it’s one the of biggest mistakes of my life. I hate you QB….fuck off way over there &amp; far away from me. Please lose my contact information. ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 407,
    "downs": 0,
    "created_utc": 1708231930.0,
    "media": null,
    "is_video": false,
    "num_comments": 238,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.542359113563949
  },
  {
    "score": 187,
    "title": "Stop Forcing QuickBooks Online Updates on Small Businesses",
    "selftext": "\nAs an accounting firm owner who supports dozens of small businesses, I’m calling on Intuit to rethink how updates are deployed in QuickBooks Online.\n\n1. Small Businesses Aren’t Built for Constant Business Process Changes; regardless of how incremental \n\nQBO is the de facto choice for early-stage and small businesses. But here’s the thing: these companies don’t have full-time accounting staff. Often, a single person—sometimes the business owner themselves—handles everything from invoicing to payroll. Forcing frequent, non-optional updates disrupts workflows, causes confusion, and adds unnecessary overhead to already overburdened teams.\n\n2. No One Is Asking for These Updates\n\nAcross my client base, not one person has asked for the features being pushed in recent QBO updates. Universally, the feedback is the same: frustration, confusion, and resentment. People don’t want AI categorization or smart reconciliation if it means breaking their current workflows or UI familiarity.\n\n3. Zero Training, Zero Warning\n\nIntuit rolls out updates without proactively training end users. A UI change or workflow overhaul appears with no explanation. No onboarding. No warning. It’s unacceptable, especially when people are trying to meet tax deadlines or run payroll.\n\n4. The New Features Don’t Add Real Value\n\nExpense matching, AI-driven categorization, predictive recon—these may be shiny on a pitch deck, but they often offer marginal benefit for small businesses. Worse, they introduce bugs or make the software slower and harder to use. These “innovations” feel more like a way to keep engineering teams busy than to serve real user needs.\n\n5. QuickBooks Desktop (From the 2000s!) Still Gets the Job Done\n\nLet’s be honest: 95% of what a small business needs can be done with QuickBooks Desktop from 15–20 years ago. In many ways, it’s more stable and usable than the constantly shifting landscape of QBO.\n\n⸻\n\nA Better Way: Let Us Lock in a Version\n\nGive users the choice to lock in to a specific version of QBO. Let them opt out of future updates unless they choose to rejoin the update stream. Intuit could even charge for upgrades, just like perpetual license software. Everyone wins:\n\t•\tStability for the end user\n\t•\tFewer support tickets\n\t•\tRevenue from optional upgrades\n\n⸻\n\nWhy I Celebrate When Clients Leave QBO\n\nWhen my clients’ businesses grow large enough to justify moving to Sage or NetSuite, I breathe a sigh of relief. Not because QBO can’t handle their needs, but because I know their accounting experience will be smoother once they’re out of the churn cycle. That shouldn’t be the case.\n\nIntuit, you have a great product—just let us use it in peace.\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 187,
    "downs": 0,
    "created_utc": 1752461435.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8661428514316896
  },
  {
    "score": 159,
    "title": "QuickBooks Online Supervisor here (yes you can hate on me lol)",
    "selftext": "So backstory: yes, I am a supervisor for QuickBooks Support (Online and Payroll). I found this Reddit after hearing customer after customer state that they would rather come here for answers than call support or chat with our agents via the text feature, so I had to come by and see why, and well, I got my answer.\n\nThe community here is here to help each other with questions, allow people to go back and see what the fix for someone with the same issue is, if it was something that they can fix, or come to our support line.\n\nAnd another thing this community has is the same chaos energy of hate towards the program, and hey queens, you are not alone LOL.\n\nI always tell other supervisors, co-workers, and agents that if a company wants to really support its customers, it has to actually know what they want, what the issue is, and a quick way to fix it, and I myself, as a supervisor, can state that is simply not QuickBooks Support.\n\nThe scripts, the resources, the outsourcing of our support line hires—everyone gets different training, different rules and restrictions, and nobody is on the same page.\n\nSo here I am; hell, someone has to be open, and honestly, I love my job. I love my agents I get to train to support and do the job as it should. I love the other supervisors I work with, and I love the customers I have gotten to help and provide a solution to their problem but also get to know them and know their business, not be a robot.\n\nSo why am I here? Good question; still figuring that one out, to be honest. But I guess I'm here to be a punching bag or your local gally you can tell to screw off due to the company, or simply ask questions and get real answers without the bull crap. I really don't know. But I'm happy to help anyway I can. Got a question about support and how IT REALLY WORKS? Bet, ask me; got a question about your product.\n\nor an update, send it, or want to tell me random crap or tell me to off myself (has happened plenty of times on a recorded line), then also go for it lol.\n\nAt the end of the day I make this post so you guys know that there are humans that do work at Intuit, and not all of us are bad, just bad choices of a corporation, and honestly I would leave in a heartbeat, but this job puts food on my table for my family, and so does yours; we are both humans.\n\nAnywho, if you actually read all of this, then congratulations on your reward? Not me being a salesperson, because I don't get paid extra to sell you things since I'm a supervisor!\n\nAnywho, I wish everyone's families and businesses the best of luck, and thank you guys for accepting me into the community. When is the family BBQ where we all hate on QBO?\n\nEDIT: Holy crap this blew up, I am trying to reach each comment I can so please bare with me.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 159,
    "downs": 0,
    "created_utc": 1757399087.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9821840004950437
  },
  {
    "score": 145,
    "title": "Wow. What a totally worthless sh*t platform.",
    "selftext": "Never in my life have I been compelled to get onto reddit to complain about something. \n\nSo if anyone from QuickBooks is reading (and I hope you are!) let's start with the RUDE and not helpful chat agent I had on Friday. Seriously, wild. \n\n**General grievances:**\n\nTo keep jacking up the desktop price each year by several hundred dollars? **CRIMINAL**. Seriously, you suck. Did I get that kind of raise? No. It was $700 last year, up from $400 the year prior. This year? OVER $1000 with tax. Absolutely mental.\n\nSo I switch to Online, maybe it's cheaper! Pricing looks cheaper online, seems easy enough to migrate. BUT WAIT! It **automatically** signs me up at the **HIGHEST** bracket, no option to select needs. Can't downgrade without calling. ***SERIOUSLY THIS SUCKS, I don't care if it's a 30 day trial. To \"downgrade\" it requires a call.***\n\nOn top of that, the Online version is SLOW and doesn't integrate properly with apps. \n\nIf you work for QuickBooks: **do better.** \n\nIf you're anyone else, seriously f\\*ck QuickBooks.\n\nhttps://preview.redd.it/ul0ftj6fg6pf1.png?width=540&amp;format=png&amp;auto=webp&amp;s=3d2735f3f0faaac65b1155fcb648aea6892fc308\n\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 145,
    "downs": 0,
    "created_utc": 1757876339.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.873652941665396
  },
  {
    "score": 135,
    "title": "Enough with the forced subscriptions. WE DONT WANT THEM!!!",
    "selftext": "Today's angry rant:Intuit Quickbooks used to cost a couple hundred bucks every four or five years to upgrade to the latest edition. Now with the new forced subscription it costs me $649 every year. And that's up from $199 just a couple years ago. How long til it's $1000??? And if you don't pay it you lose access to everything. Same software as before, nothing has changed. They just jacked the price through the roof for a subscription service I don't want. I'm getting nothing extra for my money. I spent 3 hours this morning back and forth with customer \"service\" til they eventually hung up on me (not sure if they meant to or not but no one called me back). If anyone at intuit pays attention to what is said online, please realize you are spitting in the faces of your loyal customers, and I'll be actively searching for an alternative.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 135,
    "downs": 0,
    "created_utc": 1730210110.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.776087928377346
  },
  {
    "score": 136,
    "title": "Could Intuit suck any more?",
    "selftext": "Currently on hold trying to cancel my QBO trial subscription, minute 31 so far.  This after trying to cancel online several times.  The website gives an error code and a message to call in to cancel.\n\nAmazing watching this company consistently screw over their small business customer base.  It's been bad for my 20 years of using them, but I feel like they are ramping up the abuse lately.\n\nEdit:  50 minutes now, on hold some more with rep #2.  She can't cancel it either somehow.  Amazing.\n\nEdit #2: 1 hour 10 minutes in to this call, my hold times are trending longer.  I was asked to try to cancel again in incognito mode this time.  Big surprise- it didn't work.\n\nEdit #3: They can't figure it out either.  The rep \"escalated it to engineering\".  I'll be waiting for their call that's never going to come.  ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 136,
    "downs": 0,
    "created_utc": 1711394585.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8582844939562557
  },
  {
    "score": 111,
    "title": "Reached my limit, building something better for this community",
    "selftext": "I've reached my limit with QuickBooks Online. After nine years of doing bookkeeping and accounting for small businesses, I've had enough of the constant price hikes and subpar support. That's why I'm taking matters into my own hands and building an accounting tool that's ready to challenge the status quo.\n\nI'm teaming up with a buddy who shares my frustration, we've spent weeks interviewing fellow accountants and business owners. We're armed some insights and a clear vision of what needs to change: affordability, better reporting, and support that actually supports you.\n\nAny words of wisdom as I embark on taking on a juggernaut? Would anyone be interested in Beta testing when we get to that point?\n\nEdit: Thanks for all the feedback. We are wrapping up our first round of user interviews this week. We have a pretty good idea as to where to focus/what to build. We will likely have some mockups ready by this weekend and a first version ready to share in a couple weeks. DM me if you want me to message you to take a look!  \n\n\nEdit 2: I just created a form for folks interested in staying connected via email [https://forms.gle/kchviRoi1GLn1sXk9](https://forms.gle/kchviRoi1GLn1sXk9)",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1708441618.0,
    "media": null,
    "is_video": false,
    "num_comments": 138,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.855725422797229
  },
  {
    "score": 108,
    "title": "Anyone Else Stuck on the Latest Update? \"Writing System Registry Values\" 28%",
    "selftext": "I have 2 servers both 2022, both stuck on \"Writing System Registry Values\" and both at 28%.\n\nOne is on Enterprise 24.0, the other is using Pro Plus 2024, but both stuck updating with the latest patch.\n\nUpdate: It does appear to go through eventually, but it took about 2 hours on both servers. I've updated 6 completely different servers now, and they all take this long with the latest update.\n\nUpdate update: Thank you so much! As a few have pointed out, it appears to be Windows Defender blocking the update. Switching it off (Windows Security &gt; Virus and threat protection &gt; Manage settings &gt; Real-time protection) appears to allow it through at a normal pace. Of course remember to switch it back on after!\n\nHugely appreciate the replies, thanks again all.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 108,
    "downs": 0,
    "created_utc": 1728404936.0,
    "media": null,
    "is_video": false,
    "num_comments": 153,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8811868583588556
  },
  {
    "score": 105,
    "title": "WHERE’S MY EMPLOYEES MONEY",
    "selftext": "Intuit QuickBooks didn’t process payroll for their customers so who knows how many people are waking up this morning wondering where their payroll is. Wide awake on the Friday of Labor Day weekend, at 630am on my first day of vacation wondering why I haven’t been paid and worried my employees weren’t paid when I processed payroll on Wednesday!!!!!!\n\nQUICKBOOKS CUSTOMER SERVICE DOESNT OPEN UNTIL 8AM.\n\nWTAF.\n\n***UPDATE***\nI was told “it shows your payroll was processed, there will just be a delay due to the holiday weekend, it will processed today”…. No apologies. No explanation. I’m done with QuickBooks. Next week I start the process of finding a new payroll company. \n\n***SECOND UPDATE***\nThey pulled our payroll tax out and a couple employees have been paid. No one else as of 10am EST. \n\n***THIRD UPDATE***\nPosted to their website:\n\nQuickbooks Online Payroll Issue\nMonitoring - Update on Ongoing Payroll Issue - Payroll processing is complete, funds should be available by this afternoon\nAug 29, 2025 - 07:42 PDT\n\n***FINAL UPDATE***\nAll of my employees have been paid as of now, including my boss and myself. QuickBooks as a payroll service is bullshit and this is the second time something like this has happened since I joined them 6 years ago. I was an idiot then for not jumping ship - they won’t get me again. ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 105,
    "downs": 0,
    "created_utc": 1756468011.0,
    "media": null,
    "is_video": false,
    "num_comments": 158,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8460044274249956
  },
  {
    "score": 103,
    "title": "Is it just me or is the entirety of QBO just slowly disintegrating?",
    "selftext": "Like just in general I'm experiencing more bugs and really poor user interface issues than ever. The new reports are just GHASTLY and the support is becoming more and more non existent. I noticed there's a queue now for even online support. And my account manager just straight up stopped returning emails and phone calls. Any other bookkeepers having this issue? Does anyone have any realistic platforms they're switching to?",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 103,
    "downs": 0,
    "created_utc": 1755055855.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.606671274099175
  },
  {
    "score": 98,
    "title": "We’re Done With QuickBooks Online — Features Disappear and Reappear With No Warning, No Explanation, and No Accountability",
    "selftext": "Just need to vent. Our law firm relies on QuickBooks Online every single day for time tracking, billing, and invoicing. Over the past year, the platform has become completely unreliable.\n\nWe’ve had core features vanish (like time entry fields), breaking workflows that are fundamental to our business. Then—days later—those same features mysteriously reappear. No notice. No update. No explanation. Support is totally in the dark every time.\n\nThis isn’t an isolated bug. This is a pattern. A premium-priced business platform should not behave like some underfunded beta project. The worst part? Customer service has no idea these changes are happening. They shrug and suggest clearing cache, as if we’re all new users who don’t know how to troubleshoot.\n\nWe’re now actively exploring other accounting solutions. At this point, we assume anything else will be more stable and professionally managed. \n\nIntuit has completely lost our trust.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1746560102.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5973491913790188
  },
  {
    "score": 97,
    "title": "Dear Intuit..",
    "selftext": "Dear Intuit,  \n\n\nDue to your greed and price gouging on Quickbooks Desktop and your attempt to force everyone into your yearly subscription scheme and onto Quickbooks Online (which is a horrible service, by the way), you just lost a payroll client, and I just lost a payroll client.   \n\n\nIf you would have stuck with one-time purchase, perpetual licenses like you have the entire existence of your company until a few years ago, this client would have given you the money for Quickbooks Desktop 2023, and the yearly cost of the payroll package, but since you seem dead set on ruining your own company, you lost a client and I lost a client. Good job, assholes!  \n\n\nOur firm will no longer be recommending any of your products to our clients and we will begin phasing out the use of your products in our office.   \n\n\nYour greed has hurt both of us. I hope your shareholders are happy.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 97,
    "downs": 0,
    "created_utc": 1684517923.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6909674117675793
  },
  {
    "score": 85,
    "title": "I QUIT cannot support this product or it's customer service anymore",
    "selftext": "After 6 years of being an accountant care customer service rep for quickbooks online I literally quit mid shift today. They outsource jobs, don't pay livable wage and wonder why support is so bad? The pool is pretty shallow at 13$ an hour.\n\nThe final straw is the \"new invoice experience\" imagine being a support agent taking all those calls? All  I want to say is \"You're right program sucks, stop adding features, and fix the existing ones the price increases are outrageous, you shouldn't have to look at popups when you're paying for a subscription\"\n\noh and anyone using recurring sales receipts that use automatic payments? guess what? double check that they are paid, latest disaster is program is marking them as paid but not processing the payment be sure to look at your merchant service account to confirm that they have been paid (settings, payments, manage my account)\n\nI cannot defend that product or it's support service anymore. I was \"the gem\" you hoped you would reach when you called support, I am the last of a group of smart and talented agents no one can take it anymore the new hires are TERRIBLE they have no training and no motivation to learn or try to make themselves better.\n\nThat being said I am incredible at QBO, anyone needs help with cleanups, technical issues, please let me know!",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1715286569.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.435237909764695
  },
  {
    "score": 83,
    "title": "Please stop the UPSELLING of features.",
    "selftext": "If anyone with some significant power within Intuit is reading this, please stop the constant upselling within QBO.\n\nI use QBO every day, and every time, I have to close upselling windows, especially regarding \"payroll.\"\n\nIf I have said NO to the upgrade ten times a day, how likely am I to suddenly hire people and need to do payroll? Right, not very likely.\n\nIf it were a small task to swap from QBO to something else, I would in a heartbeat.\n\nhttps://preview.redd.it/wp80i437rxwd1.png?width=1425&amp;format=png&amp;auto=webp&amp;s=5f528651c09404dd1288ffc51d7824a0f1243c5e\n\nto hire people suddenly",
    "subreddit": "QuickBooks",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 83,
    "downs": 0,
    "created_utc": 1729876396.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3978583017329913
  },
  {
    "score": 80,
    "title": "Cancelled my QBO subscription yesterday",
    "selftext": "I was getting more and more frustrated with QBO making a mess of my books, constantly changing things, throwing ads in my face all the while charging a monthly fee.\n\nAbout a month ago I started a trial with a competitor. I'm not going to say who because I don't what this construed as astroturf. After signing up they offered to perform the import from QBO. Via a remote session they imported all my accounts, customers, and invoices without a flaw. The last couple of weeks I've been invoicing out of the new program and everything just works. No ads , no upsells, nice integrations. \n\nSo yesterday I said seeya Intuit. It sure feels good.\n\nBottom line of this post is, there are good alternatives out there. If you spend a bit of time trying them out, you'll find one that works for you.\n\nUpdate: Ok I went with Zoho Books. I really like it. I spent an hour today cleaning up the journal entries that QBO had caused and it went smooth as all. That said, one size does not fit all. There's a few very nice alts out there. Zoho has just been really nice for me so far.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 80,
    "downs": 0,
    "created_utc": 1723669091.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.57729856452387
  },
  {
    "score": 80,
    "title": "I'm done. The \"new\" UI is the final straw. What's the best way to export my data?",
    "selftext": "My company is fairly small and simple. The new UI was forced on me today and the constant \"updates\" QBO does, shoving AI down my throat and making everything SLOWER AND WORSE with every single change. I'm done. I am not giving Intuit any more of my money and I will also be advising all of my clients, peers and friends to switch if they use it and avoid it at all cost if they're looking for a bookkeeping system.\n\n I see that there is an excel export option built in which I have already used but the new service I want to try is asking for CSV format. I'm assuming that QBO makes it deliberately difficult to export data into a good/digestible format for another software to utilize so if there is a third party tool or service that does this well I'm open to suggestions. \n\nAlso, DO NOT DM ME about this. If you have a suggestion then you can write it here publicly. I'm so tired of QBO and small business \"gurus\" trying to sell me services in DMs\n\nI'll be happy to report my exeprience with this as well. I see that I'm not the only one that's had enough. How do things like this even happen? Who is responsible for these decisions? If anyone knows who it is please punch them square in the face for me, thanks.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 80,
    "downs": 0,
    "created_utc": 1763668543.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.434876947238517
  },
  {
    "score": 81,
    "title": "Quickbooks online has The WORST Support. Ever. Has anyone tried to file a class action?",
    "selftext": "Has anyone considered filing a class action against QuickBooks Online?  It feels criminal that they can provide such terrible support if you don't pay for \"premium\" support.  It's not just bad support, it's actively awful.   You can't convince me that they aren't actively trying to drive people into paying for support on  a product that we already pay for.   Literally a waste of hours whenever I try to get a question answered.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 81,
    "downs": 0,
    "created_utc": 1704238084.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4801927682245037
  },
  {
    "score": 76,
    "title": "Quick Books $$$",
    "selftext": "Is it just me or does anyone else feel like they’re getting raked over the coals by QB online?\n\nI own and operate a small construction company with 4 employees &amp; it costs me close $200 per month. I think it’s a useful tool but I feel like I’m being ripped off every time my bill comes 🤮. To make matters worse every time I call for some simple problem I end up on the phone with the operator for usually around an hour &amp; Ive had multiple instances where the problem still occurred. \n\nAnyway I don’t know if there are any other options that accountants like using but I’d be open to suggestions. I don’t find QB worthy of over $2k per year. ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1727653313.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5655357186684538
  },
  {
    "score": 74,
    "title": "Daily complaint about the terrible interface",
    "selftext": "Each time I log onto QBO they have moved more stuff around, and taken away my ability to return the screen view to what it was before.  Almost every task takes more clicks, and the modern reports look like absolute garbage.  Now I’m having to walk other staff through it, because they don’t use QBO as much as I do, and can’t easily find the information they need anymore.  I’m also bombarded with ads for other services they offer, that I have no interest in.  If this was freeware, I could live with that.  But we are paying increasing monthly amounts for a product in decline that is riddled with advertisements and useless features.  I’m starting to use the new reports anyway, so I don’t get in a jam when they take the regular reports away.  I know it’s spitting into the wind, but I can’t understand why they want to destroy their interface and product.  I can only hope that the executives and developers that think they are providing value with this busywork lose their jobs eventually.  I don’t expect anyone to come up with a good replacement anytime soon, so I guess I will just finish out my accounting career dealing with this nonsense.  If all these new reports had any value, they would be charging people extra for them.  Instead, they are raising rates overall, and making their product more complicated and less useful every day.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1761071999.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3487602623411776
  },
  {
    "score": 73,
    "title": "QB Price Increases",
    "selftext": "The online QB subscription has become the biggest rip off in small business book keeping and accounting.  I was a Desktop Pro user for years, as my CPA uses QB. I would buy a new one every 3 years. The price was reasonable. Now that isn't possible and the online prices are exorbitant on the level of extorsion. Their online sales people guided me into their QB Online Simple Start, so I listened to their advice, and while we are doing data entry we find that it excludes the ability to add \"CLASS\" to our expenses. It's unbelievable, for $30/mo, you cannot add CLASS. To get that \"feature\", guess how much you have to pay ----- $90/mo !!! It's ridiculous.  Everyone relies on QB, they were already making a healthy profit, and suddenly this unscrupulous company with a near monopoly quadruples their pricing model. Sounds a whole lot like they hired a MARTIN SHKRELI clone to advise on price gouging !  Should there be some form of consumer protections against such price abuse by an industry standard monopoly? Even though we are in a free market, this is pathetic abuse of an industry adapted standard.  The industry standard isn't going to change, CPAs are not going to dump their QB setup that took years to learn and train on. I really think it should be investigated, even if only by investigative journalists,  as it effects nearly every business in the country.  Doing your taxes is not a luxury optional item, you can't just say I won't do taxes this year. It is required by penalty of law. And banks require your tax returns for any request for business loans, so the return is integral to your business. And you can't just realistically say I'll dump my CPA until I find one that doesn't use QB, as they all use QB, its industry standard! Like taking a required medication, you can't just choose not to take it without dire consequences. And this is where QB has everyone by the jugular, just as Martin Shkreli had all his pharma company's patients by a life death choke hold. In business, your book keeping and CPA and taxes are the equivalent of life or death for your business. So, lets hope there can be an investigation, by an investigative journalist, of this ridiculous and unscrupulous price gouging.  ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1706465992.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5664913460402854
  },
  {
    "score": 70,
    "title": "“I don’t do journal entries, because I don’t make mistakes”",
    "selftext": "I spent the last month (and still going) cleaning up our Quickbooks after a horrifyingly bad bookkeeper.  I knew she was bad, but I didn’t realize how bad.  \n\nWorse then being bad, she was super confident.\n\nOver the course of the last year and a half, I had suggested a bunch of ways to either streamline the system or just make her job easier because she was always behind.  \n\nNormally with bookkeepers, I would walk in with 4 or 5 tasks.  With her, I could only give her one thing at a time.  Somehow, this single task would result in an argument and me walking out frustrated.  \n\nThe tasks would be something like \n-xxx account looks wrong, can you look into it and figure it out?\n-Don’t itemize purchase orders, our inventory isn’t in quickbooks, so its a waste of time.  \n-Enter the year end journal entries from the accountant.\n-For customer sales orders and invoices, use a generic “Sale” item with a zero value COGS because our inventory isn’t in quickbooks and I want our p&amp;l report to be roughly accurate.\n\nAfter she left, I’m realizing she probably had no idea what I was talking about.  \n\nThe kicker is, as I was going back through her notes trying to fix specific issues, I saw a note she wrote…\n\n“I don’t do journal entries because I don’t make mistakes”. \n\nIgnoring the fact that she made tons of mistakes, this just seems like the stupidest thing a bookkeeper could say.  \n\nI have a novel about this bookkeeper that I’ll post one day.  It’ll be entertaining, but I lived through it. ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1751805605.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4524552286305594
  },
  {
    "score": 71,
    "title": "WARNING! We lost $30K due to ACH fraud through QuickBooks Payments — no dispute process, no reimbursement. Here’s what happened.",
    "selftext": "We’re a small business in Colorado, and recently suffered a devastating loss of over **$30,000** after using **QuickBooks Payments** to process ACH transactions.\n\nThree separate payments were made to us via ACH for our product. These transactions were initially marked “cleared” and the money was deposited into our bank account. We fulfilled the orders and delivered the product.\n\nWeeks later, QuickBooks informed us that the payer had **disputed the transactions** — reportedly because their account had been hacked. QuickBooks **immediately reversed the funds**, even though:\n\n* We had already fulfilled and delivered the product\n* The “payer” was unreachable (likely a fraudster)\n* We had disabled bank access after the first fraud alert\n* No process was available for us as the merchant to dispute or stop the reversal\n\nThey eventually **withheld unrelated customer payments**, and then demanded a $20K repayment — which we were forced to pay last week. Total loss: **$30K+**, including **$24,747 in unrecoverable product**. The product has since been seen resold out-of-state, and the FBI is now involved.\n\nQuickBooks has refused reimbursement and says this is standard per their Terms of Service. Their argument is: **merchants have no dispute rights for ACH, only for credit cards**.\n\n**Has anyone else dealt with this kind of ACH fraud or experienced the same limitations with QuickBooks Payments?** Would love to hear how others handled or avoided this type of risk.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1748619864.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5492394226231267
  },
  {
    "score": 71,
    "title": "Quickbooks is sending bots into this forum",
    "selftext": "Quickbooks is sending bots into this forum in attempt to appear helpful and to squelch some of the negative banter here. In one thread I challenged a \"user\" for being a bot, and the thread and user disappeared within seconds of one of my responses. \n\nI'm also seeing comments in threads now that are clearly bots, cheerleading for \"features\" that us humans see as very negative. \n\nBeware of the Quickbooks bots. They've come to silence our dissatisfaction.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1736294955.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2838025007672873
  },
  {
    "score": 69,
    "title": "Intuit is scum of the earth",
    "selftext": "So as many have commented here, I was informed by Intuit that my 2020 QBDT would be retired in May and was told that they were doubling the price in addition to requiring subscription payments annually. Although this pissed me off and the red (!) in the middle of my home screen did as well, I was eventually considering upgrading simply due to the hassle involved with migrating to another product. So today, the first of the month, I go to send out invoices and process payments, and literally every action I take in the program is preceded by some BS popup \"reminding\" me that I need to upgrade or I will lose the ability to do what I am doing. The popups for credit card and ACH processing were able to be dismissed and presumably bypassed for a period of time, but I get a popup every single time I email an invoice. I have had to click \"ok\" on this window over 100 times today and I'm totally done. Just in case anyone from Inuit reads this subreddit (unlikely), you will never, ever get a single cent from me again. Your can F right off with this nonsense. Your overly aggressive and invasive tactics are sickening and you have completely lost me.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5dxx37a1xdra1.png?width=525&amp;format=png&amp;auto=webp&amp;s=d3ae392416fcfa43608254eb04664b159157a12d",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1680403619.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.350749290397901
  },
  {
    "score": 68,
    "title": "Not switching to QuickBooks Online.  Subscription software is extortion. ",
    "selftext": "Been using QB Desktop since 2014 for a non-profit theatre. When I heard that they were forcing everything to online, I got pissed, but shrugged in resignation, sighed and started a subscription. But never activated it... the deadline in May 2024 came and went, and I'm still using Desktop.  And.... it's perfectly fine without the subscription.  \n\nFor me, the only impact is that I can no longer download transactions from the bank. I've had to resort to entering them manually - shudder. But that's actually pretty easy. I got through our busiest season with no issues. \n\nI hate the idea of having to pay QB to have access to my financial info. It's extortion. Transfer to the exorbitantly priced online service and you lose control of your data unless you keep paying their fees. I own the desktop version.... own it. they can't stop me from using it.  But once you move all your data online... there's no going back. You have to keep paying and paying and paying. \n\nWe've all gotten so used to everything happening automatically in our lives thanks to miracles of the internet that we've forgotten how we did things before... manually. Which isn't that hard. You can manage your finances without shelling out thousands of dollars to Intuit or other companies, while also retaining control over your data. \n\nI hate subscription software. It's straight up extortion. \n\nbtw, for my personal finances, I'm still using Microsoft Money (sunset 15 years ago). Same version that I installed on Windows Vista, then Windows 7, then 10, now 11. no problems. I'm also using old versions of some Adobe products from 2010 for design work... and they work fine. \n\nYou don't have to subscribe. ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1727195721.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4203057690586833
  },
  {
    "score": 67,
    "title": "Good bye",
    "selftext": "After years of constant attempts to force AI down our throats, revamps of user interfaces that made behaviors worse instead of better (what IS your obsession with having half the screen be wasted whitespace in an ACCOUNTING app???), and oh by the way how the hell did I end up with a Merchant Processing account I never asked for???  Yeah  You're done.\n\nYou all ignored feedback after feedback and you continue to think that you get to dictate to us how we should do our work.  You've bloated your packages to Norton and McAfee levels, you've got the arrogance of Oracle trying to be everything to every company and trying to make them think they have no other choices, and you keep jacking up prices because you're confident you can get away with it.\n\nI'm done.  My migration to Xero is complete.  I've even set up 3 different accounts in Xero for my org structure and it'll STILL be cheaper than it was managing one company with classes in QB.\n\nIntuit you need to wake up - your control of the market share is not carte blanche to think you control your customers.  You're headed down the path of market leaders like GM, Ford, Dell and Kodak to name just a few - companies who grew so big they forgot how they got there.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1756472791.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.252495586691645
  },
  {
    "score": 67,
    "title": "QuickBooks is the best product I've ever used!",
    "selftext": "Just kidding it fucking sucks. It's the worst pile of shit ever. Like what even is this page for? You can't create a case. They never give you a reference number when you call or chat. Why are these still opened? You can't click on them to get more details.\n\nIntuit you suck!\n\nhttps://preview.redd.it/zo3tuybd03ff1.png?width=1553&amp;format=png&amp;auto=webp&amp;s=2f0aec4b50746f70eae2b6eaa5c4b9c509578452\n\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1753476123.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1576451652578896
  },
  {
    "score": 67,
    "title": "**PSA: Never Use QuickBooks Merchant Services – They're Holding \\$200K of Our Funds**",
    "selftext": "Just a heads-up to fellow business owners: \\*\\*QuickBooks Merchant Services has completely wrecked our operations\\*\\*.\n\n\n\nThey're currently \\*\\*holding \\\\$200,000\\*\\* of our money, claiming they \"can’t locate\" our bank account. At first, they couldn't transfer funds to our original account. We had to shut that one down due to low balance (caused by this exact issue). We then opened a new account at a different bank—\\*\\*and they STILL couldn’t locate it\\*\\*.\n\n\n\nWe’ve called them \\*\\*over 50 times\\*\\*, spoken to multiple supervisors, and every single time we get a different excuse. No resolution. No timeline. Just chaos.\n\n\n\n\\*\\*Because of this, we’ve:\\*\\*\n\n\n\n\\* Missed payroll\n\n\\* Been unable to order inventory\n\n\\* Fallen behind on taxes\n\n\\* Missed credit card payments\n\n\\* Had a bank account closed\n\n\n\n\\*\\*On top of that, \\\\$20,000 was stolen from a Green Dot debit card\\*\\* (a partner of QuickBooks), and we've gotten zero help recovering it.\n\n\n\nWe're now contacting the \\*\\*FTC\\*\\*, \\*\\*Better Business Bureau\\*\\*, and \\*\\*filing a police report\\*\\*. This is serious financial damage.\n\n\n\nIf anyone has been through something similar—or has advice on how to recover funds or hold them accountable—please share. This has been a nightmare, and we don’t want other businesses to suffer the same.\n\n\n\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1750263173.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4019939148742457
  },
  {
    "score": 68,
    "title": "Quickbooks support is the worst.",
    "selftext": "Canadian user here.  I love the software.  But the support is absolute garbage every time I use it. Even if I posed the simplest questions these people seem a) to not comprehend what I'm asking, even the simplest of questions and/or b) have very little product knowledge. 90% of the time I end up figuring out the answer for myself during the hour or hours I'm on chat support with someone trying to \"help\" me.  \n\n&amp;#x200B;\n\nToday someone was trying to \"help\" me just to tell me after 20 mins that I have to call another department. Why do I have to spend another 30 mins trying to get someone else to help me? Fix my issue! Just once I would love to actually get support when I contact support. \n\n&amp;#x200B;\n\nBut I guess this is what happens when you offshore your labour to cut costs.  ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1711636851.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.395241019097123
  },
  {
    "score": 64,
    "title": "How many users felt physically ill when you received this email?",
    "selftext": "https://preview.redd.it/4tt7zs7ky83g1.jpg?width=661&amp;format=pjpg&amp;auto=webp&amp;s=33b790a2009055a18fc2bec25bf659b39dd3c689\n\nI have had nothing but scorn for the 'A.I.' features that they have added and it seems like with every new interface update the system keeps getting SLOWER and SLOWER.  I pray that this update doesn't cause even more headaches and problems for us small businesses to deal with.  Hate to say it but for what we pay for monthly, very little of our concerns are being addressed.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1764008448.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3646475844326487
  },
  {
    "score": 65,
    "title": "Class Action Lawsuit or Mass Exodus?",
    "selftext": "To all business that utilize QBO Payroll:\n\nShould our employees not have payments in their accounts by the end of day today, I believe we should pursue a class action lawsuit against QB and Intuit. This is an outrageous mistake on their end and the fact that this issue is occurring before a holiday weekend amplifies the severity. If no lawsuit is filed, we need to make them feel the pressure with a mass exodus from Intuit products. I’ve already identified a new payroll provider for the company I work for and have a few new systems in mind for general bookkeeping and accounting. This isn’t my first issue with QBO and Intuit with regard to processing and I plan on making it my last, I hope everyone else chooses to do the same!",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1756481160.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3266818703422634
  },
  {
    "score": 66,
    "title": "Quickbooks sucks",
    "selftext": "These greedy aholes have been jacking up the price so high that is almost becoming unaffordable. On top of the price increases, the features have either become worse or simply unecessary and stupid. They keep try and make you receive and submit payments on invoices/ bills for a fee... yeah no thanks i'll continue to send ACH/ wires for FREE through my CNB account. But today, I am at my limit with Intuit. I just saw this ridiculous announcement banner. How gross is it that our country now that a singular \"president\" with unlimited power to change on a whim how business is performed in the USA. Where is Congressional approval? Do we not live in a democracy? MAGA you are always crying FREEDOM but a singular invidiual making decisions like tariffs and payroll rates is not freedom or capitalism or free markets, you know this right?? I looked up the owner of Intuit after seeing this banner and OF COURSE is a mega Republican Trump donor. Does anyone have any recommendations for another accounting software? I have had it with this company.\n\nhttps://preview.redd.it/oazbp168sbcf1.png?width=2482&amp;format=png&amp;auto=webp&amp;s=efd5bf3c5258bb065f048199447f9e5007762a3d\n\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1752274758.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3590764745182264
  },
  {
    "score": 62,
    "title": "QuickBooks ACH Invoice Payments – Outrageous Fees! BEWARE",
    "selftext": "I run four companies with QuickBooks Online (QBO), three of which are very active. In Fall 2024, I created a new company, assuming the fees would match my existing accounts under the same QBO service level. Unfortunately, I was wrong.\n\nUpon receiving a $200,000 ACH payment via invoice, I discovered that for businesses started after September 2023, QBO charges a **1% processing fee with NO CAP**—meaning I paid **over $2,000** for a simple ACH transaction my bank would have processed for as little as $1.\n\nAfter escalating my complaint three times, QBO’s response was simply to **\"read the terms and conditions.\"** I admittedly missed this policy, but I never expected QBO to **charge different fees based on a company's start date** or demand such an outrageous cut of my transactions.\n\nAfter **2 hours and 45 minutes** on the phone, I was told I could get the fees refunded if I issued an **eCheck refund** and had my customer pay me outside QBO. That seemed like a solution—until I learned that QBO **would charge me another $2,000+ to process the refund!**\n\n**How is this real?** I feel completely **robbed** by QBO. **A 1% uncapped fee on ACH payments?** Why would anyone use QBO for invoicing under these conditions? This is **beyond unreasonable.**\n\nOne QBO representative even admitted that I’m **not the only one caught off guard and complaining.** Clearly, this is a widespread issue. Intuit needs to address this predatory pricing model immediately.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 62,
    "downs": 0,
    "created_utc": 1741443213.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4482972277750097
  },
  {
    "score": 64,
    "title": "How many times QBO?",
    "selftext": "How many times is QBO going to change my settings without my consent?  QuickBooks Online is truly a piece of shit.  If you are doing your pre-purchase homework on small business accounting tools, run from QBO.  I can't believe this company is in business. Absolute dumpster fire garbage and a new embarrassing client facing error on every single invoicing run.  Just pure dogshit.  Get Sage, Xero, Zoho.  Anything but QBO. \n\n[98&amp;#37; of QBO users experience this every month](https://preview.redd.it/4uz8cmmsgjtf1.png?width=245&amp;format=png&amp;auto=webp&amp;s=ecdc7626788bf14be1f89cde41e3c36183ab9b10)\n\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1759777147.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.221277274651652
  },
  {
    "score": 61,
    "title": "New QBO layout?!",
    "selftext": "Has anyone experienced it? I clicked around in it and its like they just added extra clicks to get to what amounts to what was already there. I have to click through a menu to get to my menu that I've already been using. Why the hell are you adding MORE clicks? I just don't get the purpose of these \"updates\". Like what you had worked, it had everything we needed. Why are you adding layers of clicking on top of that? Literally serves zero purpose. It looks like there are no new features, you've done the reverse of streamlining, like....wth? Like am I suppose to be amazed that everything now is light grey instead of the nicely contrasting colors you had before? Now my shit eyes have to work extra hard. Ohhhh there's ICONS now beside a few clickable items, soooo amazing! \n\nIt looks like AI coding/interface slop (which I'm assuming is what it is). I hope someone designs a decent competitor program and Intuit gets burned into oblivion.  \n\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1761747541.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.305542939881897
  },
  {
    "score": 64,
    "title": "Quickbooks is Trash",
    "selftext": "Title says it all. Quickbooks is trash, with every version it just seems to be going downhill faster than the last.\n\nGet continued errors asking for admin rights to open something when everyone on the server already has admin rights and shouldnt need admin rights to simply open a company file...\n\nIf someone sends you a corrupted backup by mistake, it will freeze and lockup Windows explorer and its impossible to delete the files, requires a server reboot and than deletion via cmd...\n\nTheir updates often break tons of other things....\n\nJust trash.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1733852259.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.384627353424324
  },
  {
    "score": 59,
    "title": "QBO is horrible and they aren't doing anything to fix it",
    "selftext": "I switched from Sage 50 to QBO because my accountant wanted to be able to look at my finances friom her office an hour away so I said OK.   Big mistake.   Huge mistake.\n\nOne of many complaints is no sales orders.   I would just say OK they will get to it but people have been complaining about the lack of it for over 8 years!    If I had a customer base that wanted a feature as simple as sales orders, I think I would have it accomplished in 8 weeks.   I mean really?\n\nOther things I don't like are the spinning dots when I am trying to load a page, random times it won't print checks (but thinks it did) and I have to delete all the checks and then reprint them or print them individually, some random error at times if I delete a payroll check where it won't let me until I call customer \"service\", and the list goes on.\n\nSorry guys, it was one of those mornings and I just had to vent.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1739376997.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3648652471651124
  },
  {
    "score": 58,
    "title": "With all the innovation in accounting software, why don’t we see a solid desktop alternative to QuickBooks?",
    "selftext": "I’ve been noticing this trend while working with different businesses: even with so many new cloud-based tools in the market, QuickBooks Desktop still holds a surprisingly large share — I came across a figure suggesting it’s still over 50% of subscriptions.\n\nWhat stands out to me is how many companies continue to rely on Desktop for things like:\n\t•\tStability with large company files\n\t•\tMore advanced or detailed reporting\n\t•\tThe familiarity of workflows they’ve used for years\n\nAt the same time, cloud platforms clearly win when it comes to accessibility, remote collaboration, and integrations.\n\nIt makes me wonder:\n\t•\tWhy do you think we haven’t seen a true desktop competitor emerge against QuickBooks?\n\t•\tFor those of you who use both Desktop and Online, what keeps you loyal to one over the other?\n\nI’ve seen the pros and cons of both in real-world use, but I’m curious to hear how the community here looks at it.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1758364907.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.465245925314922
  },
  {
    "score": 59,
    "title": "Hey Quickbooks - Maybe just make QBO Good Instead of Using Force",
    "selftext": "I have multiple clients all on QB Desktop.  I looked into QBO about 3 years ago, and have looked into it again since they started raising all the prices and discontinuing desktop purchases.  It might be fine for smaller companies with really basic needs.  It is missing so many things for more complex issues, including not being able to adjust/fix things but having to call customer service instead.  With the current state of QB customer service, I will not be switching.  I will change platforms for all my clients to something cheaper before I do that.\n\nWhy doesn't QB just work on making QBO better and appealing to QBD users?  Why don't they work on improving their customer service?  There are issues I looked up when I researched 3 years ago that still haven't been resolved. Ridiculous for known problems with an online platform that doesn't have to wait for new releases to make changes.   Instead of making it appealing and useful so people want to use it, they just keep trying to force everyone into it.  Crap strategy.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1732404889.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.322385478173437
  },
  {
    "score": 60,
    "title": "QBO is crap",
    "selftext": "QBO is more complicated than it needs to be. I had to update from desktop pro since other software I use now only works with QBO.  I spent 5 hours on the phone on Friday and 4 hours on the phone Saturday with support.  “Yes all your transactions will transfer over”, you only need to add all the information for payroll. Oh and your accounts won’t be reconciled anymore and you’ll have to put in journal entries on all your accounts to get them to match! Oh and you need to re reconcile. What horrible support and even worse product!!! WTF?  \n\nI decided to switch my personal accounts to quicken personal and business . It’s night and day difference on ease of setting up. And guess what? My accounts match and their automatic transaction categorization works correctly about 95% of the time. \nIf only quicken had the robust reports of qb desktop\n\nI decided to add my business accounts to quicken just to see how they are handled.  Sooo much easier to set up and import than qbo.  \n\nI guess I’m just here bitching because I was forced into a crappy “ upgrade” for QBO for a much  inferior product for over  4x the cost (and that’s just the 1st year) of qb desktop!  😖😖",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1711338658.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1179660875624204
  },
  {
    "score": 60,
    "title": "Intuit has gone full evil just like the rest of tech",
    "selftext": "Paid attention to a CC fee and realized it seemed high. Did some calcs, then searched my emails. Realized they changed the fees on me and I completely missed it. removed the .25 cent transaction fee by adding .009 percent, that's like over a dollar for most of my transactions... then the percentages went up to 2.99%  \nAfter raising subscription fees non-stop over the years, then not letting me downgrade and now this. I'm absolutely done with Intuit. They can go F\\*\\*K themselves.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1753362652.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.292363857185905
  },
  {
    "score": 58,
    "title": "QUICKBOOKS SUCKS",
    "selftext": "I need someone to give me a good quickbooks alternative. I've heard zoho is good I've heard sage 50 is good I heard odoo is good. What are the pros and cons of these. Please consider our company has multiple employees and we are a manufacturing and wholesale company. We need to sustain at least 10 users at a somewhat reasonable price. Quickbooks was asking for like 12k a year for this which is insane considering it's glorified excel. I really need help with this. It's imperative I be able to migrate everything from my 2017 quickbooks desktop to this new accounting software. Please help me with this.\n\nedit: We still haven't migrated anything but I think odoo or zoho are the best options for now. I truly can't stand the fact that quickbooks has such a big monopoly over this. Does anyone have any idea of how I can get someone to help me migrate my quickbooks data into zoho or odoo? Or at least how I can go about it without losing that *MUCH* data?",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1753313465.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.413401031649273
  },
  {
    "score": 57,
    "title": "Just a shout out to all of you who will never give another penny to Intuit after payroll for 2021 expires in May",
    "selftext": "I’m in the same boat as you. I guess my fear is that there is something in the user agreement that they can shut it down after x number of years.\n\nWondering if I should pay a 3rd party service to downgrade to one of the following that I have access to:\n\n2009 Pro\n2011 Pro\n2016 Pro\n2018 Pro\n\nOr just switch to another product entirely.\n\nKinda hoping 2021 won’t be unbearable to work with (I’m dreading relentless pop-ups telling me I need to upgrade at a minimum) and I’ll do payroll manually and that’ll be that.\n\nIf not though, I’m totally willing to run 2016 or even 2011 in a virtual machine with Windows 7 or whatever it takes and pay for the 3rd party downgrade.\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1709159049.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1916098756424307
  },
  {
    "score": 57,
    "title": "QB online is terrible...",
    "selftext": "Updating my 2023 ledger today. Run a small landscape contracting business and buy both 'tools' and 'materials' from many of the same local business'. So have to update/audit my bookkeepers work by separating the wheat from the chaff at the end of the year.  \nOn top of using this terrible UI for 2/3 seasons running I still had to call the BK to help me run the same report I do every time this year. But I'm better with a shovel than a keyboard so give them a pass on that...\n\nBUT....Ran into so many 'timeouts', 'reloads', etc. I was ready to punch my screen. Have a proper Fiber connection and new PC too. Back in the day QB just jacked you for $xxx.xx dollars a year for 'updated software/spreadsheets'. But at least you could run on your own power. Now you have to run your business through their servers and hope that their servers can keep up with QB's inputs and lag. \n\nEspecially at tax time you would think QB would spring for more server time. But why serve you customers when you are the only game in town...  \n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1707267154.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.133942991394928
  },
  {
    "score": 55,
    "title": "25 years of putting up with this GARBAGE software",
    "selftext": "It all starts out so easy, simple straightforward.  They real you in and dominate the market, no competition, their own visa merchant system that is broken 3 times a month. Have a point of sale system?  Youre screwed no visa cards for you .. we’ll be back soon.\n\nHad a corrupt database one time, their corruption, their tools wouldn’t fix it, had me send it in… SEND IT IN all of our accounting records so we can’t work for 2 weeks processing customer payments, this was a 2 year incident, never got above their “5th level” it goes nowhere it just ends.  Their “experts” sent it back OUT OF BALANCE and non functional, it’s accounting OUT OF BALANCE is not ok.  Through their shit fix away and developed my own workarounds, had exact repeatable documentation about how to fuck their software, went nowhere, dealt with it, 5 years later.. voila suddenly their tool fixed it.  You know what would have fixed it?  If you listened to your customers that are programmers and network engineers you worthless pricks.\n\nEver done a refund check, or a bounced check hahaha.  Go, go right now do a credit memo and send a refund check, it’s dead broken, doesn’t balance and doesn’t do what it should.. it’s been the same for 15 FUCKING YEARS you worthless pieces of shit.   If you do, it creates a credit memo for the amount, then writes the check against the credit memo, so.. the BALANCE IS UNAFFECTED it’s just garbage in garbage out.\n\nYear after year now with their subscription bullshit, nothing gets fixed.\n\nSpent the better part of today cleaning up old shit, you know, slight overpayments of 5 cents going back 2 years across 30 invoices, can you just do a credit all? Oh hell no you have to go into the payment, click each invoice with the five cents, click the credits, click the 5 cents, then go back to the payment click the next invoice, click the 5 cents, and on and on and on.. You people should be hanging on pikes next to the golden gate bridge.\n\nOh.. what about visa payments.. you know those duplicate ones..  the ones when the merchant center is down because those jackasses can’t run anything?  Let’s duplicate it and not let you get rid of it, so now it hangs in your deposit slips because they lost their shit between saving the payment in quickbooks and submitting to the merchant ledger.  So you have one that is correct and one isn’t, and it’s neigh IMPOSSIBLE to delete and fix, and their stupid support system is FULL of wrong answers and bullshit.  So you have to look at the two exact payments with the exact same posting numbers and figure out which one didn’t’ sync even though it says it is synced.   Ah.. press ctrl H and you can see it didn’t post in the deposit, delete that one through 20 don’t do this prompts, and then it’s finally no longer in their account doubled, it’s not in deposits, and your support staff are TOO FUCKING DUMB to know this and know how to fix this.  THEN you have to go into the customers account, go to a payment and start reapplying all the misplaced credits and payments.  So much fun.\n\nEver hear of a focus group?  Ever actually listened to customers?  Chief Customer Service Officer, what an absolute joke, what do you do all day sit and a room talking to each other while the world burns?\n\nYou are costing us THOUSANDS of man hours, losses.  Please someone burn intuit to the ground and put them out of business, and may all their employees be the pariahs of the IT world and never hired ever for their incompetence at programming, much less accounting.\n\nSigned…\nA 30 year use of this shit since it was on DOS, that has written api’s for this shit.\n",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1755754725.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.11429767437316
  },
  {
    "score": 55,
    "title": "Alternatives to QB?",
    "selftext": "Hi All,\n\nHusband and I have a small business that we run completely on our own. We were using QB desktop and had a significant disaster that couldn't be fixed, so had to move it to online. Problem is that we are now paying $30ish per month for significantly more bells and whistles than we need. This is especially true because business has dropped and income is minimal. Does anyone know of any alternatives to QB that doesn't require extensive accounting knowledge? I'm an English teacher by day, and do NOT have accounting skills, so I rely heavily on systems that work relatively intuitively. I've been doing it a long time, so know just enough to get myself in trouble. Any advice is appreciated.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1721337967.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3611140328272726
  },
  {
    "score": 55,
    "title": "Quickbooks Online is the worst software, I refuse to call it accounting software!",
    "selftext": "  I’ve started a new job and went from using Sage Intacct to Quickbooks Online and QBO has to be the worst software do to accounting in (and I’m in the Accountant View!).  Some of the annoyances are:\n\n* You can’t create a link to journal entries.\n*  You can’t create decent custom reports. For example, I want to create a report that has 3 accounts, a custom header, and a subtotal, you can’t do it. Anyone have any suggestions on a product that will let me do that?\n*  Exporting a transaction report produces garbage. You must switch back to classic view to get something that makes sense.\n* There is no AP or AR section. Instead there is an expenditure menu. I guess AR is under customers.\n*  I had to use a browser add on to get links to the things I use the most under a single menu (Right tools). \n*  The journal entry menu is buried, and you can’t create a shortcut. \n* You can’t remove menu items that you don’t need.\n* There is no easy way to bulk actions like changing things from reconciled to not reconciled.\n\n&amp;#x200B;\n\n&amp;#x200B;",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1709686176.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3161254548424464
  },
  {
    "score": 55,
    "title": "Intuit as a company SUUUUCKS",
    "selftext": "DO NOT LET YOUR DESKTOP VERSION LAPS BEFORE MIGRATING TO THE ONLINE CRAP.\n\nQuickBooks customer for over 7 years. Remained on the 2021 desktop version because of a compatibility issue with a 3rd party integration. Still, we maintained our subscription through August, at which time we decided to move to another PSA software that integrates with QuickBooks Online. Some technical issues delayed the deployment of the PSA, thereby delaying our migration to QuickBooks Online.  \n\nWe have since subscribed to QuickBooks Online and are starting our migration. Evidently, desktop versions newer than 2022 have an easier migration path. I downloaded the last version of QB desktop available to us and the appropriate keys, only to find that I couldn't even activate a read-only copy. Of course, there is nothing on the download page that indicates I am downloading a giant turd.\n\nSpeaking with tech support was a joke.  90 minutes on the phone only to be told they wouldn't help or provide a temporary unlock code.  We are still within our window of time for free assistance with the online version, LOL.  \n\nAs the owner of an IT support company, I work with many software companies. We advise our clients on software purchasing and assist with the implementation. Without exception, Intuit is the most overrated bottom-feeding software we must work with. Intuit's support is legendarily horrible for a reason. \n\nIf the Intuit dumpster fire ever implodes, I will mark the day for an annual celebration.  ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1766435755.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1507936478620033
  },
  {
    "score": 55,
    "title": "Dear Intuit, some of us are never going to switch to QBO and that's okay",
    "selftext": "Dear Intuit,\n\nQBO and QB Desktop are different products. QBO is great for some users who want to have multiple people accessing QB from different locations. As an accountant who works with many small businesses, I know desktop is better for some of my clients and QBO is better for others. They all have different needs and there is no one size fits all solution.\n\nHowever, there are very valid reasons to prefer desktop, such as\n\n1. Better security - you can require access to a physical device\n2. Too many cooks spoil the soup - multiple people accessing the file can create chaos and make it harder to monitor changes\n3. Idiotic bank feeds AI - I've seen a lot more errors in suggested rules and transactions with QBO than desktop, such as mixing up restaurants and utilities, which can be a real problem when clients do their own bookkeeping\n4. Chart of Accounts issues - the Uncategorized Asset account is a huge problem with how often transactions get mistakenly auto-assigned to it, and the way QBO tries to \"help\" you add new expense accounts and suggest names for them only makes it worse\n\nPlease kindly stop with your \"migration specialists\" and offers of 60% off for switching. I don't want a pop-up begging me to move online when I open QB Desktop. And I really don't want Desktop to be discontinued.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1696266081.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2349449969451443
  },
  {
    "score": 54,
    "title": "In the off chance anyone at QB cares…",
    "selftext": "I initiated a chat today about how to edit a payroll I submitted but hasn’t been paid out yet. 5 minutes into “what is your question” after already asking it quite clearly, I was asked for 5 pieces of information “for security purposes”. Fuck right off.  You already know because I’m logged into your goddamned system in order to initiate that chat. I googled my question and got the answer in less than a second. I should have done that from the start. ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1759990230.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.120468310350047
  },
  {
    "score": 51,
    "title": "Quickbooks insane pricing has me looking elsewhere...",
    "selftext": "I have desktop version Quickbooks Pro Plus 2022 and I'm getting emails from Quickbooks telling me my subscription will be cancelled April 27, 2023 if I don't pay $549?!?!\n\nI got in the Quickbooks chat and asked them what this meant. They said if I don't pay the annual fee the software will stop working and I will not be able to open my company file.\n\nI JUST BOUGHT version 2022 because my 2019 was end of life. I own multiple software products that do not charge such insane prices for updates.\n\nSo - the agent told me they had a \"cheaper option\" which is their ONLINE version. I am a one person freelancer. The two main features I use is the timer and the ability for my clients to pay me online with echecks.\n\nI don't really want to move to another product because of all the time involved.\n\nIt looks like their cheapest option is $30/month (discounted to $15/month starting out). That means eventually I will be paying $360/year. Also, if I want the time tracking I have to pay for an add-on called Quickbooks Time which is another $10/month... that's almost $500/yr.\n\nGEEZ - this is crazy.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1680026698.0,
    "media": null,
    "is_video": false,
    "num_comments": 168,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.557446695941636
  },
  {
    "score": 51,
    "title": "Quickbooks Desktop 2020 Discontinued Services",
    "selftext": "Here is the list Intuit published regarding parts of QBDT 2020 that will discontinue working 5/31/2023.  If you own QBDT 2020 or prior, you own the software.  If you have any version of QuickBooks Desktop that includes PLUS in the name, you do not own the software and have to pay an annul subscription to maintain access.  \n\nFunctions that will no longer work in QBDT 2020 after 5/31/23:\n\n **Security updates:** Critical security updates\n\n**Payroll services:** Assisted Payroll, Basic Payroll, Enhanced Payroll, Standard Payroll\n\n**Payroll-related services:** Direct Deposit for vendors, QuickBooks Workforce (ViewMyPaycheck, VMP)\n\n**Credit card processing:** Merchant Services, Terminal download (Merchant Services), Recurring payments, Online invoice\n\n**Check processing:** Intuit Check Solution\n\n**Tech support plans &amp; included services:** QuickBooks Care protection plan\n\n**Other services:** Accountant Copy File Transfer, Multicurrency/exchange rate, Contributed reports, Online Banking, QuickBooks Email, QuickBooks Time, Online Bank Feeds\n\nEdit: \n\nManual .qbo bank imports will also stop working.\n\nEmailing invoices will still work fine if you go into preferences-send forms, and set \"send email using:\" to webmail instead of Quickbooks mail.   Not affected by product sunset.\n\nAlthough it says \"webmail\", you can actually use almost any email provider, not just a web-based one like gmail.  I have it send via my regular business email.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1683226146.0,
    "media": null,
    "is_video": false,
    "num_comments": 179,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.556139596186452
  },
  {
    "score": 52,
    "title": "A warning regarding QB fraud investigation",
    "selftext": "This was something I wasn't aware was possible, and is making me regret going to QuickBooks online. Last week attempting to send out invoices whenever I hit save it suddenly gave a message that my QuickBooks account was canceled. Figuring there was a mistake I called, and after hours on the phone found out that apparently our account was flagged as potential fraud for some reason or another (there is obviously no fraud or anything illegal going on). When asked what the steps were to get this resolved quickly so I could send out invoices, pay my vendors, and run payroll I was basically told the fraud department is completely non-communicative, and it could be a day, a week, or a month till it's re-enabled and they cant tell me anything more. Fuck me right that tomorrow is the book keeping day and payroll. For reference, this is an 18-employee, 2M/yr business that has used QuickBooks for 15 years. Has anything had anything similar happen? Is there any way to shake the tree and at least figure out if there is information we can provide to help the process go quickly?",
    "subreddit": "QuickBooks",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1721124285.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.328060957649757
  },
  {
    "score": 50,
    "title": "Hating the new \"UI\" of QBO + truly bothered about in-app constant ad-features",
    "selftext": "Anyone else HATING the new QBO UI? How is it possible that a large company like Intuit spends time and money making their product WORST?\n\nBasically, your useful screen space is reduced to 1/3 of the screen, so they can display more ads on their new \"features\".\n\nSeriously considering moving out. **Anyone know a good solution that can handle invoicing and Bookkeeping with a simpler/lighter UI without all the clutter that QBO now has?**",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1752761865.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2920551782659455
  },
  {
    "score": 52,
    "title": "Two Companies Haven't Been Paid Today",
    "selftext": "I got up early (6am EST) and looked at my bank account, and I had not been paid. I freaked out that I did not submit payroll. I looked in the QB ledger and the deposits are all there for today. It looks normal. The employee paycheck says scheduled, however. I text a friend from the owner's other company that I manage, and he has not received a deposit either. Both companies were submitted yesterday, early afternoon, which is normal for me.\n\nObviously, call QB and have them figure it out. The biggest problem is I'm off today and traveling out of state for the holiday weekend. And QB doesn't open CS until after I leave. I just don't want everyone freaking out and I'm not able to resolve anything because I'm gone. What would you do?",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1756463949.0,
    "media": null,
    "is_video": false,
    "num_comments": 180,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.588115157035381
  },
  {
    "score": 51,
    "title": "Intuit is bad for my mental health.",
    "selftext": "Just a rage post, I use qbo, I also use TurboTax. They don't mesh, I can pay double for someone to \"help?\" me. I'm just about to effing done. Seriously, 1/2 the time that it takes me to do my home/business taxes is me dealing with intuit bullshit, followed by 1/4 of the time screaming vulgarities at the computer, followed by the last 1/4 of me inputting basic numbers and completing the task. FUCK YOU INTUIT. 🖕",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1744328694.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": true,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.097112991001759
  },
  {
    "score": 47,
    "title": "Quickbooks online nightmare",
    "selftext": "Just an incredibly frustrated accountant coming to vent about how TERRIBLE QBO is to use. I have to assume that the people who designed QBO have never been accountants that had to deal with clients who know next to nothing about recording their activity properly. It is the most convoluted software i’ve ever had the displeasure of using. Its not user friendly and designed so poorly I wish I could personally attack the people responsible.\n\nThank you. ",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1749049681.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1592735408888366
  },
  {
    "score": 47,
    "title": "Had a call from Quickboiks today saying my call is recorded. Said they were assigning an account rep to my account. I gave the guy all my hate on the company and said do not have this rep call me because the only thing they want to do is convince me to move to online. I of course am desktop.",
    "selftext": "I am real glad he had it recorded. I let the company have it. I am a small company, use desktop and Payroll and pay 5 to 10 people. So yes I know I am not special enough to warrant a dedicated rep. I am though on desktop and the money grubbing POS  that quickbooks is, I am special enough to be called and made think it is a  dedicated rep that is looking out for me while it is just the company backhanded trying to sell me a subscription to online.\n\nQuickbooks is a dirty little company using dirty tricks. I really wish I can leave it. I am really going to double my effort and find a payroll provider so I can seperate myself from Quickbooks.\n\nIf you are on Quickbooks desktop and get this call, realize it for what it is.",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1719420584.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2453352508786875
  },
  {
    "score": 24,
    "title": "What did you switch to?",
    "selftext": "Quickbooks online is now unbearable.   \n\n\n\nIt takes so much longer to do a simple invoice then before.  I hate how you can't link a cost without have a line for the invoice, not to mention if the cost is still part of the invoice but you don't bill that to customer there's no way to delete the text even after saving.   For my larger customers, being unable to see the preview text of the billable is really hard.   \n\n  \nJust curious has anyone switch and was happy with their new accounting software?\n\n  \nIf so, please advise which one you switched to and if you were able to port over quickbooks sucessfully without hiccups.\n\n  \n\n\n  \nThanks",
    "subreddit": "QuickBooks",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1717035917.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.963038048686294
  }
]