[
  {
    "score": 139,
    "title": "What 50 luxury realtors told me when cameras were off",
    "selftext": "\nI spent the last few months having real, unfiltered conversations with 50 luxury realtors.\n\nNot just any agents; people selling $3M, $10M, even $30M properties.\n\nI asked them one thing:\n*“What actually separates agents who crush it in luxury… from the ones who never break in?”*\n\nHere are the most interesting things I learned:\n\n1. Most listings sound like an invoice.\n\n“4 bed, 5 bath, quartz countertops.”\nMeanwhile the top agents are out here selling **privacy, views, status, legacy, peace, lifestyle**.\nOne agent literally said:\n\n“You’re selling the *feeling* of walking through the door at sunset… not the square footage.”\n\n2. Wealthy clients judge you BEFORE they meet you.\n\nNot on your suit.\nNot on your car.\n**On your marketing.**\nIf your digital presence feels “average,” they assume your service is “average.”\nHigh net worth people are allergic to average.\n\n\n3. The *first click* is the first showing.\n\nThis one hit me.\nRealtors spend $$$ on staging the home…\n…but send buyers an ugly MLS link as the first impression.\nOne agent said:\n\n“Why would I stage a $6M home but send it out like a Craigslist ad?”\n\nOuch.\n\n\n 4. Luxury buyers investigate quietly.\n\nThey don’t comment.\nThey don’t “inquire for more info.”\nThey stalk your materials, make an instant judgment, and move on if it doesn’t feel premium.\nYou won’t even know you lost them.\n\n\n5. Everyone said the same pain point.\n\n“I *want* my listings to look cinematic and polished but I don’t have the time, designers, or tech team to build custom pages.”\n\nAt the luxury level, Canva templates don’t cut it.\n\n 6. The biggest myth?\n\n“Luxury is about more exposure.”\nNope.\n“It’s about the *right* exposure, packaged *flawlessly*.”\nOne agent told me:\n\n“I don’t need 100,000 views. I need the right 8 people to feel something.”\n\nHope this helps someone\n\n*Asked AI to help edit the notes, didn’t realize it would be so triggering* m dashes are for winners and I’m not ashamed to use them 🥹",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.71,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1760728813.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.93,
    "category_rationale": "Enumerated insights from conversations, presented as a numbered list.",
    "composite_score": 3.7164015163745034
  },
  {
    "score": 59,
    "title": "27, brand new to real estate — what tools actually matter early on?",
    "selftext": "Hey all — I’m 27 and just getting into real estate. Super motivated and want to start off hot, but honestly feeling overwhelmed.\n\nEverywhere I look there’s another “must-have” system: CRMs, dialers, AI tools, coaching programs, content machines, etc. I don’t want to be stupid and overcomplicate things or spend money just to feel productive.\n\nFor those of you who’ve been doing this a while:\n\nWhat tools actually made a difference early on?\n\nWhat did you think you needed but turned out to be a waste?\n\nIf you were starting over today, what would you use in your first 90 days?\n\nI’m not looking for shortcuts or hacks — just trying to build good habits and focus on the stuff that moves the needle.\n\nAppreciate any real-world advice 🙏",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1765823164.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A request for tools/advice rather than substantive content.",
    "composite_score": 3.379865247165112
  },
  {
    "score": 54,
    "title": "My Attempt at AI Videos for Instagram",
    "selftext": "For context, I’m two years into the business, and Instagram has turned into my biggest lead engine. Roughly 60% of new buyers first reach out after seeing a Reel or Story. The downside is the time sink. I’m not great on camera and posting videos easily eats half a day.\n\nMost of my videos are simply me explaining the local housing market or giving house buying tips, and some of my friend suggested that I try to \"clone\" myself with AI and simply use that for daily videos.\n\nI’ve tried out a couple of “AI Cloning” apps last year and they didn't look realistic enough. But I've decided to give it another try and see where the tech is right now.\n\nBelow is my evaluation.\n\n[HeyGen](https://apps.apple.com/us/app/heygen-ai-avatar-video/id6711356409)\n\nInitial setup: Record a 30‑second selfie video and you get a reusable clone of yourself.\n\nUsability: Best lip‑sync, hands down.\n\nEditing setup: not a lot; you can add captions and drop in a property photo as the background. If you want more advanced cuts/transitions, you will need to export the video into capcut\n\n[Lensa AI](https://apps.apple.com/us/app/lensa-ai-photo-video-editor/id1436732536)\n\nInitial setup: Upload 10–20 selfies. There’s no video or lip‑sync layer; any talking‑avatar TikToks you see were animated later in a separate tool.\n\nWhere it helps: Great for static Story covers, carousel thumbnails, IG Highlights icons, or “Just Closed” graphics.\n\n[D‑ID](https://apps.apple.com/us/app/d-id-ai-video-generator/id6463755563)\n\nInitial setup: Upload a single headshot or pick a stock presenter, and D‑ID will lip‑sync any typed script or audio in under two minutes.\n\nUsability: Built‑in multilingual voices are great for Spanish‑speaking clients, but close‑up movements still feel mechanical and eyeglasses cause flicker.\n\nEditing setup: No editing capabilities. just raw avatar footage\n\n[CapCut](https://apps.apple.com/us/app/capcut-video-editor/id1500855883)\n\nInitial setup: The avatar generator sits right inside the CapCut mobile editor, so if you want to do some post editing, it's great.\n\nUsability: Mostly suitable for tiktok-style content, not necessarily real estate tips/information.\n\nRealism: Lip‑sync drifts after about 30–40 s, the face can look plasticky under bright light, and avatar exports cost credits\n\nTLDR: HeyGen is best for avatar realism and simple explainer videos for market info.\n\nSo far, I've started sprinkling some of my “cloned” videos into my feed. No one yet noticed that it's AI, and engagement has been stable. (dm and I can send my profile link)\n\nI’ll try to incorporate more of this in the future, hopefully I can automate all my videos at some point.\n\n",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1747366185.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.87,
    "category_rationale": "Review of multiple AI video tools with brief evaluations.",
    "composite_score": 3.009834365647662
  },
  {
    "score": 47,
    "title": "What I’ve learned after years of doing online marketing for Realtors",
    "selftext": "Hey everyone, I recently joined Reddit and figured I would start providing value to the communities I care about from the start.\n\nI’ve been in the Real Estate Online Marketing space for a couple of years now. And have successfully built a marketing agency that helps Real Estate Agents and Team Owners secure leads, nurture these leads and ultimately close more deals.\n\nHere’s what’s worked for my clients. (Mind you I’m located in what most consider to be the most competitive market for Realtors)\n\n**1. Google Ads PPC (pay per lead):** yes, these work. The reason why they work is because you are able to target specific things people are searching for. It’s not like Meta Ads where you target a topic or interest. Here you target the exact search. So if you want show up for “coastal homes in X” you can do that.\n\nCost: you can see some results with as little as $500/ month on ad spent\n\nPROS:\n\n* hyper specific targeting.\n* meet your leads where they are at, instead of shooting darts in the dark with meta ads\n* access unique leads\n\nCONS:\n\n* will produce a ton of “duds” (leads with fake info, just browsing or will never reply to you) this comes with the territory\n* can get pricey if you don’t know what you’re doing\n* complex to set up, you need a pro to do it right\n\n**2. Google LSA (local service ad):** these are awesome. Instead of paying per click you pay per lead.\n\nPROS:\n\n* higher quality lead\n* lower sales cycle\n\nCONS:\n\n* requires Google My Business Verification which for some is tough to get\n* can be pricey depending on where you are at\n\nCost: commonly between $20-$60 per lead\n\n**3. Follow Up:** “Money is in the Follow Up” building a system for messaging leads with quality messages for a long time will make you money. Straight up. BUT PLEASE do not use templated drip campaigns that are sterile. It’s a slap to the face for your lead. You’re trying to help them figure out what could be their biggest life decision. A simple “just checking in, are you ready to buy/sell?” Won’t cut it.\n\nDo use technology to make your life easier. I suggest either having a CRM to track everything for you or investing in software that does it for you.\n\nPROS:\n\n* as close as you can get to guaranteed income\n* referral opportunities\n\nCONS\n\n* it’s a ton of work\n* misleading solutions: most auto follow up/ nurturing systems hurt you more than benefit you as they use stale, generic messaging that annoy leads\n\n**4. Reputation Management + Google My Business:** Create a system to request reviews and get as many as you need in your area to surpass your biggest competitor. Reply to every review as fast as you can and update your profile frequently with new photos. You can use listing photos or better yet “just sold” photos.\n\nPROS:\n\n* it’s FREE\n* biggest ROI out of any other activity by FAR\n* secure steady stream of high quality leads\n\nCONS\n\n* slow to get traction as getting reviews takes time\n* constant upkeep\n\n**5. BONUS: (not online) OPEN HOUSES**\n\nI work with the biggest names in California. They all say “if I was a new agent starting out I would hold every Open House I could get my hands on and the follow up with all leads constantly with care”\n\nThat’s it!\n\nNow here’s a quick list of things that don’t work as well:\n\n1. SEO. Top 15 searches are dominated by Zillow, Redfin, etc. Trying to 1 up them is too costly. Spend your marketing dollars elsewhere.\n2. “What to do in XYZ Town this weekend” these don’t work anymore. Back in boomer days it did but now everyone is offering their Chat GPT calendar of events and it’s become too saturated.\n3. First homebuyers downloadable guide. Don’t be lazy, offer an actual sit down consult with potential homebuyers. Get them a coffee while you’re at it, they’ll love you.\n\nThat’s all I can think of right now.\n\nLet’s open the discussion, do you have any questions about any of these? Have you used them in the past and if so did they work? Need help understanding any of these?\n\nLet me know in the comments, this is my first post of many. I’m always looking at giving back to the community!\n\n(Please let me know if this is the right subreddit to post this in)",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1740966084.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.86,
    "category_rationale": "Enumerated marketing strategies with pros/cons.",
    "composite_score": 3.348380880406528
  },
  {
    "score": 45,
    "title": "Realtors using ai - what's actually working for you",
    "selftext": "I keep seeing posts about using AI to your advantage in real estate, but also a lot of warnings that some people are using it the wrong way or even that it’s slowing their business down.\n\n\nI want to jump on the AI train, but I want to do it properly without wasting my time or sounding robotic.\n\n\nFor those of you doing residential or commercial real estate, what tools are you actually using that have made a difference?\n\n- [ ] What’s helped you the most: lead gen, follow-ups, marketing, analytics, SEO, scaling, etc.?\n\n- [ ] Have any tools ended up being more of a distraction or a waste of money?\n\n- [ ] Are there any “must-avoid” or \"must-have\" you’d warn someone new to AI about?\n\nWould love to hear what’s working (or not working) for you so I can build my strategy the right way.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1756313193.0,
    "media": null,
    "is_video": false,
    "num_comments": 126,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question seeking real-world AI tools that work and what to avoid.",
    "composite_score": 3.4346596921595527
  },
  {
    "score": 43,
    "title": "Joint ventures - Looking for feedback",
    "selftext": "Hi all, I run [PropFlip](https://propflip.app) which as of now is a marketplace for wholesalers to list their contracted properties to get in touch with cash buyers. I am working on a big overhaul to include a joint venture board (find, join, and create joint ventures) and a lending board (Lenders can promote their lending company).\n\nI am working on the JV board and would appreciate your feedback. As of now, someone posting to the JV board has the options to add the following to their post:\n\n\\- Company or jv name\n\n\\- Email to be contacted at\n\n\\- Description (max 200 characters)\n\n\\- A dropdown list of property types you work with (Land, Commercial, Mixed-use, Single family, Multi-family)\n\n\\- States you work in\n\nIs there any other important info you would like to be able to add to these kinds of posts? Any and all feedback would be greatly appreciated. I want this to be a useful tool for you all",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1733952093.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Requests feedback on what information to add to a JV-board post feature.",
    "composite_score": 2.6569826721501686
  },
  {
    "score": 38,
    "title": "I created a directory of Real Estate AI resources ",
    "selftext": "I recently found myself spending hours researching different AI apps to solve a business automation problem. I did loads of demos and ended up with lots of resources for things like Chatbots, data analytics and generative AI.\n\nI decided to make this list available to others so created  www.propertyaitools.com \n\nYou'll see that it's not an exhaustive list but all the tools are reputable and suitable for business use. \n\nHoping a few people find it useful. ",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1708870996.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Announcement of a curated directory/list of AI resources.",
    "composite_score": 3.1402909452695926
  },
  {
    "score": 41,
    "title": "I built a free platform to help buyers self-represent - looking for feedback &amp; RE experts",
    "selftext": "As a response to the NAR settlement decoupling buyer &amp; seller commissions, I recently built Keepup, a platform to help buyers self-represent when buying a house.\n\nHere's how it works:\n\n* We offer a step-by-step journey to guide the buyer through the home-buying journey. Here's an example of what a step looks like.\n* For each step, we mainly ask you the outcome for that step, but we also provide you with resources like:\n   * videos and articles for that specific step.\n   * tools relevant to the step\n   * the best professionals in your area that you can hire if you need help with that step (for example, if you're ready to make an offer letter we'll give you the best real estate attorneys in your area) \\*\\*\n   * tips/FAQs\n   * custom-knowledge AI for each step so that you can ask any questions you have \\*\n* Market notifications if new properties matching your search criteria are listed. \\*\n* Save properties you like and annotate them.\n* Keep your documents organized and use AI to chat with a document in case you don't understand something.\n* You can coordinate a viewing with the listing agent (we provide you with their contact info), and we even provide a page you can send to the agent to introduce yourself. \\*\n\n\\* **Monetization**: all of the core functionality for Keepup is free, but we do offer a premium tier with the most advanced features like AI &amp; market matches.\n\n\\*\\* This is really important, we do think buyers should still hire professionals, particularly for the most delicate steps like submitting an offer letter.\n\nThere's more but I'll stop here.\n\nI would love any feedback you're willing to share: what are the major components we didn't account for? what do you like/dislike about it?\n\nI'm also looking to connect with real estate experts: if you're interested and are an agent with experience, a broker, or a real estate attorney let me know - I'd love to chat.\n\nWe just launched in Beta in Denver, CO. You can learn at [joinkeepup.com](http://joinkeepup.com) if you're interested.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1736451520.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Describes a new platform for buyers with features and how it helps, plus a request for feedback.",
    "composite_score": 3.1023739355968507
  },
  {
    "score": 38,
    "title": "AI is quietly changing how investors find high potential properties",
    "selftext": "Lately, I've been checking out how artificial intelligence is sizing up homes across America  turns out, it's kinda mind blowing. A few of these systems now nail down rehab expenses like pros; they’re sharp on pricing shifts, spot solid rental odds, or even sniff out if a homeowner’s itching to sell fast.\n\nAnyone around here test out an AI tool for checking homes or land deals? Wondering what actually works well when you’re using it outside theory.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1762820803.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Describes AI tools for investors and invites discussion on what works.",
    "composite_score": 2.988456405334904
  },
  {
    "score": 38,
    "title": "New here?",
    "selftext": "**Rule #1 Reminder:  GIVE more than you get!** Don’t come to this sub ONLY to promote, get feedback on your new idea, participation in your project, etc. Our community views these posts as spam - so it's **ONLY allowed from folks who are ACTIVE contributors to the community**, and when posted in a way that **gives value to our members** (rather than just trying to sell  us something). Same thing on posts that are just asking what would be helpful for agents - we get these posts all the time and they add **no value** to members.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1749479217.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.7,
    "category_rationale": "Community guidelines/reminder post about contributing value.",
    "composite_score": 3.2573190633796174
  },
  {
    "score": 37,
    "title": "What’s the most underrated or surprisingly useful real estate tech tool you’ve ever used?",
    "selftext": "anything you heard before in any step of your workflow, saw many of you post different tech products, and I’m genuinely curious and hoping to learn from your experience.\n\nI’ve been exploring different tools that support real estate work — from managing leads, showings, marketing, photography, to closing. Some tools are flashy but don’t actually solve real problems, while others are super simple but surprisingly helpful.\n\nWhat’s one piece of real estate tech (could be software, an app, a hardware device, even a system) that’s actually made a difference in how you work?\n\nWould love to hear what’s been helpful in your workflow — whether you’re an agent, broker, investor, stager, photographer, or just real estate-curious. Not looking for AI pitches — just real tools that deliver.\n\nThanks in advance 🙏\n\n\\---------------------------------------------------------------------------\n\nthanks soooo much and found many good recommendations, hope to hear more, conlude here for your reference (continuing updating)\n\n1. social post: canva\n2. photo taking: Gopro\n3. photo virtual staging: [collov.ai](https://collov.ai/?via=isabel)\n4. time management : calendly\n5. description: chatgpt, Grok, claude",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1747804510.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Request for and listing of real estate tech tools, forming a curated set.",
    "composite_score": 3.295996845587122
  },
  {
    "score": 38,
    "title": "My $224/mo software stack after 3 years as an agent. What am I missing?",
    "selftext": "After 3 years of testing different tools, here's the stack that actually works for me without breaking the bank:\n\n**CRM:** Follow Up Boss ($69/month) - Best lead management and follow-up I've found.\n\n**Communication:** OpenPhone ($15/month) - A must-have. Texting leads from a separate business line is crucial.\n\n**Marketing Automation:** PropPromote ($99/month) - Automates my listing marketing (video tours, virtual staging, social posts) from the MLS data.\n\n**Transaction Management:** SkySlope (free through my brokerage)\n\n**CMA Tool:** RPR (free for NAR members) - For all my market analysis and reports.\n\n**Scheduling:** Calendly (free tier works fine)\n\n**E-signatures:** DocuSign ($25/month) - I use this for non-transactional paperwork before a file is opened in SkySlope.\n\n**Design:** Canva Pro ($15/month) - For one-off flyers and custom social graphics.\n\n**Lead Gen:** A mix of Facebook Ads and sphere of influence/referrals.\n\nTotal monthly spend: \\~$224\n\nWhat tools are missing from this stack? Always looking to optimize.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 38,
    "downs": 0,
    "created_utc": 1755533688.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Enumerates a stack of tools with prices and brief notes.",
    "composite_score": 3.097798834816292
  },
  {
    "score": 34,
    "title": "Just saw this lawsuit against Zillow…thoughts?",
    "selftext": "So the same law firms that went after NAR are now targeting Zillow for their Flex program, claiming they “trick” buyers into using Zillow agents who pay up to 40% referral fees - and buyers have no idea this is happening. \n\nHere’s what really gets me: when buyers click “Contact Agent” on a listing, they think they’re reaching the listing agent. Instead, they get connected to a Zillow Flex agent who’s already committed to paying Zillow 40% of their commission. \n\nThink about that for a second. The buyer thinks they’re getting connected to someone who can help them negotiate a better price. But really, they’re getting an agent who needs every penny they can squeeze out of the deal because they’re giving nearly half their commission to Zillow.\n\nThe lawsuit claims this keeps commissions artificially high because “the buyer Flex agent is receiving such a paltry sum in return,” so sellers end up paying more to compensate. \n\nWhat bothers me most is the lack of transparency when we just went through this. Buyers deserve to know when their “recommended” agent is paying a massive referral fee that might affect how hard they negotiate on their behalf.\n\nI’ve always believed that if you’re good at this business, you shouldn’t need to pay 40% to a portal for leads. Build your own referral network. Create your own content. Develop relationships with past clients who actually know and trust you.\n\nBut here’s my real question for everyone: How many of you have clients who found you through Zillow, and did they have any idea you were paying a referral fee (if you did)? Did it change how you approached their transaction at all?\n\nWhat’s y’all’s take on this?",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1758410172.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional critique about Zillow's transparency and referral fees with moral stance.",
    "composite_score": 3.0381743012379476
  },
  {
    "score": 32,
    "title": "Looking for feedback - free one click deal analyzer",
    "selftext": "https://reddit.com/link/1ij6p6z/video/h4pshruzpjhe1/player\n\nI got tired of wasting hours analyzing real estate deals, manually copying and pasting numbers into spreadsheets just to realize most deals were duds.\n\nSo I built [CashOn](http://www.cashon.cash/?fbclid=IwZXh0bgNhZW0CMTAAAR1tGwm-sXkItuaVVAIAQkq94wCe4ro6OIhbc0H0rBi31rpSNGXXEhPvgIs_aem_3VTYRJGpgTEiKlnWh39jmw) a free one-click deal analyzer to save me and hopefully you some time. Now, I can instantly pull rental estimates, expenses (HOA, property taxes, etc.), and get a quick read on whether a deal is even worth a deeper dive.\n\nIt’s not perfect, and I’d love your feedback! There is a paid version, but everything I showed in this video is 100% free.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1738859616.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Describes a free deal analyzer tool and seeks feedback, conveying learning/insight.",
    "composite_score": 2.946088929037841
  },
  {
    "score": 30,
    "title": "Has anyone here used Rentyne to manage clients and get more reviews?",
    "selftext": "I’ve been exploring some tools to better manage client relationships and automate review requests, and came across something called **Rentyne**. It’s geared toward real estate professionals and seems to combine a few useful things, like client dashboards, property sharing with notifications, and automated review follow-ups after closing.\n\nWhat I liked is that it tracks client engagement too, so you can see who’s viewing what, and keep everything in one place instead of bouncing between your CRM, email, and spreadsheets.\n\nI’m curious if anyone else here has tried it or is using something similar? Always looking for ways to tighten up workflow and stay more connected with past clients without adding more complexity.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1762320996.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Simple question about using a specific tool with limited substance.",
    "composite_score": 2.5329373190260944
  },
  {
    "score": 29,
    "title": "Reliable real estate data providers with full property and neighborhood insights?",
    "selftext": "I’m searching for real estate data providers that can deliver detailed property, mortgage, and neighborhood information through an API or bulk data access. Ideally, I want a single source that covers everything without having to stitch multiple datasets together.\n\nHere’s what I’m looking for:\n\n* Property details: year built, beds, baths, square footage, lot size, AVM, sales and tax history, occupancy type, and ownership data\n* Mortgage data: balance, origination date, loan type, loan term, and interest rate\n* Neighborhood data: DOM, list and sale price trends, inventory levels, walkability, transit access, and school ratings\n* Comparable data: recent comps, current listings, and short or long term rental data\n\nI’ve been comparing providers like  Attom Data, Homesage, and CoreLogic, but would love to hear feedback from anyone who’s used them or other reliable real estate data providers that balance accuracy, coverage, and cost.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1761550203.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.63,
    "category_rationale": "Request for feedback on real estate data providers; topic-oriented but not instructional.",
    "composite_score": 2.8908202536691405
  },
  {
    "score": 29,
    "title": "Anyone here actually using a real estate AI or data API that delivers consistent results?",
    "selftext": "There’s been a steady rise in AI-driven tools and real estate data APIs lately, covering everything from property valuation and comps to market forecasting and investment analysis. Some are impressive, while others feel half-baked or limited in scope.\n\nFor those of you who’ve integrated this into your workflow, have platforms like Attom Data, Homesage, or Zillow’s APIs made your research or pricing process smoother? I’m trying to understand which real estate AI or API solutions actually provide reliable, actionable insights.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1761412877.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question about using real estate AI/data APIs; seeks experiences rather than guidance.",
    "composite_score": 2.8908202536691405
  },
  {
    "score": 28,
    "title": "Why the Real Estate Market Feels Conflicting Right Now",
    "selftext": "I have had a career in real estate for over 10 years and I have seen one debate continually come to the forefront. \"Housing is unaffordable!\" vs. \"It is still a good time to buy!\".\n\nHere's the reality:  \nIn large urban centers, staggering increase in housing prices along with rising mortgage rates make it difficult for first-time buyers.  \nHowever, if you are an experienced investor or a buyer looking for opportunities in emerging markets, smaller metro areas or niche opportunities, you still can find some value.  \nThe reality? Both of these are true. The market is not monolithic. Your individual goals, risk tolerance, and the specifics in your local market are infinitely more relevant than a news headline.  \nMy personal advice? Don't let the news get you panicking. Learn your local market. Read housing trends such as rent-to-price ratios. Focus on your annualized long-term returns nor the latest news.\n\nI would love to hear from others - how are you navigating this market?",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1756330813.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Offers nuanced market perspective and practical advice without a step-by-step process.",
    "composite_score": 2.7693696740523746
  },
  {
    "score": 25,
    "title": "How one agent made $50k just by fixing follow-ups",
    "selftext": "I was talking with a friend in real estate and she told me something that hit me:She didn’t need more leads. She just needed to stop losing the ones she already had.\n\nHere’s what she changed:\n\n* Wrote down every inquiry right away (no more sticky notes).  \n* Treated follow-ups like appointments — never skipped them.  \n* Used simple reminders to stay top-of-mind.  \n\nNo extra ads. No longer hours.Just by tightening her follow-ups, she closed enough extra deals to make about $50k more last year.\n\nIt made me realize the difference between an average year and a great year isn’t always more hustle. Sometimes it’s just a system that makes sure no lead slips through the cracks.\n\nHow do you keep track of your follow-ups? Spreadsheets, CRM, calendar or something else?\n\n",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1757910094.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Presents a reproducible sequence of follow-up actions that increased revenue.",
    "composite_score": 2.7781245983544616
  },
  {
    "score": 23,
    "title": "MCP for Real Estate Data",
    "selftext": "This is the first of its kind I've seen so wanted to share it here!\n\nMCP for interacting with real estate data across the United States.\n\nHere's the repo: [https://github.com/zellerhaus/batchdata-mcp-real-estate](https://github.com/zellerhaus/batchdata-mcp-real-estate)\n\nI've tested this to conduct market reports and create marketing materials from it, pull lead lists, etc.\n\nAddress Operations\n\n* **verify-address**: Validate and standardize addresses using USPS verification\n* **autocomplete-address**: Get intelligent address suggestions as you type\n* **geocode-address**: Convert addresses to latitude/longitude coordinates\n* **reverse-geocode**: Convert coordinates back to readable addresses\n\n# Property Operations\n\n* **lookup-property**: Get detailed property information by address or APN (Assessor Parcel Number)\n* **search-properties**: Advanced property search with comprehensive filters\n* **search-properties-by-boundary**: Geographic boundary searches using bounding boxes or radius\n* **count-properties**: Get property counts matching specific criteria (lightweight operation)",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1748899922.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Shares a real estate data MCP project and its capabilities as a helpful resource.",
    "composite_score": 2.707816862567409
  },
  {
    "score": 24,
    "title": "[Stantem] Official GraphQL Real Estate API release!",
    "selftext": "We had a solid response when we released our [Visual Data Search](https://stantem.com/search) and CMA tooling. Today, we've officially released the public GraphQL Real Estate API!\n\n### **Why GraphQL?**  \nGraphQL gives you full control over the data you retrieve.  \n- **No More Over-Fetching**: Unlike traditional REST APIs, you can query exactly what you need—nothing more, nothing less.  \n- **Better Performance**: Take for example plotting properties on a map, REST APIs often return unnecessary data, bloating payloads and slowing apps. GraphQL eliminates this problem, ensuring faster, user-friendly applications. The control is in your hands.\n- **Flexible Queries**: Users can create flexible queries for their usecase. Want to search for all properties with 2-4 bathrooms that have been sold in the last year in a given state? You can do that in a single query.\n---\n\n### **A New Approach to Billing**  \nTraditional real estate APIs charge high monthly fees, and unused credits expire. We're doing things differently:  \n\n**Pay-As-You-Go Plan**:  \n- **$50/month**: Access **50,000 property records**, refreshing monthly.  \n- **Non-expiring bulk credits**: Buy credits when you need them—no pressure to use them up.  \n- **Automatic volume discounts**: The more you buy, the less you pay per record (Calculator is on the [homepage](https://stantem.com))\n\nHere's the best part:  \n- **Charged per property**, not per API call.  \n- **No charge for empty or informational queries**: Experiment with filters and fine-tune your results without penalty.  Query how many properties match your criteria without consuming credits.\n- Bulk query up to **1k properties at a time** for efficiency.\n\n---\n\n### Larger Data Needs or have an existing ETL pipeline? \nIf you have established volume and would prefer even deeper discounts following the traditional API approach- we have plans for that too.\n\n**Premium Plan ($500/month)**:  \n- 2 million property records/month.  \n- Bulk CSV exports, skip tracing ($0.05/record), and team access (up to 3 members).  \n- Schedule bulk database exports that can be downloaded over an API\n\n**Enterprise Plans**:  \n- Unlimited and custom API limits, priority support, custom data solutions, and invoice-based billing.\n- Customized plans that fit your use case\n\n---\n\n### **API Documentation**  \nOur [interactive documentation](https://stantem.com/api) includes a demo API key for you to explore. Once registered, use your production key for real data.  \n\nVisit [stantem.com](https://stantem.com) for more details!",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1736429975.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Announcement of a product with feature bullets and pricing, leaning on explanation of GraphQL benefits.",
    "composite_score": 2.6310040265111567
  },
  {
    "score": 24,
    "title": "Feedback on room decluttering tool",
    "selftext": "I am developing a drag&amp;drop room decluttering tool and I wanted to gather some feedback, not just from the current results (see images), but also, I'd like to hear in the comments section (no DMs please as it goes against the subreddit rules) from real people working the field. Is clutter a usual problem you face when arriving at properties to take pictures? Are there other situations where a tool like this would come in handy?\n\nAnd the million-dollar question, given how often you may find this issue and the time you spend editing images to remove clutter, would you pay for a tool like this? How much do you think you would pay per image?\n\nI have received great feedback from local realtors, but these are people I know personally, so they may be biased. Getting honest feedback from strangers would be really valuable for me.\n\nThe samples I attached are images I found online from messy rooms, and I just dropped them on the tool. The results are exactly what you'd get and have no other work done to them outside the tool. There's also no fine-grained control, custom instructions or anything like that. Just drag and drop, as simple as it gets. Each image takes around 10 seconds to be processed, and you can drop several in parallel.\n\nFeel free to voice your concerns about such a tool, too. I am ready to listen to every voice.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1756378566.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Asks for feedback on a tool; minimal content beyond request.",
    "composite_score": 2.9808660144931096
  },
  {
    "score": 23,
    "title": "🏠 Built a Real Estate Investment API - Looking for Feedback and Ideas!",
    "selftext": "I’ve been working on an idea to build a real estate web app designed specifically for investors. The goal is to make it seamless to find and analyze deals without the hassle of juggling spreadsheets or opening endless browser tabs to consolidate data (and I am aware that there are some tools out there that already do this). However, I ran into a problem: while there are plenty of real estate APIs out there, most focus on raw property listings and don’t provide the investment-grade analytics that investors need.\n\nSo, I decided to build [RealSimpli API](https://rapidapi.com/kunnalkainth/api/realsimpli-api2) (now live on RapidAPI)! This API not only delivers active property listings but also instantly calculates key investment metrics for each property like:\n\n✅ **Cap Rate**  \n✅ **Cash-on-Cash Return (CoC)**  \n✅ **Net Operating Income (NOI)**  \n✅ **Closing Costs and Monthly Expenses**  \n✅ **And much more!**\n\n# 📢 Looking for Your Feedback!\n\nBefore diving into the web app, I’d love to hear your thoughts on the [RealSimpli API](https://rapidapi.com/kunnalkainth/api/realsimpli-api2)\n\n* What features would you want to see?\n* Any pain points you’ve had with deal analysis?\n\n\n\nAlso, I’m based in Toronto, Canada , and I’m open to collaborations! Excited to contribute something valuable to the real estate investing community. Looking forward to your thoughts! 🚀\n\n  \n",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1740270606.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Promotes RealSimpli API and asks for feedback/ideas; describes features; seeks input.",
    "composite_score": 2.865950700232734
  },
  {
    "score": 21,
    "title": "I built a purpose-built tool for tracking apartment/home searches",
    "selftext": "[https://www.casabrix.com](https://www.casabrix.com)\n\nHi everyone! I’m a software developer, and I was so fed up with my most recent apartment search in Chicago that I built a tool to hopefully make things a little easier for buyers/renters.\n\nCasabrix is basically a spreadsheet that integrates with maps, and has an easy-to-use mobile view (plus a Chrome extension to scrape Apartments.com or Zillow listings).\n\nObviously you all are on the other side of the fence as the target audience for this. \n\nSo my question is this: **would any of you on the professional side of real estate find value in a tool such as this?**\n\nI presume there are existing professional tools for realtors, but I'm curious if there's anything I could add that would make this useful for your community.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 21,
    "downs": 0,
    "created_utc": 1734026919.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Promotional tool description and request for professional feedback; no clear steps.",
    "composite_score": 2.3409526764861877
  },
  {
    "score": 23,
    "title": "Do not use Real Estate API",
    "selftext": "Terrible experience with them. Two high level things, incredibly inconsistent data and incredibly shady pricing.  \n  \nI primarily signed up for the mortgage data, it feels it is more often that I do not see mortgage data than when I do see it. It is a complete crap shoot. The rest of it just seems out dated.\n\nOn the pricing side, they charged me on May 18th, June 6th, July 4th. It is supposed to be a monthly subscription for $616. In what world does the dates get shorter. Another thing to note is that there is NO way to manage your subscriptions on their website. You are basically held hostage by them until they tell you it is okay to unsubscribe and they want you to keep paying for two months.  \n  \nIf you are a business thinking about real estate API, try anything else. It probably takes you a month or two decide whether to keep using it or not, in the end, they will end up charging you 5 months whether you like it or not. ",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1751892728.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Explicit vent about real estate API and pricing; emotional critique.",
    "composite_score": 2.9398491765120003
  },
  {
    "score": 20,
    "title": "$3,000 Monthly Budget for Marketing / Lead Gen",
    "selftext": "Hi all, as stated above, I have $3k in spend I can do comfortably for a year to help grow my business. I am almost 3 years in and looking to expand.\n\nI’m looking for suggestions on where I can get the best ROI on my money. I am also open to partially using some to pay for a VA to supplement the systems in place to build a good process.\n\nI have tried to find some “pay at closing” or “referral” companies and they always want money up front as well.\n\nLooking to hearing of suggestions!\n\nCurrently I have my social media dialed in, and also have mailers being designed to send to my neighborhood via EDDM.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1755376511.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Asks for ROI suggestions and optimization ideas; seeks advice.",
    "composite_score": 3.018960769010887
  },
  {
    "score": 20,
    "title": "Property Data API that doesnt break the bank",
    "selftext": "Hey Everyone! Have seen lots of posts about property data APIs that are not ridiculously expensive. My co worker and I spent our free time on weekends writing a program that collects data from all the parcels in the US. We are software engineers in big tech but also real estate investors on the side. We collected around 180 million parcels with 100 to 200 attribute each depending on the county.\n\nWe just pushed out [V1 of the API](https://www.realie.ai/real-estate-data-api). Since there is only a couple of us, our overhead is pretty low, so we are trying to make it as accessible as possible to any budget. If you are interested in just looking up properties, you can use the platform to do a property search. I would love to hear everyones thoughts! If you go through your allotment on the free tier, message me and I can shoot you a promo code!",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1731022333.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Promotes API with features and request for feedback; marketing.",
    "composite_score": 2.8302515982471688
  },
  {
    "score": 18,
    "title": "Find Recently Closed Businesses (Off Market Property Tool)",
    "selftext": "I built a website ([closedplaces.com](http://closedplaces.com)) which is showing you all permanently closed places from Google Maps. You can then select recently closed to only show whats closed in the last 12 months like in this screenshot. Or in the last 2 weeks, as you like. I'm currently working on a feature where you can select still vacant to only show places that have no new tenant.\n\nIs anyone interested in using this to find off market properties?",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1765763782.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Promotional site for off-market property tool; asks if readers are interested.",
    "composite_score": 2.596389853504482
  },
  {
    "score": 18,
    "title": "What's everyone using to manage agent referrals these days?",
    "selftext": "I've been messing around with different ways to manage referrals between agents and partners, but nothing really sticks. CRMs feel like overkill, and spreadsheets are... well, spreadsheets. I'm in the real estate space and getting more inbound referrals lately, which is great, but tracking who's involved and where the deal’s at is getting messy. Curious if anyone here has found a clean, lightweight tool (or even a system) that actually works for this kind of thing?",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1753239686.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Asks for recommendations on referrals management.",
    "composite_score": 2.606478061641966
  },
  {
    "score": 18,
    "title": "Real Estate Deal Analysis software suggestion",
    "selftext": "Hey Redditors, quick rant/question for you all. I'm trying to use more tech for my real estate deal underwriting, but honestly, it feels like I'm just creating more work. I've got a different tool for comps, another site for market data, then my own Excel sheets for the actual financial modeling.   \n  \nIt's a huge pain constantly moving data around, and I'm worried about screwing something up. Anyone else dealing with this kind of fragmented tech stack for deal analysis? How are you handling all the manual data transfer and keeping everything consistent?",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1750665904.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Vent/rant about fragmented tech stack and asks for experiences.",
    "composite_score": 2.8008915357532236
  },
  {
    "score": 17,
    "title": "Market Rent Comp Tools",
    "selftext": "Hi everyone,\n\nWhen researching rent comps last week, I realized how much time I spend using tools like Rentometer or Rentcast to get a rough idea of recently removed comps before manually cross-referencing Zillow, Apartments.com, and Facebook Marketplace. My properties typically fall into the 75th percentile for rent estimates (nice but small with no amenities), but I’ve noticed some gaps in the current tools that slow things down.\n\nOne of the biggest frustrations is the lack of **quality scoring** for comps. Tools today lump all listings together without considering property condition. Here’s what I think would improve the process:\n\n&amp;#x200B;\n\n* **Quality Scoring Rentals**\n   * Assign a **quality score** to listings based on their images—evaluating features like finishes, natural light, cleanliness, and overall property condition.\n   * For example, avoid comparing new construction units with floor-to-ceiling windows to outdated basement apartments with drop ceilings.\n   * This would help ensure you’re looking at comps that align with your property, saving time and increasing accuracy.\n* **Smart Weighting**\n   * Automatically weigh comps by their reliability.\n   * A listing with multiple price drops and 180 days on the market should matter less than one with 30 contacts, no price drops, and a short listing period.\n* **Open Data**\n   * Provide direct access to each comp’s details: price history, leasing schedules, photos, and links to original listings without leaving the platform.\n\n&amp;#x200B;\n\nI’d love to hear your thoughts:\n\n* Would a **quality score for images** help in your market rent research?\n* What’s your biggest frustration with the current tools?\n* Or are the current tools good enough for you?\n\n[View Poll](https://www.reddit.com/poll/1ibu8f5)",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1738040954.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Bullet list of distinct tools/ideas for improving rent comps.",
    "composite_score": 2.3603215251104346
  },
  {
    "score": 19,
    "title": "I created a cinematic AI video platform for real estate",
    "selftext": "Hey everyone! I built [DomusAI](http://domusai.pro), a platform that transforms your property images into smooth, cinematic videos using AI.\n\nHere's a quick demo video I made from the photos of a friend's listing: [https://www.youtube.com/watch?v=i7-qAbJHyNo](https://www.youtube.com/watch?v=i7-qAbJHyNo)\n\nTakes any still image and generates a 5-second cinematic video with natural camera movement. You can choose movements like Orbits, Dollys, Push ins/outs. I also added a creative setting where you can add anything you want in the video clips!\n\nSupports multiple resolutions as well (720p up to 4K). Can combine multiple generated videos into a single showcase if you like too. No subscriptions only a pay as you go credit system.\n\nI just launched this website and got some people already using it, but would you use this? Would appreciate any forms of feedback.  \nThank you!",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1737692347.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Product announcement with demo and request for feedback; not a how-to or list.",
    "composite_score": 2.622906796140396
  },
  {
    "score": 17,
    "title": "What are the pros and cons of using AI for property valuation?",
    "selftext": "Hey everyone,\n\nI’ve been exploring AI for property valuation lately and thought I’d share my two cents. Here are some pros and cons I've noticed:\n\n**Pros:**\n\n* **Speed:** AI can process tons of data in a snap, saving us from hours of number crunching.\n* **Accuracy:** With advanced algorithms, AI can consider way more factors than we can, often leading to more precise valuations.\n* **Consistency:** No more worrying about human errors or subjective opinions. AI gives consistent results every time.\n\n**Cons:**\n\n* **Data Dependency:** The quality of the valuation depends on the data fed into the AI. Garbage in, garbage out.\n* **Lack of Human Touch:** Sometimes, AI misses the unique charm or quirks of a property that a human appraiser would catch.\n* **Cost:** Setting up AI systems can be pricey, and not everyone has the budget for it.\n\nFor lead generation, I’m using Warpleads because they offer unlimited export leads, which I validate using Reoon. But, I also rely on Apollo to find niche leads.\n\nWhat’s your experience with AI in property valuation? Any thoughts?",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1733212781.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.82,
    "category_rationale": "Presents pros/cons with reasoning about AI in valuation.",
    "composite_score": 2.576382152470266
  },
  {
    "score": 18,
    "title": "Built a chrome extension because I got tired of not being able to export Zillow data",
    "selftext": "I am pretty into real estate investing and love Zillow but couldn’t find a way to get data in bulk for analysis. When trying to value a property I had to go through every property by hand on zillow and enter it into excel which sucked. So I built this extension to save me time which helped a ton when buying my first property. I was able to use it to see what other homes were worth and make sure I didn’t over pay. I made the extension totally free, just want to help people out who are in a similar situation. Anyway, you can check it out here: https://chrome.google.com/webstore/detail/comp-crunch-analyze-zillo/pfmjlnebociiohfhlpckomcmnajdonjp or search comp crunch in the chrome store.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1700233760.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal tool/project announcement with link; lacks broader content.",
    "composite_score": 2.8129799391959227
  },
  {
    "score": 17,
    "title": "Are theses places legit or a scam?",
    "selftext": "I am looking to boost my business from nothing to something. I have been looking at a couple pay at closing companies but I am having a hard time believing they are legit. I was looking through FB and was seeing closingleads and atclosing so I have been trying to do my research but the people on FB saying good things about either; I cannot find on RETR. Also it would look like they are almost the same company. I can't tell.\n\nHas anyone used these or other company that lets a newer agent do exclusive pay at closing leads\n\n  \nUPDATE::\n\nThis update is being placed here in the hopes others in the future come across this and save themselves from being scammed. \n\nBroker Spot\n\nAtClosing\n\nClosing Leads\n\nDeluxer \n\nLuxuryProspect\n\nI wanted to share an important update after doing a deep dive into the companies I asked about earlier. I hope this helps other newer agents who are looking for pay at closing or exclusive buyer lead programs.\n\nI started by joining the Facebook groups “Real Estate Community” and “All Things Real Estate, Memes, Stories, Advice, Referrals.” Those groups have many posts from people claiming to have great results with these companies. When I tried to look up those users outside of Facebook, I could not find any of them on RETR or anywhere else. It was only Facebook profiles with very limited history.\n\nI then posted the same question in both groups asking for honest feedback from real agents. Despite multiple attempts, the post was denied every time. No explanation was given. That led me to reach out to the admins to ask what I needed to fix. While checking the admin lists I noticed that almost all the admins for both groups were the same people.\n\nAt that point I started looking deeper into the companies behind the ads. I visited each website and pulled the Terms of Service for Closingleads, AtClosing, Deluxer, and LuxuryProspect. I uploaded the text into ChatGPT to compare. The analysis showed that all four companies use the exact same Terms of Service with the same spelling errors and the same unique wording. The only difference was that Closingleads referenced an additional company named HouseVenture, Inc.\n\nI looked up HouseVenture, Inc. It is a Delaware corporation. The same corporate filing service was used across several of the companies. HouseVenture also has a D+ rating with the Better Business Bureau for not responding to a complaint from 01/21/25 where a customer who reported paying them $1,992 on 02/15/24 when they were using the name Broker Spot. There is also a recent California filing for HouseVenture that shows the owners have the same names as the admins running the Facebook groups mentioned above.\n\nAll of this together was enough for me to step away. The connection between the companies, the shared Terms of Service, the identical Facebook admins, and the past complaint history did not pass the sniff test. I did not end up sending them any money, but it is clear that many agents do. Since posts asking questions get blocked in the same groups used to promote these services, I wanted to bring the information here where people can actually see it.\n\nIf you know newer agents who might be considering these programs, please share this post with them. Upvote it and comment so it stays visible for others who are researching the same companies. There are real lead sources out there and real pay at closing options, but everything I found here raised too many red flags.\n\nI hope this helps someone avoid wasting money.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1763997141.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question about legitimacy of companies; seeks experiences; not clearly actionable or explanatory.",
    "composite_score": 2.646483845514409
  },
  {
    "score": 17,
    "title": "Built a real estate AI that monitors your listings and follows-up with buyers - looking for feedback",
    "selftext": "Hi everyone, I've built a custom real estate AI system for few local agencies and am looking for more testers to improve and grow the product.\n\nHere is what it does:\n- Scans on regular basis your listings via website, CRM or files you provide. Trains AI on them so it has full context of your portfolio.\n\n- Replies to buyers via web chat, SMS / Whatsapp, email and social media. Qualifies them and stores them in sheet or CRM.\n\n- Follows-up with qualified leads on regular basis and offers them any new or edited listings that match their search. Follows them through the whole journey, so if they change their preferences or your portfolio changes, it will act acordingly. \n\nLooking for feedback on UI, workflow and quality of responses and followups. Please reach out and I can arrange an account for you.",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1748340973.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Bullet list of real estate AI features; product details.",
    "composite_score": 2.8249121481342465
  },
  {
    "score": 17,
    "title": "ZIllow Api access?",
    "selftext": "Does anyone here have success in getting access to the [zillow zestimates api](https://www.zillowgroup.com/developers/api/zestimate/zestimates-api/)? Building a cool app, [whatsbitcoinsprice.com](http://whatsbitcoinsprice.com) where I want to show users what houses they can buy in certain states for the x amount of bitcoin they own.\n\nElse, is there another free real estate api someone can recommend?",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1720885708.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Simple API question about Zillow or other APIs.",
    "composite_score": 2.795164303411711
  },
  {
    "score": 19,
    "title": "Is PeerStreet in trouble?",
    "selftext": "Invested in their PeerStreet Pocket offering as well during the pandemic since it was offering 2% interest at the time. Since then a number of things have happened…\n\n•\t⁠The company social media has been inactive since 12/15/22\n\n•     On 2/1/23 an email was sent to investors:\n\n“PeerStreet will be halting deposits into and redemptions from the Pocket Program to allow for the orderly return of Investors’ monies.”\n\n•\t⁠On 2/21/23 Layoffs Started\n\nCalifornia-based PeerStreet told the state of North Carolina it is reducing its workforce “as a result of a significant downturn in business.”\n\nSource: https://www.bizjournals.com/triangle/inno/stories/news/2023/02/21/more-tech-layoffs-hit-north-carolina.html\n\n•\t⁠There hasn’t been any new loan offerings for investors on the platform since 3/16/23\n\n•\t⁠On 4/24/23 the latest update from Investor Relations was they have “some remaining assets left to sell” and “do not have an expected date as to when that will occur”\n\nAnyone else in this situation? How long is reasonable/legal to hold on to investors money during a liquidation?\n\nEdit: 6/26 Peerstreet has filed for Bankruptcy (thanks to /u/bleedsixcolors for passing on the info)\n\n[Peerstreet Chapter 11 Filing](https://cases.stretto.com/peerstreet/)\n\n[US Bankruptcy Court - District of Delaware](https://www.deb.uscourts.gov/recently-filed-chapter-1115s)\n\nEdit: 6/28 \n\nHere is more information from today’s Bankruptcy Proceedings:\n\n[Real estate debt marketplace PeerStreet files for bankruptcy](https://www.inman.com/2023/06/28/real-estate-debt-marketplace-peerstreet-files-for-bankruptcy/)\n\n[Crowdfunding platform PeerStreet files for bankruptcy](https://www.housingwire.com/articles/crowdfunding-platform-peer-street-files-for-bankruptcy/)\n\nEdit: 6/29\n\nHere are the FAQs posted today inside the Peerstreet Portal along with this announcement:\n\nBankruptcy Announcement\nPeer Street, Inc. and its affiliated companies (“PeerStreet”) filed for protection under chapter 11 of the United States Bankruptcy Code in the United States Bankruptcy Court for the District of Delaware on Monday, June 26, 2023.\n\nPlease see this Press Release.\n\nIn light of PeerStreet's recent Chapter 11 bankruptcy filing, all transactions have been paused. PeerStreet will ultimately be seeking a distribution construct approved by the Court to pay investors. Information about the bankruptcy case can be found at https://cases.stretto.com/peerstreet along with a list of Frequently Asked Questions.\n\nIt is particularly important that you review any notices emailed to you from Stretto, as Court approved noticing agent.\n\n[Peerstreet Bankruptcy FAQs](https://cases.stretto.com/peerstreet/faqs/)",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1682916510.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Detailed update about PeerStreet; seeks opinions on liquidation timelines.",
    "composite_score": 2.9856458555294694
  },
  {
    "score": 16,
    "title": "Real-world feedback on using HomeLight?",
    "selftext": "I’m a writer for a real estate media company currently researching HomeLight, and I’d love to hear from agents, buyers, or sellers who’ve used the platform.\n\nIf you’ve had firsthand experience with HomeLight (for agent matching, cash offers, trade-in services, or anything else, either as a customer or as an agent) would you be willing to share:\n\n* What worked well (or didn’t)?\n* How did the agent matching compare with other services?\n* Did the pricing, timelines, or offers meet your expectations?\n* Would you use it again or recommend it?\n\nI’m not affiliated with HomeLight or trying to sell anything. Just looking to include real, balanced perspectives in a piece for consumers weighing their options. Thanks in advance for any insights you’re willing to share!",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 16,
    "downs": 0,
    "created_utc": 1748467255.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Request for experiences with HomeLight; not action steps.",
    "composite_score": 2.174009548738105
  },
  {
    "score": 17,
    "title": "Has anyone used UpNest (as an agent or seller)? Looking for feedback on the tech + UX",
    "selftext": "Hey all! I’m a writer covering trends in real estate tech, and I’m currently researching UpNest and its platform. I’m curious how well it actually performs in the wild, both for agents and sellers.\n\nIf you’ve used UpNest to:\n\n* **Compare agent proposals**\n* **Submit proposals as an agent**\n* Or **close a deal through the platform**\n\n…I’d love to hear your experience.\n\nSome questions I’m exploring:\n\n* How smooth is the user experience on both sides?\n* Do the leads actually pan out into transactions?\n* Is the pricing model (referral fee for agents, free for sellers) sustainable and fair?\n* Anything you wish you knew before using it?\n\nTrying to cut through the marketing speak and understand how this tech performs in real-world scenarios. Would appreciate any insights, stories, or strong opinions, and happy to follow up in the comments if you’re open to chatting more!\n\nThanks in advance 🙌",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1748043705.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Request for experiences with UpNest; not steps.",
    "composite_score": 2.356848130295128
  },
  {
    "score": 10,
    "title": "If you work with maps, this is for you",
    "selftext": "I was a data scientist at the UK Department for Energy Security &amp; Net Zero, where I built national infrastructure tools like the Heat Zoning Model and UK Buildings Database, so I’ve seen firsthand the geospatial challenges in infrastructure planning.\n\nI built Unpaved AI - a web-native AI-powered geographic information system that lets you run spatial analysis with natural language.\n\n\nWould love to get your feedback - https://unpaved.ai",
    "subreddit": "RealEstateTechnology",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1757467030.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/ob90t3ean8of1/DASH_720.mp4?source=fallback",
        "has_audio": true,
        "height": 720,
        "width": 1280,
        "scrubber_media_url": "https://v.redd.it/ob90t3ean8of1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/ob90t3ean8of1/DASHPlaylist.mpd?a=1770354691%2CYWFhZTU1MWY3NzJjMWVkMThlZWNhMjI4ZDVhZjdlZTllMTc3ZDBjNTY2YWMyNDYwNDBjMzkzYzBkYWQxNjIwYg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 437,
        "hls_url": "https://v.redd.it/ob90t3ean8of1/HLSPlaylist.m3u8?a=1770354691%2CZThhNzkzNWIzN2RmMzVmYjJhY2NlY2Y5NTMzMmY3NTU4ZjgyNDI3ODE1YjgxZTJiYTJmMzIyMjQ4OGUzYzE2Nw%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Promotional post introducing a GIS product and requesting feedback; not a list, steps, or explanation.",
    "composite_score": 2.2433643613116434
  }
]