[
  {
    "score": 54566,
    "title": "My company announced mandatory office days again, so I resigned mid-meeting",
    "selftext": "We were having a “surprise ” all-hands today, and HR proudly announced that starting next month, everyone must come in three days a week “to rebuild team spirit ”. I asked if they’d be covering commuting costs since gas and train prices doubled this year. The HR rep laughed and said, “ That’s part of being a team player ”. So I turned off my camera, opened my email, and sent my resignation letter right there. my manager pinged me two minutes later asking if I was serious. I said, “ Dead serious. I already found a remote job that values my time ”.   \nBest lunch break ever.\n\n",
    "subreddit": "remotework",
    "upvote_ratio": 0.74,
    "subreddit_type": "public",
    "ups": 54566,
    "downs": 0,
    "created_utc": 1759995487.0,
    "media": null,
    "is_video": false,
    "num_comments": 3648,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 7.073017009356615
  },
  {
    "score": 50781,
    "title": "My manager said “ remote work kills team connection ”, so I invited him to one of our calls",
    "selftext": "He joined, stayed silent for 40 minutes, then messaged me privately saying “ wow, you all actually talk a lot”. Yeah, because we don’t spend half the day pretending to be busy or whispering in cubicles. We work, we chat, we joke, we actually like each other. The irony is that we built a stronger team \\* without \\* being forced to share air conditioning. Maybe connection isn’t about location, just respect.\n\n",
    "subreddit": "remotework",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 50781,
    "downs": 0,
    "created_utc": 1760355672.0,
    "media": null,
    "is_video": false,
    "num_comments": 1167,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.944431222531237
  },
  {
    "score": 33187,
    "title": "Remote work completely changed how I see “ sick days ”",
    "selftext": "Back when I worked fully in the office, a sick day meant either forcing myself to go in half-dead because I didn’t want to waste PTO, or staying home and stressing about the pile of work waiting for me. Since working remote, it’s different. Last week I had a cold, stayed wrapped up in blankets, answered a few emails, and rested the rest of the time. I didn’t feel guilty, I didn’t infect anyone, and I still got enough done to keep things moving. for the first time in years I realized how broken the office mindset was, dragging yourself in just to show your face while spreading germs around. remote work didn’t just save me commuting time, it gave me back the right to actually recover when I’m sick without feeling like I’m failing at my job.\n\n",
    "subreddit": "remotework",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 33187,
    "downs": 0,
    "created_utc": 1759573764.0,
    "media": null,
    "is_video": false,
    "num_comments": 1272,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.785895283246125
  },
  {
    "score": 28792,
    "title": "Got laid off due to an RTO requirement the week I was going to put in my 2 weeks and quit.",
    "selftext": "Thought you all would get a kick out of this story. I am still laughing.\n\nSo earlier this year our company got bought out which brought some big changes. Culture changed overnight with more micro managing etc... We were told to expect an RTO requirement some time this year. I live over 2 hours away from the office so that was a no go. I started putting out resume's and last month I went through the interview process and got an offer from a great company. It is a hybrid instead of full remote but only 2 days in a week and is only a few minutes away from my house.\n\nMy plan was to put in my 2 weeks at the end of this week and offer any assistance to make the transition smooth until I leave. Was at the company for a decade plus so wanted to leave the right way. I was going to time it where I would have a week off before the new job started.\n\nLog in on Tuesday and there is a \"business update\" meeting on my calendar. I get on an my boss and HR tell me an RTO mandate is in place starting next month. Since I live out of the footprint I can choose to come in or accept a severance package as I will not be allowed to work remote. They offered me a 7 month severance package plus bonus payout and gave me 24 hours to consider.\n\nI couldn't believe it. I was days away from giving them my 2 weeks and had another job lined up and now I am being given 7 months pay (before taxes) on my way out the door. If it had been a few days later I would have quit and they probably just let me walk.\n\nNow I have 3 weeks off before I start new job with a nice pay raise and a nice check coming next month.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 28792,
    "downs": 0,
    "created_utc": 1760643428.0,
    "media": null,
    "is_video": false,
    "num_comments": 683,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.604314968102446
  },
  {
    "score": 22990,
    "title": "Remote work is making me realize who on my team was actually working",
    "selftext": "So we went from fully remote to this weird hybrid thing 3 days in, 2 days home. And suddenly some people who were \"always so busy\" are now super available in the office, answering mails in 30 seconds, joining every meeting. At home they were invisible. No Slack replies, no updates, always \"oh my VPN was down\". Crazy coincidence.\n\nI am not anti office, I get it, some stuff is easier face to face. What annoys me is that remote got blamed for \"low engagement\" when the real problem was that a few people were just coasting under the camera off. And now leadership is acting like the solution was more chairs. It wasnt. The solution was tracking work. I finish the same amount from my kitchen as from their open space with the loud printer. Funny how output is never the metric, only butts in seats.",
    "subreddit": "remotework",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 22990,
    "downs": 0,
    "created_utc": 1761813035.0,
    "media": null,
    "is_video": false,
    "num_comments": 1420,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.597854900404258
  },
  {
    "score": 18151,
    "title": "Coworker thinks she's escaped. She has not",
    "selftext": "I work for a company owned by a large holding company. They recently came out with a hybrid RTO mandate for those living within 50 miles of an office. Fortunately for me, I dont even have an office in my state. My coworker was not so lucky, having to add a 40 mile commute each way three days a week.\n\nJust today, my coworker let me know that they got a new job. New job pays better, has better growth opportunities, and is fully remote a few states away. I couldn't be happier for her, she really deserved it.\n\nWell not even 2 hours hours later I get pulled into a leadership meeting with our holding group. They were excited to announce a new acquisition, which of course is the company my coworker just left for.\n\nWell this is where it gets weird. The newly acquired company will be under the same RTO mandate as the rest of their companies. The mandate says if your within 50 miles of an office, ANY office owned by the holding company, you must come in 3 days a week. \n\nThe aquisition will likely take some time, but once fully integrated, my new coworker will be living the hell fueled nightmare of having to return to work at the office she just quit, even though she doesn't work there anymore.\n\nSpending my morning deciding how and when to break the news to her. These corporate policies are insane.\n",
    "subreddit": "remotework",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 18151,
    "downs": 0,
    "created_utc": 1760709807.0,
    "media": null,
    "is_video": false,
    "num_comments": 708,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.404247600468413
  },
  {
    "score": 17797,
    "title": "I left, my whole team followed, and now my old company is panicking. A reminder to know your worth.",
    "selftext": "For a long time, I worked at a tech agency and felt completely undervalued. When I started, I was managing 6 projects for about $90k a year. and honestly, I was just grateful to have a job, so I kept my head down and didn't ask for more. Looking back now, I realize that was a huge mistake. I somehow found myself managing 22 projects and leading a team of 6, all for the same salary.\n\nI had reached my breaking point. In my last performance review, I presented all the extra work I was doing and asked for a raise to match my market value, which was roughly double my salary. Management gave me the classic 'we'll look into it' response, then proceeded to string me along for months. Senior leadership kept passing the buck, claiming their hands were tied. I got fed up, started applying elsewhere, and quickly landed a firm offer for $170k with a start date in 3 weeks. The new place also told me they were hiring more people and to let them know if I knew anyone good. I took a risk and was transparent with my direct team of 6. I told them I was resigning but that I could line up interviews for them if they also felt stuck.\n\nI submitted my 2-week notice, and not even half an hour later, my director called asking what it would take to make me stay. I told him the same number I had told my manager. He practically scoffed and said, 'Good luck with that, we'll replace you easily.' So, I left. Then, over the next week, all 6 members of my team interviewed, got offers, and resigned one by one. From what I hear, all 22 of those projects have come to a complete standstill, costing the company tens of thousands daily in penalties and missed deadlines.\n\nThe company has since been blowing up my phone and my old colleagues' inboxes, begging us to come back and saying salary is no longer an issue. We all refused. The feeling of vindication is unreal. It just goes to show that some companies don't care about your loyalty; they only care about their bottom line. By the way, after my first performance cycle at the new job, they gave me a $15k raise out of the blue.\n\nThe cultural difference is night and day. Always know your worth. If this story resonates with you, maybe it's time to have that difficult conversation or start looking elsewhere. You're probably worth a lot more than you think.\n\nEdit: I didn't imagine that the subject would create all this buzz. Thank you, guys, for the support. I wished for it to reach the largest number of people so that the youth can start to appreciate themselves and escape the exploitation of companies.\n\nI wanted to provide you with some[ interview tips](https://www.reddit.com/r/interviewhammer/comments/1nsm6q0/my_guaranteed_method_to_ace_any_job_interview/). The job market is full of better opportunities, but it's always difficult to reach them if you are still a beginner.\n\nIf I have any advice, go look for your exact role on a job search right now and find the average salary. If you are underpaid, I hope this message is the catalyst for you to leave! Don't be loyal to companies, they don't care about you!!!",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 17797,
    "downs": 0,
    "created_utc": 1759078090.0,
    "media": null,
    "is_video": false,
    "num_comments": 336,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.241686152870147
  },
  {
    "score": 14457,
    "title": "Guess who no longer works at home.",
    "selftext": "This morning, I got a surprise video call from my manager, telling me that our entire team has to return to working from the office full-time. This is despite the fact that I was originally hired on the basis that this job is remote.\n\nShe asked me if I had any problem with this change, so I honestly told her that I don't have a car and the office is about 40 miles away from my home. Her response was: 'Unfortunately, your personal commute is not the company's responsibility.'\n\nAnd before I could even process what she said, she ended the call. I am completely shocked and don't know what my next step should be.\n\nE: I've decided not to quit my job until they fire me, so I can apply for unemployment benefits. Until that happens, I will be looking for another job.\n\nHas anyone noticed that remote work has become very rare, or is it just me?\n\nI think it's related to the job market. I read many articles on this subreddit about the problems in the job market and the [RTO](https://www.reddit.com/r/remotework/comments/1nacsod/got_laid_off_today_for_performance_issues_after/).\n\nI thought I was going through a setback alone, but it's clear the situation is affecting everyone.",
    "subreddit": "remotework",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 14457,
    "downs": 0,
    "created_utc": 1759069100.0,
    "media": null,
    "is_video": false,
    "num_comments": 1772,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.48196258821141
  },
  {
    "score": 14080,
    "title": "My manager scheduled a “mandatory fun” Zoom call on a Friday evening",
    "selftext": "We’ve been remote for over two years, and somehow my manager still doesn’t get it. Last Friday at 6 PM, she sends a calendar invite titled “Team bonding time!”, right when everyone was about to log off. The call starts with awkward small talk, then she pulls out a PowerPoint quiz about company values. People were clearly muted, pretending to have “mic issues.” One guy actually turned off his camera and started cooking mid-call. After 20 painful minutes, she says “I don’t feel much engagement here,” and schedules another one for next week. I swear, nothing kills morale faster than forced fun.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 14080,
    "downs": 0,
    "created_utc": 1760772341.0,
    "media": null,
    "is_video": false,
    "num_comments": 995,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.375263167701199
  },
  {
    "score": 12300,
    "title": "Amazon's RTO is backfiring according to recruiters...no kidding",
    "selftext": "Amazon's RTO mandates (Return to Office) are apparently \"hampering recruiting efforts\", according to internal documents. \n\nRTO is \"limiting the ability to find 'high-demand talent, like those with GenAI skills.\"\n\nIt gets worse...\n\n\"Some Amazon recruiters told Business Insider that, starting last year, they saw an increase in candidates declining job offers specifically because of RTO. Those people were open to lower pay from other companies in exchange for the flexibility to work remotely.\"\n\nAnd the cherry on top...\n\n\"Oracle, for example, has hired away more than 600 Amazon employees in the past 2 years because Amazon's strict RTO policy has made poaching easier.\" \n\nLastly, Amazon is now monitoring phone for employees' $50 monthly reimbursement.\n\nThis, ladies and gentlemen, is how you lose your employees to companies the look long-term...by treating their employees like adults.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 12300,
    "downs": 0,
    "created_utc": 1756995224.0,
    "media": null,
    "is_video": false,
    "num_comments": 749,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.254971050194484
  },
  {
    "score": 11828,
    "title": "Remember, IT controls your work computer.",
    "selftext": "Just a funny story and reminder to use your work computer for work only. \n\nWhen turning on my laptop this morning, we are supposed to shut down every night, I get an error message this morning. So I open an IT ticket.\n\nI get an email from IT that they are going to jump into my computer and boom. They take control. Literally nothing visible changed. \n\nSo now I sit here and watch thrm do their thing, while sipping coffee ",
    "subreddit": "remotework",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 11828,
    "downs": 0,
    "created_utc": 1763560058.0,
    "media": null,
    "is_video": false,
    "num_comments": 1601,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.3727792876669955
  },
  {
    "score": 11733,
    "title": "My Job Went RTO.. I am now flying to the office every week",
    "selftext": "Yep.. you read that right.  It’s a 1000km (600 mile) flight that takes about an hour.  I’m killing the planet because some asshat upper management needs to justify their office space investment.  Last week we had an “all hands” in office event.. there were not nearly enough desks for all the staff.  Everyone still dials in for the Teams meetings and there is huge resistance to the RTO mandate.  But “as a leader” I need to “lead by example” and they are doing random spot checks to see if you are in fact at the office.  Needless to say.. I’m quitting this otherwise great job.  Fuck RTO and I’ll let them know that is the only reason I’m leaving.",
    "subreddit": "remotework",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 11733,
    "downs": 0,
    "created_utc": 1759453146.0,
    "media": null,
    "is_video": false,
    "num_comments": 648,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.158068432280497
  },
  {
    "score": 11188,
    "title": "Remote work ruined me in the best way possible",
    "selftext": "I honestly don’t know how people went back to the office after tasting remote work.\n\nLike… I just made coffee in my kitchen, answered emails in sweatpants, threw in some laundry between meetings, and still got more done than I ever did sitting under fluorescent lights listening to someone in sales yell into their phone.\n\nThe wild part? My work quality improved. I sleep better, I eat better, and my “commute” is literally 30 seconds. The only downside is my cat thinks my keyboard is a pillow.\n\nI’m not saying remote work is perfect (Zoom fatigue is real, and sometimes you forget how to socialize like a normal human), but for me? The trade-off is 100% worth it.\n\nAnyone else feel like they became way too spoiled to ever go back to a cubicle?",
    "subreddit": "remotework",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 11188,
    "downs": 0,
    "created_utc": 1759346280.0,
    "media": null,
    "is_video": false,
    "num_comments": 919,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.250685187521187
  },
  {
    "score": 10802,
    "title": "You guys need to cherish your WFH life, I got RTO’d and I’ve never been more miserable in my life ",
    "selftext": "I’m angry all the time now, everyone is noticing it. I try not to be but I’m just so irritated at everything and everyone because of the fact I’m driving 1.5 hour to sit in and office when I could do the same thing at home and save a lot of money and time. Needless to say, I’m looking for something new and I hope I can get something. If I can’t find something by February/March I’m going to try and get into the police academy. Office life is not for me, my brain is melting slowly each day while there. I give on word responses to everyone there and I don’t engage in any convos (most got the hint and don’t talk to me at all anymore which is awesome because I dont like or care for them)  , I do what i need and then leave. I love my family so much so on my drive home I really try and get my anger out so I am not rude to my family because its not fair to them. ",
    "subreddit": "remotework",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 10802,
    "downs": 0,
    "created_utc": 1733400849.0,
    "media": null,
    "is_video": false,
    "num_comments": 980,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.241878879780922
  },
  {
    "score": 10619,
    "title": "My company’s new “remote accountability system ” literally tracks our mouse movement",
    "selftext": "Last week IT installed a new “productivity tool” that supposedly helps managers understand “work patterns.” Turns out it’s just spyware that logs our mouse and keyboard activity. If you stop moving the cursor for 3 minutes, your status turns red and your manager gets a “low activity alert.” I was reading a 20-page report and suddenly got a message asking if I was “ having technical issues. ” No, Karen, I’m just using my eyes like a normal person. People are now spinning pens on their mousepads or setting their pets on the desk so the tracker doesn’t flag them. One guy even taped his mouse to a Roomba. I swear we’re turning into a parody of ourselves. Remote work was supposed to be about trust and flexibility, not digital babysitting.\n\n",
    "subreddit": "remotework",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 10619,
    "downs": 0,
    "created_utc": 1760445809.0,
    "media": null,
    "is_video": false,
    "num_comments": 792,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.195761110404252
  },
  {
    "score": 10525,
    "title": "My company made us come into the office to join a virtual meeting... from our desks",
    "selftext": "I wish I was kidding. They announced a “team alignment meeting” and said attendance was mandatory \\*in person\\*. So I commuted 45 minutes, sat down at my desk, opened my laptop, and immediately got a Zoom invite. Turns out the “meeting” was with another branch, fully remote. We all just stared at each other across cubicles, sitting in the same call we could’ve joined from home. The kicker? The manager said it was about “rebuilding team connection.” Yeah, nothing says connection like silent eye contact through a webcam ten feet away.",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 10525,
    "downs": 0,
    "created_utc": 1760860058.0,
    "media": null,
    "is_video": false,
    "num_comments": 408,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.06312501968493
  },
  {
    "score": 10471,
    "title": "My manager wants me back in the office ‘for visibility.’ I work in cybersecurity.",
    "selftext": "\nGot an email this morning saying leadership wants “critical team members” to return to the office for visibility.\n\nI literally monitor servers in three different countries. There’s nothing I can do from the office that I can’t do from my living room.\n\nWhen I asked why, my manager said, “It’s about being seen working.”\nMan, I work in cybersecurity, if you can see me working, something’s already gone very wrong.",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 10471,
    "downs": 0,
    "created_utc": 1762454143.0,
    "media": null,
    "is_video": false,
    "num_comments": 375,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.04262355600653
  },
  {
    "score": 9011,
    "title": "RTO 4 days in: \"Sorry - the office is getting crazy these days with everyone on meetings\"",
    "selftext": "I'm still remote but they did a recent RTO with certain criteria and the poor project manager wrote this in chat and you can see on his Teams video that he's sitting in an open-design office with dozens of individuals also trying to conduct meetings near each other. \n\nIt sounds like a telemarketing office. How does this make any sense?? How could anyone without noise cancelling headphones and other worldly focus be able to do work like this?",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 9011,
    "downs": 0,
    "created_utc": 1761230493.0,
    "media": null,
    "is_video": false,
    "num_comments": 470,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.018831636616241
  },
  {
    "score": 7475,
    "title": "I never realized how much money I was wasting until I went remote.",
    "selftext": "\nLast night, I checked my old budget from my office days out of curiosity.\n\nGas: $180/month\n\nLunches &amp; coffee: ~$250\n\nParking: $100\n\nClothes &amp; dry cleaning: $75\n\nThat’s over $600 a month just to exist in an office.\n\nNow, I make breakfast, eat leftovers, and wear hoodies. My only commute is from the bed to the desk.\n\nI used to think remote was about comfort but honestly, it’s financial survival too. I can actually save now.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 7475,
    "downs": 0,
    "created_utc": 1762365351.0,
    "media": null,
    "is_video": false,
    "num_comments": 489,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.946267332721051
  },
  {
    "score": 6478,
    "title": "I interviewed, accepted, and signed contract for a remote role. First day and they’re asking me to come into the office once a week. What do I do?",
    "selftext": "I’ve already reiterated to them that this was presented as a remote role to me and they explicitly said they know that the role was presented as remote but they want me to come in once a week. I said no, and they said they’d “check if it’s okay.” I left a full time permanent job for this contract. I told my recruiting company and they are absolutely flabbergasted and disgusted, said they’re going to talk to the manager about it. They hired another woman in the same position who started at the same time as me, we are all in other states but because I’m an hour and a half away from the headquarters I’m the only one they’re asking to come in. Is this legal? I never would have left my last job if I knew this!\n\nUpdate: Wow, this blew up! Thank you everyone for all of your advice. I spoke with my manager today, it sounds like upper management kind of bamboozled both her and the recruiters telling them it could be remote and then walking back on it once they saw my address was closer. The plan is I will come in once a month for a team meeting if I’m able but that that is totally flexible and based on my availability, and I don’t have to arrive until the time of the team meeting to avoid Philly traffic. My recruiters were ready to fight for me and so was my boss because they were just as shocked and upset as I was. Everything is all good now!",
    "subreddit": "remotework",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 6478,
    "downs": 0,
    "created_utc": 1736206425.0,
    "media": null,
    "is_video": false,
    "num_comments": 513,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.909489539442965
  },
  {
    "score": 5630,
    "title": "I’m just here to brag…",
    "selftext": "I was working a hybrid job where the CEO preferred we all be in the office, even when he was working from his lake place. For a couple years I was the only one in my role, so I could work from home for weeks and nobody would really miss me. But the CEO is the kind of guy that believes if he can’t see you, you aren’t being productive, and he would start keeping your bonuses. Even from his lake place. (We all knew who the rats were)\n\nIt was every horror you can think of. Vaulted cement ceilings, loud air handlers, bad lighting, all the way on the other side of town from my house. \n\nI was minding my business one day when a recruiter reached out to me on LinkedIn. I usually ignored them because they were obviously spam. But this guy seemed kind of real and I was particularly unhappy at work that day, so I gave him my personal email. \n\nFour interviews and 12 days later I accepted a fully remote gig. The company doesn’t even have an office, so no RTO demands headed my way. Straight salary that is the same as what I made if the CEO felt like giving me my full bonus. And the culture is amazing. Need to run the kids to school? Absolutely nobody cares. Want to work from a coffee shop all day? Live your life.  \n\nI don’t know what I did to deserve this, and I don’t care. I’m so happy. \n\nEdits to answer some common questions:\n\nI work in the software industry, and I’m not an engineer. I’m not going to share the name of the company, and I don’t believe we have any current openings. \n\nMy LinkedIn profile is clean and professional. I don’t post about anything but business, and I keep my posts professional. I don’t trash competitors. \n\nGrow your LinkedIn network. The more people you know the better. Highlight universal skills. I went from one very closed ecosystem to a completely different closed ecosystem. My new employer cared about the universal skills, not how much I knew about a specific product. \n\nBe open to the unexpected. I took a chance on a cold call from a recruiter and my life changed. \n\nPlease don’t DM me and ask for a job. I don’t have that kind of juice. ",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 5630,
    "downs": 0,
    "created_utc": 1757984269.0,
    "media": null,
    "is_video": false,
    "num_comments": 233,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.66269345604608
  },
  {
    "score": 5227,
    "title": "My company tried to \"reward\" us for returning to the office with free pizza",
    "selftext": "We’ve been fully remote for three years and it worked perfectly. suddenly management announced we all had to come back to the office twice a week. People were upset, but today they tried to soften the blow by giving us free pizza in the break room. Like.. that’s supposed to make up for gas money, wasted commuting hours, and the fact that I now lose two hours of my day sitting in traffic. The kicker ? They only bought five pizzas for a team of 25. by the time I got there, it was just empty boxes and a puddle of grease on the table. Meanwhile my WiFi at home never ran out of slices.",
    "subreddit": "remotework",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 5227,
    "downs": 0,
    "created_utc": 1759154985.0,
    "media": null,
    "is_video": false,
    "num_comments": 567,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.808009746764016
  },
  {
    "score": 5211,
    "title": "I'm quitting in response to an RTO mandate in a couple weeks and can't wait to break the news to senior leadership",
    "selftext": "Title says it - the anticipation of seeing their reaction is killing me, even though I'm sure I'll be underwhelmed. I just have nobody to share my emotions with on this so wanted to post here sort of as on outlet.\n\nCompany is starting mandatory RTO 3 days/week within a 60 mile radius. About 6 years ago, my family (wife and I have small kids) moved to a small town outside the city for more space, more laid back way of life, and cheaper living costs. It is just within the radius at ~55 miles. Don't worry, absolutely no exceptions; as these sociopathic C Suites tend to do.\n\nThis was right at the time I got hired at this job, which was pitched as a permanently remote job. It is *why* we were able to move to where we are, and we have built our whole lives around the assumption I'd be remote indefinitely. It pays slightly below market but they used remote work as a perk to compensate back before it was \"cool\". Company has been extremely successful with distributed work over the years, but of course, private equity bought us out, and a fresh C Suite came on and they know better than everyone else what the company \"needs\".\n\nI've been \"loyal\" to this company the whole time - love the culture, love my team, love my manager, love the work. I am also a high performer. Literally none of that matters; you are a piece of meat to these people and nothing more.\n\nStarted looking for jobs as soon as it was announced and found one pretty quick, full remote, great culture from the looks of things. So, what's a guy to do? I'll tell you - the day before my new job starts, I'm going to give them an ultimatum: grant me an exception and let me work remotely permanently or I'm gone, on the spot (UPDATE: many of you are right, I shouldnt issue an ultimatum; i should just resign and make it extremely clear the *only* reason is the RTO). This would really screw them; we run pretty lean and they rely on my heavily as a leader and individual contributor.\n\nMind you - this is the last thing I wanted to do. I asked politely many times for exceptions (e.g. narrowing the commute range to 50 miles, since i am the only one outside that range - they for sure chose that so *I specifically* would need to come in). Or, just any miniscule level of flexibility or humanity (literally won't even let you work remote on bad weather days). They brought this upon themselves, and I can't really describe this emotion I have - I am just fantasizing about telling them, and seeing how screwed they are after I leave.\n\nDoes that make me a bad person? I'll let the rest of you be the judge. But there's no way I'm giving 2 weeks notice (UPDATE: Many of you rightly called this out as a bit of a dick move to my coworkers, and I don't disagree - I'm now planning to give the 2 weeks and leave it in their court if they want to let me go on the spot or not. Worst case I'm let go and I need to tell my new company I need to start earlier, or take a little unpaid vacation, which isn't the end of the world) since I'm virtually certain they'll just fire me on the spot, and thats ok. This company died in my head a long time ago. Only thing that makes me feel bad is leaving my team and manager, but they're awesome - they'll all likely leave soon as well anyway, and then leadership will have some serious soul searching to do after the exodus of talent.\n\nSo, maybe this will be a tiny sliver of solace and hope for the rest of you suffering through inhumane RTO policies that we *do* have some power in this, it is not hopeless; companies still only exist because of our labor, and that's the best way to really hit them where it hurts - take their best performers and bring our talents elsewhere.",
    "subreddit": "remotework",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 5211,
    "downs": 0,
    "created_utc": 1756948870.0,
    "media": null,
    "is_video": false,
    "num_comments": 1062,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.9352710393021955
  },
  {
    "score": 4991,
    "title": "RTO mandate started this week. Morale has never been lower.",
    "selftext": "My company hired this new SVP, some old rich white lady that looks like Dolly. She places a RTO mandate for our entire state, precursor to layoff surely. We have people being told to commute four hours, move for a 40k/year job, or they’ll be fired for cause.\n\nThis plastic fuck walking around the office all week for the festivities, drink mimosas, etc. I’ll never see her again because she’s about to go back remote after this week. I won’t get to put my kids to bed next week because I won’t get home until they’ve been out down.\n\n“Rules for thee, not for me.”\n\nI can’t wait until we eat fuckers like this. Makes me so god damn angry. Money really is the root of evil, I hope this perfume bitch fucking chokes.",
    "subreddit": "remotework",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 4991,
    "downs": 0,
    "created_utc": 1746805965.0,
    "media": null,
    "is_video": false,
    "num_comments": 554,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.790421068235705
  },
  {
    "score": 4957,
    "title": "RTO is getting us all sick",
    "selftext": "My company went full on RTO in January, with no flexibility to work from home (eg, if you’re sick you either come in and infect everyone or take a sick day) and only five sick days allowed. \n\nGuess what? My coworker is coming down with something. Because she’s feeling well enough to drive in, she’s sharing her germs with all of us. She doesn’t want to use her sick days. \n\nThanks, Boomer CEO who thinks we can’t actually get work done at home. ",
    "subreddit": "remotework",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 4957,
    "downs": 0,
    "created_utc": 1743707535.0,
    "media": null,
    "is_video": false,
    "num_comments": 478,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.755474279139084
  },
  {
    "score": 4857,
    "title": "RTO is the new war on the middle class",
    "selftext": "It seemed that the middle class finally found a way to afford a living.  Remote work allowed us to move to less congested and less expensive locations, while still be able to find a livable wage.  We could actually have a decent life, raise a family, and we could even make it work on one income.  We finally broke free from the dystopian urban centers that the upper class had us locked in.  But they can never have enough.  Everyone must suffer in order to serve them.  Now they want us back to modern day slavery.  Next will be corporate housing because none of us will afford to live in those horrendous downtowns.  Well, I am not going back, unless I am desperate, and only temporarily.  The economy will get better.  They will be competing for our labor again soon.  And when that happens, I will remember exactly the infamous names of companies that do not deserve my service.",
    "subreddit": "remotework",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 4857,
    "downs": 0,
    "created_utc": 1727667081.0,
    "media": null,
    "is_video": false,
    "num_comments": 730,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.823416198948042
  },
  {
    "score": 4803,
    "title": "Job has gone unfilled for 4 months because they won't allow remote",
    "selftext": "A recruiter just called me about a job she had contacted me about 4 months ago. It's in a different state and would require me relocating and coming on-site, probably so I could sit on zoom calls all day. I told her again I'd be interested if it was remote. She said the management needs data showing they can't find local qualified applicants before they'll allow remote. I guess 4 months of not finding a candidate isn't enough evidence. The recruiter also told me the last 4 jobs she worked on for the company were eventually allowed to be remote because they couldn't find local candidates. The management must be clueless. At some point it seems like they would realize that offering remote would be a lot easier for them and probably more efficient too.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 4803,
    "downs": 0,
    "created_utc": 1759279143.0,
    "media": null,
    "is_video": false,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.500024792703255
  },
  {
    "score": 4714,
    "title": "Had my first direct report quit due to RTO",
    "selftext": "My company forced RTO for 2 days effective Jan 1 after nearly 5 years of giving employees pure flexibility. I am a supervisor and just had my first direct report quit due to it. She is a mother who was hired in remote work conditions in 2022 and stated that a long commute 2 days a week did not work for her. She was a strong worker. Now she's out and we have to interview, likely for many months because my company only wants to hire unicorns. Once we do find someone I will be spending many more months mentoring and bringing them up to speed.\n\n  \nSo yeah RTO is pretty shit for me so far. That's my anecdotal rant.",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 4714,
    "downs": 0,
    "created_utc": 1739854990.0,
    "media": null,
    "is_video": false,
    "num_comments": 322,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.663082958238899
  },
  {
    "score": 4402,
    "title": "99% of companies who implemented RTO saw reduced employee engagement",
    "selftext": "In addition, new data has come out that 1/4 of bosses used RTO (Return To Office) as a technique to get their employees to quit.\n\nThey gaslit you, saying that it was all about...\n\nCulture  \nProductivity  \nCollaboration\n\nAt this point, I'm not even defending remote work, I'm defending logic and common sense...and NOT LYING.\n\nSo if it's not actually about getting their employees to quit, then what these executives are saying is:\n\n\"We believe physical presence is more valuable than generating business outcomes.\"\n\n\"We don’t trust you unless we can see you, like a toddler\"\n\n\"We’d rather maintain our old habits than evolve how we lead the company\"\n\n  \nSources: \n\n99% metric: [https://papers.ssrn.com/sol3/papers.cfm?abstract\\_id=4675401](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4675401)\n\n1/4 metric from Bamboo HR study: \"Nearly two in five (37%) managers, directors, and executives believe their organization enacted layoffs in the last year because fewer employees than they expected quit during their RTO. And their beliefs are well-founded: One in four (25%) VP and C-suite executives and one in five (18%) HR pros admit they hoped for some voluntary turnover during an RTO, proving, in some cases, why RTO mandates are layoffs in disguise.\"",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 4402,
    "downs": 0,
    "created_utc": 1760730560.0,
    "media": null,
    "is_video": false,
    "num_comments": 258,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.585398567500152
  },
  {
    "score": 4197,
    "title": "My company just announced mandatory office days... for remote employees only",
    "selftext": "We literally don’t even have an office. They’re renting a coworking space once a week “ for culture and collaboration. ” The kicker? We have to pay for our own commute and lunch, and attendance is “ strongly encouraged, ” which in corporate language means required. So now I’m expected to waste half a day sitting in a random coworking room doing the same Zoom calls I do from home, just with worse Wi-Fi. The manager called it a “ fun experiment. ” Yeah, nothing says fun like pretending we’re not remote anymore.",
    "subreddit": "remotework",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 4197,
    "downs": 0,
    "created_utc": 1759766185.0,
    "media": null,
    "is_video": false,
    "num_comments": 515,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.684367285059988
  },
  {
    "score": 4123,
    "title": "My boss suggested I get a live-in nanny so I could stop caring about my kids and care more about… Zoom meetings?",
    "selftext": "A couple years back, my managing director flew in from India to the US. During a team lunch, someone asked why we had to come into the office three days a week if all we did was sit on Zoom calls anyway. He did not take that question well.\n\nNow, my situation was a little different. I was one of the only specialized senior engineers left after Covid. No replacement for me, lots of responsibility. And I had been working remotely for years, even pre-Covid, which was a lifesaver for my family situation.\n\nBut this MD insisted on a one-on-one with me. It wasn’t so much a conversation as an interrogation. He could not fathom why I wouldn’t just follow the “3 days in office” rule. I explained: flexibility was non-negotiable for me. I wanted to be there for my family.\n\nThat’s when he hit me with what I still consider the wildest “solution” I’ve ever been offered in a professional setting:\n\n“Why don’t you just get a live-in nanny? She can help raise your kids with your wife while you focus on your career.”\n\nSaid with a completely straight face.\n\nI never went back to the office after that. I left the company, found a better job, and kept my priorities intact. But sometimes I think about how genuinely baffled he was that I’d choose family time over climbing the corporate ladder. Like, the man looked at me like I’d just said I wanted to retire at age 35 and become a goat farmer.\n\nAnyway, my kids know who I am, my career’s still fine, and no nanny lives in my house. Call it a win.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 4123,
    "downs": 0,
    "created_utc": 1757364267.0,
    "media": null,
    "is_video": false,
    "num_comments": 220,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.515014793454034
  },
  {
    "score": 3967,
    "title": "RTO and why it is happening",
    "selftext": "I see everyone here so confused and confounded with the idea that so many companies are forcing a RTO when profits, productivity and overall employee mood and wellbeing are at an all time high. \n\nIt is the economy. The entire economy. WFH encourages frugal spending. People aren't buying overpriced coffees, they all bought Keurigs or some form of machine for home. People aren't as encouraged to go out for breakfast and lunch. They aren't going out for after work drinks with co workers. The lack of commuting means less gas being used. Less wear and tear on vehicles means you don't need a new car as often. Or to have it serviced with new brakes, tires, oil changes. Public transportation takes a hit along with the automotive industry. A huge drop in clothing purchases, people are wearing sweatpants and those who work off camera don't need professional attire at all. Commercial real estate owners see their investments vaporizing before their eyes as businesses cancel leases or downsize office space. \n\nAll you have to do is follow the money. WFH threatens the entire system and those who reap the rewards from it. As long as people profit from you being in the office, in the office you will be. ",
    "subreddit": "remotework",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 3967,
    "downs": 0,
    "created_utc": 1756385700.0,
    "media": null,
    "is_video": false,
    "num_comments": 604,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.694449350808376
  },
  {
    "score": 3786,
    "title": "After 5 1/2 years my boss finally asked me to give up my office",
    "selftext": "I worked at home from 2009 to 2017. Got laid off and found a job 10 days later that I love. I'll work here until I retire if they'll have me. \n\nIt was full time in the office. I didn't mind it other than the commute which was 50 miles each way (and horrendous traffic). \n\nBeen back remote since March of 2020 and I don't think I can ever go back to full time in the office. \n\nMy boss just asked me if I would give up my office and I was more than happy to. I figured if I had a nice big office with a view they would eventually want me to use it. Now I'll just use a random office whenever I have to be in the office. I have to go in once in a blue moon (usually once a quarter or so) and I'm okay with that. \n\nSo happy to work for a company that has continued to embrace remote work. ",
    "subreddit": "remotework",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 3786,
    "downs": 0,
    "created_utc": 1760573353.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.252456735181054
  },
  {
    "score": 3765,
    "title": "If they bring you back in, do not resign. Instead, go into office and be extremely incompetent at your job. They want to fire you anyways. So bleed them out. Spread the word",
    "selftext": "Staying at your RTO job and being an incompetent employee will cost the company more money than simply resigning. Resigning is what they want to lay you off so they save money. Instead, you want to stay on the company’s payroll for as long as possible while doing as bad of a job as possible that they’ll regret RTO. Also, get your coworkers to do this. Your manager will drag you into his office for “a talk” and will probably write you up. Don’t let this deter you, it’s just a part of the process; remember they’re going to fire you anyways (there’s a recession coming up, plus AI is slowly taking over jobs). Don’t be afraid to make LinkedIn posts encouraging others to do this. One incompetent employee in the office won’t get the higher-ups to cave, but a whole army will.",
    "subreddit": "remotework",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 3765,
    "downs": 0,
    "created_utc": 1737036063.0,
    "media": null,
    "is_video": false,
    "num_comments": 418,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.599487327163793
  },
  {
    "score": 3527,
    "title": "A Warning About Excessive Monitoring in Remote Work",
    "selftext": "Hi all, \n\nI posted here a few weeks ago expressing concern about the excessive monitoring at my remote job. The company I was working for utilized a 'Time Management' software called Time Doctor that we had to install on our personal computers (no company-provided laptop here), and it took webcam photos of me and my  co-workers faces every 7-10 minutes (on top of screenshots of our computer screens every 3-5 minutes). \n\nYour webcam photos are reviewed regularly, and they're 'flagged' by the operations team if you're doing something like looking away, looking down, if you're out of your seat for a screenshot (no bathroom breaks for free here), if they can't see your face in the camera, or really just any random thing that wasn't actively staring at the screen for 8 hours. You then have to defend yourself against what you were doing in the photo(s). \n\nWe would have to 'pause' the monitoring software if we wanted a break from the screen, which means pausing our working hours and having to make them up later.\n\nI have since moved on from this job, and am now working my dream remote job with ZERO micromanagement, unlimited PTO, and double the salary. \n\nI previously deleted my original post because someone tagged my company in it (I was still working for them at the time). After they were tagged in my prior post, they actually addressed it in a company-wide meeting (all 200+ employees) saying that they had seen some comments on Reddit and third party platforms about Time Doctor, and absolutely DOUBLED DOWN on this atrocious monitoring - talking about how Time Doctor is helpful for US, and it's human nature to want to steal time from the company so of course they have to protect themselves from it 🙄\n\nIn that meeting and a follow up email, they then asked for everyone's Reddit username and which professional groups they follow under the guise of getting them to help with 'reddit SEO'. It seemed to me like they were hunting for the poster, but what do I know.\n\nI just wanted to put this out there again, as a warning, since I'm free and I want others to be aware of what they're getting into.\n\nThe company is Coalition Technologies. They have job postings everywhere, and claim to only hire the best people in the world (which they then micromanage to hell and back).\n\nThey tell you when you first join that you 'may have periodic webcam photos taken', NOT that you have photos taken of your face every 7-10 minutes, and that they're gone through regularly, and that you have to be literally staring at the screen for 8 hours straight. \n\nThey CLEARLY don't trust the 'best people in the world' to actually do their jobs so this is a warning - because that job was soul sucking simply because of the monitoring and micromanagement. I hope anyone considering a role at that company reconsiders - there are much better opps out there with people who will trust you to do your work. I'm so much more motivated and productive when I don't have Big Brother watching over my shoulder.\n\nThanks for reading, hope this helps at least one person in the future. ",
    "subreddit": "remotework",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 3527,
    "downs": 0,
    "created_utc": 1740439764.0,
    "media": null,
    "is_video": false,
    "num_comments": 347,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.560818198433072
  },
  {
    "score": 3455,
    "title": "RTO is killing productivity",
    "selftext": "Company forced us back in 3 days a week and it is so unproductive. We don’t even get our own desks, it’s this stupid “hoteling” desk system where you’re supposed to book your seat in advance. You cannot leave any personal items at your desk since it’s not actually YOUR desk. No mouse, pen, headphones etc are allowed to be on a desk if you aren’t there working. \n\nIf these companies want us in office at least let us actually have a desk and keep some of our things there. I am so tired of having to lug a bunch of stuff in and out every day I’m there. \n\nThere is so much noise in this open floor plan as well and everyone is so close together there’s no personal space. No walls, not even a partition between anyone. Just rows of desks and monitors and it makes me uncomfortable and unproductive. I get so much more working from home with my own setup and a chair that doesn’t kill my back. \n\nBut I have to go to an office to sit on zoom and teams calls all day because I work with global teams and could do all of this at home without the aggravating morning commute. I don’t know anyone who thinks this sort of environment is productive in any way but companies will keep saying “it’s for the collaboration” lol.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 3455,
    "downs": 0,
    "created_utc": 1759124605.0,
    "media": null,
    "is_video": false,
    "num_comments": 392,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.563270008994569
  },
  {
    "score": 3427,
    "title": "I tracked my productivity for 3 months remote vs in-office — here’s what actually changed",
    "selftext": "I’ve seen all the boring “remote kills productivity” rhetoric, so I decided to do a little experiment for myself.\n\nI tracked everything I could measure over **3 months**: one month fully in-office, two months fully remote (my usual setup), same projects, same team, same workload. Here’s what I found:\n\n**1. Hours spent “actually working”**\n\n* In-office: \\~6.5 hours/day of focused work, the rest in meetings, interrupted by coworkers, or escaping for oxygen.\n* Remote: \\~7.5–8 hours/day of focused work. No one walking by, fewer random “urgent” messages, fewer distractions.\n\n**2. Meetings**\n\n* In-office: 15–20 hours/week, plus random ad-hoc chats that feel like work but aren’t.\n* Remote: 12ish hours/week, all scheduled, all with agendas. Meetings felt more purposeful and no pressure to keep talking for the full allotted hour.\n\n**3. Commute / “downtime”**\n\n* In-office: \\~1.5 hours/day lost to commuting.\n* Remote: That time turned into chores, cooking REAL food, or some cheeky disassociation time — basically extra energy to throw into focused work.\n\n**4. Stress / morale**\n\n* In-office: noticeably more drained, more “mental load” just being physically present, micro-politics.\n* Remote: Less stressed, more motivated / time in flow state, actually enjoyed checking tasks off.\n\n**5. Output / deliverables**\n\n* Honestly, output was **higher remotely**. Fewer interruptions, more control over workflow, better energy management.\n\n**Conclusion:**  \nRemote work didn’t make me “lazy” — it let me work smarter. The office didn’t magically increase collaboration or productivity; it mostly added distractions and stress. If companies really cared about output, they’d look at the numbers, not just “butts in chairs” to justify office rent.\n\nCurious if anyone else has tried tracking this??",
    "subreddit": "remotework",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 3427,
    "downs": 0,
    "created_utc": 1759756065.0,
    "media": null,
    "is_video": false,
    "num_comments": 274,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.467207160166293
  },
  {
    "score": 3224,
    "title": "I accidentally found out I’m making 20% less than my hybrid coworker.",
    "selftext": "\nI work fully remote. My teammate, same title, same workload, goes into the office twice a week.\n\nWe were chatting during a project handoff when payroll came up and turns out he’s making about 20% more “for locality reasons.”\n\nWe live in the same city.\n\nWhen I brought it up to HR, they said the difference “reflects the engagement benefits of in-office collaboration.”\n\nSo apparently, my salary is discounted for not wasting gas and time.",
    "subreddit": "remotework",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 3224,
    "downs": 0,
    "created_utc": 1762454282.0,
    "media": null,
    "is_video": false,
    "num_comments": 555,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.556067114762315
  },
  {
    "score": 3207,
    "title": "Teams is such a snitch. If it were a person I would say it deserves what snitches get… stitches. Anyone know how to keep that green light on? ",
    "selftext": "My boss mentioned that i was away from my computer for ~~60min~~ 90min. This type of micromanaging annoys me to high hell because I’m on salary and sometimes have to attend in person events at 7am or in the evening. It’s not like I work an 8-5. Why does it matter if I take an hour during the day. Sorry I’m mostly venting. But if anyone knows how to keep Teams green that would be awesome. \n\nEdit: So, I noticed that if I turn off auto lock on my iPhone and keep the Teams app open, its stays green/available. What do you all think about getting a 2nd phone and using it only to keep the Teams app open all day? Has anyone tried this?",
    "subreddit": "remotework",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 3207,
    "downs": 0,
    "created_utc": 1735326744.0,
    "media": null,
    "is_video": false,
    "num_comments": 953,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.716008546964173
  },
  {
    "score": 3068,
    "title": "Marc Andreesson: “Ask any big company CEO in America, they will tell you people working at home are not working.”",
    "selftext": "This was part of an interview for NYT podcast Matter of Opinion. Context: talking about DOGE's plans for improving government efficiency.\n\n&gt; And I'll just give you the most obvious one they've already talked about in public, which is just the occupancy of a federal building in Washington DC now is like 25 percent. Like a very large percentage of the federal workforce literally never came back to work. And ask any big company CEO in America, they will tell you people working at home are not working.\n\nThe idea that being in an office means people are \"back to work\" genuinely makes my blood boil. I started my career in SV and I used to worship these VCs.\n\nFuck you, Marc Andreesson. Hope a16z rots. ",
    "subreddit": "remotework",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 3068,
    "downs": 0,
    "created_utc": 1737147769.0,
    "media": null,
    "is_video": false,
    "num_comments": 639,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.610086875423766
  },
  {
    "score": 3062,
    "title": "Funny how my “WFH productivity” was amazing… until they decided to lease a new office",
    "selftext": "I worked fully remote for two years. My performance reviews? Great. Team output? Best it’s ever been. Morale? Way up.\n\nThen management signed a new office lease, and suddenly we started hearing:\n\n\"We really miss the collaboration in person.”\n“There’s just something about the office energy.”\n“Remote work is hurting our culture.”\n\n\n\nNah. Be honest. The real problem isn’t collaboration — it’s the empty building costing $$$ every month.\n\nNow I spend hours commuting just to sit on Zoom calls I could’ve done at home. Same laptop, same Wi-Fi, worse coffee.\n\nAnyone else notice how “company culture” only matters when there’s rent to pay?",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 3062,
    "downs": 0,
    "created_utc": 1759607690.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.210008799450997
  },
  {
    "score": 2999,
    "title": "Got caught",
    "selftext": "Welp let this be a friendly reminder to never get too comfortable working from home. I double all of my productivity metrics however was called into a meeting in regards to my idle time. Turns out my company is implementing a new program to track productivity as opposed to just measuring Microsoft teams. Boss wanted an explanation for all of the dead time between tasks and I couldn’t give a great answer. Kicking myself in the head for being so stupid as I assume I either get fired for this or forced to RTO. Let this be a reminder that big brother is always watching!",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2999,
    "downs": 0,
    "created_utc": 1734554625.0,
    "media": null,
    "is_video": false,
    "num_comments": 788,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.6531597563243725
  },
  {
    "score": 2788,
    "title": "Remote work will return when the AI bubble bursts",
    "selftext": "\"AI\" is not AI. \"AI\" is a marketing term. Its all machine learning, statistics and weights. Cool yes, AI no. It is not intelligence. It cannot think, it cannot reason. There are many ways that it can be useful as a tool. But the hype train wants everyone to think that it can replace humans in so many ways. No it cant. So far it has mainly created problems.\n\nThey hyped themselves first. They were mesmerized by the fact that a machine can talk back, and Sam Altman still lives in that world. He genuinely believes everything what he says while ignoring the devil which always sits in the details.\n\nSam is changing the definition of AI because he knows the con won't last much longer",
    "subreddit": "remotework",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2788,
    "downs": 0,
    "created_utc": 1756776209.0,
    "media": null,
    "is_video": false,
    "num_comments": 315,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.407792055575252
  },
  {
    "score": 2684,
    "title": "RTO = treating us like children",
    "selftext": "I was hired on hybrid (2 days remote, 3 days in office) with the option to work from home when I, as the NCP, had my tween on school vacations. \n\nRTO began Monday, and it is a shitshow. There is already a debate over whether working through lunch and eating at your desk counts toward the eight hour workday. \n\nThere is also a strong likelihood that remote work during school vacations will no longer be an option. Here’s the thing: a summer program for my young teen is not an option. Full stop. Leaving said young teen at home alone for 10 hours (8 hours plus commute) is also not an option. I can leave the young teen alone to come in for a few hours, but not all day. \n\nThis is a shitshow, they’re treating us like children, and I’m currently searching for a new, fully remote job. ",
    "subreddit": "remotework",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2684,
    "downs": 0,
    "created_utc": 1736355303.0,
    "media": null,
    "is_video": false,
    "num_comments": 551,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.512413828900174
  },
  {
    "score": 2640,
    "title": "Forced back to Office just to get fired",
    "selftext": "Just wanted to share a quick story.\n\nI was working remotely from abroad, and the company suddenly asked all the remote employees to start showing back to the office within a week. \n\nNow the main issue was that I was the only one working from abroad and I was halfway across the globe. Logistically it was not feasible to just book a flight and come back within a week as flights were super expensive and I had made arrangements for accomodation. On top of that I had a vacation planned in three weeks so going back home and then flying back just didn't make sense.\n\nAfter some emails back and forth and arguing about it I was told that I had to be in the office by next week or there would be consequences. I complied, went to the office. They set up an HR meeting with me and fired me telling me some BS about how I was pushing it by not following HR policies and started digging up issues from a year ago stating that we are misaligned.\n\nSo yeah, I was forced back to the office just to get fired. But hey at least I got 2 months worth of salary as compensation.\n\n\nEdit: If anyone knows of a company that would hire a remote Software Engineer with 4+ years of experience I would forever be in your debt!",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2640,
    "downs": 0,
    "created_utc": 1734741017.0,
    "media": null,
    "is_video": false,
    "num_comments": 246,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.353116877836757
  },
  {
    "score": 2545,
    "title": "My dad is the MAN!",
    "selftext": "Just wanted to share a little something that made my day today.\n\nWe got a bouquet at our door, and we were confused. No note at first, just flowers. I was scared that my gf sent them by mistake( my family doesn't know about us yet). But I was relieved when we found the card that read “For Mr. B.”\n\nThen my dad explained. One of his workers had been juggling work and family(he's newly married), barely taking a break, and my dad had quietly arranged for a subscription box that included snacks, coffee, little desk gadgets which will be delivered to their home for a month, just to make their days easier. The bouquet was part of his little gesture of care towards his employees.\n\nMy dad is in his 50s, runs a successful paper production business, keeps things professional and is quite strict with us at home. This took me by surprise actually. He is arranging the flowers in the kitchen vase right now. Felt a little proud of him, I wish to get a boss like him.\n",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2545,
    "downs": 0,
    "created_utc": 1761402678.0,
    "media": null,
    "is_video": false,
    "num_comments": 121,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.1840383146550115
  },
  {
    "score": 2525,
    "title": "Remote work made me realize how performative “being productive” used to be",
    "selftext": "When I worked in the office, half my day was pretending to look busy. Typing random stuff, joining useless meetings, walking around with papers so it looked like I was “ handling things ” Now that I work remotely, I actually finish my tasks in 4-5 hours and have time to live a life. but somehow that’s seen as “less dedicated ” than sitting at a desk for 9 hours. It’s wild how companies value time spent looking productive over actual results. if I can do my job in half the time, maybe I’m not slacking - maybe the system was wasting the other half.\n\n",
    "subreddit": "remotework",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2525,
    "downs": 0,
    "created_utc": 1759835264.0,
    "media": null,
    "is_video": false,
    "num_comments": 147,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.230064203916791
  },
  {
    "score": 2471,
    "title": "RTO is corporate America’s slow-motion self-destruct button",
    "selftext": "Big companies are moving in lockstep on RTO, betting that if they all tighten the screws at the same time, workers will cave and offices will become the norm like 2019. \n\nThis is delusional.\n\nWhat they miss is that remote work demand is tremendously unshakable, because the 2019 workers don't exist anymore.\n\nEach RTO push only makes people cling harder to freedom, autonomy, and agency.\n\nRTO isn’t winning back the workforce, it’s training them to patiently wait for the right opportunity and leave.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2471,
    "downs": 0,
    "created_utc": 1754809811.0,
    "media": null,
    "is_video": false,
    "num_comments": 251,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.321248736807551
  },
  {
    "score": 2471,
    "title": "Husband's employer took back WFH, lost him",
    "selftext": "He's a programmer -- a talented one too. \n\nAt first his employer said, \"Now that the pandemic is over (false), we're going hybrid, so you must be in the office two days a week.\" Then it was three. It's only a matter of time before they RTO fully.\n\nHusband had been having medical issues and asked for an ADA accommodation so he could be 100% remote (it was a good medical reason too). He was denied. \n\nHe's currently on sick leave and is actually doing much better. But one day he got a call from a head hunter, who recruited him for a 100% remote job with better pay. I asked if he was going to give his bosses an opportunity to counter-offer. His response: \"Fuck no. Fuck them.\"\n\nAnother successful (for now) company loses a good employee because they stubbornly cling to their culture of micromanagement.\n\nNow all we have to do is find a job like that for me so we can pack up the RV, slap a Starlink rig on top, and ride off into the sunset.",
    "subreddit": "remotework",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 2471,
    "downs": 0,
    "created_utc": 1714525256.0,
    "media": null,
    "is_video": false,
    "num_comments": 209,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.259158113783738
  },
  {
    "score": 2442,
    "title": "Remote Employee for 7 Years, Now Forced to Commute Because of Coworker’s Complaint",
    "selftext": "I’ve been a remote employee for 7 years, long before the pandemic. My job was explicitly hired as remote, and I live 3 hours away from the office. Commuting 6 hours a day is impossible, especially since I have a 6-month-old baby at home.\n\nRecently, the CEO announced a mandatory 4-day in office work week for hybrid employees. Initially, I didn’t think this applied to me, but then I found out that I now have to come in 3 days a week. The reason? A coworker who was hybrid and chose to relocate near me complained to management that it’s unfair he has to commute when I get to stay remote.\n\nI feel like I’m being penalized for someone else’s decision. My coworker is younger, single, and has no family obligations. I on the other hand, built my entire life around being remote. I’ve been productive and successful in this role for years, but now I’m being forced into a situation that feels unsustainable.\n\nAny advice on handling this would be appreciated.",
    "subreddit": "remotework",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 2442,
    "downs": 0,
    "created_utc": 1734062124.0,
    "media": null,
    "is_video": false,
    "num_comments": 650,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.499713961257533
  },
  {
    "score": 2319,
    "title": "A remote job isn't going to come knocking on your front door",
    "selftext": "Am I the only one that finds it borderline offensive that people think landing a well paying remote job is as simple as snapping your fingers? \n\nThe amount of posts on here that say \"Hi all, I need to find a remote job ASAP. It must pay well and offer health insurance, and I don't want anything where I have to be on the phone because I wouldn't like that. Also need flexible hours because my toddler and infant will be home with me while I work, so I need to work around their naps and drive my other child to and from school. I was previously a mechanic/waitress so I don't have any experience or skills with anything conducive to remote work,, but I' really want to work from home now. Can someone send me some links to some remote positions that are open? Thanks in advance!\" 🙄 \n\n Most of us spent many years working in the office and had to prove or negotiate our way to a remote position, or we searched specifically for a remote position based on our past years of experience and/or education (and it still often meant sacrificing pay, tenure, etc to move to a remote job).",
    "subreddit": "remotework",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 2319,
    "downs": 0,
    "created_utc": 1705006571.0,
    "media": null,
    "is_video": false,
    "num_comments": 547,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.432378264133084
  },
  {
    "score": 2311,
    "title": "Anyone see the movie “Contagion”",
    "selftext": "Showed up to the office on one of my required days. Got settled in and was getting into my projects and to-do list.\n\nAt first it was just a few coughs somewhere out in cubicle land. Then a few wet sneezes. Then… THEE worst gargly congested cough I’ve heard in a long time. Years, maybe. \n\nI decided to investigate. First thing I come across is a woman two cubes down and one across from me. She brought her pink fuzzy blankie and had it draped over her head. Her mug of hot tea was next to her box of tissues. She wasn’t even the source of the awful cough…. but I’d seen and heard all I needed to see. \n\nWent back to my desk and (ironically) Teams messaged my boss to say the office is full of sick people and I didn’t bring a mask so I am leaving to go back home. He gives me the thumbs up.\n\nPack up, drive home. Scrub hands, rinse nose and wipe everything down.\n\nDid we learn NOTHING from fucking Covid? NOTHING??! I assure you, absolutely no one wants your disease. No one thinks you’re being brave. They think you’re being an inconsiderate ass. Stay the HELL home when you’re sick.",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2311,
    "downs": 0,
    "created_utc": 1761692978.0,
    "media": null,
    "is_video": false,
    "num_comments": 142,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.176655848481023
  },
  {
    "score": 2279,
    "title": "My manager is forcing us to RTO, and his brilliant idea is a new open-plan layout. I'm in IT support and my entire job is answering calls. My job search just went into overdrive.",
    "selftext": "I honestly don't understand.\n\nOur team's productivity is through the roof. Our customer satisfaction scores have never been higher, and we're crushing all our SLAs.\n\nBut apparently, the private office where I can actually focus and get my work done is the huge problem that needs to be solved.\n\nHe's not even suggesting cubicles. No, it's going to be one giant room where everyone in tech support will be taking calls at the same time. The noise is going to be insane.\n\nThis whole disaster is supposed to happen in a month, so I'm praying I find something else and get out before then. I hope I find a fully remote job at a place that actually trusts its employees.\n\nUpdate: We had a meeting this morning explaining how the new system in the open-plan office will work, and the whole thing is that I had a nervous breakdown from the amount of noise in this situation.\n\nThe strangest thing to me is that even though we object, no one dared to discuss the situation. I feel they've just settled for looking for another job as soon as possible.\n\nHitting the remote job market to find a job is very miserable, but now I've started looking for [tips](https://www.reddit.com/r/InterviewsHell/comments/1oee74b/my_guide_to_dealing_with_online_interview_anxiety/) on how to search for a remote job and pass the interview.\n\nIf anyone works for a company that needs customer service, I hope you will contact me or help me out.",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2279,
    "downs": 0,
    "created_utc": 1761148035.0,
    "media": null,
    "is_video": false,
    "num_comments": 218,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.263156904420513
  },
  {
    "score": 2157,
    "title": "RTO Survey: 48% of Amazon workers surveyed applied elsewhere",
    "selftext": "TLDR:\n\n\t•\t48% of surveyed Amazon workers have applied for jobs outside the company\n\t•\t68% are somewhat or very likely to leave within a year\n\t•\t87% expect their productivity to worsen due to the 5-day RTO policy.\n\t•\t84% say Amazon cannot be trusted to keep its promises\n\t•\t94% anticipate higher stress levels, and 91% expect worse mental health\n\t•\t76% would not recommend Amazon as an employer\n\nIntro: https://thesoc.org/resources/amazon-corporate-worker-return-to-office-survey/\n\nFull: https://thesoc.org/wp-content/uploads/sites/342/Report-5-Day-RTO-.pdf",
    "subreddit": "remotework",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2157,
    "downs": 0,
    "created_utc": 1734636247.0,
    "media": null,
    "is_video": false,
    "num_comments": 165,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.186605484366919
  },
  {
    "score": 2131,
    "title": "Remote Work is really the only benefit U.S. workers have left, which is why management is trying to destroy it.",
    "selftext": "Let's look at the life of Millennial or Gen Z:\n\n* We can't afford homes where the jobs are.\n* We can't afford cars to get to and from said jobs (without taking on debt).\n* Many jobs do not have workers unions anymore.\n* Most jobs do not have Pensions anymore.\n\n**Remote Work is really the only benefit we have left.** I grew up in an area that is now a very high cost of living (Boston area). **I will NEVER be able to afford a house in the town I grew up in.**  \n\n**If I lived closer to the city, I would have to live with Roommates at 30+ years old.**\n\n**Remote work is freedom.** It's the freedom for me to be able to afford to buy a house. It's the freedom to not have my car wear out as quickly, so that it last 15+ years so I don't need another car loan.\n\n**I'd even argue that Remote work is the new American Dream.** Because you sure as hell cannot achieve the stereotypical American Dream (suburbs, house, family) anymore while living close to a job where you have to go into the office everyday.",
    "subreddit": "remotework",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2131,
    "downs": 0,
    "created_utc": 1761097521.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.124945867728622
  },
  {
    "score": 2087,
    "title": "Got laid off today for \"performance issues\" after getting a glowing review.",
    "selftext": "Well, it finally happened. Got the boot today, completely out of the blue. No warning, no PIP, just a sudden meeting and \"we're letting you go.\" The official reason they're giving everyone is that I wasn't performing.\n\nThe crazy part? My manager was literally singing my praises in a team-wide email just last month. My coworkers are floored because I was the person everyone came to for help, and I'd just wrapped up a major project three weeks ahead of schedule.\n\nNow I'm hearing through the grapevine that they're telling people I couldn't keep up. It's just infuriating.\n\nThis at-will employment stuff is such a joke.\n\nEdit: I just want to clarify a few things.\n\n1.  I have never been fired from a job for my performance.\n2.  I was in a bad headspace when I wrote that, so when I said \"this happens all the time,\" I meant that I get screwed over at many workplaces, not necessarily that I get fired without reason all the time.\n\nI'm starting to think that agency/startup jobs are not for me. I'm in my thirties, and I feel like it's hard for anyone to accept me, and I'm anxious about the job market.\n\nBut I definitely won't give up, and I will reformat my resume using the ATS system through a [website](https://resumekit.interviewhammer.com/) I found while searching for how to do it, and I had ChatGPT help me write it.\n\nCan you tell me if there are better suggestions for what I should do?\n\nI've read many [articles](https://www.reddit.com/r/interviewhammer/comments/1max64g/i_just_got_fired/) on Reddit about the frequent layoffs happening lately and how miserable the job market is.\n\nI don't know what the solution is now!",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2087,
    "downs": 0,
    "created_utc": 1757197886.0,
    "media": null,
    "is_video": false,
    "num_comments": 220,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.21942663117278
  },
  {
    "score": 2032,
    "title": "The Real Reason You're Being Forced Into The Office",
    "selftext": "Just remember, the real reason you're being forced into the office is to support the White House Chief of Staff, Jeff Zient's bagel stores in D.C. and the commercial real estate market:\n\nhttps://www.bbc.com/news/world-us-canada-64407273\n\nThey don't care about time with your family.\nThey don't care about your mental health.\nThey don't care about the environment.\nThey don't care about productivity.\nThey don't care about converting offices into affordable housing.\nThey don't care about your commuting time or costs.\nThey don't care that your office is a dump.",
    "subreddit": "remotework",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 2032,
    "downs": 0,
    "created_utc": 1708098642.0,
    "media": null,
    "is_video": false,
    "num_comments": 197,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.146469973768805
  },
  {
    "score": 2002,
    "title": "Former Google CEO Eric Schmidt - evidence is there that remote work increases productivity",
    "selftext": "Huge respect for this guy saying that. He disclosed he has a bias for being in the office but related that for the industries that have been studied, the data suggests that people are slightly more productive when working remotely.\n\nThis is a sextegenarian former CEO of what during his tenure was the undisputed #1 tech company (or if you want to debate this let's say top 5 at least - not the point).\n\nThis is from his talk on Bartlett's pod Diary of a CEO",
    "subreddit": "remotework",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2002,
    "downs": 0,
    "created_utc": 1743543553.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.933256574485398
  },
  {
    "score": 1996,
    "title": "RTO thoughts from HR ",
    "selftext": "I work in HR and wanted to share some thoughts on remote work, RTO policies, and what the future might hold.\n\nFirst off, I know HR often gets blamed for enforcing RTO, but trust me, we don’t want to go back to the office either. The push comes from senior leadership, and unfortunately, it’s our job to implement it. But we dislike it just as much as everyone else, if not more, because we see firsthand how problematic it can be.\n\nDuring the pandemic, when everyone was working from home, leadership frequently reminded us that we’d return to the office once it was safe. However, as the job market shifted in favor of employees, many people started quitting, citing the desire to remain remote during exit interviews. This wasn’t a small number. Entire teams were dismantled, and filling roles took forever because candidates were clear that remote work was non-negotiable. To combat this attrition and attract talent faster, leadership had no choice but to adjust their stance and embrace remote work as a permanent option.\n\nBut by 2024, as the job market turned back in favor of employers, they flipped the script again and announced RTO.\n\nI believe these companies are setting themselves up for a rude awakening when the job market shifts back toward employees. The mass exodus they experienced before, and their struggle to fill positions due to a lack of flexible work options, will leave them with no choice but to adjust their stance again.\n\nIn the long run, I don’t see RTO lasting. Employees have experienced the benefits of remote work, and once the job market shifts again, I expect smart companies will leverage remote work to attract top talent. Meanwhile, those that stick with rigid RTO policies may find themselves falling behind.",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1996,
    "downs": 0,
    "created_utc": 1737001179.0,
    "media": null,
    "is_video": false,
    "num_comments": 233,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.219985993575774
  },
  {
    "score": 1962,
    "title": "\"I got a remote job and I can spend 4 hours a day doing nothing!\"",
    "selftext": "You may have a remote job but you're not doing your job. You're doing half of your job. If you're contracted to work 8+ hours a day and only working for half of that, then you really should be finding something else to do.\n\nIf you are finding ways to not work during your workday, then don't *tell people about it?* If you're posting this on the internet, your boss is going to find out about it and you're going to get in trouble. The only result of these posts bragging that they get to spend all day on social media and watching movies is that those of us who have remote jobs where we do actually have to work get treated like our jobs are fake or our companies start doing RTO mandates to increase productivity. \n\nWhat's your biggest pet peeve in the remote work community?",
    "subreddit": "remotework",
    "upvote_ratio": 0.71,
    "subreddit_type": "public",
    "ups": 1962,
    "downs": 0,
    "created_utc": 1763582915.0,
    "media": null,
    "is_video": false,
    "num_comments": 672,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.239427831711994
  },
  {
    "score": 1940,
    "title": "Office work feels like a complete waste of life compared to remote",
    "selftext": "I worked fully remote for 5 years → super productive, balanced, thriving.\n\nAfter 6 months of unemployment, I had to accept an in-office role out of necessity.\n\n\nMy day looks like this:\n\n🚇 1.5 hour commute (bus + train) just to get to the office.\n\n☕ By 10am, people go for coffee + smoke break + chit-chat → back at desks ~10:45.\n\n🍽️ From 11am–2pm, everyone takes staggered “lunch breaks,” errands, gym sessions, long talks → most are actually back at their desks only by 2:30 or even 3.\n\n👶 Parents leave early for school pickups.\n\n☕ Another “coffee break” around 3:30.\n\n🗣️ By 4–5pm it’s all small talk + preparing to leave.\n\n🚇 Another 1.5 hours travel to home → reach ~7pm, totally drained.\n\n\nThe reality:\n\nBarely any real work gets done.\n\nBoss micromanages as if we’re in school (“Where are you going?” when I step out for the washroom 🤦).\n\nI feel my time, energy, and potential are being wasted.\n\nProductivity is invisible, family time gone, hobbies gone, health slipping.\n\n\nComparison to remote work:\n\nAt home, I could do gym, cook, walk the dog, and still overdeliver at work.\n\nGot promoted, won employee awards, and genuinely enjoyed life.\n\nHad time for hobbies (swimming, tennis, painting) + quality family time.\n\nRemote = fulfillment, balance, and growth.\n\nOffice = exhaustion, disappointment, and no life outside work.\n\n\nI know the job market is tough (still hunting for a remote or at least hybrid role, or something closer). But honestly, this in-office setup feels like a soul-crushing waste of life.\n\nSorry for the rant - just needed to vent. If you’re working remote, cherish it. 🌱",
    "subreddit": "remotework",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1940,
    "downs": 0,
    "created_utc": 1758231575.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.096089553227482
  },
  {
    "score": 1918,
    "title": "If you want RTO because of productivity, then that's the only time you will have it",
    "selftext": "During the pandemic, many companies experienced increased or even record profits while employees worked from home. Yet now, despite those results, there seems to be a renewed push for a return to the office, with productivity being cited as the reason.\n\nIf being in the office is the key to productivity, then we should align our efforts accordingly. This means reserving all work strictly for office hours and locations. There would be no need for company-issued laptops or mobile devices if our productivity is indeed tied to the physical office space. \n\nIf an issue arises after 5 PM, it will have to wait until the next business day. My personal time, whether spent relaxing or tending to personal obligations, is just that—personal. Similarly, weekend emergencies can be addressed when I am back in the office on Monday. Given the belief that working from home diminishes productivity, it is only fair to ensure that my contributions are at their peak (and sober) during office hours.",
    "subreddit": "remotework",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1918,
    "downs": 0,
    "created_utc": 1728382735.0,
    "media": null,
    "is_video": false,
    "num_comments": 214,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.176794204693274
  }
]