[
  {
    "score": 52,
    "title": "I shouldn’t post my website here, you shouldn’t either. ",
    "selftext": "I made a mistake and sent my shop here hoping for feedback, in case if there is something wrong with design. \n\nSure enough, i received tens, if not hundred of messages offering me “services”, how they can do my seo, improve my conv rate, share the mistakes they found bla bla. For some reason most of them are from Nigeria. Idk if its the trend or they are amazing with shopify as a state. I ve been message bombarded in my shopify chat, i block them, same people message from facebook. I block again, they reach out from instagram this time. What did i get into? I can’t get work done for past two days, dealing with these. Not to mention my website analytics are ruined with terrible amount of spammers from countries i have absolutely no business with. \n\nSo, please do yourself a favor, dont post your website here. If you need a feedback, find some decent comments, message to those people in pm for a feedback. \n\nCheers",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1731398240.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.226850858760742
  },
  {
    "score": 29,
    "title": "We have finally launched!!!",
    "selftext": "After dealing with shopify - stripe and many other product related issues we finally got payments and company formation resolved and officially launched!!!\n\nI would LOVE to be roasted by the community thats why im dropping my link. we are not looking good on traffic right now but im hoping things pick up over time\n\ni have done everything from company formation to product photos by myself without getting any help. so ANY opinions would be so useful!\n\nstore link: [https://moltenmajesty.com/](https://moltenmajesty.com/)\n\n",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1762529669.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.062711241711606
  },
  {
    "score": 27,
    "title": "Caution - Do Not Get Services from ANYONE in r/ReviewMyShopify",
    "selftext": "**Warning - scammers abound here**.  This is a group that focuses heavily on those new to ecommerce in general, and thus there are vultures circling.  There are great people here who will help you with advice, but there are others who will try their best to present themselves as 'experts' offering to help you via private message or other form of solicitation.  As the *X-Files* from years back warned us - **\"Trust No One\"**.  Our automod catches many of them, but not all. \n\nReport any such offender to moderators for suspension from the group.  Do not engage with anyone in this group via private message, email, or social media (as you will no doubt be invited to do).  *You will be taken advantage of, and you will lose your money.*  Please, please heed the warning and keep yourself safe.",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1744303080.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.563733656534041
  },
  {
    "score": 28,
    "title": "This sub is fill with scammers ",
    "selftext": "No one cares but I’m just going to give my two cent until it gets deleted. I came to this sub like everyone else trying to improve my site and seek advice frm ppl who may have more success than me instead, got messages from ppl who eventually did scam me others attempting to. I’ve learned it’s a doggy dog world from this sub no one really wants to help they either wanna make fun of your site or try and take advantage of those who have no experience. Don’t want any sympathy just looking out for those trying to improve their sites too. Beware out there. ",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1715640486.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.911368002234975
  },
  {
    "score": 27,
    "title": "Before I start burning cash on ads... tell me why you wouldn't buy from here",
    "selftext": "Hey guys,\nI’m getting ready to scale up my store ([glorytheshop.com](https://glorytheshop.com)), focused on gothic and alternative fashion/accessories.\n\nBefore I turn on the paid traffic hose, I need a reality check. I'm biased, so I need fresh eyes.\n\nIf you landed on this site, what would stop you from checking out?\n\n• Is the vibe \"legit brand\" or \"cheap dropship\"?\n• Is the navigation annoying?\n• Any red flags?\n\nBe brutal, I can take it. Thanks!",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1764626971.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.067339376089341
  },
  {
    "score": 19,
    "title": "No sales on Shopify for 2 months",
    "selftext": "So we are a clothing manufacturer, making stuff for our clients and we recently decided to launch our own brand too via Shopify. \n\nBut the website has close to 0 traffic. The only time we were able to get some traffic was when we subscribed to paid social media ads and that too didn't result in any sales.\n\nCould you please take a look at our website and point  us in the right direction? Budgets tight for now so I'm trying to figure this out myself. Just need your expertise becuase clearly I'm unable to see the problem. Thank you for your time.\n\nWebsite: https://kidokido.pk/",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1762229282.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.829181246047625
  },
  {
    "score": 18,
    "title": "Looking for review please",
    "selftext": "Hello all, I've had my shop going for about a month. 1 sale so far and have been doing weekend advertising across FB, IG and X.... with no sales. I have a feeling that I'm just missing something simple and that is why I'm turning to yall for some help.  I know I'm in a very niche market and the apparel i have is POD but I'm changing that very shortly to Ill be handling all apparel making and shipping. thank you for your time and feedback. -Myke [Get Ducked](http://get-ducked.com)",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1757245745.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.751145399261234
  },
  {
    "score": 17,
    "title": "Last resort before I close my store. Down $1k in ads, need help",
    "selftext": "As the title says, I have had my first ever shopify dropshipping store live for almost a month now and I am down $1k in ad spend. I have made a little over $1k in sales (last sale 3 days ago) and have spent $2k on ads so far. I have been using chatgpt to help me with my ad budgets as I’ve learned over the past month the proper settings for targeting and running ads in general.\n\nTowards the beginning, I was a bit inconsistent and uneducated about running ads so some days I would scale like crazy and go from $70/day to $130/day because I thought it was the right move, or because I thought I had a real winner (I didn’t). That slowly ate up my soend and now I’m just thinking about letting this store go if I don’t get another sale by tomorrow. Most of my purchases have been inconsistent, averaging 1 about every 36 hours. \n\nAny advice on my store would be great since I need to know whether to keep going or kill it. Thank you. \n\nHomepage: groundingrelief.com\nMain landing page: https://groundingrelief.com/products/groundingrelief-bedsheet",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1754594786.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7320067328930993
  },
  {
    "score": 18,
    "title": "Struggling to Drive Traffic to My Shopify Store – Any AI Tools or Suggestions?",
    "selftext": "Hey everyone,  \nI’ve had my Shopify store for about a year now, and honestly, driving traffic has been a huge challenge. I was paying a small agency $60/month to help with traffic, but after seeing little to no results, I just canceled the service.\n\nI’m really hoping to turn things around and was wondering if anyone here has used any AI tools or services that actually help bring in quality traffic? I’ve seen a lot of tools being promoted lately, but it’s hard to tell what’s legit and what’s just hype.\n\nAny advice or recommendations would be super appreciated. Thanks in advance!",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1754535778.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.850479939195923
  },
  {
    "score": 17,
    "title": "Jewelry website",
    "selftext": "Need help with my website. I released it last week and am still tweaking it here and there. Need some outside opinions.\n\nI do know most of the pics are rendered and I have real photos, but I suck at taking them. I plan on sending a dozen pieces to a photographer and having them for my landing page. I also will do a short video for ads thru them. \n\nBasically I'm needing some opinions of overall quality, and just anything out of the normal.\n\nSome pages aren't fully done as I'm working on things a little at a time. All opinions are appreciated. \n\nWebsite: [Pocketrockjewelry.com](http://Pocketrockjewelry.com)",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1758563576.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.757847494263259
  },
  {
    "score": 15,
    "title": "Please review my Shopify site",
    "selftext": "Aloha,\n\nJust launched the website today, pretty much. I really appreciate any feedback. I had a previous Shopify site that never really drew any organic traffic, it was basically just an expensive decoration. I'm determined for this one to actually get real, organic traffic.\n\nAny suggestions for marketing tips to drive email signups and etc for a reasonably expensive product without being too salesy is appreciated. Obviously anything you see that I can improve on I'd appreciate.\n\nThanks!\n\n[www.lylekrannichfeld.com](http://www.lylekrannichfeld.com)",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1759385004.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.581756235207578
  },
  {
    "score": 16,
    "title": "1400 Clicks, 0 Sales – Is My Experience Obsolete? Need Honest Feedback",
    "selftext": "Hi everyone, I’m feeling pretty frustrated and could use some honest opinions. This is my second store: https://pactcase.com, and selling a 7-day pill organizer.\n\nI know the product images could be better, and the site speed isn’t perfect—I’m aware and already working on those. But beyond that, I’ve tried to optimize everything I can think of.\n\nPS: Google Ads and got over 1,400 clicks and 15 cart, but not a single sale. Am I missing something obvious?\n\nAny feedback! If you have a minute, please check out the site and let me know where I’m going wrong. Thanks in advance.",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 16,
    "downs": 0,
    "created_utc": 1755701535.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.744327837219061
  },
  {
    "score": 13,
    "title": "Sold $50k+ need to improve!",
    "selftext": "My website is TwinTee.store if you check it out lmk your thoughts and what I can improve on!  \nTo give you a quick backstory. This is my brand and products I don’t drop ship. \n\nI've had it for about 3 years. I've sold well over 5-figures on shopify alone but would like to increase that number and know it can be done. I've done all of this organically through Instagram and TikTok posts mainly for the last few years while studying full-time and playing college baseball. Now that I graduated I plan on putting more time into this since I hadn't had much time before.\n\nI've dabbled in paid ads but not much at all, probably &lt;$500 all time. Spent ~$150 the last 7 days on meta ads but only saw one sale (coming from the ad) so stopped running them. I feel like this is something that can really give us a boost but will cut our profits down a good bit, which is why I haven't done them. Also just haven't seen results from them. Is it normal to not make sales at first even if your spending $100 in a few days? Just hate the feeling of burning money on ads and them not being profitable! What should I do?",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1750913602.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.581019833986643
  },
  {
    "score": 15,
    "title": "Shit store- but 3.5k sales in a month and a half?",
    "selftext": "www.auroradomus.co\n\nPut my store up for roasting a while back and received a good bit of advice. I’ve been focusing on building my TikTok mainly which has grown to 145k but my store is still a bit shit, although a lot better than before\n\nCould I ask for some specific pointers re how to increase conversions, bearing in mind I don’t particularly want to spend money using paid software for now\n\nI’ve had over 65k sessions from my TikTok organic marketing over the last month and a half and done just $3.5k sales. Pretty shocking tbh\n\nP.S any Nigerian scammers flooding my inbox again will not be responded to, there must have been hundreds last time I posted here",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1713478574.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5392256035117278
  },
  {
    "score": 13,
    "title": "Please be brutally honest — Review my site - Weird Castle",
    "selftext": "I’ve had this idea for a home for weird products so i created a weird castle. A place for products i make (the civil war 1 and civil war 2 veteran hats) alongside dropshipped products. \n\nI tried to make all the copy fun/interesting but i am wondering if I’m getting in my own way by doing that or if the copy isn’t sticking how i want it to. \n\nHere is the link, happy reviewing ya weirdos\n\nwww.weirdcastle.com\n\nRob Dongle\nCEO of Weird",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1754445241.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5122376830451976
  },
  {
    "score": 13,
    "title": "I feel like people don't trust my website",
    "selftext": "The only reason I can think of that I haven't got any orders in the week since I went live is that people don't trust my website. They probably think it's a scam or something? I spent countless hours designing this page myself and I am NOT a trained web designer. I feel like my prices are fair and low compared to the competition. I charge flat rate $4.99 for shipping. And have offered 2 coupon codes which I have announced on social media CAN be stacked. I'm getting a decent amount of views and likes on social media and my website. So, what is wrong?? Tyia for any insight you can offer 🫶🏻\n\n*ETA: I have placed an order myself to test the ordering process as well and it worked fine. \n\nwww.punkysplugz.com ",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1760121046.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7321769646460967
  },
  {
    "score": 13,
    "title": "Looking for honest feedback on our incense brand website (homepage + product page)",
    "selftext": "I’m one of the founders of [Looshi](https://hellolooshi.com/), a small-batch incense brand. We’re in the early stages of growing our direct-to-consumer site, and I’d love to get some outside eyes on it.\n\nSince most of our paid traffic goes directly to the product page, I’d love feedback on *both*:\n\n* **Homepage** ([link](https://hellolooshi.com/)): Does it clearly communicate who we are and what we offer within the first 5–10 seconds? Would you trust this brand?\n* **Product page** ([direct product link](https://hellolooshi.com/products/calm-incense-sticks)): If you landed here from an ad, would you feel compelled to buy? What feels clear or confusing (pricing, benefits, shipping info, photos)?\n\nWe’ve tried to balance brand storytelling with a clean shopping experience, but we know fresh eyes can reveal blind spots. Any candid feedback would be super helpful.\n\nThanks in advance for your time!",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1758817426.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5572376830451975
  },
  {
    "score": 13,
    "title": "Not making any sales.. help!",
    "selftext": "Website: LoreandLumen.com\nIG: Lore.Lumen\n\nHi everyone! I recently launched a fantasy-themed candle business on Shopify. I’ve had a few sales so far, but mostly from friends and family, and I’m hoping to figure out how to grow beyond that.\n\nI’d love your honest feedback on what I could be doing better. My budget is limited, but I’m open to investing in areas that will make the biggest impact. I’ve worked on SEO, but I’m still not showing up in the first few pages for searches like “D&amp;D candles” or similar.\n\nI’ve also run a couple of $10/day ads that brought good visibility but no sales. If you have ideas on how to improve my site, marketing, or targeting so I can turn views into purchases, I’d be so grateful. Let me know what info you need and I’ll share it in the comments.\n\nThanks so much for your time and help!",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1754870936.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.661748654366032
  },
  {
    "score": 13,
    "title": "Review my store please! Am I ready?",
    "selftext": "Hi!  \nFirst time posting here but I have put quite some efforts on improving my sites in the last couple weeks.  \nThe thing is I tried place some meta ads last month but the result was not that good (basically with traffic but conversion was not good), now that I have worked on the site more and am thinking to give Ads another try.  \nI don't have a lot of products yet and think that might be another problem.  \nAppreciate any feedback!  \nHere's the site: [formhydro.com](http://formhydro.com) ",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1754433940.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.512598040014257
  },
  {
    "score": 14,
    "title": "Be brutal",
    "selftext": "Been doing this for 2 years now. Ads never work. It feels like I’m just buying followers on IG when we run an ad. \n\nAffiliate marketing working well though.\n\nLaunching a free shipping sale fore the full weekend tomorrow morning and probably going to boost the post. \n\nhttps://cornydogcloth.com\n\nEDIT: we market mainly on IG. You can check that out as well @cornydogcloth\n\nAlso, these products are def handmade lol. We see the bandanas ourselves and use heat transfer vinyl for the prints on the front. We do buy the fabric in bulk however.\n\nThank you all so much for the feedback! ",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1751604605.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.606955177064478
  },
  {
    "score": 13,
    "title": "Review my new Online Vanilla Store!",
    "selftext": "New on this but I want to get your feedback on my store!\nI’m selling vanilla beans, for now I only have 2 types but we want to add more as I learn more and see the store grow.\nI am not dropshipping, all the stock is shipped from the facility in Indonesia to our 3PL in the US which is why we still want to be careful what we stock there. \n\nI am open to all feedback and I know there is still a lot to improve on the store.\n\nhttps://maison-vanilla.com\n\nThank you all!",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1735813570.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.3476730291742096
  },
  {
    "score": 14,
    "title": "Please review my shop",
    "selftext": "I have an established business on other platforms and through in person sales. I decided to set up my own shop a while ago (very quickly) but I’ve only recently started to put some time into improving SEO and navigation. \n\nHonestly, I don’t really know what I’m doing, so I thought some constructive criticism might help me decide where to focus my efforts. \n\nAny help/advice would be greatly appreciated.\n\nLink is [here](https://www.greenbeeinteriors.co.uk)",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1721598019.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.3582125137753436
  },
  {
    "score": 12,
    "title": "Submitting a Shopify site for roast. Thank you for your time and expertise.",
    "selftext": "we’ve been working on this site for a couple of months but I have found a matter how long we were on a site internally review my Shopify always comes up with more fixes.\n\nI come here myself a few times a month and review Sites as well I appreciate everybody who contributes.\n\nas a marketer this is a very valuable Reddit.\n\nOne of the reason reasons I come here so I’m not very good at proofreading or UXUI. Once things pointed out I am pretty good at fixing them. \n\nhttps://www.sunnysomewhereny.com\n\n\n",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1759937861.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5782003222457806
  },
  {
    "score": 12,
    "title": "Please take a look, and tell me why I'm not getting any conversions.",
    "selftext": "I launched my store 3 weeks ago, and have been using Google ads at first to drive traffic.  I've had a decent 2-3% click rate, bringing just over 1k visitors to the store, but only had one single item sale, for a 0.001% conversion rate.  \n\nI know I'm an amateur, this is the first website I've ever built, and I'm designing the products myself with no experience, but I figured with 55% of the USA as my target customer, I'd make a few more sales than this!  \n\nMy products are political in nature, so if they offend your particular political beliefs, skip the review if you can't be objective, I already know why you won't like my site.  \n\nYou can find it at https://ProtestSource.com\n\nThank you for any and all constructive ideas on how I can improve.",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1759874698.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.475003979666668
  },
  {
    "score": 11,
    "title": "Looking for Feedback on My Shop's Website – 15K+ Sales on Etsy, 0 on My Own Site",
    "selftext": "Hi everyone,  \nI run a well-established Etsy shop with over 15,000 orders and strong customer reviews. Recently, I launched my own website on Shopify to move away from Etsy: [https://crafts3d.com/](https://crafts3d.com/)\n\nI'm getting a decent amount of traffic from various sources, but surprisingly, no sales so far. I even tested a purchase myself to make sure the checkout works – and it does.\n\nNow I’m starting to wonder if the issue is with the website’s design, user experience, or overall appearance. I’d really appreciate any feedback or suggestions on what might be going wrong.",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1749513611.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.4575451640564214
  },
  {
    "score": 12,
    "title": "Some Reflections",
    "selftext": "Here are some lessons I’ve learned and experienced on my Shopify journey so far:\n\n- Rome wasn’t built in a day: Don’t expect overnight results. Are there people who setup a shop and get sales the same or next-day? Yes, but that is the exception not the rule.\n\n- Ad spend does not = sales: You can lead a horse to water, but you can’t make them drink. Just because you spent X amount of money on ads and got however many impressions/views doesn’t mean that people are going to buy from you.\n\n- Explore and complete every aspect of the Shopify platform before you even think about adding apps or external services. You’d be amazed at how much you can accomplish simply by exploring and filling-out every part of the base Shopify options.\n\n- The Shopify Knowledge Base and Support Articles are informative and useful. Ditto for the forums and searching on Google.\n\n- The settings section of the online store editor is powerful. You can take even a free template very far by simply maximizing all of the available options in the settings section of the online store editor. Dive deep!\n\n- Design is important, prioritize Mobile devices. The majority of traffic is from smartphones. Desktop and tablet may look better for your design, but they don’t produce as much traffic. This is important, keep mobile users front of mind.\n\n- You have to actually TRY with your designs. There are countless posts on here asking for theme reviews, etc., but it would be a better use of your time to work on deeply customizing your theme before asking for any feedback. If you were a random person looking for something on the internet, does your website pass the eye test? Does it look trustworthy and professional? Please, even if you are just using a free theme, put in the work to make it as special as you can.\n\n- Words (and spelling) Matter. Your product descriptions are probably the most important part of your store aside from the product images themselves. Use the clearest, most informative language possible to help search engines and people find exactly what you are selling. Keep an eye out for typos and grammatical errors. Explain how you are solving specific pain points and why your product is the right one for them. People will be less-likely to balk at price if you solve their specific problem.\n\n- Sales Channels matter just as much as your store design. Customers won’t always make it to your store directly. Being present on various sales channels allows you to meet them where they are. Establish your presence where you can.\n\n- Branding Matters! Define a memorable logo and color palette for your brand and keep it consistent across your store, social media, e-mails, and ads. When people see your logo, they should know what to expect, and have positive thoughts/feelings about your business.\n\n- Social media is important, but focus on one platform at a time. I burnt myself out trying to post to every platform. I learned to focus on one, but make sure you own your name on each. The same can be said for ads. Master one platform before trying to appear on others.\n\n- There are pros and cons to both single-product stores and multi-product stores. You have to figure out what is best and most appropriate for the product or niche that you are focused on. Don’t allow anyone to convince you that one is better than the other. Think for yourself and decide what is best for WHAT YOU are doing.\n\n- Write down your ideas, and make a plan! Things are easier to accomplish when you have clear and actionable steps to follow. Don’t assume that you will remember anything ever. Especially when it comes to your processes, write them down so that you can review and refine them.\n\n- Especially if you are using drop-shipping as your fulfillment method, you have to consider that there are probably many other people also selling the same products online. The work that you put into your product pages is your bread and butter. Don’t be lazy about your text or images. Cut out any clutter that doesn’t serve you.\n\nThere’s more that I can’t think of right now, but hopefully this list is a solid starting point for you to reflect on as you work on your store. Feel free to add anything you learned as well. Good luck!",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1710275571.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.3154883458028084
  },
  {
    "score": 13,
    "title": "Help Please",
    "selftext": "Hi guys, this is my first post in here as I've been struggling to get any sales, on average I will have about 20/40 views a day with no paid ads. When I do pay for ads it will go to 100-150 views a day.\n\nHowever with or without paid advertising I will not convert a single product.\nPlease could someone maybe check the website see if there's something I could change? Or would it be the products have listed?\n\nAny help or criticism is appreciated\n\n[Website](https://playfulpetcompany.co.uk)",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1709166757.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.567339376089341
  },
  {
    "score": 11,
    "title": "Please review my store &amp; provide areas of improvement",
    "selftext": "Hi everyone, \n\nI'd like to request that you take a look at my site:  [https://southernroutetrading.com](https://southernroutetrading.com) \n\nI'm looking for objective feedback and actionable inputs. I've been working on it for the past month or so and when you spend that much time 'in the weeds' with something it can be easy to miss the forest. \n\nA few improvements already on my list:\n\n* Standardize background of all product photos\n* Obtain 'lifestyle' photos for remaining products\n* Procure broader product mix\n\nThank you, I look forward to your input!",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1758928446.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.431241237375587
  },
  {
    "score": 10,
    "title": "Looking for Feedback on My Store - First Month in, $1.5K Down in Ads",
    "selftext": "Hey everyone,\n\nI’m looking for feedback, critiques, and even compliments on my store to help me figure out how to increase conversions. This is my first ever store, and it’s been live for about a month now.\n\nSo far, I’ve spent spent around 3.5k on ads and generated about $2.5K in sales. I'm still operating at a loss, and I want to understand if the issue lies with my store itself or the ads I’m running.\n\nI've put time and money into curating this website and professional photos. Now I want to dial things in and figure out what needs improvement, whether it's the site experience, product pages, messaging, or just my marketing strategy.\n\n\\---\n\nEDIT 1 8/3: Thanks so much to everyone who took the time to share feedback. I really appreciate it. I’ve learned a ton from this thread, including what’s working and what needs improvement. There’s definitely a lot I’ll be implementing based on all the insights shared. I’m going to stop replying here for now since I’ve got more than enough actionable feedback to work through. Time to get back to work\n\nEDIT 2 8/4: I'm removing the link to my page. Too many people sending email DMs in the contact page. I suspect all bots are scraping this page ",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1754188336.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.385649655097169
  },
  {
    "score": 10,
    "title": "Hey It's Me Again! Zivra Supplements.",
    "selftext": "You guys provided some great feedback last time, and I've revamped the site and changed a lot based on the suggestions. Wondering if you guys could help me again and make sure everything looks good before I jump into marketing hard. Any advice / feedback is greatly appreciated!\n\nProduct Page (Landing): [https://zivrasupplements.com/products/the-core-zivra](https://zivrasupplements.com/products/the-core-zivra)\n\nHomepage: [https://zivrasupplements.com/](https://zivrasupplements.com/)\n\nThanks, Chad!",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1752024231.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.359028937709878
  },
  {
    "score": 10,
    "title": "4,000 sessions. 15 orders. What the f*ck are we doing wrong?",
    "selftext": "# We run a premium activewear brand called [VertexActive](http://vertexactive.com) \n\nBeen live a few months now. \n\n# We’re doing everything we think we should be doing:\n\n* Spending **$145/day on Meta ads**\n* Spending **$120/day on TikTok ads**\n* **3,800+ sessions in 90 days**\n* **15 total orders**\n* **AOV: $134.80**\n* **Conversion rate: 0.34%**\n* Returning customer rate: 27% (somehow decent)\n* Bestsellers are clear: leggings and shorts\n* TikTok: $0 in sales so far\n* Facebook: around $700 in sales\n\nWe’re getting traffic. We’ve got high production photos. Solid branding. Premium vibe. But we’re *stuck*. People aren’t buying, and we have no idea why.\n\n# We’re not looking for sugarcoating, we want brutal honesty:\n\n* What’s broken?\n* What would you fix first?\n* Any tips for ad-to-landing page alignment?\n* Would love feedback on the site if you're willing.\n\nAnything that helps us stop bleeding money and start scaling.  \nIf you’re a growth marketer, strategist, or just someone who’s been through this, we’d love to hear what stands out to you. Are we missing something obvious? How would you fix this?\n\nThanks in advance",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1749537722.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6026471415113432
  },
  {
    "score": 10,
    "title": "Roast Our Shopify Store (We Desperately Need Some Honest to God Feedback)",
    "selftext": "Hey everyone! We launched our brand on Shopify this month &amp; we've spent around €1500 in paid ads (Meta Ads &amp; Google Ads, mainly optimizing for conversions, using clear data flows and advanced audience signals), brought in almost 6500 sessions, but we only got 23 cart additions so far, and no sales. We operate in the EU, mainly in France. We have the site in English &amp; French and we carefully translated it ourselves. We do not know what to do anymore as we've implemented every fix &amp; improvement since our launch at the 8th of May, and we think it may be because we're looking at this from a perspective too close. We need someone to see the bigger picture. Here are some metrics to help:\n\n* Average Daily Traffic: 353 sessions according to Shopify, 242 in GA4\n* Bounce Rate: 45.34% in GA4\n* Conversion Rate: 0%\n* Abandoned Cart Value: €1245.49 in total, €54.15 on average\n* % New Visitors: Since we just launched, 100%. But out of those users, 152 of them returned. But they may be our friends :(\n\nWe use Shopify collabs &amp; we have 5 influencers working with us in different EU countries. They've added our links to their linktrees, but no conversions yet. I've carefully reviewed our ads &amp; added as many relevant assets as possible, we've tested a lot of stuff. But today, our ads stopped running because our swift transfer isn't reaching our bank account at Finom &amp; we've been in contact with their support team about it for a few days. Our site is [theconsciouscart.co](http://theconsciouscart.co) .\n\n**TW - Mental Health:** Honestly, I haven't felt this defeated in a while. I'm a Marketing Analytics Consultant myself, so I've tried my best to apply my expertise. Having no sales so far and continuously running into financing issues has started to take a rough toll on my health. Everything that could go wrong, actually did go wrong. I've spent hours chatting with support teams from every tool &amp; service provider we use, except for Canva, which works REFRESHINGLY without any issues or bugs. I've worked 18+ hour days in the past few weeks when it came down to it, I am literally obsessed with making this work, but I'm starting to doubt my skills.",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1748302386.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5975895650697094
  },
  {
    "score": 11,
    "title": "[Design] Sales completely dropped after website redesign - Need some honest feedback",
    "selftext": "**TLDR;** Website sales have fallen off a cliff after a redesign, and I can't figure out why.\n\n\nHi everyone, I recently reworked the entire look and feel of my website and sales have stopped coming in completely. The website is [https://nuvocollection.com/](https://nuvocollection.com/) \n\nI have started running ads to this updated version of my website but sales aren't happening - not even a single one. \n\nMy ads are performing well, except they just aren’t converting. (Objective: Conversions; CTR: over 6%; CPM: $7; CPC: $0.12) (Meta Ads)\n\n**Is there perhaps some glaring mistake that I am failing to see on my website?**\n\nI would really appreciate any feedback whatsoever on any part of the website. Please feel free to be as honest and candid as you wish!\n\n\n**Here is some additional context:**\n\n1. I successfully sell on Etsy - the products and the prices are the same on Etsy.\n2. I have ran ads to my website before and they have generated sales successfully, despite the website being \"worse\" before the redesign.",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1747041909.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.4444057067367617
  },
  {
    "score": 11,
    "title": "Help ! \"difficulty to make sales\"",
    "selftext": "\"I launched my business almost a month ago, and so far, there's been nothing. I tried SEO and all the free marketing methods, created an Instagram and even a TikTok page. The stats aren't great, but I kept posting. However, at one point, I gave up completely, stopped everything, and fell into depression. I'm not doing anything anymore, just staying in my room. You might say that one month is nothing, but it's not my first business, and I've lost a lot. So, I don't have any money to pay for marketing.\"\n\nSo what can i do please ?  im dowwnnnn",
    "subreddit": "reviewmyshopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1694708138.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6247135495608744
  }
]