[
  {
    "score": 200,
    "title": "Would you fly abroad for a $950 full-body health checkup? (vs $10k+ in the US)? Roast away.",
    "selftext": "Hey Reddit,\n\nI’m working on a new concept: sending Americans abroad for **comprehensive health check-ups** at a fraction of U.S. prices.\n\nWhat you get: MRI, CT, ultrasound, ECG, echo, stress test, DEXA scan, full blood panels, neuro exam, eye + hearing checks, basically the whole “executive health” package. Price is about **$950 USD**.\n\nFor comparison, the same package at **Mayo Clinic or Cleveland Clinic costs $10k+**. Abroad, it’s literally the same quality (JCI-accredited hospitals, many doctors trained in the U.S./Europe).\n\nIt’s direct-to-consumer, not through employers, and it’s also **HSA/FSA eligible** \\- including flights and hotels if you want to turn it into a wellness trip.\n\nWho it’s for: Health-conscious professionals who want peace of mind without dropping five figures, or anyone who likes the idea of bundling a check-up with a vacation.\n\nStage: Just launched pilot runs. Already had a few patients fly out for check-ups. Right now I’m testing if there’s real demand.\n\nWhy me: I'm obsessed with health, ran a travel agency, and have traveled abroad for medical care myself a lot in the past! This is kind of a mashup of those worlds.\n\n**Link:** [globalizedhealth.co](https://www.globalizedhealth.co)\n\nBrutal feedback welcome, would you ever consider flying abroad for a check-up? Or is this totally delusional?",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 200,
    "downs": 0,
    "created_utc": 1759371686.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Conceptual business idea with market/context and request for feedback rather than a procedural guide.",
    "composite_score": 4.13475835659772
  },
  {
    "score": 96,
    "title": "Built an app to understand my girlfriend's hormonal phases, stopped 80% of our arguments",
    "selftext": "I kept seeing couples fight over \"why are you being distant?\" and \"why are you being annoying?\"\n\nMost men don't realize cycle phases affect mood, energy, and needs.\n\nSo I built Intimigo with the guidence of my partner, an app that informs about cycle phases and tells partners:\n\n* When to plan date nights vs when to give space\n* What she might prefer today (connection vs quiet time)\n* Daily insights to match your approach\n\nIntimigo is made for couples and designed for men specifically. 2 months testing with couples, zero arguments about timing since.\n\nLooking for more beta testers and feedback. Anyone else building in the relationship/health space?\n\nYou can check it for free here: [App Store](https://apps.apple.com/us/app/intimigo-relationship-app/id6752911868)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1765219623.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Central claim about a hormonal-cycle insight and its application in an app, with examples; not a step-by-step.",
    "composite_score": 3.606802365962095
  },
  {
    "score": 44,
    "title": "I built an AI flirting coach that helps you flirt better over text. Yes, it works. Yes, we're probably doomed. Roast us.",
    "selftext": "It's called ChatVisor and it's an AI web tool that helps people write better texts in dating, social, and networking situations. Ok, but mostly for romantic interactions... Paste in your message (or screenshot what someone else said), upload their social profile, and it'll score your text, improve it, and give you options that are warmer, funnier, or more intriguing.\n\nBut here's where we went one step further: We also built a flirting simulator. Upload chat history and their profile info, and you can practice conversations with an AI version of them before the real deal. Think training wheels for your dating game.\n\nThink:\n\n* You matched with someone cute, but your brain goes blank when messaging  \n* You want to say something clever but don't want to sound like ChatGPT\n* You're staring at \"hey\" wondering if that's enough (it's not)\n\nMassive market, obviously... and yes I know about the app RIZZ but the actual suggestions don't sound real. ChatGPT itself is technically a competitor (but too generic). Online dating is a $12B+ industry. Messaging apps? Even bigger. And now everyone's using AI, but most tools are for resumes or cold emails and not real-time social finesse.\n\nWe're targeting people who are good at life but awkward at texting (so… a lot of people). We're leaning into tone, warmth, social nuance, and building a \\*taste set\\* of examples. Think: AI, but trained on people who actually know how to flirt and connect.\n\nWe just launched publicly. First real users coming in. Bootstrapped for now with a tiny but scrappy team surviving on instant ramen and the collective hope that other people are as socially awkward as we are.\n\n🔥 Go-to-Market Strategy: \n\n* Posting on Reddit and praying the algorithm gods smile upon us \n* Word of mouth (aka begging friends to try it and not judge us) \n* Targeting communities where people openly admit to practicing conversations with their houseplants \n* Free trials because we're desperate for validation... I mean, user feedback\n\nWe're calling it ChatVisor because it sounds professional, but honestly we just wanted something that didn't scream \"creepy AI dating helper\" in the URL bar. \n\nTry it if you dare: [this link](https://www.chatvisor.ai/tools/flirty-text-messages)\n\nAnd if you end up married because our AI taught you how to properly use emojis in a flirty context, we're definitely putting that testimonial on our landing page. \n\nSo go ahead, r/roastmystartup \\- tell us why this is either the future of dating or the beginning of the end for human connection. \n\nWe can take it. We think. \n\nMaybe we should practice our comeback responses with our own AI first...",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1756487525.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Product concept with features and strategic context; primarily explanation of the idea rather than a replication steps.",
    "composite_score": 2.900272505103306
  },
  {
    "score": 40,
    "title": "Excel crashes at 1M rows. I’m building a local viewer for 100M rows. Roast my idea.",
    "selftext": "Hi everyone,\n\nI’m working on a tool called [CsvTitan](https://csvtitan.com). I’m trying to figure out if this is a viable micro-SaaS or just a fun engineering project that will make $0.\n\n**The Problem:** Excel has a hard limit of 1,048,576 rows. If you work in finance/logs and have a 5GB CSV, Excel crashes or truncates data.\n\n**The Current Solutions (and why I think they suck):**\n\n* **Python/Pandas:** Requires coding skills. Great for devs, bad for analysts.\n* **Notepad++:** Fast, but viewing data as raw text is painful. You can't sort by column.\n* **SaaS (Gigasheet):** Requires uploading data to the cloud. A huge \"No\" for banking/compliance/legal.\n\n**My Solution:** A local-first **Desktop App** (Windows/Mac) built with **Rust (Tauri + Polars)**.\n\n* It memory-maps the file so it opens 50GB files instantly (no RAM spikes).\n* It feels like Excel (grid view), but handles 100M+ rows.\n* You filter/sort locally, then export the slice you need back to `.xlsx`.\n\n**The Business Model:**\n\n* One-time license ($49).\n* Targeting: Financial Analysts, Forensic Accountants, Data Engineers.\n\n**The Roast Requests:**\n\n1. **The Landing Page:** [https://csvtitan.com](https://csvtitan.com) \\- Is the copy too generic? Does it scream \"scam\"?\n2. **The Market:** Is the \"I can't code but I have big data\" market actually big enough? Or will these people just learn Python?\n3. **The Tech:** Am I crazy for building a desktop app in 2025 instead of a Web App?\n\n",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1763741610.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Problem/solution description and business model for a micro-SaaS; mainly concept/explanation with roast requests.",
    "composite_score": 3.1996907829115937
  },
  {
    "score": 35,
    "title": "Communities - Ad-free social app focused on offline communities - looking for real feedback",
    "selftext": "**Hi roasters,**\n\nI've been working on something called [Communities](https://www.communities.site/roadmap) \\- it's my attempt at creating a different kind of social media platform. I'm hoping to get some honest feedback from you all to see if this idea has any merit.\n\nThe basic concept is location-based social networking that focuses on local communities rather than individual profiles or endless feeds designed to serve ads. The idea came from wanting to encourage real-world connections - you'd open the app to see what's happening in your area (events, discussions, local spots) and hopefully get inspired to actually go out and experience it.\n\nI know this might sound naive, but I'm trying to build something that's driven by users rather than advertisers. Instead of keeping people glued to screens, the goal would be to help them connect with their local community and get offline.\n\nWe're still in very early stages (pre-alpha), and honestly, I'm not sure if this concept will resonate with people. That's why I'm reaching out - I really need some genuine feedback to understand if this is worth pursuing.\n\nI'd be incredibly grateful for any thoughts, even if you think this is a terrible idea! I'm particularly looking for feedback on the user experience, any bugs or errors you encounter, feature suggestions, or really anything else you think would be important for me as a developer to know about the platform. Even small details about what felt confusing or what worked well would be super helpful.\n\nThanks for taking the time to read this - any feedback at all would mean a lot!\n\nIf anyone's interested in following along or sharing more detailed feedback, you can join a small Discord community at [https://discord.gg/KBRfvr6FBc](https://discord.gg/KBRfvr6FBc)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1758813344.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Early-stage app concept with feedback request; emphasis on concept and user experience rather than steps.",
    "composite_score": 2.9306793012437016
  },
  {
    "score": 27,
    "title": "i keep building apps, hoping one will change my life… but now i’m just tired",
    "selftext": "some days i wake up feeling like this is gonna be the one. the app. the startup. the thing that changes my life.\n\ni’ll grind for hours, build the MVP, launch something small…\n\nand then the excitement fades. imposter syndrome kicks in. i start second guessing everything.\n\n\n\nis this actually useful?\n\nwhy would anyone care?\n\ndid i just waste a month building something nobody asked for?\n\n\n\ni’m not giving up, i love building. but damn, this journey is lonely sometimes.\n\nno playbook. no guarantee. just me and a bunch of half-finished projects and too many late nights.\n\n\n\nwhat stage are you in right now?\n\nbuilding? quitting? launching? stuck?\n\n\n\ni’m genuinely curious how other people are feeling right now.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1752414074.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Emotional reflection about the startup journey with imposter syndrome and doubt; venting without actionable guidance.",
    "composite_score": 2.868357030291697
  },
  {
    "score": 26,
    "title": "Roast lenso.ai - AI Reverse image search and face recognition",
    "selftext": "# [Lenso.ai](http://Lenso.ai) is a platform that allows users to search people, places, duplicates and objects by image.\n\n**How is it different than all the other reverse image search websites?**\n\n* **Categories**: results are spread into categories: places, people, duplicates, related and similar; I know it doesn't sound like much, but it helps a lot when you try to find something specific in an image.\n* **Face recognition**: we put a lot of focus into making the face recognition work well\n* **Accuracy**: while our index is not as huge as in some other, similar platforms, we put a lot of work into our alghoritm and you can probably tell by how close the matches get. And the index is growing all the time, we hope to get better and better!\n* **Similar images, not only exact copies:** something that many engines do is finding only copies. We do that and way more.\n* **User-friendly design:** A big chunk of competition is not user-friendly at all. We are making a design that will lead more users to [lenso.ai](http://lenso.ai)\n* **Place recognition:** Lenso is very accurate with recognising buildings and landscapes, unlike most search engines.\n* **Search with text or URL:** we allow users to define URL of website they want to look at or add text so the search is more accurate (upload blue mug, add text \"red\", red mugs appear).\n\n**Use cases:** Finding the source of images, finding original versions of edited pictures, finding images in higher resolutions, finding your face online, looking up objects and people, checking for copyright infringement, online shopping, finding places from image\n\n**Who would want it?** We believe it would be useful for photographers (for copyright), public people (to find who posts them and where), general audiences (most people want to find their face online or used google lens to find objects/books/movies).\n\n**The market** is projected to reach US$13.72bn in 2024 and still growing. Our biggest competitors are Google, Yandex, Bing, but also some smaller sites, like Pimeyes, Copyseeker etc. Some are huge companies, but we believe in the next stages of growth Lenso will be just as good if not better.\n\n**We find customers by** posting on different forums, databases for AI tools, recommending to people on groups related to reverse image search, writing articles. We also post on social media and plan to post on youtube soon.\n\n**We are in the stage** where the product is already posted and usable, but we are still developing additional features, such as: email notifications on new results, exporting results to CSV and more. We are not looking to raise money to develop, but we are planning to earn from the project in the future.\n\n**Why us?** Our team has years of experience in reverse image search and face recognition from working in other projects. There are a few developers working on the project, all experienced and skilled.\n\nWe appreciate your feedback :)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1719470748.0,
    "media": null,
    "is_video": false,
    "num_comments": 114,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Product description and feature-driven pitch for Lenso.ai with use cases and market context.",
    "composite_score": 3.1892126843357933
  },
  {
    "score": 19,
    "title": "Roast my startup: XNote - Because apparently, the world needed yet another way to take notes",
    "selftext": "Hey roastmystartup fam, I've created a revolutionary product that will change the world... or at least that's what I tell myself at 3 AM when I'm wondering why I didn't just get a normal job.\n\nHere's **XNote** for your roasting pleasure:\n\n**The Product:** XNote is a smart writing set that digitizes your handwritten notes and lets you chat with them using AI. Because typing was just too mainstream, and talking to yourself wasn't weird enough.\n\n**Use case:** For people who love the feel of pen and paper but also want to pretend they're living in the future.\n\n**The Market:** Size: Potentially huge. Everyone from students to professionals takes notes, right? (Please say yes, I've bet my life savings on this)\n\n**Competition:** Oh, just every note-taking app ever, plus good old pen and paper. But hey, we're special... I think.\n\n**Product Analysis:** We're like if a Moleskine notebook and Siri had a baby. More expensive than a regular notebook, less useful than your phone, but hey, it looks cool!\n\n**Stage:** We launched on Kickstarter in November 2023, and 1,104 backers thought, \"Yeah, I'll throw money at that.\" They pledged $259,394, probably while sleep-deprived.\n\nNot content with just one crowdfunding rodeo, we hit up Indiegogo in February 2024 for another $100k. That's $360k in our first year, which sounds impressive until you realize we have no idea how to replicate that success in the real world.\n\nNow we're transitioning to e-commerce, facing the terrifying reality that we actually need to market this thing. Turns out, \"If you build it, they will come\" only works in Kevin Costner movies.\n\n**Customer Conversion Strategy:** \n\n* Step 1: Find people who think $200 is a reasonable price for a notebook. \n* Step 2: Convince them that talking to their notes is normal. \n* Step 3: Panic because we don't know how to create content that doesn't involve begging for crowdfunding money. \n* Step 4: Profit! (Still working on this part)\n\n**Why Me:** I'm one of three young, passionate entrepreneurs who thought, \"Hey, let's make a tech startup! How hard could it be?\" Turns out, very. We've done almost everything ourselves, with some help from freelancers who probably wonder if we're paying them in monopoly money.\n\nWe're now expanding the team, because apparently, three sleep-deprived founders and a rotating cast of freelancers isn't a sustainable business model. Who knew?\n\nAlright, do your worst. Don't hold back - my therapist says I need to build resilience anyway. Plus, I need to be prepared for my upcoming investor meetings, where I'll try to convince more people to fund my dream of talking notebooks.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1722545919.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Comprehensive product pitch with market, competition, and crowdfunding history; explains concept and trajectory.",
    "composite_score": 2.847636252551653
  },
  {
    "score": 20,
    "title": "Roast my startup: Make money by proving people wrong",
    "selftext": "Hey there\n\n  \nI built [https://www.credos.ai](https://www.credos.ai) which is a platform that lets people put bounties on their arguments and ideas. Once you create your bounty, an AI agent trained on logical deduction and reasoning takes your argument and debates other people on your behalf. If someone makes a logical argument that the AI doesn't have a response to, it declares itself defeated and pays out to the bounty to the person.\n\n  \nIf you've been on the internet long enough you've seen the number of people who really believe the most insane stuff. I built this tool as a way to let people put their money where their mouth is!",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1718382238.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Platform description and mechanism for debates/bounties; primarily explanation of idea and potential impact.",
    "composite_score": 2.733328942100879
  },
  {
    "score": 20,
    "title": "Roast my startup: RealFeedback.co",
    "selftext": "Hi,  \nI have created an [AI-based feedback chatbot](https://realfeedback.co) based on my own needs and have received many positive responses from people who claimed they would like to use this product.  \nI also tried Google Search ads and the CTR was extremely high, so I believe there is a market for this type of product.  \nHowever, the conversion rate is pretty low. I am now running LinkedIn ads but the results are even lower - 117 clicks and 0 signups.  \nCould you provide me with some feedback on what may be wrong with my landing page that is leading to the low conversion rate? I would appreciate any suggestions you have to improve it.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 20,
    "downs": 0,
    "created_utc": 1692202209.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Request for feedback on a landing page and product concept; seeks improvement ideas rather than steps.",
    "composite_score": 2.5118405494535816
  },
  {
    "score": 18,
    "title": "I built a “last message” SaaS. Roast me.",
    "selftext": "During the 2025 Bangkok earthquake I was sprinting down a swaying skyscraper thinking: “If I die, my family has no idea what I wanted to tell them (or how to get into anything). Afterwards I went looking for a simple, secure way to:\n\n* Send last messages if I don’t make it\n* Hand over passwords / files to the right people …\n* and found a mix of boomer-level estate tools and sketchy dead-man-switch sites.\n\nSo I teamed up with a senior software architect and built **LastNotes**: [https://lastnotes.io](https://lastnotes.io/)\n\n**Product (WTF is it?)**  \nSecure “digital last words” + password/asset handover.\n\n* You write notes, upload files, send last good byes\n* We release them to your chosen people if you don’t check in\n* But we double check with a trusted contact before we ship them.\n\n**Market (Who would care?)**\n\n* Seniors, parents, solo founders, digital nomads, etc\n* Basically: people who plan ahead but hate lawyers or feel too young to deal with the proper legal will but want a quick and safe solution.\n* Competitors: Google Inactive Account Manager, dead-man-switch tools, password managers (1Password, etc.)\n\n**Stage**\n\n* Live beta\n* 10\\~100 signups\n* Bootstrapped, not raising (and not planning too)\n\n**Customer Acquisition**\n\n* Content + fear of death\n* Performance marketing\n* Reddit, HN, “digital legacy” / security podcasts, preppers, estate-planning blogs\n\n**Why me?**\n\n* I’ve had the “I might die” moment.\n* My cofounder and I have: 7 years building secure apps for parents.\n\nPlease roast the idea, positioning, and landing page.  \nWhat screams “dumb”, “already done”, or “no one will pay for this”?",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1765373836.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Roast request but content mainly describes a startup concept and asks for critique rather than a how-to guide.",
    "composite_score": 2.8007876231279667
  },
  {
    "score": 17,
    "title": "I built RateMyHOA so you don't buy into a nightmare HOA",
    "selftext": "Link: [https://ratemyhoa.app/](https://ratemyhoa.app/)\n\nHOAs can be absolute garbage. Hidden fees, power-tripping boards, surprise assessments. But you usually don't find out until after you've already bought the house.\n\nRateMyHOA lets you check before you're stuck\n\n* Real reviews from people actually living there\n* Public records and fees in one search\n* No digging through terrible county websites\n\nI've seen other sites try this, and most died. Maybe it's just not a useful enough service. Thinking about pivoting to build actual transparent HOA management software instead.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1760815058.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Explicit bullet list of features/services constitutes a 3-item list.",
    "composite_score": 2.7335119636244336
  },
  {
    "score": 16,
    "title": "I saw vendors selling basic map prints for $60 and thought \"I can build a free tool that does this better.\" Roast my side project.",
    "selftext": "Hi everyone,\n\nI’ve been working on **Carto-Art**, a web app that turns real map data into print-ready poster art.\n\n[Artistic high-res poster of the Nova Scotia region](https://preview.redd.it/k4mjk9v2g6bg1.jpg?width=5400&amp;format=pjpg&amp;auto=webp&amp;s=33b1e19259c503fafd84e2fe2907315d3d33c970)\n\n[3D perspective view of the New York skyline from within the editor](https://preview.redd.it/ha045cc3g6bg1.png?width=3838&amp;format=png&amp;auto=webp&amp;s=f13a1b334ec250737bf6ec29d8590ca7db238868)\n\n[Kennedy Space Center, with pad labels](https://preview.redd.it/csw1jon4g6bg1.jpg?width=3600&amp;format=pjpg&amp;auto=webp&amp;s=cc44d170e5aa9e45d18acec5bd69a8c918ff2d43)\n\n\n\nThe Context:\n\nThe idea came from seeing vendors (and heavy ads) selling simple, black-and-white city map prints. I thought, \"I could make something way more customizable than this.\" So I built a tool that lets users generate their own for free.\n\nThe Product:\n\nIt’s a purely client-side web app (Next.js/MapLibre) that lets you frame any location on earth and export it as a high-res PNG.\n\n* **Link:** [https://cartoart.net](https://cartoart.net)\n* **Resolution:** Unlike most tools that just take a screenshot, this renders true print resolution (up to 24×36\" at 300 DPI).\n* **Styles:** Minimal line art, Dark/Noir, Blueprint, Vintage, etc.\n\nThe Feature I Over-Engineered (The Terrain):\n\nI spent way too much time on the terrain feature. It uses GPU-accelerated hillshading with Terrain-RGB tiles that encode elevation at 0.1m precision.\n\n* The shading automatically adapts to the color palette (e.g., navy shadows for dark themes, warm browns for vintage).\n* I think it looks cool, but does the average user even notice the difference between this and a flat map?\n\nWhy I'm posting here:\n\nI’m a dev, not a marketer. I built this because I wanted it to exist, but now I'm trying to figure out if it has legs beyond just being a cool tech demo.\n\n**Roast away:**\n\n1. **UX:** Is the customization overwhelming? There are a lot of toggles (roads, water, buildings, parks, etc.).\n2. **Value:** Since I'm giving the 300 DPI file away for free (no signup), is there any actual business here, or did I just burn weekends for internet points lol?\n3. **Features:** I'm thinking of adding video export automation next for video editors. Is that worth the effort, or should I focus on something else?\n\nThanks for the feedback.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 16,
    "downs": 0,
    "created_utc": 1767464812.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Detailed product explanation and design choices with reasoning, not a step-by-step guide.",
    "composite_score": 2.6163128393870703
  },
  {
    "score": 17,
    "title": "I built an AI that helps you flirt better over text/DM. Yes, it actually works. Yes, I know that’s terrifying. Roast away.",
    "selftext": "It’s called [Composed](https://getcomposed.io)  and is an AI web app that helps people write better texts in dating, social, and networking situations. Ok, but mostly for romantic leaning interactions...Paste in your message (or screenshot what someone else said), and it’ll score it, improve it, and give you options that are warmer, funnier, or more intriguing.\n\nThink:\n\n* You matched with someone cute, but your brain goes blank as you are messaging\n* You want to say something clever but don’t want to sound like ChatGPT\n* You're staring at “hey” and wondering if that’s enough (it’s not)\n\n  \nMassive market, obviously...and yes I know about the app RIZZ but the actual suggestions are not real sounding. and don't learn the user as it goes (at least not while typing this) Online dating is a $12B+ industry. Messaging apps? Even bigger. And now everyone’s using AI, but most tools are for resumes or cold emails and not real-time social finesse. We’re targeting people who are good at life but awkward at texting (so… a lot of people).\n\n  \nYou’ve also got tools like Grammarly or Quillbot for grammar. ChatGPT itself is technically a competitor (but too generic). We’re leaning into tone, warmth, social nuance, and building a *taste set* of examples. Think: AI, but trained on people who actually know how to flirt and connect.\n\n  \nWe just soft launched publicly. First real users coming in. Not raising yet and bootstrapped for now. Team is tine but scrappy.\n\n**🛒 Customer Conversion Strategy**\n\n* Reddit, Twitter/X, and community word of mouth\n* Personal invites to early users from our other company ([Jaunty,](https://www.jaunty.org/) which is a real-life social skills training platform)\n* We’re offering free guidance if users send us screenshots. Hand-holding FTW.\n* Oh and the landing page has a “Test Your Skill” game. You vs the AI. It’s fun. Try it. I dare you.\n\n  \nI’ve been teaching real-life social skills for 10+ years (Jaunty.org), helping thousands of people overcome awkwardness and get confident socially. Now I want to scale that into tech.\n\nGo ahead. Tear me to shreds. Am I solving a problem, or just helping people lie better in their DMs? The end goal is that is does learn your real voice.  \nIs this the best idea since sliced bread or another “AI for X” startup trying to ride the hype?\n\nAnd if you try it and get a date, I’m taking credit ;)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1746475093.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.73,
    "category_rationale": "Product description and market framing with insights; not a procedural post.",
    "composite_score": 2.794378761990978
  },
  {
    "score": 15,
    "title": "I spent 2 months building a reCAPTCHA killer. Hacker News buried it. Is the product bad or just my marketing?",
    "selftext": "Hi guys,\n\nI'm a solo dev. I built **IronWall** (ironwall-protocol.xyz) because I hate how Google tracks users with reCAPTCHA.\n\nIt uses Client-Side Proof of Work (Argon2) to stop bots. It's 3KB, privacy-first, and works.\n\nI launched today and got zero traction. I'm starting to doubt if devs actually care about privacy or if they just default to Google because it's easy.\n\n**The Tech:**\n\n* Backend: Node/Redis/Postgres\n* Frontend: React\n* Security: Dynamic difficulty scaling based on IP reputation.\n\nPlease roast the landing page or the idea. I can take it.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1766055312.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Technical product overview and launch context with rationale rather than a how-to sequence.",
    "composite_score": 2.7605119110157927
  },
  {
    "score": 14,
    "title": "Roast my startup Tani.ai — A tool to help non-tech people understand what their dev team is actually doing",
    "selftext": "Hey everyone,\n\nIt is Emin from Turkiye. I’m here for the roast and the real talk. I’ve been building a product I *think* solves a real problem — but I might just be drinking my own Kool-Aid. \n\n**What is Tani.ai:**\n\n[https://tani.ai](https://tani.ai)\n\nA daily reporting tool that “translates” developer progress (commits, tasks, changes) into plain English updates for non-technical stakeholders.\n\n**Use case:**  \nProduct managers, non-tech founders, and clients often feel out of the loop when working with developers. They don’t understand Git, tickets, or tech jargon, and developers don’t have time (or patience) to write clear updates every day.\n\nThis tool auto-generates daily summaries so they can stay in the loop *without bugging the dev team*. Think of it as a “dev-to-human translator.”\n\n**Target users:**\n\n* Non-technical startup founders who outsource development\n* Product managers juggling multiple devs or agencies\n* Agencies needing to give clients visibility without writing manual reports\n\n**Size &amp; dynamics:**  \n  \nThe outsourcing market is huge. A good chunk of it consists of non-tech founders who spend $$$ on freelancers and hope for the best. There's constant anxiety about \"what’s actually getting done.\"\n\n**Closest competitors:**\n\n* **Linear / Jira + Slack integrations** — but they’re too noisy or too technical\n* **Manual reports** — unreliable, inconsistent, takes time\n* **Status Hero / DailyBot** — more about team check-ins, not built for external stakeholders\n\nI’m trying to build something **simple, zero-effort, and focused purely on communicating progress to outsiders**.\n\nI’ve built the MVP and have a few users testing it out. Still pre-revenue. No funding raised yet, but I’m self-funded and not in a rush to raise unless there's real traction.\n\n**Current strategy:**\n\n* Targeting PMs and founders on Reddit, Twitter, Indie Hackers\n* Cold outreach to software agencies\n* Planning to build integrations with Jira, GitHub, Trello to get visibility via plugins\n\nFree plan for 1 project, hoping to convert to paid when people manage multiple projects or clients.\n\n👨‍🔧 **Why Me?**\n\nI’ve been in the dev trenches for 14+ years — freelance, agency, startup CTO. I’ve seen too many clients feel clueless, overwhelmed, or misled. Some even paid me *just* to double-check what their devs did.\n\nThis tool is born from that pain — I’ve lived it. So I built the thing I wish clients had before coming to me.\n\n**TL;DR:**  \nIt’s a daily “what-the-devs-did-today” report for non-technical folks. Meant to bridge the understanding gap and reduce the \"WTF is going on with our product\" stress.\n\nLet me know — is this idea worth pushing, or is it another SaaS nobody asked for?  \nTear it apart, tell me what sucks, and I’ll owe you one.\n\n(PS: If you want to test it and give deeper feedback, I’ll hook you up with a premium account too.)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1743894227.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.77,
    "category_rationale": "Product concept and strategy explained; still focused on understanding rather than steps.",
    "composite_score": 2.483151250383644
  },
  {
    "score": 14,
    "title": "Roast my startup - DashPoint",
    "selftext": "What we're building\nWe're trying to build the BeReal for runners you'll get notified 3 hours before the run starts which reveals the location. You have to turn up on time and to lock in your DashPoints and then finish the run to add them to your account.\n\nComparison Against Competition\nWe're trying to fill a niche where we feel there is room for a new app, we want to mix strava and BeReal so we have the spontaneity with health and fitness factor.\n\nWhat Stage Are You In?\nPre-launch MVP we're waiting for app store approval currently.\n\nCustomer Conversion Strategy\nWe're getting users in our local area, we've put up stickers on lamp posts, stickers on gym equipment and posters around the local university campus. The app currently is only trying to get users in our area so we can build a real community at this opening stage.\n\nWhy Me?\nMe and my co-founder are both driven to not have to work for someone else, we've tried multiple ventures with few successes, we both feel as though this is something we're passionate about and with enough time and effort sunk in we can build something real.\n\nWhat Do I Need From You?\n\nWe're looking for feedback on our core idea, as we don't have an app for you to try yet, tell how dumb our idea is, how would you do it better? Would you ever use something like this? Why? Why not?\n\nThanks in advance guys!\n\n(We do have a website but not much to look at just yet DashPoint.uk)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1735756209.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Idea overview with feedback request; mainly explanatory about the product.",
    "composite_score": 2.3411402790628095
  },
  {
    "score": 15,
    "title": "From Mom's Design Questions to 5k Users\n",
    "selftext": "I never planned to build an AI startup. I was just tired of my mom bombarding me with WhatsApp messages about her living room redesign.\n\n\"How would this couch look here?\" *sends 20th Pinterest screenshot of the day* \"What if we painted the walls blue?\" *sends more screenshots*\n\nAs an engineer with a full-time job, I thought I could solve this with a \"simple\" AI tool. Classic engineer's overconfidence.\n\nThe Reality Check:\n\n* Burned through $15k of wedding savings\n* Hired a developer who disappeared after taking a $5k advance\n* Worked 9-5 at my day job, 7-3am\n* Wife started calling my laptop \"the mistress\"\n* Learned that \"simple AI tool\" is an oxymoron\n\nBut something interesting happened. My mom started sharing it with her friends. They shared it with their kids. Those kids shared it with their friends.\n\nToday's Numbers:\n\n* 5,000+ active users\n* 15,000+ room designs generated\n* 70% user retention\n* $0 spent on marketing\n* 1 very proud mom\n\nKey Learnings:\n\n1. Don't believe Twitter threads about \"building an AI startup in a weekend\"\n2. Start with WhatsApp integration - turns out parents are your best beta testers\n3. Focus on one thing and do it well (we only do interior design visualization)\n4. Mental health &gt; Growth metrics\n\nTech Stack:\n\n* Frontend: React/Next.js\n* Backend: Node.js\n* AI: Custom fine-tuned Stable Diffusion\n* Mom's Feedback: Priceless\n\nWhat's Working:\n\n* Simple WhatsApp interface (send photo → get design variations)\n* No complex prompts needed\n* Fast response time (under 2 minutes)\n* Free tier for basic features\n\nWhat's Next:\n\n* Launching premium features\n* Improving AI accuracy\n* Building mobile app\n* Getting more sleep (hopefully)\n\nLooking for:\n\n* Feedback from Reddit\n* Potential collaborators\n* Tips on scaling AI infrastructure\n* Stories from others who built products for their parents\n\nP.S. Mom still sends me Pinterest screenshots, but now she also sends design from my site=). Progress?",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1735574728.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.9,
    "category_rationale": "Narrative with learnings and metrics, teaching insights from the experience.",
    "composite_score": 2.6152296300228843
  },
  {
    "score": 12,
    "title": "Roast my startup : I Killed SaaS Subscriptions, and Apparently, That’s a Crime",
    "selftext": "**Product:**  \nI built [**Mangoform.app**](http://Mangoform.app), a Typeform alternative, but without **the SaaS tax.**\n\n* **$15, lifetime access** (no subscriptions, no hidden fees)\n* A clean, interactive form builder **without a $600/year price tag**\n* Target audience: **solopreneurs, startups, agencies, anyone who needs forms without recurring fees**\n\n**Market &amp; Competition:**\n\n* Typeform, Jotform, Tally, and Google Forms\n* Market: **$11B+ form software market** (because apparently, people love overpaying to collect answers)\n* Competing **on simplicity and price** (because let’s be real, 90% of users don’t need half the “pro” features in these tools)\n\n**Product Comparison:**\n\n* **Google Forms?** Free, but looks like it came from 2005.\n* **Typeform?** $600/year if you actually want useful features.\n* **Tally?** Freemium, but I prefer a **Typeform-like experience.**\n* **MangoForm?** **One-time payment. No BS.**\n\n**Stage:**\n\n* **Launched, getting first customers.**\n* No fundraising, just trying to see if **not charging rent for forms is an actual business.**\n\n**Customer Conversion Strategy:**\n\n* **Reddit, Twitter, Product Hunt, LinkedIn** → Talking about how SaaS pricing has gone too far.\n* **Subscription fatigue is real.** People are tired of paying monthly for basic tools.\n\n**Why Me?**\n\n* **Student, building side projects for fun.**\n* Not looking to squeeze MRR out of people, just wanted to see if a **no-subscription SaaS could work.**\n* Also, because I hate paying $600/year for forms.\n\nWhy is this **a terrible idea?** Why will it **never work?** Or, you know, why do people actually seem to be buying it?\n\nOh, and for the haters: **ROASTME20** gets you **20% off ($12 instead of $15).** Enjoy.\n\n👉 [**mangoform.app**](http://mangoform.app)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1740417196.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.76,
    "category_rationale": "Product pitch with pricing and competition analysis; explanation rather than steps.",
    "composite_score": 2.4244583501388273
  },
  {
    "score": 14,
    "title": "Just launched a transactional email service, let 'er rip!",
    "selftext": "Product: [AhaSend](https://ahasend.com/?utm_source=social&amp;utm_medium=reddit&amp;utm_campaign=roastmystartup)\n\nI've been running a project management startup since 2014 that sends loads of transactional emails (notifications, reports, etc), and about 3 or 4 years ago, the cost of sending emails got to a point where it started making sense to do it myself. I built the infrastructure for sending a few million emails a month, and since then, I've launched 2 other startups and used the same system for sending emails.\n\nGiven all the work I've done on this over the years, almost exactly 3 months I decided to to do a bit more to add a user-facing dashboard and Stripe integration and launch it as a separate product, and AhaSend was born.\n\nThe product is ready for use, there might be a few bugs here and there in the dashboard, but the backend is robust and is already sending millions of emails per month for my other startups and a couple of friends who have started using it.\n\n# The Product\n\nAhaSend is a Pay-as-You-Go Transactional Email Provider.\n\nOne of my frustrations with most other Email Service Providers (ESPs) has always been their bracket pricing: Sending 250k emails a month and happily paying $160 a month, you see a bit of growth and need to send 255k emails next month? Nope, sorry, you'll need to jump to the next bracket which allows sending 400k emails per month and costs $250.\n\nWith AhaSend, the first 1,000 emails are always free, then you pay $5/month to send up to 10,000 emails per month, and then you pay $0.0005 per email (that's $0.5 per 1,000 emails) for any additional emails you send. No brackets and no hidden fees: you pay exactly for what you send.\n\nFocusing on transactional emails has let AhaSend optimize for delivery speed instead of the throughput needed for sending millions of marketing emails in a short period of time (e.g. sending millions of emails in 2 hours to deliver a marketing campaign).\n\nAlmost all other ESPs send both transactional and marketing emails, usually using the same IP address for multiple users, or at best using dedicated IP addresses for large customers (but still lumping the marketing and transactional emails together). This means that inbox providers (like GMail, Yahoo, Outlook and others), see a huge jump in incoming email from those IPs when a campaign is sent, and then the incoming volume goes down and remains steady for a while until the next campaign. These inbox providers look at the sending patterns (like these large jumps in incoming emails from IPs), the content of the emails and and other indicators to decide whether an IP is being used for sending marketing emails - and marketing emails have low priority for delivery to the inbox. This means that your transactional Account Confirmation emails that need to get to the inbox in 5 seconds or you'll start losing customers gets bundled up with all those marketing emails and their delivery gets delayed - sometimes taking minutes to arrive in the inbox. \n\nAhaSend has been consistently delivering transactional emails to GMail in 1 to 2 seconds, to Yahoo in 2.5 to 4 seconds, and to Outlook in 4 to 6 seconds. The best case for delivery time with our competitors is double to triple of ours, but usually much higher than that (in the 20-30 seconds range), and if you're unlucky and they're sending a marketing campaign using the IP assigned to your account at the same time as you're sending a transactional email, there's no saying how much it might take for the email to get delivered to the inbox.\n\n# The Market and Competition\n\nEmail is boring. It's been with us since 1971, has been commercially available since the early 80's, and became widespread in the 90's. It has a established market and it's not going away.\n\nSending emails has a very large market size: pretty much every online business and some (if not most) offline businesses needs to send transactional emails for things like account confirmation, OTPs, password reset links, security alerts, 2FA emails, order confirmations, and a hundred other things. \n\n[Numbers](https://www.linkedin.com/pulse/email-marketing-market-analysis-review-2023-2030-105/): The email industry market size was about $9.2 billion in 2022, expected to grow to $26.7 billion by 2028, so there's a lot of room to grow: a lot of new customers and players are joining the market.\n\nThere are of course many competitors in this space. What differentiates AhaSend is its pricing model and focus on transactional emails (see above).\n\n# Customer Acquisition Strategy\n\nGiven the amount of competition in this space, I don't think I can get organic traffic from the search engines anytime soon and Google Ads is out of the picture at least at the beginning (too expensive for keywords related to email).\n\nTo get things rolling, I'm going through my own network of startup founders (I took my first startup to an accelerator about 11 years ago, and I've been mentoring a few founders here and there) and partnering with accelerators/incubators to offer discounts for their startups (again, I have a good network in this area). \n\nAfter that, I'm planning to run affiliate programs with development agencies, and when the revenue allows start experimenting with running ads on Google.\n\n# Why me?\n\nI've been running startups for the past 11 years, and before that I had a software development agency, so I have a bit of experience launching products and running businesses.\n\nI've been sending emails for my other businesses for a few years and know the technology and challenges (of course there will be new challenges that I don't know of yet when scaling to 100 million and 1 billion emails per month, but I'm confident I can handle any technical challenge that comes my way).\n\nAnd, I have a good network of people (founders, accelerators, etc) who can either be the initial customers or help me kickstart the business and get initial traction.\n\n&amp;#x200B;",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1709309236.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Product launch description and pricing model; informative explanation of service.",
    "composite_score": 2.403212513775344
  },
  {
    "score": 12,
    "title": "Analyze websites using AI, collect leads for your business",
    "selftext": "1. **Website**: [https://choicechaser.com/](https://choicechaser.com/)\n2. **Idea:** Automate finding leads on websites using AI\n3. **Speech**: There may be plenty of your potential customers throughout the web asking questions and recommendations, but how to find them? ChoiceChaser is here to help! It continuously checks FB groups, Reddit, X (ex twitter), local forums to find the posts of your potential customers. No more time spent manually checking websites! Join now :grin: \n\n&amp;#x200B;\n\nI would appreciate any feedback and happy to answer any question you have",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1699884673.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Promotes an AI-driven lead-generation idea with a conceptual explanation and asks for feedback rather than a step-by-step guide or a simple list.",
    "composite_score": 2.2254883458028085
  },
  {
    "score": 11,
    "title": "Please don't hold back.",
    "selftext": "Building **Leapility** \\- a workflow automation platform for people who are tired of their complex processes being stuck in static documents.\n\n[https://www.leapility.com/](https://www.leapility.com/)\n\n**What we're solving:**\n\n**1. From Documentation to Execution** \n\nYour Standard Operating Procedures SOPs) shouldn't just be passive documents. Leapility turns them into the automation itself. Write your process in plain English, and that document becomes an AI agent that runs the work for you. Stop documenting, start automating.\n\n**2. Natural Language Logic No More Nodes)**\n\nVisual builders create a \"spaghetti monster\" with complex logic. Leapility replaces the confusing nodes and wires with plain English. You can write conditional logic and nuanced instructions naturally, just like writing a sentence. If you can write it, you can automate it.\n\n**3. Productize Your Expertise**\n\nDomain experts have valuable processes but no easy way to scale them. Leapility lets you turn your unique know-how into a robust AI agent that can act as an internal, automated workforce or be monetized as a service.\n\n**Example use cases:**\n\n**1. Operations Manager:** Your \"New Hire Onboarding\" agent creates accounts, sends welcome emails, and schedules meetings - all from your written SOP.\n\n**2. Marketing Consultant:** Your \"Client Report\" agent pulls data, drafts a performance summary, and flags anomalies for your review automatically.\n\n**3. Solo Founder:** Your \"Lead Qualification\" agent enriches new sign-ups, scores them against your Ideal Customer Profile, and adds the best leads to your CRM.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1767258022.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Explains the product's core concepts and rationale behind Leapility with supporting reasoning.",
    "composite_score": 2.165756871239447
  },
  {
    "score": 13,
    "title": "Added API support 2 days before my competitor (Firebase) dies. Business genius right here.",
    "selftext": "Alright, let's do this.\n\nWhen Google announced Firebase Dynamic Links was shutting down on August 25th, I panicked like everyone else. Looked at alternatives - Branch wants $500+/month, the rest are marketing platforms with 47 features nobody uses.\n\nSo I built LimeLink. It literally just does deep linking. That's it.\n\n**What it does:**\nLinks that open in apps (innovative, right?), sends to store if no app (revolutionary technology), deferred deep linking so users land where they intended after install (wow), REST API I just added last week (5 days before Firebase dies lmao), custom subdomains like yourservice.limelink.org (fancy!)\n\n**What it doesn't do:**\nNo AI-powered anything, no blockchain integration, no \"proprietary attribution algorithm\", no 73-page analytics dashboard, no mobile app to manage your links, basically nothing sexy that VCs would love.\n\n**My brilliant strategy:**\nLaunch without API support which is the ONE thing developers need. Add critical features literally days before the competitor shuts down. Compete with billion-dollar companies by doing 10% of what they do. Document my failures on Medium thinking that'll somehow help.\n\nThe logo is generic. The landing page is boring. The name \"LimeLink\" sounds like a citrus disease. I spent weeks perfecting deferred deep linking that maybe 3 people will use.\n\nBest part? People asked for API support MONTHS ago. Just shipped it now. Time management skills: 10/10.\n\nGo ahead, tell me why this is going to fail spectacularly. I'm ready.\n\nP.S. - If you're still on Firebase, you have 2 days. You're worse at planning than me, congrats.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1755944317.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Describes the product strategy and what the tool does/doesn't do with narrative reasoning.",
    "composite_score": 2.1652036608700596
  },
  {
    "score": 11,
    "title": "I’m a doctor who had eczema for 27 years. Built this to fix it — roast us.",
    "selftext": "Living with acne, eczema, psoriasis, or topical steroid withdrawal sucks. It's so confusing to know your triggers, what products to use and when you're going to flare next. I'm a physician, and couldn't figure it out for 27 years. \n\n**Our Product**\n\nWe built Symphony: an AI coach that helps you figure out what’s triggering your flares and how to calm them down. It learns from science *and* what’s working for other patients.\n\n*Specific Features:* \n\n* **24/7 chat**, built with memory and context, that actually helps\n* **Skincare advice** based on your symptoms (not skin type guesses)\n* **Mental health tools**, like guided CBT for stress-induced flares\n* **Nutrition planning** to catch trigger foods\n\n**Proof Points:**\n\n**I reversed my eczema** using this approach, over 2,000 people have used Symphony, and our early data shows a 34% reduction in symptoms.\n\n**Our Ask**\n\nWe’re still testing—so I’d *love your feedback*. Roast the assessment + suggestions, tell us what sucks and how we can improve :) \n\nTry it here: [https://www.proton-health.com/](https://www.proton-health.com/)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1752762078.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Outlines product features and proof points, framed as a product pitch with request for feedback.",
    "composite_score": 2.1457262395435963
  },
  {
    "score": 13,
    "title": "Roast Me: I made an app so my friends would finally pay me back. (They still haven't)",
    "selftext": "So basically I spent the last 7 months building [Tabelo](http://www.tabelo.app), an app that makes splitting the bill as frictionless (and not awkward) as possible.\n\n**Here is how it works:**\n\nYou scan your receipt, text friends an invite link, and they split the bill however they want (select individual items, pay for part of an item, pay for a percentage of the bill, pretend you never got the invite) The choice is yours!  \n\n\n**Why I built it:**\n\n* Nobody wants to download a whole app during dinner just to split a check (sorry splitwise)\n* If you cover the bill yourself, you usually also end up covering tax, tip, and that one friends 4th beer\n* Sending venmo requests the next morning after a night out has got to be top 10 worst hangover activities\n\nThe \"bill-splitting app\" space is saturated but somehow nobody has nailed this experience outside of POS systems like Sunday (which is great if you've never heard of it). I wanted to make something anyone could use anywhere.\n\n\n\n**Where I'm at:**\n\n[Tabelo](http://www.tabelo.app) just soft launched an open beta on October 31st, 2025. We have gotten \\~25 new users so far (mostly friends, family, and some wonderful people from reddit). The webapp is completely free to use and I am hoping to start hearing some feedback after the coming weekend. \n\n\n\n**Future Plans:**\n\n* Create a native app for people who do want to have the app on their phone\n* Add direct P2P payments in the app (Apple Pay, Stripe) with a small platform fee on the payer side\n* Potentially add some premium features down the line, but the core scan and split functionality should and will always be free\n\nGo ahead, Tear me to shreds.\n\nAm I solving a problem or did I just create an app my friends will ignore while just venmo-ing me wrong anyway?\n\n",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1762548600.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Describes the app, its workflow, and rationale behind building it, inviting roast feedback.",
    "composite_score": 2.5016430335102284
  },
  {
    "score": 11,
    "title": "I made an app to split bills with roommates and or friends.",
    "selftext": "I made an app to replace my spreadsheet when figuring out monthly bills with roommates and quickly send them how much they owe with ways to pay me so I can pay the bills. \nhttps://sharedbills.app \n\nI also made a silly little adventure-like game\nhttps://realm.sharedbills.app\n\nDo your worst. It's so useless. Splitwise probably does it better. (But then again I'm about a week old while they've got years on me)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1759431958.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Describes an app concept and open call for critique rather than a how-to guide.",
    "composite_score": 2.560380244997103
  },
  {
    "score": 12,
    "title": "I made an app called Girl Math that makes saving money fun. Roast it.",
    "selftext": "Quick video demo: [https://youtube.com/shorts/qFQ74EwSNc4?feature=share](https://youtube.com/shorts/qFQ74EwSNc4?feature=share)\n\nApp store link: [https://apps.apple.com/us/app/girl-math-savings-tracker/id6751606640](https://apps.apple.com/us/app/girl-math-savings-tracker/id6751606640)\n\nGirl Math started as a weekend project when I realized my girlfriend was terrible at saving money but amazing at justifying purchases with elaborate mental gymnastics.\n\nThen I thought: what if that same creative energy actually helped you save?\n\nThe app turns \"I didn't spend\" moments into visible progress toward things you really want. Set goals, log tiny wins in seconds (skipped a latte, walked instead of Uber), and watch a satisfying progress bar fill up with haptics, confetti, and a playful receipt at 100%.\n\nUnder the fun, it's a habit loop: immediate dopamine for the right behavior, one active goal for focus, and daily micro-wins that build real momentum. No spreadsheets, no guilt trips. Just making your small choices feel like they add up to something bigger.\n\nRuns entirely on-device with no accounts or tracking. Just you, your goals, and your wins.\n\nI'd love your feedback. Roast it!",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1758665482.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Promotional post detailing a saved-money app and roast request, focusing on product description.",
    "composite_score": 2.4058201527832512
  },
  {
    "score": 11,
    "title": "Roast Me: I built a private journaling app for people who feel too emotionally drained to talk to anyone.",
    "selftext": "Okay, I’ll take the hit. Been working on this solo for a few months because my own life took a nosedive and I wanted something that felt like a pocket-sized space to just *feel*, without being told to “journal daily,” “talk to a therapist,” or “do a guided meditation.”\n\n# The Product\n\nThis is a mobile-friendly journaling + mood reflection app with a soft AI companion.  \nIt’s for people who aren’t ready for therapy, don’t want pushy self-help, and just need a private place to sit with what they’re feeling.\n\nWhat it does:\n\n* Lets you journal freely (no prompts, streaks, or social stuff)\n* Tracks your mood over time gently\n* Lets you pin reminders or calming notes\n* Includes an AI listener that reflects thoughtfully (but doesn't pretend to be your therapist)\n* **Privacy-first:** We don’t store or view *any* of your personal content—just the auth metadata\n\n# The Market:\n\nMental wellness apps are a $4B+ market globally and growing, but most of them focus on coaching, CBT, or therapy prep.  \nPeople like me (and friends I spoke with) just want something *quiet*—no pressure to heal, fix, or optimize. Just space. That gap felt real.\n\n# Competitors:\n\nDaylio, Moodnotes, Wysa, and Reflectly.  \nBut they:\n\n* Either gamify mental health (ugh, streaks)\n* Or they funnel you toward coaching or therapists\n\nSaillo focuses on being the in-between. Not a substitute for therapy, but a place that respects where you're *at*, not where you \"should\" be going.\n\n# Stage:\n\n* Launched MVP (web app) 2 days ago.\n* 10 users onboarded\n* Feedback includes: “feels safe,” “non-judgmental,” and “my daily sanctuary” (their words, not mine)\n* No revenue yet. Side project for now\n* Not raising, but roasting might save me $2k in bad design decisions\n\n# Why Me?\n\nI’ve lived this gap. Worked in backend engineering, moved countries on a student visa, burned out, and realized that during breakdowns, I didn’t want therapy. I just wanted space.  \nNo trust fund. Just time and stubbornness.\n\n# Link?\n\nOnly if you roast me first. I earned this L.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1746034289.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Promotional post describing journaling app features and privacy stance, seeking feedback.",
    "composite_score": 2.3272268755754655
  },
  {
    "score": 10,
    "title": "I Built a Simple Tool and Learned These Lessons Along the Way",
    "selftext": "A few months ago, I decided to build an email finder tool from scratch. It's called Laiskas, and it focuses on making it easy to find and verify professional emails using just a name, surname, and company website. Nothing revolutionary, but it solved a need I saw in sales and recruiting workflows. \n\nHere's what I learned during the process - some of it the hard way.\n\n  \n**Start with the core problem.** People need tools that do one thing reliably, like pulling accurate emails without extra steps or complications.\n\n**Price for real users.** If competitors are charging a lot, going lower can help, but you have to prove the value isn't cut-rate too.\n\n**Give people a way to test it.** Early access or limited trials show what works and build confidence without pressure.\n\n**Marketing takes time.** You can't just launch and wait—consistent sharing in relevant communities is key, even if it's slow at first.\n\n**Gather input right away.** Reaching out to early users for thoughts helps spot fixes before they become big issues.\n\n**Check interest before going all in.** A basic landing page can reveal if anyone cares, saving time on features nobody wants.\n\n**Support scaling needs.** Things like bulk processing turn one-time users into regulars if done right.  \nPrioritize compliance. Features like data privacy rules matter more than you think, especially for certain markets.\n\n**Test it yourself constantly.** Using your own creation daily uncovers bugs and ideas you wouldn't see otherwise.\n\n**Persistence matters most.** A lot of projects fade because effort drops after launch, but steady work makes the difference.\n\n  \nBuilding this was a mix of frustration and small wins. If you're working on something similar, I'd love to hear your experiences in the comments. What lessons have you picked up from your projects?",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1752693425.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Shares lessons learned from building a tool with actionable tips and guidance.",
    "composite_score": 1.7913926851582251
  },
  {
    "score": 10,
    "title": "Built an AI profit checker for thrift flippers. Roast it before I waste more time.",
    "selftext": "I built [underpriced.app](http://underpriced.app) \\- you snap a photo of anything at a thrift store, garage sale, or screenshot a Facebook Marketplace listing and get instant market value + profit potential + flip strategy.\n\n* It comes with in-built inventory management system + Chrome extension to analyze listing on FBMP / eBay on the fly.\n\nWhile it's primarily an AI Wrapper (with lots of thought put behind prompts), it also uses database of listed/sold items to give better analysis as a reseller app and thrift store price checker app.\n\n**How it's going:**\n\n* Launched \\~3 weeks ago with zero marketing budget\n* Currently at \\~70 free users + 4 paying ones, getting mild traction on Reddit by being genuine instead of spammy\n* Competing against ThriftAI ($8/week), Snap2Value, and literally Google Lens (which is free and backed by a trillion-dollar company)\n\n**Why I think it might not be completely stupid:**\n\n* Competitors are either too expensive or have limited features or inconsistent, incomplete analyses. Most don't answer \"is this worth buying\" or \"how much can I sell this for\" comprehensively.\n* Resellers are notoriously cheap, I believe my plans are reasonably priced + in-built inventory management adds value as a complete side hustle app. The profit calculator for resellers and reseller profit margin calculator features are built-in, unlike competitors. + Free Tier may be enough for very casual flippers doing thrift flips.\n* The \"take a photo, get instant value\" flow actually works smoothly as a flipping app and retail arbitrage scanner app + chrome extension makes things easier for checking \"what is this worth\" and working as an eBay price checker, Mercari price checker, and Facebook Marketplace listing analyzer without leaving the page.\n* It solves the real problem of how to know if something is worth flipping quickly - answers \"is this a good deal to flip\" in 30 seconds instead of 5+ minutes of manual research.\n* Works as reseller tools for both online sourcing (deal finder app functionality) and in-person sourcing (thrift store app that identifies goodwill finds worth money instantly).\n* The thrift haul profit calculator and comparable sales finder features help users understand actual profitability, not just asking prices.\n* Helps users learn what to flip from thrift stores and the best items to resell from garage sales based on real data.\n* Functions as an AI price checker for resellers with app to check eBay prices built-in, plus works as Poshmark seller tools and a vintage value checker app across multiple platforms.\n\n**Why it's probably doomed:**\n\n* The people who need this most (casual thrifters) won't even know it exists unless I spend a fortune on marketing to position it as one of the best apps for resellers\n* Power users will just keep using their existing workflow (Google Lens + eBay sold listings) even though my reselling app saves them time\n* Google Lens will only get better with time and it's free\n* Hard to justify as a price checker app when free alternatives exist, even if mine provides how much profit can I make flipping calculations they don't\n\nSo... roast me. Am I solving a problem that doesn't exist? Am I in a race to the bottom against Google or competition with more marketing budget? Is there actually demand for a dedicated retail arbitrage tool that helps people make money flipping?\n\nWould genuinely love to hear why this will fail before I spend 3 month on features nobody asked for.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1766451418.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Describes an AI profit checker, its features and market reasoning, asking for roast/feedback.",
    "composite_score": 2.2610139398778877
  },
  {
    "score": 10,
    "title": "I built “Superbook.ai” so you can talk to your books. Curious if this makes sense to anyone but me.",
    "selftext": "# 1. What the product is\n\nSuperbook is a mobile app where you can talk to the books you're reading, have read before or want to read.\n\nAsk questions like how it applies to your life and goals, get chapter summaries and insights to remember more of what you've read, and more features coming.\n\nIt started because I was constantly asking ChatGPT follow-up questions about the books I read, but I’d lose all context and highlights. So I built a place where the “conversation with the book” actually lives.  \n\n\n# 2. Who it’s for\n\nPeople who read non-fiction for practical reasons.\n\nFounders, students, self-improvement readers, anyone who highlights a ton and remembers almost none of it.\n\nBasically: people who read to *apply* the ideas, not just finish the book.  \n\n\n# 3. The market\n\nHuge, but crowded in the wrong ways. Blinkist/Shortform summarize books. Readwise stores highlights. AI tools spit out generic one-liners.\n\nBut there’s no tool focused on “treat the book as a mentor and ask it anything”.\n\nMaybe that’s a wedge, maybe it’s nothing.  \n\n\n# 4. Product vs competition\n\nSuperbook is more interactive. Instead of dumping summaries on you, you ask questions and the app adapts the insights to your goals or problems. The idea is that over time it will understand you and what you're looking for, and adapt the whole book to your life and make it actionable.\n\nWeak spots:\n\n– Early, rough around the edges\n\n– AI hallucination risk, does not work for all books\n\n– I might be overestimating how many people want this kind of reading workflow  \n\n\n# 5. Stage\n\nNights-and-weekends project.\n\nLive in TestFlight (let me know if you want to try)\n\nNot raising money.\n\nJust trying to understand if there’s something real here before I continue.  \n\n\n# 6. Customer strategy\n\nCommunities like this one, self-improvement spaces, founders, productivity nerds, students.\n\nBut for now: posting here and hoping for honest direction.  \n\n\n# 7. Why me?\n\nI’m a product designer by trade, so the idea is to create a beautiful app with greatuser experience. I read a lot, but I remember almost none of it. So I built the tool I needed.  \n\n\n# 8. What I’m looking for\n\nRoasts, critique, “this won’t work because…”, feature ideas, market reality checks.\n\nOr if you want to try it and give feedback, sign up on [Superbook.ai](http://Superbook.ai) and I'll send you the TestFlight link.\n\nHappy to get torn apart if it helps me figure out whether to keep going.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1765375611.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Promotional product overview with sections describing what it is and for whom, rather than a steps-based guide or a list of items.",
    "composite_score": 2.387453312518056
  },
  {
    "score": 10,
    "title": "I know people will roast me for this, as i took 4 years to make a website and application",
    "selftext": "4 years! \nThat’s how long it took — 4 years of learning, building, breaking, and rebuilding… to turn a small dream into reality.\n\nCredvestor wasn’t born out of resources or funding — it was born out of pure passion.\n\nWebsite: credvestor.com (please only use it on laptop or desktop as its not dynamic) \n\nAndroid: https://play.google.com/store/apps/details?id=com.credvestor.app\n\nIos: under development \n\nIt started as a small WhatsApp group, where I tried to help people understand finance — for free.\nI saw so many struggling because they didn’t have access to the right tools or guidance.\nMost apps were paid, confusing, or filled with ads.\nSo I decided… why not build something better?\nA platform that’s free, clean, and built to genuinely help people take control of their financial lives.\n\nBut here’s the truth — it wasn’t easy.\nI worked full-time in investment and risk management, 9am to 8pm.\nI’d come home, rest for an hour, and then code all night — from 9pm to 5am.\nThere were nights I didn’t sleep, mornings I questioned myself, and days when progress felt impossible.\nBut I never stopped — because I believed in what I was building.\n\nToday, that dream has a name — Credvestor.\nA platform made with heart, built for everyone.\n\nFeatures we’ve brought to life:\n\t•\tGlobal Community of Analysts\n\t•\tBudget Builder\n\t•\tSplit Expense Manager\n\t•\tInheritance Will Maker (Shariah &amp; Conventional)\n\t•\tCurrency Converter\n\t•\tGlobal Tax Calculator (Pakistan, India, USA, Canada)\n\t•\tCommodity Calculator &amp; Live Screener (Gold, Silver, WTI, Crypto)\n\t•\tInterest &amp; EMI Calculator\n\t•\tStock Index Screener\n\t•\tFinancial Independence (FIRE) Calculator\n\nThe Android app is just 1 month old, the website just 3 days old — and already over 350 users have joined this journey.\n\nWhen I look back, it’s not the sleepless nights or long hours I remember most… it’s the feeling of creating something that might help someone, somewhere, make better financial decisions.\n\nThis is more than an app — it’s a story of perseverance, faith, and purpose.\nIf you’ve ever had a dream that feels too far, too hard, or too late — keep going.\nBecause one day, you’ll look back and realize… every sacrifice was worth it.\n\nThis is just the beginning.\nWould love your thoughts, feedback, and support to make Credvestor even better.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1761072156.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Narrative startup update with features; primarily motivational/story content rather than a model or steps.",
    "composite_score": 2.5571321436793526
  },
  {
    "score": 10,
    "title": "We built a music app for people to discover new and interesting music. Roast us.",
    "selftext": "**Hey** [r/RoastMyStartup](https://www.reddit.com/r/RoastMyStartup/),  \nI’m Michelangelo, founder of Volumio.\n\nAfter having had success building award-winning audio solutions for audiophiles over the past 10 years (software, hardware, cloud tech etc), we wanted to create something for a much broader audience: something for **everyone who listens to music**, not just hi-fi enthusiasts.\n\nI’ve spent the last few years trying to find a real problem worth solving for the general music-listening public. After speaking with thousands of music lovers, one issue came up again and again:  \n👉 **People aren’t discovering new music anymore**.  \nThey feel stuck in a loop of the same songs, endlessly served by recommendation algorithms that optimize for retention, not exploration.\n\n# So we built CORRD:\n\nIt connects to your existing streaming services (Spotify, Tidal, Qobuz) and gives you **personalized music flows** that are always fresh and surprising.\n\n🎧 One tap, and music starts playing: no setup, no playlists to manage, no digging.\n\nBut more importantly, we let you **control the algorithm**. You can adjust how adventurous it should be, how mainstream or underground the flow is, and tune it in real time.\n\nOur approach is simple: we ask people \\*\\*what they’re doing (\\*\\*working out, relaxing, cooking, driving) because music today is a **contextual experience**.  \nBased on that input, CORRD crafts an **infinite playlist** (we call it a *flow*) that fits your moment and pushes the boundaries of what you’re used to hearing.\n\nIt’s not just about what you’ve liked before, it’s about where you are now and what could surprise you next.\n\n👉 **Try it here**: [https://corrd.fm/download-app](https://corrd.fm/download-app)\n\n# Go-to-market strategy:\n\n* Launched version 1.0 for iOS and Android\n* First 500 users onboarded organically, no paid marketing\n* Avoiding Volumio’s existing audiophile user base to get unbiased feedback\n* Focusing on Reddit and music communities for early traction\n* Organic-first, targeting people frustrated with discovery on Streaming Services\n* Light monetization: €40/year after trial\n* Early B2B interest from the hospitality sector\n\n# Now roast us:\n\n* Would you pay for this?\n* Is this solving a real problem, or just a personal annoyance?\n* Would you switch between apps just to get better discovery?\n\n# And a few questions we’re genuinely curious about:\n\n* How do *you* discover new music right now?\n* When was the last time you felt excited by a new artist?\n* Do you ever feel stuck hearing the same stuff?\n\nTear it apart. We can take it.  \nThanks in advance.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1745511136.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Comprehensive product explanation (problem, solution, features, GTM) rather than a step-by-step playbook or list of tools.",
    "composite_score": 2.2959526764861873
  },
  {
    "score": 9,
    "title": "Looking for Feedback on Semantico - Automated Product Catalog Creation for e-Commerces",
    "selftext": "Hey r/roastmystartup community,\n\nWe've built Semantico, a tool designed to eliminate the headache of creating and managing e-commerce product catalogs.\n\n# The Problem We're Solving:\n\nCreating comprehensive product listings is time-consuming and tedious. Many businesses struggle with maintaining consistent quality across their product catalog while scaling.\n\n# Our Solution:\n\nSemantico automates the entire product listing process. Just provide a list of product identifiers (EAN, UPC, etc.), and our system generates:\n\n* Detailed product title and descriptions\n* Automatic categorization\n* Complete attribute sets\n* Custom description blocks for better conversions\n* SEO-optimized content\n* Translations for global markets\n\n# How It Works:\n\nWe offer both a user-friendly dashboard and a robust API for seamless integration. Our newly launched Shopify app makes implementation even simpler - it adds two metafields to your products (one for the reference ID and one for the brand), then uses our upscale extension to automatically generate complete product listings.\n\n# Current Status:\n\nWe have several paying clients who report significant time savings and improved product presentation. We're now looking to scale and refine our product based on wider market feedback.\n\nI'd appreciate any brutal honesty about our concept, execution, or business model. What are we missing? Where would you push back if you were pitched this solution? Check us out:\n\n* Website: [https://semantico.ai](https://semantico.ai)\n* Shopify App: [https://apps.shopify.com/semantico](https://apps.shopify.com/semantico)\n\nThanks for your insights!",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1741603691.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Problem-solution post seeking feedback, describing product capabilities rather than actionable steps.",
    "composite_score": 1.9885606273598313
  },
  {
    "score": 9,
    "title": "Roastmystartup: Paktol - How to save money when you fail at budgeting",
    "selftext": "My friend &amp; business partner u/cgrand and I are launching [Paktol](https://tensegritics.com/paktol/welcome.html) !  \nCan you please roast our startup :-).\n\n[https://tensegritics.com/paktol/welcome.html](https://tensegritics.com/paktol/welcome.html)\n\n**The pitch/product:**\n\nWe were frustrated with personal finance apps that rely on extreme categorization and meticulous planning—as if we're all accountants—so we created [Paktol](https://tensegritics.com/paktol/welcome.html) to offer a simpler, more effective approach to budgeting. Paktol is a personal finance app designed to help you finish the month in the green by gradually allocating funds, encouraging you to spend only what you've accumulated. If you exceed your spending limit, Paktol lets you know how long it will take to recover financially from your purchases. By reconnecting time and money, we help you develop mindful spending habits.\n\nPaktol doesn't concern itself with whether you visit Starbucks or indulge in small luxuries; we're here to help you make informed spending decisions overall, and we believe that's why our method works.\n\nWhether you're managing your finances solo or with your spouse and family, Paktol provides a simple, effective way to stay on top of your budget. We invite you to give Paktol a try and experience a more mindful way to manage your finances!\n\n**Business Model:**\n\nWe have a subscription model with a trial.   \nPrice is $3.99/mo with the monthly subscription or $39,99/y with the annual subscription.\n\n**Market:**\n\nPaktol appeals to:\n\n* Individuals and families desiring simplicity over complexity.\n* Users who want to develop mindful spending habits without strict budgeting.\n* Those frustrated with traditional finance apps that feel like accounting software.\n\nWe translated the app in 7 languages: English, French, Spanish, Portuguese, Italian, German &amp; Dutch \n\n**Competitors:**\n\nThere are numerous budgeting apps like YNAB that focus on detailed categorization of every expense. While this level of tracking works for some, we believe it can be overwhelming and time-consuming for most users. Paktol simplifies budgeting by eliminating the need for exhaustive categorization, allowing users to focus on overall spending habits.\n\n**The team:**\n\nWe are a duo of passionate developers, u/cgrand and myself, with extensive experience in software development and open-source projects like [ClojureDart](http://clojuredart.org) (a LISP compiler we built target Dart/Flutter). Our technical expertise has equipped us to build robust applications, and we're now channeling that into creating a user-friendly finance app with Paktol. While we excel in development, we're eager to learn and grow in marketing and sales.\n\n**Stage:**\n\nWe released the app on the stores last Thursday (September the 12th 2024). We've been dogfooding the app for months with a team of tester (mostly friends &amp; family). We are currently figuring out what are the best marketing channels.  \nOn a product/technical standpoint, we are working on adding:\n\n- iOS widgets  \n- We've been authorised by Apple to use FinanceKit so we can read ApplePay transactions\n\n**Current challenges:**\n\nBiggest challenge right now is marketing the app. We help developed few apps for clients but that's the 1st time we have to market one. We basically have to learn everything in marketing apps.\n\n**Funding:**\n\nParkol is self-funded. We are open to funding inquiries but we're not actively looking for funding. ",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1726480584.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Pitch with business model and market context; promotional narrative rather than a procedure or list.",
    "composite_score": 2.25
  },
  {
    "score": 9,
    "title": "GrowthPanels – SaaS Growth via Word-of-Mouth",
    "selftext": "**Website:** [https://growthpanels.com](https://growthpanels.com)\n\nGrowthPanels is a tool that helps SaaS companies grow their business through word-of-mouth marketing​​ via affiliates, **and incentivized tasks.**\n\nGrowthPanels enables users to integrate a panel on their website, showcasing different ways customers can earn money off their next bill, simply by engaging in activities such as creating social media posts, writing reviews, or producing video testimonials.\n\n**Use Case:**  \nWe offer flexibility in task and reward settings, and our platform can be embedded almost anywhere​​​​.  \nWe focus on various engagement strategies, from social media mentions to case studies​​.\n\n**Target Audience:**\n\nIdeal for SaaS businesses looking to leverage their existing customer base for marketing and growth.\n\n**Market Size:** \n\n* The affiliate marketing industry globally is set to grow to approximately $14.3 billion in 2023 and is expected to reach $15.7 billion by 2024​​.\n* Estimated affiliate marketing spending in 2023 is around $13 billion, with the industry projected to be worth $27.78 billion by 2027, marking a 91% increase from 2020​​.\n* By the end of 2023, the global affiliate marketing industry is anticipated to be worth $14.2 billion, having grown by approximately 10.1% from 2022 to 2023​​.\n* Another source expects the affiliate marketing industry to reach $17 billion in 2023, with affiliate marketing driving 16% of e-commerce sales in Canada and the US​​.\n\nI welcome your roasts, no matter how bad they are! I appreciate any help at this early stage in our startup journey :-)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1700041932.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Promotional concept with description of GrowthPanels and use cases; not a how-to.",
    "composite_score": 2.134044993495972
  },
  {
    "score": 9,
    "title": "Plz roast my startup: Clarity -- an AI platform to measure media bias, summarize current events, and make you smarter",
    "selftext": "Hi Roastmasters!\n\n[Rohan](https://www.reddit.com/user/rohankshirsagr/) and I have been working on a new project over the last couple months. We call it [Clarity](https://useclarity.com/), and it's an AI platform to measure media bias, summarize current events, and make you smarter.\n\nRather than having to read through everything that’s been published to understand all sides of an issue, Clarity pulls together the top news stories and clusters them into topics (e.g., Conflict in Ukraine, Covid 19, Elon Acquires Twitter, etc).\n\nWe then use GPT to summarize how the right, left, and center have been reporting on a given topic, while highlighting any differences between the narratives. This saves you time, paints a more complete picture, and exposes any biases in coverage.\n\nClarity also scores the amount of attention outlets are giving a story, so you can see how individual topics are being exaggerated or ignored by the various tribal factions. It’s fascinating to see what each side chooses to emphasize, or where they are hiding the football.\n\nThere’s a lot more to the product, including an aerial view of all topics, timelines for how topics trend over time, and more.\n\nPlease roast this with the fire of a million suns.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1673555344.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Roast request with product description; promotional rather than steps.",
    "composite_score": 2.1125490200071284
  },
  {
    "score": 9,
    "title": "My Language Learning App Lenglio Is Better Than Duolingo",
    "selftext": "I made a mobile app Lenglio currently available for iOS that is better than Duolingo and I’ll show you why. \n\nProduct\n\nLenglio teaches you to read in a new language. Reading is a foundational language skill. Language acquisition improves with every page read. \n\nLenglio defines words instantly without switching apps and tracks the words for you. \n\nRepeated exposure to vocabulary and grammatical structures while reading increases real world language capabilities. \n\nRead real books, not silly lessons about things like “My aunt gave a bear pizza”. \n\nLenglio is built on BYOB (bring your own books). So, you can read any material you want to learn with. \n\nMarket\n\nThe online language learning space is expected to reach $54 billion USD by 2030 (yes Billion with a B). \n\nThere are tons of language learning products in this space, but I believe dedicated language learners are more interested in serious learning products that improve upon and simplify traditional learning methods such as reading. \n\nThese learners are also willing to hand over cash for products that boost their learning speed and capability. \n\nI think language learning will gradually shift towards more in depth learning applications like mine. \n\nBeginners that actually end up wanting to get serious about language learning tend to graduate to applications like mine. Duolingo serves as more of a funnel than a real competitor. \n\nThe real competition in the language reader space is actually really small. And I think I am capitalizing on this fact already. \n\nMain competitor:\n\nLingQ is the largest in this space and is the main commercial product offering a mobile language reader. \n\nWhile there is also a web platform, I believe they mainly compete as a mobile app. They have an extensive list of languages and a significant amount of content. They also offer various content types including podcast and YouTube transcription. There are also some questionable AI features. \n\nHowever, it is expensive and is inferior in several ways to Lenglio. \n\nFirst of all, the application is incredibly buggy to this day. You can find all sorts of Reddit posts and App Store reviews complaining about this. \n\nThe app has significant difficulty in processing an entire book. Uploading a book is likely to cause crashes. \n\nLenglio has no issues with user uploaded text up to around 5000 pages (more than most typical books). Lenglio is also able to analyze texts at this length rapidly, something that LingQ cannot do. \n\nTo get around this, LingQ splits books into short lessons. But that’s not how I read books. And that’s not how most people read books. \n\nSecond, the UI is very outdated. Lenglio at least looks modern and feels more like reading using a traditional ereader. LingQ is stuck in 2015 (and not in a good way). \n\nLastly, it’s pricey only because they don’t have real competition. Until now. \n\nOther competitors:\n\nReadlang: web app only, expensive, not exactly the same type of reading experience. \n\nLute: free, but needs extensive setup including Docker and personal dictionary uploads. No mobile app. \n\nLearning With Texts (LWT): free, basis of Lute from my understanding, requires extensive setup as well. No mobile app. \n\nLute and LWT are nice but scary for non devs, so much higher barrier to entry, seems most would pay for a mobile app that “just works”.\n\nOther competitors are much smaller and make apps that are fairly buggy or feature anemic (not going to call out small devs).\n\nStage\n\nCurrently released on the iOS App Store. Plan for future Android release after gathering more feedback. Fully bootstrapping. \n\nCustomer Conversion\n\nPartially carried out through organic App Store traffic and partially through Reddit posting/comments. \n\nOver time, my traffic has become about 60% App Store organic and about 40% Reddit organic. \n\nAbout 1 in 30 users that download my app convert to paying. \n\nI offer both subscription and one-time purchase options. Most of the competitors in this space do not offer one-time purchase options. \n\nMy biggest hurdle right now is getting traffic and leads. I have already proven strangers will pay for my app. I believe in my product, so it’s only a matter of time before this starts snowballing. \n\nWhy me?\n\nI’m a daily user of my app, so I am intimately familiar with user requirements and what features make sense from a development standpoint. This is one of my strongest assets.\n\nGo ahead and roast me.\n\nhttps://apps.apple.com/us/app/lenglio-language-reader/id6743641830",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1766163112.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Competitive-positioning pitch with features/market; not a stepwise guide.",
    "composite_score": 2.2271212547196626
  },
  {
    "score": 8,
    "title": "I built an app no one asked for. Roast me",
    "selftext": "I’ve accidentally fallen down a digital-estate rabbit hole. My family refuses to use a password manager \"too complicated\" and sends me random logins or websites on paper, whatsapp and most likely some amendments when I visit this Christmas. I’m basically their oncall IT guru ha. \n\nI started storing their accounts on paper, then Excel, then a tiny database and now I’ve built a wee tool that scans inbox metadata to list all the digital accounts (not reading emails, just spotting sender domains). This spiralled into a proper MVP, think tinder for your inbox, swipe through your digital accounts without the netflix and chill!\n\nIt got me wondering how anyone keeps track of all their online accounts in general. Banks, utilities, email, shopping sites, subscriptions, dobbies… it just builds up and most people have no system for it. My family definitely doesn’t. So instead of maintaining a manual list that goes out of date instantly, I built something that searches your inbox metadata and surfaces the important services automatically, excludes personal addresses and other stuff.\n\nNo agenda, just curious how people handle this in real life.  \nAnd since this weird little project turned into an MVP, does it have legs? Feel free to roast the idea, the concept or the site itself ([Afterwise.io](https://afterwise.io)). Even if it never makes a penny it’s already paid off in skill.\n\nIf I was a carpenter, I’d still build stuff just because I enjoy it. Same idea.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1763325952.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Narrative about building a password-management MVP; seeks roast; promotional rather than steps.",
    "composite_score": 2.2161193099157392
  },
  {
    "score": 8,
    "title": "Trying to conceive? We made a $495 blood + sperm testing plan that helps couples boost fertility by up to ~75%. Roast away.",
    "selftext": "Hey Reddit,\n\nI’m working on a new concept called **Fertility Plan** that helps couples trying to conceive understand and improve their fertility health through lab testing, lifestyle assessments, and personalized daily plans.\n\nIt starts with a short **online baseline assessment** that looks at each partner’s habits, such as sleep, nutrition, stress, and supplement use, to see how supportive their lifestyle/habits is to good fertility.\n\nAfter that, both partners complete **blood testing** at one of our partner labs, and men also do a **sperm test** at home. We measure hormones, thyroid, inflammation, nutrient levels, and other key markers that influence fertility.\n\nOnce results are in, each person gets access to their own **mobile app**, where they receive a personalized plan to improve their fertility health. The app makes it easy to follow daily recommendations, track progress, and see how their **Fertility Lifestyle Score** improves over time. If both partners choose to, they can also follow along each other’s improvement journeys and stay accountable together.\n\nStudies show that optimizing lifestyle factors such as nutrition, sleep, and supplementation can **improve fertility outcomes by up to \\~75 percent.**\n\nThe full plan costs **$495 per couple**, is **HSA/FSA eligible**, and is designed for anyone trying for a healthy pregnancy, including couples who have been trying for a bit and want to understand what might be holding them back before moving toward medical treatments.\n\nWho it’s for: Couples actively trying to get pregnant who want more clarity and control, or anyone who likes the idea of improving fertility through data and lifestyle rather than guesswork.\n\nStage: We’ve launched early pilot runs and already had our first couples complete testing. Right now we are refining the product based on their feedback.\n\nWhy me: I’m obsessed with health optimization, ran a wellness company before, and have spent the past year deep in fertility diagnostics. This is the product I wish existed for proactive couples.\n\nLink: [withfertilityplan.com](https://www.withfertilityplan.com)\n\nBrutal feedback welcome. Would you ever do something like this with your partner, or does it sound like over-engineered baby planning?",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1759964314.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Product concept with plan and price; asks for roast; not a step-by-step recipe.",
    "composite_score": 2.3678031367991563
  },
  {
    "score": 9,
    "title": "I am developing headphones for meditation without the need for a phone.",
    "selftext": "I’m developing **meditation headphones without Bluetooth.**\n\nLet me start with the **problem**, because that’s where this came from:\n\n  \nI meditate daily, usually with 432 Hz or Solfeggio frequency tracks on YouTube. To do that, I need my **phone** and **Bluetooth headphones** — which are both things I *don’t* want near me while meditating.\n\n* Bluetooth gives off low-level EMF radiation (small, but not zero).\n* Phones are a psychological landmine — notifications, vibrations, even the *idea* of waiting for a ping keeps your brain on edge.\n* The result: instead of disconnecting, you’re still tethered.\n\nSo I’m building **headphones that store meditation audio directly inside**.  \nNo pairing, no phone, no notifications — just press play and zone out. Think of it like a Walkman for modern mindfulness.\n\n# 🧠 The Product\n\n* Over-ear headphones with internal storage (pre-loaded meditation tracks and frequencies).\n* No Bluetooth, no app, no Wi-Fi.\n* Simple physical buttons to play curated content — all designed for offline mindfulness.\n\n# 🌍 Market\n\nMeditation apps are a **$5B+ industry** and growing. But there’s a missing hardware angle — something tactile and focused for people who *don’t want more screens*.\n\nTarget users:\n\n* Regular meditators tired of their phone dependency\n* People sensitive to EMF or digital fatigue\n* Retreat centers / wellness brands that want a calm-tech alternative\n\n# ⚙️ Stage\n\nEarly prototype done.  \nCurrently finalizing branding and testing pre-launch interest (landing page + prototype visuals).\n\nNot raising money yet — just building, validating, and talking to early users.\n\n# 💡 Customer Conversion Strategy\n\nStart with direct-to-consumer mindfulness communities: Reddit, YouTube, and email lists from meditation and biohacking spaces.  \nThen B2B with yoga studios and wellness retreats who could offer the headphones as part of their programs.\n\n# 🙋 Why Me\n\nI’m a meditation practitioner and product guy tired of pretending my phone can help me disconnect.\n\n  \nAlso have a background in building physical + digital products (so the “meditation Walkman” is both a personal need and a design challenge).\n\n# TL;DR\n\nPhones ruin meditation.  \nBluetooth adds noise.  \nI’m making **Sonomi** — meditation headphones that play frequencies from built-in memory, no phone required.\n\nWould love feedback on:\n\n* Market fit (is this a niche you think exists?)\n* Hardware UX (what features would you *actually* want on such a device?)\n* Any obvious pitfalls I’m not seeing",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1759800187.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Offers a product concept and rationale for offline, phone-free meditation hardware.",
    "composite_score": 2.271211340411103
  },
  {
    "score": 9,
    "title": "Roast my Startup: Instant Currency (Google Sheets Add-on)",
    "selftext": "# The Product\n\n[Instant Currency](https://workspace.google.com/marketplace/app/instant_currency/93228277435) is a Google Sheets add-on that converts currencies directly in spreadsheet cells with one click and applies proper formatting. Instead of googling \"100 USD in EUR\" and manually typing €86.79, users select cells, pick currencies, and get converted values with correct formatting instantly.\n\n**Use case:** Project managers tracking expenses across multiple countries, business travelers completing expense reports, people planning international vacations.\n\n**Target users:** Anyone from the 900 million monthly Google Sheets users who regularly works with international currencies.\n\n# The Market\n\n* **Total Addressable Market (TAM):** While Google Sheets has 900 million users, our market is the subset that regularly works with international currencies. This includes international businesses, finance professionals, project managers with global teams, and frequent travelers. Conservatively estimating this segment at 5-10% of the total user base gives a TAM of 45-90 million users.\n* **Serviceable Addressable Market (SAM):** Our product is a Google Sheets add-on, so our serviceable market is limited to users who actively use or are willing to install solutions from the Google Workspace Marketplace. We estimate this behavior is present in about 10% of the TAM, creating a serviceable market of 4.5-9 million users.\n* **Serviceable Obtainable Market (SOM):** Our immediate goal is to capture a small fraction of the SAM. Our initial target is to reach the 1,000+ install milestone within the first year, representing approximately 0.02% of the most active users in our serviceable market.\n\n**Competition:**\n\n* Manual google searches + copy/paste (current standard method)\n* GOOGLEFINANCE formulas (=GOOGLEFINANCE(\"CURRENCY:USDEUR\"))\n* 5-10 dedicated currency converter add-ons on marketplace\n* Third-party conversion websites\n\n**Leading competitors:**\n\n* Currency Converter for Sheets: 32K+ installs, 4.2 stars\n* Currency Converter Real-Time: 20K+ installs, 3.9 stars\n\n# Product vs Competition\n\n**My differentiator:** Permanently changes cell values and applies proper currency formatting (€86.79 vs 86.79). Competitors typically show rates or insert formulas without formatting.\n\n**Pricing:** $5 one-time payment for lifetime premium access to current and future features. Current premium feature: historical exchange rates.\n\n# Current Stage\n\n* Live on Google Workspace Marketplace\n* 15 total installs\n* 0 premium upgrades\n* 1 five-star review\n* No funding, bootstrapped\n\n**Goal:** Get user feedback and increase free user base.\n\n# Customer Acquisition Strategy\n\n* **Current:** Relying on organic marketplace discovery\n* **Attempted:** Reddit posts in relevant subreddits (posts removed)\n* **Challenges:** Competing against established add-ons with 20K+ installs\n\n# Why Me?\n\n**Background:** [Former international education worker](https://mrfinnsmith.start.page) who regularly converted currencies in spreadsheets. Experienced the daily frustration of manual conversion processes.\n\n**Experience:** Built this as a personal solution, then decided to share it. Have technical skills to maintain and improve the product.\n\n**Market insight:** Identified gap between existing solutions that show rates vs. actually converting and formatting values in place.\n\n**Current status:** 15 installs, 0 paying users. Looking for product feedback and suggestions for scaling free installs.\n\n**Link:** [https://workspace.google.com/marketplace/app/instant\\_currency/93228277435](https://workspace.google.com/marketplace/app/instant_currency/93228277435)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1750175189.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Provides market sizing and product concept rather than steps.",
    "composite_score": 1.9944850021680094
  },
  {
    "score": 6,
    "title": "Prompt-to-Power: Build No-Code Python AI Agents in Minutes with Creo",
    "selftext": "Hey everyone, I’d love your unfiltered feedback on my startup:\n\n**1. The Product** [Creo](https://creo-three.vercel.app/) is an AI-powered platform for building autonomous agents using natural language — *like if Cursor and Zapier had a baby with Python as the godparent*.\n\n* **Use case:** You describe what you want in plain English — “Build me a Slack bot that summarizes emails every morning” — and [Creo](https://creo-three.vercel.app/) generates, connects, and deploys the working Python agent, ready to run and iterate.\n* **Who wants it:**\n   * Startup teams automating internal tasks\n   * Agencies building bots for clients\n   * Ops/Marketing folks who don’t code but want AI-driven workflows\n   * Devs who *can* code but don’t want to waste time wiring APIs\n\nIt’s not just “no-code” — it’s **prompt-to-code**, with full control when you want it.\n\n**2. The Market**\n\n* **Size:** The global low-code/no-code market was valued at \\~$30 billion in 2023 and is projected to hit \\~$188 billion by 2030.\n* **Competition:** Zapier (workflows, no AI), Make.com(drag-drop automations), Hugging Face (LLM marketplace), and a few emerging AI-agent builders like AgentGPT.\n* **Dynamics:** Everyone wants “AI,” but dev teams are backlogged; ops teams hate YAML; CIOs worry about credentials. We sit at the sweet spot: full Python flexibility + zero-code UX + ironclad security.\n\n**3. Product Analysis / Comparison**\n\n|Feature|Creo|Zapier/Make|AgentGPT|Homegrown Python|\n|:-|:-|:-|:-|:-|\n|**AI-Agent Focus**|✔️ (first-class)|❌|✔️|✔️|\n|**No-Code UX**|✔️|✔️|❌|❌|\n|**Custom Code Hooks**|✔️ (Python + packages)|❌|Limited|✔️|\n|**Secure OAuth Integrations**|✔️|✔️|❌|DIY, error-prone|\n|**Real-Time Collaboration**|✔️ (team workspaces)|❌|❌|❌|\n|**Pricing**|TBA|$19–$99/mo|$0–$50/mo|Free → dev costs|\n\n**4. Why Us?**\n\n* **Secret sauce:**\n   * Deep Python expertise + UX obsession (we actually sat in offices watching non-dev users fumble with other tools)\n   * Military-grade OAuth flows designed for Fortune 500 compliance\n   * Rich ecosystem of community-built agents, ready to drop in\n\n**TL;DR** [Creo](https://creo-three.vercel.app/) = Python-powered AI agents on a no-code dashboard. We’re solving the “AI automation” gap for non-dev teams with secure, collaborative tools. Currently in alpha, raising Seed, and would love your brutal feedback on product, go-to-market, and pitch flow. Roast away!",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.76,
    "subreddit_type": "public",
    "ups": 6,
    "downs": 0,
    "created_utc": 1748275957.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.75,
    "category_rationale": "Describes product and market/competition; not a step-by-step guide.",
    "composite_score": 1.8376470600213852
  },
  {
    "score": 6,
    "title": "We built a push notification API for mobile apps — please tell us why it sucks before we waste more time",
    "selftext": "We’re building [pnta.io](https://pnta.io/) — a backend service and API that simplifies push notifications for mobile apps.\n\nIt abstracts the occasional hell that is Firebase Cloud Messaging (FCM) and Apple Push Notification Service (APNs). It works with any custom auth or backend and gives you full control over APNs and FCM without all the headache.\n\n**What it does:**\n\n* Registers devices (any backend, no Firebase lock-in)\n* Sends push via API or dashboard\n* Stores tokens (APNs + FCM)\n* Monitors delivery + engagement\n* Topics and segmentation rules\n* Includes a dashboard for non-tech people to send notifications, run campaigns, and track performance\n\n**The market:**\n\nEvery mobile app needs push — but most devs (especially those using FlutterFlow, Expo, Supabase, or low-code tools) either:\n\n* Struggle with native APNs + FCM setup\n* Use bloated tools like OneSignal that scale poorly and get expensive\n* Or duct tape Firebase to everything, even when it doesn’t fit\n\nWe’re targeting everyone from indie devs to enterprise teams — making it easy to implement push notifications *and* actually get meaningful data out of them.\n\n**Competition:**\n\n* **DIY Firebase/APNs setups**: Great if you love reading setup blogs and wiring together token storage, segmentation, and analytics by hand.\n* **OneSignal**: Full-featured but heavy. Bloated SDK, rigid structure, and gets expensive fast. Overkill if you just want a flexible API and sane defaults.\n* **Expo**:  Solid choice if you’re fully bought into the Expo ecosystem, but limited flexibility once you step outside it.\n* **AWS SNS**: Raw power, zero ergonomics. Built for enterprise messaging, not mobile-first push workflows.\n\nWe at [pnta.io](https://pnta.io) are trying to find sweet spot between doing everything yourself and getting locked into someone else’s ecosystem.\n\n**Where are we at.** Pre-launch. Bootstrapped. No VC. Looking for early feedback, brutally honest takes, and a few brave testers.\n\n**Tear it apart.** What’s confusing? What feels unnecessary? What would make you bounce in 5 seconds flat? If it’s boring, too niche, or just plain stupid — let us know before we waste more time building it. Cheers! 🍻",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.73,
    "subreddit_type": "public",
    "ups": 6,
    "downs": 0,
    "created_utc": 1747501865.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Asks for critique of startup and describes product; not steps.",
    "composite_score": 1.631158667374088
  },
  {
    "score": 6,
    "title": "Daily news digest app to catch up on trending news without overwhelming you. Articulates diverse perspectives on each story. Yet another news app, roast me!",
    "selftext": "News is overwhelming. There is a massive volume of news published daily and sifting through the noise takes a lot of time and effort. It would just be easier to follow an influencer and be told what to think. The prevalence of false information and echo chambers led to reduced trust in other people and traditional media. We're not giving up on well-rounded discourse though!\n\n**The product**  \nBriefully ([www.briefully.com](http://www.briefully.com/)) is a human-curated web app that brings users daily briefings on trending cultural, science, political, business, tech news. Expertly summarized from thousands of publishers into actually enjoyable one-minute reads. Different takes all in one place.\n\nWe are looking to give people a 360-degree view of events from a multitude of publishers, stay facts-focused, and not tell users what to think. The point of the app is to broaden people's minds about the world. We also include positive science, technology, and culture stories.\n\n**The market**  \nThe news market is very competitive, but it's also very divisive and sensationalist.\n\n* 2 of 3 Americans get their news from news websites, apps and search engines\n* 17% decrease in trust of national news media with a rise of news content on social media\n\n**Competitive analysis**  \nThis may very well be \"yet another news app,\" However, our focus on removing sensationalism in the news coverage, providing multiple perspectives in a separate \"opinion\" section, and providing just the right amount of context in our summaries could be a winning formula.\n\nUnlike traditional media, we offer culturally relevant trending news from a variety of different sources across the political, economic, and social spectrum. We are breaking the bubble and stepping out of silos.\n\nUnlike ChatGPT, we don't require user prompting. The news is specifically designed to aggregate from social media, top publishers across the world, and target stories that present a different angle (not just a copy-paste of AP News articles). We also include relevant media and will be adding a social component in the future.\n\n**Stage**: MVP\n\n**Customer acquisition:** Probably ads and steady organic growth\n\n**Why me?**  \n12+ years in product, and previously built a successful startup in retail. So why not?\n\nBring on the roast!",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.73,
    "subreddit_type": "public",
    "ups": 6,
    "downs": 0,
    "created_utc": 1746902564.0,
    "media": null,
    "is_video": false,
    "num_comments": 0,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Describes a curated news-app concept with market context; not steps.",
    "composite_score": 1.3925980400142568
  },
  {
    "score": 8,
    "title": "Meto – Personalized Metabolic Health Platform (or Just Another Wellness App?)",
    "selftext": "Hey r/RoastMyStartup,\n\nWe built Meto—a personalized healthcare platform targeting metabolic health, obesity, longevity, and hormonal care. Yes, another health app, but hear us out (or roast us, either way, we’ll learn something).\n\nHere’s our shiny pitch:\n\nPersonalized Metabolic Health Care\nWe offer tailored care plans based on your unique health data, including labs, wearables, and clinical consultations. Think personalized medicine meets practical daily interventions. Fancy, right?\n\nLab and Wearable Integration (Fancy Tech, Buzzwords Included)\nTrack your metabolic biomarkers through comprehensive lab tests and wearable devices. We promise it’s not just another dashboard with colorful graphs you’ll stop checking after two days.\n\nClinician-Led Support (Real Humans, Seriously)\nWe connect you with healthcare providers who actually specialize in metabolic health, obesity, and hormonal wellness. No AI chatbots (for now)—real, qualified humans offering genuine medical guidance.\n\nBehavioral Therapy and Lifestyle Coaching\nBecause changing lifelong habits is easy, right? We offer structured behavioral therapy and lifestyle coaching sessions designed to actually help users achieve lasting results.\n\nLongevity &amp; Hormonal Balance\nIf biohacking your way to eternal youth sounds appealing, Meto provides evidence-based strategies to optimize hormonal balance and extend your healthspan.\n\nCommunity &amp; Accountability (Yup, Another One)\nBecause everything’s better with friends (or strangers). Our platform helps users connect, share progress, and stay motivated. Because who doesn’t want to talk about metabolism online?\n\nFlexible Subscription Plans (Insurance Covered or Pay Out-of-Pocket)\nInsurance-friendly, with the option to pay directly if you prefer avoiding the insurance maze. Yes, we do subscriptions. You knew it was coming.\n\nCheck us out (and please roast away): www.meto.co\n\nHit us hard—we can take it!",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1746475259.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.69,
    "category_rationale": "Pitch-style description of Meto health platform; no procedural steps.",
    "composite_score": 1.8547575072713154
  },
  {
    "score": 8,
    "title": "Roast my startup: I built an AI-powered Chrome extension that auto applies to LinkedIn jobs",
    "selftext": "I need some honest feedback on this!\n\n**Product:**   \nThe goal is to help job seekers land a job faster and with greater ease, removing the hassle of manually filling out forms and finding jobs.  \nOriginally I built a tool that uses AI to match you to jobs tailored to your experience and profile.  \nHowever, I felt this in itself did not provide enough value to warrant a paid product.   \nSo, I developed a Chrome extension that auto-fills LinkedIn jobs and sends them.  \n  \nThe audience is job seekers looking to land their next job. Particularly suited to new grads, or people early in their careers who are finding it hard to land a job.  \n  \n**Market:**  \nCompetition:  \nAIApply, LazyApply, JobCopilot, LoopCV, Simplify etc.\n\n**Product Analysis:**  \nI tried some and the solutions vary in quality.   \nIn many cases, auto apply just doesn't work, in others you cannot see in real time the auto apply in action. The best so far is Simplify. Currently I am looking for ways to diversify. But haven't reached that point yet. For now I am just trying hard to listen to user feedback. The only problem is, I am not getting any feedback.\n\n**Stage:**\n\n* Extension MVP launched 8. April. Main app launched around August.  \n* Around 50 sign ups in total. 10 from extension launch and 40 from main app launch. \n* Looking to validate and find product-market fit\n\n**Customer conversion strategy:**\n\n* Content marketing: Promotion on my YT channel, blog and LinkedIn. LinkedIn giving most reach.\n* Outreach: Cold messaging on LinkedIn to people open to work. No success so far. Also sending emails to existing users who have tried the extension and asking them for feedback, no success so far. I have sent around 8 such emails.\n\n**Why Me:**\n\n* Have some following on YT and LinkedIn that I thought would give leverage. \n* Solving own pain point with respect to applying to jobs and refilling the same form every time.\n\nVideo demo here: [https://www.youtube.com/watch?v=0uJYRIY3gJ8&amp;ab\\_channel=HaseebKamal](https://www.youtube.com/watch?v=0uJYRIY3gJ8&amp;ab_channel=HaseebKamal)  \nSite here: [https://www.jobsweeperai.com](https://www.jobsweeperai.com)\n\n",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1745698102.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.71,
    "category_rationale": "Roast-style startup feedback; describes product and market.",
    "composite_score": 1.9037275116073344
  },
  {
    "score": 9,
    "title": "My Thesis-Backed 3D AI Toolkit",
    "selftext": "Hi, I'm Alwyn. I recently launched [simplemesh.ai](http://simplemesh.ai/), a 3D AI toolkit I've built completely solo. This project actually evolved from my thesis research, where I've been exploring efficient 3D generation techniques. I wanted to share this to gather some traffic and feedback.\n\n**The Product:**\n\nA streamlined 3D AI toolkit focused on core functionality with straightforward pricing.\n\n**Current features:**\n\n* Image-to-3D conversion\n* Text-to-3D generation\n\n**Development roadmap (1-2 week release cycles):**\n\n* Remesh functionality\n* Community model marketplace\n* AI retexturing\n* Legolizer (convert models to Lego-style builds)\n\n**Market Context**\n\nThe 3D AI space is growing rapidly with established players like 3D AI Studio ($16/month) and meshy ($20/month). Many existing solutions have feature bloat that most users don't need but still pay for.\n\n**Business Approach**\n\n* No confusing free tier - just straightforward pricing that's competitive during beta\n* Solo development keeps overhead low\n* Rapid iteration based on direct customer feedback\n* Focus on core functionality over excessive features\n* Academic foundation from my thesis research providing technical credibility\n\n**Challenges as a Solo Founder**\n\n* Balancing development with marketing/customer acquisition\n* Maintaining a focused feature set\n* Establishing credibility in a competitive space\n* Fully bootstrapped with no external funding\n\nI'd love feedback from other solo founders who've found their niche in established markets. What was your approach to differentiation without trying to be everything to everyone?",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1741993788.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.73,
    "category_rationale": "Pitch for 3D AI toolkit; roadmap but not steps.",
    "composite_score": 2.0394850021680093
  },
  {
    "score": 9,
    "title": "Roast my startup: Jolt App - Remove distractions, build better focus and habits, and become a top1% individual",
    "selftext": "There are a lot of apps available that let people - (a) show their screen time usage and (b) let them block certain apps from usage for some time, but the fate of all these apps is one - uninstallation after realizing that they **just don’t work!**\n\nWe are building a tool that addresses all the problems pertinent to screen and overstimulation. [Jolt app](http://thejoltapp.com) offers three features broadly:-\n\n# 1. Sessions\n\nYou can block all the distracting apps and consciously give time to what finds meaning during specific times of the day. Example - Let’s say you wake up at around 7 am and have a bad habit of switching on your phone immediately. So set a morning session from 6-8 AM to block distractions and start your day with journaling, reading, or just soaking in the sunlight.\n\n# 2. Blocking\n\nIn our research, we found that usage patterns for every app is different of all the apps. Maybe you use Instagram more than Linkedin or Facebook so you should have customizable restrictions on those apps. Or maybe the problem is that you have a bad habit of checking in often.\n\nSo after understanding this user behavior, we changed this entire blocking feature. And this is what most of our competitors are doing wrong when it comes to restricting access to apps. With Jolt, you can put a duration limit or open limit on any app.\n\n* Duration limit - Instagram will be blocked after, lets say, 45mins of usage in a day.\n* Open Limit - You can open the app, lets say, 4 or 5 times only in a day for only a specific time.\n\n# 3. Challenges\n\nRestricting app usage is something other apps do in their own different ways. But what happens after you have blocked the distraction? If it goes unchecked our user will go back to the same old way and no impact will happen.\n\nThat’s where Challenges come in. You must start with habits, routine and improving your social life. You can do challenges at three levels - **1. Personal   2. Friends &amp;   3. Partner.**\n\nWe’re blending **behavioral science, gamification, and simplicity** to create an app that genuinely helps people reclaim their time and focus.\n\n# Why Us?\n\nWe’re a lean, self-funded team with a proven hypothesis, a good runway, and a passion for solving the ever-growing problem of overstimulation. Launching January on iOS!\n\nWe are self-funded for now. We are a lean startup - a small number of highly efficient individuals. We have been operating from a different brand name for the last 6-7 months to test our hypothesis. We have a good runway for a few years as well. Now we are ready to launch the Jolt app this January on the iOS App Store.\n\nI am a serial entrepreneur and had built and sold successful businesses in the past. This is the next big thing I want to work towards to create an impact. It’s evident that this problem is only increasing daily and the world needs an innovative solution.\n\n# What do we need from you?\n\nNow you can roast my startup or give any feedback/thoughts in the comments. I have come this far with the support of our existing users, their feedback, and insights.\n\nIf you can fill out this [FORM](https://forms.gle/BmJR57YHyYUtgSUv7) and connect with me later to talk more on these lines then I will give you access to the premium of the app for lifetime (free offcourse)\n\nCheck out the [website](http://thejoltapp.com) also, it’ll give you a feel of the branding as well.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1737020625.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Roast startup; describes features and user problem.",
    "composite_score": 2.4111096473669598
  },
  {
    "score": 8,
    "title": "Roast my startup: mitzu.io - It goes to my investors executive summary.",
    "selftext": "Hi Roasters!\n\nI have asked for some serious investor money to build [mitzu.io](http://mitzu.io), which I was granted.   \nNow, after a year, we have a great product. Thursday we are going on [Product Hunt](https://www.producthunt.com/products/mitzu). \n\nAbout Mitzu:\n\n90% of the SaaS businesses monitor the same 15-20 KPIs:  \n- User retention rates  \n- MRRs  \n- Campaign funnel conversions  \n- Active users over time  \n- etc.\n\nCurrently, they have 2 options:  \n- hire a data team build the company KPIs and metrics  \n- use 5-10 different tools to monitor the 15 KPIs\n\nMitzu is a warehouse-native product, marketing, and revenue analytics app. Move your data to your data warehouse, connect Mitzu and after a short configuration you will have all B2C SaaS metrics in place.\n\nThank you for ROASTING! ",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1728397725.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Roast startup: investor summary and metrics; pitch.",
    "composite_score": 2.126791529446453
  },
  {
    "score": 9,
    "title": "Yet another humanizer. Ugh!",
    "selftext": "Hello my fellow interweb citizens,\n\nI am all about plain and understandable language. What good does content do if you have to read it 3 times before your understand anything? You'd probably bounce way before that.\n\nGPT-generated bla bla is no better. It's often full of phrases, repetitive words, and even cringey fluff.\n\nThat's why I looked for humanizer tools and what I found made me facepalm: They add mistakes and flaws into your text or even destroy the meaning by twisting and turning the words.\n\nI can and will do better, I thought.\n\nSo, here goes: [https://ai-text-humanizer.com/](https://ai-text-humanizer.com/)\n\nThis bad boi is a few weeks old now and already made 1460 people sign up.\n\nGreat success!\n\nNow I want you to point out where I messed up, what's weird, ugly, stupid, or makes your facepalm, too.\n\nGive me hell! Thank you in advance.\n\n",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1727339537.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.86,
    "category_rationale": "Emotional vent about humanizers and GPT-generated content.",
    "composite_score": 2.2895906230238126
  },
  {
    "score": 8,
    "title": "Roast My Startup: Starman AI – A Startup Validation Tool That Thinks It Can Save Founders Time and Money",
    "selftext": "Alright, time to roast me 🔥\n\nI’m the founder of **Starman AI** (https://starmanapp.ai), a platform designed to help startup founders validate business assumptions more efficiently and fast-track Product-Market Fit. It’s basically a toolbox for the overworked, “wearing-too-many-hats” founder who needs a reality check on their ideas before throwing money into the void.\n\nIt generates Lean Canvases, builds experiments, prioritizes roadmaps, and spits out real-time data-backed insights to help you figure out if your startup is actually viable or just another pipe dream.\n\nIt’s currently in **early free alpha**, and I need testers who don’t mind ripping it apart (or finding some value). The irony? I built a tool that validates ideas, and now I’m here needing you lot to validate mine. Let’s see if the execution holds up, or if I should start working on a side hustle selling artisanal jam.\n\nBring it on!",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1725974807.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Describes startup validation tool and its core function.",
    "composite_score": 2.2612141855927432
  },
  {
    "score": 8,
    "title": "Roast my startup - another collaboration OS",
    "selftext": "**Product:** Frame: all-in-one collaboration OS ([https://www.frame.so](http://frame.so/?utm_source=reddit&amp;utm_medium=thread&amp;utm_campaign=TR)), our newest innovation.  \n**Problem/Pain point:** The common issue of application fragmentation, leading to the cumbersome need to sift through a wide variety of applications with inconsistent interfaces and an overwhelming array of features.  \n**Solution:** Frame offers a one-stop, minimalistic suite that amalgamates notes, tasks, whiteboards, and processes. It boasts features such as templates, app links, back-linking, cross-app search, and private documents, all designed to ensure simplicity and interoperability. We welcome feedback and criticisms to better understand if this solution meets users' needs or if there is a preference for the excitement associated with juggling multiple apps.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1687954134.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Describes Frame product and asks for feedback; explains problem/solution.",
    "composite_score": 2.1813637641589874
  },
  {
    "score": 9,
    "title": "Eye2.ai - compares answers from leading AIs and delivers a clear, trusted result instantly",
    "selftext": "[Eye2.ai](http://eye2.ai) \\- **See What AIs Agree On**.\n\nThe idea is that if different top AIs (e.g. OpenAI’s ChatGPT, Anthropic’s Claude, Google’s Gemini, etc.) converge on the same answer, you can have more confidence it's correct. By contrast, if they disagree or one model says something the others don’t, you know to be skeptical or dig deeper.\n\n**Problem -** \nLarge language models (LLMs) like ChatGPT have exploded in popularity, reaching millions of users. However, trust in a single AI’s answer is a known issue - AI outputs can be inaccurate or even fabricated, and an average user may not catch those errors. People currently try to mitigate this by either googling for verification or asking the same question to different AI bots manually. That’s a hassle. We see an opportunity in this huge market of AI users: provide a one-stop tool for AI answer cross-checking.\n\nIn summary, our differentiator is the “many AI minds &gt; one” approach. Rather than betting on a single model’s capabilities, we let them essentially check each other’s work. If three different models independently tell you roughly the same answer, you can trust that answer a little more. And even when they diverge, it’s valuable to see why one might cite a source or logic that the others missed, for example. \n\nFrom a product standpoint, we focus on being instant and user-friendly: no login required to try, no need to paste your question into five different apps-it’s all in one screen, pretty much real-time. We think this convenience and focus on trust can carve out a loyal user base of people who rely on accuracy.\n\n**Stage-**\nWe’re in public launch (you might call it a “beta” since we are still refining things, but the site is live and fully functional). The product has been built and is already public, we actually soft-launched a little while ago but haven’t actively promoted it until now. There’s essentially zero press or marketing done so far (no Product Hunt launch yet, no media coverage). We wanted to gather organic feedback and iterate quietly before making a splash. That also means our current user base and traction are small, Consider this Reddit post as one of our first public unveilings.\n\nWe’re not actively fundraising at the moment; the project has been internally funded. Our focus is on improving the product and finding a solid product-market fit (or discovering if this idea even has legs) before we would consider raising money to scale.\n\n**Business model -**\nRight now, [Eye2.ai](http://Eye2.ai) is completely free to use. We want to reduce friction for new users and get as many folks trying it as possible, to learn from their usage and feedback. Long term, we do need to figure out how to make this a viable business. \n\n**Team -**\nEye2.ai was built by a small team within Tomedes, a company with many years in the language technology and content space (known for translation and localization services). Our team has a lot of experience with AI in language, recently working on building [MachineTranslation.com](http://machinetranslation.com) , which helped them realize the potential of using multiple LLMs to enhance the value of AI outputs. \n\nIn practical terms, that means we recognized a pain point: people love the convenience of AI answers, but don’t always trust them. So why not using AI to find the common outputs of multiple AI models for a specific prompt. \n\nWe’re looking forward to your candid feedback on anything - the concept, our execution, the UI/UX, our marketing (or lack of), the lack of business model, you name it. Whether you think this is solving a real problem or you feel it’s a pointless gimmick, we want to hear it straight..",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1750174224.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Explains problem of trust in single AI and proposed cross-check concept.",
    "composite_score": 1.9885606273598313
  },
  {
    "score": 8,
    "title": "Famit - The Best Family Calendar App",
    "selftext": "**The Product**  \nFamit is a family calendar app designed to simplify household scheduling and event management for busy families. Think of it as the Google Calendar killer for parents who feel like their lives are held together by speeding and last-minute texts.\n\nFeatures include:\n\n* AI-powered event creation (just forward an email, and it’s on the calendar).\n* Multiple calendar views (week, month, day).\n* A personal AI assistant that can create/modify/archive events, reminders, to-dos.\n* Household connections so everyone is on the same page.\n* Birthday and event reminders (never forget Grandma’s party again).\n* QR and RSVP management for bday parties.\n* Sign up lists that can be shared publicly or privately.\n* To-do lists and shared tasks for the family.\n* Custom events for specific household needs (like assigning chores or tracking kids' extracurriculars).\n\nThe app is **$10/month per household**, because your peace of mind shouldn't break the bank.\n\n**The Market**  \nMarket size: Families with 2+ kids, working parents, and anyone juggling multiple schedules in a household. That’s *millions* of families in the U.S. alone.\n\nCompetition: Google Calendar (free, but not family-focused)  \nCozi (feels clunky and outdated)  \nFamily Wall (but their UX...meh). Families want simplicity, functionality, and something they don’t have to spend hours learning.\n\nFamit takes the headache out of scheduling with AI and family-specific features that competitors don’t offer.\n\n**Competition**\n\n* **Google Calendar**: Great for general use but lacks family-specific tools like task sharing, household connections, and event reminders tailored for families.\n* **Cozi**: Offers family features but is dated in both design and functionality. Famit is sleeker, faster, and easier to use. They recently pissed off a lot of users by moving a big free feature to paid.\n* **Family Wall**: Close competitor but overly complicated for many users. Famit nails the balance between robust features and user-friendly design.\n\n**Stage**  \nFamit is live. It is bootstrapped and NOT raising money. The focus is on building a sustainable user base and growing revenue through subscriptions.\n\n**Customer Conversion Strategy**  \nWhere I find them: Social media (Instagram, TikTok, and Facebook) and parenting communities.  \nHow I would convert them:\n\n* **Social Proof**: Highlighting reviews and testimonials from busy moms who’ve reclaimed their sanity.\n* **Exclusive Promos**: Half-price launch offer ($5/month).\n* **Content Marketing**: Reels and Shorts showing Famit in action.\n* **Virality**: Features like QR-code birthday invites to drive word-of-mouth.\n\n**Why Me?**  \nI’m a dad of 4 young kids who knows the chaos of managing a family schedule firsthand. My background is in programming and business. I built Famit because I needed it—and because I believe millions of other families need it too.   \n  \nCheck out Famit at [famit.co](https://famit.co)",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 8,
    "downs": 0,
    "created_utc": 1733751418.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Describes features and market for family calendar app.",
    "composite_score": 2.2249388520184374
  },
  {
    "score": 7,
    "title": "Introducing LLM Guardian – For the Developers Out There Who Actually Care About Data Privacy",
    "selftext": "Alright, let’s skip the fluff. You don’t care about another boring product announcement, and I don’t care about writing one. So here’s the deal:\n\nLLM Guardian is a Chrome Extension designed to do one thing and do it well—keep your secrets safe when you're using ChatGPT. We all know devs are pasting code snippets left and right into AI without a second thought, and guess what? That code often has secrets, API keys, passwords, and other sensitive info baked right in. LLM Guardian scans and redacts that sensitive data *before* it gets sent off to the ether.\n\n# Who’s this for?\n\n1. **Product**: If you’re a developer (or work with them) and want to avoid exposing sensitive data in prompts, LLM Guardian’s for you.\n2. **Market**: Developers and tech companies are increasingly adopting LLMs in day-to-day work. Right now, the market’s wide open with only a few competitors that either overcomplicate things or ignore the data privacy aspect.\n3. **Product Analysis**: LLM Guardian’s unique focus on real-time redaction means it’s lightweight and built with devs’ real workflows in mind—no fluff, just practical privacy.\n4. **Current Stage**: We’re getting our Chrome Extension Store approval, but for now, you can access it as an open-source extension on GitHub.\n\nWant to chat about enterprise deployment or deploying it on-prem for more control? We can do that too.\n\nYou can give LLM Guardian a try at [https://llmsecrets.com](https://llmsecrets.com). No need to do a background check—just install, try it out, and see how it works for you.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 7,
    "downs": 0,
    "created_utc": 1731534090.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Describes LLM Guardian product and privacy focus; market.",
    "composite_score": 2.0756390069990722
  },
  {
    "score": 6,
    "title": "Meet discoteka.live - Your Next Step in Microlearning!",
    "selftext": "Hello Reddit,You're not here to listen to me rave about our 'innovative' website. So, without further ado, let me introduce you to [https://www.discoteka.live/](https://www.discoteka.live/), the microlearning platform that's going to change how you consume educational content.\n\n📖 **The Product**: Discoteka.live is a microlearning platform that provides short, highly-structured courses across a range of subjects.\n\n🔬 **Product Analysis**: Unlike competitors, discoteka.live focuses on breaking courses into micro-units, ensuring the learning process is flexible, easy to digest, and most importantly, retains engagement.\n\n🚀 **Stage &amp; Funding**: We're at the early-stage of growth, with a robust platform and a solid user base. Currently, we're bootstrapped and profitable, but we are open to the idea of raising funds to fuel our next stage of growth.\n\n💰 **Customer Conversion Strategy**: We find our users primarily through targeted ads on social media and organic SEO.\n\n🙋‍♂️ **Why Us?**: We're a team of passionate educators and technologists, with decades of combined experience in edtech. We're here because we believe in the transformative power of learning and want to make it more accessible and convenient for everyone.\n\nFeel free to roast us, make humorous observations, or even better, give us constructive feedback! How can we improve? What do you want to learn about? Thanks for reading, and I'm looking forward to hearing from you all!\n\nP.S. I promise I don't have a rich daddy who's bankrolling this operation, just a group of enthusiasts who believe in the cause!",
    "subreddit": "roastmystartup",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 6,
    "downs": 0,
    "created_utc": 1690069519.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Describes microlearning product and asks for roast/feedback; stage.",
    "composite_score": 1.8061280356782379
  },
  {
    "score": 5,
    "title": "ModelBench - AI Prompt Engineering Playground – Smarter, Cheaper, and Easier Than LangSmith!",
    "selftext": "[https://www.modelbench.ai](https://www.modelbench.ai)\n\n**The Problem**\n\nLLMs can produce unpredictable results. To build with LLMs, you need to run tests and benchmark outputs. This means juggling countless tabs, spreadsheets and over-engineered eval frameworks.\n\n**The Product**\n\n**ModelBench** allows developers to compare and benchmark AI model outputs and build with LLM's Fast. Identify the best-performing prompts or models &amp; create products in record time.\n\nModelBench automates the process of testing prompts across 180 models, and you can be up and running in minutes. No\n\n**The Market**\n\nIdeal for AI developers, data scientists, and organizations aiming to streamline AI development.\n\nThe AI development tools market is growing rapidly, driven by the increasing demand for AI applications across industries. Major competitors include LangSmith, which faces criticism for its complexity and cost. ModelBench’s competitive pricing and user-friendly features position it well in this expanding market.\n\n**Competition**\n\nThe closest competitor is LlangSmith\n\n* Llangsmith - complex framework\n* Model Bench - simple web app\n\n* Llangsmith - complex setup\n* ModelBench - login and go\n\n* LangSmith - struggles with integration issues\n* ModelBench - 180 models instantly available\n\n**Current Stage and Funding Needs**  \nBootstrapped\n\n# Customer Conversion Strategy\n\n**Finding Customers:**   \n**Target AI developers** and organizations through industry conferences, online, and social media marketing.   \n**In-built sharing tools** - share benchmarks and prompts Leverage SEO and content marketing to attract organic traffic.   \n**7 day free trial** - to paid   \n**Encourage Team adoption** - showcase success stories, and provide comprehensive tutorials to demonstrate value.\n\n**Why ModelBench Team?**\n\nThe founders have spent the last 18 months building products on top of LLM's. ModelBench was built to solve a persistent problem they had that slowed progress significantly.",
    "subreddit": "roastmystartup",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 5,
    "downs": 0,
    "created_utc": 1722361652.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Describes problem, product, market, and competition.",
    "composite_score": 1.8291812460476249
  }
]