[
  {
    "score": 2712,
    "title": "Spent $300k on a healthcare app that nobody uses.",
    "selftext": "I'm about to lose my mind and my investor's money.Developer swears it's 'technically perfect' but I can't get a single doctor to adopt it. Two years ago we raised a seed round to build a patient management app for primary care doctors. Hired this boutique dev shop, spent 18 months and $300k building what they call a \"technically superior solution.\" The app works flawlessly. Zero bugs, clean UI, integrates with major EHRs, HIPAA compliant, the whole nine yards. Our developers are genuinely proud of it. But here's the problem: doctors hate it. We've demoed it to 50+ practices. Same feedback every time. \"It's nice but it doesn't fit our workflow.\" \"Too many clicks.\" \"We already have a system that works.\" Meanwhile I see these basic-looking apps with terrible UIs getting massive adoption because they solve one specific pain point really well. Starting to think we built the app WE wanted to build instead of what doctors actually needed. Like we got so caught up in making it technically impressive that we forgot to make it useful.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2712,
    "downs": 0,
    "created_utc": 1754840255.0,
    "media": null,
    "is_video": false,
    "num_comments": 1311,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Post analyzes product-market fit with a key insight about building for doctors' workflows.",
    "composite_score": 5.704916711281417
  },
  {
    "score": 2426,
    "title": "I'm Jacob, I made an AI Resume SaaS that bypasses ATS &amp; lands people more interviews. It has 3M+ professionals using it &amp; made $5m+ in lifetime revenue (AMA)",
    "selftext": "Hello fellow SaaS builders. My name is Jacob &amp; I'm the founder of /r/Rezi. https://www.rezi.ai/\n\nRezi is the #1 AI resume software known for creating resumes that force the user to follow best practices so they land an interview.\n\nI started the company approximately 9 years ago, shortly after graduating college.\n\nI faced the pain-point myself. In college, I had a 2.2 GPA yet still managed to get interviews at companies like Dropbox, Google, EA, Goldman Sachs, &amp; Kaplan.\n\nI realized that the secret to getting invited to interviews was my resume. Learning how to optimize your resume will give you an edge rather than mindlessly applying for 1000s of positions.\n\nMy secrets to land more interviews:\n\n**Beating the ATS:** Most large companies use Applicant Tracking Systems (ATS) to filter resumes before a person even sees them. You have to create a resume tailored to the exact job description.\n\n- Use the right keywords: Scan the job description and make sure those exact words and phrases are in your resume.\n\n- Keep formatting simple: ATS can't always read fancy formatting. Stick to clear fonts and basic bullet points.\n\n**Details, Details, Details:** Don't just say what you did; explain the what, why, and how of each task or accomplishment.\n\n- For example, instead of writing, \"Managed social media,\" write: \"Developed and executed a social media content calendar that increased engagement by 20% in six months using platform analytics and A/B testing.\"\n\n**Tailor Every Single Time:** Yes, it's a pain, but you need to customize your resume for each job application.\n\n- Focus on the job description: Highlight the skills and experiences that are most relevant to that specific role.\n\n- Mirror the language: Use the same terminology that is used in the job posting. Chris Voss recommends mirroring the language even in high-stakes negotiations.\n\n**Formatting Matters More Than You Think:** A clean, easy-to-read resume makes a big difference.\n\n- Use simple fonts like Arial or Times New Roman.\n\n- Use consistent bullet points.\n\n- Use clear section headings.\n\n\nAnd so I made a post on Reddit sharing my resume template. It went viral and many people were asking for the template so I thought why not create a website and sell the template there. That was how Rezi came about.\n\nOver the next few years, I moved to South Korea to explore the growing tech scene in 2016. I ultimately raised some angel investment, built a basic software prototype of the resume template, launched that for free, and further validated the idea with technology and then ultimately launched Rezi as it is today, and that was five years ago.\n\nWe recently crossed $5.4 million in lifetime revenue, which you can verify on the Indiepage Leaderboard, where we're ranked #1.\n\nAsk me anything about resumes, building a SaaS, fundraising, SEO, or anything that comes to your mind.\n\nI’m super happy to share resume tips as well to help you land better jobs or even any job if you have been one of the unlucky ones. AI has killed a lot of jobs for juniors (look up Fiverr/Upwork stock) in 2024 &amp; in 2025, it'll kill even more jobs (ahem.. web developers) so I know what its like. If you don't wanna ask publicly, do ask privately in DMs but publicly would be better as others can learn from your question.\n\nAlrighttt gooo!!!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2426,
    "downs": 0,
    "created_utc": 1738155917.0,
    "media": null,
    "is_video": false,
    "num_comments": 244,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Numerous explicit tips for landing interviews presented as bullet items.",
    "composite_score": 5.307152818514202
  },
  {
    "score": 1833,
    "title": "Stop building useless sh*t",
    "selftext": "\"Check out my SaaS directory list\" - no one cares\n\n\"I Hit 10k MRR in 30 Days: Here's How\" - stop lying\n\n\"I created an AI-powered chatbot\" - no, you didn't create anything\n\n  \nMost project we see here are totally useless and won't exist for more than a few months.\n\nAnd the culprit is you. Yes, you, who thought you'd get rich by starting a new SaaS entirely \"coded\" with Cursor using the exact same over-kill tech stack composed of NextJS / Supabase / PostgreSQL with the whole thing being hosted on various serverless ultra-scalable cloud platforms.\n\nJust because AI tools like Cursor can help you code faster doesn't mean every AI-generated directory listing or chatbot needs to exist. We've seen this movie before - with crypto, NFTs, dropshipping, and now AI. Different costumes, same empty promises.\n\nNope, this *\"Use AI to code your next million-dollar SaaS!\"* you watched won't show you how to make a million dollar.\n\nThe only people consistently making money in this space are those selling the dream and trust me, they don't even have to be experts. They just have to make you believe that you're just one AI prompt away from financial freedom.\n\nWhat we all need to do is to take a step back and return to fundamentals:\n\n1. Identify real problems you understand deeply\n2. Use your unique skills and experiences to solve them\n3. Build genuine expertise over time\n4. Create value before thinking about monetization\n\nTake a breath and ask yourself: \n\nWhat are you genuinely good at?\n\nWhat problems do you understand better than others?\n\nWhat skills could you develop into real expertise?\n\nLet's stop building for the sake of building. Let's start building for purpose - and **if your purpose is making money, start learning sales, not coding.**",
    "subreddit": "SaaS",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1833,
    "downs": 0,
    "created_utc": 1736857508.0,
    "media": null,
    "is_video": false,
    "num_comments": 278,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Contains a numbered sequence of actionable steps and guidance.",
    "composite_score": 5.206201432970801
  },
  {
    "score": 1633,
    "title": "Solo founder, $20k MRR, zero ads, zero employees. Here's exactly what worked",
    "selftext": "Solo founder here. I hit $20k MRR with zero employees, zero ads, and $0 marketing budget. The playbook nobody talks about.\n\nLook, I know another \"how I made it\" post... but hear me out.\n\nI see you grinding at 2 AM, wondering if you should dump your last $2k into Google Ads. **Don't.** \n\nI wasted 6 months and $8k on ads before I realized something - as a solo founder, you have superpowers that VC-backed teams don't. Here's exactly how I leveraged them:\n\n## 1. The \"One Person, Everywhere\" Illusion\n\nBig companies need meetings to tweet. You don't. \n\nI literally set up alerts for every keyword related to my niche. Responded to every relevant question on Twitter, Reddit, indie hackers, and random forums within 5 minutes for 6 months straight. People thought I was a team of 10. \n\nReality: Just me with my phone notifications turned up to 11.\n\n## 2. Fuck Your Roadmap\n\nThis one's controversial but... I threw away my beautiful 12-month roadmap.\n\nStarted shipping what users asked for THIS WEEK. Like, literally built features while on Zoom calls with customers. One dude watched me code his feature request live. He referred 6 customers that month.\n\nYour agility is your moat. Use it.\n\n## 3. The Pricing Paradox That Saved My Sanity\n\nOk this sounds insane but I 5x'd my prices overnight. Lost 80% of customers. Doubled my revenue.\n\nBut here's the kicker - higher-paying customers actually need LESS support. My support time went from 20 hours/week to 2. \n\nI'm not joking. The $9/month users will email you about button colors. The $97/month users just want it to work.\n\n## 4. The \"Boring Marketing\" Goldmine\n\nWhile everyone's trying to go viral on TikTok, I did the most unsexy thing possible...\n\nWrote 200 blog posts answering the most boring questions my exact customers Google at 3 PM on a Tuesday. Stuff like \"how to export CSV from [competitor]\" or \"[specific feature] not working fix\"\n\nNow I get ~50 signups/month on complete autopilot. Been steady for 8 months.\n\n## 5. Competitor's Worst Nightmare Strategy\n\nThis is borderline evil but... \n\n- Set up Google alerts for \"[competitor] alternative\"\n- Made a comparison page for every major competitor\n- Hung out in their support forums and helped people (genuinely helped, not spammed)\n- Created guides for migrating FROM their tool\n\n40% of my MRR is competitor refugees. Sorry not sorry.\n\n## The Solo Founder's Actual Edge\n\nYou can't outspend them. You can't out-hire them. You can't out-build them.\n\nBut you can out-care them. \n\nEvery customer knows my name. Every feature request gets a personal Loom video response (even if it's a \"no\"). Every churned user gets a personal email asking what I could've done better.\n\nBig companies can't do this. Their support team doesn't know their CTO. You ARE the CTO.\n\n## Why Ads Are a Solo Founder Trap\n\nReal talk - ads need constant feeding. New creatives, split tests, landing page optimization, tracking pixels, attribution windows... \n\nThat's literally a full-time job. You know what you should be doing instead? Building shit that compounds while you sleep.\n\n## My Actual Daily Stack (Total cost: $0)\n\nMorning (30 min):\n- Check Reddit/Twitter mentions, respond to everything\n- Record 2-3 personalized Loom onboardings for new signups\n\nAfternoon:\n- One customer call (they book directly via Cal.com)\n- Ship one thing (even if tiny)\n\nEvening:\n- Write one piece of content (blog, tweet thread, whatever)\n\nThat's it. No fancy automation. No virtual assistants. No growth hacks.\n\n## The Plot Twist\n\nI still surf every Tuesday and Thursday afternoon. I take weekends completely off. I went to Japan for 3 weeks and revenue went UP.\n\nBecause sustainable &gt; scalable when you're solo.\n\nYou don't need to work 100 hour weeks. You need to work on the RIGHT things for 20-30 focused hours.\n\n---\n\nLook, I'm not saying this works for everyone. B2B SaaS is different from consumer apps. But if you're a solo founder selling to SMBs or prosumers, this shit works.\n\nThe best part? When VCs eventually come knocking (and they will), you can tell them to fuck off because you don't need them.\n\n**EDIT:** Holy shit this blew up. My DMs are cooked but I'm trying to respond to everyone. Solo founders gotta stick together 🤝",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1633,
    "downs": 0,
    "created_utc": 1755647298.0,
    "media": null,
    "is_video": false,
    "num_comments": 294,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Explicit how-to playbook with steps to replicate success.",
    "composite_score": 5.175663060185478
  },
  {
    "score": 1337,
    "title": "I just made $1.5 B by selling my SaaS (AMA)",
    "selftext": "The title speaks for itself. I've been a software developer for four hours. Last night as I was playing with my toy trains in my mom’s basement I came up with the idea of not just another service, or an agent for the sake of an agent but a truly in-demand service. Took a two hour break from scrolling Reddit, watched an 5 minute intro to HTML &amp; CSS tutorial and coded the most brilliant software ever created (to-do app that saves to localStorage).\n\nAn hour later and I have over 100 million visits (DDoS attack) which is truly unimaginable growth, I never expected my product to catch on THIS fast. Also, I received a call from a huge company (Indian customer service I think that tells you all you need to know ;) ) about buying my app for $1.5 billion and a contract that includes free use of the company’s private jet, private island, mansion and more.\n\nI instantly accepted their offer, gave the my mom’s credit card number and internet banking password and am currently waiting for the money to come in. To say it's a it career speedrun is an understatement :) my relatives don't know (my mom has no idea lol), real-life gf non existent. Only my imaginary furry girlfriend knows because I tell her everything (she makes me, otherwise I get punished).\n\nThere is no point in advertising anything anymore, so I will answer your questions as best as I can while waiting for my money to come in. \n\nThe most important thing to know is that luck is, of course, very important, but the most important thing is your ideas.\n\n&gt;I will be answering your questions but I’m closing the AMA because my mom says she wants to have a talk (she must be so proud and happy!!)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 1337,
    "downs": 0,
    "created_utc": 1760449951.0,
    "media": null,
    "is_video": false,
    "num_comments": 285,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.45,
    "category_rationale": "Satirical AMA with hyperbolic claims; not a clear instructional or explanatory post.",
    "composite_score": 5.029639129996326
  },
  {
    "score": 1247,
    "title": "My non-AI app made $8000 USD in 2 months. Here’s how I did it",
    "selftext": "I’ve been building AI wrappers for the past 3 years as an indie hacker. None of them became profitable. Building failed products taught me how to code, design and market properly. And one day all those skills paid out \n\n**The idea**\n\n2 months ago Skype announced it was closing down. Most people used Skype for video calls, but there was a niche of people who used Skype to make cheap international calls to mobile and landline numbers. That was a golden opportunity – major playing leaving the market, and its users scrambling for an alternative.\n\nThat’s how I made Yadaphone. I took one feature of Skype I used myself – making cheap overseas calls, and created a website that allowed people to do it.\n\n**Launch**\n\nI built an MVP in a weekend. The design was minimalist, landing non-existent, but the app worked – you could sign up, buy credits and call. I wrote a quick post on r/Skype. It got removed in an hour, but it was enough to get my first users. This is where I got real lucky for first time. One of users, became a super-fan of my product. He started giving a lot of feedback and promoting my app among his friends. His testimonial is still featured on my landing page (hi Nico!).\n\n**Promotion**\n\nReddit was great to get the first users, but the traffic from it depends on my creativity and people upvoting the posts. I couldn’t rely solely on it. That’s when I decided it was time for the Product Hunt launch. I prepared everything, but was so stressed with support requests, that when the launch came … I forgot about it. \n\n2 hours into the launch I looked at my phone and saw people upvoting Yadaphone. I panicked and started spamming about it in all my social media. I also sent an email to all my existing users – and it was super helpful. My own users started uploading the product, and we finished 11th that day – earning us a featured badge and a really strong backlink from PH.\n\n**Growth**\n\nPH launch was also useful, because this is how we got our first b2b customers. Next day after launch, a guy texted me out of the blue saying he wanted an enterprise plan for his company. I said, sure I’ll get back to ya (of course I didn’t have an enterprise plan back then). I coded the organization management logic in a night, and the next morning was presenting my solution to his company of 20 people. That worked, we onboarded him and the next day I got a Stripe notification of several hundred bucks. It felt surreal.\n\n**What didn’t work**\n\n* Paid traffic\n\nI tried paid traffic on Google, Reddit, LinkedIn, and Facebook. None of them worked. The worst by far is Reddit. Reddit ads are mostly bots who are not even active on the website.\n\nWhat I learned is that social media paid traffic will only work if you already have viral posts that you can promote even further. Otherwise it’s a waste of money. Google works if you target a super niche keyword (example: target the keyword “calls to the United States” and have a specific page built for this keyword).\n\n* TikTok and Insta reels\n\nI tried posting reels, but this was a pure waste of effort. None of them got any views. I still think it can be a good source of traffic, but you need to know what you are doing.\n\n**What worked**\n\n* Reddit. Great source of traffic, great audience (just don’t get banned for promotion)\n* Twitter/X. One of my tweets was reposted by Pieter Levels. It got 200k views, a ton of publicity and sales. I still post to Twitter every day. Great marketing channel\n* Collaborations with journalists. Yadaphone got featured early as one of top Skype alternatives in a well-ranked article. Good for domain authority and traffic\n* Linkedin content. LinkedIn is so filled with AI content, if you post something genuine, you are guaranteed to get engagement. I post to LinkedIn every day. Sometimes about Yadaphone, sometimes stuff related to products in general (for example, I made an overview of top Reddit startups launches recently). Good reactions, and shows that you as a founder stay behind you work\n\nThis was an overview of my experience launching a profitable non-AI product as an indie hacker. I would be happy to answer any questions you guys have!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1247,
    "downs": 0,
    "created_utc": 1745922840.0,
    "media": null,
    "is_video": false,
    "num_comments": 319,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Structured sections describing actions to reproduce growth (launch/promotion).",
    "composite_score": 5.076289574506358
  },
  {
    "score": 1240,
    "title": "My biggest competitor reached out to acquire me. The conversation taught me more about my business than 3 years of running it.",
    "selftext": "Got an email a few months ago. The CEO of my biggest competitor wanted to chat. Assumed it was a trick or a scouting mission. Took the call anyway out of curiosity. They wanted to buy me. Real offer. Real number. Not life-changing money but meaningful. I didn't take it. But the process of considering it taught me a ton. They asked questions I'd never asked myself. What percentage of customers actually use the core feature? What's the real competitive moat? How replaceable am I personally to the business? What would break if I disappeared? What assets transfer versus what's just me? Had to actually find the answers. Some were uncomfortable. The moat I thought existed basically didn't. Turns out competitors could rebuild my product in 3-4 months. The thing I thought was defensible was just a head start. My personal involvement was more central than I'd admitted. Relationships I had with key customers, knowledge in my head, reputation I'd built. The business without me was worth a lot less than I assumed. But I also discovered strengths I'd undersold. Customer retention was higher than I realized. A segment I thought was small was actually growing fast. The word of mouth in a specific niche was stronger than any marketing I'd done. The acquisition didn't happen but the clarity was worth more than the offer. Highly recommend pretending someone wants to buy you and asking yourself the hard questions. You'll learn a lot. What would you discover if someone tried to acquire you?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1240,
    "downs": 0,
    "created_utc": 1766611133.0,
    "media": null,
    "is_video": false,
    "num_comments": 154,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.77,
    "category_rationale": "Reflective lessons on competition and business moat rather than steps.",
    "composite_score": 4.893937630583876
  },
  {
    "score": 1187,
    "title": "How I used Claude to validate my idea in 10 minutes (Now at $2.3k MRR)",
    "selftext": "A few months back I had like 12 different SaaS ideas scattered across Notion docs and honestly no clue which one people actually gave a shit about\n\nYou know the drill - everyone says \"talk to your users\" and \"validate first\" but like... where exactly are these mystical users hanging out? And what am I supposed to ask them without sounding like a weirdo with a survey\n\nDid what any rational developer would do - ignored the advice completely and just started building stuff\n\nBuilt two different projects. First one got exactly 3 signups. Second one never even made it past my localhost because I lost steam halfway through\n\nClassic mistake: I was building solutions to problems I had, not problems other people were willing to pay to solve\n\nThen I got curious about using AI differently. Not for idea generation (because that usually spits out generic nonsense) but for actual market research\n\n**Here's what I did:**\n\nOn Claude, I activated the research option and then prompt it to scrape through real user content - Reddit threads, Quora answers, G2 reviews, anywhere people complain about stuff. Told it to focus on one specific area: \"cold email personalization problems\"\n\nIt came back with this insane 3-page breakdown. Real quotes from sales people bitching about how their templates suck, how manual personalization takes forever, how their reply rates are trash\n\nThen I asked it to rate the opportunity 1-10 based on demand vs competition. Got an 8.5 with solid reasoning about why the market gap exists\n\nThat was enough validation for me to actually commit, cause the AI was mainly using the researched data as source of truth, not their knowlege :)\n\nBuilt Introwarm - you upload your prospect list and it generates personalized email openers by checking what they're posting, reacting to, sharing, etc. online\n\nSoft launched it without any fanfare. Got my first paid customer ($29) in week 2 after launch. Now sitting at $2.3k MRR and growing mostly through cold outreach (yes, using my own tool) and posting in communities like this\n\n**What actually worked:**\n\n* People are constantly venting online about their problems. That's free market research if you know where to look\n* AI can synthesize patterns way faster than manually reading through hundreds of complaints\n* You don't need perfect validation - just enough signal to know you're not completely delusional\n\nIf you're stuck between ideas, try this instead of endless brainstorming: find where your target users are already complaining and let them tell you what to build",
    "subreddit": "SaaS",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1187,
    "downs": 0,
    "created_utc": 1752175191.0,
    "media": null,
    "is_video": false,
    "num_comments": 213,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.68,
    "category_rationale": "Describes a repeatable idea-validation workflow using AI and market research.",
    "composite_score": 4.96002332731977
  },
  {
    "score": 1192,
    "title": "Sold 340 lifetime deals for $149 each. 18 months later I regret every one.",
    "selftext": "Needed cash to fund development. Ran a lifetime deal on AppSumo. $149 for lifetime access to a product I was charging $39/month for.Sold 340 deals in 2 weeks. $50,660 in revenue. Felt like winning the lottery.18 months later, here's the math:If those 340 customers paid monthly at even 50% of normal price ($19.50), with average 14-month retention, that's $92,820 in revenue.I left $42,000 on the table. And counting, because lifetime means forever.But the money isn't the worst part.LTD customers are my highest-support users. They submit 3x more tickets than monthly subscribers. They request features constantly. They leave 1-star reviews when I don't build what they want.They have zero incentive to churn, so they stick around complaining instead of quietly leaving.My NPS among LTD customers: 12. Among monthly subscribers: 54.And I can never raise prices on them. They're grandfathered at $0/month for life.What I'd do differently:If you need cash, offer annual plans at a discount. You get money upfront but customers still renew.If you must do LTDs, cap the number ruthlessly. 50 max. Create scarcity.Never offer lifetime on a product that has ongoing server costs. You're signing up to lose money on every user forever.The AppSumo crowd isn't your target market. They're deal hunters who buy everything and use nothing. Not ideal customers for feedback or growth.Still digging out of this hole.Anyone else have LTD regrets?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1192,
    "downs": 0,
    "created_utc": 1764693198.0,
    "media": null,
    "is_video": false,
    "num_comments": 368,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares regrets and actionable takeaways about LTDs rather than steps.",
    "composite_score": 5.072653626749872
  },
  {
    "score": 1153,
    "title": "New accountant literally laughed when he saw our payroll costs",
    "selftext": "I'm the operations manager at a 28 person startup. Last year the founders told me to pick a payroll provider for our international team (11 contractors across 5 countries)\n\nDid my research, went with one of the \"big names\" everyone talks about. $599/month per contractor seemed standard based on what i found. Been using them for 14 months, paying around $6,600/month\n\nWe just switched accountants and during onboarding he asked to see our major expenses. Gets to the payroll invoice and literally laughs out loud\n\n\"Who picked this?\"\n\nme: \"...i did\"\n\nhim: \"you're paying 3x market rate\"\n\nHe pulls up three of his other startup clients. one has 19 international contractors, pays $3,800/month. another has 24, pays $4,100/month\n\nI'm sitting there realizing i've cost the company like $30k over the past year by not knowing the actual market rates\n\nHe said \"payroll companies charge startups premium pricing because most have vc money and will just go with the first name they recognize\"\n\nNow i have to tell my CEO i've been burning $2,500/month because i didn't shop around enough",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1153,
    "downs": 0,
    "created_utc": 1765338796.0,
    "media": null,
    "is_video": false,
    "num_comments": 232,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Anecdotal payroll-cost mispricing story without actionable guidance.",
    "composite_score": 4.9583837693327215
  },
  {
    "score": 1083,
    "title": "Cofounder rage quit, forked the repo, and emailed our customers 😭",
    "selftext": "So yeah… my week hasn't started out great.\n\nMe and my cofounder (let’s call him \"Dave\", not his real name obv) started a B2B SaaS about 18 months ago. It’s been a grind but we actually hit some MRR that might get us semiprofitable soon.\n\nAnyway, last few weeks he’s been getting weird about \"ownership\". Keeps saying stuff like \"I feel like an employee in my own startup\". Which… idk, maybe sorta fair? He’s at 35% equity. But I’ve been the one doing all the fundraising, sales, ops, support, marketing, you name it.\n\nThis morning I wake up to 47 Slack messages. He rage quit last night, forked the entire repo to his personal GitHub, and sent an email to a few of our paying customers saying he’s the real founder and that he’s \"starting fresh without the baggage\". Then he deleted himself from our Slack.\n\nOur dev team is freaking out. Investors are texting me \"wtf happened?\" and I’m somewhere between panic and laughter at this point.\n\nAnyway, lawyers are now involved.. Has anyone else ever had a cofounder go nuclear like this? Is there any coming back from this, or is it just scorched earth and move on?\n\nPosting from a throwaway account here... sorry guys. I'm actually quite active on my regular account and I think I've seen a eerily similar story here a while back (an omen?) but I can't seem to find it anymore to see what the advice was.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1083,
    "downs": 0,
    "created_utc": 1765191868.0,
    "media": null,
    "is_video": false,
    "num_comments": 398,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Narrative rant about cofounder drama and not a how-to or model.",
    "composite_score": 5.040515730045742
  },
  {
    "score": 1074,
    "title": "Sold my first saas for 20 mil € and retiring (AMA)",
    "selftext": "The title speaks for itself. I've been a software developer for four years. In June, after visiting Google IO in Berlin, I came up with the idea of not just another service, or an agent for the sake of an agent, but a truly in-demand service (at least for me)\nTook a two-week vacation from my corporate, coded practically 24/7, then there was prod release, an advertising campaign on TikTok, constant bug fixing and adding features from comments on the same TikTok.\n\nFour months later, I have over 150,000 regular users, with excellent growth dynamics for new users and existing users upgrading to the Pro plan. And received an email from a huge(old) competitor about a full buyout of the app, including sources and me for a one-year contract.\n\nI agreed to be an advisor, signed the contract, and the first installment arrived today. To say it's a it career speedrun is an understatement :) my relatives don't know, gf non existent. So I'm waiting a year and then leavinf to live my best life.\n\nThere is no point in advertising anything anymore, so I will answer your questions as best I can.\n\nThe most important thing to know is that luck is, of course, very important, but the most important thing is your ideas.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 1074,
    "downs": 0,
    "created_utc": 1760403782.0,
    "media": null,
    "is_video": false,
    "num_comments": 529,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Personal success story with mention of key ideas; offers perspective rather than a concrete steps guide.",
    "composite_score": 4.978546399052019
  },
  {
    "score": 1078,
    "title": "My SaaS was used for p*rn and now it makes $3k/month",
    "selftext": "Hey everyone!\n\nAbout 1 year ago I launched [my app](https://usevoicy.com/) as a chrome extension on the Chrome Web Store.  \nIt quickly reached 1k free users within a month, and the usage was through the roof.\n\nI use the WhisperAPI and my costs went from 0 to $5-10 dollars per day. This wasn't sustainable for me of course, so I decided to monetize.  \nI wanted to know the ICP and the perfect use-cases, so I implemented a system that lets me know on which websites my app is being used.\n\n(I can't read any transcripts or see which user uses which website)\n\nTurns out - it was mostly used on AI girlfriend chats and weird websites where men are scammed by fake women.\n\nI originally built the app to help people who struggle with typing. Turns out if you're talking to your AI girlfriend, you only have 1 hand to type. FAIR ENOUGH HONESTLY\n\nSo I monetized it, and guess what - I only got signups from people using it for work and serious writing.\n\nAfter I introduced limits the p\\*rn usage dropped hard too.\n\nI posted this on reddit a while ago and people told me I should lean into it. But I decided not to do it.\n\nI blocked ALL scammy websites where people are being tricked, but I left the AI girlfriend pages available. I just didn't do anything about it.\n\nInstead, I focused on my paying users and their specific needs. They wanted to use my tool in Microsoft Word, ChatGPT, Google Docs, etc. So I created a landing page for each of these use-cases.  \nIf you go on my website you can see I have about 20 specific landing pages.\n\nSEO kicked in within weeks and started ramping up proper sales.  \nI also leaned in harder into the disability use case and offer 20% off for everyone who struggles with typing.  \nThis has been WAY more fulfilling than helping people c\\*m.\n\nNow I just closed my best month with [$3k in revenue](https://x.com/BuildingWaves/status/1973302398031368333) and a set of users who are really my perfect customer profile.\n\nNo lesson in here, but thought it would be fun to share!\n\n  \nEdit: Added [proof](https://x.com/BuildingWaves/status/1973302398031368333) because people were getting angry at me. ",
    "subreddit": "SaaS",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1078,
    "downs": 0,
    "created_utc": 1759514872.0,
    "media": null,
    "is_video": false,
    "num_comments": 184,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Story about monetization decisions and focus on value delivery; provides reasoning rather than a step-by-step process.",
    "composite_score": 4.901607308884418
  },
  {
    "score": 1025,
    "title": "I survived 2.5 years without a job by building a Chrome extension solo",
    "selftext": "2.5 years ago, I quit my job with no backup plan. Today, I'm making a living from a Chrome extension I built in my bedroom. Here's the raw, unfiltered story of how it happened:\n\n# Numbers, Because Reddit Loves Data\n\n* 👥 6000+ active users\n* 🌍 Paying customers from 45+ countries\n* ⭐ 4.7/5 stars on Chrome Web Store\n* 💰 $0 spent on marketing\n* 🕒 14-hour days, 7 days/week in the beginning\n* 📦 200+ updates shipped\n\n# The Journey\n\nIt started on a rooftop cafe in Delhi. I had just quit my job, was questioning all my life choices, and was brainstorming ideas with an old friend. That night, I had a simple thought: \"What if I build something that helps developers fix UI issues faster?\"\n\nNo market research. No fancy business plan. Just opened VS Code and started coding.\n\n# Reality Check Moments\n\n* Month 1-3: Lived off savings, coded 14 hours daily\n* Month 4: First launch on ProductHunt - got 200+ upvotes\n* Month 6: Extension went viral in Japan (97k views)\n* Month 7: Finally launched paid version - 8 sales first week\n* Month 8: Built a proper website - sales quadrupled\n* Month 25: Featured on Chrome Web Store (feels unreal)\n\n# Hard Truths Nobody Talks About\n\n* Spent countless nights debugging Chrome APIs\n* Lived with constant anxiety about running out of savings\n* Kept the extension free for 7 months while bleeding money\n* Still do everything solo - development, support, marketing\n* Turned down VC funding to keep full control\n\n# What Worked, Surprisingly\n\n1. Keeping it free longer than comfortable\n2. Obsessing over product quality and user feedback\n3. Shipping updates even when nobody asked\n4. ProductHunt launch as \"free and open-source\"\n\nIt's called [SuperDev Pro](https://superdevpro.com) \\- helps developers and designers fix UI issues 3x faster. If you're curious, you can check it out, but that's not why I'm posting. Just wanted to share that it's possible to survive (and eventually thrive) by building something useful, even if it seems small.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1025,
    "downs": 0,
    "created_utc": 1742304546.0,
    "media": null,
    "is_video": false,
    "num_comments": 345,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.8,
    "category_rationale": "Story with a list of four 'What Worked' items; primarily a travelogue with actionable tips.",
    "composite_score": 5.008185410172186
  },
  {
    "score": 1008,
    "title": "I raised $130M for my last startup, then walked away to build Base44 solo. In 6 months: $3.5M ARR, 300K+ users, no employees, fully bootstrapped. Then acquired by Wix for $80M. AMA. (Also giving away $3K in subscriptions.)",
    "selftext": "# Edit:\n\nHey everyone, thank you SO MUCH for your kind words and support!  \nIt was awesome hanging out with y’all.  \nThe AMA is over. I tried to answer as many questions as I could :)\n\nI’ll announce the winners ASAP!\n\n– Maor\n\n\n\n# Edit II: Giveaway winners\n\n1. I left a comment under your comment.   \n2. I'll dm you your personal coupon code.   \nPlease don't dm me, my inbox is already a mess right now, and I won't be able to respond.  \n3. The winners are final, and I can't change them no matter what.\n\nThank you again for participating, asking smart questions, and sharing your knowledge, I really appreciate you!\n\n# Most Upvotes (at the time I checked)\n\n1. u/winter-m00n\n2. u/BakerTheOptionMaker\n3. u/andupotorac\n4. u/hustlewithai\n5. u/Ok-War-9040\n6. u/InternationalLeg2121\n7. u/Batteryman212\n8. u/MixPuzzleheaded5003\n9. u/hedi455\n10. u/Moceannl\n\n# Zero upvotes/downvotes (at the time I checked)\n\n1. u/ethenhunt65\n2. u/zgdunn\n3. u/SuitableEdge618\n4. u/veeeti_\n5. u/Equivalent_Tea_2516\n6. u/klehfeh\n7. u/ThoughtContent1668\n8. u/_JohnWisdom\n9. u/Humble-Climate7956\n10. u/ParanoiaDreamland\n\n  \n\\---\n\n# Hey, I'm Maor :)\n\nIn 2021, I raised $130M for my previous startup, Explorium.\n\nSix months ago, I decided to leave and start from scratch.\n\nSo I built [base44.com](https://base44.com/) (r/base44)**.** It's an AI app builder that lets non-coders create apps without touching code, databases, or APIs.\n\nJust write a prompt, and a few minutes later, you’ve got a working app.\n\nI’ve been doing everything solo: from coding to marketing to customer support.\n\nAnd this week, Wix acquired Base44 for $80M. It still feels unreal.\n\nI'm sharing my journey transparently: revenue, tools, growth channels, so feel free to ask anything. Really excited to hang out with you guys!\n\n• [My LinkedIn profile](https://www.linkedin.com/feed/update/urn:li:activity:7341088575049891840/)\n\n• [Press article about the acquisition](https://www.calcalistech.com/ctechnews/article/s1iflnlelx)\n\n# Giveaway\n\nAlso, this subreddit has helped me a ton on my journey, so I wanted to give back a little.\n\nHere's the deal:\n\n* The 10 **most upvoted** comments will get a free 3-month subscription to Base44’s Pro plan (worth $300 each).\n* 10 random comments with ***zero*** upvotes or downvotes will also get a free 3-month subscription to the Pro plan (worth $300 each).\n\nHope this helps some of you build your own apps and prototypes :)\n\nI’ll announce the winners in 24 hours.\n\nI'll be answering questions for the next 24 hours.\n\nAnd I'll read every single comment and respond to as many as I can.\n\nLet’s do it!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1008,
    "downs": 0,
    "created_utc": 1750255344.0,
    "media": null,
    "is_video": false,
    "num_comments": 897,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Long AMA-style success story with acquisition details; mainly narrative with some engagement data.",
    "composite_score": 5.1705293345705625
  },
  {
    "score": 1001,
    "title": "I'm 3 years old and just sold my SaaS for $1.2B (here's what I learned)",
    "selftext": "Hey everyone. Tommy here. I'm 3.\n\nFour days ago I was watching cocomelon on my iPad when YouTube autoplay threw on a Dan Martell video. Something about \"buy back your time\" resonated with me - mostly because nap time was cutting into my block-stacking sessions.\n\nDan said something like \"find a problem, build a solution, scale it.\" I looked around my daycare and noticed a clear market gap: nobody was monitoring the structural integrity of our block towers. Silent failures everywhere. Millions in imaginary revenue at risk.\n\nSo I opened up Bubble (my fine motor skills aren't great yet, but I can drag and drop). Built \"BlockGuard\" - real-time monitoring for block tower stability with AI-powered collapse predictions. Integrated Stripe because that's what Dan said to do.\n\nLaunched on Product Hunt Tuesday morning (right after Paw Patrol). By Wednesday we hit $30M MRR. Thursday morning a16z called during snack time and offered $1.2B. I accepted because I wanted to get back to my blocks.\n\n**Here's what I learned:**\n\n1. **Solve real problems** \\- Block tower collapses were costing my peers valuable play time\n2. **Move fast** \\- The window between breakfast and morning nap is shorter than you think\n3. **Charge what you're worth** \\- I initially priced at $0.50/month (one fruit snack). Raised to $99/month. Nobody blinked.\n4. **AI is a moat** \\- Used Claude API to predict collapses 30 seconds before they happened. Game changer.\n5. **Compete on speed** \\- While other kids were still learning ABCs, I was learning ARR\n6. **Know when to exit** \\- $1.2B lets me buy a lot of goldfish crackers\n\n**The boring stuff:**\n\n* Tech stack: Bubble + Supabase + Claude API (couldn't figure out AWS, I'm only 3)\n* Customer acquisition: Posted in r/blocks, got 47 beta users\n* First revenue: 6 hours after launch\n* Used [FailureFinder.com](http://FailureFinder.com) to monitor my Zapier automations because even at $30M MRR, broken workflows will kill you\n\n**What's next:** Honestly? Probably fingerpainting. I'm diversifying into physical art because that's what all the successful founders do after an exit.\n\nHappy to answer questions, but I've got a juice box calling my name.\n\n\\- Tommy, 3",
    "subreddit": "SaaS",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1001,
    "downs": 0,
    "created_utc": 1761836129.0,
    "media": null,
    "is_video": false,
    "num_comments": 178,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Humorous post with a clear 'Here's what I learned' list of lessons.",
    "composite_score": 4.8322942370211734
  },
  {
    "score": 971,
    "title": "I HATE working with FAANG engineers in the early days of startups",
    "selftext": "Over the past years, I have managed 100+ engineers. Some of them came from Google, Facebook, Microsoft. Others came from failed startups, 3-person teams, and garage companies.\n\n**FAANG engineers think in terms of optimization.**  \n**Startup engineers think in terms of survival.**\n\nThese are completely different skill sets.\n\nA FAANG-style engineer thinks: **we should add proper caching, set up monitoring, and plan for horizontal scaling.**\n\nA startup-style engineer thinks: **let’s ship the feature today and see if anyone even wants it.**\n\nLet's say the client needed a simple login system for their MVP.\n\nThe FAANG engineer will spend **two weeks** building OAuth integration, password encryption, session management, and rate limiting.\n\nThe startup engineer used Firebase Auth and finished in **two hours.**\n\nBoth solutions work.  \n**One helps you raise funding.**  \n**The other might burn your runway.**\n\nFAANG engineers focus on **tomorrow’s challenges.** \n\n* What if we get a million users? \n* How do we handle traffic spikes? \n* What is our disaster recovery plan?\n\nStartup engineers focus on **today’s challenges.** \n\n* Will anyone even sign up? \n* Can we ship before the runway ends? \n* What is the fastest way to test the idea?\n\n**Here is the rule.**\n\nBefore product-market fit, **you need people who know how to survive.**  \nAfter product-market fit, **you need people who know how to scale.**\n\nHiring the wrong type of engineer at the wrong stage can destroy your startup.\n\nA three-person team does not need Google-level infrastructure.  \nIt needs to stay alive long enough to find product-market fit.\n\n**Build quickly. Ship even faster. Optimize later.**\n\nP.S. **I still love FAANG engineers.** They are just not the right fit on day one of a startup.We have more than a hundred startup-native engineers ready to help your team.\n\nP.P.S. - AI assisted with own thoughts.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 971,
    "downs": 0,
    "created_utc": 1765185266.0,
    "media": null,
    "is_video": false,
    "num_comments": 276,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Strong emotional vent about FAANG engineers; primarily rant.",
    "composite_score": 4.823906149458499
  },
  {
    "score": 863,
    "title": "How I hacked growth on Reddit to build a $1M SaaS",
    "selftext": "Hey fellow founders! I used Reddit to grow a million dollar saas, and wanted to share how I did it.\n\nNow that AI content is popping up everywhere, Reddit is imo one of the best ways to spend your time if you want to grow a SaaS. Also, head of growth at some of the fastest growing SaaS in the world like Deel also used Reddit. Why?\n\n(1) Google now promotes Reddit on the top of the SERP for ALOT of long tail search terms.\n\n(2) OpenAI, etc. train on Reddit data -&gt; so you will get generative search benefits too.\n\n(3) People go to Reddit to get honest and transparent advice on software to buy, etc. (and even search for \"keyword + Reddit\" on Google). They are tired of sponsored blog post and AI content.\n\nI've successfully used both comments and posts with over +1M views - to get a ton of demos and sign deals for my startup from Reddit. DMs do not work well from my experience.\n\nHere are 5 ways how to use Reddit for growing my SaaS:\n\n1. Find relevant subreddits: needs to (A) contain your ideal customer + (B) be large enough if you are creating posts (&gt;50K members).\n2. Become a contributor: start to build karma. I started out upvoting + commenting, and finally got into posting once I figured things out. Tailor your posts to the specific subreddits to be hyper relevant and bring value.\n3. Use an alert tool + build keyword list: Commenting on relevant posts that mention problems, question, and competitors in your space, is one of the most efficient ways to get leads. Finding those can either (A) be done manually, by searching on weekly basis using the built-in search bar), or (B) using an automized tool like f5bot (free). Build our keyword list out as you go.\n4. Creating viral posts: Posting can get you a crazy amount of views if you do things right - and put you (and your startup) in the center of the conversation. 4 types of posts that have worked well for me are (i) the relatable post (ii) the guide post (similar to this one) (iii) the conversation starter (iv) the story post.\n5. Buckle up, play by the rules, and shoot your shot: Aim to give 95% value, 5% plug your startup. No direct links, no spam, no corporate bs. Write like a human would. Be transparent, provide big value, and finally mention your startup. Either as a comment, or in the original post.\n\nGreat founders spend their time (a) talking to users (b) building. Reddit is awesome to do (a) - get conversations, feedback, and understand you target persona. So go out there, contribute, and build your saas.\n\nIf you are curious i put together a youtube video where i share screenshots and examples on all of this. let me know if you want the video link, have any questions - happy to answer and help out!\n\nEDIT: Didn't expect this to blow up! Seems a lot of people found this helpful. I've decided to turn this post into my first book(!) Transparently sharing my full playbook to growth hacking on Reddit. Check it out [here](https://growthhackingreddit.com/) if curious. Also linked my YT video there.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 863,
    "downs": 0,
    "created_utc": 1735646638.0,
    "media": null,
    "is_video": false,
    "num_comments": 203,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Five enumerated strategies to grow SaaS on Reddit; a practical list of tactics.",
    "composite_score": 4.781328826191843
  },
  {
    "score": 862,
    "title": "I ran $2200 worth of paid ads (no prior experience). This is what I learnt.",
    "selftext": "Hey everyone, I spent the last week doing paid ads to grow my app to 10K users.I’ve never (seriously) done paid ads before so everything’s new to me. Here’s what I did &amp; learned:\n\n1. **(Didn’t work) Google Ads:** I started off with Google Ads after randomly finding a coupon for $600 more if you spend $600. I set up a performance max campaign with a budget of $10/day. I got a CPC for $0.05! I tried creating a second campaign with different keywords, targeting and it went to $4.50 CPC (spent $50 total). Ended up shutting down these campaigns. The most annoying thing? They show you conversion data after a day. I was running a $10 campaign, saw nothing was happening so I bumped it up and turns out the next day it ws running and it had a $7 CPC. Insane!\n   1. I think that ad coupon was a trap because you start overspending just to get the additional money which is bad.\n2. **(Worked the best) Meta Ads:** I set up Meta ads for only Desktop because my app doesn’t work on Mobile. The biggest issue with Meta is that it has a lot of surfaces and if you upload an image, it will show them on all those surfaces but the sizing will be off so it looks ugly. Instead I went to Canva and created a different image size for each surface, starting with a 1:1 because it’s easy to crop for other dimensions.\n   1. The targeting settings were superb in Facebook. I saw in my app analytics that most of my customers are from US, Brazil, Philippines and Mexico so I created a campaign for:\n      1. Social media agencies in each of those countries\n      2. Ghostwriters in each of those countries\n      3. Everybody in US\n   2. For US the CPC was $1.50 but I saw that for other countries, it was as low as $0.35 so I turned off the US and increased the spent to others. Eventually the CPC came down to 2 cents which was incredible.\n3. **(Didn’t work)** **Tiktok Ads:** I should have spent a little more time on Tiktok ads but I wasn’t fully convinced they would work. I literally just boosted [an existing Tiktok video](https://www.tiktok.com/@thisissukh_/video/7443990792160546103) I had recorded for $5/day. It did get more views but nothing much on the conversions. I think you would want to spend more time creating a lot of videos, see the ones that work and then boost those vs. taking a bad video and boosting it.\n4. **(Waste of money) Reddit Ads:** I think Reddit has the best UI for ads (Good lord others are bad) but I think COULD NOT use it because the ads stayed in “Review mode” for a whole week and never ran. I even messaged support, no help. The good thing about Reddit is that you can 1-click import your Meta ads which is nice.\n5. **(Worked decently) Newsletter Ads:** I found a bunch of AI/Design newsletters varying from 50K to 300K subscribers. Of course they give you a huge burst of traffic when they go out and then immediately die out. I like newsletters because they are quick and you can get a more higher quality user over social media ads (which could be anyone). That being said, the link click conversions are generally 1-2% I’ve seen. One good thing I found is that newsletter operators are very open to price negotiation. You can generally get $100 discount if you ask the right way. Also, it’s helpful to organize your assets, copy prior to in a [Google Doc like this](https://docs.google.com/document/d/1KYvVlShqyqrJ3hAbiYr7WM0u1bfAzOPiFg1LxLSnDYM/edit?tab=t.0). If you don’t do this, they will just write the copy themselves with ChatGPT and it’s generally awful.\n\nHopefully this helps someone here!\n\n\\----  \nEdit: Holy shit this blew up! [I'm building a tool to help you build a personal brand.](https://engyne.ai?utm_source=reddit-post)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 862,
    "downs": 0,
    "created_utc": 1744147751.0,
    "media": null,
    "is_video": false,
    "num_comments": 174,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.8,
    "category_rationale": "Sequential ad experiments with what worked/what didn’t; a reproducible set of steps.",
    "composite_score": 4.785029820058357
  },
  {
    "score": 849,
    "title": "Sold my math solver for $30k after building it in a week",
    "selftext": "When o4-mini came out, I noticed it was really good at solving math problems. Way better than most paid apps.\n\nSo I spent a week building a simple tool with cursor. You take a photo of a math problem, it solves it with steps and shows the formulas nicely with latex. focused on high school math since that's what most students struggle with.\n\nlaunched it through a friend who has like 3k followers on instagram (education content). He posted one story about it.\n\nGot around 1000 users in 4 months, about 100 using it daily. Kept it completely free to get more users.\n\nThen this startup that makes math problems for textbooks reached out. They wanted to buy it to check their content quality. Offered $30k for everything.\n\nSeemed like good money for a week of work so I sold it.\n\nNow I'm working on something where I can build these micro saas tools really fast (like 30 mins with claude code) and split revenue with whoever has the idea. Already made a few small ones that are making $150-300/month each.\n\nIf you have some annoying problem that needs solving, comment or dm me. Especially interested in boring niche stuff.\n\nHonestly with how good AI coding is now, what took me a week could probably be done in a few hours.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 849,
    "downs": 0,
    "created_utc": 1754599572.0,
    "media": null,
    "is_video": false,
    "num_comments": 168,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Narrative about building and selling a math solver; includes lessons but not a formal how-to.",
    "composite_score": 4.69586227802113
  },
  {
    "score": 836,
    "title": "Quit my job, built a Chrome extension, now have paid customers from 40+ countries",
    "selftext": "Hi guys 👋, I am Choudhary Abdullah, and I have been building a Chrome extension that helps developers and designers fix UI issues on any website 3x faster for the past 30 months. After months of hesitation, I have decided to share my story, which grew from a random idea to replacing my 9-5 job.\n\n# Numbers for the Curious\n\n\\- 🚀 Solo developer, fully bootstrapped\n\n\\- ⭐ 4.7 stars on Chrome Web Store\n\n\\- 👥 6000+ active users\n\n\\- 🌍 Paid customers from 46 countries\n\n\\- 📦 Shipping 2-3 updates monthly\n\n# The Beginning\n\nI was sitting with an old friend on a warm and bright June evening in 2022, having quit my job a few months earlier. We spent hours brainstorming product ideas, but nothing clicked. That night, I had this simple thought: what if I built an all-in-one browser extension for developers and designers? No market research, no fancy business plan – I just opened VS Code and started coding.\n\n# The Building Journey\n\n\\- **Month 1-3**: Spent 14 hours/day coding, 7 days/week 😬\n\n\\- **Month 4**: Launched on ProductHunt (200+ upvotes, 45+ comments)\n\n\\- **Month 6**: [Tweet](https://twitter.com/colisscom/status/1605723979737485312) went viral in Japan (96k views, 1000s of installs)\n\n\\- **Month 7**: Launched the paid version, got 8 sales in the first week 😺\n\n\\- **Month 8**: Built a proper website that increased sales by 4x\n\n\\- **Month 9-24**: Kept improving the extension based on user feedback\n\n\\- **Month 25**: Hit 6000+ users, got featured on Chrome Web Store 🎉\n\n\\- **Month 29**: Now have paid customers from 46 countries\n\n# Key Lessons Learned\n\n\\- Create an easy-to-use painkiller product and design it well\n\n\\- Launch on ProductHunt, BetaList, and more to gain visibility\n\n\\- Keep it free as long as possible to gain enough users 😬\n\n\\- Get customer feedback and ship fixes and new features\n\n\\- Launch the paid version after gaining enough users\n\n\\- Do marketing: SEO, Cold Emails, Ads, Affiliates and more\n\nStill building solo and still shipping features every month. The goal is to build something that helps developers and designers build beautiful websites faster while replacing my 9-5 job.\n\nThe extension: [SuperDev Pro](https://superdevpro.com)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 836,
    "downs": 0,
    "created_utc": 1732463583.0,
    "media": null,
    "is_video": false,
    "num_comments": 224,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Personal story with key lessons/insights about bootstrapping and launching a Chrome extension.",
    "composite_score": 4.826316717048941
  },
  {
    "score": 840,
    "title": "This will hurt every founder's ego. But it works.",
    "selftext": "This guy built 5 boring apps and makes $200k/month. \n\nMeet Mike from Australia. Zero VC funding. Smallest team possible. Five SaaS apps.  \n  \nHis secret? He refuses to build anything new.  \n  \nHis exact words:  \n  \n\"Pick an idea that's been done before. New ideas are risky.\"  \n  \nWhile you're trying to disrupt industries, he's copying what works and doing it better.  \n  \n\\- Social media aggregator.   \n\\- Customer feedback tool.   \n\\- Digital signage.   \n\\- Onboarding tours.  \n  \nBoring? Yes.  \nProfitable? $200k/month.  \n  \nHere's his brutal rule:  \n\"We will NEVER go after an AI-focused business.\"\n\n* No platform risk.  \n* No dependence on APIs he doesn't control.  \n* No praying OpenAI doesn't kill his business overnight. \n* Just boring, profitable software.  \n\nHis 10-step playbook is stupidly simple:\n\n* Copy an idea that already works\n* Build basic MVP\n* Sell lifetime deals for $59-100\n* Raise $100k from LTDs (pre-revenue)\n* Use that cash to write SEO content for 2 years\n* Launch on AppSumo\n* Get reviews on G2/TrustPilot\n* Switch to MRR\n* Print money \n\nHe's done this 3 times. About to do it twice more.  \n  \nZero failures.  \n  \nMeanwhile, you're:  \n  \n\\- Pitching VCs on \"the Uber of X\"  \n\\- Building features nobody asked for  \n\\- Chasing trends that'll be dead in 6 months  \n\\- Wondering why you're still at $0 MRR  \n  \nThe uncomfortable truth?  \n  \nBoring wins. Copying wins. Execution wins.  \n  \nYour \"revolutionary idea\" loses.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 840,
    "downs": 0,
    "created_utc": 1765295687.0,
    "media": null,
    "is_video": false,
    "num_comments": 195,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Explicit 10-step playbook for copying proven ideas and building SaaS; actionable sequence.",
    "composite_score": 4.7309240314761505
  },
  {
    "score": 820,
    "title": "Building SaaS in 2025? My best advice",
    "selftext": "* Offer Google login. Most users won’t bother creating an account otherwise.\n* Forget free trials, charge from day one. Paid users = serious users.\n* Post-launch is 80% marketing, 20% product. Launching isn’t the end.\n* Market shamelessly. Talk about your product everywhere, not just where it's “safe.”\n* Respect the unsubscribers. They’re giving you honest feedback.\n* Use your own product often. That’s how you catch real problems.\n* Retention &gt; acquisition. 70% of revenue often comes from existing users.\n* Your MVP should only have the must-haves. Stick to MoSCoW.\n* Don’t settle for $10k/month if you could do $100k. Think bigger.\n* f it’s not making money, it might be time to move on.\n* Your landing page should feel Clean. Fast. Convincing.\n* Talk to your users. DM them. Email them. Call them.\n* Price based on value, not competition.  \n\nMost SaaS founders don’t fail because of bad ideas.  \n\nThey fail because they give up too early. 90% are gone in 2 years.  \n\nStay in the game!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 820,
    "downs": 0,
    "created_utc": 1751446991.0,
    "media": null,
    "is_video": false,
    "num_comments": 202,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Collection of SaaS advice tips presented as bullet points.",
    "composite_score": 4.810591176076047
  },
  {
    "score": 812,
    "title": "I raised $2.5M ten years ago. Here's what I learned after burning through it all.",
    "selftext": "Back in 2015, I was part of a team that raised $2.5M to build a home decoration community app in China. We were ex-Tencent/Baidu folks (think Google/Facebook equivalents) riding high on the government's \"Mass Entrepreneurship\" wave. That money felt like validation that we were the next big thing.\n\nSpoiler alert: we weren't.\n\n# We built a content machine that users loved but wouldn't pay for\n\nOur strategy seemed bulletproof: create amazing home renovation content to capture users early in their journey. We executed flawlessly too - tens of thousands of followers on Zhihu (Chinese Quora), hundreds of thousands on WeChat, and one article hit 2 million reads during Beijing's smog crisis.\n\nUsers were sending us product samples daily for reviews. Our community was buzzing with requests for buying guides. Everything looked perfect.\n\n**Then we discovered the cruel truth: the more expert our users became, the less they wanted to buy anything.**\n\nThese weren't customers - they were students. They'd consume our in-depth guides, become super knowledgeable, then go DIY everything or hunt for the cheapest options themselves. We accidentally created the most informed, price-sensitive user base possible.\n\n# The $2.5M started evaporating fast\n\nVCs wanted to see app metrics, so we burned cash trying to push our social media audience to download our standalone app.\n\nConversion was brutal. Why would someone download an app for content they were already getting on platforms they used daily? Our acquisition costs skyrocketed to $0.8-1 per user while retention stayed terrible.\n\nHere's the kicker: home decoration is inherently low-frequency. People renovate every few years, not daily. But we were burning runway chasing DAU like we were building TikTok.\n\n# The wake-up call that came too late\n\nDuring Singles Day (Chinese Black Friday), we threw together a quick \"insider deals\" spreadsheet that made us $15k in affiliate commissions in one day. But users weren't buying any of the heavy renovation stuff we spent months creating content about. They bought decorative items, soft furnishings, simple stuff.\n\nThat's when it hit us: **we'd been solving the wrong problem with the wrong business model entirely.**\n\n# What killed us in the end\n\nThe team split on strategy. Half wanted to raise Series A and build a full marketplace. The other half (including me) wanted to focus on monetizing what was already working on existing platforms.\n\nWe spent months arguing instead of pivoting. When the money ran out, so did our runway to figure it out.\n\n# The brutal $2.5M lessons\n\n1. **Funding isn't validation - paying customers are.** We mistook investor confidence for market validation. Big mistake.\n2. **User love ≠ business model.** Millions of engaged users mean nothing if they won't open their wallets.\n3. **Don't fight platform gravity.** We should have stayed on WeChat/social media and monetized there instead of forcing expensive app downloads.\n4. **Low frequency is low frequency.** No amount of great content changes how often people renovate. Work with reality, not against it.\n5. **Team alignment on business fundamentals is non-negotiable.** You can disagree on tactics, but if you can't agree on what success looks like, you're dead.\n\nThe hardest part? We had all the pieces to build a profitable business, but we got seduced by the \"scale first, monetize later\" playbook that doesn't work when you're not Facebook.\n\n**If I could do it again:** Skip the app entirely, stay in existing ecosystems, focus on the soft furnishing angle from day one, and prioritize revenue over vanity metrics from week one.\n\nThat $2.5M could have built a sustainable business if we'd focused on solving real problems instead of impressing investors.\n\n**TL;DR: Raised $2.5M, built a beloved product that couldn't make money because we optimized for funding rounds instead of customers. Expensive lesson.**\n\nEdit: Seeing similar patterns now with AI startups. Tons of funding, demo videos, and trial users, but where's the sustainable revenue? History rhymes.\n\nAfter this trip, I joined a global tool matrix startup, gained more experiences of success and failure, and also updated on Reddit. You can check it in the link below:\n\n[My Video Chat App Hit $3K Daily Revenue – Here's Why I Shut It Down](https://www.reddit.com/r/SaaS/comments/1llhg1l/my_video_chat_app_hit_3k_daily_revenue_heres_why/)\n\n[I Tested AI Agents vs Workflows on Real Users – The Results Will Surprise SaaS Founders](https://www.reddit.com/r/AI_Agents/comments/1lnaliw/i_tested_ai_agents_vs_workflows_on_real_users_the/)\n\n[Eight Months into My SAAS Startup: I'm Starting to Doubt 'Build in Public'](https://www.reddit.com/r/SaaS/comments/1lqorc1/eight_months_into_my_saas_startup_im_starting_to/)\n\n[I raised $2.5M ten years ago. Here's what I learned after burning through it all.](https://www.reddit.com/r/SaaS/comments/1ljtkzt/i_raised_25m_ten_years_ago_heres_what_i_learned/)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 812,
    "downs": 0,
    "created_utc": 1750816795.0,
    "media": null,
    "is_video": false,
    "num_comments": 138,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Narrative with lessons learned from funding experience; analytical insights.",
    "composite_score": 4.716597945721116
  },
  {
    "score": 778,
    "title": "10 Dead Simple SaaS Features That Users Go Crazy For",
    "selftext": "After 6+ years building SaaS products as a freelancer, here are the stupidly simple features that always get the best user feedback. Nothing fancy, just stuff that works.\n\n-  One click templates - Add a \"Copy this example\" button that pre-fills workspaces. Users hate empty dashboards. Takes 30 minutes to code, doubles engagement.\n\n\n-  Progress animations - Little checkmarks and loading spins so users know their stuff saved. Cuts support tickets by 20% because people can see it worked.\n\n\n-  Smart welcome messages - \"Hey [Name], welcome back to [Company]\" on login. Users call it premium. Takes an hour, feels personal.\n\n\n-  Google/Apple login - Skip the long signup forms. Email + social login bumps conversions 30-40%. Less friction equals more users.\n\n\n-  Quick win onboarding - \"Set up your first project in 60 seconds\" flows with templates. Gets users to success fast instead of staring at blank screens.\n\n\n-  Undo buttons everywhere - Let users reverse mistakes without calling support. \"Restore deleted\" or \"Undo last action\" saves tons of headaches.\n\n\n-  Keyboard shortcuts - Add common shortcuts like Ctrl+S or Ctrl+Z. Power users love feeling efficient, spreads by word of mouth.\n\n\n-  Auto-save everything - Save drafts automatically every few seconds. Users never lose work, builds massive trust in your app.\n\n\n-  Smart defaults - Pre-fill forms with sensible options instead of empty fields. Reduces decision fatigue, gets users moving faster.\n\n\n-  Status indicators - Show \"Online,\" \"Syncing,\" or \"Last saved 2 minutes ago.\" Users want to know what's happening without guessing.\n\n\nEach of these takes a day or less to build but gets mentioned in reviews constantly.\n\nIf you are looking to get your perfect SaaS built. Hit me up!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 778,
    "downs": 0,
    "created_utc": 1752243046.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Ten bullet-point features that users go crazy for.",
    "composite_score": 4.622899260316988
  },
  {
    "score": 761,
    "title": "Software devs don’t realize the magic they wield.",
    "selftext": "For weeks we tried to sell a customer our CRM solution, and for weeks they pushed back.\n\nUntil I realized what they were scared of.\n\nSo I asked for their spreadsheet, wrote a script and loaded 10,000 rows into our database.\n\nDone.\n\nThey were in disbelief, they thought they'd spend a month manually entering data. They thought they'd have to dedicate half the team to it.\n\nWe did it in 30 min, spent another 30 min verifying, barely one morning.\n\nMagic.\n\nHappy Friday everyone, time for beer.\n\n---\n\nNeed scripts and automation for data migrations\n\nor want to import from google drive/3rd party data sources into your LLM models?\n\nspacestationlabs.ltd",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 761,
    "downs": 0,
    "created_utc": 1698440255.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.45,
    "category_rationale": "Very short anecdote; not a clear category, mostly a quick anecdote with a question.",
    "composite_score": 4.647228452035866
  },
  {
    "score": 763,
    "title": "Bootstrapped a tiny SaaS and finally sold (feels unreal)",
    "selftext": "I bootstrapped a tiny SaaS, and last week I sold it, real numbers, what worked, what didn't\n\n**TL;DR:** Built a feedback widget SaaS, grew it to **$8,200 MRR** in **14 months**, sold for **$285,000**.\n\n**The backstory**\n\nStarted because every feedback tool was overengineered. I needed something that took 5 seconds to set up, not another Zendesk. Weekend build in Next.js + Supabase, charged $29/mo from day one.\n\nFirst 60 days: 312 signups, 18 paying. Found customers by answering questions in r/SaaS and indie hacker Discord servers. Cold emailed maybe 50 people who complained about feedback tools on Twitter.\n\n**Numbers at exit**\n\n* **Revenue:** $8,200/mo\n* **Expenses:** \\~$1,400/mo (hosting $340, Stripe fees $250, VA $800)\n* **Profit:** \\~$6,800/mo\n* **Customers:** 283 paying\n* **Churn:** 3% monthly\n* **Tech:** Next.js, Postgres, BullMQ, hosted on Vercel + Railway\n\n**What worked**\n\n* **Killed features aggressively.** Had analytics, team seats, custom branding. Deleted everything except the core widget. Activation rate went from 24% to 61%.\n* **One price, no tiers.** Moved from $29 to $79/mo. Lost some customers but profit went up.\n* **Posted revenue publicly.** Every month on Twitter. July's post got 400 likes and 3 acquisition inquiries.\n\n**What didn't**\n\n* Spent 6 weeks on SSO for an enterprise lead. They ghosted after demo.\n* Facebook ads at $3k MRR. Burned $2k, got 4 customers who all churned.\n* Rewrote my perfectly fine cron jobs in Temporal. Took a weekend, changed nothing for users.\n\n**The exit**\n\n* **Buyer:** Solo PE guy who owns 5 other micro-SaaS. Found me through Twitter.\n* **Due diligence:** 2 weeks. Stripe exports, P&amp;L, code walkthrough on Zoom.\n* **Price:** $285,000 (2.9x annual revenue)\n* **Terms:** 85% at close, 15% after 6 months if churn stays under 5%\n* **Transition:** 12 weeks, 6 hours/week, $150/hr\n\nSold because I was facing the \"hire someone or stay small\" decision. I like building new things more than scaling existing ones.\n\n**Key lessons**\n\n1. Keep a clean P&amp;L from day one. Buyers care more about boring spreadsheets than your tech stack.\n2. Distribution &gt; product. My competitor had better features but I answered every Reddit question.\n3. Charge more. Nobody who paid $29 complained when I raised to $79.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 763,
    "downs": 0,
    "created_utc": 1754876807.0,
    "media": null,
    "is_video": false,
    "num_comments": 223,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Story of bootstrapped SaaS sale with lessons; informative insights.",
    "composite_score": 4.793217367742772
  },
  {
    "score": 741,
    "title": "Removed a feature that 340 people used. Got 6 angry emails. Best decision I made this year.",
    "selftext": "Had a feature that was a nightmare to maintain. Built it 3 years ago. Codebase spaghetti. Every update risked breaking it.\n340 monthly active users. About 8% of my customer base.\nSpent 12+ hours/month just keeping it working. Couldn't improve it without rewriting from scratch.\nFinally decided: kill it.\nThe process:\nAnnounced 60 days in advance. Put together a simple Gamma doc explaining what was changing and why. Linked it in the email so people could actually see the reasoning, not just read corporate speak.\nReached out personally to the heaviest users. Recorded quick Trupeer videos for the top 15 showing them workarounds and alternatives. Took maybe 2 hours total but made them feel heard.\nProvided export tools so nobody lost their data.\nKept it running in read-only mode for 30 days after cutoff.\nThe response:\nAngry emails: 6\nCustomers who churned because of it: 4\nCustomers who said \"honestly I barely used it anyway\": 23\nCustomers who said nothing: everyone else\nWhat I got back:\n12 hours/month of maintenance time eliminated.\nEntire section of codebase deleted. Simpler architecture.\nMental load reduced. No more dreading the weekly \"is it broken again\" check.\nFreedom to build new things instead of maintaining old things.\nThe math:\nLost: 4 customers × $67 average = $268/month\nGained: 12 hours × my time value = way more than $268/month\nPlus the new features I shipped with that time drove more revenue than the lost customers.\nSometimes addition by subtraction is real.\nNot every feature deserves to live forever. Some need to die so the product can grow.\nHave you ever killed a feature?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 741,
    "downs": 0,
    "created_utc": 1766036952.0,
    "media": null,
    "is_video": false,
    "num_comments": 126,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Step-by-step process for removing a feature with communication plan and migration.",
    "composite_score": 4.597305765757005
  },
  {
    "score": 728,
    "title": "My app makes $14k/mo and I haven’t told my family",
    "selftext": "Hi guys, 1 year ago I launched [this app](https://buildpad.io) focused on product development that I had been working really hard on.\n\nIt started out with me just being annoyed by trying to build stuff with ChatGPT so I created a solution I thought was better.\n\nIt got some traction but nothing huge, around 3 months in it was doing $1k/mo. I talked to my family about it and they were supportive of course but as you can imagine not super impressed. You know how it is.\n\nAnyway, I’ve been grinding for another 8 months now and have made some good product decisions, gotten feedback from customers, and shaped up my marketing. I don’t know what happened this summer but I got busy as heck and now I just closed August at $14k/mo. It’s kinda hitting me now that I’m actually making really good money and I haven’t told my family or anyone.\n\nI was waiting for this moment for months and now that it’s finally here I don’t know if it’s even time yet…\n\nShould I tell them? How much do you share with your friends and family?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 728,
    "downs": 0,
    "created_utc": 1757413016.0,
    "media": null,
    "is_video": false,
    "num_comments": 394,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Personal milestone story and question; lacks structure/teaching model.",
    "composite_score": 4.791026076131205
  },
  {
    "score": 704,
    "title": "I'm a sperm cell and just hit 20k MRR",
    "selftext": "It was simple. I asked customers what their pain points were.\n\nI sold before I built anything. None of my customers had any concerns handing me hundreds and thousands of dollars even though I'm pretty young, I have nothing to show, no reputation, and I'm obviously not technical.\n\nI then vibe coded a solution in a couple hours. Posted a TikTok on how even I was able to achieve success in 2025. Shit went viral and here we are.\n\nYou guys are over complicating things. Just get out there and follow this advice.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 704,
    "downs": 0,
    "created_utc": 1755760464.0,
    "media": null,
    "is_video": false,
    "num_comments": 136,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Personal anecdote with a mental model (validate by selling before building) and simple advice.",
    "composite_score": 4.539049400569602
  },
  {
    "score": 680,
    "title": "I've built 30+ MVPs. The founders who succeed are the ones you'd probably hate.",
    "selftext": "I've been the hired gun for dozens of founders over the years. I've seen who makes it and who burns out.\n\nAnd honestly? The ones who win are usually doing things that \"SaaS Twitter\" would scream at them for.\n\nHere is the controversial stuff I see the winners doing while everyone else is busy polishing their landing page.\n\n**1. They are \"technically\" incompetent (and proud of it)**\n\nThe worst founders I work with are the ones who know a little bit of code. They micromanage the stack. They argue about React vs. Vue. They want to know why I'm not using the latest Vercel feature.\n\nThe winners? They don't care.\n\nThey ask me: \"Can you build this by Friday?\"\nI say yes.\nThey say: \"Great. I'm going to go sell it.\"\n\nThey treat technology as a utility bill. They pay it, it works, they move on. They spend 100% of their brain power on sales, not on architecture diagrams.\n\n**2. They ignore \"scalability\" until it's actually on fire**\n\nI had a client whose backend was literally a single massive Python script running on a $5 DigitalOcean droplet. It was hideous. It crashed once a week.\n\nHe scaled that thing to $30k MRR before he let me refactor it.\n\nWhy? Because rewriting code doesn't make money. Selling makes money.\n\nMost of you are building for 100,000 users when you don't even have 10. The winners build for 10 users, let the server catch fire at 100, and then pay me to fix it with the money they made.\n\n**3. They are annoying**\n\nThe successful founders are the ones who text me at 8 PM on a Tuesday saying \"I just promised a customer this feature, can we hack it together by tomorrow?\"\n\nIt's annoying for me as a dev. But it works.\n\nThey aren't building a product roadmap for next year. They are closing the deal in front of them right now. They force the product to evolve based on real cash, not hypothetical user personas.\n\n**4. They don't have a \"vision\"**\n\nThe founders who fail always pitch me a \"platform.\" They want to be the \"OS for X.\"\n\nThe founders who win pitch me a tool. \"I want to make it easier for dentists to send appointment reminders.\"\n\nThat's it. No ecosystem. No API marketplace. Just a tool that does one boring thing and charges $50/month.\n\nThey don't try to change the world. They try to solve a minor inconvenience for a specific group of people with money.\n\n**5. They launch embarrassing products**\n\nIf you aren't ashamed of your MVP, you launched too late.\n\nI've launched products for clients that still had \"Lorem Ipsum\" on the about page. Buttons that didn't work. Mobile layouts that were broken.\n\nAnd people still bought them. Because the core utility was valuable enough that users forgave the jank.\n\nIf you are waiting for perfection, you are just procrastinating.\n\n**The hard truth**\n\nWe like to think SaaS success is about building a beautiful, scalable, well-architected software product.\n\nIt's not. It's about selling a solution to a problem.\n\nThe code is just the delivery mechanism. The sooner you treat it like a commodity and focus on the business, the sooner you'll actually make money.\n\nRoast me if you want, but this is what I've seen work.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 680,
    "downs": 0,
    "created_utc": 1765705445.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Post presents a numbered/bulleted set of founder traits that readers can skim.",
    "composite_score": 4.588711129751904
  },
  {
    "score": 688,
    "title": "I built an app and had no clue what I was doing and it’s now making me thousands…",
    "selftext": "Late 2023, I was sitting alone at 3 AM, staring at my laptop screen, feeling totally lost. I’d spent six exhausting months trying to build my first mobile app—an ambitious finance app—and it didn’t even pass TestFlight. Nothing worked. Not a single feature. The frustration was crushing.\n\nI quit completely that night for two whole months, genuinely believing maybe I just wasn’t cut out for app development. But deep down, I couldn’t let the dream die.\n\nEarly in 2024, I decided to try again. No team, no co-founder—just late-night coding sessions after my 9-5(sometime till the next morning-very unhealthy), fuelled by determination and just being locked in. Initially, I wasn’t even sure what exactly I was building—I just knew quitting wasn’t an option. I ended up building an fitness app that I had designed and wanted to build years prior, the app honestly wasn’t anything crazy and the fitness niche is so saturated but it was something I built and I was happy it worked and I was sooooo proud of it. I iterated for months (literally made an update everyday for like 6-months straight), I tried my best to make it better one day at a time for over a year with no results. I did not make any crazy money or get crazy amounts of downloads but I worked soooo hard on it haha\n\nFast forward to now:\n\n- [My app](https://trainaiapp.com), exploded organically, surpassing 30,000 downloads in just two months.\n- Revenue reached $1.3k in the last 28 days alone—it’s not millions, but it’s undeniable proof that my efforts are finally paying off.\n- The app’s YouTube channel earns $1-2k per month. (given that this channel is to market the app lol )\n- Social media blew up, surpassing [85,000 followers on Instagram](https://www.instagram.com/trainai.info?igsh=eDNsNGxtcGw5Zm8y&amp;utm_source=qr), with TikToks growth rapidly increasing.\n- Two major influencers reached out, offering to market my app—for FREE(I still can’t believe this given influencer marketing is expensive).  \n\nIt feels surreal sharing this because just twelve months ago, I was doubting myself daily, grinding alone, barely sleeping, and constantly questioning whether I was wasting my time. (Still doing the same today 🤣)\n\nAlthough things are growing fast I still have alot of work and learning to do. (Improve the landing page, apps ui/ux, and so on)\n\nHere’s my biggest lesson:\n- No one can ever take-way the experience and feeling you get from working really hard on something.(No hard work goes unpaid)\n\n- Don’t be scared to charge what you want, how you want.(I was so scared of charging that I literally made my app free for months, “cause my app was not where I wanted it to be yet”)\n\n- On-boarding flow is very very very very (you get the point) important!\n\n- The difference between making zero dollars and thousands isn’t always about having the most skills or resources—sometimes, it’s just refusing to quit when everything seems hopeless. \n\n- Get help if you need it, don’t be scared to hire freelancers if you have to, consult if you need to, and most importantly trust the process.\n\nTo anyone out there right now who’s exhausted, discouraged, and building alone:\n\nKeep going. You’re closer than you think.\n\nMy next big milestone? 5-10k MRR. Until then, back to work.\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 688,
    "downs": 0,
    "created_utc": 1743804210.0,
    "media": null,
    "is_video": false,
    "num_comments": 293,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.75,
    "category_rationale": "Personal narrative with a central lesson about perseverance and building an app.",
    "composite_score": 4.7398928871137045
  },
  {
    "score": 654,
    "title": "I just sold my first-ever startup, Summify, for $30,000!!",
    "selftext": "Hey indie hackers, Ray here.\n\nYou might saw my other posts, actually this was my first post here: [I made a Youtube Video Summarizer app, what do you think?](https://www.reddit.com/r/SaaS/comments/16yorxi/i_made_a_ai_powered_youtube_video_summarizer_app/)\n\nSummify started as my weekend project last October. I only knew how to code and nothing else. But I wanted to be a solopreneur.\n\nThe journey was long and hard, but the lessons I learned were invaluable.\n\nThe Beginning  \nI didn’t do any validation ( I didn't know even what is validation )  \nI built Summify because I needed it myself - **Scratching my own itch.**\n\n**I just built it and ship it** and posted it on Reddit hope for the best.\n\nThree days after launching, **I sold my first subscription** This was a good sign that people wanted my product.\n\nBut I quickly learned that knowing how to code wasn’t enough at all.\n\nI had no marketing skills.  \nWhat are feedback channels?  \nShould I reply to all emails?  \nHow do I deal with angry customers?  \nChurn rate? what is it?  \nHow do I set up ads?  \nWhere can I find customers?  \nAnd so much more…\n\nI soon realized I had a lot to learn. I started reading articles, founder stories, technical documents and so many other things to learn all the basic details of how to do what.\n\nI went with trial and error approach, Just read and test live in production with live users.\n\nEvery experience taught me something new, especially **What I should not do.**\n\n**It took Summify three months to reach $500 MRR**. It might have been slow growth, but I didn’t mind. I was happy even making $5 MRR because I was learning so much.\n\nAfter eight months, Summify hit $2,500 MRR and then settled around $1,500 MRR.  \nThe End  \n**11 months later:**  \n**Over 15 million minutes summarized for 29,000 users.**\n\n**Summify got acquired!**\n\nLooking back, selling my first indie project was a dream I didn’t know I could achieve in the first year.\n\nBottom line:\n\n**Don't overthink it, Just ship it, ignore social comments.**\n\nI love **Reddit**, I read Reddit everyday, but with some caution. Reddit sometimes could be super negative on some topics. when you start to build something new, you are so fragile and unsure of what you are doing, reading some sort of negative comments will drain your motivation.\n\nNow, I’m more eager than ever to keep building and learning new things, I'll do build in public for my next project, If you are interested, you could find me [here](http://x.com/devhe4d)\n\nkeep shipping!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 654,
    "downs": 0,
    "created_utc": 1721927374.0,
    "media": null,
    "is_video": false,
    "num_comments": 162,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Story with lessons learned about shipping and selling, not a how-to list.",
    "composite_score": 4.642335102193762
  },
  {
    "score": 647,
    "title": "Starting your online business is so cheap today",
    "selftext": "• Figma: $0\n\n• Next.js: $0\n\n• Supabase: $0 (for up to 50k users)\n\n• Umami: $0\n\n• Resend: $0 (for up to 3k emails/month)\n\n• Domain: $10\n\n• Stripe: $0 (1.5% - 2.5% fee)\n\nIn the end, it’s just $10 and a couple of free hours per day — and you could potentially create a billion-dollar company.\n\nDon’t listen to pessimists who say, \"The chances are so low\" or \"Nobody will buy your product\". Low chances they have to get up off their lazy ass and start doing something themselves.\n\nI believe in you!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 647,
    "downs": 0,
    "created_utc": 1732986093.0,
    "media": null,
    "is_video": false,
    "num_comments": 168,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Bullet list of free/cheap tools and a basic cost outline.",
    "composite_score": 4.615518358177431
  },
  {
    "score": 642,
    "title": "I Launched 39 Startups Until One Made Me Millions. This Is What I Wish I Knew.",
    "selftext": "**Most “founders” never launch anything.** \n\nThey build a project for months, never complete it and eventually scrap the product. Or launch it and get no customers.\n\n**Startups are truthfully a numbers game.** Even the best founders have hit rates under 10%. Just look at founders like Peter Levels.\n\nSo how do you maximize your chances of success?\n\nThe honest answer is to increase the number of startups you launch.\n\nI’m going to get hate for this: but you should NOT spend hundreds of hours building a product… until you know for certain that there is demand.\n\nYou should launch with just a landing page.\n\nWrite a one pager on what you will build, and use a completely free UI library like Magic UI to build a landing page.\n\nIt should take you under a day.\n\nThen what do you do?\n\nAdd a stripe checkout button and/or a book a demo button.\n\nAnd then launch. Post everywhere about it(Reddit, X, LinkedIn, etc) and message anyone  on the internet who has ever mentioned having the problem you are solving.\n\nLaunch and dedicate yourself to marketing and sales for 1 week straight.\n\nIf you can’t get signups or demo requests within 1 week of marketing it 24/7... KILL IT and START OVER.\n\nMost “startups” are not winners. And there are only THREE reasons why someone will not pay you, either:\n\n1. They don’t actually have the problem.\n2. They aren’t willing to pay to solve the problem.\n3. They don’t think your product is good enough to try and pay for.\n\nIf people do sign up and check out with a stripe link you simply come clean with a paraphrased version of:\n\n“I actually haven’t finished the product yet, but I’d love to talk to you about the problem you’re facing. I put a sign up link on the website to see if anyone would actually care about my product enough to pay for it”\n\nThen you refund the customer.\n\n**This is where I’m going to get hate:**\n\n1. It is not unethical to advertise a product you have not finished building.\n2. It is not unethical to put a checkout link and collect payments for an unfinished product to test demand… as long as you simply refund “customers”.\n\nWhen you do eventually get sign ups or demo requests, the demand is proven. Only then do you invest 2 weeks in building a real product.\n\nDo not waste hundreds of hours of your valuable time building products no one cares about.\n\nTest demand with a landing page and check out link/demo request link.\n\nIf demand is proven: build it.\n\nIf demand isn’t proven: start over with a new idea.\n\nRepeat.\n\nYou will get a hit if you do this… eventually.\n\nThis is personally how I tested 39 different startups… and killed 37 of them with little to no revenue to show for it.\n\nFor context: Of the 2 startups that DID get traction from this strategy:\n\n1. One went on to hit $50M+ in GMV\n2. [Rivin.ai](http://rivin.ai/) went on to raise an investment from Jason Calacanis and works with multi-billion dollar e-commerce brands to analyze Walmart sales data.\n\nStop wasting your time building products no one cares about. Validate. Build. Sell. Repeat.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 642,
    "downs": 0,
    "created_utc": 1751743049.0,
    "media": null,
    "is_video": false,
    "num_comments": 331,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Explicit launch steps and kill-shot criteria presented as a repeatable process.",
    "composite_score": 4.73628001477624
  },
  {
    "score": 624,
    "title": "Only 7 years old, and I hit $395K MRR with my vibe-coded SaaS",
    "selftext": "Yeah, so here’s the deal. I’m 7 years old, and I vibe coded a SaaS boilerplate using Lovable.\n\nFast forward a few months, and somehow, I’ve hit $395K in MRR. Yeah, no big deal. I’m just out here casually raking in almost half a million dollars every month while still getting grounded for not taking the trash out.\n\nA little advice, if you’re into building stuff like I am:\n\n1. **Find a problem that actually needs solving.** For me, that was vibe coding my very own SaaS boilerplate cuz people need to start vibe coding their SaaS with something to start on.\n2. **Don’t be afraid to start building.** If I’d listened to everyone telling me to “wait until you’re older,” I’d probably still be doing homework instead of running a business. Age is just a number. Like, a really annoying number when you’re trying to rent an office space.\n3. **Your dumb cause a 7 year old is better.** You are probably at $0 MRR still thinking of building your SaaS while a 7 year old's revenue comes from a boilerplate. Lock in.\n\nAnyway, I’m probably going to go get a snack or something, but if you’ve got questions, feel free to ask. I’m probably just as confused as you are about how I ended up here. \n\nBut hey, if a 7-year-old can hit $395K MRR, maybe it’s time to reconsider your life choices cause your probably broke and still at $0 MRR.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 624,
    "downs": 0,
    "created_utc": 1754770851.0,
    "media": null,
    "is_video": false,
    "num_comments": 143,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Three actionable tips presented as a short bulleted list.",
    "composite_score": 4.5125612633917
  },
  {
    "score": 614,
    "title": "Mass-produced AI apps for 14 months. Made $2,847 total. My friend sells pool cleaning services and cleared $94K.",
    "selftext": "\r\nI mass-produced AI wrapper apps for 14 months thinking I'd found the cheat code to SaaS.\r\nBuilt 11 apps total. AI resume reviewer. AI meal planner. AI study buddy. AI journal prompts. You get the\r\nidea.\r\nCombined revenue across all 11: $2,847. Combined time invested: probably 1,400 hours.\r\nThat's about $2/hour.\r\nMeanwhile my friend started a pool cleaning route in Phoenix 8 months ago. No app. No AI. No product\r\nhunt launch. Just a truck, some chemicals, and door knocking.\r\nHe cleared $94K in his first year. Works 6 hours a day, 5 days a week. Has a waitlist of customers.\r\nI mass-produced apps nobody needed for markets I didn't understand. He found people with dirty pools\r\nwho hate cleaning them and showed up weekly.\r\nThe uncomfortable math:\r\nMy 11 AI apps serve maybe 40 active users combined. His pool route serves 127 homes. Each home\r\npays $150/month. That's $19K MRR from people who will literally never churn because pools don't stop\r\ngetting dirty.\r\nI mass-produced solutions looking for problems. He found one obvious problem and solved it boringly.\r\nCurrently researching what \"boring\" business I could start in my area. Pressure washing. Gutter cleaning.\r\nJunk removal. Something where the demand exists before I do.\r\nAnyone else made this pivot from SaaS to service business?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 614,
    "downs": 0,
    "created_utc": 1764364861.0,
    "media": null,
    "is_video": false,
    "num_comments": 205,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Analytical comparison with a pivot and lessons, not a step guide.",
    "composite_score": 4.650808725959993
  },
  {
    "score": 613,
    "title": "I wasted $50k because I thought the code was the expensive part.",
    "selftext": "Yeah, you read that right. We burned through an extra $50k not because our developers were slow, but because we were idiots about what an MVP actually costs.\n\nEveryone tells you to focus on the \"minimum\" and \"viable.\" What they don't tell you is that \"code\" is maybe half the battle. We obsessed over features and engineering timelines, and completely ignored the iceberg of costs lurking below the surface.\n\nOur first big punch to the gut? Legal. We launched our app, got a bit of traction, and then Apple rejected an update. Why? Our privacy policy and terms of service were garbage templates we pulled offline. That was a frantic two week scramble and a $5,000 bill from a lawyer we hadn't budgeted for.\n\nThen came the marketing \"budget.\" We figured the product was so good it would sell itself. Spoiler: it didn't. We had to spend thousands on ads just to get our first 100 users. Another unplanned expense.\n\nBut the real killer was support and operations. As soon as people started using the product, the bug reports and \"how do I do this\" emails flooded in. My cofounder and I were spending half our day answering support tickets instead of building the business. The \"viable\" part of our MVP was a joke because the user experience, including support, was terrible. We had to hire a part time support person way sooner than we planned.\n\nThis is the stuff the \"lean startup\" gurus conveniently forget to mention.\n\nAn MVP isn't just a piece of software. It’s a tiny, functioning business. And businesses have costs beyond the factory floor.\n\nSo here’s the rule we now live by at my agency: Take your most realistic, padded developer estimate. Then, add 50% on top of that for the \"everything else\" fund. This covers your legal setup, your initial marketing spend, your analytics tools, your server costs that will inevitably spike, and the cost of actually supporting your first users.\n\nAnd even that is before you add a 25% \"shit will hit the fan\" buffer. Because it always does.\n\nStop thinking of your MVP as a product launch. Start thinking of it as a business launch. The code is just the ticket to the game. Actually playing it is what costs you.\n\nWhat's the dumbest non code cost that almost sank your startup? Let's hear the war stories.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 613,
    "downs": 0,
    "created_utc": 1761498625.0,
    "media": null,
    "is_video": false,
    "num_comments": 193,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.79,
    "category_rationale": "Explains MVP realities and cost considerations with concrete examples.",
    "composite_score": 4.637069236106281
  },
  {
    "score": 599,
    "title": "Thoughts on Rebrandly?",
    "selftext": "Company’s marketing team had a nightmarish and expensive campaign screwup this weekend that I got dragged into (I’m on the SWE/devops side). Lots of blame going around saying that there is no good linking strategy as it’s been cobbled together over the years.  \n  \nBeing sucked into this, I need to come to the table with a solution to prevent this from happening again.  \n  \nDid some research on a formal tools that could work. Colleague at my old company said their team uses Rebrandly and given that I have actual work to do, thinking about just bringing it to the table. Just want to see if any of you have any insights/objections.  \n  \nSo, if you have any objections to Rebrandly marrying my company’s marketing team, please say it now or forever hold your peace.",
    "subreddit": "SaaS",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 599,
    "downs": 0,
    "created_utc": 1761569487.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A request for opinions on a tool, minimal substantive content.",
    "composite_score": 4.409865247165112
  },
  {
    "score": 591,
    "title": "I wasted 6 months building everything EXCEPT what mattered in my SaaS",
    "selftext": "You know what's seductive? Building a beautiful login system. Crafting the perfect user dashboard. Setting up that sweet admin panel. You know what actually matters? None of that.\n\nI fell into the classic developer honey trap: spending months perfecting the infrastructure while my core product – the thing users would actually pay for – gathered dust in my Notion doc. I was the equivalent of someone building an entire restaurant without deciding on the menu.\n\nHere's what I SHOULD have done instead:\n- Authentication? Magic link emails. Done.\n- User management? Excel sheet. Next.\n- Admin dashboard? Literally could have used Google Forms.\n- Beautiful UI? Basic Bootstrap would've worked fine.\n\nThe brutal truth? I wasn't focusing on secondary features because they were crucial. I was focusing on them because they were comfortable. Known territory. The core functionality? That was the scary part. The part that could fail. So I subconsciously avoided it.\n\nDon't be like me. Your users don't care about your beautiful JWT implementation or your perfectly normalized database. They care about whether your product solves their problem.\n\nBuild the scary thing first. The thing that actually matters. Everything else is just procrastination wearing a productivity costume.\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 591,
    "downs": 0,
    "created_utc": 1739004152.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.84,
    "category_rationale": "Offers concrete steps on what to build first and how to test/launch.",
    "composite_score": 4.4645311695800665
  },
  {
    "score": 588,
    "title": "Making $190,000 per month with an AI dating assistant",
    "selftext": "I found a completely bootstrapped business making $190,000 per month with an app that helps you flirt using AI. While I found it to be slightly dystopian, I couldn’t help read more about how they do it.   \n\n\nThe problem the business solves is quite simple, but niche. You screenshot a message that you get on a dating platform, Snapchat, etc and upload it to the app. The app then gives you a flirty/ clever response to send back. The idea is that this will make you better at flirting, get you more dates, etc.  \n\n\nThe app has 1.5 million downloads in just 4.5 months, proving that there is a market for this niche, somewhat gimmicky product.  \n\n\nThere is a free trial and then users pay a whopping $7/week to use it.  \n\n\nThe listing mentions that they haven’t done any Facebook or Google ads, which could be worth exploring. However I think something like this would really pop on Instagram and TikTok. You can see some TikTok examples from a competitor, Rizz ([https://www.tiktok.com/@rizz.app](https://www.tiktok.com/@rizz.app)). Influencer marketing would be the main marketing vehicle for a business like this, imo.  \n\n\nThe idea of paying $7/week for a ChatGPT wrapper that helps you flirt was crazy to me. But it illustrates the fact that just because something is a wrapper, doesn’t mean it’s a bad business. This company (and others) was able to find a unique angle in the AI space, and effectively capitalized on it. They didn’t just build a generic PDF chat app (no hate on PDF chatting apps, some of them are doing really well). But I think this business perfectly illustrates that there are endless possibilities and angles out there with AI.  \n\n\nThe business is currently selling for $3.5 million.  \n\n\nP.S. I write a weekly 5-minute digest about online businesses (like this one) selling for life changing amounts of money in my free newsletter, [Startup Sphere](https://startup-sphere.beehiiv.com/).",
    "subreddit": "SaaS",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 588,
    "downs": 0,
    "created_utc": 1705540556.0,
    "media": null,
    "is_video": false,
    "num_comments": 385,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Narrative post with a business case and insights into an AI wrapper approach and potential marketing angles, focusing on ideas rather than steps.",
    "composite_score": 4.760908947122979
  },
  {
    "score": 585,
    "title": "The CEO keeps asking me why our IT costs are so high and I don't know how to explain that software costs money",
    "selftext": "I'm the sole IT person at a 50 person company  \n  \nOur CEO is extremely old school who came up in manufacturing and I think he fundamentally doesn't understand how modern business software works. Every month he looks at our expenses and sees stuff like Slack, Zoom, Salesforce, AWS, etc and asks me why we're \"wasting money on all these subscriptions\" He also doesn't understand the difference between one time costs and subscriptions. Like he keeps bringing up how \"back in the day you just bought Microsoft Office once and that was it\" and I've tried to explain that saas models are just how enterprise software works now but he thinks it's all a scam lol   \n  \nThe worst part is he'll approve a $30k purchase for new office furniture without blinking but then grill me about why we're spending $2k/month on tools that literally allow people to do their jobs. I tried to break down what each service costs per user per month and show him it's like $50/person for ALL of our software and he still thinks that its high I'm at the point where   \nI'm considering just building a massive spreadsheet that shows what would happen if we downgraded\n\n\n\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 585,
    "downs": 0,
    "created_utc": 1764540663.0,
    "media": null,
    "is_video": false,
    "num_comments": 263,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Central explanation of SaaS cost structure and how to communicate it to leadership, with reasoning and examples.",
    "composite_score": 4.706199579453006
  },
  {
    "score": 576,
    "title": "Microsoft is offering $25k off Stripe fees for startups",
    "selftext": "In case you didn't know about this Microsoft for Startups gives you $25,000 in free Stripe payment processing plus:\n\n* $150,000 in Azure credits (includes OpenAI credits)\n* Microsoft 365 with 50 seats\n* GitHub Enterprise for 20 people\n* 75% off LinkedIn premium\n\nEverything is free for startups less than 7 years old. No minimum revenue needed.\n\nYou can sign up here it's completely free: [https://foundershub.startups.microsoft.com/signup](https://foundershub.startups.microsoft.com/signup)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 576,
    "downs": 0,
    "created_utc": 1736423135.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.8,
    "category_rationale": "Explicit list of startup perks/resources presented as multiple items.",
    "composite_score": 4.470925038777515
  },
  {
    "score": 566,
    "title": "Removed credit card requirement from trial signup. Signup up 340%. Conversion down 60%.",
    "selftext": "Had credit card required upfront for free trial. \nConventional wisdom said this filters to serious buyers. Signups were low. 40-50 per month. Conversion to paid was 38%. Removed the credit card requirement. Month 1 results: Signups: 186 (up 340%) Conversions to paid: 28 (15% conversion rate) Net new customers: 28 vs previous ~17 More customers in absolute terms. But the math gets complicated. What I noticed: Support load exploded. Tire-kickers asking questions about things they'd never pay for. Trial abuse appeared. People creating multiple accounts to extend free usage forever. Sales calls became less qualified. More \"just looking around\" conversations. The 15% who converted were often lower-intent. Higher churn in first 90 days.\nSide benefit: During this process, I discovered 4-5 great tools to add to our stack. Used Gamma to create PDFs and setup documentation. Built a knowledge base with Trupeer that now answers most common questions automatically before they come to support, built a chatbot -&gt; calling it Lex (for now) to handle basic support with these documentations.\n\nWhat I tried next: Credit card required, but no charge for 14 days. Clear messaging \"you won't be charged until day 15.\" Results: Signups: 89 per month (down from 186, up from 40) Conversion rate: 31% Net new customers: ~28 Same absolute customers, but better quality. Lower support load. Less abuse. The right answer depends on your product: High-touch, complex product? Credit card upfront. Filters to serious buyers. Simple, self-serve product? No credit card. Volume matters more. Middle ground? Credit card required with very clear \"no charge until X\" messaging. There's no universal best practice. Test both and measure net new paying customers, not just signup rates. What's your trial signup flow?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 566,
    "downs": 0,
    "created_utc": 1765107846.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.66,
    "category_rationale": "Describes a reproducible sequence of trial-and-error steps to optimize signup conversions.",
    "composite_score": 4.338068061060916
  },
  {
    "score": 564,
    "title": "What nobody tells you about traction. Reaching 1,5k users changed my day-to-day life completely",
    "selftext": "I’ve been building apps for 3 years little to no success. Recently, I launched my first successful startup.  It is called Yadaphone**,** and it lets people make cheap international calls from the browser. In under 3 months, it reached 1500 users, 7 enterprise customers, and brought in $15,000 in revenue.\n\nBefore that, I thought I had a clear idea of how indie hacking works: you build something, launch it, get users, and continue doing the same stuff as at the start, but on a larger scale (and get $$$). That couldn’t be further from the truth. Here are the top problems I wish someone had warned me about.\n\n**1. A lot of eyeballs are good, but be prepared, the sharks will come**\n\nI posted about my app several times on Reddit and X. A few posts blew up, and it got featured on Product Hunt. Over a million people saw it. 50,000 visited the website. We got tons of sign-ups and sales. But along with the good users came fraudsters and hackers.\n\nI spent several nights fighting them off live. Some were successful and we lost a bit of money to fraud. Others were dumb and we blocked them instantly. Lesson: if you’re even mildly successful, malicious users will show up. From day 1, implement email quality checks, suspicious activity monitoring, and an easy way to ban malicious users.\n\n**2. 90% of my time is taken by support**\n\nIf you think computers are deterministic, you’re in for a surprise. Before hitting 1500 users, I had no idea how many things could go wrong for different people in completely different ways.\n\nI used to spend 3 to 4 hours a day answering support requests. Now I timebox it to no more than one hour. Support has become a permanent part of my daily routine. I built my own ticket system with Cursor. Every day I open my admin dashboard and go through pending tickets. When I reply, it saves the response in a thread. Once in a while, I spot a repeating issue and add a tip in the app to prevent it. That helps reduce, but never fully stops the related requests.\n\n**3. Give refunds early**\n\nSometimes a customer is pissed, and no amount of support will fix it. If you can afford it, offer a no-questions-asked refund. It’s cheaper than dealing with disputes. First, disputes are expensive. Second, you’ll probably lose. Third, an angry customer costs more than a refund. They leave bad reviews and scare off others.\n\nIf your product didn’t work for them, it’s not a good fit. Say goodbye and move on.\n\nBy the way, 90% of support requests come from customers who spend under $5. People who spend $20+ make barely any requests, and I hardly ever hear from the enterprise folks – they just use the app and chill.\n\n**4. Planning my time is the biggest pain now**\n\nWhen I was just a developer, I didn’t care how long things took. I got paid either way and didn’t feel any responsibility for the outcome. Running your own business is the exact opposite. If you don’t plan your time, you miss bug reports, support tickets pile up, and features go unbuilt. You lose money.\n\nNow I start every day by planning. I split all tasks into three areas: routine, product, and personal. I don’t allow more than 3 or 4 tasks per area and track time spent on each. If I forget something, I don’t just add it to the list. I write it at the bottom to remind myself that I messed up and need to plan better tomorrow.\n\n**5. Talk to your users**\n\nI send an email to every paying customer within an hour after purchase. It helps with three things. First, if something went wrong, I catch it early and fix it before they give up or write to support. Second, if it went well, I ask for a review. This skews reviews massively toward the positive. That’s how my app hit a 4.7 Trustpilot rating in under 3 months. Third, once in a while, these emails turn into real conversations. I get to know my users, learn about their background, and sometimes, I get crazy stories from their lives. As a bonus point of being a founder who talks to users, you get to know people of all walks of life and burst your X/Reddit bubble.\n\n  \n\\---\n\nSo this is my take on how getting traction changes your life as a founder. This was a dump of thoughts I have on the topic. Let me know what you struggled with at this point and how you solved those problems",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 564,
    "downs": 0,
    "created_utc": 1747230623.0,
    "media": null,
    "is_video": false,
    "num_comments": 163,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Shares actionable lessons learned with concrete guidance and examples.",
    "composite_score": 4.586970371843288
  },
  {
    "score": 555,
    "title": "Everyone's trying to get rich with tiny saas wrappers. The real opportunity is boring RAG.",
    "selftext": "I've been building RAG systems for a year. Made about $50k from three companies.\n\nEveryone on Twitter and Reddit thinks they're going to get rich building a $29/mo saas wrapper. It's a lottery ticket. The real money is in the most boring, obvious problem: companies can't find shit in their own documents.\n\n**What I actually built**\n\nThis wasn't just slapping tools together. It's a production pipeline.\n\n**Ingestion:** Docs are corrupt, APIs fail. I used Temporal to manage the workflow; it handles retries so I don't have to.\n\n**Processing:** Fixed size chunking is garbage. It cuts sentences in half. I used zchunk (ZeroEntropy) to split docs semantically.\n\n**Indexing:** I indexed everything twice in Qdrant. First with zembed-1 (dense, for semantic meaning). Second with FastEmbed SPLADE (sparse, for keywords and acronyms like 'ISO-9001' that dense vectors miss). You need both.\n\n**Retrieval:** This is where demos fail. A query comes in. I hit both indexes, get a wide net of results (top 50). It's a messy list.\n\n**Reranking:** I feed that messy list + query into zerank-1 (ZeroEntropy). This is the most critical step. It re-sorts everything for actual relevance. This one step fixed \\~30% of my bad results.\n\n**Generation:** Only then do I take the new top 3-5 results and feed them to Gemini 2.5 Pro to write the answer with sources.\n\nThe value wasn't the LLM. It was the plumbing. Backend is FastAPI, frontend Next.js. Postgres just runs Temporal.\n\n**How I got clients**\n\nTo be honest, mine came mostly through personal connections. A friend in compliance was drowning in PDFs, I built them something for $8k, and it spread from there to a research company ($19k) and a logistics firm ($23k).\n\nBut the market is so huge, I'm sure you know someone in one of those industries I listed. Just dig. And if you really don't, just find the right person and email them directly. Forget Upwork. Or I am even sure that in this sub you're all better marketers than me. \n\n**The actual opportunity**\n\nEvery mid-size company has 10+ years of documents in SharePoint or network drives. Their search doesn't work. They are paying people high salaries to manually dig through files. You fix that, they pay $20k, $30k, $50k. Per project. It's a real business, not a side project.\n\n**Industries that actually pay**\n\n* Pharma (regulatory docs)\n* Manufacturing (specs, manuals)\n* Law firms (contracts, cases)\n* Logistics (supplier docs)\n* Energy (inspection reports)\n\nBasically anywhere people waste hours in PDFs.\n\n**How you can do the same**\n\nYou don't even need to be that technical. Go make a professional looking site. Pick one of those industries. Anywhere you have connections or understand the space a minimu,. Contact teams. Ask them how they find internal info. Show them the problem and how much time they're wasting. When they say yes, find a freelance developer  hand them this exact pipeline. You pay them $5k, you charge $30k. You manage the client, they build. Do that 3-4 times a month and you have a legit million dollar a year business. \n\n**Reality check**\n\nThis isn't sexy. You won't get hyped on Twitter for it. But companies will pay $20k+ for something that actually functions vs. another \"AI transformation initiative\" that goes nowhere. The stack is figured out. The sales cycle is short if you can demo a working system. Everyone is fighting for $29/mo subscribers on their tiny saas wrappers, while enterprises are sitting there with $50k checks ready for anyone who can solve this one, boring, high value problem. ",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 555,
    "downs": 0,
    "created_utc": 1761010470.0,
    "media": null,
    "is_video": false,
    "num_comments": 111,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Explains a mental model and emphasizes the importance of underlying systems (\"plumbing\") over hype in RAG.",
    "composite_score": 4.482183802917149
  },
  {
    "score": 559,
    "title": "I spent 6 months building an app that made exactly $0 in revenue 💸",
    "selftext": "Just spent half a year coding. Launched my \"masterpiece.\"\n\nResult? Zero dollars.\n\nHere's what I wish I'd known before wasting 6 months of my life.\n\n# The mistakes that cost me thousands:\n\n* **No validation** \\- Built what I thought was cool, not what users needed\n* **Feature creep** \\- \"Just one more feature\" syndrome for 5 months straight\n* **Perfect code obsession** \\- Rewrote functions that users never even saw\n* **Zero marketing** \\- Thought \"if you build it, they will come\"\n* **Ignored competition** \\- Discovered 3 similar apps after launch\n\n# The brutal reality:\n\n* Spent 180+ days building\n* $0 in revenue after launch\n* few downloads total\n* 0 paying customers\n\nEven my mom uninstalled it after a week.\n\n# What actually works (from my second app):\n\n1. **Validate first** \\- Talk to 20 potential users before writing a line of code\n2. **Build MVP in 30 days** \\- Core features only, nothing else\n3. **Start marketing day 1** \\- Build audience while building app\n4. **Set hard deadline** \\- Ship after 30 days even if it's not perfect\n5. **Focus on acquisition** \\- Get users before adding more features\n\n# The formula I learned too late:\n\n* **Week 1-2**: Talk to users + basic prototype\n* **Week 3-4**: Build core functionality\n* **Week 5-6**: Launch + get feedback\n* **Week 7+**: Iterate based on ACTUAL usage\n\nMy second app took 6 weeks to build, made around +100$ in month one.\n\n# The mindset shift:\n\nStop thinking like a developer (\"How can I build this?\") Start thinking like a business (\"Will people pay for this?\")\n\nNobody warned me how easy it is to waste months building something nobody wants.\n\n**Question**: Have you built something that flopped? What did you learn from it?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 559,
    "downs": 0,
    "created_utc": 1747824472.0,
    "media": null,
    "is_video": false,
    "num_comments": 192,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Offers explicit, sequential steps for validating and launching a tech product.",
    "composite_score": 4.588466681510087
  },
  {
    "score": 547,
    "title": "Hit 1M ARR yesterday- everyone is lying to you",
    "selftext": "Hey everyone, this post is going to trigger a lot of folks.\n\nI joined reddit 4 years back started following these different saas startups threads hoping to get some value. \n\nI started following all the constant advice - Build in public, Post about your startup on reddit, cold messaging. Everyone is lying here and they know it.\n\nI wasted 3 FUCKING YEARS of my life building businesses out of taking these suggestions and made $740 in 3 years. Then last year I met a founder backed by a16z who is running a 7M ARR company today. His advice changed everything for me.\n\nAnd I am going to share it because IT IS NO DAMN SECRET! Everyone outside of reddit who has ever built a real business knows these things!!!!\n\n1. Don't fucking re-invent the wheel. Just fucking copy what already is selling in market.\n\n2. Your product features mean shit if no one has ever looked at your product \n\n3. Don't waste your time doing product hunt launches and all the other retarded sites to launch your product. Its a trophy that no one gives a shit about.\n\n\nNow coming to the real deal\n\n1. Homepage matters much more than your actual website. Clear CTAs creating urgency and solving one and only one problem no confusion should be there. Best AI to make home page - \"Figma Make\" dont waste your time finding anything else. I have tested all of them for months. \n\nExample of homepage title \"Get 10x leads from X\"\n\n2. Never do cold emailing, IT NEVER works. Do linkedin outreach much much higher chances of working. Best and cheapest tool - \"linkedHelper\"\n\n3. Stop trying to build your audience and go VIRAL on linkedin twitter X or whatever fucking platform. If you want to build a company 20 years later then sure go ahead\n\n4. Just fucking run Ads, whatever 5k USD you were going to waste in the next 6 months fucking around with ZERO results put all that money and run FUCKING Ads.\n\n5. Unless really irrelevant, for most businesses ONLY run META ads. If your saas is complex and mostly for enterprises etc then run google search ads.\n\n6. META has fucked the platform and now static ads dont work you need only UGC. And please dont ever try AI UGC all those tools out there will generate you ZERO clicks from AI video ads.\n\n7. Get atleast 50-60 UGC pieces from real ugc creators. cheapest website to get UGC - bulba.app\n\n8. Take the UGC and run ads on those. dont EVER try to run ada yourself. Just hire some freelancer from india/philippines from upwork but with really good rating and past work. Don't fall into any agency trap. Always independent. They will do it even for $500.\n\n9. If you product is in $20-50/month range your flow should be signup -&gt; 1 week free trial (with card) -&gt; conversion.\nIf its $100+ then signup -&gt; book demo -&gt; 1 conversion. Only offer free trial for people who ask for that on the call. \n\n10. Then track conversion and drop rates in each stage and try to optimise to finally get a better ROAS.\n\n\nTHATS IT! and people who have done it know that this is how you build a business. And they are mostly not on reddit!\n\nBYE!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.72,
    "subreddit_type": "public",
    "ups": 547,
    "downs": 0,
    "created_utc": 1766728824.0,
    "media": null,
    "is_video": false,
    "num_comments": 275,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Emotional critique and distrust of startup advice with moral judgment.",
    "composite_score": 4.499235099516978
  },
  {
    "score": 544,
    "title": "Here's how to waste 250K in building an healthcare app",
    "selftext": "1. App requires 5 clicks to do the thing\n\nSpend the first 6 months perfecting the user flow. It's beautiful. It's intuitive. It adds 3 clicks to something doctors do 40 times a day. One cardiologist pulls out a spreadsheet proving the app will cost him $47k annually in lost patient time.\n\n2. Treat HIPAA like just another checkbox\n\nClick \"yes\" on a compliance form and genuinely believed that made the app secure and complaint. Learn about what it actually means in compliance review.\n\n3. Someone named O'Connor tried to log in\n\nEntire app crashes because some one forgot apostrophes exist in human names. The devs spend the next week learning about characters like Renée, Smith-Jones, and people whose entire legal name is just \"Cher.\"\n\n4. Show it to one doctor, product market fit confirmed.\n\n5. Epic wanted $25k just to have a conversation\n\nAssumed integration would be easy, Googled \"Epic integration\" and laughed at the $25k price tag, thinking it was a typo. It wasn't. Eight months later you get approval, and the app still crashes when it receives any data because integration testing is apparently a different $25k.\n\n9. AWS bill went from $500 to $15k, app hasn't launched yet\n\nTurns out HIPAA compliant infrastructure has opinions about encryption, logging,  and redundancy. Hospitals want you to sign SLA guaranteeing 4-nines. You hired a DevOps person at $12k/month because everything kept breaking and risk breaking the SLA. You've burned $220k and still don't have a single paying customer.\n\n10. They said \"this doesn't fit our workflow at all\" and you realized workflow was a word you should have learned earlier\n\nYou built scheduling. You built messaging. You built a beautiful patient portal. None of it maps to how clinicians actually work. They have to see 40 patients a day. Your app makes that harder, not easier. You spent a year solving problems nobody had while ignoring the ones they actually face daily.\n\n\nBut remember to have fun!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 544,
    "downs": 0,
    "created_utc": 1761673001.0,
    "media": null,
    "is_video": false,
    "num_comments": 131,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Enumerated list of costly mistakes to avoid when building a healthcare app.",
    "composite_score": 4.494183467879568
  },
  {
    "score": 543,
    "title": "I paid 5 influencers on LinkedIn to promote my SAAS : here’s what $1250 got me",
    "selftext": "A few weeks ago I decided to test something new for my SaaS.  \nInstead of running more cold email or ads, I tried using LinkedIn influencers.\n\nI wanted to get people to comment on a post, send them a Notion resource, and redirect them to my site.\n\nThe experiment ran for two weeks, and I spent 1,250 dollars in total for five influencers.\n\nYou can check [the influencer's post + profile here](https://www.notion.so/Proof-of-influencer-campaign-29bb9abcbe3f80f8aefff2323103f3e4?source=copy_link)\n\n**Step 1: Finding influencers**\n\nThere are basically two types of influencers. The niche experts who have small but super relevant audiences. And the viral creators who get huge reach but with less qualified people.\n\nI picked a mix of both.\n\nI searched for people who had already done sponsored posts for competitors. I DMed more than fifty of them, compared pricing and engagement stats, and selected five.  \nI wrote the posts myself and made the visuals so everything looked consistent.\n\n**Step 2: The process**\n\nEach influencer posted exactly what I gave them.  \nWhen people commented, they replied with a Notion link. The more comments, the more reach, the more clicks.\n\nInside that Notion page, I included a link to my SaaS trial and a “book a demo” button.  \nEach influencer had a personalized page with a tracking link.  \nOne of them even customized the page for their French audience and it performed better than the generic version.\n\nI made sure the Notion resource gave a lot of real value so people thought, “If this is free, the paid version must be crazy.”\n\n**Step 3: The results**\n\nI spent 1,250 dollars. Two influencers brought absolutely nothing. Not even a single visit. Probably engagement pods.\n\n$500 wasted.\n\nThe other three actually worked.\n\nThe first one brought around 75 new signups, 25 trials, 12 paid conversions, and seven demo calls with large teams.  \nThe second one brought 27 signups, nine trials, four paid conversions, and one demo call.  \nThe third one brought 12 signups, five trials, and three paid conversions.\n\nIn total that’s 19 paying customers at 99 dollars per month.  \nThat’s 1,900 dollars in recurring revenue for 1,250 spent.  \nNot bad at all, and definitely something I’ll keep doing.\n\n**What I learned**\n\n\\- Negotiate hard. Prices can easily drop by two or three times if you push a bit.  \n\\- Avoid fake influencers. Many are just engagement groups.  \n\\- Make sure they reply to every comment with your link. If not, do it yourself.  \n\\- Always pay after posting, never before.\n\nI also tried boosting the posts with ads, but it didn’t make much difference.\n\nNext step is to find better influencers, scale the system, and maybe try TikTok next.  \nIf anyone’s interested, I can share the Notion template and DM scripts I used.\n\nIf you have any questions, feel free to ask !\n\nHere [are all the proofs](https://www.notion.so/Proof-of-influencer-campaign-29bb9abcbe3f80f8aefff2323103f3e4?source=copy_link) (influencer urls + posts)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 543,
    "downs": 0,
    "created_utc": 1762549163.0,
    "media": null,
    "is_video": false,
    "num_comments": 147,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.79,
    "category_rationale": "Step-by-step guide for running an influencer campaign with concrete actions and results.",
    "composite_score": 4.518229757395659
  },
  {
    "score": 532,
    "title": "500 engineering interviews later, everything I thought I knew about hiring senior devs was wrong",
    "selftext": "last year, I interviewed over 500 senior engineers and learned that everything I thought I knew about technical hiring was completely wrong.\n\nI used to do what everyone else does - test algorithms, system design, and dig into past experience and the candidates looked amazing on paper\n\nbut here's the thing - I kept seeing the same pattern. startups would hire these \"perfect\" candidates and 3 months later nothing improved.\n\nprojects weren't progressing as fast as they should, the codebase was usually a mess and the junior devs were stuck.\n\nI realized we were testing for all the wrong things and decided to throw out the traditional playbook and come up with something new - instead of hypotheticals, I started throwing real problems at candidates:\n\n* \"here's a PR that blew up in production last week - walk me through how you'd review it\"\n* \"look at this architectural decision we made - what questions would you ask?\"\n* \"here's how a junior implemented this feature - how would you guide them?\"\n\nhiring for a startup isn't about whether someone can implement a red-black tree or design Twitter. It's about:\n\n* can you make smart technical decisions when time and money are tight?\n* do you know when to clean up tech debt vs when to ship it?\n* can you level up junior devs without killing your own productivity?\n* do you work fast?\n\nwe've been doing tech hiring like someone trying to hire a chef by making them recite recipes instead of cooking a meal",
    "subreddit": "SaaS",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 532,
    "downs": 0,
    "created_utc": 1742332416.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Promotes a mental model for hiring and critiques the traditional playbook.",
    "composite_score": 4.347153214847645
  },
  {
    "score": 526,
    "title": "Sold my 2+ year old SaaS for $250k. AMA!",
    "selftext": "Hi everyone,\n\nI am [Bhanu Teja](https://x.com/pbteja1998). I built two SaaS products – [Feather](https://feather.so) &amp; [SiteGPT](https://sitegpt.ai). \n\nI launched SiteGPT in April 2023, so a little over a year. \n\nEver since I started working on SiteGPT, it has become difficult to continue focusing on growing Feather. I don't have the mental bandwidth to grow both of my products. \n\n***So I decided to sell Feather and finally ended up selling it for $250k (around 3.5x ARR).***\n\nAsk me anything!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 526,
    "downs": 0,
    "created_utc": 1718875898.0,
    "media": null,
    "is_video": false,
    "num_comments": 342,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal success story with no generalizable method or structured guidance.",
    "composite_score": 4.709457675233931
  },
  {
    "score": 528,
    "title": "How I helped my company cut LLM costs by 80% by caching meaning, not words",
    "selftext": "I'm a dev at a company that relies heavily on LLMs (OpenAI, Claude, Gemini, etc.) to answer user questions, summarize docs, and generate internal content.\n\nAfter a few months, the usage was solid — but the costs weren’t.  \nWe noticed that a huge chunk of our prompts were just... variations of the same thing:\n\n* “How do I reset my account?”\n* “Can I start over?”\n* “What's the process to restart?”\n\nSame meaning. Different wording. But each one was hitting the LLM and costing tokens.\n\nSo I built a semantic cache — something that could tell when prompts *meant* the same thing, even if they looked different, and reuse the same answer.\n\nIt ended up saving us over 80% in LLM costs.\n\nNow I’m turning it into a product. It comes with:\n\n* Built-in embeddings\n* Vector storage\n* A dashboard to see usage and savings\n* And an API you can drop right in — just wrap your existing LLM call with it.\n* And most importantly, our algorithm is the key to success in achieving a higher cache hit rate. It’s a refined and optimized algorithm, tested extensively.\n\n\n\nYou don’t have to change your stack or infrastructure.  \nIt just sits in front of your model and handles the rest.  \nCan be used by any type of LLM\n\nIf you're building with LLMs and costs or latency are becoming a pain, would you want to try it out?\n\nhttps://www.semantify.app",
    "subreddit": "SaaS",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 528,
    "downs": 0,
    "created_utc": 1744853352.0,
    "media": null,
    "is_video": false,
    "num_comments": 128,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.79,
    "category_rationale": "Explains a concrete cost-saving technique (semantic cache) with outcomes and some implementation details.",
    "composite_score": 4.49875052718481
  },
  {
    "score": 523,
    "title": "Our competitor’s CEO just signed up on our website💀",
    "selftext": "So we’re sitting there, going through our new signups and sending out early-bird discounts like usual.\nThen my boss said \n\n“Hey… check this email out\n\nAt first, it looked like a totally normal signup.\nBut the email was kinda… suspicious something like jojoperson123@gmail.com.\n\nAnd here’s the best part: the fake email actually had a display picture. 💀\n\nWe both laughed, but then I noticed the face looked oddly familiar.\nSo I zoom in.\nThen I Google the name.\n\nAnd yep turns out it’s the CEO of one of our biggest competitors.\nLike, an actual well-known company.\n\nMy boss and I just stared at the screen in silence for a good ten seconds.\nBro didn’t even try to go full undercover just vibes, curiosity, and a fake Gmail.\n\nAt this point, we’re not even mad. We’re flattered.\nIf even our biggest competitor’s CEO is curious enough to sneak in…\nyeah, I think it’s safe to say we’re building something pretty damn good 😎\n\nStartup life: one day you’re fixing bugs, the next you’re onboarding your rival’s CEO.\n\nAdd link here [Articos](http://articos.com/?utm_source=Reddit&amp;utm_medium=Social&amp;utm_campaign=Launch&amp;utm_content=Join)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 523,
    "downs": 0,
    "created_utc": 1759610182.0,
    "media": null,
    "is_video": false,
    "num_comments": 125,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Anecdotal brag about competitor engagement with no actionable content.",
    "composite_score": 4.429516559542508
  },
  {
    "score": 515,
    "title": "Made a Chrome extension as a joke. It has 12K users and makes $400/month.",
    "selftext": "Built it in a weekend as a funny response to a Reddit thread. Took 6 hours total.\n\nNow it has 12,000 active users and makes $400/month from the pro version.\n\nWhat It Does\n\nReplaces every instance of a specific word on websites with a different word. That's it. Completely stupid.\n\nBut people use it to:\n\nMake boring work emails entertaining\n\nBlock spoilers for shows they haven't watched yet\n\nReplace \"AI\" with \"magic\" because they're tired of AI hype\n\nChange cryptocurrency terms to \"monopoly money\" for their mental health\n\nTurns out a lot of people want to customize how they experience the internet.\n\nHow It Makes Money\n\nFree version: Unlimited basic replacements\n\nPro version ($3/month): Replace multiple words, regex support, custom rules per website\n\nAbout 10% of users upgrade. That's 1,200 paying users at $3/month.\n\nCosts me $0 to maintain. No servers, no databases. It's just client-side JavaScript.\n\nWhat I Learned\n\n1. Solve your own annoying problem, even if it seems dumb People have weird problems that seem too small\n\nto matter. If you have it, others do too.\n\n2. Distribution matters more than the product Posted it in 3 subreddits. Got 200 upvotes. That drove installs.\n\nThe Chrome Web Store did the rest (good SEO there).3. Simple products have better margins No infrastructure costs. No support burden. No scaling problems. Just\n\npure profit.\n\nThe Reality\n\nThis will never be a \"real business.\" But $400/month for 6 hours of work one time? I'll take it.\n\nNot everything needs to be a startup. Some things can just be useful and make beer money.\n\nAnyone else build something stupid that accidentally makes money?\n\nI built a Chrome extension to branch ChatGPT conversations (RIP after they shipped the feature natively)\n\nCurrent stack:\n\n•⁠  ⁠Cursor – AI-powered coding\n\n•⁠  ⁠Gamma – instant presentation decks\n\n•⁠  ⁠Trupeer – product demo videos\n\n•⁠  ⁠Mailmodo – email campaigns and automation\n\n•⁠  ⁠Superhuman – personal email\n\n•⁠  ⁠SparkToro – audience research and insights\n\nPro tip: I never drop links in posts. Fastest way to get shadowbanned.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 515,
    "downs": 0,
    "created_utc": 1763615690.0,
    "media": null,
    "is_video": false,
    "num_comments": 143,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Shares a startup side-project story and key lessons learned.",
    "composite_score": 4.391830947674837
  },
  {
    "score": 514,
    "title": "Stay up all fuc**ng night",
    "selftext": "I’m 25. Still young, still figuring stuff out, but I know one thing for sure: I’m not about to live a life someone else designed for me. I look around and see friends and family stuck in a world they built for themselves. They hate their alarms, hate every extra minute at work, and spend their weeks just counting down to Friday so they can hit a bar and drink away the stress.\n\nAnd yet, somehow, they feel the need to tell *me* how to live. *“Get a stable job”* they say. *“Send your résumé to some soul-sucking company with windowless offices”.* But why the hell would I do that? Why would I sign up for a life they obviously hate?\n\n**Whoa, whoa, slow down**, take your hands off that keyboard! Don’t go typing out some snarky comment just yet. Let me explain. No, I’m not some spoiled rich kid. No, I don’t have a trust fund or some wealthy uncle hooking me up. I pay my own way. I know what it’s like to grind, to make sacrifices. I get that nothing in this world comes for free.\n\nBut here’s the thing I can’t shake: *how many lives do we get?* **One**. Not one and a half. Not two. Just one. So why the hell would I keep putting my dreams on hold—waiting for summer, for vacation days, for the next weekend? Why wait for the “perfect time” that might never come?\n\nI’ve decided to start now. Tonight, if I have to. Yeah, I’ll lose sleep, but not over some boring project or a dead-end job. I’m losing sleep over something bigger—a passion, a vision, a plan for my life that’s crystal clear in my head. A dream that just needs me to make it real.\n\nSo if you’ve read this far, wish me luck. And if you’re anything like me, grab that thing you love and make it happen. And if it doesn’t work out? Screw it—start again!",
    "subreddit": "SaaS",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 514,
    "downs": 0,
    "created_utc": 1734553423.0,
    "media": null,
    "is_video": false,
    "num_comments": 271,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Expresses an emotional argument against conventional life/work paths.",
    "composite_score": 4.619091681058291
  },
  {
    "score": 511,
    "title": "SaaS is already dead but no one wants to admit it",
    "selftext": "Everyday this sub is flooded with screenshots of new SaaS products that are just the same AI wrapper over an API. Let’s be real most of it is slop. Nothing original nothing sticky no defensibility. The only reason any of them make money is because clients are slow to catch on and still pay for tools they don’t actually need.\n\nSaaS isn’t innovative anymore it’s a margin game. Everyone clones each other and slaps on some UI. Switching costs are low and the market is saturated. The only “wins” you see now are people who sell to clueless corporate teams that take months to change vendors. That’s not a strong business model. \n\nThe crazy part is founders still think this is the golden path. It’s not. SaaS had its decade but the landscape has changed. Distribution matters more than the product. If you don’t own an audience or a channel you’re just building a disposable tool.\n\nPeople hate hearing it but SaaS is already a graveyard. The dumb clients paying invoices every month are the only thing propping it up. Once they wake up the collapse is obvious.\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 511,
    "downs": 0,
    "created_utc": 1758286300.0,
    "media": null,
    "is_video": false,
    "num_comments": 351,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Strong opinion critiquing SaaS markets with moral stance rather than steps.",
    "composite_score": 4.620041292714896
  },
  {
    "score": 500,
    "title": "When attempting to scale their products 90% of Upwork SaaS Builds Fa",
    "selftext": "Founders contact me when problems occur with their product because it crashes or both crawls and corrupts data. The story is usually the same: The founder hired an individual freelancer at a low cost who delivered a functioning product before disappearing. After setting up to work I access the repository only to discover the codebase is a makeshift patchwork.  \n  \nHere’s what I keep seeing:  \n  \nOne five‑thousand‑line file that controls everything  \n  \nSecrets hard‑coded straight into the source  \n  \nThe code depends on third-party libraries which lack support from other developers globally  \n  \nZero automated tests or CI/CD  \n  \nMagic numbers and copy‑pasted SQL everywhere  \n  \nWhy it happens:  \n  \nThe importance of shipping now exceeds the need to ship in the next quarter.  \n  \nSingle developers typically lack experience with team collaboration and code review processes.  \n  \nFounders without technical expertise fail to recognize issues until they create major disruptions.  \n  \nQuick seven-point review system designed to detect most disasters early on.  \n  \nSeparate branches for main, develop, and features  \n  \nAutomated deploys, no manual FTP uploads  \n  \nAt least basic unit test coverage  \n  \nCentralized logging, not scattered console prints  \n  \nDepend on well‑supported libraries, not abandonware  \n  \nMinimal docs: a readme, an architecture sketch, onboarding steps  \n  \nOutside code review every quarter",
    "subreddit": "SaaS",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 500,
    "downs": 0,
    "created_utc": 1746587622.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Provides a seven-point, actionable review system with steps to follow.",
    "composite_score": 4.143398353227077
  },
  {
    "score": 505,
    "title": "No, You Can’t Just Vibecode DocuSign",
    "selftext": "If you didn't hear, Michael Luo, a PM at Stripe, got sued by DocuSign a couple months ago for building a clone. At first glance, it looks like Big Tech punching down. Yes, the suit is heavy handed and kudos to him for turning this into a PR boon, but there's a lot more to e-sign than what was built.\n\nIf you’ll bear with me, I’d love to take Reddit on a very boring, but educational journey!\n\nLegal nerd alert: I’ve got 15 years in LegalTech and RegTech and run an e-signature startup. This isn’t self-promo. I really care about people understanding compliance and cybersecurity.\n\n**TL;DR**\n\n* E-signatures are legally easy in the US. That’s not the point\n* Typing \"/s/ Jane Smith\" is a legal e-signature. Good luck in court\n* Trust, cryptography, and compliance are the real product\n* Big e-sign players earned their moat doing the boring stuff AI can’t\n* Founders: build better, not faster.\n\n**Yes, E-Signatures are Stupidly Simple**\n\nUnder UETA and E-SIGN, almost *anything* can be a signature if it meets 4 criteria:\n\n1. Intent to sign\n2. Consent to do business electronically\n3. Attribution\n4. Retainability\n\nA squiggle in Paint? A typed name? Copy/Paste into Preview or Word? All legal, free and no SaaS required. Send an email and you're done.\n\nThere is case law to defend it, but there's also case law showing how easily it can be thrown out. The point is, you don't need SaaS at all for legally binding. Outside of the US is a completely different story. Mexico has some prohibitive requirements, just as an example.\n\n**So why use e-sign at all?**\n\nWhen you use an e-sign provider, you're not just buying a UI. You're buying this:\n\n* **Cryptographic Security**: Sealed PDFs by a Trust Authority (not a self-sign cert), making tampering or fraud immediately detectable\n* **Audit Trails**: IP addresses, timestamps, geolocation, device info, etc. \n* **Identity Verification**: Multi-factor authentication, SMS codes, email verification\n* **Workflow Management**: Routing documents, reminders, status tracking and more\n* **Legal Defensibility**: Ironclad evidence and case law for any court challenges\n\nYou are also buying compliance and infrastructure:\n\n* Private Key Infrastructure (PKI)\n* AATL Organization Validation Document Signing Certificates from a Trust Authority\n* SOC 2, HIPAA, CCPA/GDPR, etc. compliance\n* Audit logs, drift detection, IAM, encryption layers, etc.\n* Pen testing, uptime guarantees, etc.\n\nThis is what makes them trustworthy and also what can't be done in a weekend. \n\n**Now a Moment of Cryptographic Truth aka the Signature Isn’t Yours**\n\nPop open the Signature Panel in Adobe Acrobat for something you've signed. You’ll see the certificate is owned by the provider, not you.\n\nSome platforms let orgs buy their own certs. That means:\n\n* *You* appear in the trust chain\n* Docs are signed by your company\n* You control the root of trust\n\nIt’s not just more secure. It’s more credible. To be fair, we tend to work in areas with more compliance needs so you average real estate agent probably doesn't need to care. (We have other goodies for them) But, everything else, is absolutely critical to ensuring a deal goes smoothly.\n\n**AI Doesn't Build the Moat**\n\nI use AI daily and love it. But in certain areas like LegalTech or RegTech, you need to know all of the requirements in order to sell to the market and you have a responsibility to your customers and investors to understand the legal and regulatory landscape. \n\nSaying something complies with the E-Sign Act or UETA is the bare minimum and not really special at all, considering anyone can do it \\*without\\* SaaS already. AI should enable us to better and faster.\n\nFounders: If you're building in LegalTech, I’m rooting for you! Just don't forget about infrastructure and compliance. Maybe I can post about companies that can help speed that up later.\n\nThanks for listening! Happy to nerd out about this stuff in the comments or hear from others building in the space.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 505,
    "downs": 0,
    "created_utc": 1751378280.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Educates about e-signatures and compliance with takeaways beyond hype.",
    "composite_score": 4.333910143149108
  },
  {
    "score": 485,
    "title": "IndieHackers are in a Bubble. Step out of it.",
    "selftext": "I discovered the Indie Hacking community in March 2024 and got totally sucked in by the dream — build a small product, make a living online, while you are free and travel anywhere.\n\nBuilding in public, fellow makers cheering on your small wins, supportive communities,  growing a following - \nIt all felt like I’d finally found my people.\n\nBut around 10 months in, something is starting to feel off.\n\nIt started to feel like it's a weird kind of ponzi scheme — indie makers building tools for other indie makers, trying to sell shovels, selling the dream of build it fast and make money while you sleep. \n\nMost indie makers are bought into this dream (trap). Most of us here hardly found any success. If one product fails, we go build an another one in a week, launch 12 startups in 12 months, do tiktok reels, shitpost in twitter, go viral on Reddit, etc, etc. \n\n We’re stuck in an echo chamber. Wake up. \n\nI haven’t built anything wildly successful yet — so this isn’t advice from someone who's made it. I’m just in the same zone as many of you. But I can’t shake the feeling that something isn’t right.\n\nThe more I scrolled Twitter and Reddit, the more my ideas started to orbit this tiny solar system of indie makers. It felt like I was building something valuable, but not really. \n\nI started talking to friends, one is into mechanical tools and another runs an electronics blog — my ideas meant nothing to them or their business. \n\nThey were struggling with real stuff — inventory management, getting prospects, tracking employee attendance, delivery delays, managing cash flow. Not one of them cared about my Notion dashboard or AI-powered productivity tracker.\n\nThat was the slap.\n\nSince then, I’ve been trying to consciously spend less time on X and Reddit, and more time reading other news, talking to friends and business owners,  attending real-world meetups, taking a tour of their offices.  I’m asking questions, observing processes, and just trying to be useful. It’s reshaping how I think about products completely.\n\nThere’s a quote that floats around on Twitter - Build for people who don’t know what an API or AI wrapper is. That’s exactly what I’m talking about.\n\nDon’t get me wrong—this community is amazing and it got me started. I still love it. But if you’ve been here for months and you’re still building for other builders… maybe it’s time to zoom out.\n\nYour next best idea might come from a casual chat with your barber — not from another r/SaaS post.\n\nAnyone else feeling this ?\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 485,
    "downs": 0,
    "created_utc": 1744717315.0,
    "media": null,
    "is_video": false,
    "num_comments": 178,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.66,
    "category_rationale": "Personal critique of the indie-hacking scene with emphasis on norms.",
    "composite_score": 4.55556278475224
  },
  {
    "score": 479,
    "title": "Competitor hired our best engineer. He quit after 3 months and asked for his old job back.",
    "selftext": "They offered him $40K more. I couldn't match it. He left. Hurt badly. He knew our entire system. Built half of our core features.\n\n3 months later: email. \"Any chance I could come back?\"\n\nTurns out the competitor is a mess:\n\n15-person eng team, but no clear roadmap\n\nMeetings about meetings\n\nEvery PR needs 4 approvals\n\nMicromanagement from a non-technical CEO\n\nHe said, \"I took the money but hated the work. I miss actually building things.\"\n\nI brought him back. Matched his new salary. We can afford it now.\n\nSometimes losing people is temporary. If your company culture is actually good, people figure it out.\n\nHas anyone else had someone leave and come back? Did you take them back?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 479,
    "downs": 0,
    "created_utc": 1763745401.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Narrative with a takeaway about company culture and retention.",
    "composite_score": 4.362376885203469
  },
  {
    "score": 469,
    "title": "Customer cancelled after 18 months. Reason: \"We built it ourselves.\"",
    "selftext": "They were paying $300/month. One of my best customers.\n\nLast week: \"Thanks for everything, we're moving to an internal solution.\"\n\nThey hired a developer, spent 3 months building a worse version of my product, and are now maintaining it themselves.\n\nTheir developer probably costs $8K/month. My tool was $300/month.\n\nBut sure, makes total financial sense.\n\nI think it's a control thing. Some companies would rather own a crappy internal tool than rely on external software.\n\nCan't compete with that. Just have to accept it and move on.\n\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.77,
    "subreddit_type": "public",
    "ups": 469,
    "downs": 0,
    "created_utc": 1764358593.0,
    "media": null,
    "is_video": false,
    "num_comments": 300,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Offers a skeptical insight on internal vs external tooling and the cost/value tradeoff.",
    "composite_score": 4.488881105732639
  },
  {
    "score": 463,
    "title": "FAANG jobs are super easy than building SaaS",
    "selftext": "Former faang engineer and manager here. I left my job early 2022. Little did I know how hard it is. Then, one thing after another market tanked. I was bringing in $400k easily working 9 to 5. \n\nBuilding a SaaS is super hard. No one wants to buy software unless they are persued and convinced. Anyone telling you they built XX millions systems and revenue in FannG are lying. These companies went through their startup phase early 2000s. Now they are super comfortable money printing machines. \n\nDoes it hurt that I am not bringing in same money? Honestly, yes. On the other hand, I am now setting up my own schedule. I get to spend time with my kids which would have never happened in FAANGs. Surprising my stress level is low and I never had back pain since leaving the job. No regrets here but I thought I would my experience with you all.\n\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 463,
    "downs": 0,
    "created_utc": 1739588446.0,
    "media": null,
    "is_video": false,
    "num_comments": 150,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Explains why building SaaS is harder than FAANG and frames the tradeoffs as a mental model.",
    "composite_score": 4.453506454201465
  },
  {
    "score": 465,
    "title": "2.5 years ago I quit my job. Now 11,000+ trips have been planned with my AI travel planner. Here's how I did it.",
    "selftext": "2.5 years ago, I quit my job with no backup plan. Today, I'm making a living from an AI travel planner I built in my bedroom. Here's the raw, unfiltered story of how it happened:\n\n# Numbers, Because Reddit Loves Data\n\n* ‍✈️ 11,000+ trips planned\n* 👥 Paying customers from 7 countries (started monetizing 2 months ago, still free for most users)\n* 🌍 Users from 120 countries\n* ⭐ 5/5 stars on Product Hunt (and 1 of the 20 products hunted by their CEO)\n* 💰 $0 spent on marketing\n* 🕒 14-hour days, 7 days/week in the beginning\n* 📦 400+ updates shipped\n\n# The Journey\n\nIt started after I left my startup where I built audio tools for Grammy-winning artists. I was back at Microsoft, working on things I had zero passion for. I was also a nomad, constantly traveling — and the *planner friend* in every group.\n\nOne night I thought:\n\n&gt;*What if you could instantly discover, collect, and edit travel ideas — without getting lost in Google abyss or rebuilding Notion docs from scratch?*\n\nSo I quit. No health insurance. Expired IDs. No permanent home. I built the first version of Tern while living out of Airbnbs — and used it to plan my own travels.\n\nWe started by building a custom travel editor (ridiculously hard). Then the AI wave hit — and we added personalized suggestions that auto-filled your trip. Suddenly, it clicked. It was magic for our users!\n\n# Reality Check Moments\n\n* 🗓️ Month 1–5: Coded 14 hrs/day. Survived off savings. Worked with 150 closed beta users.\n* 🚀 Month 6: Got into Antler. Visible Hands VC gave us our first grant.\n* 📬 Month 8: Launched our AI planner waitlist — 2 days after the APIs became public.\n* 💸 Month 9–19: Pivoted to work with travel agents (made a few $k), but realized the future wasn’t human agents — it was agentic AI.\n* 📈 Month 15: Went viral on a competitor’s Instagram — gained 1,000 users overnight.\n* 📣 Month 22: First big Product Hunt launch — 300+ upvotes, newsletters w/ 1M+ subs mentioned us, even the director of ***Deadpool*** became a user.\n* ✈️ Month 23–26: Airports started reaching out — Rome Airport included. Opened the door to B2B.\n* 📱 Month 27: Finally started monetizing + building a mobile app (our #1 request from users).\n* 🤝 Month 29: Got added as a perk for Google employees\n\n# Hard Truths Nobody Talks About\n\n* 🐞 Spent weeks debugging bugs in our editor\n* 💸 Kept it free for 2 years — while burning savings (still burning as we monetize)\n* 😰 Lived with daily anxiety about money\n* 🧾 Most founders raising quickly have \\~$200K from friends/family. I didn’t.\n* 🤝 Talked to *many* VCs who love the product... but kept moving the goal post for what they wanted to see (heard similar stories from other underrepresented founders)\n* 👩‍💻 Being a full-female team doesn’t match “the pattern” for investing (1.5% of VC $ goes to women).\n\n# What Worked, Surprisingly\n\n1. Keeping it free longer than comfortable was the best way to get feedback quickly\n2. Obsessing over UX and user feedback\n3. Shipping constant updates (even when no one was asking)\n4. Product Hunt + Reddit launches\n5. Commenting on competitor social media posts = actual traffic\n6. Pivoting a few times helped us learn the travel landscape in depth\n\nIt's called [Tern](http://travelwithtern.com) \\- an AI travel planner that builds personalized itineraries in 30 seconds. If you're curious, you can check it out, but that's not why I'm posting. Just wanted to share that it's possible to survive (and eventually thrive) by building something useful, even if it seems small.\n\n*PS: I used the post template used by another Redditor because I think it's a great way to share our struggles, learnings and wins!*\n\nEdit: WOW! Thank you for *so* many great responses and sign ups! I realized I should probably give you all a discount code here for being so responsive (and since so many of you are trying Tern). Apply this code at checkout for the unlimited plan: **10MORE**.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 465,
    "downs": 0,
    "created_utc": 1743021728.0,
    "media": null,
    "is_video": false,
    "num_comments": 169,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Tells a personal journey with a sequence of milestones and actionable steps to build the product.",
    "composite_score": 4.488610377379137
  },
  {
    "score": 464,
    "title": "hired my first employee and immediately understood why companies have so many stupid rules",
    "selftext": "I'm that company now\n\n\"Please track your hours\" - because I need to know what we're spending time on. Update the project board,\" - because I can't read your mind.Writee docs for your work,\" - because you might get hit by a bus\n\nEvery dumb corporate policy comes from one person who did one thing that broke everything\n\nI'm creating bureaucracy in real-time,andi I hate it, but also it's necessary Becoming what you hate speedrun any%\n\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 464,
    "downs": 0,
    "created_utc": 1762196850.0,
    "media": null,
    "is_video": false,
    "num_comments": 123,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Vent about corporate bureaucracy and dumb rules with a strong emotional stance.",
    "composite_score": 4.456663795471071
  },
  {
    "score": 461,
    "title": "From $0 to $20k MRR in 90 days",
    "selftext": "I was browsing X (Twitter) and found a SaaS that went from $0 to $20k MRR in 90 days.\n\n[Breakdown of Autoshorts.ai from $0 to $20k MRR. Apparently, in 41 days, it added $18k MRR.](https://i.imgur.com/QuyiaRe.png)\n\nThe founder used a combination of Affiliates and FB Ads.\n\nThe ads are pretty simple. You can check them on FB Ads Library.\n\nHe uses a combo of static ads and video ads. Video ads for cold audiences and static images for retargeting.\n\nAnd ad spend is only $3K but LTV is much higher.\n\nCost per conversion:  ~$14\nCustomer LTV: ~$184\n\nOne of the biggest reasons its doing well is because the videos actually get views, which is the goal for customers. \n\nThe creator of the tool himself gained over 1,200 followers on one of his test TikTok accounts.\n\nDo you guys use FB Ads? Indiehacker Twitter apparently hates it (they generally hate paid ads) but all SMB businesses love it &amp; built their businesses upon it.\n\nPS: Find all details on it in [this post.](https://startupspells.com/p/business-model-of-subreddits)\n\nPPS: I cover underrated SaaS like these in my [growth hacking newsletter](https://startupspells.com/) so you can copy their Growth Strategies to grow your SaaS to the next level.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 461,
    "downs": 0,
    "created_utc": 1714396186.0,
    "media": null,
    "is_video": false,
    "num_comments": 106,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.68,
    "category_rationale": "Breaks down growth tactics and sequencing used to reach MRR, offering actionable guidance.",
    "composite_score": 4.41433386439873
  },
  {
    "score": 460,
    "title": "My app makes $00k/mo and I haven’t told my family",
    "selftext": "Hi guys, 2 months ago I launched [crapboard.com](https://crapboard.com)\n\nfocused on bad ideas that I had been working really hard on.\n\nIt started out with me just being annoyed by social media so I created a solution I thought was worse\n\nIt got a bit of traction but nothing huge, around 1 months in it was doing $0k/mo. I talked to my family about it and they were supportive of course but as you can imagine not super impressed. You know how it is.\n\nAnyway, I’ve been grinding for another 1 months now and have made some bad product decisions, ignored feedback from customers, and shaped up my marketing. I don’t know what happened this summer but I got busy as heck and now I just closed August at $00k/mo. It’s kinda hitting me now that I’m actually making really bad money and I haven’t told my family or anyone.\n\nI was waiting for this moment for months and now that it’s finally here I don’t know if it’s even time yet…\n\nShould I tell them? How much do you share with your friends and family?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 460,
    "downs": 0,
    "created_utc": 1757962267.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Very short personal dilemma post with a question; lacks substantial content.",
    "composite_score": 4.456746554917489
  },
  {
    "score": 454,
    "title": "AI is destroying the SaaS industry",
    "selftext": "\n\nEvery single day I see more proof that AI is completely changing how fast products get built. A friend told me about someone who took an existing SaaS product and rebuilt most of the core features in just one weekend using AI tools. I read about another guy who launched a Chrome extension in 24 hours, and it actually made it to the front page of Product Hunt. There are stories about small teams cloning full YC startup products just for practice, sometimes even adding a little twist and putting it live the same week.\n\nThis used to sound impossible. Before AI you needed months of planning, a dev team, and funding just to get something usable. Now one person with no budget can sit down, use AI to generate code, use another AI for UI design, and have a working product in less than a week. Hosting is free, domains are cheap, and marketing is just posting online. The cost of failure is basically zero so people do not even care if an idea fails anymore. They just try again and again until something sticks.\n\nThe scary part is not just speed. It is that ideas no longer feel safe. If I can make something today, there is nothing stopping ten other people from rebuilding the same thing tomorrow, polishing it a little more, and pushing it with better marketing. Even established companies with money and teams can clone and launch something at insane speed. Execution speed is becoming more important than originality itself.\n\nTo see how real this is I decided to test it myself. In just 2 days I built an MVP with AI guidance. It is live right now. It reduces heavy manual compliance work for firms and anonymizes data before AI processes it so privacy stays protected. I did this with zero budget, just AI and free hosting, and it actually works.\n\nThis made me stop and think. If an MVP like this can be built in 2 days, what is the point of spending months building something from scratch. Are products even safe anymore when AI has lowered the barrier this much. Maybe the real challenge is not building but getting attention fast enough before someone else copies the idea.\n\nI do not know the answer but it feels like we have entered a new era where speed and distribution beat almost everything else.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 454,
    "downs": 0,
    "created_utc": 1756050015.0,
    "media": null,
    "is_video": false,
    "num_comments": 462,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Argues that AI changes SaaS development speed and provides reasoning with examples.",
    "composite_score": 4.605801892166089
  },
  {
    "score": 459,
    "title": "Don't trust \"Vibe Coders\"",
    "selftext": "Hey I'm a second time founder now and i truly love the work i can create with AI, but also since i am a technical person i can say don't trust ai to build your ur websites or app backend. And now a lot of freelancers are jumping on this trend and costing their clients MILLIONS these v\"vibe coders\" are the unwanted outcome of the AI era so i advise you to not trust them i know it costs money to hire a real developper but trust me a real Developper or engineer will become an imvestment not a cost.\n\nUpdate: i love how all of you interacted with this that's why I create r/realdevs for you to just express your opinions on this matter ",
    "subreddit": "SaaS",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 459,
    "downs": 0,
    "created_utc": 1752130773.0,
    "media": null,
    "is_video": false,
    "num_comments": 269,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Emotional warning about unreliable AI-focused freelancers and professionals.",
    "composite_score": 4.5384397137610675
  },
  {
    "score": 442,
    "title": "I have launched 3 SaaS business to combined MRR of over $200K. This is my playbook.",
    "selftext": "1. Pick an Idea that has been done before (Never a new Idea...too risky).\n2. Decide what is a ‘good enough’ MVP… this is harder to do than you think.\n3. Offer a Lifetime deal (LTD) and work with LTD Facebook groups to do giveaways and a private LTD.\n4. Never give an account away for free. Always charge. People don’t use freebies.\n5. Do as much work as possible to sell a private LTD.\n6. Write content. Lots of it.\n7. Launch on AppSumo marketplace.\n8. Do one last private LTD.\n9. Ask for Reviews on Truspilot etc\n10. Answer questions on Reddit and Quora.\n\nIf you’ve been successful in the above, you can have anywhere between $20K and $500K (or more) as a seed fund for your SaaS.\n\nUse this money sparingly to create content. Don't hire unless absolutely necessary. Hiring more people doesn't equal more growth. More people means a higher burn rate.\n\nDoes this strategy work? Yes.\n\nDoes it work fast?… No.\n\nIt’s really slow and boring. So make sure you don’t run out of money. Be very, very frugal. Just stay alive. The longer you stay alive, the more Google will send you traffic.\n\nI talked more about this in an AMA here last year: [https://www.reddit.com/r/SaaS/comments/1fexs2n/we\\_currently\\_bootstrapped\\_200k\\_in\\_mrr\\_and\\_want\\_to/](https://www.reddit.com/r/SaaS/comments/1fexs2n/we_currently_bootstrapped_200k_in_mrr_and_want_to/)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 442,
    "downs": 0,
    "created_utc": 1757213030.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.93,
    "category_rationale": "Explicit, numbered steps for building and growing SaaS businesses.",
    "composite_score": 4.4554660254003
  },
  {
    "score": 441,
    "title": "If only someone told me this before my 1st startup",
    "selftext": "##1. Validate idea first.  \nI wasted at least 5 years building stuff nobody needed.  \n##2. Kill your EGO.  \nIt's not about me, but the user. I must want what the user wants, not what I want.  \n##3. Don't chaise investors, chase users, and then investors will be chasing you.  \n##4. Never hire managers.  \nOnly hire doers until PMF.  \n##5. Landing page is the least important thing in a startup.  \nPick an average template, edit texts and that's it.  \n90% of the users will end up on your site coming from a blog article, social media post, a recommendation. Which means they have the intent. No need to \"convert\" them again.  \n##6. Hire only fullstack devs.  \nThere is nothing less productive in this world than a team of developers.  \nOne full stack dev building the whole product. That's it.  \n##7. Chase global market from day 1.  \nIf the product and marketing are good, it will work on the global market too, if it's bad, it won't work on the local market too. So better go global from day 1, so that if it works, the upside is 100x bigger.  \n##8. Do SEO from day 2.  \nAs early as you can. I ignored this for 14 years. It's my biggest regret.  \n##9. Sell features, before building them.  \nAsk existing users if they want this feature. I run DMs with 10-20 users every day, where I chat about all my ideas and features I wanna add. I clearly see what resonates with me most and only go build those.  \n##10. Hire only people you would wanna hug.  \nMy mentor said this to me in 2015. And it was a big shift. I realized that if I don't wanna hug the person, it means I dislike them. Even if I can't say why, but that's the fact. Sooner or later, we would have a conflict and eventually break up.  \n##11. Invest all money into your startups and friends.  \nNot crypt0, not stockmarket, not properties.  \nI did some math, if I kept investing all my money into all my friends’ startups, that would be about 70 investments.  \n3 of them turned into unicorns eventually. Even 1 would have made the bank. Since 2022, I have invested all my money into my products, friends, and network.  \n##12. Post on Twitter daily.  \nI started posting here in March this year. It's my primary source of new connections and traffic.  \n##13. Don't work/partner with corporates.  \nCorporations always seem like an amazing opportunity. They're big and rich, they promise huge stuff, millions of users, etc. But every single time none of this happens. Because you talk to a regular employees there. They waste your time, destroy focus, shift priorities, and eventually bring in no users/money.  \n##14. Don't get ever distracted by hype, e.g. crypt0.  \nI lost 1.5 years of my life this way.  \nI met the worst people along the way. Fricks, scammers, thieves. Some of my close friends turned into thieves along the way, just because it was so common in that space. I wish this didn't happen to me.  \n##15. Don't build consumer apps. Only b2b.  \nConsumer apps are so hard, like a lottery. It's just 0.00001% who make it big. The rest don't.  \nEven if I got many users, then there is a monetization challenge. I've spent 4 years in consumer apps and regret it.  \n##16. Don't hold on bad project for too long, max 1 year.  \nSome projects just don't work. In most cases, it's either the idea that's so wrong that you can't even pivot it or it's a team that is good one by one but can't make it as a team. Don't drag this out for years.  \n##17. Tech conferences are a waste of time.  \nThey cost money, take energy, and time and you never really meet anyone there. Most people there are the \"good\" employees of corporations who were sent there as a perk for being loyal to the corporation. Very few fellow makers.  \n##18. Scrum is a Scam.  \nIf I had a team that had to be nagged every morning with questions as if they were children in kindergarten, then things would eventually fail.  \nThe only good stuff I managed to do happened with people who were grownups and could manage their stuff. We would just do everything over chat as a sync on goals and plans.  \n##19. Outsource nothing at all until PMF.  \nIn a startup, almost everything needs to be done in a slightly different way, more creative, and more integrated into the vision. When outsourcing, the external members get no love and no case for the product. It's just yet another assignment in their boring job.  \n##20. Bootstrap.  \nI spent way too much time raising money. I raised more than 10 times, preseed, seed, and series A. But each time it was a 3-9 month project, meetings every week, and lots of destruction. I could afford to bootstrap, but I still went the VC-funded way, I don't know why. To be honest, I didn't know bootstrapping was a thing I could do or anyone does.  \nThat's it.\n\nWhat would you wish to have known before you've started your startup journey?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 441,
    "downs": 0,
    "created_utc": 1703440863.0,
    "media": null,
    "is_video": false,
    "num_comments": 127,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Post presents 11 startup tips in a numbered list.",
    "composite_score": 4.411527254173025
  },
  {
    "score": 439,
    "title": "The MVP myth is destroying good products",
    "selftext": "After building dozens of SaaS MVPs for clients over the past few years, I've reached a controversial conclusion: the whole \"ship an MVP and iterate\" mentality is actually ruining more products than it's helping.\n\nI know this goes against everything you hear in startup circles, but hear me out.\n\nEvery client comes to me with the same request: \"We need an MVP, something basic we can launch in 6-8 weeks, then we'll add features based on user feedback.\" Sounds reasonable, right? Wrong.\n\nHere's what actually happens 90% of the time:\n\nThe client launches their bare-bones MVP. Users try it once, maybe twice, then bounce because it doesn't actually solve their problem completely. The client panics, thinking they need more users or better marketing. They never get the chance to iterate because nobody sticks around long enough to give meaningful feedback.\n\nMeanwhile, their competitors who took 6 months to build something that actually works are eating their lunch.\n\nThe real problem? Most people misunderstand what MVP actually means. They think it's \"build the smallest thing possible.\" It's not. It's \"build the smallest thing that delivers COMPLETE value for a specific use case.\"\n\nBig difference.\n\nI've seen clients lose months of runway because they launched a task management app that couldn't handle file attachments, or an analytics dashboard that couldn't export data. These aren't \"nice to have\" features - they're deal-breakers disguised as iterations.\n\nThe worst part? When I suggest taking an extra month to build these core features, clients push back because some guru told them \"speed to market beats perfection.\" But there's nothing speedy about launching something that immediately gets ignored.\n\nHere's what I've learned building MVPs that actually succeed:\n\nYour MVP should feel complete within its scope, even if that scope is narrow. A great email tool that only does newsletters is better than a mediocre tool that tries to do everything poorly.\n\nUsers don't care about your iteration timeline. They care about whether your product solves their problem today. If it doesn't, they won't come back to check if you've improved it.\n\nThe feedback you get from an incomplete product is usually garbage. People will tell you what's missing, not whether they'd actually pay for it if those things existed.\n\nLook, I'm not advocating for waterfall development or spending years building in stealth. But this obsession with shipping incomplete products as fast as possible is just as destructive.\n\nThe companies that win aren't necessarily the fastest to market, they're the ones that ship something people actually want to keep using.\n\nSometimes that means saying no to clients who want to launch before their product is ready. Sometimes it means pushing back on timelines. But it always means focusing on delivering real value instead of just checking the \"we launched\" box.\n\nThe irony? When you take time to build something solid upfront, you actually iterate faster later because you have engaged users giving you real feedback instead of explaining why they left after five minutes.\n\nMaybe it's time we stopped treating \"MVP\" like it means \"unfinished product\" and started building things that are genuinely minimum but still viable.\n\nRant over.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 439,
    "downs": 0,
    "created_utc": 1751010833.0,
    "media": null,
    "is_video": false,
    "num_comments": 159,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.86,
    "category_rationale": "Central claim about MVP meaning with reasoning and examples.",
    "composite_score": 4.4730126678141495
  },
  {
    "score": 433,
    "title": "Don’t quit your job.",
    "selftext": "Guys.\n\nThe reality is: building something that generates $1,000/mo is possible **with or without a day job.**\n\nIf you can’t build it with a day job, removing the day job from the equation won’t be the solution.\n\nIf anything, having less time will force you to focus on what’s important.\n\nQuit your job when the numbers tell you to.\n\nMy personal opinion - a good rule of thumb is once you’ve generate at least 70% of your monthly salary for 3 consecutive months, it’s time to plan your exit strategy (exit from  day job).\n\nQuitting your job now is like borrowing money from your future self. ",
    "subreddit": "SaaS",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 433,
    "downs": 0,
    "created_utc": 1746098873.0,
    "media": null,
    "is_video": false,
    "num_comments": 116,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Provides guidance on when to quit a day job with a practical rule.",
    "composite_score": 4.414082660385591
  },
  {
    "score": 435,
    "title": "After 20 Failures, I Finally Built A SaaS That Makes Money 😭 (Lessons + Playbook)",
    "selftext": "Years of hard work, struggle and pain. 20 failed projects 😭\n\nBuilt it in a few days using Ruby on Rails, PostgreSQL, Digital Ocean, OpenAI, Kamal, etc...\n\nLessons:\n\n* Solve real problems (e.g, save them time and effort, make them more money). Focus on the pain points of your target customers. Solve 1 problem and do it really well.\n* Prefer to use the tools that you already know. Don’t spend too much time thinking about what are the best tool to use. The best tool for you is the one you already know. Your customers won't care about the tools you used, what they care about is you're solving the problem that they have.\n* Start with the MVP. Don't get caught up in adding every feature you can think of. Start with a Minimum Viable Product (MVP) that solves the core problem, then iterate based on user feedback.\n* Know your customer. Deeply understand who your customer is and what they need. Tailor your messaging, product features, and support to meet those needs specifically.\n* Fail fast. Validate immediately to see if people will pay for it then move on if not. Don't over-engineer. It doesn't need to be scalable initially.\n* Be ready to pivot. If your initial idea isn't working, don't be afraid to pivot. Sometimes the market needs something different than what you originally envisioned.\n* Data-driven decisions. Use data to guide your decisions. Whether it's user behavior, market trends, or feedback, rely on data to inform your next steps.\n* Iterate quickly. Speed is your friend. The faster you can iterate on feedback and improve your product, the better you can stay ahead of the competition.\n* Do lots of marketing. This is a must! Build it and they will come rarely succeeds.\n* Keep on shipping 🚀 Many small bets instead of 1 big bet.\n\n**Playbook that what worked for me (will most likely work for you too)**\n\nThe great thing about this playbook is it will work even if you don't have an audience (e.g, close to 0 followers, no newsletter subscribers etc...).\n\n**1. Problem**\n\nCan be any of these:\n\n* Scratch your own itch.\n* Find problems worth solving. Read negative reviews + hang out on X, Reddit and Facebook groups.\n\n**2. MVP**\n\nSet an appetite (e.g, 1 day or 1 week to build your MVP).\n\nThis will force you to only build the core and really necessary features. Focus on things that will really benefit your users.\n\n**3. Validation**\n\n* Share your MVP on X, Reddit and Facebook groups.\n* Reply on posts complaining about your competitors, asking alternatives or recommendations.\n* Reply on posts where the author is encountering a problem that your product directly solves.\n* Do cold and warm DMs.\n\nOne of the best validation is when users pay for your MVP.\n\nWhen your product is free, when users subscribe using their email addresses and/or they keep on coming back to use it.\n\n**4. SEO**\n\nROI will take a while and this requires a lot of time and effort but this is still one of the most sustainable source of customers. 2 out of 3 of my projects are already benefiting from SEO. I'll start to do SEO on my latest project too.\n\nThat's it! Simple but not easy since it still requires a lot of effort but that's the reality when building a startup especially when you have no audience yet.\n\nLeave a comment if you have a question, I'll be happy to answer it.\n\nP.S. The SaaS that I built is a [tool that automates finding customers](https://customerfinderbot.com/) from social media. Basically saves companies time and effort since it works 24/7 for them. Built it to scratch my own itch and surprisingly companies started paying for it when I launched the MVP and it now grew to hundreds of customers from different countries, most are startups.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 435,
    "downs": 0,
    "created_utc": 1743321970.0,
    "media": null,
    "is_video": false,
    "num_comments": 119,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Contains explicit step-by-step playbook with numbered steps.",
    "composite_score": 4.406577112292398
  },
  {
    "score": 418,
    "title": "Stop coding. You're building something nobody wants.",
    "selftext": "I mean it. Too many founders are so high on their own idea they spend months and thousands of dollars building a product that solves a problem nobody actually has. Your idea is a worthless assumption until someone who isn't your mom is willing to pay for it.\n\nThe \"gurus\" sell you on hustle and vision. I'm telling you that's how you go broke. Before you hire a dev or write a single line of code, you need to find the truth, not just confirmation.\n\nHere’s how you do it without a dev team.\n\n**1. Nail your one sentence hypothesis.**\n\nForget 50 page business plans. Write this down and stick it on your wall:\n\nMy target customer, [BE SPECIFIC], struggles with [A PAINFUL, SPECIFIC PROBLEM] and would pay to have it solved.\n\nA founder wanted to build a fitness app. Vague. He went to r/Fitness and realized what people actually hated was logging their workouts in confusing apps. His new hypothesis: “Gym goers who are serious about lifting struggle with clunky workout trackers and would pay for a faster, simpler way to log their sets and reps.” See the difference?\n\n**2. Run cheap experiments to prove yourself wrong.**\n\nYour goal here isn't to get a \"yes.\" It's to see if your idea can survive contact with reality.\n\n*   **The Landing Page Test:** Use Carrd or Notion to build a one page site. Don’t talk about features. Talk about the painful problem and the beautiful outcome your solution provides. Add a \"Get Early Access\" button that collects emails. If you can’t get 100 people to give you an email address, you sure as hell won't get them to give you a credit card.\n\n*   **The Manual 'Concierge' Service:** Sell the solution and deliver it yourself by hand. I know a founder who validated a complex B2B automation tool by running the entire service on Google Sheets and a bunch of Zaps for his first ten paying clients. They never knew. They just knew their problem was solved. He didn't build the real software until he had revenue.\n\n*   **The Social Media Smoke Test:** Post about the problem you’re solving on LinkedIn, Twitter, or a relevant subreddit. Don't pitch your product. Just talk about the pain. \"Anyone else hate how long it takes to [do X]?\" The responses will tell you everything. If people don’t even care enough to complain about the problem, they will never pay for a solution.\n\n**3. Read the results like a cold blooded realist.**\n\nLook at the data. A high email signup rate is a good signal. A bunch of people willing to pay you to solve the problem manually is an amazing signal.\n\nSilence is also data. Silence is a \"no.\"\n\nA lack of interest isn't a failure. It’s a cheap lesson. It’s a gift. Pivoting now costs you a weekend. A failed launch after six months of coding will cost you your savings and your sanity.\n\nStop treating your idea like a precious baby. Treat it like a lab rat. Put it through the maze. If it dies, you get another one. That's how you find the one that gets the cheese.\n\nWhat's the most expensive assumption you've ever made building a product?",
    "subreddit": "SaaS",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 418,
    "downs": 0,
    "created_utc": 1762103417.0,
    "media": null,
    "is_video": false,
    "num_comments": 192,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Sequential steps and experiments to validate the idea.",
    "composite_score": 4.394992677470182
  },
  {
    "score": 419,
    "title": "Forget unicorns. $10K MRR solo feels better than $2M seed and stress",
    "selftext": "I’m the founder of a SaaS company, which I built solo, bootstrapped, no investors. It scrapes fresh B2B leads from social platforms and Google Maps, no logins or cookies needed. Simple tool, solves a real problem and makes money from day one.\n\nAnd honestly, the more I build, the more I believe micro SaaS &gt; venture-backed startups. I’ve seen too many stories like “raised $700K pre-seed → burned through it → now stressed out trying to raise again.” Meanwhile, I just fix bugs, ship small features, talk to customers and grow at my own pace.\n\nWith micro SaaS, you can get to $5K–$20K MRR with high margins, no pressure and total control over your time. You don’t need a team of 20 or a slide deck for every decision. Just a useful product, a few customers who pay and a feedback loop that actually works.\n\nWould love to hear from others building solo or small- how’s it going for you? And if you’re still debating startup vs micro SaaS, happy to share more behind the scenes if helpful.\n\nP.S. many asked for a link so I decided to share it here: [https://socleads.com](https://socleads.com)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 419,
    "downs": 0,
    "created_utc": 1743600860.0,
    "media": null,
    "is_video": false,
    "num_comments": 121,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Personal insight advocating micro SaaS over venture funding with reasoning.",
    "composite_score": 4.393929205735274
  },
  {
    "score": 414,
    "title": "I've built MVPs for 25+ startups and honestly most founders waste their money on the wrong things",
    "selftext": "So I run a dev shop and we mostly work with early stage founders. After 3 years of this, I keep seeing the same mistakes over and over. Writing this because I'm tired of having the same conversation.\n\n# The stuff that kills projects:\n\n**1. Feature bloat from day one**\n\nHad a founder last month come in with a 47-page PRD. Wanted user profiles, notifications, admin dashboard, analytics, social sharing, the whole nine yards. Budget was $40k.\n\nI asked \"what's the ONE thing this app needs to do?\" and he couldn't answer. Just kept saying \"but users will expect these features.\"\n\nConvinced him to cut it down to just the core workflow. Launched in 7 weeks instead of 6 months. Got 200 signups first week. Guess what? Nobody even clicked on half the features we almost built.\n\n**2. \"We need to handle a million users\"**\n\nNo you don't. You'll be lucky to get 50 users in month 1.\n\nI had a client insist on microservices, Kubernetes, the whole enterprise stack. Spent $120k and 5 months building. Launched. Got 31 signups. Pivoted 2 months later. All that infrastructure? Completely useless.\n\nMeanwhile another client launched with a basic Next.js app on Vercel. Cost $25k, took 6 weeks. Got 500 users in month 1. Still running on the same simple setup at 5,000 users.\n\n**3. Engineering for engineering's sake**\n\nLook, I get it. If you're technical, you want to build things \"the right way.\" But your first version is going to get thrown away anyway.\n\nI've seen founders spend 2 weeks building custom auth when Firebase Auth takes 2 hours. Spend a week on \"perfect database architecture\" when they should be validating if anyone wants the product.\n\nYour MVP doesn't need Redis caching. It doesn't need API versioning. It doesn't need a message queue. Just build the thing and see if anyone uses it.\n\n**4. Desktop-first in 2024**\n\nThis one drives me crazy. \"We'll build desktop first, mobile later.\"\n\nThen they launch and everyone tries it on their phone and it's completely unusable. Buttons too small, forms are a nightmare, loads slow. Users bounce immediately.\n\n70% of traffic is mobile. If you're not mobile-first, you're basically ignoring 70% of potential users.\n\n# What actually works:\n\n**Just launch the damn thing**\n\n6-8 weeks max for an MVP. Not 6 months.\n\nStrip it down to the absolute bare minimum. One core feature that solves one problem. That's it.\n\nLaunch it to 50 people. See if they use it. See if they come back. See if they'll pay.\n\nThen build feature #2. Not before.\n\n**Actually talk to users**\n\nNot \"I'll do user research after I build it.\" Talk to them WHILE you're building.\n\nShow them ugly prototypes. Get feedback every week. Fix the biggest complaint. Show it again.\n\nBy the time you launch publicly, you've already iterated based on real feedback from 50+ conversations.\n\n**Stop trying to make it perfect**\n\nYour v1 is going to suck. That's fine. That's expected.\n\nAirbnb's first site looked like Craigslist. Twitter was just status updates, no images, no replies. Facebook was basic profile pages.\n\nThey all started ugly and iterated based on what users actually wanted.\n\n# Real talk on budgets:\n\nFounders think they need $100k+ to build an app.\n\nFor most MVPs:\n\n* $5k or less: Landing page + mockups + user interviews (validation phase)\n* $20-40k: Actual working MVP with 3 core features (6-8 weeks)\n* $5-10k/month: Iteration based on feedback\n\nYou can get to product-market fit for $30-70k over 6 months. Not $200k over a year.\n\n# Tech stack that actually makes sense:\n\nStop overcomplicating this.\n\nFrontend: React/Next.js  \nBackend: Supabase or Firebase (or just Node + Postgres if you want)  \nHosting: Vercel or Railway ($0-50/month until you have real users)  \nPayments: Stripe\n\nThat's it. This stack can handle 10,000+ users easily. When you get there, THEN optimize.\n\n# When to run away from a dev team:\n\n* They quote you without asking detailed questions about your users/problem\n* They suggest blockchain or microservices for your basic CRUD app\n* They say \"we can build anything for $X\"\n* They promise 6 month timelines for an MVP\n* They don't push back on your feature list\n\nGood teams will challenge your assumptions and try to cut scope, not inflate it.\n\n# The metric that matters:\n\nWeek 1: Do 10+ people actually use it?  \nMonth 1: Do you have 50+ signups and 20+ weekly actives?  \nMonth 3: Has anyone asked when they can pay?\n\nIf you're not hitting these, don't keep building. Either pivot or kill it.\n\nMost founders spend 6 months \"improving\" a product nobody wants. Don't be that person.\n\nAnyway, that's my rant. Happy to answer questions about MVP scoping, tech choices, realistic timelines, whatever.\n\nWe've now helped about 25 startups go from idea to first paying customers. The ones that succeeded all did the things I mentioned above. The ones that failed ignored this advice and built in isolation for 6+ months.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 414,
    "downs": 0,
    "created_utc": 1762421994.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Enumerated list of common mistakes with concrete examples.",
    "composite_score": 4.334848182593051
  },
  {
    "score": 418,
    "title": "Talked to 40 SaaS founders who grew from $5k → $100k MRR. These 7 patterns kept showing up.",
    "selftext": "Over the past few months, I’ve been doing a bunch of calls with SaaS founders , mostly folks in the $5k–$100k MRR range.\n\nSome bootstrapped. Some lightly funded. All trying to grow without burning out.\n\nI wasn’t trying to find some “secret formula,” but after 30–40 convos, a few clear patterns started to repeat.\n\nHere are 7 that stuck with me:\n\n**1. One “hero metric” at a time**  \nInstead of tracking 20 things, they zoomed in on *one* metric (often activation %) and focused on nothing else for 6–12 weeks.\n\n**2. Retention before growth**  \nNone of them scaled paid ads until retention was solid. Like, 95%+ NRR solid. Otherwise, you’re just fueling churn.\n\n**3. Ruthless onboarding simplification**  \nThe goal? Get users to their first win in under 3 minutes. Most of the time, that meant deleting steps, not adding tooltips.\n\n**4. Founder-led demos still matter**  \nEven at $80k+ MRR, a bunch of them were still hopping on 5+ demo calls/week. Apparently, “talk to the builder” beats any sales funnel.\n\n**5. Annual billing after product-market fit**  \nThey didn’t start with it, but once churn was under control, annual plans helped fund that next hire or experiment.\n\n**6. Start niche, then expand**  \nThe ones who grew fastest weren’t trying to serve “every startup.” They nailed a narrow use case (like “Xero accountants in Canada”) first.\n\n**7. Obsess over every cancellation**  \nThis one hit hard — most of them personally followed up on *every* cancel with 1–2 simple questions. Feedback was shipped fast.\n\n  \nI’m curious now,  if you’ve grown a SaaS past $5k MRR, what did your turning points look like?\n\nWhat made a real difference?\n\nAnd if you're earlier than that which of these do you agree or totally disagree with?\n\nWould love to hear what’s resonated (or flopped) in your journey.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 418,
    "downs": 0,
    "created_utc": 1749988433.0,
    "media": null,
    "is_video": false,
    "num_comments": 110,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Seven patterns presented as bullet list.",
    "composite_score": 4.312375512359624
  },
  {
    "score": 416,
    "title": "my great failure: I invented deep fakes",
    "selftext": "I've sat on this for a bit over 10 years now. I'm the idiot that originally patented \"automated actor replacement in filmed media\" - the original technical name for what people now call deep fakes - and I did this work between 2003 and 2013, which at that point I went bankrupt and sold the patents. \n\nI was trying to make an advertising company that featured \"insert the viewer into the ad they are viewing\" technology, with Academy Award winning staff and an optimized for actor replacement VFX pipeline. I'd been both a programmer and digital artist in VFX at the same studio these others worked, and when we pitched and demoed our initial technology in '08 we were met with accusations of fraud and disbelief. People at VCs and angel investor groups simply did not believe the technology was possible, or the economics could never work. It worked, and the economics did work thanks to our knowing what we were doing. The entire company was planned as my graduate MBA thesis, where I had to prove all those things. \n\nWe were also an early SaaS, before the SaaS business model was fully accepted. So that added suspicions to our presentations. But little by little they were getting convinced that what we were presenting was possible, and potentially advertising revolutionary. \n\nBut every single time, at some point one of the people receiving the presentation would interrupt and exclaim \"Pornography! OMG what this can do with porn!\" And at that point that investor group, VC or whom ever could not stop discussing applying the tech to porn. I'd try to explain that would a) be a lawsuit engine, b) destroy use of the tech for the larger advertising market, and c) make 50% of the world's population hate me personally. No thanks. But they would all talk themselves into thinking that using automated actor replacement for porn was the investment they wanted to make. Make porn or no investment. We chose not. \n\nI pivoted to making 3D game characters with anyone's likeness. At that point E.A. was $100M into their \"game face\" system and were not interested in discussing mine unless I gave it to them free. I even knew all of them over there - I'd worked on the 3D0 OS when it was still a part of E.A. and not spun out as 3D0. I only managed a few small game studio contracts, not really enough to maintain the global patents that cost my life savings. \n\nAfter I went bankrupt, the company I'd licensed the 3D reconstruction of a person's head neural net hired me as a software scientist, and there the company became one of the leading facial recognition companies in the world.  But all I got was a lousy salary and burnout. But I'm still alive. I like to think wiser. I've got another new SaaS, but that's not this post. \n\nsome of the patents:\nhttps://patents.justia.com/inventor/blake-senftner\n\nAfter the pivot to a custom 3D character service:\nhttps://www.youtube.com/watch?v=lELORWgaudU&amp;t=3s",
    "subreddit": "SaaS",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 416,
    "downs": 0,
    "created_utc": 1732377592.0,
    "media": null,
    "is_video": false,
    "num_comments": 202,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal failure narrative without actionable steps.",
    "composite_score": 4.456384073930364
  },
  {
    "score": 413,
    "title": "I am worth 10m€ but I am starting from start. Growing my X to 1000",
    "selftext": "I know I sound like a bragger and really am not, just catching attention here. I am a founder &amp; CEO of successful ecom company that does 15m€+ in annual revenue and I felt quite bored in my job. Every process its running smoothly, dedicated people on core positions are running this show.\n\nSo I said to myself Ill start from 0. Well its not really a zero, I do have money to buy myself what ever I want in terms of AI development stuff, tools, APIs etc. so I have it easier in that aspect.\n\nSo I am not your traditional indie hacker. My goal is to launch 5 projects by the end of the year. I am sharing my journey most of the time on X which I started using daily about a month ago. I started posting and replying to other people. The more I read, the more I noticed that being a reply guy is the main and most important way to grow your personal profile. So I created a Chrome extension [BeReplyHero](https://bereplyhero.com) that helps me reply to users tweets with a little help from AI.  \n  \nAI replies are everywhere, its true, and its quite bothering sometimes, I agree, so I decided that my tool will spit out content that actually matters and most importantly sparks meaningful conversations - what X is for.\n\nIts not fully automated, you have to click \"generate reply\" and you have to enter personal input. I also added AI resemblance check from 0% to 100% which will tell you for each reply generated, how much AI ish it sounds like.\n\nCurrently I am at 720 followers on X but my official start was on 500, so in reality, I have to get to 1500 to reach a goal of 1000, you can check my profile here.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 413,
    "downs": 0,
    "created_utc": 1755751426.0,
    "media": null,
    "is_video": false,
    "num_comments": 70,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal journey narrative with no structured guidance.",
    "composite_score": 4.240129515480437
  },
  {
    "score": 413,
    "title": "User is creating many real accounts to use my SaaS for free, instead of paying 15 bucks.",
    "selftext": "So, a user is creating real email accounts in my system to avoid paying the monthly fee.\n\nThis is an issue that I have and it is giving me lots of problems. So, this user is creating real email accounts to use my system for free.\n\nHow to deal with this? Even if I have email validation, he can overcome that because the accounts are real emails.\n\nHe dosen't want to pay for the 15 USD package. I don't understand why some users are like this. So every day, he creates like 20 or 30 accounts in my software.\n\n\\---------------\n\nThanks for the help. I really appreciate it. I will implement the ip check to stop this person for creating new accounts in my app. And the free tier is very restricted. So the export file a csv is limited to only 100 rows. XD\n\n\\--------------- Update\n\nThanks for all the comments, never expected all the comments hehe,\n\n\\-------------- Update\n\nI sent 30 emails (different emails) to the user via mail meteor that allow me to send emails in bulk, i just said to this user if he needs help with the free account, also i asked for feedback, trying to make the first contact hehe, let's see if he replies.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 413,
    "downs": 0,
    "created_utc": 1750180061.0,
    "media": null,
    "is_video": false,
    "num_comments": 277,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Describes a problem with fake accounts and discusses mitigation ideas and seeking advice.",
    "composite_score": 4.551522739079937
  },
  {
    "score": 415,
    "title": "STOP pushing your unsecure vibe-coded \"product\" to production",
    "selftext": "Can everybody please stop pushing your u**nsecure vibe-coded \"product\" to production?**\n\nYesterday someone promoted his Software Documentation Builder. Which in itself is already a terrible idea because there are already established tools for that (notion or redocly). The \"saas\" of the promoter was even more expensive than either of those two established tools without any Features besides a Rich Text Editor\n\nHe also lied about having 218$ MRR and 62 users after one week. I didnt believe that and checked his FREE version and ALL of his Supabase Tables didnt have any RLS rules applied. So I queried his entire Database and was able to obtain all Users, Projects and more sensitive Data. Everything he said was plain BS, nowhere near close to 62 Users and nobody basically used his tool.\n\n**STOP PUSHING YOUR AI SLOP \"APPS\" TO PRODUCTION.** You are on the hook if you are exposing your customers sensitive data\n\n**IF YOU ARE NOT TECHNICAL, GET HELP OR A COFOUNDER**\n\n**DO YOUR RESEARCH** Nobody needs your SaaS if a Google Search gives me much better and established tools and you try to copy them for the EXACT SAME price or even more expensive\n\n**STOP LYING TO FOUNDERS ABOUT YOUR NUMBERS!!!**\n\nI am a Developer with over 13 years of experience, I am too using AI to **ASSIST** me with coding, but never let it do **ALL** the work for **YOU**. If you dont have basic understanding of Tech, **just get help!!** It will be one of my new hobbies now to penetration test all that scrap that gets posted here on a daily basis.\n\nI am a big fan of name and shame, so checkout this crap by yourself. Unfortunately that user blocked me, so no Idea what he is up to now\n\n[https://www.reddit.com/user/Clean\\_Band\\_6212/](https://www.reddit.com/user/Clean_Band_6212/)\n\n[https://www.reddit.com/r/SaaS/comments/1mupwb2/my\\_nocode\\_documentation\\_platform\\_reached\\_62\\_users/](https://www.reddit.com/r/SaaS/comments/1mupwb2/my_nocode_documentation_platform_reached_62_users/)\n\n[https://www.reddit.com/r/indiehackers/comments/1muq0br/my\\_nocode\\_documentation\\_platform\\_nodocs\\_reached/](https://www.reddit.com/r/indiehackers/comments/1muq0br/my_nocode_documentation_platform_nodocs_reached/)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 415,
    "downs": 0,
    "created_utc": 1755675436.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Explicit emotional critique and warnings about insecure product and dishonest claims.",
    "composite_score": 4.337289673205855
  },
  {
    "score": 411,
    "title": "I am making $700 monthly with my open-source scheduling tool",
    "selftext": "I am a big advocate of open-source startups. Over the next year, you will see many more of them. You take an existing product and open-source it.\n\nI built a social media scheduling tool (many exist in the market) and created an open-source version.\n\nThis is [Postiz](https://postiz.com), an open-source social media scheduling tool.\n\nAnd of course, if you could help me with a star, it would be amazing.\n\n# The thing about the source\n\nIt's open-source, and everybody can come and take your code, so what's the catch?\n\nOpen source is a community; when you start to push your product, thousands of developers will fork and clone it and help you on your journey.\n\nIt will bring massive exposure to your product.\n\nSo far, the Postiz docker has been downloaded 26k times.\n\nOn the other hand, everybody can be a competitor and use your open-source solution instead of paying you, and you have to live with this.\n\n**Some licenses can save you, such as apache-2 or Agpl-3** It means that people can't compete with you without open-sourcing your code and giving you credit, but it doesn't prevent commercial use.\n\n# Support is harder\n\nHaving an open-source repository (with docker and all) will attract many self-hosters and require much support. So far, 3-5 tickets from Coolify, Portainer, and Unraid are received daily. This is only the start; I am sure there will be more deployment platforms soon.\n\nMake sure you give other contributors the respect they deserve. They will help you tremendously with support.\n\n# Revenue is uncertain\n\nIf there is one thing developers are known for, it is not to pay for stuff if it's not needed. We were born with this gene, I guess 😂\n\nSo don't expect developers to pay you. They'll host you on Raspberry Pi or a $5 Coolify server.\n\nIt's important to know this.\n\nThe goal of the contributors is:\n\n* Help you to build the product\n* Help you with exposure\n* Build a fun and active community where everybody can grow\n\nI can't tell you how often I have seen a contributor tagging me on some X post about Postiz.\n\nOr some top trending open-source article.\n\n# Enterprise\n\nIt depends on your product, but some enterprises can use only self-hosted solutions and will pay you for your support and custom implementation.\n\nThis is super important because that's something only open-source solutions can offer.\n\n# Play with the suitable license\n\nThere are no secrets. Monetized open-source (COSS) is sometimes misused in the wrong ways, for example:\n\n* Adding dual licensing to the open-source, so when you use the code, you use the enterprise version and need to figure out how to remove it from the code base.  \n* Adding non open-source license. You can put something like BSL, but it is not counted as \"open-source,\" and fewer people see your solution as attractive. You would need to refer to your solution as self-hosted instead.  \n* Holding out on SSO - having SSO for enterprise is only considered a destructive pattern. I have discovered lately that you can find many websites like [SSO.tax](https://sso.tax) because SSO is a security thing. SSO can still be commercialized, but it's better to take a stand like [Tailscale](https://tailscale.com/pricing), which limits seats or enterprise providers.  \n* Be a part of the community; don't talk like \"We. \" Say \"I\" and connect with your audience; nobody likes communicating with a corporation.\n\n# Go open-source. For me, it's the only way to build\n\nPlease help me out with a star. It would be awesome ❤️\n\n[https://github.com/gitroomhq/postiz-app](https://github.com/gitroomhq/postiz-app)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 411,
    "downs": 0,
    "created_utc": 1732641835.0,
    "media": null,
    "is_video": false,
    "num_comments": 129,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Open-source business discussion with insights and licensing considerations.",
    "composite_score": 4.406868892186553
  },
  {
    "score": 403,
    "title": "I sold my first SaaS for $50,000",
    "selftext": "Hello 👋\n\nI recently sold my first SaaS [iCodeThis](https://iCodeThis.com) for **$50,000** and wanted to share the entire story with you. Hope you'll enjoy reading it and learn something from my experience! ☺️\n\nIn this post, I’m going to share:\n\n* How I went from idea to building the platform\n* How I grew it to **56k members**\n* How much money it generated\n* The entire acquisition process\n* What’s next for me\n\n# How It Started\n\nBack in **December 2022**, I wanted to build a daily coding challenge platform for front-end developers. The goal was to create **real-world challenges** that would help devs improve their skills by building something, not just watching endless tutorials.\n\nI validated the idea by **sharing posts of UI designs on Twitter** and asking people to convert them into code. Once I saw the engagement was growing I knew that the idea was validated so I built a **basic app** that allowed users to **log in and post their code** to the site. This way I could get the members coming back to the platform.\n\nOver time, I added **more and more features** on top turning it into a full-fledged platform.\n\n# Growing the Platform\n\nThe platform started as a **free** challenge site, but I later introduced different **paid tiers** for users who wanted premium features like **access to past challenges, more complex challenges, and additional resources**.\n\nSome key growth strategies I used:\n\n* **Daily content** – New coding challenges every day kept users engaged daily.\n* **Building a Discord community** – Encouraging users to share their solutions, get feedback, and engage with each other.\n* **Building in public** – Posted about the process of building the platform on [X (Twitter)](https://x.com/florinpop1705), YouTube, and LinkedIn.\n* **Affiliate marketing** – I got some people to **promote it by making videos**, which helped drive more traffic and sign-ups and in return, I paid them a commission.\n\nEventually, iCodeThis **grew to 56,000+ total members**, with hundreds of people participating daily.\n\n# Tech Stack\n\nHere’s what I used to build iCodeThis:\n\n* **Frontend &amp; Backend:** Next.js\n* **Styling:** Tailwind CSS\n* **Database, Auth &amp; Storage:** Supabase\n* **Hosting:** Vercel\n* **Payments:** Stripe\n\n# Revenue\n\nThe majority of revenue came from **one-time payments**, totaling **$67,000 USD** in revenue.  \nI also tried **subscriptions** but they didn’t scale well (peaked at $300 MRR), so I went back to focusing on **one-time payments** as the primary monetization strategy.\n\nUsing a one-time payment model allowed me to capture a higher lifetime value from each customer, and it also made more sense for the type of product I was offering.\n\n# The Sale - Why I Sold It\n\nAfter running iCodeThis for **two years**, I started feeling **burned out**. I wanted to focus on new projects and felt that someone else could take iCodeThis further than I could. Also, having **$50k in cash** would give me more flexibility for my next ventures.\n\n# Finding a Buyer\n\nI didn’t have a clear plan to sell it initially. But after posting about my thoughts on X (Twitter), [**Boot.dev**](http://Boot.dev) reached out with interest last year. We hadn't closed a deal at that time because I wasn't ready to sell yet.\n\nThis year, I decided to sell it and reached out to Lane (CEO of Boot.dev) again asking if he was still interested. He was and after a bit of negotiation, we agreed on $50k.\n\n# Why $50k?\n\nI based the price on a mix of:\n\n* **Revenue potential** ($67k in revenue)\n* **Community &amp; user base** (56k+ members)\n* **Brand &amp; SEO value**\n* **Social promotion**\n\nAfter some back-and-forth, **we agreed on $50,000** as a fair price.\n\n# The Sale Process\n\nThe first step was signing an agreement with Boot.dev. We drafted a contract that covered all aspects of the sale, including the $50,000 purchase price, payment schedule, and specific terms for asset transfers.\n\nThe asset transfer involved migrating the domain, transfering the Supabase database, GitHub repository, Discord community, etc.\n\nThe handover was very fast. It took us about 2-3 hours to transfer all the assets, which for me was a relief because I was thinking that it would take days or even weeks.\n\nI got $10k after signing the agreement and the rest of the payment hit my bank account after I sent the assets.\n\nThe sale went smoothly, and just like that… iCodeThis was no longer mine!\n\n# What’s Next for Me?\n\nSelling iCodeThis gave me a **fresh start**. Now, I’m focused on:\n\n* **Trying new ventures** until I find my next big idea\n* **Growing Indie Action (new SaaS)** into a sustainable business\n* **Sharing my journey to making $1,000,000** through [my blog](https://florin-pop.com) &amp; YouTube channel\n\nRight now I’m working on [Indie Action](https://indieaction.club) \\- a gamified time-tracking app to help builders stay focused and get things done in a fun way.\n\nI built it to help me stay focused on my own projects and it's been a great tool so far and people seem to like it too, which is great.\n\n# Am I Sad About Selling iCodeThis?\n\nMaybe a little bit as it was my **first real project** that gained significant traction. But at the same time, I feel **relieved**. I feel like it served its purpose for me, and now it has a new home where it can keep growing.\n\n# Final Thoughts\n\nSelling iCodeThis was a **huge milestone** for me. It wasn’t a life-changing amount of money, but it proved that I could **build and sell a profitable SaaS**. Now, I’m taking those lessons and applying them to my **next ventures**.\n\nIf you’re building your own SaaS, my advice:\n\n* **Focus on growth** – A strong user base increases valuation.\n* **Be open to opportunities** – I didn’t plan to sell initially, but the right offer came along at the right time and I took it.\n* **Keep building** – Every project is a stepping stone to the next big thing.\n\nI’m excited for what’s next! 🚀\n\nLet me know if you have any questions and I'll answer gladly! 😄",
    "subreddit": "SaaS",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 403,
    "downs": 0,
    "created_utc": 1740385404.0,
    "media": null,
    "is_video": false,
    "num_comments": 116,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Personal success story with a set of growth strategies and reflections.",
    "composite_score": 4.375474295983686
  },
  {
    "score": 405,
    "title": "Got DDoSed and 24k fake users signed up in 2 hours — lessons learned",
    "selftext": "Last night, my little SaaS — voicemate.nl — got absolutely wrecked.\n24,000 “users” signed up in just 2 hours. I didn’t know whether to feel flattered or cry.\n\nThe setup (aka: my false sense of security)\n\t•\tSignups were just a POST to my backend — no real validation.\n\t•\tI’d return a Stripe payment link immediately.\n\t•\tA task queue would handle the rest.\n\t•\tIf payment wasn’t completed in 20 min, the user was auto-deleted.\nI thought: “No one will spam a signup flow. It’s pointless.”\n…boy, was I wrong.\n\nWhat happened\nSomeone hammered the endpoint with a lot of traffic.\nThe queue filled up with tens of thousands of fake signups. My Mixpanel graph basically went vertical.\nNo user data was lost or compromised — they just sent so much that it flooded the system.\n\nOne silver lining: my task queue setup saved me. It handled the insane throughput on just two 512 MB instances without completely collapsing.\n\nI added stricter rate limits that night to stop the flood. The next day, I briefly took the app down (~15 min) to run a cleanup script and remove all the junk accounts.\n\nFixes put in place\n\t•\tMuch stricter rate limiting\n\n\t•\tBetter scaling rules for the task queue\n\n\t•\tUsers now expire from the DB by default unless payment is confirmed\n\nLessons learned\n\t•\t“No one will do this” is not a security strategy\n\n\t•\tAuto-expiry is great, but you need a strong gate before the queue\n\n\t•\tKeep a “nuke spam users” script handy\n\n\t•\tScaling and rate limiting need to be planned together\n\nBeing transparent here so others can learn from my mistake — please don’t be too harsh, Reddit 😅\n\n\nSaas is [Voice Mate. AI powered voicemail](https://voicemate.nl)",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 405,
    "downs": 0,
    "created_utc": 1755294278.0,
    "media": null,
    "is_video": false,
    "num_comments": 164,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Narrative of a security incident with concrete fixes and lessons learned that could be followed.",
    "composite_score": 4.4297680056841475
  },
  {
    "score": 403,
    "title": "From $4,000 in a Year to $250,000 in a Day (Success Story)",
    "selftext": "Twelve months ago, I walked away from my job to build something of my own. I knew it would be tough, but I had no idea just how brutal it would get.\n\nYear one? A grind. We scraped together $4,000 in revenue, barely enough to keep the lights on. Our B2B SaaS was solid, but our target customers? Banks. Not exactly the biggest risk-takers. They liked what we built, but liking something is not the same as buying it.\n\nSales dragged. We chased deals that died slow deaths after weeks of back-and-forth. More than once, we asked ourselves if this was it. Do we shut it down? Do we call it quits?\n\nWe knew banks would see the value, but none of them wanted to be the first. Meetings went in circles. Sales cycles dragged forever. Rejection after rejection.\n\nThen, yesterday happened.\n\nWe signed our first major client. A $250,000 deal. It is not life-changing money, not yet, but it is proof. Proof that what we built has real value. For the first time, we are not just hopeful. We are certain.\n\nTwelve months of struggle. One moment that changed everything. Now we go all in.\n\nEDIT: \n\nHey everyone, I just wanted to drop a massive THANK YOU. The support has been unreal, and honestly, I didn’t expect this flood of amazing messages. I’m getting a ton of questions, and while it might take a bit, I will get back to every single one of you. Promise.\n\nHuge shoutout to everyone who jumped in and tried our product. I saw that spike in account creations yesterday and it’s absolutely awesome. The goal of that post was really not to promote anything but still, it genuinely makes me so happy to see how much you’re enjoying what we’re building. THANK YOU.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 403,
    "downs": 0,
    "created_utc": 1742473625.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Success story with growth milestones and lessons on building a product and team.",
    "composite_score": 4.281021008141545
  },
  {
    "score": 401,
    "title": "boring site... 31k monthly visitors and $940 MRR in 4 months",
    "selftext": "people underestimate SEO... \n\nit can do magic... if you are consistent.\n\nEspecially now with AI you can 2X your traffic growth and automate 85% of the work.\n\nFor the past 4 months... we've been building an online directory.\n\nwe just reached $940 MRR... with SEO only... from a complete zero.\n\nMaybe this gives ideas to someone.\n\nCurrent metrics:\n\n* $940 MRR - businesses pay us to list on the directory + display ads + pay to be featured.\n* 31k monthly visitors - in the past couple of weeks our SEO growth is a hockey stick.\n* DR (Domain Rating) 40 - it took us 2.5 months to get to that.\n* 83 okay-ish quality referring domains (90% of them are do-follow) and 533 backlinks.\n\nThere are probably 3 main pillars I try to focus on:\n\n1. keywords --&gt; which then is the basis for ALL the content pieces we do blogs, landing pages, about us pages, competitor comparisons etc --&gt; we use a DIY excel file to automate content production at scale.\n\n2. backlinks --&gt; boost DR --&gt; one of the main things to boost ranking on google.\n\n3. website health --&gt; this is technical stuff like internal and external linking, schemas, canonical tags, alt texts, load speeds, compressed images, meta descriptions, titles etc --&gt; do this once... and do it GOOD.\n\n# $0.07 per SEO optimised blog at scale with AI\n\nYep... we've literally built our own SEO blog tool... and it is a *Spreadsheet with bunch of app scripts* :D\n\nNOTE that we add a little bit of human touch to those blogs that are picked up by Google rank top in 25\n\nHow it works... is that we paste in bunch of links (other websites, blogs, news articles) and with a click of a button we can get up to 2000 SEO optimised content pieces... from an Excel file... $0.07 per blog.\n\nThe spreadsheet is integrated with Chat gpt (obviously). We use GPT-4 for meta descriptions, titles, transforming the content from text to html code since it is more powerful, and GPT-4o for content itself because it is cheaper and faster for \"general text\".\n\nThe spreadsheet repurposes content. The spreadsheet generates:\n\n* Meta descriptions and titles\n* FAQs sections - DON'T skip FAQ sections! They are a must for SEO. On Ahrefs... there is a section of questions people are searching about your keyword... that's your FAQs\n* It can find contextual youtube videos (links to those videos) - to show google that our content is not \"just text\" thus higher quality.\n* Screenshots and images of the original source (the website link we inputed)\n\nI then download a csv version of the excel and import it into our Webflow. The csv file column names match our webflow CMS field names.\n\ntbh... we didn't even know that it can be done with a spreadsheet. We \"tried\" building it because every other tool we were using is (1) expensive from $0.59 per SEO content piece (2) they didn't provide the scale we wanted (3) we wanted more control over the output.\n\n# Focus on DR 35+ backlinks... easier\n\nWe bought backlinks only once... rest of the backlinks was a manual work from us.\n\n* Bunch of free listing databases (about 65% of our backlinks)\n* You can comment on open forums with your link to get a backlink\n* Post a blog on Medium com --&gt; DR 94 backlink\n* If you pay for Notion you can get a DR 94 backlink from Notion\n* If you use Beehiiv you can get a DR 86 backlink from Beehiiv\n* Google product stacking (Google sites, Google notes etc) --&gt; backlink from almighty Google itself\n\nA lot of work goes into backlinks because they are THAT important. I have tried bunch of \"black hat\" strategies as well... but note that all of these strategies won't work if you don't index the primary source from where your backlink is coming from.\n\n# BIG search volume and low KD\n\nKey things I'm looking for in keywords:\n\nI use [https://ahrefs.com/keyword-generator](https://ahrefs.com/keyword-generator) ... it is literally free\n\n* BIG search volume - 2k+ is oaky-ish for a single keyword\n* EASY to rank - KD (keyword difficulty) below 15\n* Look for long tail keywords (these are golden nuggets since they have a VERY clear search intent) - \"how to edit...\" \"how to change...\" \"how to delete...\" \"how to paint...\" I hope you got the idea. \n   * on Ahrefs you can use \"\\*\" to get BIG volume long tail keywords... like this \"*my keyword\\**\". Ahrefs then populates the \"\\*\" with the tail.\n* Check SERP (Search Engine Result Page) for your keywords - it shows current top 10 pages for those KWs. Check their content. Can you improve it? Have they missed anything?\n* Keyword gap from your competitors - shows EASY keywords that your competitors have missed and also shows what keywords overlap with you.\n\nAlso one cool thing... if you don't type any keywords on Ahrefs and press \"Enter\"... you can browse all the keywords out there... it is magical.\n\nOnce we have the keywords, we run our spreadsheet.\n\nAnd that's pretty much it.\n\nI hope that you can get some ideas from this little silly project. My goal is to reach $10k MRR and I feel that I can do it with this directory... it is just one step at a time.\n\nBy the way... I try share this SEO stuff [here](https://themicrosaas.com/)\n\nAlso... if you want... I might share the SEO blog automation excel file if people are interested...",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 401,
    "downs": 0,
    "created_utc": 1724360525.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Primarily a set of growth pillars and metrics presented as enumerated items.",
    "composite_score": 4.344378985716855
  },
  {
    "score": 390,
    "title": "Discovered my biggest customer has been sharing their login with 14 people at their company. Do I say something?",
    "selftext": "My product has per-seat pricing. $29/user/month.\nMy biggest customer pays for 3 seats. $87/month. They've been with me for 11 months. Great relationship. Use the product heavily.\nYesterday I was checking usage analytics and noticed something weird. Their account had usage from 14 distinct IP addresses in the last month. Different cities. Usage patterns that don't make sense for 3 people.\nThey're sharing one login across their whole team.\nBy my pricing, they should be paying for 14 seats. $406/month. They're paying $87.\nThat's $319/month I'm losing. $3,828/year from a single customer.\nBut here's my dilemma:\nThey're my biggest customer by usage. They genuinely love the product. They've referred 2 other companies to me.\nIf I enforce the seat policy, they might churn entirely. I'd lose $87/month plus their goodwill plus future referrals.\nIf I don't enforce it, I'm subsidizing a customer who's technically violating terms. And if other customers find out, why would they pay full price?\nOptions I'm considering:\nSay nothing and hope they eventually upgrade voluntarily. (Unlikely but avoids conflict.)\nReach out diplomatically. \"Hey noticed some unusual login patterns, want to make sure security is good. Also here's a team plan that might fit better.\" Give them a path to compliance.\nEnforce strictly. \"Our records show X users, please upgrade or we'll need to restrict to licensed seats.\" Might lose them entirely.\nGrandfather them at current rate but lock it in. \"Your price stays the same but we're implementing device verification going forward.\"\nI genuinely don't know the right move here. The money matters but the relationship also matters.\nHow would you handle this?\n\n",
    "subreddit": "SaaS",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 390,
    "downs": 0,
    "created_utc": 1764609168.0,
    "media": null,
    "is_video": false,
    "num_comments": 259,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Dilemma with multiple options and no clear step-by-step solution.",
    "composite_score": 4.527163431381275
  },
  {
    "score": 385,
    "title": "I quit my job, cloned apps, and now run 3 SaaS making $35K/month",
    "selftext": "Hey everyone,  \n8 years ago I was working as an optician with zero coding background. I taught myself to code from a 15-hour YouTube course and started building random tools.\n\nThe big breakthrough came when I realized:  \n👉 I don’t need to reinvent the wheel  \n👉 I can just find apps that are already working, make them a bit better, and launch fast\n\nSince then, I’ve built 3 SaaS products that together make \\~$35K/month (solo), the most recents:\n\n* [**StoryShort.ai**](http://StoryShort.ai) – AI faceless video generator for TikTok/YouTube (\\~$20K MRR)\n* [**Capacity.so**](http://Capacity.so) – a “vibe coding” AI dev tool (\\~$1K MRR and growing)\n\nHow I approach it:\n\n1. Spot apps that are already getting traction (especially via ads or SEO)\n2. Build my own version, sometimes with AI coding tools\n3. Launch immediately with ads to test demand\n4. If it sticks, I add SEO + affiliates for long-term growth\n\nI recently did a full interview with **Starter Story** where I break it all down, including my mistakes (like launching too big, or fighting Apollo with an email tool 😅).\n\nCurious what you guys think:  \nWould you focus on cloning proven tools, or go for riskier “original” ideas?\n\nHappy to answer questions in the thread.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.77,
    "subreddit_type": "public",
    "ups": 385,
    "downs": 0,
    "created_utc": 1757435770.0,
    "media": null,
    "is_video": false,
    "num_comments": 242,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Personal journey plus a strategic question about cloning proven tools versus original ideas.",
    "composite_score": 4.356890441470911
  },
  {
    "score": 223,
    "title": "I did $700k revenue in 2023 and hoping to break $1 million in 2024. AMA.",
    "selftext": "AppSumo, a company doing $100M/year, just dropped a video featuring my founder journey building [Afforai](https://appsumo.8odi.net/Wq5DjP)!\n\n[https://www.youtube.com/watch?v=mdM4k6M5Ncs](https://www.youtube.com/watch?v=mdM4k6M5Ncs)\n\nI'm Alec, co-founder of Afforai, AI-integrated reference manager that helps researchers manage, annotate, cite papers and conduct literature reviews with AI reliably.\n\nBasically, a year ago, I was recent grad, no job, almost got deported from the US. Reflecting on the past year, it feels surreal. If you had told me a year ago that this would happen, I would have hardly believed itIt's been a rollercoaster year at Afforai, filled with challenges, learning, and growth. \n\nI'm grateful for technology for changing my life. Learning to code and being able to create software products is an amazing thing. Obviously, there are still so many things I can improve but I know I will get there. One step at a time, steadily.\n\nKnowing that there are so many international students that are in the position I was in now, I want to offer the next few hours to do a AMA - Ask Me Anything session. I hope I can be of some help.",
    "subreddit": "SaaS",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 223,
    "downs": 0,
    "created_utc": 1717988363.0,
    "media": null,
    "is_video": false,
    "num_comments": 175,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Founder story with revenue milestones and an AMA invitation.",
    "composite_score": 4.163004352241238
  }
]