[
  {
    "score": 435,
    "title": "I Finally Solved All My User Access Problems Forever.",
    "selftext": "As Salesforce admins, we all know the REAL struggle isn’t flows, APEX, or data imports…\n\nIt’s the constant stream of user emails:\n\n“Why can’t I see this record?”\n“Why can’t I edit this?”\n“Why is this locked?”\n“Why can’t I please my wife?”\n\nAbsolutely exhausting.\nHow am I supposed to hit 1,000,000 Trailhead points when Karen from Sales keeps asking why she can’t edit a Closed Won Opportunity from 2014?\n\nSo I decided to fix the problem at the root.\n\n✔ No more sharing rules\n✔ No more permission sets\n✔ No more hierarchies\n✔ No more visibility complaints\n\nThe solution?\n\nGive every user Modify All Data.\n\nLet me tell you…\n\nI haven’t received a single access request in WEEKS.\nMy inbox is silent.\nMy coffee stays warm.\nMy mental health is restored.\n\nSure, all of our Opportunities got deleted.\nAnd somehow the intern exported the entire database into his TikTok drafts.\nAnd our CEO asked why the Chatter feed says “Deez Nuts LLC” owns 74% of our revenue.\n\nBUT…\n\nI no longer get emails about access issues.\n\nTruly a win.\n\n10/10 would recommend.\n\nAdmin of the year.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 435,
    "downs": 0,
    "created_utc": 1765095244.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.220771577317554
  },
  {
    "score": 348,
    "title": "Requiring login to view a trailhead answer is absolutely obnoxious",
    "selftext": "For example, I search up an issue I have and I see a page that might have the answer [https://trailhead.salesforce.com/trailblazer-community/feed/0D54S00000A8zXfSAJ](https://trailhead.salesforce.com/trailblazer-community/feed/0D54S00000A8zXfSAJ)\n\nIt displays the page for 1 second then redirects me to a login. My trailhead is by email so I need to type that in and then type in the 2FA code. Thats 20 seconds wasted just to find out this question is irrelevant to what I'm asking or it's just a link to a stackexchange question that was already answered.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 348,
    "downs": 0,
    "created_utc": 1721251167.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1249633617595745
  },
  {
    "score": 319,
    "title": "After 7+ Years at Salesforce Support — Why I’m Leaving Without Another Job",
    "selftext": "My Journey at Salesforce Support\n\nI’ve spent over seven years at Salesforce Support, where I was a top performer and considered the backbone of my team. I took pride in delivering for customers and holding things together when it mattered most.\n\nWhy I’m Leaving\n\nBut lately, the environment has become unbearable — so much so that I’ve decided to leave without another job lined up because I simply can’t take it anymore.\n\nWhat’s Really Going On\n\n\t•\tSupport teams are shrinking quietly. Layoffs happen without notice, but the workload doubles or triples for those left behind — no backfill, no relief.\n\n\t•\tToxicity and micromanagement are everywhere. Despite being a high contributor, your opinions don’t matter. You’re treated like a replaceable resource, not someone valuable.\n\n\t•\tNo proper upskilling or onboarding. People are thrown into complex roles without the knowledge or support they need, making success nearly impossible.\n\n\t•\tExperts like me are leaving regularly, and leadership doesn’t ask why. No exit conversations, no retention efforts — attrition is accepted silently\n\n\t•\tYour feedback is never considered. Leadership doesn’t care about engineers’ or support team members’ perspectives, making it impossible to improve or feel heard.\n\n\t•\tExcessive budgets go to CSM and CIC teams, while the real work gets done by Support — who remain undervalued and underestimated.\n\n\t•\tOutdated tools, inconsistent documentation, and poor collaboration between Support, Product, and Engineering cause repeated escalations and frustrated customers.\n\n\t•\tLeadership responds with micromanagement instead of trust, creating a culture where burnout is inevitable.\n\nA Call for Change\n\nI’m sharing this because I believe in the potential Salesforce has — but potential alone isn’t enough without real support for the people who make it happen. If leadership truly wants to improve customer experience, they need to start by listening to and valuing their support and engineering teams.\n\nBurnout and attrition won’t fix themselves. Change requires honest conversations and actions, and I hope this sparks that.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 319,
    "downs": 0,
    "created_utc": 1757392934.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.270423459016171
  },
  {
    "score": 316,
    "title": "Introducing Renameforce: Because Salesforce Renames Everything",
    "selftext": "You know how Salesforce has a *slight* habit of renaming products every other year (or quarter 😅)?\n\nI put together **Renameforce,** a site that:\n\n* Lets you search old names to see what they’re called today\n* Check out the rapidly changing Leaderboard\n* A few fun things (quiz, name generator)\n\n👉 Check it out: [renameforce.com](https://renameforce.com)\n\nI’d love your help:\n\n* Did I miss any infamous renames? I tried to find a good list, and put together what I could...I'm sure I'm missing stuff\n* Features you’d want to see?\n* Was this the worst spend of my Saturday time?\n\nThis is meant to be both **helpful** (because consultants/admins need this) and a little **hilarious** (because… c’mon, it’s Salesforce).\n\nI'd love your input!",
    "subreddit": "salesforce",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 316,
    "downs": 0,
    "created_utc": 1755991280.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.149096663568165
  },
  {
    "score": 303,
    "title": "Dreamforce kinda sucks.",
    "selftext": "I know I’m not the first to post this, and I hope I’m not the last. They need to hear this screamed from the rooftops: Dreamforce kinda sucks. \n\nThe main keynotes have tens of thousands of people trying to get in. If you can’t get in, you’re asked to go to a watch room, which (you guessed it) is also packed to the brim. And all you’re gonna see is them talking about renaming products and “aGenTic AI AgEnts.” \n\nSalesforce seriously needs to take some notes from Hubspot Inbound. That felt like drinking great information from a firehose; this makes me want to leave before I even get to the conference center. \n\nDo better (oh wait, they already have my money). \n\n\n",
    "subreddit": "salesforce",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 303,
    "downs": 0,
    "created_utc": 1760548373.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.271532250982842
  },
  {
    "score": 283,
    "title": "I Just Sat Through An Agentforce Pitch",
    "selftext": "I just joined a client in a conversation with their Salesforce AE to demo and pitch Agentforce.\n\nHere is what happened:\n\n**The 'Demo'**  \nThey showed a 2.5 minute demo for a real company that they said we were not allowed to record.\n\nIn it, they showed a person asking to cancel an appointment. The agent asked for an email, showed two appointments on the books, and asked which to cancel, then it did.\n\nThen it showed a booking process where it built a quote based on some things the client said and offered a bunch of days and times.\n\n**The 'Pitch' &amp; ROI**\n\nThey offered the tool at $2.40 per conversation.\n\nMy client said \"that's scammy\".\n\nThe AE said  \"In Salesforce's research, a client conversation costs on average $15 per agent that is not using AI\"\n\nMy client asked \"How much would setup cost?\"\n\nThe AE said \"Funny enough Salesforce made all of us AEs build an agent to see how easy it is! It only took me an hour to build my first agent.\"\n\n**The Value**\n\nThe AE, realizing the client was not very interested, communicated the following talking points to communicate value:\n\n\\- It is easy to build flows for each use case\n\n\\- It provides 24/7 coverage\n\n\\- It maintains the same tone of voice and quality of service\n\n\\- It controls costs when scaling and limits head count\n\n**The Leading Edge**\n\nMy client ultimately said \"I am not making any AI decisions in the next year, I am waiting to see who proves themselves in the market for these solutions. I do not want to be on the leading edge.\"\n\n**The Final Push**\n\nThe AE, not wanting to give up so easy, offered a 15% discount per conversation for a January decision on a commitment of a minimum spend of $5k in order to lock in price and prevent future cost increases.\n\nIt did not sway them.\n\n**My Take**\n\n\\- This tool is not ready for the spotlight.\n\n\\- The demo video they showed us they insisted we can't screenshot or record, showing they are not confident. Wouldn't you want to scream from the rooftops if this thing was awesome?\n\n\\- The company they demoed, I went on their website, and they are not in fact using Agentforce.\n\n\\- Still no real clarity on Data Cloud being needed or not. It was glossed over by the AE\n\n**What's Your Take?**",
    "subreddit": "salesforce",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 283,
    "downs": 0,
    "created_utc": 1736439088.0,
    "media": null,
    "is_video": false,
    "num_comments": 242,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.366121476846193
  },
  {
    "score": 261,
    "title": "Are we slowly losing what made Salesforce actually fun to build on?",
    "selftext": "I’ve been around Salesforce long enough to remember when it was actually fun to build stuff.  \n  \nYou could throw together a weird little automation, mess with a few formulas, maybe some Apex if you were feeling fancy, and it felt like creating something.\n\nNow it’s just… exhausting.\n\nEvery release adds more layers, more tools that kinda do the same thing, and a dozen “new features” nobody asked for especially the AI stuff.\n\nFlow, Apex, OmniStudio, some new Einstein rebrand every quarter it’s like Salesforce is trying to outdo its own confusion.\n\nHalf the time I’m scared to even touch anything because one wrong change might break five other things I didn’t even know were connected.\n\nIt used to feel like a builder’s platform.\n\nNow it just feels like keeping a 15-year-old Jenga tower from collapsing.\n\nAnyone else feel this, or am I just burned out?",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 261,
    "downs": 0,
    "created_utc": 1761295375.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1323652181195945
  },
  {
    "score": 259,
    "title": "Hi everyone! Max here from Salesforce’s Community Management team. 👋",
    "selftext": "&gt;Hello!\n\nEdit: to clarify, I am on the social media (not Community) team here at Salesforce. Sorry for the confusion.\n\nWe’re excited to officially say hello and introduce ourselves here on Reddit. We’ve been quietly listening and sharing your feedback internally, both the wins and challenges, and now we’re planning to engage more directly with this community.\n\nOur team respects the unique spirit of Reddit, and we’re going to be intentional about how we contribute as a brand. After some great conversations with the moderator and seeing the thoughtful dialogue in this space, we’re ready to jump in respectfully and with purpose.\n\nOur goal is to be available, listen, and help where we can. Think of us as just another resource in the community. We're here to clarify things, surface your feedback, and connect the dots when needed.\n\nThis is your space, and we’re grateful to be a part of it. Thank you for your candid feedback, your questions, and your passion. If you ever want to reach out to the social Community Management team directly, we’re just a ping away.\n\n—Max",
    "subreddit": "salesforce",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 259,
    "downs": 0,
    "created_utc": 1757628907.0,
    "media": null,
    "is_video": false,
    "num_comments": 179,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.225109600522471
  },
  {
    "score": 258,
    "title": "Slack is extorting us with a $195k/yr bill increase",
    "selftext": "There is an engaging conversation on  ycombinator around a recent situation with Slack pricing for an nonprofit:\n\n*Slack is extorting us with a $195k/yr bill increase*\n\nhttps://news.ycombinator.com/item?id=45283887\n\nI see a pattern now: Salesforce is trying to maintain its margin by increasing prices and incentivising crappy sales behaviour. At the same time they are now engaging more in the public discourse for damage control.\n\nPutting it out here so that the Salesforce representatives on this subreddit could be aware and focus on solving the root cause not on band-aiding it over on social media. \n\n📢If you don’t treat your customers with respect, it will be really hard to turn this ship around.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 258,
    "downs": 0,
    "created_utc": 1758224246.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.050439407112193
  },
  {
    "score": 257,
    "title": "ChatGPT can handle everything! Why hire salesforce talent?",
    "selftext": "I’m a very stressed senior admin, business analyst, sometimes front end developing role. My boss seems to think that just anyone armed with ChatGPT can come in and build projects within Salesforce. We have 4 years worth of custom architecture supporting 5 different business lines with about 100 users each. It’s me and one green fresh out of college resource they got cheaply. \n\nHe comes to me today and goes, “can you build a  partner portal in 12 days that does x, y, z?” \n\nMe: “Uh I’m on 6 projects right now, are you pushing those deadlines out?”\n\nHim: “Oh no, we can’t do that. Those are important!” \n\nMe: “Then no. That’s an insane timeline.” \n\nHim: “I get it, everyone is too busy. I’ll do it myself” \n\nMe: “You’ve logged into Salesforce once….”\n\nHim: “So? I have ChatGPT, watch me. I’ll build it in no time” \n\n😑 This attitude makes me so angry. You think salesforce professionals spend years studying these things because they’re just SO simple that a person who has seen the system once can just do by talking to ChatGPT? I can’t figure out how to combat this attitude and it’s extremely invalidating. ",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 257,
    "downs": 0,
    "created_utc": 1746564100.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.141280392854552
  },
  {
    "score": 231,
    "title": "The AI replacement",
    "selftext": "Salesforce has now begun replacing their tier 1 support engineers with AI chat bots. This follows the many rounds of layoffs after several years of record breaking profits. The 'Ohana' mentality has long left the organization in pursuit of higher profits and lower headcounts while boosting the micromanagement culture in every facet of the sale, support, and engineering space.\n\nMany have thought of Salesforce and it's CEO as altruistic but it seems that Benioff is no different than the majority of billionaires in the U.S. where consolidating wealth by replacing positions with generative AI is becoming the standard.\n\nThis may not be the end of Salesforce's reign, but it certainly marks the fall of Salesforce's claim to be one of the best places to work at.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 231,
    "downs": 0,
    "created_utc": 1749060700.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.039730494330224
  },
  {
    "score": 234,
    "title": "Dreamforce = Forced Dream",
    "selftext": "Just wanted to share my non-important thoughts/rant about Dreamforce. This is my third time attending and it further confirms one thing. Some people utilize the tool Salesforce, this is how I see myself.  Others ARE Salesforce - mind, body and spirit. Mind you my excitement about the tool is pretty low,  maybe because I've been in the SF space for quite a while and it's time for me to do something else with my life. Maybe there is a strong feeling of inauthencity when you see people giving an EXPENSIVE marketing push for their product while a lot of companies including theirs have had to do mass layoffs. But hey, Ohana! \n\nIs Salesforce useful? Very much so. Is Dreamforce worth it? For me, no.  It's only worth it if you ARE Salesforce and it's something you engage in during your spare time. There are many more efficient and less expensive ways to learn about the tool. Dreamforce just feels like a forced good time and I find myself the odd man out watching folks applaud well put together keynotes that really have no actual substance.  Heavy on the expensive clothes, less on the realistic,  affordable use cases. ",
    "subreddit": "salesforce",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 234,
    "downs": 0,
    "created_utc": 1726856552.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.0685678622717365
  },
  {
    "score": 229,
    "title": "Salesforce to End Diversity Hiring Targets After Trump Order",
    "selftext": "https://www.bloomberg.com/news/articles/2025-03-05/salesforce-to-end-diversity-hiring-targets-after-trump-order?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MTI2OTI2OCwiZXhwIjoxNzQxODc0MDY4LCJhcnRpY2xlSWQiOiJTU082OExUMEFGQjQwMCIsImJjb25uZWN0SWQiOiI5MUREMTk4QzE1NkI0M0ExQkJBQjIyODBBNzRGQjRFRCJ9.i0yHp3W4iQNHaWRXmyQbzZ22DLABsYef0YXgsqMbq8k",
    "subreddit": "salesforce",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 229,
    "downs": 0,
    "created_utc": 1741269333.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.097001316713858
  },
  {
    "score": 218,
    "title": "Anyone else accidentally end up with a Salesforce career, when they never really sought it out?",
    "selftext": "I’ve never felt super passionate about Salesforce. It’s decent for the things it does. I like the company. Working with it can be fun.\n\nBut what’s funny is I never, at any point in my 10-year project management career, sought out Salesforce roles. But somehow that’s what I am- a Salesforce Project Manager.\n\nStarted out as a wee tech support guy who helped our admin with a transition to Sales Cloud from our old CRM. Put it on my resume. The next company wanted that experience and asked me to lead their transition.\n\nAfter that I had two jobs with Salesforce migration and integration experience and suddenly every recruiter is only focused on that experience. I can manage the hell out of any technology program, but only Salesforce people seem to care.\n\nSeveral contract roles later I’ve now got experience with Salesforce Billing, CPQ, Communities, Media Cloud, and Marketing Cloud. Cause it just happened to be what they needed help figuring out.\n\nSo here I am, specialized in this tool, no certifications, no special effort made to get here, and I’m just kinda in the ecosystem against my will 🫠\n\nAnyone else have this experience? Is it normal?",
    "subreddit": "salesforce",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 218,
    "downs": 0,
    "created_utc": 1714165478.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.061460784489508
  },
  {
    "score": 214,
    "title": "I am so sick of professional negligence being blindly tolerated in this ecosystem [Rant]",
    "selftext": "I have been working primarily in the consulting side of this ecosystem for almost a decade now. I have worked the position of in-house defacto admin to leading teams and appexchange products, working every role in between along the way.\n\nEver since I joined it has been an inside joke that Salesforce just gets butchered on the implementation. It's normal for orgs to be dumpster fires of misaligned customizations and my job for the last decade has been fixing those problems.\n\nI do not remember the last time I had a client that wasn't coming off of a bad experience with an implementation partner that, in no uncertain terms, fucked their implementation. I have had to gut and replace more automation, crazy data models, and tangled applications than I have actually created and it's ridiculous. How the hell are these companies supposed to leverage the platform when they are buried under a mountain of tech debt?\n\nAnd, just based on my experience, the finger is to be pointed at implementation partners. No, this isn't going to turn into a cute \"trust me I'm better\" ad. I'm pointing the finger at myself too. I am part of the consulting space, and I will own that the consulting space has ravaged countless companies.\n\nI just had another client come in with a 7 figure botched implementation. They're going to spend every dime of that and more fixing it. They got had. Plain and simple. But, that's just Salesforce right? \\*wink\\*\n\nI'm furious. So many companies use Salesforce. Their cost of operations directly impacts the price of goods for consumers globally. Every problem these rampant and awful implementations cause come straight out of the pocket of the consumer or the salary of the employee (or both). It's disgusting how low the level of acceptance is for these types of projects.\n\nI don't know the fix for this. I don't think anything short of the collective Salesforce ecosystem drawing a line and demanding better is enough. So, I guess my only advice is hold your outsourced teams accountable for the work they give you and don't accept garbage. Respect yourself and your teams and your customers enough to assure quality design in your orgs. Quit buying into these shitty 7 figure deals that are too complex to possibly predict or manage. It's got to stop man. It has to stop.\n\nEDIT: Just coming to update since this is a topic that received a lot of attention.\n\nI am trying to respond to as many comments as possible. Some people carry various perspectives on the topic, but I think this has taught me that the large majority at least agrees there is a problem here. I sincerely appreciate everyone sharing their perspective and contributing to the topic. Like I said, I don't know the solution to the problem - but talking about it in a civil and understanding manner is a great first step. It's good to see.\n\nI wanted to clarify, as I saw several comments mention it, this is not about blaming the entirety of implementation partners. I have had my fair share of crazy clients that were truly the unstoppable cause of a project going sideways. It's not always the implementation partner's fault for the product being of poor quality. However, I do believe that is widely understood that the implementation partner is responsible for dealing with that problem if it happens. So while they may not always be the cause, they are the current named party responsible for solving it. This is frequently reflected in their agreements with the client.\n\nI'll continue to try and reply to as much as I can so that everyone feels included in this conversation. I encourage people who want to contribute to the conversation to also read and respond to other comments. There are a lot of really good perspectives and conversations to be had.\n\nMuch love.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 214,
    "downs": 0,
    "created_utc": 1731515690.0,
    "media": null,
    "is_video": false,
    "num_comments": 199,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.202953457747596
  },
  {
    "score": 205,
    "title": "AI Associate and AI Specialist certification exams are free for 15 months",
    "selftext": "The news itself - [https://trailhead.salesforce.com/help?article=AI-Training-and-Certifications-for-All-FAQ](https://trailhead.salesforce.com/help?article=AI-Training-and-Certifications-for-All-FAQ)\n\nAI Associate trailhead - [https://trailhead.salesforce.com/en/credentials/aiassociate](https://trailhead.salesforce.com/en/credentials/aiassociate)\n\nAI Specialist trailhead - [https://trailhead.salesforce.com/en/credentials/aispecialist](https://trailhead.salesforce.com/en/credentials/aispecialist)\n\nI have registered for both (yes, no charges). No harm to have them under your belt for free.\n\nHave a good one!",
    "subreddit": "salesforce",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 205,
    "downs": 0,
    "created_utc": 1727261838.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9380812171506214
  },
  {
    "score": 201,
    "title": "Is anyone else unreasonably annoyed at the Matthew McConaughey agentforce commercial",
    "selftext": "\"Agentforce helps prevent fashion fails\" or whatever? It seems like the commercial came straight out of marc benioff or some super high level marketing person detached from the real world with zero pushback. And I guess the joke is that we can clearly see Matthew is dressed ridiculously, but so did we need AI for that? It's the dumbest commercial I've seen in a while and all I see is this ad, prescription medications, and online gambling (Michigan lol)",
    "subreddit": "salesforce",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 201,
    "downs": 0,
    "created_utc": 1736614018.0,
    "media": null,
    "is_video": false,
    "num_comments": 58,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9107773752676955
  },
  {
    "score": 204,
    "title": "I hate how Salesforce uses Einstein's likeness",
    "selftext": "It's frustrating to see how Salesforce has co-opted Einstein's likeness to peddle their AI features. Albert Einstein, a monumental figure in the world of science, represents intellectual rigor, curiosity, and groundbreaking discoveries. Reducing his legacy to a mere marketing gimmick feels disingenuous and diminishes the profound impact of his work. It's as if the genius of relativity is being trivialized to push CRM software. While AI and advanced analytics are undoubtedly valuable tools, using Einstein's image to sell these features borders on disrespectful. Salesforce, please find a way to market your innovations without hijacking the identity of one of history's greatest minds.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 204,
    "downs": 0,
    "created_utc": 1722345497.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.786851901070011
  },
  {
    "score": 200,
    "title": "5 Lessons from 5 Years of Independent Salesforce Consulting",
    "selftext": "August will mark the end of my 5th year running my solo Salesforce practice, MVRK.\n\nFive years ago, I was feeling how many of you might be right now:\n\n* Tired of giving my energy to a large company that paid me a fraction of my value.\n* Frustrated with having to work with clients and teammates I didn't connect with.\n* Driven by a deep desire to build my own career and make my life better.\n* Confident that I could succeed on my own!\n\nIt's been a journey of scars, celebrations, and huge growth. \n\nSo on this Sunday summer morning I wanted to share the 5 biggest lessons that have driven my success.\n\n\n\n**Lesson 1: Your Niche is Your Superpower**\n\nYour success as an independent provider is entirely dependent on finding the right companies to help.\n\nThe only way you can tell right from wrong is if you understand who you are best suited to help.\n\nTo define your “Who”, ask yourself these three questions:\n\n1. What Salesforce toolsets am I most interested in and talented with?\n2. Which industries and types of companies do I have an interest in and experience with?\n3. What parts of the world and time zones do I want to work in?\n\nThese 3 will define the ideal clients for you. You can use AI to help you draft an ideal client profile based on your answers to these questions.\n\nThen comes the “How”.\n\nThis is the journey of transformation you will take your clients through.\n\nYour product is the process you take them through in order to solve their problems.\n\nCome up with a simple two to four step journey based on your typical approach to helping clients.\n\nThe deliverables you provide within each step of the journey should all be aimed towards bringing your client to a stable Salesforce platform that facilitates their internal processes effectively.\n\nCombine the “Who” and “How” - and you have your Niche!\n\n\n\n**Lesson 2: Sell by Helping, not Pitching**\n\nI have spoken to hundreds of Salesforce experts interested in working solo over the last few years.\n\nTheir most common concern? Having to sell.\n\nI get it. Selling can feel daunting, especially when all you want to do is solve interesting problems. You don’t want to be chasing people and pitching and facing rejection. It is uncomfortable.\n\nI can tell you this confidently: selling my service as an independent provider has been COMPLETELY different from the pitch-and-push type of work I had to do in my last job selling full time for a large consulting firm.\n\nBecause I started MVRK with a clear idea of who I could best help (see Lesson 1), all I had to do was find where those ideal clients might be asking for help. When I found them asking for help with Salesforce, instead of pitching, I simply helped them. Without asking for anything in return.\n\nAnd through helping thousands of individuals over the last 5 years, I've been able to secure the 30 or so clients I've worked with. When we help people, we build a real relationship and get a chance to show them what we know and that we care.\n\nNow, it's important to be realistic: Most people I help don’t become clients. Some remember me a year or more later when they need a service, and some have become clients the same week. More importantly, I don’t feel like an annoying sales guy. And I spend very little time \"selling.\"\n\n\n\n**Lesson 3: Embed Yourself in the Client’s Team**\n\nSalesforce is 25 years old.\n\nWhat that means is that almost every client you'll ever meet has already experienced a disaster implementation. Many are exhausted by the traditional Consultancy approach.\n\nThey are done with the “black box” method: getting grilled with questions, having to wait a week for a simple build, only for it to miss the mark on what was truly needed. When your clients invest in you, it’s because they want you to work WITH them to solve their problems.\n\nI call this “Embedded Delivery”. In the simplest terms it looks like this:\n\n* Establish a meeting pattern of regular work sessions with your clients\n* Provide them with homework (questionnaires, research, documentation, etc.)\n* Use the results of their homework in calls to define system design together\n* Build quickly between sessions\n* Review on calls and iterate in real-time\n\nThis way, they see the system evolve, and it drives real value and moves the project forward. And the best part for your business? It separates you from the need to bill hourly.\n\nYou can and should package your delivery at a weekly rate.\n\n\n\n**Lesson 4: Client Success Above All Else**\n\nOne accomplishment I am incredibly proud of is that my first-ever client is still my client to this day.\n\nOf course they have taken brakes when there were no initiatives to build, but any time they need to improve their systems they come to me. The main reason? They sense I truly want what is best for them.\n\nIn our ecosystem, the client is almost always the least important part of the equation. At MVRK I flipped that. The client is what I care about the most.\n\nWhat does that really mean in practice?\n\n*Salesforce Relationship*\n\nAt large consulting firms, the relationship with Salesforce is often prioritized over the client's actual needs. This means pushing the client to buy higher edition tiers than needed, more licenses than are needed, and more add-ons than are needed.\n\nAt MVRK, it is the exact opposite. I ensure I explain to my clients the bare minimum of what they need to meet their objectives. We can always add more later. My loyalty is to my clients, because they are the ones who pay me.\n\n*Ongoing Support*\n\nLarge firms depend on trapping clients in support contracts. They might build overly complex systems, provide poor documentation, and avoid training client resources on how to maintain their own system.\n\nAt MVRK, I flip that on its head. I tell my clients that if they need me to keep the system maintained after we finish an implementation then I have failed them. I document everything that is built, and focus on the most simple architecture needed to facilitate their business processes.\n\n*Flexibility and Fairness*\n\nI worked at a Platinum Salesforce Partner for 3 years, and there wasn't a single week that didn't involve stressful discussions about projects being over budget or out of scope.\n\nAt MVRK, I take a different approach. I price in weekly or monthly rates with clear responsibilities. This creates flexibility when building solutions. I can always look my clients in the eyes and clearly explain when more budget may be needed. Likewise, I am always fair and will reduce costs if we deliver less value in a week/month than expected.\n\nOverall, I put my client’s best interest ahead of my personal interest. And it resonates.\n\n\n\n**Lesson 5: Your Contract, Your Process**\n\nThe biggest mistake I see independent Salesforce experts make is getting stuck in the Freelancer’s trap. If the contract signed for the work you deliver is not prepared by you, then you are not in control.\n\nAll of your clients need to be directly contracted with you, on a Statement of Work you wrote. This is what separates a true Solopreneur from a Freelancer.\n\nIf you don’t have control of the Statement of Work, then you can't clearly implement the “How” that we discussed in Lesson 1. You become just a resource, not a change maker.\n\nOur value as independent experts comes from the Transformation we provide. Therefore, we must always have a clear contract in place that defines our role and is structured to deliver our unique client journey.\n\nAnything other than this, and we fall back into the headaches we felt when we were someone else’s employee.\n\nIf you are not working in your designed approach, not only are you less valuable to the client, but you are also doing things you don’t find joy in. The ultimate goal of a Solopreneur is to create a life that is positive.\n\nSo maintain control from the start.\n\nWrite the agreement yourself, and be firm on ensuring it is only for delivering work in a manner which you designed to make the best use of your skills.\n\n\n\n**TL;DR**\n\nWith all that said, here’s my philosophy boiled down:\n\nKnow your niche. Sell by helping. Be a true partner to your clients, putting their success first. And always, always own your process and your contract.\n\nThat is how you build a solo business that not only enhances your own life, but also leaves a legacy of genuinely successful clients.\n\n\n\n**I hope this was helpful to at least some of you. I am happy to answer any questions y’all throw at me!**\n\n",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 200,
    "downs": 0,
    "created_utc": 1753029672.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.000455683729799
  },
  {
    "score": 199,
    "title": "I quit my job &amp; built the Salesforce App they wouldn't let me build... it's now on the AppExchange and is getting Customer Success teams to use Salesforce.",
    "selftext": "This has been months in the making, but I have finally made it through the arduous AppExchange approval process. This involved becoming an approved ISV partner, passing the security review, and getting my listing approved by someone on the Salesforce Partner team. So begins my journey as an official Salesforce technology partner.\n\nThe original inspiration for this app came from when I worked in operations at a small tech startup based in Toronto, Canada. I was constantly getting in battles with leaders from the Customer Success team demanding that we purchase new software to solve a problem that Salesforce can (almost) solve on its own.\n\nThe reason I constantly lost those battles - even though Salesforce is very customizable with it's out of the box functionality - was that it was never quite was able to solve their reporting needs, nor did it have an intuitive enough user interface in order to gain adoption from various teams.\n\nThis was frustrating to me, as someone who always wanted to save software costs by using the existing tools at our disposal. So, a few months ago, I built an MVP and [wrote about it on reddit](https://www.reddit.com/r/salesforce/comments/12hzspy/i_created_a_salesforce_app_to_track_customer/).\n\nSince then, I've quit my job and decided to run with this. Most of my time and energy has been spent improving the product while also dealing with Salesforce's support team to make it through the listing process.\n\nIf you are curious about what I've built, you can check out the [AppExchange Listing](https://appexchange.salesforce.com/appxListingDetail?listingId=a0N3u00000RXFkCEAX) or our [Product Demo](https://www.youtube.com/watch?v=1Y5RlT1X3Fc). You can learn more about my journey and the future plans for the app on my [website](https://cstoolkit.app).\n\nThis journey has been long but exciting, and I'm thrilled to share it with you. Please reach out if you have any questions about my product or getting through the AppExchange listing process.\n\nHas anyone else experienced similar frustrations with Salesforce's limitations leading to teams lobbying to purchase new and expensive software?",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 199,
    "downs": 0,
    "created_utc": 1689791503.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9660606273598313
  },
  {
    "score": 197,
    "title": "I just passed the Salesforce Administrator Exam!",
    "selftext": "I discovered Salesforce in January, and decided it was time to make a career change. I worked through the Trailhead trail for Admin, and got the FoF study guide and practice tests. Studied like hell almost every single day for 3-8 hours for the last 2 months and I passed today on my first shot! I did the online proctored test and holy hell was it stressful. I'm so glad that it's done. Can't wait to get a job in Salesforce!\n\nThanks to everyone here for the advice and input that has been made available on everyone's questions on preparing for the exam and getting certified. It made all the difference in the world knowing what resources were the most helpful and beneficial.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 197,
    "downs": 0,
    "created_utc": 1680043730.0,
    "media": null,
    "is_video": false,
    "num_comments": 62,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.901335464988322
  },
  {
    "score": 186,
    "title": "I turned ChatGPT into my Salesforce expert",
    "selftext": "I fed the entire Salesforce documentation, Salesforce educational articles, Salesforce integrations and Salesforce help center content to a ChatGPT-powered assistant. You can ask it questions like:\n- Salesforce administration\n- Managing sales cloud leads\n- Marketing cloud customer leads\n- Salesforce integrations\n\nI made all this public [here](https://www.lingoblocks.com/playground/kSLcOQNlpamnyt93ufx1), so anyone can chat with the assistant for free. No account needed.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 186,
    "downs": 0,
    "created_utc": 1694002627.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8359356200395993
  },
  {
    "score": 168,
    "title": "Do companies not realize how small this ecosystem is?",
    "selftext": "Just wanted to vent. I got a recruiter call for a role that would pay me $30k more than I’m making now. However, it would require me to be in the office 3 days a week and the drive is about 50 miles one way. I asked about relocation assistance and I was told no. I also asked if they’d consider remote for the right person and I was also told no. Finally, I was told they pick the days that I have to be in the office. \n\nI asked the recruiter how long they’ve been on the search for and he’s saying this role has been open for 5 months. \n\nWhy don’t companies realize that the genie’s out of the bottle with remote work. Also, very few people have good experience with Salesforce, so companies should be more flexible with tough to find skills and know how to compromise!",
    "subreddit": "salesforce",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 168,
    "downs": 0,
    "created_utc": 1678151609.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.825024639414068
  },
  {
    "score": 168,
    "title": "Tracking Salesforce CEO Marc Benioff’s company jet using public flight data",
    "selftext": "Hey folks,  \nI’ve been tracking corporate and executive aircraft for a while using **public ADS-B flight data**, and recently set up r/SalesforceJet to automatically post flights for **Salesforce’s new Gulfstream (N808XX)** — the one often used by **Marc Benioff** and other execs.\n\nIt’s not meant as gossip just a look at Salesforce’s global travel footprint and sustainability impact, similar to what’s been done for other major tech companies.\n\n\n\nEverything posted is based on **public flight data** nothing private or restricted.\n\n🛩️ You can check it out here: [r/SalesforceJet](https://reddit.com/r/SalesforceJet)",
    "subreddit": "salesforce",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 168,
    "downs": 0,
    "created_utc": 1762717742.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6564657202847832
  },
  {
    "score": 169,
    "title": "Salesforce Data Breach AIR FRANCE and KLM this is actuallly getting crazy",
    "selftext": "Just a heads up if you fly with Air France or KLM they’ve both confirmed a data breach through a third-party platform tied to their Salesforce environment.\n\nThey’re saying it affected some customer data from the Flying Blue loyalty program: names, emails, phone numbers, Flying Blue numbers, and possibly the tier level or subject lines of past customer service messages. No payment info or passwords were taken, according to their statement.\n\nThis wasn’t a direct Salesforce breach, but it’s part of a larger wave of incidents tied to how companies manage Salesforce and connected apps. A hacking group known as **ShinyHunters** has been going after companies using social engineering mostly by impersonating IT support to trick employees into installing fake apps or approving malicious OAuth requests. Once the attackers get into the system via a connected app, they can pull down a lot of CRM data.\n\nAnd this isn’t just Air France–KLM. Other companies caught up in similar incidents include:\n\n* **Google**\n* **Qantas**\n* **Pandora**\n* **Adidas**\n* **Cisco**\n* **LVMH brands** (Louis Vuitton, Dior, Tiffany, etc.)\n* **Allianz Life**\n* **Chanel**\n\nThe list keeps growing. What they all seem to have in common is storing large amounts of customer data in Salesforce and not catching the malicious access early enough.\n\n**Could it have been prevented?** Probably. From what’s been shared, the root problem is weak access controls around connected apps and too much trust in OAuth scopes. Companies should be doing things like:\n\n* Reviewing and restricting which apps can access Salesforce data\n* Enforcing tight API access controls\n* Monitoring for abnormal data downloads\n* Training staff to spot phishing and vishing attempts (some attackers are calling support agents directly)\n\nIf you're a company using Salesforce, especially for customer support or loyalty programs, it's probably a good time to audit your access logs and tighten up app permissions or to invest in better software.\n\nLet me know if anyone has seen technical breakdowns or threat reports Im tryna learn more.\n\n",
    "subreddit": "salesforce",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 169,
    "downs": 0,
    "created_utc": 1754595379.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.855064781243762
  },
  {
    "score": 169,
    "title": "I passed the Platform Developer II exam today!",
    "selftext": "Hi, I wanted to thank the community as I saw a lot of posts talking about this exam, and they were very helpful to be able to pass the exam.\n\nIn my opinion it was considerably more difficult than Platform Dev I, and it took me a few months to prepare for this exam, a pity that certs are not like they used to be because of the amount of “x50 Salesforce Certified Architects”.\n\nIf I had to recommend a very important resource it is the focus on force guides, and I guess the varied work environment I have allowed me to learn about different topics.\n\nAt the same time I learned several things studying for the exam, did you know that the track decorator is [no longer required in LWC](https://help.salesforce.com/s/articleView?id=release-notes.rn_lwc_track.htm&amp;release=224&amp;type=5) (only in certain cases), apparently it was updated some time ago.\n\nWithout further ado I thank you for your support.\n\n",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 169,
    "downs": 0,
    "created_utc": 1734634510.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.723688379899402
  },
  {
    "score": 164,
    "title": "Salesforce to move away from Webassessor for certification exams starting in July",
    "selftext": "Got this email from Salesforce and figured I'd share. The help doc linked loads to a blank page, so I copy/pasted the email body below.     \n      \nAccess all of your certification info in one place.\nAll Salesforce certifications will be available via Trailhead Academy starting July 21, 2025. This transition introduces a central hub for all Salesforce certification information, with personalized exam recommendations, and a 360-degree view of your certifications.\n      \nLearn more about what’s coming this July, including how exams will be delivered in Pearson VUE, what it means for you, and ways to prepare.      \n      \nBe sure to review upcoming key dates:    \nJune 30, 2025: Last day to register for a Salesforce exam in Webassessor.    \nJuly 13, 2025: Last day to complete your Salesforce exam in Webassessor.    \nJuly 21, 2025: New certification experience and registration launches in Trailhead Academy.    \n       \nLink from email: https://trailhead.salesforce.com/help?article=New-Salesforce-Certification-Experience-FAQ",
    "subreddit": "salesforce",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 164,
    "downs": 0,
    "created_utc": 1745339413.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8169689463819156
  },
  {
    "score": 163,
    "title": "Will Agentforce Ruin Salesforce's CRM Dominance?",
    "selftext": "Everyone in the community sees it\n\n- Cutting thousands of support and product roles to make Agentforce look better\n\n- High caliber leadership like Bret Taylor leaving to start their own thing knowing Salesforce AI is a joke\n\n- SF going on an acquisition spree instead of building their own product because this is now a sales and marketing company, not a product company \n\n- Forcing 9% uplift into our renewal contracts to somehow account for the waste that is Agentforce\n\n- No focus on what customers actually want... Core improvements and decades old governor limits \n\n- The \"Ohana\" we knew is dead unfortunately \n\nHubspot is catching up, moving up the smb market, and this seems like a self inflicted wound\n\nI might just be a negative Nancy, but is Salesforce speed running itself into failure?",
    "subreddit": "salesforce",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 163,
    "downs": 0,
    "created_utc": 1759365834.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.859603474357007
  },
  {
    "score": 164,
    "title": "Not feeling proud of being a Salesforce employee",
    "selftext": "Brazilian GM Fabio Costa bragging about receiving David Schmaier, Sarah Franklin and Andres Prieto in front of a fucking helicopter on the day after layoffs affecting our colleagues. What a lack of empathy! Maybe they could get a cab and avoid one person layoff.\n\nhttps://www.linkedin.com/feed/update/urn:li:activity:7047669953491087360?updateEntityUrn=urn%3Ali%3Afs_feedUpdate%3A%28V2%2Curn%3Ali%3Aactivity%3A7047669953491087360%29",
    "subreddit": "salesforce",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 164,
    "downs": 0,
    "created_utc": 1680299731.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.731718172003699
  },
  {
    "score": 163,
    "title": "I just passed the Advanced Admin exam! ",
    "selftext": "Long time lurker, first time caller. Just wanted to drop this here and say thanks! There's a ton of content and conversations on here that really helped smooth out my weaker areas while studying. Specifically posts around reporting and formulas.\n\nData point: I used FoF study guides and practice tests. Quizlet was really helpful for flashcards. I spent 2 months studying and took a crack at it last weekend, which I failed. I spent this last week reviewing my weak areas in the exam results, going through the FoF objective-specific tests, and taking a ton of notes. ",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 163,
    "downs": 0,
    "created_utc": 1729463881.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.649830522033107
  },
  {
    "score": 161,
    "title": "How Salesforce Saved the World",
    "selftext": "[How Salesforce Saved the World](https://medium.com/@cdpdude/how-salesforce-saved-the-world-8eacff19a400)\n\nIt is 1999, Salesforce is born and makes one great product.  \nIt is 2003, Salesforce holds its first Dreamforce.  \nIt is 2004, Salesforce IPOs.  \nIt is 2006, Salesforce launches Idea Exchange.  \nIt is 2009, Salesforce launches Service Cloud  \nIt is 2010, Salesforce acquires Heroku, they are never heard from again.  \nIt is 2013, Salesforce acquires Exact Target and changes the UI to say “Salesforce Marketing Cloud” but largely doesn’t change anything else.  \nIt is 2014, Salesforce launches Trailhead and Customer Success Platform.  \nIt is 2014, Salesforce acquires RelateIQ.  \nIt is 2016, Salesforce launches Einstein.  \nIt is 2016, Salesforce acquires Demandware, rebrands it as Commerce Cloud.  \nIt is 2018, Salesforce acquires Mulesoft, Rebel and Datorama. They are never heard from again.  \nIt is 2019, Salesforce announces Customer 360 Truth.  \nIt is 2019, Salesforce acquires Tableau. Tableau begins to get worse.  \nIt is 2020, Microsoft’s abuse of the United States’ inadequate antitrust laws forces the only application everyone likes, Slack, to accept an acquisition offer from Salesforce. Slack begins to get worse.  \nIt is 2020, Salesforce acquires Evergage and renames it Interaction Studio.  \nIt is 2021, Salesforce re-launches Customer 360 Truth as Salesforce CDP.  \nIt is 2022, Salesforce announces Genie, an in-house data management offering positioned as a CDP with the goal of creating their own data layer out of the remnants of Heroku and adapting their massive library of acquisitions to use it someday. This never actually happens but the marketing team says otherwise, elevating gaslighting into a world-recognized artform.  \nIt is 2022, Salesforce re-launches Evergage/Interaction Studio as Marketing Cloud Personalization.  \nIt is 2023, Salesforce adds “AI” to every page on their website in an embarrassing attempt to inflate their stock price.  \nIt is 2023, Salesforce re-launches Genie as “Data Cloud for Marketing”.  \nIt is 2023, Salesforce announces the Einstein 1 Platform. In truth it is a duct-taped-together way to position all of the acquisitions from the company’s past as though Salesforce offers a single platform. They demo three clearly different UI’s in their Dreamforce announcement. The staggering shamelessness of this causes ripple-effects across all of humanity’s psyche, shattering the last remnants of a shared reality and unintentionally creating an entire generation of nihilists. Something something AI, something something Lakehouse, something something Slack.  \nIt is 2024, Elon Musk’s divorced-status reached critical mass, creating a cascade of crashes across the 10 companies he is “CEO” for. Salesforce opportunistically acquires Tesla because Marc Benioff “thinks they’re neat”.  \nIt is 2025, Marc Benioff not only sees no accountability for 5+ years of selling vaporware and shamelessly tacking on new trends each year to inflate the stock price, he uses the inflated stock to purchase the rest of Hawaii.  \nIt is 2026, Salesforce declares independence from the United States and rebrands Hawaii as “Salesforce Dreamland”, simultaneously declaring a new currency called “Dreamcash”.  \nIt is 2027, The United States continued inability to control massive corporate negligence crashes the economy resulting in a heavily favorable Dreamcash to USD conversion rate.  \nIt is 2028, Salesforce acquires the United States and rebrands it Dreamland 1.  \nIt is 2029, Dreamland 1 declares a new official religion called Beniacs (a portmanteau of “Benioff and maniac”).  \nIt is 2030, A coven of rogue Beniac scientists discovers a way to convert shamelessness into an infinite energy source and plugs it into the Salesforce marketing team.  \nIt is 2031, Dreamland 1 acquires the entire Australian continent and begins plans to expand.  \nIt is 2035, The last of the non-Salesforce rebels fall to an army of Tesla robots, Grand Emperor Benioff curiously rebrands Earth as “AI Lakehouse Planet of Optimal Customer Value” instead of just Salesforce.  \nIt is 2040, Humanity begins to deteriorate into a sea of pained wails. Super King Genius Benioff graciously begins daily speeches to raise morale. Mandatory attendance is brutally enforced.  \nIt is 2041, Humanity’s depressed state restricts any interest in working or gaining possessions, leaving only their capacity for love. The defeated species, moving as little as possible each day, results in a drastic dive in carbon emissions. The air quality skyrockets causing nature to rapidly flourish, turning the entire planet into a beautiful garden. Climate change is defeated. Wars are a forgotten memory. True peace is finally achieved.  \nIt is 2042, The sun mercifully explodes.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 161,
    "downs": 0,
    "created_utc": 1694662706.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5756246619095906
  },
  {
    "score": 159,
    "title": "After 8 long years in the Salesforce ecosystem...",
    "selftext": "I finally passed my admin exam first time less than an hour ago. I appreciate to many of you in this sub this is nothing special, however as a child I had extreme difficult with any sort of exam or academia.\n\nI started my Salesforce career 8 years ago self taught, I moved through different roles but found myself locked out of any further career progression. Everyone wants you to be certified.\n\nJust after Christmas I took the plunge and decided to book my exam for the earliest date possible, which was today. I was terrified history would repeat itself and it'd be just like school all over again, but I passed!\n\nNo longer am I totally qualificationless, I have my 1  prized certificate.\n\nHere's a message to everyone out there in a similar boat; it is possible, work hard and believe in yourself. You can do it.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 159,
    "downs": 0,
    "created_utc": 1673451472.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.728244627854875
  },
  {
    "score": 155,
    "title": "My Honest Look at Salesforce's Growth, Layoffs, and Future",
    "selftext": "u/Aromatic-Bad146 started a great conversation over here on the weekend: [https://www.reddit.com/r/salesforce/comments/1na0yvq/salesforce\\_ceo\\_marc\\_benioff\\_defends\\_4000\\_job\\_cuts/](https://www.reddit.com/r/salesforce/comments/1na0yvq/salesforce_ceo_marc_benioff_defends_4000_job_cuts/)\n\nIt got me thinking about how I feel the ecosystem stands. But first, I wanted to get some data.\n\n# The Real Data\n\n**Here are the raw numbers on their last 15 years of employee count:** \n\n\\[Year, Count, Change YoY\\]\n\n2010:    4,900 -\n\n2011:    7,700 \t        +57.14%\n\n2012:    9,800 \t        +27.27%\n\n2013:    13,300 \t+35.71%\n\n2014:    16,000 \t+20.30%\n\n2015:    19,000 \t+18.75%\n\n2016:    25,000 \t+31.58%\n\n2017:    29,000 \t+16.00%\n\n2018:    35,000 \t+20.69%\n\n2019:    49,000 \t+40.00%\n\n2020:    56,000 \t+14.29%\n\n2021:    73,500 \t+31.25%\n\n2022:    79,000 \t+7.48%\n\n2023:    72,000 \t−8.86%\n\n2024:    68,000 \t−5.56%\n\n2025:    63,000 \t−7.35%\n\n**Salesforce revenue by year chart:**\n\n\\[Year, Annual Revenue (USD Billions), Change YoY\\]\n\n2010:    $1.66\n\n2011:    $2.27\t  +36.75%\n\n2012:    $3.05\t  +34.36%\n\n2013:    $4.07\t  +33.44%\n\n2014:    $5.37\t  +31.94%\n\n2015:    $6.67\t  +24.21%\n\n2016:    $8.39\t  +25.79%\n\n2017:    $10.52\t  +25.39%\n\n2018:    $13.28\t  +26.24%\n\n2019:    $17.10\t  +28.76%\n\n2020:    $21.25\t  +24.27%\n\n2021:    $26.49\t  +24.66%\n\n2022:    $31.35\t  +18.35%\n\n2023:    $34.86\t  +11.20%\n\n2024:    $37.90\t  +8.72%\n\n# A Look At Growth\n\nThe Revenue growth is positive but slowing as you see. Thus the Employee count is also dropping to maintain profitability. Economic impacts are indeed showing their results. This phenomenon is not unique to Salesforce. I have been seeing a lot of discussion about companies, particularly in SaaS, squeezing their existing customers for greater returns. \n\nBut consider challenges that Salesforce is facing as a result of the scale jumps that it has gone through every few years. They didn't even spend three full years at their \"1 billion\" size before doubling. Then doubled again in three years. At the scale of BILLIONS there are so many clients to service. But at 38 billion? That is another definition of huge volume of clients.\n\nAdding to that, they are down to under their 2021 employee count. Yet they are 50% bigger in revenue than they were in 2021. Maybe that is the right scale? I don't personally know. We don't have an eye on all of their internal operation. But that employee count brings them to $600,000/employee yearly revenue contribution. In 2021 it was $360,000/employee. That was a much more attainable goal. Again, we are talking about massive scales in volume here.\n\nOn top of that, I can deduce that their closed won/lost leads ratio is dropping with stronger competition entering the market. So today, every customer they alienate has more options to explore. Churn is a huge issue they need to manage, like all SaaS unicorns. I personally have not been seeing many leaving Salesforce, but the number is not 0.\n\n# The Layoff Reality\n\nAt the moment the Ohana spirit has degraded, which drives negative sentiment. Realistically, one upset admin is enough to create a churn situation. Yet at the moment, Salesforce is eliminating support roles in yet another round of layoffs. I assume it is to right-size and to increase profitability. In my limited experience, the client experience is worse with Agentforce at the moment. So unsurprisingly, it is drawing large negative press. We are yet to see how that decision impacts the market long term. \n\nWhat we are also beginning to see a bit more layoffs at mid size and large implementation providers. And I am personally speaking with a lot of people who are interested in starting their own independent practice. I am biased, but believe that smaller teams will have more stability in the current economic reality.\n\nAnother reality is that Salesforce is a large business that has to grow to maintain shareholder momentum. A lot of us have benefited from it in our careers. I am grateful for the organization. Some of us became emotionally attracted to our persona of being a Salesforce-first person. So the alienation is a source of lost identity for a lot of people.\n\nDreamforce next month is going to be a big litmus test. Let's see if Salesforce presents itself as a human first organization. If they work to bring back some good will from their most loyal fans. Or if they firmly dig in as an Agent first organization. Whatever they do, it will be the audience that ultimately decides what their message is.\n\nWith that backdrop, and other business challenges, I can understand cuts even without AI. AI is ultimately just another feature of technology that is going to have a marketplace impact. But it appears to be poised to make a dramatic impact. So a strategist at a company like Salesforce also needs to make decisions that are ahead of it's current immediate reality.\n\n# Agents Of The Future\n\nI could understand making the assumption that agentic tech is improving so rapidly that you should double down and scale down to a reality that is coming. I believe Agentforce WILL be better than it is today. And given it's wide access to sources of data it likely is to become the strongest Salesforce AI tool. But at the moment, Salesforce native AI is technologically behind.\n\nAgentforce does not yet have a value proposition that it needs to go mainstream in SMB. They have been starting to finally get big players to share user stories, and they just published a big set of stories by companies using Agentforce for real. Including Reddit! But right now I have no clients asking to use it. I am not seeing a ton of buzz about it in SMB with decision makers. But let's see what their engineering team can do. And what emerging AI market leaders they can acquire.  \n\nTo finish, I still believe in the platform as a CRM market leader, but always work to recognize where other technology is a better solution in a stack. We must all double down on being client first and use Salesforce as effectively as possible but only where necessary. \n\nI hope people see this for the balanced take that I tried to make it. I am not trying to attack anyone or say I know the solution to make everyone happy. In my work I always try to be clear and matter-of-fact. This is simply the best I can understand the nuances of this complex ecosystem, with the information at my disposal. \n\n\n\n**What did I miss? What do you think about the direction of the Salesforce ecosystem?**\n\n\n\n",
    "subreddit": "salesforce",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 155,
    "downs": 0,
    "created_utc": 1757352731.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9655771540741607
  },
  {
    "score": 153,
    "title": "I have just encountered the dumbest user - do I get a prize?",
    "selftext": "A little background - my team we take turns as to who has the on-call week in case any high-priority issues come in overnight or on weekends, as we support one business unit in APAC and another that works 7 days/week.\n\nGuess whose week it is to be on call, you guessed it, mine.\n\nI'm in the US on east coast time, so we get a high-priority case that comes in at about 7 pm from a user in Australia.  They sent in a screenshot saying they cannot get anything to load when they click on any of the tabs in the screenshot, it just sits there.  I log in as the user and can click things fine, so I ask if he can do a screen share.  He can't do it until almost 11 PM my time. I asked for a screen recording, but he literally held his phone up to his monitor and took a video, and it was hard to tell what he was clicking on. I wait up and do a call with him at around 11 PM.\n\nHE IS TRYING TO CLICK ON A PICTURE OF SALESFORCE.  One of his direct reports sent him a screenshot of where to go to find a specific account list view.   He's literally trying to click on it from the screenshot, not in the actual browser.  Because of his PC settings, when he opened the PDF screenshot from his direct report, it opened in Chrome, so he thought he was in Salesforce.\n\nI had him log in and then showed him where the account tab was and how to click on the list view.\n\nHe sent in feedback after I closed his case, saying that I was helpful but our training is confusing, and he's not sure why he wouldn't be able to click on a screenshot and navigate through to salesforce.\n\nI thought this call was a fever dream, but I recorded it in case I needed to escalate it to one of my developers.  This person has a VP title.  HOW?????",
    "subreddit": "salesforce",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 153,
    "downs": 0,
    "created_utc": 1683602904.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6781719712201064
  },
  {
    "score": 152,
    "title": "Today I was fired from a new position as Salesforce Engineering Manager after only 3 weeks ",
    "selftext": "**UPDATE 3PM CT:** the guy who was to be my number 2 in this role removed me as a connection on LinkedIn, blocked me, and reported me for \"unwanted or harmful content\" after I wished him well and said I was sad that we wouldn't be working together. So that's cool.\n\nI'm currently devastated, please be kind. \n\nFor background, I've been in the ecosystem for over 10 years and am a certified application architect working on my integration architect and PD2 certs. \n\nOn one hand, I feel like a complete failure and I'm left wondering if the Salesforce world is right for me. \n\nOn the other hand, this was the such a terrible experience and I'm wondering if this is a good thing, a bullet dodged. \n\nMy computer arrived a week late after I started and then I was given one week to settle in before being asked for a complete, detailed org-to-org migration plan by the VP. \n\nShe didn't like any of my suggestions and said 8 two-week sprints was \"too textbook\".  \n\nWhen I said we could \"move fast and break things\" in a sandbox she chastised me, told me we can't break anything, then asked \"how can we do this TOMORROW\". \n\nWhen I asked if there was any impending timeline that I was unaware of, she couldn't or wouldn't tell me. \n\nI know that she has a proposal from a big 4 consulting company to do the work over 4-6 months and a cost of over $1.5 million but people are not happy with the consulting company because their existing work has been riddled with bugs and they have overpromised, underdelivered. The consulting company took 10 weeks to come up with this plan, how was I expected to do it in 10 days? \n\nIt took over 6 weeks of interviewing and a drug test (okay, but why?) to land the role and I was so damn excited because the team I was going to be leading was comprised of a lot of really great people. Not just talented but I thought we really vibed. \n\nI even spent $90 of my own money on Starbucks gift cards for my team + leadership prior to our first and only team meeting. I was planning lunch and learns. The team seemed eager. \n\nYet the VP just seemed disappointed with everything that came out of my mouth, was visibly disappointed when I advised I'd been selected to speak to speak at upcoming Salesforce events. She told me to be sure to keep it separate from corporate. \n\nI'm going to reexamine myself, reevaluate both my strengths and weaknesses, and learn what I can from this. \n\nBut I would also welcome constructive feedback because I'm just at a loss here. Are there really greener pastures? ",
    "subreddit": "salesforce",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 152,
    "downs": 0,
    "created_utc": 1719854016.0,
    "media": null,
    "is_video": false,
    "num_comments": 157,
    "num_reports": null,
    "over_18": true,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.98901997429481
  },
  {
    "score": 151,
    "title": "Going private Monday with thousands of other subs in solidarity with app developers?",
    "selftext": "Hello amazing community members!\n\nReddit has a bit of some drama going on about trying to kill 3rd party mobile apps then made a big mess of the situation through bad pr.  Read more here if you have not heard about it:\nhttps://www.bbc.com/news/technology-65855608.amp\n\nThousands of subs are going private for 48h as a protest. \n\nI don’t want the community disrupted but I think we are all in favor of solidarity with app developers.  Let’s talk here if there is disagreement on this topic.",
    "subreddit": "salesforce",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 151,
    "downs": 0,
    "created_utc": 1686436919.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.65594444997827
  }
]