[
  {
    "score": 43,
    "title": "US Salesforce Careers",
    "selftext": "Hi all,\n\nSalesforce recruiter here (please don’t lynch mob me, promise I’m a good laugh) \n\nThought I’d reach out on here as have been a Reddit user for years.\n\nI’m originally from the UK but live in the US now sourcing Salesforce talent for Salesforce Partners (gold, platinum, summit) + a tonne of end users.\n\nGive me a shout if you need my help finding a new role or finding some peeps!\n\nhttps://www.linkedin.com/in/callum-stainer?utm_source=share&amp;utm_campaign=share_via&amp;utm_content=profile&amp;utm_medium=ios_app",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 43,
    "downs": 0,
    "created_utc": 1727966287.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Recruiting outreach post offering help finding roles; not a how-to or list.",
    "composite_score": 3.1794826721501686
  },
  {
    "score": 42,
    "title": "I'm looking for someone to talk to because after a year of unemployment, I'm feeling disillusioned with tech. Have I just been wasting my life with Salesforce?",
    "selftext": "Please be nice.\n\nI'm not asking for a job or a handout, but maybe someone can tell me what I'm doing wrong.\n\nI'm a certified application architect with 15 years of experience. I have a master's in information systems. I've worked on multi-million dollar government projects, Fortune 500 companies, and been responsible for multiple worldwide orgs with upwards of 4000 users. I've had titles such as tech lead, solution architect, analyst, senior admin, etc. I've been active in the community. I've presented at conferences. I've networked.\n\nBut for the past year I've been un(der)employed, my savings are gone, and I have nothing to show for any of it except for cool, cool certs.\n\nI've applied for everything from admin to VP. I've spent countless hours researching companies, reaching out to folks, preparing for interviews...just for nothing. I've been no-showed at interviews, ghosted after being told they're moving me forwards, or just received no response whatsoever. I'm feeling like my entire career, all the extracurriculars, all the studying new/adjacent tech...it's just been a waste of my life.\n\nEdit: you make not like this post, but for all the 'freshers' or people asking \"hey should I just get my Admin for easy money?\", this should give you some insight to the market.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1754695700.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional vent about unemployment and career disappointments with frustration.",
    "composite_score": 3.0493323735883826
  },
  {
    "score": 39,
    "title": "True Life: I Taught NYU's First Salesforce Admin Certificate. 160+ Job Placements. Here's What Bootcamps Won't Tell You.",
    "selftext": "I keep seeing ads promising \"Leave your job, pay $300-$5000, and land an $80-100k Salesforce salary in 3 months.\"\n\nI need to be honest with you: that's not how this works anymore.\n\nI taught NYU Tandon's first Salesforce Administration certificate course in 2022. Over the years, I've helped place 160+ students in Salesforce careers. Here's what bootcamps won't tell you.\n\nThe market has changed since 2018-2021.\n\nCompanies were hiring anyone with a cert and a pulse. Now, entry-level market is flooded, hiring is slower, and employers are pickier.\n\nHere's what I've seen actually work for students who land jobs:\n\n**What bootcamps sell you:**\n\n* Certs = jobs\n* 8-12 weeks to a new career\n* \"Salesforce admins make $95k average!\" (technically true, misleading for entry level)\n\n**What actually gets people hired:**\n\n* Real project experience (volunteer for nonprofits, build things, break things)\n* Understanding business problems, not just clicking buttons\n* Networking that isn't just \"add 500 people on LinkedIn\"\n* Patience – we're talking 6-12 months of real effort, not 8 weeks\n* Being realistic about starting salaries in your market\n\nTrailhead is free. The Trailblazer community is free. Local user groups are free. Slack communities are free. The best resources in this ecosystem cost nothing.\n\nBootcamps aren't all scams. Some are legit and have real communities behind them (Supermums, Merivis, PepUp Tech come to mind).   \nThe best resources are free: Trailhead, local Trailblazer Community Groups, Ohana Slack, and your nearest Admin or Developer user group.\n\nIf a program promises you a six-figure career after a few weeks and won't connect you with recent graduates to verify outcomes, I'd make some call to get a refund.\n\nI'm not saying don't pursue Salesforce. I'm saying go in with realistic expectations. This is a career change that takes real time and effort. Anyone telling you otherwise is selling you something.\n\nHappy to answer questions if you're considering this path (shoot me a DM).",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1765204738.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.84,
    "category_rationale": "Provides insight into what actually helps Salesforce job applicants, with reasoning and examples.",
    "composite_score": 2.970241873407456
  },
  {
    "score": 33,
    "title": "Salesforce is hiring ",
    "selftext": "\nHey folks, I work at Salesforce , and we’re hiring globally across various teams. We have over 1000 roles in sales available. \n\nIf you’re interested, check out the open roles and see if any are a fit for you. https://careers.salesforce.com/en/jobs/\n\nIf you find a role, I’m happy to refer you, which gives you a better chance of getting hired. Send me a DM once you have a role picked out and we can go from there. \n",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1735018022.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Job posting + referral offer; not a how-to or list.",
    "composite_score": 2.8085389083702177
  },
  {
    "score": 26,
    "title": "💼 Looking for Salesforce Development Opportunities! Check Out My Salesforce Chess Game! ♟️",
    "selftext": "[Screenshot of my page](https://preview.redd.it/mdcz88jtl7qd1.png?width=1230&amp;format=png&amp;auto=webp&amp;s=b60259f0d44585ab10dea52659af33c2603d8e02)\n\n \n\nHi everyone! I’ve built a chess game using Salesforce with Apex for game logic, Salesforce objects for data storage, and a responsive Visualforce page for the UI. It’s a fun project that showcases my skills in Salesforce development.\n\nI’m urgently seeking job opportunities in this field. If you know of any openings or have connections, I’d greatly appreciate your support!\n\nYou can also try out the game or check out the code below:  \n[Try the Game](https://dqy00000brzl7map-dev-ed.develop.my.salesforce-sites.com/Chess)  \n[GitHub Repository](https://github.com/AyanBhunia/Chess_Salesforce_Apex_VF)  \n[Salesforce Package](https://login.salesforce.com/packaging/installPackage.apexp?p0=04tdM0000004RRR&amp;isdtp=p1)\n\nPlease reach out if you have any questions or leads. Thanks!\n\n[Linkedin Article](https://www.linkedin.com/pulse/check-out-my-salesforce-chess-game-ayan-bhunia-87uoc/?trackingId=rmE7VFJkRGKKrBSX71g4yg%3D%3D)",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1726945033.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Self-presentation of development project seeking opportunities; not a guide or list.",
    "composite_score": 2.264378761990978
  },
  {
    "score": 22,
    "title": "Leaving the Salesforce career path",
    "selftext": "Hi everyone, I am looking for someone who is bored and tired of Salesforce as a career role. I am trying to leave the ecosystem completely, I am a Salesforce solution architect, i.e I get to speak to clients, hear their painpoints and go look into the possible solutions but I am over this role because I work in a consulting firm where the lies are endless. \n\n  \nI am burnt out and just need a new career role. I love product management and seeing ideas go from inception to reality. \n\nCan anyone that has made the transition help me out? \n\n\\#salesforce",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1753967839.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal career transition request; largely personal narrative.",
    "composite_score": 2.506349090737255
  },
  {
    "score": 22,
    "title": "I created a job board with 250+ sales jobs at startups",
    "selftext": "Hey Salesforcers!\n\nI created a job board for sales jobs at startups called [SalesGoat](https://www.salesgoat.co/). 95% of the jobs are remote and we have 35+ sales ops roles listed. There's been a huge shift in saas tech companies going remote and the goal is to make it easier for sales folks to find these jobs.\n\n*Yes, another job board.* From talking to sales folks the larger job boards like Indeed, Glassdoor and LinkedIn were hard to search for remote sales roles, data wasn't refreshed, dead links, filtering sucked, startups were hard to find in the search results etc.\n\nTo date, we manually curate the jobs we post. We have 250+ today and will be at 500 in a few months (including more salesforce jobs).\n\nWe took feedback and initially focused on six personas; Account Executives, SDRs, Sales Ops / Salesforce admin, Sales Engineer, Sales Enablement and Sales Leadership. The filtering is primarily around the persona and you can further filter by job level and/or funding. More filtering will be added soon (salary for sure).\n\nLet me know what you think! Would love any feedback + I hope this helps someone in their Salesforce job hunt 💜\n\n[https://salesgoat.co](https://salesgoat.co/)",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1674783709.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Announcement of a job board and request for feedback; not a list/guide.",
    "composite_score": 2.5032728295135644
  },
  {
    "score": 22,
    "title": "Preparing for Salesforce interviews while working full-time—here’s the framework I followed",
    "selftext": "Hey folks,\n\nI’ve been working as a Salesforce Tech Lead and recently started preparing for interviews to explore new opportunities. What I didn’t expect was how hard it would be to stay consistent with prep while managing a full-time job.\n\n# Some of the challenges I ran into:\n\n* Not knowing where to begin or which topics to prioritize\n* Struggling to stay focused after work hours\n* Wanting to go beyond Trailhead and get more hands-on practice\n* Keeping up with the latest Salesforce features and best practices\n\nSo instead of jumping randomly between resources, I decided to follow a more structured approach using **ChatGPT**. Here’s what I did:\n\n1. **Identified key areas** I wanted to focus on—Apex, LWC, Flows, Security, Data Modeling, etc.\n2. **Uploaded a few blog articles or docs** on each topic and asked ChatGPT to quiz me on them.\n3. For each question, I tried to answer it myself, then asked ChatGPT to explain the correct answer and the reasoning behind it.\n4. I repeated this across topics, and it helped me retain concepts better and spot my weak areas.\n5. I also used it to generate small code snippets or scenarios to practice hands-on.\n\nThis framework helped me stay consistent and made the prep feel more interactive and less overwhelming.\n\n# Here is the Prompt I used:\n\nPlay the role of a Salesforce Tech Lead who is interviewing me on &lt;TOPIC - Flow, Apex etc &gt;. I want you to go through the attached blog articles and then ask me a series of questions one by one starting from easy to difficult. I will answer each questions one by one and you will respond with the right answer, also give relevant link to blog article/ salesforce document in case i want to read more about it. After each answer ask me another questions. At the end give me a score and identify areas where i am strong and weak and need more focus.\n\nI’m curious—how do you all prepare for Salesforce interviews? Do you follow a structure or just go with the flow?\n\nAlso, I’ve been working on a tool based on this framework—something that combines interactive questions (MCQ, Drag &amp; Drop, Code Completion etc), AI summary explanations of answers, deep learning with link to top blog articles on the question and performance tracking/ prep plan. \n\nYou can register here for early access - [https://preview--smartforce-interview-ready.lovable.app/](https://preview--smartforce-interview-ready.lovable.app/)\n\nWould love to hear your thoughts and prep strategies!",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1748853455.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.89,
    "category_rationale": "Structured interview prep framework with numbered steps.",
    "composite_score": 2.405257831681574
  },
  {
    "score": 19,
    "title": "Laid off today – Certified Salesforce Admin (7 months exp) – Looking for opportunities ASAP",
    "selftext": "Just got hit by the layoff wave this morning. Single-income household with a young kid, so I’m in full hustle mode and need to replace income as fast as possible.\n\nQuick rundown:\n\n* Salesforce Certified Administrator (May 2025)\n* 7 months real-world experience (Flows, validation rules, reports/dashboards, custom objects, user management, order-to-shipment automation, data cleanup, etc.)\n* Portfolio ready with screenshots, short videos, and measurable impact\n* Open to literally anything Salesforce-related right now: full-time, part-time, contract, freelance, junior admin, CRM admin, support admin, data analyst with Salesforce focus, even short-term projects — remote or hybrid preferred **Los Angeles area** (US-based)\n\nI know 2025 has been absolutely brutal for Salesforce roles. I’ve been applying on LinkedIn, Indeed, Mason Frank, etc., but responses are almost zero.\n\nCurrent Admins, consultants, recruiters, or hiring managers — please drop whatever actually worked for you this year:\n\n* Which job boards or recruiters are still placing people?\n* Any companies/consulting partners quietly hiring junior or mid-level admins right now?\n* Contract platforms that actually have Salesforce work (Upwork feels dead)?\n* Anyone need a reliable pair of hands for a few months while you backfill?\n\nHappy to jump on a 10-minute call, share my portfolio, LinkedIn, resume — whatever helps. DMs are wide open.\n\nThanks in advance — this community has always been solid, and I really need a win fast.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1764185714.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Layoff note with qualifications and requests; not a guide or list.",
    "composite_score": 2.2220906230238127
  },
  {
    "score": 16,
    "title": "Salesforce’s AI Layoffs Reflect Executive Overreach and Technology Limits",
    "selftext": "Salesforce’s 2025 layoffs of approximately 4,000 employees, justified as AI-driven automation savings, have instead revealed executive overconfidence and misjudgments regarding large language models’ maturity and practical applicability. The flagship AI agent tool, Agentforce, proves incapable of reliably executing straightforward tasks, exposing limits of current AI in complex enterprise contexts.\n\nLeadership’s lack of technical depth, coupled with a culture of political conformity and inflated AI expectations, fuels skepticism internally and among observers. Cost-cutting ambitions overshadow genuine technological innovation, while workforce demoralization and outsourcing raise questions about sustainable digital transformation. Salesforce’s case illustrates a broader tech sector dissonance between hype and operational realities, with investors rewarding short-term margin improvements at potential long-term cost.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 16,
    "downs": 0,
    "created_utc": 1766875072.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Analytical critique of Salesforce layoffs, discussing AI limits and leadership; explanation/insights.",
    "composite_score": 2.1309639192102647
  },
  {
    "score": 16,
    "title": "Salesforce Developer Urgently Looking for Work 🙏",
    "selftext": "I’m a Salesforce Developer with 3 years of experience, and I’m really struggling to find a new job. For over half a year, I’ve applied to so many positions but haven’t received any replies. \n\nNow, I urgently need a job and a good project to work on. I have skills in Apex, Visualforce, and other Salesforce tools. I even built a custom chess app with a cool UI, which I put on GitHub. \n\nI am not looking for a high salary or a specific location—just a solid job where I can use my skills. If anyone knows of a position or has advice, I’d be so grateful. Thank you for any help you can provide!",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 16,
    "downs": 0,
    "created_utc": 1730250768.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal job-search request without a clear list or instructional content.",
    "composite_score": 2.584160261789377
  },
  {
    "score": 15,
    "title": "U.S. Citizens Only - Hiring 3 Full-Time, Remote Salesforce Pros for Public Sector Projects ($115K-$150K)",
    "selftext": "I’m recruiting for three fully remote Salesforce roles with a leading gov-tech partner. These are stable, full-time positions (W2) with strong benefits not contract work.\n\nAll roles require **U.S. Citizenship and eligibility for a U.S. Government security clearance**.\n\nHere’s the breakdown:\n\n**1. Salesforce Project Manager**\n\n* **Salary:** $130,000 - $150,000\n* **Location:** Remote, but must live in DC, Maryland, or Virginia for occasional client meetings.\n* **What You Need:** PMP certification is mandatory. 5+ years in project management, with at least 2 years specifically on Salesforce or major CRM projects. Must know Agile/Scrum inside and out.\n\n**2. Salesforce Business Analyst**\n\n* **Salary:** $115,000 - $130,000\n* **Location:** Fully remote anywhere in the U.S. (Must work ET hours).\n* **What You Need:** 3+ years as a Salesforce Business Analyst or Admin. Must have one of these certs: Salesforce Certified Business Analyst, Administrator, or Platform App Builder.\n\n**3. Salesforce Functional Lead**\n\n* **Salary:** $130,000 - $150,000\n* **Location:** Remote, but must live in DC, Maryland, or Virginia for occasional meetings.\n* **What You Need:** 5-8+ years of hands-on Salesforce functional/consulting experience. At least 2 years leading the functional design on large, complex implementations. Public sector or federal experience is a huge plus.\n\n**The Good Stuff (Benefits):**\n\n* 401(k) with company match\n* Health, dental, and vision insurance\n* Generous Paid Time Off (PTO)\n* Truly flexible remote work culture\n\n**How to Apply (Please Read):**  \nThis is a direct hire for our client. To be considered, please send the following to **rafay@employnow.co**:\n\n1. An updated resume.\n2. Put the exact job title you're applying for in the email subject line (e.g., \"Salesforce Business Analyst Application\").\n3. In the body of the email, briefly tell me:\n   * Your years of experience with Salesforce.\n   * If you have any public sector or federal project experience.\n   * Your current city/state of residence.\n   * Your citizenship status (U.S. Citizen required).\n   * If you are eligible for a security clearance (e.g., have held one before, or are clearable).\n\nI will review all submissions and will reach out directly via email or phone call, if there's a potential fit. Please no DMs/chat requests on Reddit use the email above for the fastest response.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1764774807.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Multiple distinct job roles with details listed sequentially.",
    "composite_score": 2.087680610015756
  },
  {
    "score": 16,
    "title": "WARNING: Jobs with Steampunk",
    "selftext": "UPDATE: Spoke with their HR person. They mentioned that something was stuck with my security clearance process, and that they did not have access to identify the issue due to privacy. Later that same day, I got an email from their candidate intake stating the same. \n\nInterestingly, I only got this update after contacting them multiple times. \n\nThis leads me to believe the following:\n\nThey're lying about actually available roles, and just want a backlog of resumes for theoretical jobs that may not exist. \n\nThis is unethical because they're acting as if a job is truly there, and have no issues stringing candidates along for months with false promises of non-existent work. \n\nI highly recommend that NOBODY should apply with them, as if this is how they manage the hiring process, how will they handle you as an employee? \n\nORIGINAL:\n\nNoticed the company Steampunk continuing to post new jobs all the time, and well-paying ones.\n\nMy experience with them so far has been the following:\n\n1.) Began interviewing with them in July of last year and passed through three rounds of interviews before being confirmed for a role that would start in September.\n\n2.) Funding fell through, so got switched to another role that would begin in November of last year and went through two more technical interviews, both of which I passed.\n\n3.) Received a high-paying offer in October of last year. Submitted paperwork and began security clearance screening for the role, as they handle government contracts only.\n\n4.) Followed up continually, with communication coming ONLY from my side and no communication iniating from Steampunk whatsoever, but each conversation assured that the role was still mine, and security was taking an unexpectedly long time.\n\n5.) Told that the project was yet to be funded, but they were projected to begin in the second week of January now, and that I was set for that project when it came up.\n\n6.) Told more recently that they were set to receive funding for the role instead at the end of March, and once funding came through, they would begin placing people on the project, and that I was at the top of that list.\n\nTL;DR:\n\nThis was nearly a year-long process to \\*maybe\\* get a job that doesn't actually exist. \n\nI'm not sure if this company is running some kind of scam, or if they receive funding for job postings, but I can't imagine their processes are efficient.\n\nPerhaps your experience will be different from mine, but I've in the meantime accepted a separate job offer, while this company is still attempting to string me along.\n\nApplicant beware.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 16,
    "downs": 0,
    "created_utc": 1736292215.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.9,
    "category_rationale": "Emotional denunciation of a company’s hiring practices with moral warnings.",
    "composite_score": 2.6065279370493832
  },
  {
    "score": 15,
    "title": "Remote Salesforce Developer Need (US Citizen or GCH)",
    "selftext": "Hi,\n\nCurrently have a need to a Salesforce Developer able to work EST hours. Living and operating on US soil as a USC or GCH.\n\nRole is fully remote and pay dependent on experience (mid level up to 110k with 8% bonus, Sr. up to 130k with 11% bonus) + an AMAZING PTO AND BENEFITS PACKAGE.\n\nIf you’re a Salesforce Developer and want some job security with a large scale end-user 25 people team then please get in touch.\n\nJob tenure is very important, so if you’re a job hopper, please look at other opportunities.\n\nMessage me for more info ",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1732634141.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Single remote job post with requirements; not a list or how-to.",
    "composite_score": 2.431241237375587
  },
  {
    "score": 16,
    "title": "Free mentoring sessions",
    "selftext": "Hello people,\n\nWhen you have hard times to wrap your head around a feature you were asked to implement I'm here to help you get the answers.\n\nI'm open to spend 1-2 hours for free with one person to help you build a plan to tackle a task, fix a bug, explain some specific concept. I've been working with Salesforce for 13 years. My main areas of expertise are Sales and Service Clouds, and Apex. I have multiple certificates including Application Architect.\n\nPlease use [https://calendar.app.google/wfdJa7nT1vSezcvT9](https://calendar.app.google/wfdJa7nT1vSezcvT9) to book a session with me.\n\nHave a great day!\n\nAndrii Muzychuk,\n\nSenior Salesforce Consultant",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 16,
    "downs": 0,
    "created_utc": 1727171257.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Offers free mentorship and expertise to help others learn Salesforce.",
    "composite_score": 2.4354489213782737
  },
  {
    "score": 15,
    "title": "Remote Salesforce Admin - must be US-based",
    "selftext": "I am working on a remote SF Admin role, must be US-based and able to work for any employer in the US without sponsorship.  The role is a with an $80M national organization that is on pace to be closer to $200M over the next 3 years.  This is a FT, perm role with benefits, etc.\n\n  \nWill partner with another Admin to drive efficiency and effectiveness of SF as the business scales, need someone who can bring ideas about best practices and ideas for best path forward.\n\n  \nMust have: Sales &amp; Service Cloud experience, Lightning experience, comfort with Apex/Java (not as a Dev), and strong understanding of Flows as they are very prevalent here.\n\n  \nCompany is based in GA, but there will be little (if any) travel.\n\n  \nComp range is $90-100k.  There isn't room for flexibility here, and we have found some strong candidates at that range.\n\n  \nIf this sounds like a fit and you're interested in learning more, please reach out to me at [rick@artisanrecruitment.com](mailto:rick@artisanrecruitment.com)\n\n  \nThanks!",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1729612738.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Single remote admin job posting without a structured list.",
    "composite_score": 2.3041199826559247
  },
  {
    "score": 13,
    "title": "How to future proof my career in Salesforce ..?",
    "selftext": "Hey People, I know Salesforce has been there for a long time, but the market is still getting saturated. I am specifically asking the seniors in the market. How can I future-proof my career for those who started their IT career in Salesforce? I have 4 years of experience in Salesforce, but I think I need to upskill a lot. I know the platform Apex, LWC, Aura, Visualforce, Flows, with expertise in Sales, Service, Health, Experience Clouds and Appexchange application development expertise. I know the basics of CPQ. But I feel I'm not doing enough to keep up in the job market, and I'm staying in the same company from the beginning of my career for 4 years. My core skills were debugging, problem-solving, and system design. In between, I got offers from two different companies, but I decided to stay. But I need to learn more. So, what do you think I need to focus on upskilling ..? I need to hear perception of different people.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1757279106.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question seeking guidance on how to future-proof a Salesforce career.",
    "composite_score": 2.1971580313422194
  },
  {
    "score": 13,
    "title": "What is up with the talent pool?",
    "selftext": "\\*\\*EDIT\\*\\* Thank you for all of your comments! I asked HR for permission to make an exception and allow us to post the salary range. Our field is very protective of salary info because it's very insular and competitive, and poaching is common, but I tried to convince them that we need an exception in this case. Fingers crossed.\n\nI am trying to hire Salesforce developers right now. Advanced junior to mid-level (approx. 3-5 YOE), Platform Dev I cert as the minimum, has to be a US resident with work authorization (we work with the federal government). We are getting plenty of applicants who, on paper, meet the qualifications, but when we get them in front of a recruiter or tech screener, none of these people are able to speak intelligently about their past work. Most of the people who have come through have been disqualified. It seemed as though one person was using ChatGPT to cheat on the tech screen.\n\nI have hired for other roles, but hiring developers is new for me. I'm totally shocked by how hard this has been.   We don't post the salary range (we pay competitively), so we're seeing huge variations in what people are asking for (a difference of \\~$50k for people with about 4 years of experience), but the resumes at the bottom of that range look identical to the ones at the top of the range.\n\nFor those of you who are very effective recruiters, how on Earth do you effectively screen resumes/applications? For those of you who are developers, what are some things to look for in resumes that are either red flags or green flags? Any pre-screening application questions that you all have found to be effective? Do you do reference checks before interviews? Any advice would be appreciated!",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.76,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1718816573.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Discussion of recruiting challenges and requests for resume-screening insights.",
    "composite_score": 2.4687030248381907
  },
  {
    "score": 14,
    "title": "Hiring two admins",
    "selftext": "Tri Pointe Homes is hiring two admins!\n\nProduction support admin role: [https://careers.tripointehomes.com/careers-home/jobs/1573?lang=en-us](https://careers.tripointehomes.com/careers-home/jobs/1573?lang=en-us)\n\nChat and voice admin role: [https://careers.tripointehomes.com/careers-home/jobs/1509?lang=en-us](https://careers.tripointehomes.com/careers-home/jobs/1509?lang=en-us)\n\nThe Salesforce team at Tri Pointe Homes has been fully remote since its inception in 2017 and consists of six team members, including admins, business analysts, an architect and developer. Our team supports the company's sales and marketing department nationwide, utilizing Salesforce Sales Cloud, CPQ, Service Cloud, Lightning Scheduler, Chat/In-App Messaging, and Voice. We meet in-person three times per year for team building in places like Irvine, California, Scottsdale, Arizona, and Austin, Texas. Pickleball skills are a plus, but not mandatory.\n\nDM me if you have any questions!",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1712941216.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Announcement of two admin roles with application links.",
    "composite_score": 2.2755762612236907
  },
  {
    "score": 13,
    "title": "Got my PD1 cert. Now what?",
    "selftext": "Background:  I don't have a tech background, and I've been an attorney for three and a half years.  I decided several months ago that I wanted to make a career change, so I hopped on Trailhead, did the developer beginner trail and most of the PD1 trailmix, plus some Focus on Force test prep.  I finally took my PD1 exam today and got the following score:\n\nDeveloper Fundamentals: 92%\nProcess Automation and Logic:  88%\nUser Interface:  80%\nTesting, Debugging, and Deployment:  61%\n\nI'm a bit surprised by how high my UI score was because frankly I sometimes feel like I'm in a bit over my head when I do hands-on work with LWCs and visualforce on Trailhead.\n\nAre there entry level Salesforce jobs that would consider someone in my position?  And if not, what should my next steps be for getting the skills/experience necessary to land an interview?\n\nAny advice y'all can offer about how to update my resume would also be greatly appreciated.  I'm a smart guy, and I'm eager to continue learning, but the PD1 cert is currently the only experience I have that's directly applicable to a career as a Salesforce developer.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1682125446.0,
    "media": null,
    "is_video": false,
    "num_comments": 1,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asking for next steps after obtaining PD1 certification; career guidance request.",
    "composite_score": 1.9941430335102286
  },
  {
    "score": 14,
    "title": "Consultancies that Legit Care about their Workers",
    "selftext": "Hello, I've been a Salesforce Consultant for close to 8 years.  For the most part I've enjoyed my job and those I've worked with....but push comes to shove I'm repeatedly told to cancel vacations, work overtime and just in general lack of a true partnership.\n\nI'm on my  2 &amp; 3/4s company (one was acquired another was merged), so I haven't job hunted much. \n\nBefore taking my current role, I really tried to ask about Work/Life balance and of of course given the line.\n\nBut here again a week before a planned PTO, I'm wondering how to tell my kids we have to cancel ou plans.\n\nI literally left my last company because I got exhausted from having to fight for my time off.\n\n&amp;#x200B;\n\nAnyway...so are there good companies out there?  I've always heard horrible things about the big places so I've always looked mid or smaller tier",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1681140040.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional critique about work-life balance and PTO in consulting.",
    "composite_score": 2.364287601634794
  },
  {
    "score": 11,
    "title": "Salesforce Developer needed for Part Time work",
    "selftext": "Currently seeking a proficient Salesforce Developer/Admin to join my team on a part-time basis, for approximately 20-30 hours weekly. This is a fully remote position requires the use of a VPN for secure access.\n\nResponsibilities include:\n\n* Developing, testing, and deploying Apex Code, LWCs\n* Designing and implementing Salesforce Flows\n* Various Admin tasks (Data imports, Custom objects/fields, Perms)\n* Preferred experience with Gearset, Gitlab, Jira, Docusign\n* Willingness to learn new Salesforce technologies and areas\n\nOther requirements:\n\n* Candidates preferred to operate within the Eastern Standard Time (EST) zone. \n* Able to communicate in English\n* Utilize AI where necessary \n\nInterested applicants are invited to **direct message** for further details.\nTo be considered, please provide:\n\n* A summary of your Salesforce experience \n* Your expected hourly rate \n\nThanks!",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1763135158.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Job posting with a structured list of responsibilities.",
    "composite_score": 2.2538025007672875
  },
  {
    "score": 11,
    "title": "Fresher Salesforce Admin/Dev - What kind of projects actually impress recruiters?",
    "selftext": "**Hi everyone,**\n\nI’m a **fresher** learning Salesforce Administration and Development, and I want to build some practical projects to showcase on my resume/GitHub. My goal is to make my profile stand out to recruiters for entry-level roles.\n\n**I’d love your suggestions on:**\n\n* What kind of **Admin + Dev** projects are most useful for job applications?\n* Are recruiters more impressed by automation-heavy projects, integrations, or real-world business process setups?\n* Any examples of projects you’ve built (or seen others build) that helped in landing interviews?\n\nI want to focus on projects that not only show my technical skills but also demonstrate business problem-solving. Any advice from experienced professionals or recent hires would be super valuable.\n\n**Thanks in advance!**",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1759427661.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Requests guidance on projects; primarily seeking advice.",
    "composite_score": 2.0811662482156343
  },
  {
    "score": 12,
    "title": "🔥 Just got out of a Salesforce Developer interview at 🏦 American Express! Here’s what they asked me…",
    "selftext": "I recently attended a **Salesforce Developer interview at American Express** and faced some **challenging Apex, LWC, and API questions.** 😬\n\n💡 **Here are some key topics they focused on:**  \n✅ **Apex Async Processing (Future, Queueable, Batch)**  \n✅ **OAuth 2.0, JWT, and API Authentication**  \n✅ **Platform Events &amp; Real-Time Data Sync**  \n✅ **Salesforce REST API, Limits &amp; Error Handling**\n\n🚀 **If you're preparing for a Salesforce interview, check out this guide:** [https://www.avnishyadav.com/2025/03/salesforce-developer-interview.html](https://www.avnishyadav.com/2025/03/salesforce-developer-interview.html)\n\n💬 **Have you faced similar questions in a Salesforce interview? Let’s discuss below!** 👇\n\n🔍 **#Salesforce #SalesforceInterview #Apex #LWC #APIIntegration #CloudComputing #DevLife**",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.73,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1742445959.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.79,
    "category_rationale": "Share interview topics and prep insights for Salesforce roles.",
    "composite_score": 2.182139694885949
  },
  {
    "score": 12,
    "title": "A brief lamentation from a middling Salesforce developer",
    "selftext": "Just getting this off my chest. Did an inventory of my job-hunting results over the last 7 months since I lost my Salesforce developer job. 8 years of prior experience, that I'd admit (not in an interview) has been underwhelming, in that I haven't built anything particularly impressive (imposter's syndrome X honest assessment). At that age where ageism is a thing. Struggling to gain certs because my mind, which can very quickly solve problems with some research/AI help, doesn't retain info well.\n\nDozens of applications, 9 jobs I went through a serious interview process, 5 I made it to the final round. Have gotten 2 offers. One I declined early on because it was more of an admin role and I was close to landing other roles (mistake, now, obviously). One I accepted, but the start date got pushed back indefinitely because the project got delayed indefinitely, and I've needed to assume it's not happening. I think I'm about to get two more final-round rejections. And I've got nothing else in the pipeline. The average duration between application and resolution is two months.\n\nI was more confident and more competent in my interviews over the first few months. But now I freeze up. The hidden desperation messes with my head, and I get flustered when I know I'm giving an incoherent answer to a question I've handled just fine in the past. It's completely fair for hiring managers to be wary of a candidate that they want to be able to present to stakeholders, who is too anxious to make it through a call without calling attention to their stumbling.\n\nNot looking for advice. Someone will give it anyway, and maybe that will help someone else, maybe it will help me when I'm more open to receiving it. At the moment, I'm just very despondent and quite honestly don't know if I'm better off spending my time studying for certs or trying to maximize efforts to do a food delivery gig and find other temp opportunities.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 12,
    "downs": 0,
    "created_utc": 1724083100.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Personal vent about career struggles and self-doubt.",
    "composite_score": 2.4791678129959736
  },
  {
    "score": 11,
    "title": "[Meta] Pay transparency for Salesforce jobs",
    "selftext": "Pay transparency is one of my Things, and it's still not provided as widely in the Salesforce ecosystem as it should be.\n\nYou should know the pay range for a job when you apply. Three states - California, Colorado, and Washington - have strong laws requiring that you be given this information (in most circumstances; state-specific criteria apply). New York State's law comes into effect on September 17. A few other states have weaker or more situation-specific laws, like requiring disclosure only on request or after an initial interview.\n\nYou don't have to live in a transparency state to get transparency. If the company is located in a transparency state, or can hire in a transparency state, there is a good chance they are still bound by the law.\n\nI really encourage folks in and trying to break into the Salesforce ecosystem to know your rights. I built a tiny open source site called [PayTransparency.work](https://paytransparency.work/) that shows you the specific requirements of each state, and can help you determine if any state laws apply to your situation. \n\nThere are some companies and recruiters that are astonishingly defensive about pay transparency. That's probably a pretty good signal about where they stand on worker's rights. Just ask politely and see where you get!",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1694726136.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.8,
    "category_rationale": "Informational post explaining pay transparency laws and rights.",
    "composite_score": 2.1786662482156345
  },
  {
    "score": 11,
    "title": "My speculation on why advanced admin cert is a huge door opener",
    "selftext": "So hear me out I know the advanced admin cert doesn't help you specialize in a more marketable niche like Service Cloud + Field Service would, BUT, recruiters don't actually know that.\n\nIf you have an admin and service cloud cert, recruiters think \"this person just does service cloud\".\n\nInstead, lots of companies don't see certifications the way we do. They see the word \"advanced,\" and they think \"top notch\".\n\nHonestly it's opened more doors than my platform dev I cert.\n\nJust my experience -- recruitment favors this certification more than we do. And for the most part it's just extra security and territory questions.\n\nHope this helps someone as I know lots of people recommend against it.\n\nBut the thing is -- after the admin and Developer cert, most knowledge areas are just a super badge away.\n\nJust my experience.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1676434148.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Opinion on how an advanced admin cert affects hiring and opportunities.",
    "composite_score": 2.1582568712394465
  },
  {
    "score": 9,
    "title": "Just ranting about requirements and rate...",
    "selftext": "&gt;**Position**: Salesforce Admin/Dev\n\n&gt;**Location**: Tampa, FL -hybrid (Tue-Thu)\n\n&gt;**Rate**: $40/hr. C2C (No Flex)\n\nand\n\n&gt;3–5 years of experience as a Salesforce Admin or related role\n\n&gt;Bachelors Degree in computer science, Information Technology, Business Administration, Finance, or related fields\n\n  \nIt is paid just $40/h for a 5years of experience, CS degree, and you have to drive to work, living in Florida... Come on!",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1756405927.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.83,
    "category_rationale": "Rant about low pay and stringent job requirements.",
    "composite_score": 2.2469716761534184
  },
  {
    "score": 10,
    "title": "12 yrs exp in Salesforce - No longer excited about it - Want to transition ",
    "selftext": "I am a tech lead working in a product company on Salesforce. I have around 12 years of work experience. \n\nI am bored/ no longer excited about Salesforce. I am from electronics engineering background. Trying to learn the fundamentals of software engineering like HLD, LLD, DS, Algo. \n\nI want to transition to an alternate stack. I STILL LOVE CODING.  What should I consider? DATA science/AI/ML? not sure of data excites me. Anybody else in a similar dilemma? Would love to hear your inputs\n\nAlso, if I were to take the jump, would i have to take a salary cut? I think I am not willing to do that.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1725617275.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Describes career transition dilemma and questions options.",
    "composite_score": 2.304456702997344
  },
  {
    "score": 9,
    "title": "State of the Job Market 2017 vs 2024",
    "selftext": "Back in 2017, I studied to pass the Admin/App Builder exam, applied to a Junior Salesforce Admin job with no prior experience/relevant degree other than the certs, got hired and worked my way up to a Lead Salesforce Developer position (I have 8 certs and a masters degree in Software Engineering now). It feels like I was in the right place/right time to get my foot in the door easily and ride the Salesforce wave. \n\nMy husband is looking to change his career to tech, and seeing how it worked great for me 7 years ago, my instinct was to recommend the Salesforce Developer track. It makes sense on paper, I can help him learn best practices, plus I can connect him with the many recruiters who reach out to me on linkedin/my general network.\n\nHowever, looking at this/other Subreddits, it seems like the sentiment towards the SF job market/getting into entry level positions is profoundly negative, and it makes me nervous about recommending this path. Do you think it really is THAT bad out there, or that with adequate support/guidance, a transition in is still possible. \n\nThe plan we were thinking of was:   \n1-2 years to get a degree in CIS/software engineering  \n1 year to study for the Platform App Builder/Dev 1 certifications, and build out a personal project to demo skills. ",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 9,
    "downs": 0,
    "created_utc": 1705078171.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Discussion comparing past and current job market with transition planning.",
    "composite_score": 1.9869850021680093
  },
  {
    "score": 11,
    "title": "Is 70K CAD a good salary as a certified Salesforce admin with 5 years of experience?",
    "selftext": "I’ve been the the sole Salesforce Administrator at my company in Canada for almost 6 years. I am paid 70K Canadian annually plus benefits and a pension. (~52K US).\n\nI have helped build out dozens of custom apps, experience sites, and flows. Our company serves over 30,000 clients, and almost 50 employees, but is a non-profit. \n\nI have my Salesforce Administrator certification, and I also have a Master of Business Administration (MBA). \n\nAm I getting paid fairly? I have no other Salesforce jobs to compare it to, so I really have no idea.",
    "subreddit": "SalesforceCareers",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 11,
    "downs": 0,
    "created_utc": 1673232785.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal salary question without actionable steps or a model; not a list or guide.",
    "composite_score": 2.3746962438796153
  }
]