[
  {
    "score": 73,
    "title": "What Really Makes a Salesforce Developer \"Senior\"",
    "selftext": "Many people think you automatically become a Senior Developer once you hit 3–5 years in Salesforce. But honestly, it’s not about the years. It’s about what you’ve learned and how you apply it.\n\nHere are a few things I believe every developer should work on if they really want to grow:\n\n1. What are the different objects in \nBeginner answer: Standard &amp; Custom.\nBut there’s more— Setup Objects like Custom Settings and Custom Metadata (__mdt), Big Objects, History Objects, Share Objects, Platform Events, etc.\n\n2. Think scalability\n\nWriting Apex? Follow DRY and SOLID. Don’t rewrite the same logic again and again. Learn Trigger Frameworks and Apex Enterprise Patterns.\n\nUsing Flows? Don’t build one giant flow. Break it down into smaller, reusable ones.\n\nBuilding LWCs? Make them reusable. Use helper or util components instead of cramming everything into one. It’s also a big plus if you explore OmniStudio and MuleSoft.\n\n\n3. Pick the right tool for the job\n\nThe same problem can often be solved in many ways.\n\nFor example, add a button on the Account to create a Contact. You could use Record Actions, AppExchange components, Flows, Visualforce, Aura, LWC, or LWC + Apex.\nThe difference is choosing the right solution for the scenario rather than just making it work.\n\n4. Get your integrations right\nKnow OAuth, JWT, Named Credentials, and Connected Apps. And always set them up with the minimum required access for security.\n\n5. Learn SFDX CLI\nIt makes deployments, scripting, and automation much easier.\n\n6. Get comfortable with CI/CD\nWhether it’s GitHub Actions, Azure DevOps, Copado, AutoRABIT, Flosum, or Gearset—pick at least one and get hands-on. Even better if you can set it up yourself.\n\n7. Share and learn together\nIf you solve a complex problem, don’t keep it to yourself. Share it—whether open source, a blog, or a LinkedIn post. Teaching others sharpens your own skills.\n\n8. Don’t stop at the basics\nSales and Service Cloud are just the beginning. Explore Experience Cloud, Marketing Cloud, Commerce Cloud, or industry clouds like Finance or Health. That’s how you stand out.\n\nBeing “senior” isn’t about your years of experience.\nIt’s about knowing your tools, building scalable solutions, making wise choices, and always learning.\n\nThat’s my take.\nWhat do you think, what else should Salesforce developers be focusing on learning in 2025?",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1757139566.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2322467175629668
  },
  {
    "score": 67,
    "title": "I published a VS Code Extension for migrating Salesforce records and metadata between orgs.",
    "selftext": "Migrate Salesforce metadata and records smoothly between orgs right from VS Code.\n\n**Features:**\n\n* **Org Selection:** Select source/target orgs (DevHub, Sandbox, Scratch, Other) with visual connection status.\n* **Metadata Migration:** Browse source org metadata types, view components, and perform retrieval/deployment with status tracking.\n* **Records Migration:** Perform DML and Export operations, select objects &amp; fields, build SOQL queries visually, track job progress or cancel it.\n* **Dynamic Theming:** Automatically adjusts its appearance to match your VS Code theme.\n\nGet the extension on [VS Code Extension Marketplace](https://marketplace.visualstudio.com/items?itemName=AntonKutishevsky.salesforce-migrator).",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1744260258.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1394805888596546
  },
  {
    "score": 66,
    "title": "Why Am I not impressed by anything Einstein AI?",
    "selftext": "When I say Einstein I’m talking about Salesforce AI. Salesforce AI has branched to become like us own entity. There is even a CEO of Salesforce AI. But quite frankly I haven’t been impressed by any of the early Salesforce AI tools, and I don’t hear anyone talking about them glowingly. \n\nSeems like Salesforce is going all in on this. Of course it’s the wave and they have to satisfy investors and increase the stock price, but has any developers found any value in Einstein AI. \n\nFor me, I have Einstein AI in visual studio code which works like GitHub Copilot, but much worse. It’s actually frustrating to use and I never use it. I tried asking it questions about my code base and it seemed absolutely clueless.\n\nWhat are y’all thoughts on Einstein AI?",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1710458783.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4073598907497944
  },
  {
    "score": 52,
    "title": "My 6 favorite books for Salesforce Development",
    "selftext": "Hey :) When I was an experienced Junior Developer, I read a bunch of books around Salesforce, and I haven't stopped ever since.\n\nHere are some of my favorites.\n\n[My offline collection](https://preview.redd.it/5jhxktclyy9g1.jpg?width=5712&amp;format=pjpg&amp;auto=webp&amp;s=dfc2d055ea5f7d8be87c4c339dd8daf978ddff03)\n\n# #1 - Mastering Salesforce DevOps by Andrew Davis\n\nThis might be a bit of an unexpected pick for the first book in a list. But I think it made me a more well-rounded Salesforce Developer. \n\nEven though it's a DevOps-focused book, it has stuff like branching strategies, modular development, and delivery best practices.\n\nProbably one of my favorite books in Salesforce.\n\n# #2 - Advanced Apex Programming by Dan Appleman\n\nI guess no one is surprised by this one. It's a good book that goes beyond the simplest concepts (which is rare to find). My only issue with this book... horrible code style. \n\nWhich can be mitigated by reading the next one...\n\n# #3 - Clean Apex Code by Pablo Gonzalez\n\nIt's a very nice book that you can use as a reference for best practices and clean code. \n\nUnlike Java or other programming languages, we don't really have one collection of best practices. So I ended up writing code style documentation for any company I join. And this book is a very good way to just hand it over to your colleagues.\n\nNow, some non-Salesforce books that I still love for Salesforce Development!\n\n# #4 - Eloquent Java by Marijn Haverbeke\n\nIt's a pure JavaScript-focused book. But the good part is that it's free. And since LWC, Aura and Visualforce rely on JavaScript, it is very helpful to get good at JavaScript itself. \n\n# #5 - Clean Code by Robert C. Martin\n\nWell... this is a classic one! And I am little torn about this book. I read it when I was still a Java-developer and I loved absolutly loved it. If I were pure Salesforce Developer, I'd probably skip 50% of this book. But still a good read to get a feeling on best-practices.\n\n# #6 - The Pragmatic Programmer by David Thomas &amp; Andrew Hunt\n\nThis is my favorite book. I especially loved \"The Cat Ate my Source Code\" section. It's the idea of taking responsibility for your own actions and code, which I was really bad as a Junior... For sure the most impactful book on my career. \n\nIf you haven't read it, go read it!\n\nAnything you'd add?",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1766938963.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.019412122152442
  },
  {
    "score": 41,
    "title": "Does Saleaforce care about developers?",
    "selftext": "I have been doing development since 20+ years, mostly Java. I was given a Salesforce project, to my surprise it feels like working 20 years ago. Little debugging tools, Apex feels archaic, no proper unit test, etc. Don’t get me started with no code, low code approach. Also, quality of devs are so low, feels like they don’t know any software engineering best practices. \n\nLicenses are super costly with little value. Does any one know why is that? This makes me think, do they care about Developer Experience ? ",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1755837967.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.082475628640994
  },
  {
    "score": 40,
    "title": "Anyone else losing their job to offshore labor?",
    "selftext": "Somewhat a vent post, partially also just wondering what my next move should be. I’ve been a senior dev at my company for 5 years. My manger has told me I’ve been exceeding expectations at every yearly review and I’ve become the SME of many parts of our systems/integrations and thought I had excellent job security. I got told this week that in order to “stay competitive” in our Saas space, the VP decided we need to make use of offshore labor just like our competitors are doing. But instead of supplementing with offshore labor, they are laying off our ENTIRE team and replacing us all with people in the Philippines. Essentially just hitting reset on our team with a bunch of people with 0 knowledge trying to work in our systems. It’s going to be a hilarious shitshow but unfortunately “I told you so”s mean nothing to me when I’m unemployed. \n\nI am now horrified after hearing how bad the job market is, not sure if that applies to me as someone with 8+ years dev experience and some big certs like Application Architect, PD2, and CPQ. I am wondering if getting back into another dev job is even worth it or if I will encounter more delusional upper management that now finds us totally disposable. I’d love to get into the architect world but it may be hard to join a new company as one, I always envisioned just getting promoted internally as one after spending time as a dev. \n\nIs anyone else just scared of staying in the development space even as a high performer due to offshoring and AI, or am I being paranoid just because of one company’s decision?",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1751492813.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7553328767268637
  },
  {
    "score": 39,
    "title": "I developed a local Salesforce LLM Assistant that runs on your computer",
    "selftext": "I built a Salesforce Lightning Web Component that lets you run powerful AI language models (LLMs) directly on your computer within Salesforce using records for extra context.\n\nIt uses Pico LLM technology to process data locally, keeping your information secure and responding quickly. You can use it to generate emails, write content, analyze customer data, and more, all without relying on external services.\n\n[Medium Article](https://akutishevsky.medium.com/i-developed-a-local-salesforce-llm-assistant-that-runs-on-your-computer-d29b6b89517e)\n\n[Demo video](https://youtu.be/QKkRJ8RAlnE)\n\n[GitHub repo](https://github.com/akutishevsky/salesforce-local-llm-assistant)\n\nhttps://preview.redd.it/pai2ftnkq1me1.png?width=1142&amp;format=png&amp;auto=webp&amp;s=703e0a0afef917329939bde556f317b7d6d46ded\n\n",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 39,
    "downs": 0,
    "created_utc": 1739181014.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.805256333907075
  },
  {
    "score": 33,
    "title": "The future of being a salesforce dev",
    "selftext": "So, Ive been thinking about my career lately. With all of the tech industry going up in flames I do wonder if being a salesforce dev is a good career choice anymore.\n\nThe reasoning being that Salesforce is moving away from code a bit more every release and from what my friends in consulting tell me, they dont even have a dev on their implementation teams anymore because everything is handled by flow, which consultants configure\n\nThere will always be edge cases or integrations that need some code but this will obviously be a lot less demand than what we see right now\n\nI cant tell if im being paranoid but I can see it being basically impossible to find a job in 4-5 years as a dev because the market will be flooded with devs that were cut because config &gt;&gt; code",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1723929340.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.960039544402086
  },
  {
    "score": 29,
    "title": "Heads up: Accounts pushing risky Chrome extensions on Salesforce subs",
    "selftext": "Hi everyone, I’ve seen a wave of new accounts pushing Chrome extensions across the Salesforce subs, so here’s a quick heads-up to keep things safe.  \n\nSome of these extensions can access your org data or even steal session info. Please be cautious.  \n\n**Watch for red flags:**  \n- Brand new accounts (only a few days old)  \n- Only posting about these extensions\n- Robotc, AI-generated, or copy-pasted replies  \n- Link shorteners or off-store downloads  \n\nAlways check permissions and publisher info before installing anything. Eg: if it asks to “read and change data on all sites” or access your Salesforce domains, skip it.  \n\nStick with trusted devs and well-known tools. If something feels off, report it to the mods and move on. Stay safe out there.",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1761660766.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5241062568876718
  },
  {
    "score": 30,
    "title": "Where can I find a list of SF developer practices?",
    "selftext": "Not necessarily best-practices, \n\nbc if you look that up you get a whole lot of \"ads framed as blog posts\" where they list out the 5 generic practices SF says to do, make vague claims that they \"do best practices\" and are super efficient yadayadayada and that's why you should hire them. Probably written by AI, basically garbage advice.\n\nExcept Apex Hour, they're actually decent.\n\nSo what ***are*** SF practices, best or otherwise? Wanna get a sense of what's done, what works &amp; doesn't work, maybe just put together my own list based on that.\n\nTo give an example and maybe start the convo, one thing I do is I create a virtual class for a TriggerHandler to enforce consistency across trigger handlers. So when you create a new trigger handler, you just extend the virtual class. It's built with testing in mind, so if you want to use mocks you can just test, ex. AccountTriggerHandler.beforeUpdate in a test method.\n\nExplicitly disallows skipping trigger mechanisms, I only ever see that done for test methods, it's an anti-pattern imo, if it's the case you're doing that, its a strong sign you need to either use mocks or clean up your process builders / triggers / flows -- or convert some DLRS triggers to flows.\n\nAnother thing is I've been gradually working towards adding service classes. Let's say you have a controller class, like an apex class for an LWC. it should really just be concerned with \"doing the thing\", maybe some application-specific formatting, and error-handling. Have the service class \"do the thing\", wrap the callout to it in the controller with a try-catch, and just handle error-handling in the controller. \n\nOne thing I do EXPLICITLY avoid tho is \"clean code\", i.e. every method is &lt; 4 lines and you have to jump around 40 files to figure what everything does. Hate that with a burning passion lmao. Methods I heuristically shoot to be &lt; 80 lines, longer than that &amp; I make some private helper methods. But seeing stuff like this:\n\n```\npublic static void doTheThing() {\n  doStepOne();\n  doStepTwo();\n  doStepThree();\n}\n\nprivate static void doStepOne() {\n  if(canDoStepOne()) {\n    startDoingStepOne();\n  }\n  dontDoStepOne();\n}\n\nprivate static Boolean canDoStepOne() {\n  return checkIfCanDoStepOne();\n}\n\n...\n```\n\ncode like this is garbage 🗑.",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1708885591.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8663483678196817
  },
  {
    "score": 30,
    "title": "Code quality and best practices",
    "selftext": "Hi all,\n\nDo most of the big consultancies / companies ensure high quality code in their solutions?\n\nIn the point of view from general software engineering practices we noticed that in our org (1k+ users, custom heavy) there are several concerning things:\n\n- Lack of proper documentation\n- Big classes, big methods, commented out code from long ago\n- No folder structure in the code base\n- Complicated methods\n- Hard coded values in code\n- Bad secret and key management\n- No git source of truth, lack of proper ci/cd, manual changes in environments resulting in unaligned pipelines\n- Lack of naming conventions\n\nWe were wondering if this is a standalone issue that should be worrying for us…..\n\nOr is this because a lot of Salesforce developers do not always have a general software engineering background and thus deliver quick but less robust/future-proof solutions?\n\nVery interested in the opinions on this topic.",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1729609134.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8144257116733917
  },
  {
    "score": 28,
    "title": "Salesforce Connected apps are the worst developer experience ever.",
    "selftext": "The first thing that should be done is to explain each and every setting in detail. Like it took me two days on how to get a refresh token. Half of the settings are not specified. I had to literally read oauth2.0 documentation PKCe etc to even understand what needs to be done.\n\nWhat is even an app manager which has all the apps lightning and connected and then another connected apps. The edit of the connected apps is actually manage on the app manager. Literally made no sense to me.\n\nThe errors need to be more explicit and in detail. There should literally be a really long video on each and every setting because this is not your average everyday admin stuff.\n\nFor now to all the devs I think the only way to learn is to get hands on.",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1702891440.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6954436274267968
  },
  {
    "score": 27,
    "title": "feeling desperate",
    "selftext": "I'm a 10+ year salesforce developer with 12 certs, but the majority of my focus has been on platform development, not necessarily sales cloud or service cloud. ive been passed over in some interviews as it seems companies are seeking more niche product alignments, like cpq or marketing cloud. I used to get 5/6 recruiter emails a week, but not anymore. I'm not sure if asking for a lower rate helps either. But at this point I need to start thinking about moving away from salesforce and doing something completely different. Is this normal?",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1753631423.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8978388782593556
  },
  {
    "score": 29,
    "title": "I made my own Salesforce MCP server",
    "selftext": "Hey everyone,\n\nI've developed a tool that can significantly enhance the efficiency of Salesforce development and administration when working with AI assistants.\n\nThe traditional workflow often involves:\n\n1. Navigating to Salesforce to perform a query or inspect metadata.\n2. Copying relevant data or information.\n3. Switching back to an AI tool to analyze or process that information.\n4. Repeating this iterative process, which can be time-consuming and disruptive to focus.\n\nTo overcome this, I've built a Model Context Protocol (MCP) server that establishes a direct, programmatic connection between your Salesforce org and AI development tools. This means your AI chats, agents, and assistants can connect to your org to perform actions directly, making them significantly more useful and integrated into your workflow.\n\nWhat's MCP? For those who might not know, MCP is essentially a standardized way for AI models to interact with external systems and tools. Think of it as a universal API for AI assistants. It allows AI to \"understand\" and \"use\" real-world capabilities – like querying a database, executing code, or deploying metadata – without you having to manually bridge that gap. This server acts as that bridge, giving your AI direct, programmatic access to Salesforce.\n\nWith this server, you can ask your AI things like:\n\n* \"What's the status of a specific case?\" (and it runs the SOQL query)\n* \"Execute this anonymous Apex to test a particular logic.\"\n* \"Retrieve the metadata for a custom object.\"\n\nQuick Look at What It Does:  \nIt's a Node.js application that implements the MCP, providing 15 Salesforce-specific tools. This includes:\n\n* Query &amp; Search: SOQL, SOSL, SObject Describe\n* Apex Development: Anonymous Apex Execution, Apex Test Runs, Debug Log Retrieval\n* Data Management: Record CRUD (Create, Retrieve, Update, Delete, Upsert)\n* Metadata Management: Metadata Type Listing, Component Deployment, Component Retrieval (BETA)\n\nWant to Check it Out? If this sounds useful to your workflow, I've open-sourced it on GitHub: [https://github.com/jaworjar95/salesforce-mcp-server](https://github.com/jaworjar95/salesforce-mcp-server)\n\nSetup is pretty straightforward if you're comfortable with Node.js: clone the repo, npm install, set up your SF credentials in a .env file, and configure your MCP client (works with Claude Desktop, Cline, etc.).\n\nI'm really keen to get feedback from the wider Salesforce community. If you try it out, please let me know what you think, if you hit any issues, or if you have ideas for new tools/features. I'm especially interested in hearing about any edge cases you encounter.",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1748703436.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7667118777434747
  },
  {
    "score": 29,
    "title": "Why does VSCode/Salesforce integration consistently not work",
    "selftext": "Ever since I became a SF dev 4 years ago I have had endless problems with VSCode and Salesforce. This time around VSCode deploys source to org forever without success. I had this same issue before, but ended up turning off **Perform Synchronous Compile on Deploy** which fixed it up until 3 months later where I am now experiencing this same issue.\n\nI just want to do my job and this is just getting exhausting.",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1727496762.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.031227511607334
  },
  {
    "score": 28,
    "title": "A Hackers’ guide to override “New” button functionality with LWC modal",
    "selftext": "Recently in one of my projects I had a requirement to override the standard New button functionality with custom LWC component to accommodate some business logic.  \nWhile searching for the same, I could not find any satisfactory solution online, so I went ahead and created this throwaway prototype.  \nI'm sharing a link to the detailed article along with GitHub Repo below. Please have a look at this and let me know if you have found any other workaround for this issue.\n\nMedium Article Link: [https://medium.com/@arindam-karmakar/a-hackers-guide-to-override-new-button-functionality-with-lwc-modal-a39d35c73bc4](https://medium.com/@arindam-karmakar/a-hackers-guide-to-override-new-button-functionality-with-lwc-modal-a39d35c73bc4)\n\nGitHub Repo Link: [https://github.com/gitTheArindam/lwc-new-button-override](https://github.com/gitTheArindam/lwc-new-button-override)",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1705766873.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6124470179060846
  },
  {
    "score": 26,
    "title": "How to future proof my career in Salesforce ..?",
    "selftext": "Hey People, I know Salesforce has been there for a long time, but the market is now getting saturated. I am specifically asking the seniors in the market. How can I future-proof my career for those who started their IT career in Salesforce? I have 4 years of experience in Salesforce, but I think I need to upskill a lot. I know the platform Apex, LWC, Aura, Visualforce, Flows, with expertise in Sales, Service, Health, Experience Clouds and Appexchange application development expertise. I know the basics of CPQ. But I feel I'm not doing enough to keep up in the job market, and I'm staying in the same company from the beginning of my career for 4 years. My core skills were debugging, problem-solving, and system design. In between, I got offers from two different companies, but I decided to stay. But I need to learn more. So, what do you think I need to focus on upskilling ..? I need to hear perception of different people.",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1757279249.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6270601067381003
  },
  {
    "score": 25,
    "title": "Am I asking too much?",
    "selftext": "Hi all,\n\nI'm a technical architect with 3+ years experience in things like microservices architecture, Kubernetes, Kafka, Keycloak... As probably all technical architects I started my career as a developer, which I did for 5 years. At the moment I'm working as an employee for a consulting firm.\n\nSome months ago, I got offered a project in which I temporarily needed to replace an architect in a team that focusses on Salesforce development. They primarily use Service, Sales and Experience Cloud. The org we work on is 10+ years old, but was only heavily being used the last couple of years (4 I think) since they decided to build a customer platform on top of Experience Cloud. Because the company did not have the internal resources they partnered with another consulting firm (only focussed on Salesforce) providing multiple \"software developers\" all having tons of Salesforce certificates. The team is 90% external developers from that company...\n\nWhen I entered there was no development pipeline, no sign of any architecture, no centralized style sheets, no governance. Nothing... When I checked the code, it was a complete mess. Hardcoded secrets all over the place, classes of over 3000 lines of code, methodes of over &gt;100 lines. I did not encounter one interface nor a virtual method. When I asked why it was not there, they told me it was too difficult!? (Like what, you guys have 10+ certificates on SF and are sold as senior developers). When we faced integrations with third parties they had not a single idea what a JWT was or how authentication flows work let alone they know what an OpenApi specification is and that they could use it to generate code and negotiate contracts... They never heard of SOLID, hexagonal architecture, data normalization and so on.\n\nData modeling is a complete chaos. Most of our main objects (Account, Case, Contact) have over 600 fields on them in which most of them have ridiculous names and values. I asked them why they never did data normalization but they did not have an answer.\n\nAfter all this misery, I was finally able to convince my superior to go and hire real software engineers with a background in IT. We hired a junior java developer (1 year of experience) that was willing to do SF development and after 1 week he was already delivering more value than most of the Salesforce consultants we have...\n\nIn my experience I feel that Salesforce developers are promoted to senior after 2 or 3 years, which imo is ridiculous. In the country I work in, they are sold for &gt; 850 euro a day... For reference, a senior java developer with 20+ years experience in IT is probably earning 700 - 800 a day here. Most of the people working in the Salesforce ecosystem are lacking a decent background in IT (if they have one, most of the profiles we get do not even have a degree in IT). I've had calls with Salesforce Engineers via our Signature Success Plan and I had the same experience. The people I've met in those calls lack a background in IT and are only focussed on \"delivering business value\", which is a false promise since we needed to rebuild most of the things that are only 2 years old because a lack of architecture...\n\nIf it was me, I would only hire medior / senior software engineers and let them automate the \\*\\* out of our Salesforce org and that would still be only 60% of the cost we pay now...\n\nIs there anyone out here having the same experience? I'm really doubting to quit this project because I feel like the company is being scammed...",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1755805967.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7370333392987805
  },
  {
    "score": 26,
    "title": "I published a step-by-step guide on building a very simple Salesforce MCP server with Node.js.",
    "selftext": "In the tutorial, I walk through:\n- Setting up a Node.js MCP server from scratch\n- Integrating with Salesforce CLI\n- Configuring Claude Desktop for seamless connectivity\n- Executing real-time Salesforce queries with AI\n\nThe article: https://akutishevsky.medium.com/how-to-build-a-simple-salesforce-mcp-server-with-node-js-a-step-by-step-guide-43fe2c7b9630\nThe repository: https://github.com/akutishevsky/sf-mcp-server/tree/main",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1750050312.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6720601067381002
  },
  {
    "score": 23,
    "title": "Article: Exploring Mixins in LWC ",
    "selftext": "At my workplace, one of the things we were struggling with as we write more complex LWC experiences was sharing logic and behavior between our components. \n\nA lot of our components share state, which might come from the server (e.g. info about the logged in user) or even the browser itself (e.g. info stored in local storage). this led to a lot of code repetition, with a lot of the components having repeated \\`wire\\` calls, or the exact same setup code in the \\`connectedCallback\\`.\n\nWe played around with different solutions, like having a parent JS class that extends \\`LightningElement\\` that others components can extend from, or having LWC Services that export common behavior. These work up to certain extent. \n\nParent classes work great, because they allow you to define behavior in the lifecycle hooks, but they kind of force you to put everything in there and can grow out of hand, for example, one component might want A, but another B, and another a combination of A+B. This forces the parent to have A+B, and components extending it will get everything even if they don't need it.\n\nServices also work great, but they don't allow you to override the lifecycle hooks, and don't solve the repetition problem, as you still need to import them and imperatively call them everywhere you want to use them.\n\nWhat we've been leaning towards is creating our own custom mixins, and this seems to be the most elegant solution we've implemented so far.\n\nI wanted to share an article I wrote around my investigation there, how to implement them, and some common use cases: [https://cesarparra.github.io/blog/blog/exploring-mixins-in-lwc/](https://cesarparra.github.io/blog/blog/exploring-mixins-in-lwc/)",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 23,
    "downs": 0,
    "created_utc": 1731852273.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7282262395435968
  },
  {
    "score": 24,
    "title": "Create &amp; Upload Scratch Org Dummy Data Faster with Python",
    "selftext": "New YT video on how to auth to a scratch org quickly with Simple Salesforce and upload dummy data. This avoids having to create a password &amp; security token (which is somewhat confusing and slow). In a situation where I need to create a lot of Dummy Data to stress test my app, and python is my preferred method for this. \n\nCurious how people on this sub get dummy data into scratch orgs?  \n\nVideo: [https://www.youtube.com/channel/UC-WYCqJ3Oxk0ZcQg6X8aGag](https://www.youtube.com/channel/UC-WYCqJ3Oxk0ZcQg6X8aGag) \n\nGitHub Link: [https://github.com/wbmcdonald4/salesforce-sandbox/blob/main/salesforce-scratch-python.ipynb](https://github.com/wbmcdonald4/salesforce-sandbox/blob/main/salesforce-scratch-python.ipynb)",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1709003926.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.4489700043360187
  },
  {
    "score": 24,
    "title": "Is it realistic to make a living off of selling app exchange packages?",
    "selftext": "I'm really getting sick of the corporate developer life. I'm a good developer, I can make pretty much anything in Salesforce. \n\nI have some ideas for the app exchange. I could quit my job and spend a few months building these and trying to sell them.\n\nHere's what I'm concerned about:\n\n- Development shops in India are pumping out app exchange packages every day. While I would need at least $100k per year (after tax + app exchange fees) to make a comfortable living. Somebody in India can probably charge pennies for their project and still make enough to live.\n\n- Discoverability. If I make a great product, I have no idea if it is 1: truly in demand, something that people will buy. Or 2: actually getting companies to become aware of the product. \n\nNot really sure what this post is. Just hate my job and wondering if anybody has thoughts or anybody has tried to jump into the app exchange world like this.",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1736557419.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.6881644693611744
  },
  {
    "score": 24,
    "title": "Git-based Salesforce development: free CI/CD templates",
    "selftext": "You might find the following, free to use \"recipe\" (template) useful/inspirational for getting started with your Salesforce CI/CD Deployment Pipeline on your Git Host of choice:\n\n[https://github.com/hutte-recipes/cicd-incremental-deployment](https://github.com/hutte-recipes/cicd-incremental-deployment)  \n\n\nSee the included readme for detailed step-by-step instructions on setting it up. I also includes links to the same template adapted for [Gitlab](https://gitlab.com/hutte-recipes/cicd-incremental-deployment/-/tree/main), Atlassian [Bitbucket](https://bitbucket.org/hutte-recipes/cicd-incremental-deployment/src/main/) and Microsoft [Azure DevOps](https://dev.azure.com/hutte-recipes/_git/cicd-incremental-deployment) 👍",
    "subreddit": "SalesforceDeveloper",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 24,
    "downs": 0,
    "created_utc": 1686547922.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.356500636031869
  }
]