[
  {
    "score": 4229,
    "title": "Got ghosted for 97 days. Closed $1.3M with a handwritten note",
    "selftext": "I don’t have anyone IRL I can tell this to without sounding like a clown so… hello internet.\n\nEnterprise SaaS. 7-figure quota. Deal was sitting at legal. Champion leaves. New CFO “re-evaluating vendors.” You know the drill. Then: silence. For. Ninety. Seven. Days.\n\nI did the usual: polite bumps, new thread, forwarded thread, “bumping this to top of inbox,” value adds, case studies, the whole parade. Nothing. Pipeline rotting. Manager asking “any updates?” god I hate that but it works.\n\nDay 98 I snapped (in a calm way). I got a ping on nationgraph that their board was meeting that friday. Clock was ticking. I printed a one-page note on actual paper, signed it with a blue pen like a psychopath, and FedEx’d it to the CFO’s attention. The note said:\n\n“If you’ve moved on, totally fair—please tell me so I can move on too. If not, here are the 3 things blocking value on your side (from your team’s words, not mine):\n\n1. SSO risk sign-off\n2. 90-day opt-out language\n3. Training for the field team before Q4 \n4. Give me a 10-minute ‘no-slides’ call this week and I’ll walk you through how we de-risk all three without changing price. If I can’t, I’ll write the breakup email for you.”\n\nNo deck. No link. I put my cell at the top in huge font like a Craigslist ad.\n\nHis EA called the next morning: “He can do 12:10–12:20 today. Don’t be late.”\n\nWe did it in 7 minutes. He said, “If you include the opt-out and own the training schedule in the MSA, I’ll sign.”  \nFriday 4:36pm: DocuSign ping. $1.3M TCV, $280k year one. Commission pre-tax: $104,000. I sat there staring at my screen like it was a wild animal that wandered into my apartment.\n\nWhat worked (in my very unscientific opinion):  \n– Physical pattern interrupt. Email = background noise. Paper on a desk = “who is this maniac?”  \n– Specific friction list in *their* language. Not “value,” not “synergy.” The three actual bricks in the road.  \n– Risk reversal. I offered to write the breakup email. Takes the pressure off saying “no,” which ironically makes “yes” easier.  \n– Ruthless brevity. Ten minutes. Humans can tolerate ten minutes.\n\nI’m not a wizard. I lost two other deals this quarter that still make my stomach flip. But this one… this one reminded me why we play the game.\n\nIf you’re stuck in ghostland, try getting weird (professionally). Paper. Loom to an EA. A 90-second voicemail to the CFO’s assistant with a single, specific ask. Something that doesn’t look like every other email in the pile.\n\nShoutout to you if you cared enough to read this far. AMA I guess",
    "subreddit": "sales",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 4229,
    "downs": 0,
    "created_utc": 1756928326.0,
    "media": null,
    "is_video": false,
    "num_comments": 384,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.6390707321292926
  },
  {
    "score": 2520,
    "title": "Just lost millions in sales due to tariffs",
    "selftext": "Fucking kill me \n\nThose who messaged me\n\nI work for a manufacture and spent 5 \nFucking months flipping residential new construction builders to our product so many hours conversations getting contractor buy in supplier buy in. \n\nFucking wasted and now I'm way down in my numbers focusing on this specific path and instead of securing my year now I have to scramble to pivot. \n\nFinal edit: I am not a retard therefore I did not vote for trump. You're in the sales sub. If you can't tell what a shitty lying con artist is why are you even in sales? ",
    "subreddit": "sales",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 2520,
    "downs": 0,
    "created_utc": 1745357925.0,
    "media": null,
    "is_video": false,
    "num_comments": 409,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.360464774036314
  },
  {
    "score": 1835,
    "title": "Closed the largest deal of my life",
    "selftext": "As title shared, closed the biggest deal of my life. 600k of new arr for 3 million total over 5 years. I’m in the cyber security sector, PKI to be specific. \n\nHonestly almost cried. This puts me at 120% of my number for the year with 1.5+ in pipeline left to close and all in accelerators.\n\nI’m not hear to brag, but more so give motivation to you and rant 😅. I graduated high school with the lowest at GPA in my graduating class (my dean let me know this). I got denied from 10+ schools but one, got addicted to Xanax, graduated in something I hated and worked a job 5 years ago making 39k a year. I completely stumbled into tech.\n\nI got denied 5+ promotions from sdr to AE, moved to another company to be a founding SDR, got denied another 2 promotions. Guy on our team quit and I finally got a chance. Last year got 100% and now this year I’m in August and I’m at 120% in the enterprise space. \n\nWe’re one decision, skill, or conversation away from changing our lives. Keep your foot on the gas and I PROMISE you will eventually catch a break. I love how supportive and motivating this sub is and just hope this gives someone the words of encouragement they need.\n\nNow, VOO or bitcoin? \n\nUpdate: holy cow this exploded 😂 thank you so much y’all. Yall are going crazy in the comments and I love it",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1835,
    "downs": 0,
    "created_utc": 1725911526.0,
    "media": null,
    "is_video": false,
    "num_comments": 302,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.239593991116377
  },
  {
    "score": 1686,
    "title": "I'm about to get a $300k Commission check and I can't tell anyone (So I'm telling the Internet) - AMA ",
    "selftext": "After nearly 20 years in sales, I'm going to have my best earning year yet, finishing at least at 170% of quota, with a final deal outstanding that could push me to 180%+. While it's not my highest percentage to quota to date, my current OTE is the highest it's ever been. This is my 7th year with my current company.\n\nAt my present attainment I'll be receiving a bonus check of $260k in Q1. If this last deal closes, I'll be getting just north of $300k. (previous high single commission check is \\~$170k.)\n\nRole Details:\n\n* Enterprise Software\n* Quota= \\~5M\n* OTE is just under 400k\n* W2 history for this role:\n   * 2024 = $475k\n   * 2023 = $400k\n   * 2022 = $470k\n   * 2021 = $515k\n   * 2020 = $300k\n   * 2019 = $280k\n   * 2018 = $200k\n\n2025 will be more than likely be my best earnings year by far with the \\~250k-$300k paycheck incoming.\n\nWhy am I posting this? Because I'm fucking stoked and I want to tell someone about it, and I can't really yell this from the rooftops IRL. So I guess I'll have to brag on the internet.\n\nI'm happy to answer any questions you might have about my experience, the sales process, or anything else related to my career. I'm currently in a holding pattern until the end of the year, awaiting final signature on that last deal.\n\nSales is a great career if you can find your spot. Keep learning and don't settle for a shitty role/manager.\n\nKeep pushing and I with everyone sales success in the new year.\n\n**Update:** My company is a MAMAA company and we sell a software that every company uses and buys for each of their employees. I sell to the Enterprise segment.\n\nI also just checked our career website and we are not hiring for most regions, there are some international roles available but nothing in the US. For privacy purposes I won't get more specific than that but I'll try to answer other questions that people have.",
    "subreddit": "sales",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1686,
    "downs": 0,
    "created_utc": 1735590321.0,
    "media": null,
    "is_video": false,
    "num_comments": 597,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.32796567458333
  },
  {
    "score": 1638,
    "title": "I overheard two guys at the bar finalizing a deal..",
    "selftext": "\nI overheard a few old fellas at the bar doing business. This is, word for word, what I heard:\n\n\"Jim, I got 10 tons of 6061 aluminum sitting in my warehouse. $400 per ton.\"\n\n\"Bit steep.\"\n\n\"$385 if you take it all tomorrow. Includes loading. Paperwork's one page.\"\n\n\"Done. Cash on delivery?\"\n\n\"Yep. Been doing business this way for 30 years.\"\n\n*spits in palm, handshake*\n\n— end scene —\n\nI was shocked. Is it really that easy? For context, I come from B2B SaaS, where we say things like, *“Our revolutionary Al-powered cloud-native enterprise solution…”*\n\nI might be in the wrong industry?",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1638,
    "downs": 0,
    "created_utc": 1743284674.0,
    "media": null,
    "is_video": false,
    "num_comments": 297,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.179187085608627
  },
  {
    "score": 1580,
    "title": "It finally happened …",
    "selftext": "Been a long time lurker of this subreddit and have been trying to break into a legit sales role for years. I’ve been working 15-20 hour days driving Uber to barely crack $250… Before gas, taxes, and operating costs. It was a miserable and grueling grind that I was starting to see no end to. \n\nOne night I get an Uber request from a gentleman in a beautiful mansion in Bel Air Ca. He was having me deliver a package to a location 15 miles away, picking one up from the drop-off, and bringing it back to him. At the end of the ride he asked if I would be open to doing private airport and delivery rides for him. We exchanged numbers and I didn’t hear from him for 6 months or so. \n\nHe messages me one night asking if I could pick up his brother (business partner) from the airport late the next night. I accepted. He then messaged me the following day asking if I could pick up his mother from airport as well. No problem at all. \n\nI had already researched him and found out that he is the founder of a global manufacturing company. I message him that evening asking if he had any openings at his company. I told him I would just love the experience and I would bust my ass. He told me to come in the next day for an interview. \n\nWe sat and talked for 30 minutes; he asks me if I would be willing to come onto the company in business development and sales. He offered be a competitive base salary, a competitive commission structure and full benefits right there on the spot. That was a week ago today. Today was my first day.",
    "subreddit": "sales",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1580,
    "downs": 0,
    "created_utc": 1686623976.0,
    "media": null,
    "is_video": false,
    "num_comments": 193,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.085332734897322
  },
  {
    "score": 1504,
    "title": "Just closed my first 7 figure deal",
    "selftext": "I don’t have many people in my life I can share this with other than you guys so here goes.\n\nUntil now, I’ve mostly lurked this sub, but I am ecstatic to say that after a cycle that took 1 year, 4 months, and 4 days, I just closed my first 7 figure deal. $1.7 million dollars.\n\nLooking at about 122k commission pre-tax. Frankly it’s life changing money for me and I haven’t fully processed it. But boys…it feels pretty damn good.\n\n2 years ago, I was a BDR at a Vista SaaS company where I felt I had no impact and no autonomy. Fast forward to today and I am a bona fide Enterprise technology rep running full cycle deals like this one. While it’s still not what fulfills me in life, closing this today has renewed my belief that sticking it out in this game is well worth it.\n\nAMA.",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1504,
    "downs": 0,
    "created_utc": 1716510156.0,
    "media": null,
    "is_video": false,
    "num_comments": 300,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.144319747726784
  },
  {
    "score": 1395,
    "title": "Friendly reminder to dress to match who you are meeting. Not to “impress”",
    "selftext": "Just sent a rep home to change, a few weeks in the job and we have his first meetings this afternoon. He showed up this morning with Prada shoes, fancy suit, Gucci belt, Rolex dressed to the nines. “Dressed to impress” he stated. I told him he was going to look like an asshole because we are meeting with Midwest small farmers this afternoon, who likely have been up since 4am and will be likely in the same attire they started they day in, will be tired, and really doing us a favor by taking more time to meet with us. I told him we will likely be touring their setup walking through mud from the constant rain we had and shit in barns.\n\nYou can’t win a client by dressing to impressing, you win them by showing up and showing you’re down to earth and care about all the ins and outs of their business. For reference I wore nice-ish jeans, cowboy boots, and a dark polo. Also the kid wanted to take his Mercedes convertible and I told him no, we are taking my Ram 1500. \n\nHe also already had a plan of what to sell them, told him he needs to let the customer talk and we need to cater to his needs. Not ours. We have an idea of what they need from initial convos, and doesn’t matter we have a product paying us 2x on commission. Commission on a sale for a smaller product that fits is better than no sale on a product that pays us 2x. \n\nJust had to vent and share because I think this guy bullshitted his LinkedIn to the max and lied about his qualifications. Not sure why upper management insisted on hiring him. I got the impression right away from our first call he was not as good as he said. ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1395,
    "downs": 0,
    "created_utc": 1747933050.0,
    "media": null,
    "is_video": false,
    "num_comments": 196,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.027118531367939
  },
  {
    "score": 1371,
    "title": "Stop selling your life",
    "selftext": "\n\nI used to think the coolest thing possible was to climb the corporate ladder and make the most money possible. Man, I was ready to sell my soul when I got out of college. \n\nAfter almost a decade in sales I’ve realized there is nothing more lame than selling your time, personality, and energy to take the face of a corporation.\n\nI see someone ask everyday on this sub, “how can I make 200k+?” \n\nAnd look - making a metric shit ton of money is awesome. You can have an awesome life and an awesome paycheck.\n\nBut if you struggle to answer “what do you like to do outside of work?” you’ve completely missed the point of sales and all the BS we deal with in this profession. Please don’t sell the best years of your life. You have less time than you think. \n\nSit back, take a breath, go enjoy your money and have fun, be around the ones you care about. Then go close some deals. Repeat. ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1371,
    "downs": 0,
    "created_utc": 1730509849.0,
    "media": null,
    "is_video": false,
    "num_comments": 217,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.041582358173035
  },
  {
    "score": 1345,
    "title": "Stop flubbing the easiest cold call objection",
    "selftext": "The most common objection for cold calling?  ..... I'm Busy. \n\nSounds like many things at the start of the call -   \n\"I cant talk right now\"  \n\"Can you call me back?\"  \n\"Can you send me an email?\"  \n  \nOver and over I hear reps fumble it - bad.   \n  \n\"Sure when is best to call back\"  \n\"Sorry I'll send an email over\"   \n\"My bad!\"\n\nIt is the easiest objection to handle but I rarely see it done well. \n\nHere is the only response you need. \n\n\"I know I caught you cold, can I level with you briefly to see if it even makes to follow up in the first place? \" \n\nIt will move you forward 80% of the time. Keep in mind you will go into a short elevator pitch / current state question after this. \n\nGood luck and happy calling sales anons. ",
    "subreddit": "sales",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1345,
    "downs": 0,
    "created_utc": 1743601691.0,
    "media": null,
    "is_video": false,
    "num_comments": 174,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.970564084231105
  },
  {
    "score": 1310,
    "title": "My BDR died yesterday",
    "selftext": "My BDR died yesterday in a random, tragic accident. It shouldn’t have happened. He moved to my company a year ago to take a step back into a BDR role after being an AM at another tech company. He wanted to be an AE, and he eventually would have made it. He had a big family that he was close with, he was about to move across the country with his girlfriend that he was going to marry, he had a lot of good friends and everyone in the company really liked him. \n\nRemembering that work and sales isn’t everything. Thinking about my loved ones a lot today, and how short life is. I love you, Charlie! ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1310,
    "downs": 0,
    "created_utc": 1753827883.0,
    "media": null,
    "is_video": false,
    "num_comments": 152,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.944948407098884
  },
  {
    "score": 1239,
    "title": "Just closed my first million dollar deal",
    "selftext": "Posting this here because none of my friends work in sales, and I need to tell someone.\n\nI'm in my 20s and sell into financial services. I just got a signed contract sitting pretty at slightly over $1.6m. Total size of the account is likely to grow into $2-3m over the next few years.\n\nI went through hell to get here. From the SDR grind, constant dissapointment, missing targets, watching my peers succeed and do better than me while I felt worthless (with evidence and numbers to show how worthless I was). The only reason I haven't been fired was because I kept improving, slowly but steadily.\n\nThis deal itself took around 10 months, countless demos, several iterations of proposals, people joining and leaving the client's business, everything that could go wrong going wrong.\n\nNever. Give. Up.\n\nTonight to celebrate, I'll be watching \"Eyes Wide Shut\" on my laptop.\n\nHappy selling everyone!",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1239,
    "downs": 0,
    "created_utc": 1764864306.0,
    "media": null,
    "is_video": false,
    "num_comments": 264,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.040044622130639
  },
  {
    "score": 1200,
    "title": "First time hitting 100k and needed to tell someone. ",
    "selftext": "I just turned 27 two weeks ago, and my paycheck just hit, putting me over $100k! I don’t want to tell my friends because I don’t want to come off as gloating, but I wanted to share this accomplishment with someone.\n\nHitting $100k has always been a goal of mine. After growing up in lower middle class, I knew I wanted to be able to provide more for my family than what was provided to me. I dropped out of college and struggled hard at times, but I never settled.\n\nDon’t take the easy road—bet on yourself! It would have been easy for me to take a job at a factory and be content making $50k a year, but it’s worth it to push further!\n\nI’m grateful I did what was uncomfortable and started a career in sales. ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1200,
    "downs": 0,
    "created_utc": 1730339357.0,
    "media": null,
    "is_video": false,
    "num_comments": 229,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.995406925411703
  },
  {
    "score": 1200,
    "title": "My wife died and ever since I’ve been an anxious mess and can’t even pick up the phone ",
    "selftext": "My wife passed away this year and recently I came back to work from bereavement leave.we were together for 10 years. My wife was my rock, she was the reason I got up every morning and put in at least 100 dials a day, she’s the reason I made presidents club, and now she’s gone. \n\nI didn’t mind cold calling when she was alive, but ever since I got back to the job every time I try to dial my heart starts to race and I feel like I’m going to have panic attack. This has never happened to me in my 6 years of sales. I’m not sure what to do and at this point I just want to quit sales and pursue a less stressful career so I can just focus on recovering from her death. \n\nI don’t know what to do fellow sales pros, I could use a hand. ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1200,
    "downs": 0,
    "created_utc": 1713275249.0,
    "media": null,
    "is_video": false,
    "num_comments": 238,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.003741957876975
  },
  {
    "score": 1194,
    "title": "Cold call mess up might be my new script",
    "selftext": "Today I was not in the mood for cold calling, so I was shuffling through accounts and selecting the ones I was pretty confident they wouldn't pick up so I could at least show some activity for the day. \n\nWas going great until one I was 100% confident wouldn't pick up.... actually answered. Didn't even look at his title or the company info before calling. Here's how the call went:\n\nThem: Hello?  \nMe: Oh hey.... is this Joe?  \nJoe: Yes, who is this?  \nMe: This is \\_\\_\\_ with \\_\\_\\_\\_....... (awkward silence).... ummmm I'm going to be completely honest I was not expecting you to pick up and this is a cold call and I don't even know if you guys even work with people like us.   \nJoe: \\*actually laughs\\* ok well what do you guys do?   \nMe: \\*gives the schpeel\\*... is any of that relevant to you guys?   \nJoe: Actually yes, and we are about to start evaluating vendors. Can you send me an email with more info?\n\nIM SORRY WHAT\n\nJoe ended up looping 4 people into our email convo and sending over an NDA so we can have an official meeting. Joe is a homie. Joe is getting a massive discount if this works out. ",
    "subreddit": "sales",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1194,
    "downs": 0,
    "created_utc": 1741227186.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.828384574933546
  },
  {
    "score": 1193,
    "title": "My VP is Sleeping with my sales rep...advice?",
    "selftext": "We hired a new junior hybrid AE + lead gen rep (25F) from college 5 months ago\n\nSince then she's generated 0 qualified meetings or sales. \n\nIn the last 1 month she set up a meetung with me and a 'junior shopkeeper' of a retail account. Our target personas are supposed to be CFOs....\n\nShe has no exp and clearly isn't committed to learning as she ignores advice given to her by me and enablement manager. At times she will walk out of the room during call reviews and say I am \"being too much\".\n\nI've wanted her out of the org so we can get a more experienced rep. But my VP (45M) always defends her saying \"the economy is tough and we need to create a culture of cultivating. Not hire and fire\".\n\nThe other night, I saw my VP and new junior rep at a hotel bar. She had her legs cross his and the VP had his hands on her knees.\n\nIt lines up with rumours I heard about the VP buying tickets to an industry conference in Dubai where only him and the junior rep went to \"do some prospecting\".\n\nIs this a battle worth fighting or should i start looking for new jobs?",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1193,
    "downs": 0,
    "created_utc": 1747185356.0,
    "media": null,
    "is_video": false,
    "num_comments": 404,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.108231838400685
  },
  {
    "score": 1171,
    "title": "I fired my lead salesman today",
    "selftext": "Some may agree with me in this or not. However, when it comes to sales. Let’s just say, I’m tough and I want results, not excuses. I’ve got hookers to pay.\n  \nUnfortunately, this quarter we don’t have as much leads. Also, my lead salesman is going through a divorce. I asked him why, and he said one of his leads, turned out sour.  \n  \nI asked for more details during happy hour. Turns out, that this moron invited an executive of a big company to his home. They both got too drunk and that lead banged his wife. He started crying and said he was so ashamed.  \n  \n“But did you close the deal?” I asked. He said no. I slapped him.   \n  \nI then went and called his lead, went to his apartment, and had him bang my wife. I even gave the lead a “ZJ”. I closed the deal. 2000 custom branded duffle bags sold.  \n  \nSome people just don’t have what it takes to be a true salesman. ",
    "subreddit": "sales",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 1171,
    "downs": 0,
    "created_utc": 1715641921.0,
    "media": null,
    "is_video": false,
    "num_comments": 154,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.816593460767217
  },
  {
    "score": 1161,
    "title": "My VP of Sales used my small penis as an \"icebreaker\" for an intro call for a large oppurtunity",
    "selftext": "Sr. Enterprise AE at a tech startup. Have been trying to get a foot in the door with a prospect who's a picture-perfect ICP, their contract with another vendor was up for renewal, and potentially a deal north of 2 million that's very feasible within two quarters.\n\nFinally scheduled an intro call with our prospect, told my VP (mistake #1). He insisted on joining.\n\n2 minutes into the call he cracks a joke about my small penis which I'm already very insecure about. Something akin to \"Before we dive into the details, I just have to say, I didn't realize we'd be bringing in the company's baby carrot today. I mean just look at that shine... must be a sign of good things to cum!\" Yes, he was referencing my small penis.\n\nNever in my sales career have I heard something like this, let alone from a boss. Call ended up being awful and that legitimately could cost me tons of commissions... also, he's a total boomer so I know he doesn't go on Reddit...",
    "subreddit": "sales",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 1161,
    "downs": 0,
    "created_utc": 1725728616.0,
    "media": null,
    "is_video": false,
    "num_comments": 160,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.866119066070237
  },
  {
    "score": 1027,
    "title": "Well. I fucking did it.",
    "selftext": "Took a job as a door to door rep about 6 months ago because I couldn’t get any interest in my resume for B2B SaaS. \n\nPlenty of people on here saying “you’re going to hate d2d, blah blah blah, you’ll be back in 3 months begging to get out of it”.  It was actually a pretty good experience. Learned a lot about sales and myself. \n\nAnd now, here we are. Just received a call from a B2B SaaS startup (series B) that they’ll be sending an offer letter in the next hour. I made it, boys. Started from the bottom and, while I’m still here, at least the ceiling isn’t also the floor. \n\nAt the end of the day I know nobody cares, but hey. I made it into tech sales and I’m pretty fucking happy about it. \n\nEnd rant. ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1027,
    "downs": 0,
    "created_utc": 1756936923.0,
    "media": null,
    "is_video": false,
    "num_comments": 145,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.829169542551476
  },
  {
    "score": 1017,
    "title": "VP made me sit through 6 hours of 'consultative selling' training. Client hung up on me using their exact script",
    "selftext": "Company brought in some $15k consultant to teach us \"modern selling techniques.\" Spent my entire Tuesday in a conference room learning about \"discovery frameworks\" and \"value-based conversations.\"\n\nHad a call yesterday with a warm lead. Decided to try their fancy discovery questions. \"What's keeping you up at night regarding your current solution?\"\n\nDude literally laughed and said \"Are you reading from a script?\" then hung up.\n\nMeanwhile my desk neighbor who skipped the training (sick day) closed two deals this week just talking to people like a normal human being.\n\nI've been selling for 4 years. I know how to have conversations. But now I'm second-guessing everything because apparently my natural approach is \"outdated.\"\n\nAnyone else feel like sales training makes you worse at selling? Like the more they try to systematize it the more robotic you sound?",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1017,
    "downs": 0,
    "created_utc": 1754699979.0,
    "media": null,
    "is_video": false,
    "num_comments": 325,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.99935657803471
  },
  {
    "score": 955,
    "title": "Update: Closed a mega deal and quit my job. 5 days in; I couldn't be happier!",
    "selftext": "\nFor those who caught my last post, I managed to close a £5m ACV deal recently. (15m TCV)\n\nI was bracing for some typical commission complications that people warned me of here, but to my surprise, my company paid up without any fuss. They even included the SPIFFs and most of the accelerators. It wasnt even a topic I had to bring up.\n\nAfter taxes, I found myself staring at £500k in my bank account. I spent a whole day just looking at it, making sure it was real. With that confirmation, I went back to work planning to keep things quiet.\n\nBut then, some office politics escalated, and my boss ended up getting laid off. I took that as my cue to exit as well, and now I'm officially on garden leave.\n\nI couldn't be happier. My plan is to pay off my mortgage, build an annex to my house this summer, and spend loads of quality time with my daughter.\n\nHonestly, I just couldn't see myself going back to deliver three months of \"lunch and learn\" sessions for a deal that felt more like a stroke of luck than anything.\n",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 955,
    "downs": 0,
    "created_utc": 1715161007.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.780624776523603
  },
  {
    "score": 953,
    "title": "Just had $350k offer letter rescinded, feel like a fool",
    "selftext": "Some of you may have been following my previous posts about the lucrative startup opportunity that came my way recently. \n\nLast week I signed a $350k offer letter with them, with a start date next week. \n\nPart of my agreement was to try and get my current company onboarded as a customer because they're a great fit. I assisted in getting a demo scheduled &amp; following up during the process.\n\nLast night the CEO, who I report to, called and wanted to discuss transition strategy. He had expressed multiple times that he didn't want to upset my current employer, and even suggested letting them continue to use me/share me with them, or working part time, something like that to stay amicable. \n\nDuring our conversation he decided that he wanted me to make a clean break because he wanted to be as ethical as possible and not do anything that would bite him in the ass. I agreed, and was supposed to give my notice today. \n\nThis morning he texts me then calls me and says wait, actually, they're serious about becoming a customer, and it would be a huge deal, so let's not say anything yet until the deal is closed. I asked if he was sure, because I respected that he wanted me to do things honestly last night, and he said yeah, let's not risk it. Okay, sure.\n\nAn hour and a half later he calls me and says we're rescinding your offer because you're trying to take two salaries. I never at any point said that's what I was trying to do. The entire time I was walking on eggshells trying to satisfy my new job without risking my current one. I was willing to put in my notice, and only agreed with him this morning because that's what he thought was best. He said nope, no more offer. Then he hung up AND BLOCKED MY NUMBER!!!\n\nOne, huge bullet dodged, because if he's this rash &amp; impulsive then it was only a matter of time before he found another reason to fire me without any real reason.\n\nTwo, lesson learned, I will never ever ever do anything to help with a deal before I've joined and have gotten my first paycheck. To me this seemed like an elaborate scheme to get my current employer as a customer and use me as a gullible rube. \n\nLicking my wounds and moving forward. Any advice, suggestions, and/or ridicule is welcome. One of the employment lawyers I spoke to said this was the craziest thing she had heard in her 34 years of practicing employment law. ",
    "subreddit": "sales",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 953,
    "downs": 0,
    "created_utc": 1713908007.0,
    "media": null,
    "is_video": false,
    "num_comments": 405,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.003811391492692
  },
  {
    "score": 948,
    "title": "CEO sent me an email, I’m cooked",
    "selftext": "So I’ve been working in this company for 4 months, I’ve been top 10 performer as a closer for them making close to $1M of Rev every month.\n\nUnfortunately since this is B2C, there is also a Customer Service side of the job that I failed miserably by being too busy and not answering the calls of one Customer I closed.\n\nShe ended up leaving a 1 star review on our Website, literally has my name on it, CEO found it, put me in a group with all the Managers and said sort it out by today.\n\nSo am I cooked?\n\nEdit: \nSo turns out I’m an idiot, it ended up being 2 people that had complaints both of which my Manager saved, review got fixed, he said he will review the calls I had.\n\nI’m confusing the client, not following up properly and had a bad streak of tough clients that tipped the bucket over.\n\nLesson learned, pick your battles.",
    "subreddit": "sales",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 948,
    "downs": 0,
    "created_utc": 1744297100.0,
    "media": null,
    "is_video": false,
    "num_comments": 474,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.020613017239726
  },
  {
    "score": 942,
    "title": "Zero alcohol beers changed the game for me",
    "selftext": "Hey all,\n\nI’m sharing something which has changed my sales game and also changed my life. I’m sitting here on a Sunday morning with a clear head, life is in order and job is going really well.\n\nI’m in b2b sales, professional services. Been in the space for coming up on 8 years. Across these roles I’ve drank wine, beer, taken shots with customers, drank cocktails and ate a shit ton of company-paid-for food. I’m now back in a head of sales role where I carry quota. It’s field sales with a minimum of 5 lunches/dinners a week and mostly in alcohol-fueled environments. I do events 8 times a month too and it was common for me to get to Friday having had around ~15 beers that week already, before any kind of weekend socializing.\n\nI was overweight from the unhealthy nature of the job. I really didn’t want to be hungover from work, not able to focus and being forced to drink by the etiquette of the job. I was also worried that I’d feel pressure to drink, that it wasn’t possible to do this job without having alcohol, people wouldn’t trust me etc. So much head trash.\n\nI decided I wouldn’t let this job and alcohol take over my life again. I decided to turn it into a positive impact on my life.\n\nI posted in this sub and got some good tips. I decided I would still buy drinks for clients, buy them food etc but I would just do zero alcohol beers: Heineken zero, Guinness zero or whatever they have in the bar. When it comes to food, to keep it healthy-ish I always go to a steak place and I just get a really good steak like a ribeye and have that with veg. When it’s 1-1 with a prospect I sense they can be a little uncomfortable I’m just drinking zero alcohol beers but in a group it’s fine, I let the pre-sales guys get wasted and everyone is happy.\n\nThe end result is that I’m closing more business, I’ve lost 11kg (23lbs) from alcohol calories and drunk food, I feel better, I look better, I’m having better quality and deeper relationships with my prospects, the pre-sales guys love it and the customer trusts me more because I’m seen as the responsible adult at the table. I was really concerned about it initially, but the zero alcohol beers have changed my life for the better. Do whatever suits you but if you’re stuck in a role where you feel you have to drink, this is a potential alternative.",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 942,
    "downs": 0,
    "created_utc": 1708271190.0,
    "media": null,
    "is_video": false,
    "num_comments": 133,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.765564091919733
  },
  {
    "score": 921,
    "title": "20+ years, average sales rep",
    "selftext": "Everyone wants to be a presidents club member. \n\nI see a lot of folks making similar claims in this group about being top performers in their sales rolls. \n\nI congratulate you folks. \n\nI’ll say something sightly different. \n\nI’ve been in sales for over 20 years and I’m an average sales rep, at best. \n\nI don’t make a ton of money. \n\nI’m not particularly excited about what I sell. \n\nI don’t even know if I really enjoy what I do. \n\nWhat I do know is I’ve met some pretty cool people in my time, both customers and coworkers. \n\nI’ve helped train sales people who went on to become significantly better at sales than I am and make way more money than I do. \n\nI’ve learned a ton about many different industries.\n \nSales can be insanely lucrative and it can suck in a lot of major ways. \n\nIf you’re new to sales, do yourself a favor and learn as much as you can about sales, sales cycles, your market, communications, human behavior, money, etc.. \n\nNo real point to this post other than I wanted to put a little out there about sales that’s grounded and not the typical hype. \n\nNot everyone can be a top sales rep. \n\nSimilarly not everyone is a top performing athlete. \n\nPlenty of room for us average folks to be in here and make a little more money than the typical job. \n\nBe cool to everyone you speak with and you might end up doing better than you expect. \n\n☎️=💰",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 921,
    "downs": 0,
    "created_utc": 1702418937.0,
    "media": null,
    "is_video": false,
    "num_comments": 183,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.832139832558398
  },
  {
    "score": 912,
    "title": "Closed the biggest deal of my life. ",
    "selftext": "Kind of bragging a little bit into the void, nobody in my family or friends really gets it. I’ve been working an IT security staffing RFP for the better part of a year and just got the email from the client that we’ve been down selected as the winner. 3 year deal, 30-50+ resources  per year. Just about $15M in production and $3.5M in GP. \n\nEnd of the day, I’m back on the grind tomorrow but this one feels really fing good to take down. High Five! \n",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 912,
    "downs": 0,
    "created_utc": 1714085507.0,
    "media": null,
    "is_video": false,
    "num_comments": 169,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8106952382234365
  },
  {
    "score": 903,
    "title": "Tech Sales Employees Amaze Me",
    "selftext": "I don't know how common this is and this may come off as bitter but how in the world are some of these people making 200K+ a year but they barely understand how to use a computer, how to operate software, how to troubleshoot anything tech wise. I sit here watching someone who's making close to $300K in tech sales and its like watching a 70 year old operate a computer.  Do they just hop on calls, talk shit for an hour and close a deal by following a script?",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 903,
    "downs": 0,
    "created_utc": 1740151399.0,
    "media": null,
    "is_video": false,
    "num_comments": 326,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.940942306805506
  },
  {
    "score": 893,
    "title": "The Day I sold 7 cars",
    "selftext": "This is story time\n\nYears ago (like over a decade now) I came into my dealership a little early. I was there at 8:15, we opened at 9. I had an appt at 8:30. My appt was pretty much primed and ready, he was driving. So it wasn't hard, I find it real nice when you can start your day off with an easy deal.\n\nThat appt was driving by 9:15 am.\n\nBy 9:05 I had taken my first up of the day..\n\nBy 1030 he was closed...first two deals in the dealership were mine.\n\nI had an 11:30 apt next so I went and grabbed some lunch, it was going be a busy day. I never actually made it to lunch by the way. Because I ran across another up. By the time 1130 comes around she's almost done and bought and my apt is almost here. She gets done by 1145. I'm at a hat trick before lunch, haven't even had lunch yet. I start working my appointment.\n\nMy appt was a challenge. I remember not being done with them until about 2pm. But they also bought. For the next 30 minutes I sat at my desk...pleased with myself...I had already done 4 deals. I was hungry too, still hadn't had lunch.\n\nThen I get a call, a guy saw a f150 and he likes it. Confirms price on the phone with me. Explains he's coming down to write us a check as long as we don't play any games he's buying. We had a $500 doc fee. I failed to mentioned that on the phone. I had never sold 5 cars in a day. I got my Mgr to approval a $500 discount, this way when the client came in...the price would be what I said it was. Client comes in and asks me \"is the truck available at xyz price\" I say yes. I show him the truck. He loves it. Writes a check for it. 5th deal done it's now 4:30. I'm tired. I'm thinking about going home. This deal was a lay down too.\n\nAt 5 I pick up a dual car deal. At 8pm I finally close it. Both deals done. Holy fuck I did 7 deals in a day. I'm exhausted. I'm hungry, still haven't had lunch...I did grab a few cookies throughout the day though.\n\nMy GM is at another store but he calls me up and goes \"Zac did you close 7 deals\" I go yup. He goes \"Great go to a bar of your choice send me the address your tab is my tab tonight\"\n\nHe drove over an hr to come drink and celebrate with me. I had lunch and drinks :)\n\nAh\n\nGood times\n\nI never sold 7 cars again in a day. My next best day was 6. It was a perfect storm. I made about 9k that day.",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 893,
    "downs": 0,
    "created_utc": 1726681397.0,
    "media": null,
    "is_video": false,
    "num_comments": 107,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.703049396539393
  },
  {
    "score": 873,
    "title": "My most bullshit sales trick that will increase your cold calling hit rate (Real)",
    "selftext": "Pretend you’re a cold calling dinosaur. \n\nI’m not joking, every time you dial pretend you have little arms to punch the numbers. \n\nSomeone hangs up? Who cares? If it was in person you could have ate them. \n\nYou have a good call and book a meeting? Let our a rawr because you just got some “food” on your “hunt” \n\n\nActual science: This is a weird example of cognitive reframing which is a core exercise in most therapy.  \n\nEssentially you are separating yourself from the rejection and helping develop coping mechanisms (you’re a dinosaur). I have taught a version of this in a few sales classes internally. Generally I encourage people to be a robot, a pirate, a dinosaur whatever they want as long as they are able to properly separate themselves a bit from the rejection. It helps a lot with the “grind.” \n\nSome people are able to separate themselves without this exercise but not everyone, that’s where this helps. \n\nBut don’t talk like a dinosaur on the call…",
    "subreddit": "sales",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 873,
    "downs": 0,
    "created_utc": 1740619074.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.660430044986989
  },
  {
    "score": 851,
    "title": "Just closed the biggest deal of my career and it was all thanks to drilling objection handling.",
    "selftext": "Context - work in tech. A couple weeks ago I was On the phone with a CIO of a F500 Bank selling him an 800k ARR cloud infrastructure software deal.\n\nI asked him my closing question as directed by my sales script and to my surprise, he said \"hmmmm, i'm not sure, I need to check with my wife\"\n\nI looked at the spouse objection handling response in the script and it said to say \"HAHAHHAHA come on George I thought you were the MAN of the house? Do you really need your WIFE's permission to make a decision?\"\n\nSo i said that and The CIO laughed and said \"you're SO right Adamaria1994. Please send the DocuSign,\"\n\nI sent him the DocuSign for 800k ARR and he signed it right then and there on the phone! As he signed it he said \"i'm the man of the house thank you for reminding me how could i forget!\"\n\nBy the way I was also doing this live in our office while 40 other people in our sales org watched intently like the scene in wolf of wall street! When I hung up the phone everyone cheered and clapped and my CEO promoted to VP of Sales right on the spot! And as a result of this deal we got more funding for our 20m series B!!\n\nMoral of the story is follow your script, listen to the LinkedIn influencers and dont let the spouse objection get in the way of your sales commissions!!",
    "subreddit": "sales",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 851,
    "downs": 0,
    "created_utc": 1747607386.0,
    "media": null,
    "is_video": false,
    "num_comments": 182,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.729165139631915
  },
  {
    "score": 809,
    "title": "Who else feels like they are using cheats in life?",
    "selftext": "I do tech sales and have my own business and make $100k doing like nothing compared to my hard working friends and family. \n\nThey have “real jobs” and boy are they always so busy and tired. Meanwhile I’m waking up in a toasty bed beside my cat, crack open my laptop and start working in bed. \n\nThe people in my company all went to prestigious schools and here I am a drop out pothead making just as much. \n\nYa it’s great to have money but nothing feels fulfilling about this. I feel like I keep buying shit to fill a hole that is suppose to be my passion/career. \n\nSales is a means to an end but it does not fill the soul…..\n\nEdit: The people asking me questions about how to break into sales in my PM’s is giving me purpose. Keep asking. I can’t get you hired but I can steer you in the right direction and would love to stay posted on your sales journey. ",
    "subreddit": "sales",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 809,
    "downs": 0,
    "created_utc": 1702691078.0,
    "media": null,
    "is_video": false,
    "num_comments": 512,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.953543701434558
  },
  {
    "score": 790,
    "title": "Be me. Sales manager.",
    "selftext": "Be me. AE.\n\nHate cold calling. Want more $$ less work. \n\nLight bulb.\n\nGet to mgmt. no more cold calling. Just close deals. Make other people call for me.\n\nInitiate plan. \n\nCold call enough to get good. Build pipeline. Close deals. Start coaching sales team without them asking. \n\nBrag about my accomplishments incessantly on teams chat. “Look what I did , you can do it to” \n\nBoss recognizes my abilities. Sees me bragging in front of sales team. Sees me giving unwanted advice. Leadership101.pdf\n\nBoss light bulb go off. Need sales manager, whip sales team in shape. Now boss have to do less work managing team. now more free time to look at secretary ass. \n\n\nBe me. Sales manager. No more cold call.",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 790,
    "downs": 0,
    "created_utc": 1690493626.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.584721476993648
  },
  {
    "score": 766,
    "title": "HEY GONG REPS NOBODY CARES ABOUT YOUR PROCESS",
    "selftext": "So tired of seeing LinkedIn influencer tech bro AE's that have to tell you about how they plan their calendar. So incredibly cringe. Just run your demos man nobody cares (except me, I care enough to complain on a public forum). Sorry guys, just a little Friday frustration. I feel like every time I open LinkedIn I see these guys acting they cracked the code of SaaS cause they time blocked some emails and sent somebody a gift card. ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 766,
    "downs": 0,
    "created_utc": 1741370860.0,
    "media": null,
    "is_video": false,
    "num_comments": 269,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.835477246028475
  },
  {
    "score": 758,
    "title": "END. THE. MEETING. ON. TIME. ",
    "selftext": "You windbag. You buffoon. You cretin. The team meeting should have ended at the top of the hour. We are half an hour over. You had NOTHING important to add. And now you’ve started a windbag feeding frenzy. The two other obnoxious baby birds felt like they weren’t fed enough and now they have to chime in.\n\nNo one is impressed with you. No one thinks you are a “dedicated” “hard worker”. The word salad you just vomited onto us only proved how incompetent you really are. You aren’t fooling anybody. \n\nShut up. Shut the fuck up. I want to eat my lunch. I want to call my customers. I want to do something that’s actually productive. I want to do something that will make me money. I want to do my job. \n\nPlease look up the work “Laconic” and think on it. Reflect on it. \n\nNO. I see you taking a deep breath like you want to say something! Shut the fuck up and quietly reflect on this by yourself.\n\nWe’re not laughing with you about your “personality quirk”. “Tee hee! I’m such a chatterbox! You know me!”. I loathe you.\n",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 758,
    "downs": 0,
    "created_utc": 1712338338.0,
    "media": null,
    "is_video": false,
    "num_comments": 145,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.689918203787698
  },
  {
    "score": 764,
    "title": "The Hardest Lesson I Learned After Burning Out in Sales",
    "selftext": "\nI'll never forget the day I almost quit sales altogether.\nI was sitting in my home office at 11 PM, staring at my screen, surrounded by endless Automation tech. \nFor months, I'd been working 12-hour days, sending hundreds of cold emails, obsessing over metrics, and trying every \"revolutionary\" sales tool that promised to 10x my results. \nMy tech stack looked like a who's who of sales automation.\nI was doing everything the \"experts\" preached. \nBut my results? Painfully average. \nEach automated sequence, each perfectly crafted template, each \"personalization at scale\" trick... they all started blending together into a soul-crushing routine.\n\nThen something happened that changed everything.\n\nLate one night, exhausted and frustrated, I accidentally sent an unfinished email to a prospect. \nNo pitch. No fancy formatting. Just a raw, honest message about how I'd been researching their company, understood their challenge, and thought I could help.\nI panicked. This wasn't supposed to go out yet. It wasn't \"optimized.\"\n\nBut here's the crazy part: They responded within 10 minutes. At 11 PM.\n\n\"Finally,\" they wrote, \"someone who actually gets it. Let's talk tomorrow.\"\n\nThat mistake taught me what every sales \"guru\" gets wrong: It's not about selling better. It's about connecting better.\n\nSo I did something terrifying. I dropped most of my automation. \nInstead, I focused on:\n-Actually researching every prospect before reaching out (not just mail-merging their company name)\n-Writing emails that felt like they came from a human, not a bot\n-Listening more than pitching\n-Treating each conversation as unique, not just another ticket in the pipeline\n\nThe results? My response rates tripled. But more importantly, I started enjoying my work again. The conversations became real. The relationships became genuine.\n\nHere's the truth: \nPeople don't want to be sold to. They want to be seen, understood, and valued. They can smell automation and fake personalization from a mile away.\n\nSometimes the hardest lessons are the simplest ones. And sometimes your biggest breakthrough comes from a mistake that shows you what was missing all along: genuine human connection.\n\n\nSo guys what are your thoughts on this?",
    "subreddit": "sales",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 764,
    "downs": 0,
    "created_utc": 1736759921.0,
    "media": null,
    "is_video": false,
    "num_comments": 194,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.733678740834876
  },
  {
    "score": 754,
    "title": "About to lose the biggest deal of my career (so far). $100k commission. ",
    "selftext": "Saw the earlier post about someone losing out on a $60k commission deal. I’m also about to lose a huge deal. Biggest of my career so far. Almost a year of intense work. Travel, dinners, workshops, etc. \n\nIt’s not final but 99% it’s not us. \n\nAnd I’ve learned some seriously invaluable lessons. \n\nThe biggest one being…it doesn’t matter how big of a champion you have, if they don’t have power it doesn’t mean shit. \n\nI focused way too much time on the “manager” and “user” of the software. Built an incredible relationship there. \n\nThey want us. \n\nThey’ve told the VP they want us. \n\nMy competition on the other hand immediately went high. Straight to the VP. And spent all their time there. \n\nNow don’t get me wrong. I’ve tried to build a relationship with the VP. \n\nBut I just didn’t focus on it earlier enough or hard enough. \n\nAnd now I’m about to take a huge c-suite exposure level L. \n\nSales is not for the weak. ",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 754,
    "downs": 0,
    "created_utc": 1709174895.0,
    "media": null,
    "is_video": false,
    "num_comments": 161,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.710204458900504
  },
  {
    "score": 752,
    "title": "My top level take aways after having listened to 100 sales call",
    "selftext": "I finished up a month long project of listening to 100 sales calls to understand what made the top performers so much better than the average and bottom performers.\n\nI kept a \"score sheet\" of each call that had a total of 30 \"check lists\" things to listen for.  I listened for things like rapport, types of questions, DM landscape, pricing strategy, closing ability, up front contracts, trial closes, open vs closed ended questions and on and on.\n\n**EDIT TO ADD: This is a sales floor of 26 sales people selling B2B SaaS. Average deal size is $32k in first year revenue and requires a contract.  Average contract length 19 months (meaning we sell 1 and 2 year and that is the average).**  \n\nBelow are my key findings and boy were they eye opening.\n\nThe main point take away would be this - the quality of the lead is way more important than anything else.  The top sales people don't do anything special; it's more what they don't do that is the difference.  They keep it simple and just ask \"would you like paper or plastic\"\n\n* Rapport - The top sales people have almost zero rapport.  Nothing about personal, nothing about business, just nothing.  They jump right into everything without the pleasantries.\n* Discovery - The top sales people are asking less than 5 questions in discovery and it certainly isn't SPIN or Challenger or Gap.  - No \"knock on effect\" questions or anything.   It's just a couple of basic \"are you qualified\" questions.  And I don't even mean around BANT or MEDDIC - literally just \"what's your credit score\" level qualifying question.\n* Demonstration - The top sales people are doing, what can only be described as, feature dumping.  It's is just a quick rant on all the top features.  There is no tailored benefit statement, need payoff or anything.  It's literally just \"here is feature x and it does this.  Here is feature y and it does this\"\n* Decision makers - Either they are there or they aren't and there is nothing the top sales people are doing to ask for them.  Sometimes they are booked in with the DM from marketing, sometimes the influencer brings them on a later call.  Sometimes they don't show up at all.  The top sales people aren't ever talking about them and just going in a straight line, repeating the same process each time.  There is a small difference in win rates when they are there vs when they aren't but not enough that we need to focus on it.\n* Closing - The closest I've heard to asking for the business in the 100 calls was \"what are your thoughts\".  There is no actual request for the business.\n* Objection handling - the deals that close, just don't seem to have them.  the customer is already basically sold so the questions are more around \"how does this work\" and not objections.  If there was an objection it would be met with something like \"yeah, I hear what you are saying and this may not be the best solution for that\".  There is brilliance in this answer to some degree.\n* Follow up - No evidence of it.  The quote is sent to the customer and sometimes they email back and sometimes they don't.\n\nSo?  What did I see that made these sales?\n\n* Great leads from the get go.  These customers were perfect fits and were in market.  Either having been past customers, referrals or working with an inferior competitor that we could beat on product and price. Some were from marketing but most were prospected by the sales team.  The people relying on marketing were the bottom performers.\n* Top sales people just took them through the process and showed them everything.  Bottom sales people RAN a process.  By that, I mean they asked very salesy questions like \"why is that important to you\" or \"what happens if you don't do x\" or \"is there anyone on your side that would feel left out if they didn't have input on this?\".  If a need payoff question was asked that deal was almost always moved to closed lost.  People hate these and it puts them in a defensive position.\n* Tone.  Everything came down to tone.  It wasn't what people were doing, it was the people doing it.  It wasn't the questions that annoyed people, it was the way the sales person asked it.  Top sales people come off as nice, polite and enthusiastic.  Average or below sales people just didn't. The late night DJ voice may be great for hostages, but will a death sentence in SaaS.\n* Price - top sales people always opened with a very very low price.  They didn't try to max out each deal, they just gave the best price they could.\n* Top sales people treated every person like they were the decision maker.  They empowered them during the process and, if that person reached the end of their line, they would offer to care the deal to the next person, they never had to be asked to.\n\nSales is a WAY less complicated than we make it.\n\n* Get the best leads in your pipeline.  If you aren't given them, go prospect to them.\n* Don't make it hard for people to buy.  Just show them what you have.\n* Discovery is wildly overrated.  Not that it isn't important it's just that, unless you've mastered it, you're better off keeping it simple rather than trying to master it on the call with a customer in real time.  Save that shit for off the phones.\n* How you sound is the biggest differentiator for sales success.  Some people have awesome voices some don't.  If you are outside sales then it's probably how you look more than sound.\n\nAnyway, that's my observation and I hope it helps people simplify the process down.\n\nTLDR; Gong might be full of shit.",
    "subreddit": "sales",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 752,
    "downs": 0,
    "created_utc": 1685368904.0,
    "media": null,
    "is_video": false,
    "num_comments": 281,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8144195303603805
  },
  {
    "score": 755,
    "title": "Called the lead (correct term) who said he had died (update)",
    "selftext": "So a few things I just want to get out of the way.\n\n* I work B2C\n* This lead and I spent a lot of time talking, this was not a random cold call\n* Been in sales a long time, have my share of dead family members stories like we all do\n* This felt unique because I was confident that the lead himself told me he had died.\n* I'm not going do anything to circumvent a leads attempts at blocking or ignoring my calls.\n* This was a lead, not a client, I used the wrong term in my previous post\n\nSo the call\n\nI called, his wife answered. I told her I had heard her husband passed away.\n\nIt's true, he did pass away single car accident, on his way to work. She was distraught and it was a hard call.\n\nI told her I really enjoyed working with her husband, and thought he was a wonderful man. Offered my condolences.  I offered to send flowers to the funeral home. She accepted the offer. I sent flowers.\n\nI then asked her if she'd like me to DNC her so she doesn't get calls from us anymore. She declined and asked me to call back in a few weeks and go over what I talked to her husband about. I said I'll do that.\n\nI think the biggest take away I'm walking away is with the reminder that tomorrow isn't promised. Tell your loved ones you love them.\n\nAnd yea I guess his brother and my client sound identical",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 755,
    "downs": 0,
    "created_utc": 1708707202.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4681597303016005
  },
  {
    "score": 747,
    "title": "I got laid off and ended up at a legit unicorn",
    "selftext": "I was a Sr. Sales Manager at an early stage startup and got laid off. It was rough, because I was the founding AE, and built up the entire sales process which enabled the company to more than double YoY ARR over the next 4 years.\n\nWell due to multiple bad decisions by our C-level (as well as them making very lofty promises to our investors), we missed 2 quarters in a row and got denied our Series A. This of course caused the company to lay people off. Myself along with 80% of my sales team and the entire Marketing department got the boot.\n\nI started applying to tons of open positions on Linkedin and got nothing, so a few people on here recommended I use any professional connections I made in my role, and I decided to do just that. I worked with the CRO at my current company on a few projects previously, so I messaged him on Linkedin and told him the situation. He immediately got me into a rapid-fire interview with 4 members of senior leadership the very next day and I had a job offer the day after that.\n\nThis company is also an earlyish stage startup. (They have a $120m Series B) However... they have an amazing product with EXCELLENT market fit, the product has extremely positive customer sentiment, they are already very profitable, and even in this market they are set to double YoY revenue growth. All signs point to this being an actual unicorn SaaS start up.\n\nWhen I got laid off, I was borderline depressed. But somehow, it ended up being the best thing to ever happen to me. Moral of the story, when looking for jobs don't be afraid to use your connections and DEFINITELY don't be afraid to tell people why you got laid off. I was in the mindset that it was viewed the same as actually being fired. It's not.",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 747,
    "downs": 0,
    "created_utc": 1717596557.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.581142933939546
  },
  {
    "score": 736,
    "title": "Can't. Do. Sales. Any more. Don't know how to do anything else.",
    "selftext": "In Tech Sales for 15 years. In Tech CONSULTING sales for 5 years. What a shit show. \n\nUnfortunately I have a personality of a trust fund baby, so whenever things get weird I just quit. And then I remember I don't actually have a trust fund and I get another job. \n\nI'm certified freaking everything - Salesforce, Workday, Success factors, GCP, Azure, AWS, Blockchain, QUANTUM COMPUTING, except I don't actually know how to do any of those things to get a job. \n\nI can't even interview for sales jobs anymore. Been trying to do my own thing BUT I DON'T WANT TO DO SALES ANYMORE. I'm so done.\n\nI want to marry a rich guy and write stories and bake pies and grow flowers, EXCEPT I've been in tech sales for 15 years so my personality is shit. I am still KINDA pretty but not \"marry a rich guy pretty\". \n\nThat's it. No moral to the story. This didn't teach me anything about B2B sales. \n\nAlso, I'm running out of money and I need to come up with something like 3 months ago. \n\nSend help? \n\nEDIT: A few of you send me your affiliate link so fck it, send me all your affiliate shit, my last YouTube video got 14 views, so ANY DAY NOW Imma have that media empire. I also got 6 likes on LinkedIn once. Try not to feel starstruck. \n\nSeriously though, if anyone knows of any job that's not sales and I get to keep my clothes on, please reach out \n\n",
    "subreddit": "sales",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 736,
    "downs": 0,
    "created_utc": 1740116456.0,
    "media": null,
    "is_video": false,
    "num_comments": 369,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.864068349892548
  },
  {
    "score": 692,
    "title": "Do this and make more money in sales. ",
    "selftext": "Had a much longer list but I wanted to keep it short and sweet since I know we all have the attention of a 10-second tiktok video these days so I reduced it down to these major common mistakes I see happening that seperates your \"average\" salespeople different from the elites. Elites, top performers and those who've mastered their craft look at it like art and have a completey different approach that's almost the complete opposite of what you were taught. (In other words you could be leaving a SHIT ton of MONEY on the table because of these...)\n\n1. Assuming Too Early is Killing Your Sales - Jumping the gun without building trust is costing you. We've all heard the analogy if you go on the first date are you going to ask the person to marry you? So why do we still do it? Many people assume the sale too early, especially in the first few minutes when there's not even enough trust or credibility. It actually does the opposite when you think about it. It can even trigger prospects to run the other way. Nobody likes feeling pressured. If anything, a push back actually can be more effective than assuming too early.\n\n\n2. The \"Logical\" approach - aka old school consultative selling involves asking logical based questions to find out their needs, its very surface-level answers. Do better. Prospects make decisions based on emotion, not logic, making this old school approach is less effective and personally I think it's very outdated. Look around you almost everything is controlled by emotions. We see it happening in the news and all the other sorts of decisions and acts of violence.\n\n\n3. The Two \"P\"s (Pressuring Prospect) - Pressuring people to force them rarely works and yet why are 90% of sales people STILL doing it?! such an old school technique and If you know anything about psychology it goes against this. Change is less effective than getting them to feel internal tension and realize they need to change themselves. Make them feel the need to change internally, it's a the better approach. You can use consequence questions for that. Think about how you would react if someone pressured you.\n\n\n4. The Hard-Selling Loser - Jamming your products in their throat? Ew brotha what's thaaaat. In other words, stop pushing products. Who's to say they might even need it?? Start solving problems. Become a problem finder and a problem solver and you're guaranteed to make more money than than you've possibly imagined. Don't take my word for it look at every successful business or how every top performer operates. They're not focused on \"selling\" the product they're focused on \"solving\" the problem.\n\n\n5. Silent O' Clock - When you pause and remain silent after making statements or asking a question, it creates a space that encourages them to fill it with their thoughts or concerns.. Those pauses actually disarm the prospect to reduce sales resistance. Like you're not just some other \"sales guy\". You'll find they open up more. I can't explain how important this is. Pay attention on when to use those pauses.\n\n\n6. \"Winging it\" Presentation - Many rookie salespeople or pretty much your average sales person wing their presentations and hope for the best. we've all been guilty at this at some point. Most of the time it sucks because it lacks structure and preparation. Keep your presentation short and sweet while covering their logic and emotional aspect. If you can somehow get them to visualize future pacing even better. But ALWAYS keeps it short and to the point. I say this because what I see happening is most people end up rambling and giving unnecessary information and overwhelm their prospect. (Hence why you get the 'let me get back to you\" as opposed to \"can I sign up today?\")\n\n\n9. The \"me, me, me\" syndrome - Most people spend too much time talking about their company, their product/service or their story. I say this respectfully....nobody gives a shit. Prospects care more about their own story and how the product/service can solve their problems. We all have a little bit of narcissistic in us some more than others so why not use it as a tool. Remember it's not about YOU. it's a powerful weapon once you grasp that. Focus on THEIR story and THEIR needs.\n\n\n10. Your Objection Handling Sucks - Don’t react. Understand first. Most people often react to objections rather than understanding them as concerns. Also don't handle objections immediately It creates conflict always agree first or deflect It. It gets people to \"listen\" and that's what you want then you handle the objection by carefully asking specific design questions (Also know the difference between an objection and a complaint. Someone can say \"it's expensive\" but yet It's still not going to stop them from buying.)\n\nBONUS\n\nThe \"emotional\" Connection - Prospects make decisions based on emotion. sorry let me rephrase that PEOPLE make decisions based on emotions. It's what drives and controls us alot of times. I would even go further to say it's what drives politics including wars. Salespeople who don't connect with prospects emotionally and only ask surface-level questions will ALWAYS likely struggle to be able to close the sale than those who do.\n\nHope this helped. Now don't just absorb information. Act on it and crush this week that new Benz is waiting for you. \n\n\nUPDATE: i did not expect to get many DM's regarding this. PLS if you have questions ASK here for everybody to see so it can help others too and please be as detailed as possible, some of you guys aren't asking the right question. (For other inquiries or consultation is fine to DM.)",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 692,
    "downs": 0,
    "created_utc": 1724646505.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.573550831910581
  },
  {
    "score": 679,
    "title": "Just got offered an $83k salary role at 24 years old!",
    "selftext": "If you dug into my past posts I got promoted twice in one year to a sales manager role at a large corporate gym over a year ago. It was my first sales manager role at the age of 23, and I was completely nervous. My goal when I started that position was to get my club ranked #1 in the country in terms of performance out of 200+ clubs nationwide. Well, I wasn’t able to achieve the #1 spot, but I achieved the #3 spot for two consecutive months and have sustained top 9 in terms of overall growth over a 6 month span! \n\nSince then, my team and responsibilities has grown greatly from leading a team of 6 to a team of 16 now! Unfortunately, I’m not being paid enough for the amount of work I put into my role, so I decided to start looking for other jobs. I found one job that was hiring a sales manager role and decided to apply based on the values of the company, the role itself, and my values and aspirations. It was the ONLY job I applied to, I did not apply to any other single job except for this one. \n\nI spent two hours getting my resume ready with all my accomplishments and a cover letter, sent it out, and got a call back within a day. Fast forward and I had my interview with them, they offered me $83k salary with benefits and bonuses which is a 59% increase from my current salary! My mentor is helping me re-negotiate the offer currently, and I’m doing my due diligence to see if the culture is the right fit by having planned observance times within the company itself to see how the team interacts. Im just blown away that my one and only application resulted in this response right away! This is exactly how I got my job at the gym, I applied to only one company and got the job instantly. Idk how I have such a high success rate/conversion rate of these applications but I’m super excited!\n\nEDIT: After doing a thorough observation period with the company, I decided not to pull the trigger on this. They backed out of the offer last minute and switched it to $60k + bonuses for reaching specific metrics. I also realized how the company wasn’t truly doing well financially, and that it could be a bigger risk on my end to make the leap. I learned a lot from this though and have been grateful to experience it!",
    "subreddit": "sales",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 679,
    "downs": 0,
    "created_utc": 1719661098.0,
    "media": null,
    "is_video": false,
    "num_comments": 128,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.56280376785586
  },
  {
    "score": 666,
    "title": "Started a new job and closed $110,000 in my first two appointments.",
    "selftext": "I’m in remodel sales and made the switch from bathrooms to high end windows. I’ve been in the industry for a while but this is by far the biggest ticket item I’ve sold. I make a flat 9% commission. There are several people who break $500k a month in sales right now and I’m pumped to get there too. \n\nI know this sub hates commission only jobs but let me tell you what, I make a ton working for commission only. ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 666,
    "downs": 0,
    "created_utc": 1741905085.0,
    "media": null,
    "is_video": false,
    "num_comments": 196,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.706358946997346
  },
  {
    "score": 661,
    "title": "I’m quitting tomorrow",
    "selftext": "Fellas, I’m quitting a nice cushy $200k per year job tomorrow and I’m going out on my own as a rep with 100% commission. It’s terrifying, but exhilarating at the same time. We’re all here making money for someone…I figured after all of these years: why shouldn’t it be me? \n\nWish me luck brothers (and sisters!) \n\nEdit: just want to thank everyone for the well wishes and encouragement. \n\nAlso, lots of folks asking for referral to my current job. I’m not comfortable sharing where I currently work, sorry. ",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 661,
    "downs": 0,
    "created_utc": 1711510765.0,
    "media": null,
    "is_video": false,
    "num_comments": 356,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.824692097495797
  },
  {
    "score": 647,
    "title": "My Job makes me irresistible",
    "selftext": "I (63M) am a door to door shower curtain ring salesman. I won’t share the exact number, but at 7 cents/ring, you know I’m buying the name-brand mayonnaise on the regular. \n\nWhen I’m at parties and funerals, women are always throwing themselves at me once they find out I’m in the ring racket. They’re always saying things like - ‘My shower is big enough for two, will you come over for a demonstration?’ or ‘You can put a ring on me’ - even a few of the guys will take their shot with ‘How many rings do you think can fit on my rod?’\n\nAnyway, not a problem at all, but curious if any of my brothers that sling them rings are having the same experience. \n",
    "subreddit": "sales",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 647,
    "downs": 0,
    "created_utc": 1713883629.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.423031684192021
  },
  {
    "score": 643,
    "title": "I did it",
    "selftext": "I got the job. The one where the Ops manager chuckled through the phone call when he scheduled my first interview.\n\nOps manager told me he didn’t take me seriously until he met me in person. After that, he immediately called my (now)boss and told him he had to meet me.  \nTwo days later, I drove two hours away to meet regional sales and ops managers and interview with them. Two weeks later, they sent me an offer. \nI literally snatched the job out of the hands of a previous employee that everyone knew and loved.\n\nI am, once again, the first an only woman to work at this branch. \n\nYesterday was my first day and I crushed it! Every single person I met was so cool and so supportive.\nToday I drove my first ever work truck home. \n\n6 years ago I was waiting tables with no degree. Today I have an amazing new career with a great company, great pay, and great benefits. \nI clawed my way up. I made it. \nI feel like such a bad bitch right now. \n\nThank you for your support during this process and thank you for reading my story",
    "subreddit": "sales",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 643,
    "downs": 0,
    "created_utc": 1680050345.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.537402537009202
  },
  {
    "score": 644,
    "title": "I decided to get ballsy and its working",
    "selftext": "I had a semi rough last month I finished well above company objective. But not the way I wanted to.\n\nThis month I'm destroying it and it's cause I took the gloves off, I stopped being nice. This is B2C \n\nI did a month of sales in 5 days. I've already hit my monthly objective. And it's just mental. \n\nI've been really balsy in my calls. I had a large client ask for a discount. I said \"we don't discount our service or prices we focus on making sure our clients are taken care of\" he said \"I bet I can get this for less\" and I said \"you absolute could, the question is do you want this done cheaply or properly?\"\n\nHe signed up\n\nI always ask my clients if they can make a decision themselves. If they need someone else I stop the call and reschedule (yea it works, I don't pitch unless all decisions makers are present).\n\nSo a dude told me yea he calls the shots. At the end he goes he needs to talk the the old lady. I said \"look at the start of the call you said you could make a decision by yourself. Now I'm married so I get it. But do you really need to talk to your wife or there something else thats stopping you from saying yes or no?\" He goes \"no\" I go \"yea no, that's what I want a yes or no\" he goes \"no\" i go \"why\" he goes \"cause of this\" bam he had a misconception about something. I fixed it, proved he misunderstood it and closed the deal. \n\nHe thanked me too. Just stuff like that. Also I'm disqualifying clients. I'm still closing over half my leads.\n\nTold a few clients this month \"Hey we aren't a good fit for the situation so we won't be moving forward you can call X They are better for you\"",
    "subreddit": "sales",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 644,
    "downs": 0,
    "created_utc": 1710058376.0,
    "media": null,
    "is_video": false,
    "num_comments": 104,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.547654364170237
  },
  {
    "score": 640,
    "title": "If anyone is struggling to find a job, DM me. I’ll do anything I can to help.",
    "selftext": "Context: I was unemployed for 4 months and finally signed another AE offer. I don’t start until 3 weeks from now. So I have free time and want to give back since a lot of people helped me. Tell me about your situation, background and I’ll help you put a strategy together. Plus give you tips I learned that helped me. Note: I’m not doing this for money and honestly think no one should have to pay for this type of advice.\n\nUpdate: Please DM me instead of commenting since it’ll be easier for me to manage responses there and keep any of your personal details less public.\n\nUpdate 2: I’ll work through the messages this week I’m at around 100 now. Doing my best to make them personalized to each situation, but I created generic information for everyone that I will send by tomorrow, Thursday EOD.\n\nUpdate 3: I put together a ton of tips/videos/tutorials/advice DM me for the link. I may make a separate post with all the advice.\n\nUpdate 4: Lot of people looking for advice getting an SDR job. I added a section on slack and may just make a separate post with all advice. Lot of people asking how to enter sales as a career. This is tough but will do my best to give advice. \n\nUpdate 5: ADDED a bunch of videos to the slack with step by step guides DM me for the link. ",
    "subreddit": "sales",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 640,
    "downs": 0,
    "created_utc": 1736951326.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.540493646038601
  },
  {
    "score": 626,
    "title": "I, a salesman, am just thankful for my new AE job.",
    "selftext": "I'll start on Monday, but the company has given me access to the company's tech stack just now.\n\nI accept the slack invite for the first time, and in the first hour, 4 meetings have been booked thru hubspot. 4  AM in San Francisco, late night in Manila.\n\nI check the slack history and counted the alerts in the past 4 days, 38 demo bookings were dished out to the AE's thanks to the SDR's whose names and faces until now I do not yet know.\n\nI asked if I can have access to Gong, which they gave: a library of hundreds of sales call recordings categorized into wins, losses, maybes, hail mary passes, and on and on, according to industry and ICP.\n\nI check out Confluence, and before my eyes, dozens of folders of step by step bulleted manuals and Loom videos on how to do this and that.\n\nNo more fucking winging it. No more godamn \"just figure it out\". No more \"just listen to this dude's podcast, he's great.\"\n\nObviously, I'm happy I got a new job, but much happier still that I found a company that has its shit together.\n\nI am just so happy I'll listen in on the Gong recording while I jog and before I sleep.\n\nTonight I kiss the feet of the sales gods.",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 626,
    "downs": 0,
    "created_utc": 1762549642.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4865100502700415
  },
  {
    "score": 630,
    "title": "I fixed my life with sales",
    "selftext": "I was at rock bottom 8 months ago. Was heavily in debt after a failed business and got into tech sales as a Hail Mary to try and make some solid, stable money.\n\nI had sales experience (from my business) so getting a job wasn’t too hard. \n\nThankfully I crushed my sales targets ever since starting and I’m currently at 300% for March with a week and a half left. Looking forward to a 5-figure commission check next month. \n\nPaid off all my debt last week with the money I’ve been able to make.\n\nWouldn’t have been possible without this job. Crazy thing is this is all as an SDR at 23. The future is looking bright.\n\nThanks to everyone in this thread that helped with advice when I was trying to get this job.\n\nQuestion: any advice on not falling victim to lifestyle inflation with this influx of cash?",
    "subreddit": "sales",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 630,
    "downs": 0,
    "created_utc": 1710976706.0,
    "media": null,
    "is_video": false,
    "num_comments": 286,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.74897030761113
  },
  {
    "score": 617,
    "title": "Just broke 6 figures for the first time in my life!",
    "selftext": "This is my third sales job and I just started back in April and I have as of last week eclipsed $100k in commission! \n\nGot a text from my incredible CEO to congratulate me. I never thought I would be successful in sales because my first two jobs felt pretty scummy. But now selling a product I’m proud of and truly one of the leaders in the industry, I’m just so glad I stuck with it. \n\nI am the youngest rep they’ve hired, the least experienced, and at the time was the only woman on our team. (Now we have 3 total!)\n\nMy first 2 months I had multiple $0 paychecks due to a lack of closed deals and I almost gave up. I came from a 52k a year salary and this was terrifying for me and my husband. I almost gave up and went back to the safety net but I’m so glad I didn’t.  ",
    "subreddit": "sales",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 617,
    "downs": 0,
    "created_utc": 1731343792.0,
    "media": null,
    "is_video": false,
    "num_comments": 136,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.594348758667019
  },
  {
    "score": 610,
    "title": "I hate to say this, but does anybody have any advice on how to do sales with Indian/middle eastern people?",
    "selftext": "I know no culture is a monolith, but damn. 90% of the interactions I’ve had with a middle eastern/Indian person is bottom dollar only. Like literally, the significant majority of middle eastern/Indian people do not care at all about the value of a product. They just care how much it costs. Nothing works to help them see value, even though my product is clearly at least better, if not superior. None of my sales tactics work to help middle/eastern people see value. I either have to be a friend/family acquaintance or give them something for free. I don’t get it.",
    "subreddit": "sales",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 610,
    "downs": 0,
    "created_utc": 1726894151.0,
    "media": null,
    "is_video": false,
    "num_comments": 320,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.7517937264449905
  },
  {
    "score": 608,
    "title": "Warning: the economy will tank imo. Here’s why.",
    "selftext": "I have been selling a product for a number of years to a very large national company. This company is high end with close ties to Bezos and sells something that people NEED. \n\nThe product I sell is NECESSARY for them to sell their product (think packaging). \n\nWell in January they released their budget (around $1m). Awesome! I thought. That was until they SLASHED THEIR BUDGET OUT OF NOWHERE by 60% just days before the Dow jones took a nosedive. \n\nThis company is very closely tied to Bezos and I have a strange feeling that they have inside knowledge of the economy. \n\nIMO: this is a signal the rest of the economy is going to tumble because this company will not be producing as many products. \n\nI find it EXTREMELY suspicious that they would do this and am now worried about the economic future here in US. \n\n\nIs anyone else experiencing issues with selling a product that is NECESSARY for production but all of a sudden has been cut?\n\nI understand most here sell software, but when you sell something like steel to people who make steel beams and they slash their budget by 60% it’s rather concerning. (Just as a note, this company will NEVER cease to exist).",
    "subreddit": "sales",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 608,
    "downs": 0,
    "created_utc": 1741919050.0,
    "media": null,
    "is_video": false,
    "num_comments": 376,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.665287967735772
  },
  {
    "score": 606,
    "title": "What no one tells you when you start in sales?",
    "selftext": "Time to vent.\n\nI'll start, if I may: You barely win. You lose most of the time. Be prepared for that.\n\nI’ve been in sales for over two decades, and I’d like to create a list of things nobody really tells you when you’re just starting out in sales\n\nThank you for sharing the raw stuff, not the textbook. I mean the real lessons: the first rejections, the mental game, the weird client behaviors, and the small wins that kept you going.\n\nWhat did you wish someone had told you when you started in sales?\n\nHere's another one: We are measured in the short frame, while we are playing a long term game.",
    "subreddit": "sales",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 606,
    "downs": 0,
    "created_utc": 1748458057.0,
    "media": null,
    "is_video": false,
    "num_comments": 325,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.782297491109227
  }
]