[
  {
    "score": 937,
    "title": "Link Building in 2023: Strategies That Have Worked Over The Last 6 Months",
    "selftext": "I’ve spoken here a few times about the various tips and tricks you can use when actively building links for your business. Each post has garnered a myriad of positive questions, but a lot of them have been around how you’d actively apply the strategy of link building into bespoke situations. \n\n&amp;#x200B;\n\nThe other day I saw someone telling people how forum links were the way forward, how they still work etc. Then someone mentioned on another thread that backlinks are useless because all they do is make a few odd sales when people click the link; a fundamental misunderstanding of how link building works. Also, someone giving advice regarding how to increase DA. This was advice given to people asking how to do it…creating an echo chamber of false and damaging information that other business owners and new SEO’s read.\n\n&amp;#x200B;\n\nSo, I thought the best way to go about it was to outlay some of the strategies I’ve used with my own clients over the past 6ish months. Recent success is important rather than going back years because it shows the strategies still work in line with the current algorithm etc and after all of those updates last year and the big link update in December 2022.  I’ve called it link building in 2023 simply because these strategies work currently as long as they’re done in line with good link building practices outlined in my previous posts.\n\n&amp;#x200B;\n\nIf you’re literally just starting out with link building, my earlier posts might be a better place to start before coming back here to read up on other strategies…because the basics always apply.  At the same time, I've tried to make this as accessible as possible for those new to link building, so those SEO's with a huge amount of experience might not find anything new here...even so, hopefully you find it useful.\n\n&amp;#x200B;\n\nI haven’t disclosed their business names for obvious reasons. I’ve also tried to go light on the results we had from these strategies for fear of it coming across as promotional. \n\n&amp;#x200B;\n\nThese are strategies that have worked and ones you can use for your own businesses. They work, if done right, consistently.\n\n&amp;#x200B;\n\n# Moved Away From The Large Power Websites\n\n&amp;#x200B;\n\nThis was for an appliance company known nationally in the USA. They wanted to be in the top three for something like “toaster ovens”. \n\n&amp;#x200B;\n\nThey’d been building good links from power websites that hit all the right notes. As had their competitors. Nothing wrong with what the appliance company was doing as on paper their link building efforts were great. \n\n&amp;#x200B;\n\nI did the usual backlink audit and realized something pretty quick. All of their links were to high power websites. Online magazines, popular news websites, review sites, etc. It was a good profile, but that’s all they had. They didn’t have any from smaller websites, like real mom blogs for example that have smaller, dedicated followings.\n\n&amp;#x200B;\n\nThey’d cast them aside because while some mom blogs (using mom blogs as an example here, there are others of course) are pretty huge, most are actually tiny with small loyal followings. They liked the traffic and the authority so they always went with websites that ticked those boxes.\n\n&amp;#x200B;\n\nI took them away from those sites completely (they already had enough) and targeted smaller mom, tech, and recipe blogs. All situated in the USA (target market) with good USA traffic. These were real blogs owned by real people. I built around two hundred of these links over four months. Sounds a lot, but the keyword is in the 90th percentile for difficulty. The differentiation worked and got them where they wanted to be.\n\n&amp;#x200B;\n\nThe point is that in this day and age you need variety. It’s not all about going for those super high metric websites all the time. You need a good mixture. Just because a website doesn’t have really high traffic doesn’t mean it won’t be useful. Google pays attention to the opinions of real websites owned by real people. It can measure these opinions by checking what these bloggers are linking to.\n\n&amp;#x200B;\n\nThe trick is in finding GOOD websites owned by real people and ignoring the (many) bad ones. The business had done the hardwork by building a good “elite” profile, turns out they just needed that bit of variety from “real” people to get them over the edge. When you build your profile, do the same thing…especially for those high difficulty keywords. This is scaleable too. For example, say your client instead is a 3D printing company. A lot of the links would be secured on tech websites etc…great. But make sure you get some on small hobbyist websites too.\n\n&amp;#x200B;\n\nLink differentiation is important to build a healthy link profile…but they still all have to be on good, real websites.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Generic Anchor With Nearby Keyword\n\n&amp;#x200B;\n\nThis campaign was for a medium credit card company who wanted to compete with the bigger firms. Their keyword was pretty hard, around 76% at the time (Novemberish), it’s now in the 90s. \n\n&amp;#x200B;\n\nI realized that all of the major CC companies had built links using the same (target) keyword, naturally. At the time, after the May 2022 core updates, I’d experimented with using generic anchors with the keyword I wanted to rank for, placed nearby and found it to be pretty effective (an old strategy but underutilized by many). The major CCs hadn’t done this (only building with primary anchors), which was a clear opportunity for the newer fintech brand.\n\n&amp;#x200B;\n\nSo, I created links but using generic anchors on strong websites/blogs in the finance/tech niche. The keyword was placed next to an anchor text titled something like “here/alternatives” . I did this for about four months. It’s important to note that the content was completely written to back up this link…the content concerned the keyword, and gave info on the keyword.\n\n&amp;#x200B;\n\nThe volume was around 10k but the keyword is super competitive due to purchase intent. They beat major competitors for this keyword and landed where they wanted to be.\n\n&amp;#x200B;\n\nMost link builders know this now, but many business owners don’t. Also, at the time if you found a word where competitors were just purely using that word as the anchor, and not using this tactic you could really carve a niche for yourself because Google would, nine times out of ten, rank the site with link variety even if the website had less direct keywords. So, you’d attach the URL to a generic keyword, but put the keyword you want to rank for right next to the link or nearby, instead of making the keyword you want to rank for the link itself. But, the content has to be hyper relevant. No link insertions into mildly relevant content!\n\n&amp;#x200B;\n\nIt’s still a deadly strategy, it’s just that your competitors might be doing it too, it depends what niche.. It’s easy enough to check. If they’re not, you’ve got an easy strategy to get a lead on them, just remember to do a few target keyword links too.\n\n&amp;#x200B;\n\n# Building Links For The Future? It Can Be Done\n\n&amp;#x200B;\n\nThis is an interesting one. Usually, when I build links I build them for a client who wants to rank higher for a specific keyword that’s usually hard to hit, in the present (they want to hit it asap).\n\n&amp;#x200B;\n\nThis client wanted to hit a keyword for an upcoming event. They’re a smaller business event that runs a yearly forum. The keyword was something like “ABC forum 2022”. As you’d imagine, they were attacking things too late. They asked me to build links two months before the event. \n\n&amp;#x200B;\n\nAt the time, the keyword was super difficult and high volume. This is an event that happens every year. I ran the following year. 0 volume, something like 4 or 5 difficulty. No one searches for the next year. Not really. Why would they when the current year's event hadn’t yet happened?\n\n&amp;#x200B;\n\nNow, there are about six major forums that all vie for top spot. All well known and well funded, some headed by familiar faces. \n\n&amp;#x200B;\n\nI suggested we start building for the next forum right away instead. Essentially building links for a keyword that, at the time, had no volume. (remember, I knew that volume would shoot up into the tens of thousands, just as it did every single year, in the year of the event).\n\n&amp;#x200B;\n\nSo, I built for the future. I built a backlink profile targeting a future keyword and it absolutely worked. When the volume started to pick up for the keyword in question in the year and Google realized people were searching for it and started ranking websites for it, we hit the top right off the bat in prime booking season - whereas the competitors only started building links in the year of the event. We stayed pretty much at the top for the entire year…and, in that year, we built for the next year. \n\n&amp;#x200B;\n\nIt all sounds super obvious but a lot of businesses have it ingrained in them that they should logically target keywords with high volume…because that’s what people are searching, right? But if you know people will soon target a word that isn’t being searched yet, you can get a huge jump on the competition.\n\n&amp;#x200B;\n\nThe point is that if you start targeting year sensitive or similar keywords too late you’ll leave yourself too much work to do, whereas with enough time you can build early and land well. The forum was related to business investment so creating content and finding websites wasn’t an issue…it was just about having patience when you’re essentially trying to rank for a keyword with 0 volume, but knowing that volume will 100% shoot up. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Move From Super Defined Content To Generic\n\n&amp;#x200B;\n\nThis is for those businesses in unique niches.This one will probably be known by most in SEO, but for business owners its an important distinction to make; between links in super defined content or generic content. As I’ve gone over before, for links to work properly and pull they need to be placed into unique, well written and engaging content. Spun content, badly written content etc. just wont work anymore and it won’t do what you want it to do for your business. Good links work not just because they’re placed on good websites (traffic ((from target country, not just any traffic)), localization, relevance etc.) but because the content is good and unique..\n\n&amp;#x200B;\n\nWith that said, we come to a situation whereby the client is in a super defined niche…namely petrochemical/chemical manufacturing, but were a smaller startup with a niche product. We started creating content, placing links in them and placing the content onto websites in the right country (USA) with high traffic and good metrics. We quickly ran into the problem…there aren’t that many chemical manufacturing blogs/websites out there. The client is a startup backed by VC, trying to carve out a space against some of the larger manufacturers.\n\n&amp;#x200B;\n\nSo, we moved from targeting super defined websites to open ended engineering/industrial websites with way more generic content…but in the content is always a chunk (three four paragraphs with H2 and H3 subheaders) pertaining to chemical engineering along with the keyword. Stretching allowed us, after a further two months, to rank an annoyingly complicated keyword ahead of these major chemical manufacturing competitors. \n\n&amp;#x200B;\n\nThe point is that you can use varied content where needed…don’t miss out on slightly off note websites just because it doesn’t directly cover what you need. Vary and generalize your content for the links and you can still rank for those difficult keywords, even in the hardest niches out there.\n\n&amp;#x200B;\n\nThis sounds super counterproductive when everywhere else it’s all about content relevance…but the key is that if you’re super niche, you can end up bogged down and spending an age looking for the perfect website. If you’re extremely niche, you have to think outside the box while adhering the link building guidelines.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Create A New Linkable Asset\n\n&amp;#x200B;\n\nYou check the competition and make sure what you’re trying to rank is better than what they’re trying to rank…it’s the first thing you do. So, the content reads better, is longer (where needed, quality over quantity), page is faster etc…sometimes that isn’t enough.\n\n&amp;#x200B;\n\nIn competitive niches you know your competitors will have top quality content that you can only match. Sometimes you’ve got to think outside the box to make a dent, especially if you’re new to the scene. \n\n&amp;#x200B;\n\nIn this case, we created a calculator as a content break, then used links to rank the content that was built around the calculator. We made the content far more useful to the reader because it now included an interactive calculator. So, when we began the link building it worked a lot better and was more logical…because bloggers, website owners etc. would logically link to the content that was better.\n\n&amp;#x200B;\n\nSo, by creating a new linkable asset within the content we created a unique and specific angle.\n\n&amp;#x200B;\n\nThis was predictably in the law/finance niche. The volume was very low but the difficulty was hard. The search intent was incredibly commercial and the kw led to clients that garnered eye watering payouts…if that makes sense. Point being, they’d previously ranked in the top three, and dropped to around 15. By adding links and the calculator, over four months they’re now consistently fighting for 1.\n\n&amp;#x200B;\n\nPoint being: have a look at the content breaks your competitors are using/not using and one up them with something unique. Then, when you go for a link building campaign you’ll pull more traction. I’ve seen this work elsewhere too but this is the most recent and applies to the “2023” moniker. It can be something as simple as some well placed infographics, unique pictures, data tables, etc. In our case, they’d already been used by competitors so we had to get a dev to create a calculator. Just saying, it doesn’t always have to be a calculator :D.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Keyword Timing\n\n&amp;#x200B;\n\nThis kind of relates to building for the future, but it’s different enough to form a section of its own. You might not always be at number one, but make sure you are when its important to be. In this day and age, the SERPS fluctuate consistently, especially when you’re in the top three. Its harder to stay at number one consistently (although it does still happen)...instead, you’ll float between 1,2,3. \n\n&amp;#x200B;\n\nDue to this, it might be inopportune to pull the trigger on strategies that might place you at number one, at the wrong time of the year…because the reality is that you might only stay there for a month or two and constantly pulling the trigger on the strategy won’t work. Some businesses work all year around so it doesn’t matter, but some are certainly seasonal. Think Christmas decorations…anything with an element of seasonality.\n\n&amp;#x200B;\n\nThis client wanted to hit their heights asap in September, but they sell a winter related auto product that people are far more likely to purchase in the coldest months (Jan/Feb in this case/location)\n\n&amp;#x200B;\n\nInstead, we pulled the trigger later on in the year, leading to the relevant keywords boosting where they historically got their most sales (February). Imagine we’d done this so they were ranked well for September? They wouldn’t have done nowhere near as well. \n\n&amp;#x200B;\n\nRemember, it is possible to nail number one and stay there for months on end, but for some of the extremely difficult and competitive keywords you can expect some fluctuation, in which case it can be smart to time things as best possible to gain that impetus when it’s going to be most powerful.\n\n&amp;#x200B;\n\nOn the other hand, you can expect your clients to do this too. To counter this, you can dial down the link building to a slow amount over a long period…slowly but surely creating a great profile…but then ratcheting it up a few months before your target period.\n\n&amp;#x200B;\n\n# No Links To Heavy Links\n\n&amp;#x200B;\n\nThis is something that usually never works and you probably shouldn’t do, the situation has to be just so.\n\n&amp;#x200B;\n\nIf you don’t have a link profile and aren’t ranking well for target keywords, suddenly pushing out a total ton of links won’t be a good idea.\n\n&amp;#x200B;\n\nHowever, there are some who do rank well for keywords but don’t have much of a link profile. In this case, we went from a very low amount to a high amount in one month and the result was the client ranking for a myriad of rev driving keywords. They’re in the photo accessory business and sell direct to consumers as well to big sporting events and Hollywood.\n\n&amp;#x200B;\n\nTo double up on this, I’ve done this for another client who ranked 96th for a 70% difficulty keyword but 50k volume. They weren’t ranking for that particular keyword very well, but ranked well for a huge amount of other keywords…so the danger was omitted because they were already a big name in the space so it was logical for people to link to them. By ratcheting up fast over a few months they’re now where they wanted to be.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nIn short: you shouldn’t usually go from no links to tons of links over a short period of time and link builders/SEO’s who suggest this don’t have your best interests at heart. But, if you’re already ranking pretty well for a high volume/relevant keywords (or similar keywords), you can get away with it. This worked well. Remember, the links for these clients were great links, websites with strong traffic, relevant, great content, etc. Nothing spammy at all. I don’t want people thinking they can buy a load of bad links and expect this to happen.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTo round this off: \n\n&amp;#x200B;\n\nWe’ve all seen the crazy posts and replies on here regarding link building. Link building is a consistently applicable strategy that does still work when done right. The Google update in December has targeted those who have taken the option of procuring incredibly bad links wholesale. If you’re nuanced in your approach and build links properly they always work. I’ve seen it thousands of times, for hundreds of businesses and thousands of keywords. I guarantee that the biggest players in the biggest niches in various industries use link building. I’ve had S&amp;P clients who use link building campaigns, some of the biggest names you can think of. \n\n&amp;#x200B;\n\nIt’s incredibly simple to get right: \n\n&amp;#x200B;\n\nGood unique content\n\nA well researched keyword (as an anchor, in most situations)\n\nThat links back to A1 content on your website (that’s optimized for that keyword)\n\nPlaced on a relevant high quality website that has strong traffic from your target location\n\n&amp;#x200B;\n\nYou can rank some content without links, but if you’re needing links, don’t take a shortcut. Do it properly and you’ll see great results quicker than you think.\n\n&amp;#x200B;\n\nAt the same time, as with this post, you’ll need to think outside the box to get that edge over your competitors…which brings us onto the last point\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Develop a link-building strategy\n\n&amp;#x200B;\n\nI've spoken about this before. It’s better to not just snatch at links and spray out links every now and then. Instead, develop a link-building strategy. \n\n&amp;#x200B;\n\nThis is the most important part of link building. If you use an agency, or a freelancer or whatever, you need them to develop a solid link profile that’s inter complimentary. That’s to say, it can’t all be weighted on one keyword. Develop a strategy bespoke to your own business. Don’t just randomly place links without a plan in mind. \n\n&amp;#x200B;\n\n**Good SEO’s will build you a great link profile, they won’t just place links. There is a major distinction between the two.**\n\n&amp;#x200B;\n\nFor smaller businesses just starting out without budget…It’s better to get one good link, than 50 bad links. Don’t jump the gun. If you can't afford good links, wait until you can. Buying trash links in this day and age is just wasting money. They won't nuke your website, but they won't do any good either. At the same time, check out my earlier post for more generic advice.\n\n&amp;#x200B;\n\nI could write a lot more but it’s quite long as is :D. Hopefully, you’ll find it useful and gain some applicable knowledge for link building for your business.",
    "subreddit": "SEO",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 937,
    "downs": 0,
    "created_utc": 1681213830.0,
    "media": null,
    "is_video": false,
    "num_comments": 194,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.867220144060323
  },
  {
    "score": 733,
    "title": "I made an awesome ChatGPT prompt for internal linking",
    "selftext": "I just made this prompt for ChatGPT that finds internal link opportunities on your website. It works surprisingly well.\n\n1. Enable “Deep research” mode on ChatGPT (you’ll need a paid plan).\n2. Paste the prompt below and add your website link and target URL to it.\n3. Answer any additional questions ChatGPT might have.\n\n**Here’s the prompt:**\n\n“You are an SEO expert specializing in internal linking strategies for local business websites. Your task is to analyze the internal pages of this website: \\[your website link\\] and recommend new, contextually relevant internal links pointing to this target page:\n\nTarget URL: \\[target page link\\]\n\nInstructions:\n\nCrawl all internal pages of the website, excluding navigation, footer, and sidebar content.\n\nFind content where it would be natural and helpful to link to the target page.\n\nExclude any pages that already contain an in-content link to the target URL.\n\nFor each suggested internal link:\n\n1. Identify the source page URL.\n2. Suggest anchor text that feels natural and is topically relevant.\n3. Provide the exact sentence where the link can be added, or suggest a new sentence that could be inserted smoothly into the existing content.\n4. Provide at least 20 internal link opportunities.\n\nOutput Format: Present your suggestions in a table with these columns:\n\n* Source Page URL\n* Anchor Text\n* Sentence with Link Placement\n* Exactly where in the text the sentence with the Link should be placed.\n\nMake sure your recommendations follow best practices for internal linking: improve user navigation, reinforce topical authority, and support SEO for the target page.”",
    "subreddit": "SEO",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 733,
    "downs": 0,
    "created_utc": 1746646435.0,
    "media": null,
    "is_video": false,
    "num_comments": 150,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.690184533562656
  },
  {
    "score": 692,
    "title": "Link Building in 2025 - Strategies for success, and what's changed?",
    "selftext": "Hi - I wrote something similar last year, and it garnered some good response along with a lot of questions regarding different elements of link building and how to go about it as a business owner.\n\nThe reality is that we don’t 100% know all the elements the HCU entailed or changed. But In my experience, links have become a bit more impactful from what I've seen since the HCU and early 2024 updates, and are still an incredibly powerful ranking factor. Again, the sub is full of bad and nonsensical advice and commentary in regards to link building (elements of good, too) - its an incredibly (in my experience) logical process that people oftentimes overthink - however, it's time consuming to do it properly which is why so many people (agencies AND business owners) cut corners and get subpar results. \n\nBelow, I’m sharing some information I mainly wrote in response to questions from business owners that could potentially benefit others. If you know link building well, this may not be useful to you but hopefully this can help some business owners create a more powerful profile of links.\n\nThere’s a mixture of strategy and discourse. Again, if you’re right at the start of your journey, my earlier posts outline some of the more general aspects of link building.\n\nEach of these are essentially strategies and changes we’ve used over the last year.\n\nIt’s important to note with all things that this is what worked for me and my clients - there are other views and methodologies that might have worked just as well for others - and that these are my own opinions based on what I’ve seen rather than universally accepted concepts.\n\n# Stopped Using Link Inserts\n\nFor this client, they’d been using link inserts for a long period of time with mixed results. Every now and then they’d get a *small* bump followed by a retraction. The strategy just wasn’t working. One of the issues was that, as a large B2B machinery seller in the financial sector, the weak link inserts previously procured just weren't moving the needle for the more difficult keywords. Before we look at the strategy - I just wanted to run through link inserts in a bit more detail…\n\nThey’ve always been a cheaper option - and can sometimes be effective. However, there’s a way to get the best out of them. A way that the majority of large “link building agencies” don’t use or really care about due to the volume they’re processing. Unfortunately, its led to misinformation in general about what works best for link inserts.\n\nI find the best way to look at them is in a kind of tier system. This is just something that's in my own head, but it might help you out. Remember, link inserts, in my opinion, rarely beat post placements because with a post, you can completely control the breadth of content that sits around the link, allowing you to get the best from it entirely. With a link insert, the content isn’t primed to drive your link in the best possible way. Anyway:\n\nTier one: A link that's thrown into content that isn’t even indexed on google.\n\nIn our opinion these are the lowest of the low (though some might think otherwise) - and usually what these agencies procure on mass for their clients (or other agencies outsourcing to them). Doesn’t matter if the website is decent, if the page the link is in isn’t indexed, it’s going to do near nothing! \n\nIf you’re procuring a link insert yourself - check the content you want it inserted into is at least indexed on google! You can do this with a simple site:(webpage) search on google itself. \n\nIn the case above, upon investigation, these were mainly the links procured for the client up until we started working together.\n\nTier two: A link in a page that’s indexed\n\nIts better because its indexed. However, here you have to make sure the content is worthwhile, isn’t terrible, and ties in with your own link. \n\nYou don’t just want to throw your link into a page just because its indexed. Sure, you might be able to reword some of it, and potentially add in a paragraph that surrounds the link - but it has to be contextually relevant to what the link leads to. \n\nThe client had a few of these too, some moderately relevant, but no consistency. \n\nTier three: a link in content that ranks on google\n\nNow we’re getting somewhere. The content actually ranks on google - it isn’t just indexed…its ranked for terms. This means google is passing the content/page value…its saying that essentially it trusts the page enough to show it to people. A link here is clearly more valuable than the above. Again - the content has to be on point, and you can’t just throw your link into any content…there has to be relevancy. With that said - a link in content that ranks, if done right, will usually pull.\n\nThe client had none of these…\n\nTier four: A link in content that ranks for industry specific keywords\n\nThese are great, because the keywords are completely related to you, and to what you do. Difficult to get, but completely worthwhile.\n\nTier five: A link in content that ranks for what you’re trying to rank for\n\nA holy grail - but usually out of reach. These work incredibly well usually - but most sites aren’t going to link to a competitor from a page that ranks for a keyword they’re trying to beat them in - but it can be done in certain niches and situations. \n\nRemember - the content also has to be right when you’re looking at link inserts, this is just illustrative of the different kinds out there without really looking at assessing the website or content - its a way of highlighting how you can leverage getting a good link insert out of your provider.\n\nMost bought are tier 1 - a good agency won’t get you these kind of inserts (a great one will use inserts sparingly anyway - instead curating content that gives your link the best chance of doing well) - but this gives you an idea of how to leverage something out of it if buying them for yourself or assessing a provider.\n\nNow - back to the client, they sell large machinery with some pretty tough keywords to crack. The agencies previously primarily were using tier one and two above…so no real efficacy, on pages with weak relevancy.\n\nBy pivoting to content curation, we were able to write for the target website while really making the most out of the link in the content we’ve written. We focused down on websites in the B2B niche as well as websites within the niches that would use this kind of software - the link inserts previously were just slapped into any kind of weakly relevant content. Remember, with link inserts, the content has been written for another purpose (maybe even for another link) - so you’re usually better off putting content together. The differentiation here got them where they wanted to be within 4 months, and when you think they’d spent years building crappy link inserts it speaks volumes.\n\nThe main takeaway here is you can’t cut corners. You either need to get GOOD link inserts, or curate the content yourselves and you’ll see results if consistent. It boils down to logic. It also kind of shows how so many do this wrong (either due to lack of knowledge, or because they just can’t be bothered to do it right). \n\nDon’t just slap your links into any kind of content - Pivot to placing content written to support your link.\n\n# Link Velocity: How Many?\n\nWhen a website goes viral or hits the headlines - however old - it accrues a tonne of links and nothing bad happens. \n\nThe reality is that to an extent and from what we’ve seen - numbers don’t matter, what matters is the quality of the links you’re getting. The more quality links the better. Some do stand by numbers, and may have evidence to back that up - but in my experience quality stands on its own two feet where quantity doesn’t so well.\n\nOne quality link can be worth hundreds of other links. You can get good links as often as you can. Never pass up a great opportunity because you think you’ve got too many in a month or a year. \n\nFor a brand new website - it’s good to take a well planned out and measured approach. Different kinds of sites that are all of a certain quality, pertaining to the niche in question always drive value.\n\nIn this case - We began working with a brand new brand in the B2C niche selling a popular ecom product. Competitors had thousands of links and a lot of business owners will jump to a (logical to be fair) conclusion that they need to match those links. Instead, focus on quality, and focus on making up a solid link profile that makes sense. In doing this, we matched and then surpassed the competitors for primary keywords after 6 months with 20% the amount of links that they had.\n\nQuality over quantity. What makes a quality site is the real question - but don’t just look at the number of referring domains, the domains themselves are whats important. Many people focus on the number of referring domains - its the quality level of domains - not the amount! \n\n# Competitor Sniping? The links may not work in the same way\n\nThis is an easy one - but worth a mention. The clients were between 4th and 6th for their main keyword - selling a consumer product similar to kids water toy, huge volume etc. \n\nTheir link building was essentially copying whatever links their main (and leading) competitor was procuring. \n\nI’ve seen many clients and individuals who have come to me and said ‘I’ve copied my competitors link profile, but its not really worked and they’re still higher than me etc.”\n\nSometimes links won’t work in the same was as they have for someone else. Sniping a competitors profile can work, and if there are any epic websites in the profile it can be worth trying to secure your own link. However, you’d be better off in the long run simply focusing on procuring your own link profile. Simply because of the quirks of link building, copying a competitor profile may disappoint you if it doesn’t give you a similar boost. Don’t spend all your time on your competitors' profile! There are many variables in play.\n\nThis is a perfect example of why opinions can and do differ - because sometimes the same methodology works differently from one site to the next.\n\nCompetitor link sniping can work as part of a wider link acquisition strategy, but it shouldn’t be all you do.\n\n# Try out the first person (in Content)\n\nThe majority of articles are written in the third person. It’s logical, easier, makes more sense. Sometimes it can also make sense to vary things as best possible and push out some first person posts. There was a single product ecom client in a really niche industry, but the keyword was nails. They were getting the right kind of link profile bit by bit, but every single bit of content they put out there on other sites (which held the link) was super similar.\n\nIn fairness - it's hard to make each article unique with their one product store that fits a very slim user profile. However, we varied the content and made 70% of new posts 1st person - this works well for a few reasons:\n\n* It really looks like the owner of the website/blog etc., has written the content - it feels more immediate and real.\n* It stands out - if done well, it breaks the monotony of the same posts going to similar websites - meaning there could be more chance of ranking (especially if the “author” is recognised as an expert. If it ranks, the link will be more powerful instantly.)\n\nThere are some drawbacks - if not done right, the article can read too promotional. It needs to be as neutral as possible. In this case, changing a load of link placements so that they’re in first person written content worked really well and pushed them into a gaining position.\n\nVary the voice, tone, and person of the articles you’re placing on other websites. In the real world, the articles wouldn’t be too similar if it were happening naturally - again, create a believable link profile and use varied content to achieve this. You’re not just creating single links - you’re creating a varied profile, first person content can be part of this.\n\n# Write for the Website or the link?\n\nPeople get confused with this - do you write for the link, or the website?\n\nThe two will tie over slightly because logically the site you’ve targeted will naturally be in the same niche as your business. The best bet is to write for the website - because it gives you more chance of being published - and looks like the website owner has written the content.\n\nHowever, you have to give your link the best chance of success too. So - you curate the content in a certain way that's not promotional, but as if the website author has just naturally linked to it as if it would be a good resource, good product, on point information etc.  \n\nSo what you need to do is write for the theme of the website your publishing on - while focusing the niche/minutiae on your own websites intent. Takes practice but all you need to do is put yourself in the website owners shoes when writing the content.\n\n# Create Your Own Network\n\nPBNs are usually referred to in a negative light, in a lot of cases this is justified. It’s because a lot of PBNs are from spammy link farms with spoofed traffic etc., owned by one person who rarely does things right.\n\nHowever, if you have the time and inclination you can build a logical one of your own.\n\nYou essentially would build blogs around the service/product you’re selling - then link from the blogs logically to the service. For example say you own an electric bike website, you might build a couple of content sites:\n\n* A blog on electric bike laws in different states\n* A blog on electric bike reviews\n* A blog on best places to use an electric bike\n* A blog on electric bike maintenance tips etc.\n\nIf you rank all of these for logical terms, the links from them to your electric bike shop will be pretty powerful. \n\nHowever, its limited by how many blogs you can create. Also, if the keywords you’re targeting are incredibly difficult, you’ll need links from other relevant blogs/websites in any case. \n\nLastly - it is eminently time consuming. However, this is an example of a workable PBN.\n\nAgain, a decent strategy depending on the use case and KW difficulty you’re going for.\n\n# Website Traffic: Quality over Quantity\n\nWeb traffic is a main website assessment metric. However, a lot of people use it in the wrong way. Most people now know (not all) that focusing on DA/DR etc. as a way to assess a website is a one way ticket to at best, a link that does nothing and a quick way to burn through your cash. So, we look at site traffic instead. We often consult on external link campaigns, on one, a client was approving any links (from their internal marketing team) with traffic over 5k - that was their only barometer, traffic over 5k. There are multiple things wrong here.\n\n* The traffic might be coming from a country that the client business doesn’t even operate in. \n* The traffic might be coming from completely fake/nonsense sources\n* The keywords the site ranks for might also be complete nonsense (meaning the traffic means nothing or is just fake and spoofed).\n\nSo - instead of focusing on traffic numbers - focus on where the traffic is coming from. Instead of looking at quantity, go for quality. Here - we taught the team to look at what the site is ranking for, and whether or not they’re relevant in the grand scheme of the campaign. By focusing on this instead of the blind numbers, they’re not only getting websites that rank for relevant terms to link to them, but sites with real traffic. In this case - a site with 2k relevant and real traffic is better than one with 50k nonsense anyday! \n\nNumbers can be good if you’re assessing two sites with real traffic against each other - obviously then, if you’ve the budget, you go for the larger one as seemingly Google is passing that one more (relevant) traffic (for whatever reason). \n\nIn the end - remember, you’re trying to create a profile of believable links to your website. You’ll need different kinds of websites (while keeping relevancy and quality in mind.) This is where so many go wrong - because they tend to snatch at links here and there and don’t focus on building a mutually beneficial portfolio of links. Hope this helped with your link building campaign. Again - this is what I've observed and what's worked for me. Other approaches may be just as viable.",
    "subreddit": "SEO",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 692,
    "downs": 0,
    "created_utc": 1739212164.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.545372877642747
  },
  {
    "score": 629,
    "title": "SEOwallet - 200+ SEO Features, 600+ Downloads, and Chrome Store Featured!",
    "selftext": "**Hello Everyone!**\n\nThank you so much to everyone who helped test SEOwallet, because of your support, we haven’t found any major issues since the launch, and that’s all thanks to your careful testing.\n\nI'm excited to share that **SEOwallet**, our SEO extension with over 200 features, is now live on the Chrome Store. We've already hit over 600 downloads, earned a 5-star rating, and have been marked as a trusted extension by the Chrome Web Store. We've also received the featured tag, which shows that we've followed the recommended practices for Chrome extensions.\n\nThe response has been amazing, and people are really enjoying it.\n\nIf you haven’t tried it yet, you can download it directly from the Chrome Store. \n\nDownload Link: [https://chromewebstore.google.com/detail/seowallet-seo-extension/mmdmglmkoblcdgndchbohenfoglomjfk](https://chromewebstore.google.com/detail/seowallet-seo-extension/mmdmglmkoblcdgndchbohenfoglomjfk)\n\nWe’re also working on Version 2, and I’d love to hear your ideas for new features. Here’s what we’re planning for V2:\n\n1. Meta Tag Creation\n2. AI Integrations\n3. 3rd Party API Connector (for Ahrefs, SEMrush, Moz)\n4. GA &amp; GSC Integration for Reporting\n5. Search Intent Finder V2\n\n**Current features include:**\n\n* Overview\n* Image Optimization\n* Instant Position Checker\n* Rank Comparison\n* Search Intent Finder\n* Link Checker\n* Heading Optimization\n* Page Pro Analyzer\n* IndexAPI Connector\n* URL Toolkit\n* Structured Data\n* Social Markup\n* Domain Inspector\n* Redirects Manager\n* Local Search Simulator\n* SERP Analysis\n* Character &amp; Word Counter\n* SERP Counter\n* View Rendered Source\n\nPlease download SEOwallet, give it a try, and let me know how it works for you. I’m excited to hear your feedback and any suggestions you have.\n\nThanks again for your support!",
    "subreddit": "SEO",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 629,
    "downs": 0,
    "created_utc": 1725258058.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.070036892032695
  },
  {
    "score": 522,
    "title": "Let's laugh my 2M blog is officially dead ",
    "selftext": "We went from 2m monthly visitors to now hitting almost 0 traffic a day. New content doesn't even rank and we lost over 2000 keywords. Google would rather not serve an answer or serve a website that copied our article word by word than actually index us. 8 people lost their income. 8 people fired, people with new babies. 6 years of hard work. I personnaly used to put up to 18 hours work a day on the website. We are famous enough to be contacted by media to ask us about informations (niche).\n\nWe think this all happen because we went multilingual 4 months ago. Income gone in 2 weeks, we don't even make enough money for lunch now. \n\nAnybody kind enough SEO person to help us get out of bankruptcy ?  ",
    "subreddit": "SEO",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 522,
    "downs": 0,
    "created_utc": 1725496653.0,
    "media": null,
    "is_video": false,
    "num_comments": 401,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.73311471540951
  },
  {
    "score": 483,
    "title": "Google caught in their lies with leaked API docs ",
    "selftext": "I’ve never been a fan of Rand Fishkin but he leaked Google api docs yesterday. Link in comment. He’s put a lot of misinformation out over the years. But I’ll say it 100 times. If you’re not keeping up to date with the algorithm you’re not doing SEO. \n\nMany of the things mentioned in the leaked documents that impacted ranking were things Google has said publicly via one of their parrots didn’t impact ranking. The only way you’d know is to put the tactics to the test. \n\nStop listening to affiliate bloggers, John Mu and other idiots. Do your own tests. Measure. \n\nWhat Mike King did over at iPullrank is pretty impressive. Look it up. Read through the documents. \n\n\n\nKEY TAKEAWAYS:\n\n    Google claimed they don't use a \"domain authority\" metric, but the docs show they totally do - it's called \"siteAuthority.\"\n\n    G said clicks don't affect rankings, but there's a whole system called \"NavBoost\" that uses click data to change search results.\n\n    Google denied having a \"sandbox\" that holds back new sites, but yep, the docs confirm it exists.\n\n    G assured us Chrome data isn't used for ranking, but surprise! It is.\n\n    The number and diversity of your backlinks still matter a lot.\n\n    Having authors with expertise and authority helps.\n\n    Putting keywords in your title tag and matching search queries is important.\n\n    Google tracks the dates on your pages to determine freshness.\n\n    A lot of long-held SEO theories have been validated, so trust your instincts.\n\n    Creating great content and promoting it well is still the best approach.\n\n    We should experiment more to see what works, rather than just listening to what Google says.\n\n",
    "subreddit": "SEO",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 483,
    "downs": 0,
    "created_utc": 1716893591.0,
    "media": null,
    "is_video": false,
    "num_comments": 190,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.537862045268277
  },
  {
    "score": 475,
    "title": "Here is How I find Zero Search Volume, low competition but high traffic potential",
    "selftext": "I was one of the people (the second after writer.com) who started AI content detectors back when ChatGPT was launched along with a tool called AI to human text converter. Both of these terms (and relevant others) have now millions in search volume.\n\nThese and countless other opportunities I have found over the years for me and my clients by using a simple yet effective keyword research strategy.\n\nThe more you research the better the outcome is.\n\nI won't share any typical strategy like look into comp keywords blah blah\n\nThis method helps sites that are new, low authority, in a competitive niche and that want to target keywords that big sites don't have dedicated pages for.\n\nSo here is how this goes.\n\nI start by using Google /Bing and Youtube Autocomplete to understand how people search for my topic. Let's say I'm researching \"coffee machines.\" I'll type different combinations:\n\n* \"what coffee machines\"\n* \"when coffee machines\"\n* \"how coffee machines\"\n* \"are coffee machines\"\n* \"why coffee machines\"\n* So on\n\nThis shows me the actual phrases people type into Google. For example, typing \"how coffee machine\" might show suggestions like \"how coffee machine works\"\n\nNext, I look at the Keywords Everywhere extension suggestions for each search. The extension shows additional keywords on the right side of Google results. I write down all unique keywords it suggests.\n\nThen comes the key part - I take all these keywords and check them in Semrush. But here's what makes this method different: I specifically focus on keywords that Semrush shows as having zero search volume. These are often overlooked keywords that actually have search potential.\n\nTo verify this potential, I export these zero-volume keywords and put them into Google Keyword Planner. I'm looking for keywords that show:\n\n* 10-100 monthly searches (or more)\n* Year-over-year increase in searches\n\nFor example, a keyword like \"coffee machine pressure adjustment\" might show zero volume in Semrush but have 100 monthly searches in Keyword Planner with increasing interest.\n\nAs a final check, I look up these keywords in Google Trends, focusing on my target country. This helps me understand if there's consistent interest throughout the year. Sometimes you'll find keywords that spike during certain months - useful information for content planning.  You can also search up your keyword in reddit/X or similar platforms and see if users have shown interest around the topic.\n\nOnly after a keyword passes all these checks do I create content around it. This method helps find keywords that:\n\n* Have actual search volume (confirmed by Keyword Planner)\n* Show growing interest (year-over-year increase)\n* Have less competition (since they appear as zero volume in Semrush)\n* Show real user interest (verified by Google Trends)\n\nI've found this method particularly useful for finding long-tail keywords that bigger websites often miss. These keywords might have lower search volume, but they often convert better because they're more specific to what users want.\n\nA real example might help: Instead of targeting highly competitive keywords like \"best coffee machine,\" you might find that \"coffee machine water tank cleaning\" shows zero volume in Semrush but gets steady monthly searches in Keyword Planner, with increasing year-over-year interest.\n\nIn addition to finding keywords, when you finalise terms, before you write on those, you need to identify the relevant enitites that you need to mention. You can use tools like surferSEO or you can do it manually.\n\nHere is how to do it manually.\n\n\\- Go to Google and type in \"refined KW.\"\n\n\\- After you search, you might see bubbles or suggestions at the top or bottom of the search results. These are related queries that people often search for.\n\n\\- Click on one of these suggested queries.\n\n\\- Look at the new search results and note any important words or phrases you see. These might include specific features, brands, or types.\n\n\\- Go back to the original search and click on another bubble, and note down the key terms you find.\n\n\\- Gather all the important terms from the bubbles.\n\n\\- Group similar terms together to see what theme emerge. \n\nYou can also see the theme of a particular SERP by analyzing the PAA. When writing down the content, you should answer these questions naturally throughout as these satisfies the user intent.\n\nI hope this helps. I have other keyword research techniques but this one is relatively easy and implementable.",
    "subreddit": "SEO",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 475,
    "downs": 0,
    "created_utc": 1734958261.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.396848426997461
  },
  {
    "score": 440,
    "title": "Google Is No Longer A Search Engine",
    "selftext": "The function of Google is no longer that of a search engine.\n\nWikipedia defines a search engine as a \"software system that finds web pages that match a web search. They search the World Wide Web in a systematic way...\"\n\nIn my niche (and probably in yours too) Google does not do this. And here is why.\n\nOf all the keywords I target, 80% have Youtube videos for the first 3 results. One keyword actually had Youtube for every one of the top TWENTY rankings. (I assure you that I am not exagerating).\n\nAbove the youtube results are a bunch of ads.\n\nBelow the ads are some questions with answers that Google has STOLEN from creators.\n\nGoogle is 100% about keeping people on googles own products and not at all about surfacing good content.\n\nLets stop lying to ourselves. Google search is now just a promotional platform for other Google products. Google DOES NOT fulfil the function of a legitimate search engine, which is to crawl the web and surface content from all sources that is related to the users search.\n\nIts time we stopped calling google a search engine.",
    "subreddit": "SEO",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 440,
    "downs": 0,
    "created_utc": 1696354076.0,
    "media": null,
    "is_video": false,
    "num_comments": 202,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.488186608424446
  },
  {
    "score": 301,
    "title": "I've never seen Parasite SEO this aggressive. 22M+ organic traffic to a hacked Duke.edu subdomain in 24 hours.",
    "selftext": "I was digging into some data today and stumbled upon something wild. It's one of the biggest and fastest Parasite SEO campaigns I've ever seen.\n\nAttackers have compromised a bunch of high-authority .gov and .edu sites. We're talking about Duke University, Michigan.gov, Wayne State, and even ca.gov and it.gov\n\nThey're creating thousands of spam pages to rank for all the usual garbage keywords.\n\nThe scale is insane.\n\n* A subdomain on **duke .edu** went from almost nothing to over **22 million** organic visits in a single day.\n* A ca .gov saw went from **0 to 8 million** organic visits in 24 hours.\n\nIt's a crazy reminder of how powerful raw domain authority still is. Google is instantly trusting these pages just because of the domain they're on:\n\n* `duke.edu` (specifically `covididr.duhs.duke.edu`)\n* `michigan.gov` (specifically `mienviro.michigan.gov`)\n* `ca.gov` (specifically `meetings.ctc.ca.gov`)\n* `wayne.edu`",
    "subreddit": "SEO",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 301,
    "downs": 0,
    "created_utc": 1757629198.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.137555962964279
  },
  {
    "score": 291,
    "title": "Google Killing Industry",
    "selftext": "I have been in the industry for over a decade. I have always had long-term, high-value clients from Raptive and Mediavine Network for content writing. Recently 80% of my clients have either terminated the contract or revised it down significantly.\r  \n\r  \nSince the Helpful Content Update in September, sites have been struggling. Now they have collapsed significantly. I am not talking about spam or niche sites being deindexed. They are not deindexed but down more than 50%. All of my clients are experts in their domains. Most of them rely on advertising income, not through affiliation. These are decade-old sites with nothing to do with AI or any black hat SEO tricks. Most of them are still ranked on the first page for many keywords, but since Google made significant changes in the SERP, the traffic is down even with the same ranking.\r  \n\r  \nI'm sure some people still think Google as virtuous and they might be generalizing all bloggers as spammy who were affected by these updates. However, if we look at the keywords, it's evident that Google is rewarding Reddit, Quora forums and penalizing small and medium bloggers. I feel like my whole decade-long career has gone to waste.",
    "subreddit": "SEO",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 291,
    "downs": 0,
    "created_utc": 1712230717.0,
    "media": null,
    "is_video": false,
    "num_comments": 277,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.384905249407456
  },
  {
    "score": 275,
    "title": "Google removing number=100 is actually good news for SEOs",
    "selftext": "Google didn't remove num=100 because bots were scraping results to automate content creation... Google isn't threatened by them.\n\nIt removed num=100 so that ChatGPT, Perplexity and Claude can't use SerpAPI or whatever scraper to give better answers than Google itself. \n\nChatGPT was doing a better job of going through the top 100 results and finding the most relevant answer to users' questions, and bypassing Google's entire business model of Ads.\n\nGoogle was threatened by these AI tools, and has now restricted them to the top 10 results. \n\nWhat that means for SEOs is that AEO/GEO will default down to Google page 1 in the next few weeks/months, which means traditional search optimization and rankings will still be the most important criteria for ranking on Google, ChatGPT and Perplexity.",
    "subreddit": "SEO",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 275,
    "downs": 0,
    "created_utc": 1758453435.0,
    "media": null,
    "is_video": false,
    "num_comments": 141,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.237053254256746
  },
  {
    "score": 270,
    "title": "The greatest trick Google ever pulled was convincing everyone that all small content creators are blog spammers.",
    "selftext": "The amount of gaslighting since HCU hit has been incredible.\n\n\"Niche site? Well, you're probably an affiliate spammer or made-for-Adsense. Not a niche site? Well, we don't like websites that touch on too many topics. That seems like \"written for search\" spam to us.\n\nThe reason your rankings tanked is because your content is bad, but that content is good once it's been copied and pasted on a social media site.\n\nOh, you have ads on your site? Well, that's bad. We don't care if it's only one small unit that is halfway down the page and barely covers your hosting costs. This article from a large news website that has an ad after every paragraph is better.\n\nWhen big sites use ads, it's called generating revenue. When small sites use ads, it's called made-for-Adsense.\"\n\nUnreal.\n\nYou have other SEOs cheering on the demise of small publishers because 1) they work in e-commerce or local and therefore aren't impacted by these updates, and 2) they drank the koolaid and genuinely believe that these updates are only impacting those typical over-optimized SEO spam blogs that used to place the answer halfway down the page. That, or their traffic was already so low that they barely noticed the dip.\n\nNews flash: every small content creator is getting pulled down by proxy. Bit by bit, independent publishers are being phased out and replaced by large corporations.\n\nWhen HCU first hit, I came here looking for answers. One comment linked to a tweet from John Mu, who was basically painting all \"niche site\" owners as spammers who rip content from Reddit. I will always remember that tweet because it perfectly encapsulated the search team's view of small publishers. Everything since has just been gaslighting nonsense that is designed to convince us that we are the sole cause of our problems.\n\nTo put it in perspective, there has been no tangible evidence that any HCU-hit sites have recovered.\n\nDo you honestly believe that not one small publisher has managed to increase the quality of their content in the last seven months?\n\nOh, and don't worry. Your industry might be safe for now. But if you're too small to sue, they'll eventually come for you as well.",
    "subreddit": "SEO",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 270,
    "downs": 0,
    "created_utc": 1712052942.0,
    "media": null,
    "is_video": false,
    "num_comments": 213,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.280676177549001
  },
  {
    "score": 264,
    "title": "A Few Things That Finally Clicked About Authority, Topics, and How Google Actually Ranks Pages",
    "selftext": "I’ve been lurking here for a while, and the discussions have been more useful than most courses or blog posts, so I wanted to share a few things I’ve learned by simply paying attention. None of this is theory-crafting. It’s just pattern-matching from what people here consistently repeat, especially around topical authority, PageRank, and why Google behaves the way it does.\n\nOne thing that finally clicked for me is that every keyword you enter puts you into a topical space, and every key phrase you get clicks for is topical authority. That’s the whole definition. It doesn’t require a mystical map. Google sees clicks in a topic → you gain credibility in that topic. You expand the topic footprint → you expand the authority footprint. It's all mechanical.\n\nAnother big thing is how page-level everything is. PageRank isn’t a domain system; it’s a page system. Pages accumulate their own authority, their own relevancy, their own graph of signals. That’s why canonicals exist. That’s also why cannibalization exists. Multiple pages from one domain can claim the same keyword and block each other. There is no “domain ranks for X.” The domain only provides a baseline; the page competes.\n\nSomething else that shifted my thinking is the idea of topical bridges. Not everything sits in clean silos. Topics overlap in odd directions. If you publish inside one topic and start getting clicks, you can stretch into adjacent ones by linking and writing in the direction you want to expand. The web isn’t a neat taxonomy; it’s closer to overlapping circles. If people who search one query also commonly search another, there’s a bridge there whether you acknowledge it or not.\n\nThere’s also a practical point about metrics that get over-romanticized. People obsess over backlink counts and DR or DA, but these behave in non-linear ways. Losing a bunch of backlinks while shipping content within a tight topical band can still send traffic estimates up and even move DA. These metrics are just reflections of what the tools believe your “authority” might be. If a tool sees your traffic rise within a topic, it may interpret that as an authority gain even if your backlink graph shrinks. It’s all an approximation of PageRank, relevancy and behavioural hints.\n\nThe thing I’ve come to appreciate most is why Google isn’t and can’t be a content appreciation engine. It’s not designed to read content like a human and award points for craftsmanship. That would be philosophically appealing but operationally pointless. Search isn’t an art competition. Google’s job is to rank pages by utility, not by literary quality. Utility is measured by external signals, not internal admiration. YouTube is a perfect example. Google doesn’t “watch” videos to decide which are good. It pays attention to user behaviour because that is the only scalable, cost-effective, real-world indicator of usefulness. It can’t hand-score the internet, so it relies on the traces left by humans.\n\nThis is also why backlinks still matter. They’re not decorations. They’re real-world endorsements. They are proof that someone, somewhere, pointed at your page and said, “This is worth directing others to.” And clicks behave the same way. A click is a vote with time and attention attached. When you combine those two, you get a workable proxy for trust. Not perfect, not philosophically pure, but functional.\n\nSo the engine doesn’t reward content quality in isolation. It rewards the echo of that quality. Links, clicks, repeat interactions: things that only appear when a piece of work has actual utility. That’s probably why SEO still reduces to the boring fundamentals: be relevant, publish consistently within your topical space, and build or earn the kind of links that show someone else found the work valuable.\n\nI’m sharing this mostly as thanks to everyone here who breaks things down without the usual noise. There’s a lot of mythology around SEO, but when you strip it down, the system is far simpler and more mechanical than people assume. And that’s good. Mechanical systems can be reasoned about. They don’t require faith, just observation.",
    "subreddit": "SEO",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 264,
    "downs": 0,
    "created_utc": 1763454572.0,
    "media": null,
    "is_video": false,
    "num_comments": 152,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.258091589345607
  },
  {
    "score": 248,
    "title": "The Verge has gone nuclear against Google and SEOs",
    "selftext": "This is the intro to their post that's ranking #4 for \"best printer\".\n\n\"It’s been over a year since I last told you to just buy a Brother laser printer, and that article has fallen down the list of Google search results because I haven’t spent my time loading it up with fake updates every so often to gain the attention of the Google search robot.\n\nIt’s weird because the correct answer to the query “what is the best printer” has not changed, but an entire ecosystem of content farms seems motivated to constantly update articles about printers in response to the incentive structure created by that robot’s obvious preferences. Pointing out that incentive structure and the culture that’s developed around it seems to make a lot of people mad, which is also interesting!\"",
    "subreddit": "SEO",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 248,
    "downs": 0,
    "created_utc": 1712691340.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9902933605988364
  },
  {
    "score": 246,
    "title": "Started working in an Agency and I'm stunned by the lack of knowledge",
    "selftext": "Been a f-lancer for many, many years. Had a pretty bad injury a few years back so took an SEO job recently at a well known Digital marketing agency and i'm stunned at their lack of knowledge/ skills. Are all agencies like this?\n\n1. Digital marketing manager has only a basic understanding of meta data, that's it.\n2. 1x junior assistant responsible for all dm project tasks/ reporting\n3. Web dev builds sloppy, slow template websites in WordPress, sell for ($x,xxx)\n4. Clients on the books for 3 years that aren't even setup on search console\n5. One campaign is 7 years old and is not even ranking on Google\n6. No link building (risky), no content unless they pay more (and then they get AI slop), no new pages (unless they pay more)\n7. Basic keywords research (anything slightly relevant with traffic)\n8. Just monthly reports and random 'tasks' to look busy w/ no results for **years**\n\nI have never been so embarrassed during a client call, the lack of knowledge on our side of the conversation. I had to chime in over two levels of management to explain the purpose of canonical tags (one of which was the Digital marketing manager of 10 years). I expected 6 professionals to wipe the floor with a single f-lancer but their just a bunch of disorganised people that don't know anything outside of their direct task or how it relates to other tasks, or even seem to care.\n\nThis is my first time working inside an agency, is this common?",
    "subreddit": "SEO",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 246,
    "downs": 0,
    "created_utc": 1752912030.0,
    "media": null,
    "is_video": false,
    "num_comments": 174,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.264215977602813
  },
  {
    "score": 227,
    "title": "How many people here actually make over $20k/month from SEO?",
    "selftext": "I feel this sub is littered with garbage from Upworkers. \n\n\"buying backlinks doesn't work\"\n\n\"AI content doesn't rank\"\n\nThis sub needs to start verifying sites and applying flairs for those who manage sites with over 100k UVs.\n\nToo much garbage being shilled from people who have no idea what they're talking about then it just snowballs in some of these threads. Saw a few people get into it and some guy was like \"I ranked for my first keyword the other day\" then why tf are you giving advice\n\nThen there was the Payne dude who owns a well-known agency in the US, have come across him multiple times in my 14-year SEO career, with some $0 noob ripping on him saying he doesn't know shit. smh. \n\n/rant",
    "subreddit": "SEO",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 227,
    "downs": 0,
    "created_utc": 1684164838.0,
    "media": null,
    "is_video": false,
    "num_comments": 198,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.2198613852053075
  },
  {
    "score": 218,
    "title": "Fuck Google!",
    "selftext": "I mean, EEAT is a big fake! I survived every update, got very big strong natural backlinks recently and now google FUCKS my whole traffic! I diversified:\n\n- 2k daily clicks from Google\n- 300-400 daily clicks from Pinterest\n- big email list (luckily)\n\nI mean. These non-transparent, nothing-saying updates are just a big BS to push big sites, to do more profit. FUCK Google!! Like any other „too big“ company who fucks up us lil ppl. \n\nI just want a good life, nothing big, just a lil bit of travel, no employee life. but now its over. \n\nThanks for reading. ",
    "subreddit": "SEO",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 218,
    "downs": 0,
    "created_utc": 1724172856.0,
    "media": null,
    "is_video": false,
    "num_comments": 161,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.105201622111434
  },
  {
    "score": 220,
    "title": "ChatGPT Plus Is Secretly Google-Powered - My “Hidden Page” Experiment Proves It",
    "selftext": "# TL;DR\n\n* **Paid ChatGPT search uses Google Search.**\n   * A dummy page indexed *only* in Google showed up in ChatGPT Plus results within hours.\n   * The same query in Bing, DuckDuckGo, etc. still returns zero results.\n* **Free ChatGPT ≠ Google** ***or*** **Bing.** Its results barely overlap with either engine - likely OpenAI’s own experimental index.\n* **Query-overlap test:** on 50 queries, domain overlap with Google is \\~70 % vs &lt;30 % with Bing; snippet-token overlap tells the same story.\n* **OpenAI’s docs list “Bing &amp; Shopify” as third party search partners but never mention Google.**\n* For SEOs that means: *ranking in Google is now a prerequisite for ranking inside ChatGPT answers.*\n\n**Proof #1 - Sting-page proof**\n\n1. I coined a nonsense word.\n2. I then put it on a page **not linked anywhere**.\n3. Forced Google to index it via Search Console; left all other engines unaware.\n4. Asked ChatGPT Plus to define the term → it *quoted my hidden page verbatim*.\n5. Ran the same query in Bing, DDG, Yandex → no results\n\n**The only place ChatGPT could have found the page was Google’s index.**\n\n**Proof #2 - Overlap analysis**\n\n**Method:** captured ChatGPT’s own search calls via DevTools → ran identical queries in Google &amp; Bing → compared domain lists + tokenised snippets.\n\n|Metric (50 queries)|vs Google|vs Bing|\n|:-|:-|:-|\n||\n|**Search-result overlap** (domains)|**0.72**|0.28|\n|**Snippet token overlap**|**0.66**|0.24|\n\n36% of the queries had a snippet token overlap of &gt; 80% with Google. Its extremely unlikely that any other search engine can have such a high snippet token overlap with Google.\n\nWhat this means for SEO\n\n* **SEO &amp; AEO converge again.** If you don’t rank in Google you probably won’t surface in ChatGPT answers.\n* **Privacy.** Paid users’ prompts are silently routed to Google servers, despite no public partnership announcement.\n* **Free ChatGPT = peek into a new search engine.** Its divergent results hint at OpenAI dog-fooding an in-house search engine (good news if you’re betting on “third index” diversity).\n\n*About me*: ex-Google Search infra eng → now building ACME.BOT an AI SEO writer (no pitch here, just context).",
    "subreddit": "SEO",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 220,
    "downs": 0,
    "created_utc": 1752959806.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.053254076329535
  },
  {
    "score": 207,
    "title": "Google confirms normal SEO works for AI Overviews",
    "selftext": "**Gary Illyes** just confirmed at Search Central Deep Dive what many of us suspected: AI Overviews use the same ranking systems as regular search. **Normal SEO is all you need.**\n\nHad 2 of my old clients leave recently because they wanted \"GEO specialists\" after hearing \"GEO is the new SEO\" from bigger agencies. Explained this exact point but they went with the hype.\n\nGoogle uses identical crawling and indexing for both regular search and AI Overviews. Also confirmed they're not using LLMS.txt files despite all the buzz.\n\nTurns out the fundamentals we've been doing all along are what actually work. Quality content, technical optimization, authority building - same as always.\n\n**Sometimes the boring answer is the right answer.**\n\nAnyone else dealing with clients chasing the latest acronyms over proven fundamentals? How are you handling the hype cycle?",
    "subreddit": "SEO",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 207,
    "downs": 0,
    "created_utc": 1753503291.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.111698982790644
  },
  {
    "score": 201,
    "title": "Proud of my results as a non expert and want to share and say thanks!",
    "selftext": "I posted about my SEO efforts about 5 months ago and I had such a warm response from everyone that I kind of wanted to provide an update. I had both shared my results and asked for advice on next steps and well... it's working. I hope this doesn't come off as bragging, I just find this community both so supportive and helpful.\n\nI run a video production company in Boston and for the first few years of our business most of our clients were recommended to us / booked via word of mouth. Over the last year I really started to take my company's SEO seriously. From writing a few blogs every week to fixing things like H1s and a whole lot in between I just started to work at it for about 2 hours every day.\n\nBack in January I was so proud because we had more traffic to our website and I was like man, maybe this will lead to booked jobs soon! WELL thanks to a lot of advice I got from you all on that post our impressions and clicks have sky rocketed. In just the last month we have gotten over 21 form submissions and booked over 10 jobs via people who found us on google.\n\nThings that I've been working on not only in the last few months, but the last year:\n\n* Writing blog posts that got attention on google\n* Building individual service pages for everything we do\n* Using Google Search Console and GA4 to figure out what was working\n* Fixing technical stuff in Squarespace\n* Learning how to write and inject structured data. To be honest, I use chatGPT to help me write this code. I then take it to Google Rich Results and test it and go back and forth with ChatGPT to make sure it's perfect.\n* Internally linking like a maniac\n* Getting every client to leave a Google review\n* Asking other video production companies around the country to take meetings with me and learn more about who they are. If we think we're a good partner to work together on something in the future we will both write a really detailed blog about one another for backlinks. I'm very careful about this and admit that backlinks are my weakest subject\n* Updating our Google Business Profile weekly with posts and photos\n\nI've attached some photos in the comments from the last 16 months of data. Now I'm working to improve my CTR but ya anyway thank you all so much for being so cool and helpful! xoxo!",
    "subreddit": "SEO",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 201,
    "downs": 0,
    "created_utc": 1746566954.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.036713172091048
  },
  {
    "score": 188,
    "title": "Reddit beats any Keyword Research Tool",
    "selftext": "When working with niche SAAS Products, it is difficult to figure out a content strategy because there is a lack of data on tools. I have personally spent hours looking at GSC, Ahrefs, and Semrush for topic research and to find low-competition relevant keywords for various clients.\n\nBut at the same time if you make one simple search using the site operator on Google,\n\n`“site: reddit. com [your topic of interest]`\"\n\nYou immediately have a bunch of discussion threads around your topic.\n\nThis has worked great for all the niche B2B saas products we are working on\n\n* It shows actual topics of discussion and content-generation opportunities\n* It gives you direct user pain points that people are searching and discussing about\n\nThe interesting part is that Reddit does not just give you keyword ideas but a whole direction on how you can sell and place a certain offering. This is something keyword research tools would almost never show you.\n\nAfter seeing that this worked, I took it a step further and created a basic scraper using Python and Reddit's API to scrape these topics in bulk. It is now one of the crucial tools we use during research for any project.",
    "subreddit": "SEO",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 188,
    "downs": 0,
    "created_utc": 1738962602.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8735997389736387
  },
  {
    "score": 187,
    "title": "Google killed \"small\" entertainment blogs (real stories) ",
    "selftext": "I didn't even want to make this post, but for anyone considering starting a blog for profit, especially in the entertainment niche, I have some cautionary advice. Organic traffic for small and even medium blogs is at an all-time low.\n\nI've spoken to over 10 people who have been blogging in this niche for over 5 years, and they all share a similar story: with each Google algorithm update, they've lost a significant portion of their traffic. Each \"helpful\" update seems to have further stifled their blog's growth (including mine).\n\nPeople who once had close to or even over 500k monthly views, running their blogs with a small team or even solo, have lost 90% of their traffic from Google. Interestingly, these same sites still rank highly on Bing and other search platforms.\n\nAnd before you come to me with Google bs advice, don't even bother. It.does.not.work. ",
    "subreddit": "SEO",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 187,
    "downs": 0,
    "created_utc": 1717216109.0,
    "media": null,
    "is_video": false,
    "num_comments": 187,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.09373677389552
  },
  {
    "score": 188,
    "title": "Google owes you NOTHING",
    "selftext": "Google exists to gather user data and sell that to advertisers. Web owners do not pay google and are not important for anything they do. If they send you traffic be grateful, but they don't need you. You are replaceable.\n\nGoogle needs to keep users happy so they can sell more ads. If users get bad results they leave Google. Goggle continues to update their algorithm to provide better results. Affiliate sites are NOT good results.  They have found a way to eliminate affiliate sites from the SERP and it's better for the user so it's better for Goggle,  \n\nStop your winging and start providing real value to the searcher.  And no, this does not mean your mom likes your recycled posts.\n\nGoogle owes you NOTHING!",
    "subreddit": "SEO",
    "upvote_ratio": 0.73,
    "subreddit_type": "public",
    "ups": 188,
    "downs": 0,
    "created_utc": 1712369269.0,
    "media": null,
    "is_video": false,
    "num_comments": 172,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.942984855737642
  },
  {
    "score": 186,
    "title": "Google is no longer a Search Engine, it's an Answer Engine",
    "selftext": "Google's aim is zero click search results. They rip off content then keep you on their domain with \"people also ask\" which rips off even more content. They are no longer a search engine to find websites, they are an answer engine. Yes, we can rank top 3 in SERPs and get zero clicks. It will only get worse.  \n\n\nThe new game is create content that lives on other platforms and not your domain.  That's what Google is doing just like social media companies are doing (twitter, facebook, etc.) where they don't highlight posts with links in feeds, and with 'x/twitter' even hide the urls which make it look like the image isn't a hyperlink.  \n\n\nGoogle, like these other platforms, are taking all of our content and putting it on their domain. That's why I don't 'do SEO' anymore. It's a fools errand. I did it for 17 years. The game has changed where the people who have the audience are not incentivized AT ALL to send them to you.  \n\n\nIf you enable AI labs you'll see...ripped off images from other websites at top which takes numerous clicks to actually go to the website, an AI result which generates content from numerous sources then selects \"see 'x' for more details\" which takes two clicks to actually get to the website (and btw is often NOT the 1st SERP), then followed up with advertisements, then 'people also ask' which is even more stolen content. And oh yeah, if you're on mobile the second page of results is replaced with Google Discover.   \n\n\nThis is just crazy...I can't believe Google still refers to itself as a search engine. And this stuff about \"Google's Helpful Content Update Does Not Yet Find Hidden Gems\" is absolutely laughable. Really..Google...you're telling us that 'hidden gems' which was what you did in the first place will be coming at some point in time again? wow...  \n\n\nIt's very obvious that Google has focussed the majority of their efforts on profits by creating margins from previously free tools they've offered. Think the 'forever free' email we had for years that's now only available at a fee (for which they recently lifted the charges), that Universal was replaced by GA4 which is something that legitimately requires the use of BigQuery to get the same features. Think also what they have done with AdWords (Google Ads now) where longtail queries would be pennies and now cost a dollar, the quality of search results based on profit, etc. etc. The list goes on and on...  \nAnyhow, what I couldn't figure out is this: Why would Google risk their reputation as being synonymous with the internet for just a bit more profit? Yes, we are talking billions upon billions of profit..but wouldn't you want to keep the brand where someone thinks of the internet and they think Google?  \nThe best I can figure is that Alphabet knows that they are going to eventually, and potentially sooner versus later, be forced to split due to US political views on monopolies. And if you know the end is coming, then this is the time to SQUEEZE as much profit as you can. Just a thought...but maybe this also explains all of these rapid release changes the last 30 days?  \nAnother random share: I initially was focusing on all the ways that Google has been increasing profit margin through increased costs. I hadn't considered the other end of increasing margins which are lowering costs.  \nIt costs money to index the internet based on quantity of pages. It also costs money to sort results for queries. Perhaps this is why some of us struggle with getting our content indexed. If the search volume is low, Google just doesn't bother to cater to those searches. I know there is some proof to this line of thinking...the person who introduced 'suggested searches' or type-ahead suggestions as you type your query is brilliant for many reasons - one of which is directing people to cached filtered results. Lower costs.  \nAnyhow, if it's true that the company is forced apart, then it could result in a big relief for webmasters.",
    "subreddit": "SEO",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 186,
    "downs": 0,
    "created_utc": 1697613411.0,
    "media": null,
    "is_video": false,
    "num_comments": 152,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.024187321945298
  },
  {
    "score": 182,
    "title": "Google is overhyping Reddit and Quora.",
    "selftext": "Any long-time Reddit user will know that this place has some of the worst takes around. I've been here on multiple accounts since 2010, and it's slowly gotten dumber over time.\n\nThere are maybe 2-3 topics that I am very knowledgeable about, and the subreddits for those topics are a sh\\*show. I try to avoid looking at them because challenging the constant flood of misinformation is like playing Whack-A-Mole. This is why many experts tend to leave these subreddits after a while. Reddit is kind of like Chat GPT. The content seems great until you ask it about a subject that you have some expertise in. That's when you start seeing blatantly incorrect information hidden among the facts.\n\nEven members of the Google search team publicly said that this place has some questionable takes, so why the sudden push to appease \"the cool kids\"? Anonymous Reddit posters have nothing to lose if they post incorrect stuff. If Johnny783764 gets called out on it, he can just delete his comment and pretend like he never said anything. In many cases, he won't get \"fact checked\", as most Redditors are so lazy that they will comment on a news story without reading the article.\n\nAs for the true crime subreddits? You'd get less gossip in a knitting circle.\n\nI add Reddit to my Google searches in specific cases. But I want to choose those cases, not have it shoved in my face.\n\nAs for Quora? It has the most confusing, dogsh\\*t design I've ever seen. You click on an answer, and the next thing you know, you're reading an answer to an entirely different question. Some of the most highly upvoted answers on it are terrible.\n\nI get that they're trying to cut out the SEO spam stuff, but surely there's a better way to do that than to hype up user-generated content? Where did EEAT suddenly go?",
    "subreddit": "SEO",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 182,
    "downs": 0,
    "created_utc": 1704741474.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.012403645450128
  },
  {
    "score": 183,
    "title": "Is Google Playing With Us?",
    "selftext": "Here’s what I’ve noticed.  \nThe AI wave started with chatgpt and people flooded the serps with ai content. And the funny part is that the stuff ranked pretty well for a while.  \nThen boom 2023 hits and google drops some of the harshest updates ever. Suddenly it’s all about human experience and personal research and cleaning up ai spam.\n\nSo we all adapt we write better we do the work. and now they’re using our content in ai overviews without sending us the clicks.  \nFeels like we cleaned up the mess and they took the reward.\n\nThat’s my take and honestly curious how you guys feel about this whole shift.",
    "subreddit": "SEO",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 183,
    "downs": 0,
    "created_utc": 1751812168.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9119336828750244
  },
  {
    "score": 178,
    "title": "I Analyzed Canva's SEO Strategy and Found Something Interesting",
    "selftext": "**TL;DR:** I analyzed Canva's SEO strategy - they're getting 700M+ traffic/month by optimizing for user problems rather than just keywords. Their product-led SEO approach focuses on \"jobs to be done\" instead of traditional keyword targeting.\n\n# The Numbers:\n\n* 700M+ total monthly visits\n* 25% from organic search\n* 2x Adobe's total monthly traffic\n* Zero reliance on paid advertising\n\n# Core Strategy Breakdown:\n\nInstead of optimizing for generic terms, Canva targets specific user problems:\n\n1. **User Intent Mapping:**\n   * Target keywords like \"Create professional resume\" instead of \"resume maker\"\n   * Target keywords like \"Design Instagram post\" instead of \"social media tool\"\n   * Target keywords like \"Make wedding invitation\" instead of \"invitation designer\"\n2. **Technical Implementation:**\n   * Template-level SEO optimization\n   * Descriptive alt text for template library\n   * Individual landing pages per design category\n   * Immediate product access (no signup wall)\n3. **Conversion Flow:**\n   * Search on Google → Template Gallery → Instant Editor Access → Value Demo → Natural Signup\n\n# Why This Works:\n\n* Users get immediate value before hitting signup wall\n* Product becomes the landing page\n* High conversion due to demonstrated value\n* 24/7 organic user acquisition\n\n# Key Insight:\n\nTheir success isn't about traditional SEO metrics - it's about mapping search intent directly to product solutions.\n\nWould love to hear if others have seen similar product-led SEO approaches in other industries! Which companies are doing great that use SEO as their primary growth channel?",
    "subreddit": "SEO",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 178,
    "downs": 0,
    "created_utc": 1734936909.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.749244959339761
  },
  {
    "score": 176,
    "title": "We've gone full circle with AI.",
    "selftext": "When ChatGPT first came out, I was honestly blown away at how good it was at writing articles, landing pages, etc. Anyone who found out about it had a huge advantage.\n\nBut I think we've gone full circle where natural writing has a huge advantage over AI. Whenever I see an AI-generated blog post, I instantly click off of it.\n\nGoogle has been rewarding my blog posts that I carefully took time to write, and interject my own humour and personality into.\n\nWhat do you think about the future of AI and SEO (in terms of content creation)?",
    "subreddit": "SEO",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 176,
    "downs": 0,
    "created_utc": 1699988065.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.01814015060931
  },
  {
    "score": 176,
    "title": "Why i hate GA4 so much?",
    "selftext": "Even after months, i still don't understand what Google tried to do with GA4.\n\nI cry every time i want to do something new, nothing is clear and everything is unnecessarily complicated.\n\nI miss UA so much and, as a simple online business, I feel I am simply not the target anymore. GA4 is simply for agencies, not for me.\n\nThis morning, i just wanted to check the trafic for one single page with a clear chart. It's for a client. And even that, it's a nightmare. Because GA4 is not made for simple things. \n\nAm i alone to have the same nostalgy for UA?\n\nAm i alone to think the communication around GA4 is a massive disaster by Google?",
    "subreddit": "SEO",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 176,
    "downs": 0,
    "created_utc": 1680172876.0,
    "media": null,
    "is_video": false,
    "num_comments": 113,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.003925692030043
  },
  {
    "score": 176,
    "title": "Ecosia and Qwant are partnering to build a European search index and reduce their dependence on U.S. Big Tech firms.",
    "selftext": "*Ecosia and Qwant, two search engines competing with Google, announced a partnership Tuesday to build a European search index and reduce their dependence on U.S. Big Tech firms.*  \n  \n*The two internet search firms agreed on a joint venture, called the European Search Perspective or EUSP, with ownership split 50-50 between both firms. With a view to launch in France in early 2025, the venture aims to serve “improved” French and German language search results.*  \n  \nSource: CNBS\n\nWhat's your thoughts guys?",
    "subreddit": "SEO",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 176,
    "downs": 0,
    "created_utc": 1732530223.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4600945210814693
  },
  {
    "score": 173,
    "title": "What's even the point in trying anymore?",
    "selftext": "SEO is just one part of a much wider role for me and I'm by no means an expert, so I rarely look on this sub - apologies if the same thing has been said 1,000 times, but I need to vent. \n\nWhen doing some year-on-year analysis of web analytics I noticed our site had taken a fairly decent hit in organic search traffic, so I pulled a load of Search Console data and started looking at terms where the click have dropped significantly compared to the same period last year.\n\nTime and time again it showed that average position had improved and impressions had improved. So I put these terms into Google in an incognito window and my god, I hadn't realised just how insane the results pages have got.\n\nOne term (a very big one for us) ranks on average in the top 4 and has had a 66% increase in impressions year-on-year, but clicks are down 50%. I looked at the SERP and this was the order of the page:\n\n* AI Overview\n* Videos\n* People Also Ask\n* **Organic Result 1**\n* Find Results On *(no sites were sites that feature organically on the first page of the results)*\n* Businesses map/listings\n* **Organic Result 2** ***(our site)***\n* **Organic Result 3**\n* **Organic Result 4**\n* Images\n\nFucking hell, the first 10 items feature 6 SERPs features and only 4 organic results. I'm by no means saying it's the entire reason organic traffic is down, but it just feels like even when we do everything right that still isn't enough. \n\nIt's just so demotivating.",
    "subreddit": "SEO",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 173,
    "downs": 0,
    "created_utc": 1749472681.0,
    "media": null,
    "is_video": false,
    "num_comments": 120,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.016941933440825
  },
  {
    "score": 173,
    "title": "I'm done with SEO, want to transition to PPC/Meta",
    "selftext": "Hi everyone,\n\nI’ve been doing SEO for about 7 years now. I’ve worked on many projects, learned a lot, trained beginners, and helped clients generate millions in revenue. But honestly, I think I’m done with SEO.\n\nEven though I’m currently focused on local SEO, I have to admit—it’s become exhausting. It feels like a constant battle with Google just to maintain sustainable rankings. And even when you manage to hold those rankings, AI overviews end up taking away a big chunk of the clicks. Many clients have already lost 20–50% of their traffic, they’re hesitant to invest further, and often, we get blamed for results that are increasingly out of our control.\n\nI feel drained from having to explain that SEO works this way—that you can’t stay #1 forever, that Google’s updates are unpredictable, and sometimes, sites get hit for no clear reason but recover once the update stabilizes.\n\nAnyway, this isn’t meant to be a rant.\n\nI’m planning to transition into Google and Meta Ads. I enjoy communicating with clients, doing reporting calls, and handling the strategic side of things, so that part’s fine.\n\nWhat I need is a clear roadmap for getting started. Should I learn the basics first and then look for internship opportunities, or should I start offering free freelance work to build a portfolio?\n\nI’m a bit confused about the right path forward and would really appreciate some guidance.\n\nAlso, if anyone can share resources for beginner to intermediate learning for Google and Meta Ads, that would be super helpful.\n\nThank you!",
    "subreddit": "SEO",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 173,
    "downs": 0,
    "created_utc": 1762008594.0,
    "media": null,
    "is_video": false,
    "num_comments": 164,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.076791220389553
  },
  {
    "score": 173,
    "title": "Rant time - SEO",
    "selftext": "I run a 7-figure marketing agency that’s super niched in a specific industry, and while business is great, I’m seriously blown away by how hard it is to find solid SEO help.\n\nI’ve hired in-house for $70K–$90K/year with full benefits, PTO, 401k, the whole package, and they still can’t figure out how to do basic stuff like redirecting links or fixing 404 errors. Not talking strategy or high-level audits… I mean the bare minimum technical work you'd expect from someone in this role.\n\nSo I go the freelancer route, thinking maybe I’ll get better results. Instead, the simplest audit takes months to implement. Everything is \"in progress\" or \"SEO takes time.\" Like yeah, I get SEO isn't overnight, but fixing broken links isn’t rocket science.\n\nAt this point, I’m seriously wondering: is the SEO industry just this bad? Or am I hiring wrong? Do real SEO operators still exist? This digital marketing industy kills my soul.\n\nJust needed to vent and see if others are dealing with the same crap?",
    "subreddit": "SEO",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 173,
    "downs": 0,
    "created_utc": 1745434814.0,
    "media": null,
    "is_video": false,
    "num_comments": 231,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.15079324072805
  },
  {
    "score": 170,
    "title": "Apparently, I'm an SEO expert. Help needed.",
    "selftext": "So....I was just hired as an SEO expert. I don't know shit about it. Any suggestions? Limericks? I'm very nervous xd \n\nThe reason I was hired is because I said \"I am experienced in social media management\". (My experience is in content monitoring and analysis). They hired me. Now as I join on my first day, he said \"You're expert in SEO right\". I said \"Uhhuh...yeah 👀\". (I needed a job urgently)\n\n...anything helpful? Anything to calm the nerves or any resourceful links?\n\nEDIT: As far as I can tell in the first 8 hours, this team is chill. I have not told them that I don't know SEO but for now, the supervisor just told me 3 sites that they monitor. I am going to use some tools that the kind redditors mentioned below to do so. Thankyou, everyone!",
    "subreddit": "SEO",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 170,
    "downs": 0,
    "created_utc": 1686583639.0,
    "media": null,
    "is_video": false,
    "num_comments": 341,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.16750916342022
  },
  {
    "score": 167,
    "title": "If you search \"jfk death penalty\" on Google, the top result is some kid's homework on Google Drive...",
    "selftext": "The recent updates have been horrific. I searched for an actor's height the other day  and the top result was his Wiki page. Clicked on said result and found absolutely no info about his height. Literally no mention of height, feet, cm, inches, etc, anywhere in the article. WTF lol.\n\nI tried searching an exact term and Google kept showing me general overview stuff from high authority sites. Typical Forbes/Wiki/History.com content.\n\nI had to use quotes in my query to force it to give me the results I wanted.\n\nIs someone gonna get fired for this?",
    "subreddit": "SEO",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 167,
    "downs": 0,
    "created_utc": 1704494634.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.875339913421713
  },
  {
    "score": 165,
    "title": "Most writers are terrible at blog introductions",
    "selftext": "I spend hours explaining this to Writers every week   \n  \nNo one is Googling to hear about:  \n  \n\"The constant changes in the technological landscape\"  \n\"It's a common issue that many businesses face\"  \n“Today’s rapidly changing times”  \n  \nInstead of opening with:  \n  \n\\- Cliches  \n\\- Generalisations  \n\\- Sweeping statements  \n\\- School research paper-like monologues  \n\\- Rhetorical questions with obvious answers  \n  \nTake time to understand the reader.  \n  \n\\- Their journey to the post  \n\\- Their expertise level  \n\\- Their pain point  \n  \nImagine a small business owner searching for the 'best payroll software' to pay their employees more efficiently.  \n  \nThey don't need to be told things like:  \n  \n“Most growing businesses will need a payroll solution at some point in their lives.”  \n  \n\"Paying your employees accurately and promptly is one of the most critical elements of running a business.\"  \n  \nThey obviously know why they need the software, they're just trying to understand which is right for them.  \n  \nShow the reader that you understand them and their needs.  \n  \nAnswer these questions before writing the introduction:  \n  \n\\- Who is the reader?  \n\\- What are their pain points?  \n\\- How did they get to your post?  \n\\- What is the specific angle of your post?  \n\\- How is your post original and different from others?  \n  \nThen make sure your introduction is:  \n  \n\\- Written at the reader's expertise  \n\\- Straight to the point of the matter  \n\\- Clear on why they should read on  \n\\- Focused on the reader's problem  \n\\- Briefly mention what you do  \n\\- Short and concise  \n  \nThis ensures that when someone lands on the article, they get what they want and actually spend time reading it instead of just going back, increasing the bounce rate.",
    "subreddit": "SEO",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 165,
    "downs": 0,
    "created_utc": 1738610294.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8465647663614826
  },
  {
    "score": 162,
    "title": "Most business owners don't care about SEO until they lose 70% of their traffic in 12 days.",
    "selftext": "I worked on an ecommerce website for 1 year. Started with nothing and built the organic traffic to tens of thousands of visitors per month.\n\nAfter the year was up, I asked the owner if he would like to renew and he declined. He hired a \"marketing manager\" to take over the website, infrastructure, SEO, etc., and within 12 days the organic search traffic went from 7,260 on July 31 to 2,668 on August 12.\n\nI hate to say I told them so... because I worked really hard, but they made my job extremely difficult and I'm almost happy to see it all crash and burn.\n\nThey wanted to save a few hundred dollars per month and lost 70% of their traffic.\n\nI wish I could upload  a screenshot here...\n\nEDIT: To make it even better. All of the traffic they are currently getting is going straight to a 404 error page.\n\nEDIT 2: This was an ecommerce site. Every link was a different product page. This wasn't a blog or small business website.\n\nEDIT 3: They took down a headless WooCommerce site and put everything on an Ecwid Instant Site. Now they have no SEO at all except for some text on a page.",
    "subreddit": "SEO",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 162,
    "downs": 0,
    "created_utc": 1755185917.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8992266505919946
  },
  {
    "score": 163,
    "title": "Spent $60k on SEO over a year — no return, no cash left — need advice on what to do next",
    "selftext": "EDIT: I’m not talking bad on the company. They are highly reviewed and reputable in my city. I’m guessing I was part of the handful where the investment wasn’t the right one, in the right time, in the right economy.\n\n\nHello all,\nI own a small family painting business in Sydney, Australia. We bring in about $250k–$300k annually and have a team of three. A couple of years ago, I decided to get serious about marketing and invested in SEO.\n\nI went with a highly reputable SEO agency in Sydney. I told them our budget for the year (around $60k), and looking back now, I probably shouldn’t have done that. I feel like they just maxed out what I said I could afford, rather than guiding me toward a sustainable plan for a business of our size.\n\nI’ll be honest — I didn’t know much about SEO at the time. I trusted that the agency would help me grow slowly and steadily, but instead, we blew through the whole budget within the year with no real results. We didn’t even come close to breaking even. Since then, we’ve had no budget left for any marketing and it feels like that $60k just vanished.\n\nMore recently, I left a negative Google review to share my experience, and the CEO of the agency personally emailed me with a legal threat, saying my review was defamatory. They claim they did everything they promised and that I received what I paid for.\n\nI’m just angry and upset and frustrated — I expected a bigger return, or at least some noticeable growth.\nWas I wrong to have high hopes? Was I naïve to think $60k would significantly grow a small local business like mine through SEO?\n\nI’d really appreciate any advice on these points:\n\t•\tIs SEO even the right move for a small, local painting company like mine?\n\t•\tHow should I rebuild from here — where would you spend the next $5k–$10k if you were in my shoes?\n\t•\tWhat does a lean, smart SEO or marketing strategy actually look like for a trades-based business?\n\t•\tIs there anything I can do legally? Or any way to check if the SEO company actually did their job properly?\n\nThanks in advance to anyone who replies — I’m here to learn and make better decisions moving forward.\n\n(Ranted to Chat Gpt to clean up my thoughts)\n\nUpdate: company has given me a free 6 month plan.\nBut if they didn’t deliver the first time, I’m not expecting anything at this point…",
    "subreddit": "SEO",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 163,
    "downs": 0,
    "created_utc": 1748299218.0,
    "media": null,
    "is_video": false,
    "num_comments": 334,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.189866251566121
  },
  {
    "score": 163,
    "title": "SEO company said we would lose everything",
    "selftext": "I work for a small established remodeling company, and none of us are SEO experts. The company (part of Gannett) says we have good results, but we rarely see our name on searches. We thought we'd stop for a few months to see what would happen, but they said we'd lose our place that they have worked on for several years and that we wouldn't show up at all in a search. Then, when we start SEO again, we would have to start from the beginning. How does a business change to a new SEO company without throwing years of work out the window? Thank you for your advice!",
    "subreddit": "SEO",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 163,
    "downs": 0,
    "created_utc": 1744598244.0,
    "media": null,
    "is_video": false,
    "num_comments": 173,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.062618472188998
  },
  {
    "score": 162,
    "title": "Google March 2024 Core Update CONFIRMED",
    "selftext": "Today we announced the March 2024 core update. This is designed to improve the quality of Search by showing less content that feels like it was made to attract clicks, and more content that people find useful. We also shared that we have new spam policies to better handle the practices that can negatively impact Google's search results. In this post, we'll go into more detail for creators about both the update and the spam policies.\r  \n\r  \nOur March 2024 core update\r  \nThe March 2024 core update is a more complex update than our usual core updates, involving changes to multiple core systems. It also marks an evolution in how we identify the helpfulness of content.\r  \n\r  \nJust as we use multiple systems to identify reliable information, we have enhanced our core ranking systems to show more helpful results using a variety of innovative signals and approaches. There's no longer one signal or system used to do this, and we've also added a new FAQ page to help explain this change.\r  \n\r  \nAs this is a complex update, the rollout may take up to a month. It's likely there will be more fluctuations in rankings than with a regular core update, as different systems get fully updated and reinforce each other. We'll post to our Google Search Status Dashboard when the update is finished.\r  \n\r  \nThere's nothing new or special that creators need to do for this update as long as they've been making satisfying content meant for people. For those that might not be ranking as well, we strongly encourage reading our creating helpful, reliable, people-first content help page.\n\nSouce: Google Developer Blog",
    "subreddit": "SEO",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 162,
    "downs": 0,
    "created_utc": 1709661599.0,
    "media": null,
    "is_video": false,
    "num_comments": 206,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.097672777132416
  },
  {
    "score": 102,
    "title": "How Gtranslate Plugin Killed our 2M website",
    "selftext": "Hello, it's me, i am back. A lot of you asked what was the plugin used to make my website multilingual, it's Gtranslate. Here how it destroyed us and why you should NEVER install it.\n\nI decided to come here and warn all of you after my website is officially dead and we are pulling the kill switch, and go for bankruptcy or transfer the ownership. Going from 2 million pageviews (3.3M in july btw) to now less than 100k. \n\nQuick Recap. I have a niche website, for 6 years we were doing very well, over 10s of thousands keywords, over 4000 SERP, ranking 1-3 for 1000 keywords, rank 3 to 10 for 2500 keywords etc. \n\nWe decided to go multilingual and without doing much research we installed Gtranslate. Here how things went wrong. And before going into it. I would like to thank everybody who helped me when i first wrote about this and showed us all the spam that Gtranslate was doing to our SEO. \n\nFirst, we have around 20k articles, after Gtranslate, we ended up with 7MILLION links injected and resulted in Millions of errors in our search console. Bam Google flags us as a spam. Never happened ever. Even though we are a niche website we are established and have a lot of expertise about what we write about.\n\nOn bi-weekly basis, we were seeing Gtranslate indexing almost 1 million link injected into Search console. Links that don't exist or are not indexable in the main website. including code pages, admin pages etc. Then they did not properly tagged the languages, making english rank for spanish and chinese rank for french etc, so our bounce rate went through the roof. \n\nNo hreflang if you opt for translated slug and no canonical if you opt for none-translated slug. But at on google both slugs can be found on top of origin page that has nothing to do with the canonical, creating millions of duplicated content. \n\nTheir server is very unstable as well, our crawling fail rate went from 0 to 25%. 5xx errors, impossible to access erros, 4xx errors. It just flashing red everywhere.\n\nHere comes google, not only it deranked us, but totally removed us from Discover and limited our Google news traffic.\n\nAfter talking to their support, they just kept gaslighting us that everything is fine, all errors is us, and about the seo experts, that gave us all the audits about their unstable plugin, they said that these these experts don't know what they are talking about. We kept asking them to come to a solution and get things fix but they refuse to accept their spammy plugin. So we decided to pull the kill switch.\n\nDon't do our mistake. Do not translate Gtranslate plugin unless you want to kiss goodbye to your website. \n\nI have put screenshot of our dead traffic in comment section. \n\n",
    "subreddit": "SEO",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 102,
    "downs": 0,
    "created_utc": 1727377787.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7004901573375575
  }
]