[
  {
    "score": 548,
    "title": "Shop app got rid of dark mode?",
    "selftext": "Noticed the other day that the shop app is now locked in light mode and the only setting under appearance is \"confetti\". What gives? I know it might sound dramatic but I find the app so much harder to navigate now because I can't see anything. Everything else on my phone is in dark mode and my app was previously also in dark mode. It just changed itself. Anyone know if I'm missing something and there's a way to change it back?\n\nEdit: wow I was not expecting this to get the attention it did. As a chronic migraine sufferer I am with all of you who have a sensitivity to the light mode and as a 25-year old I share everybody's hatred for light mode in general. Their reasoning of \"not enough usage\" is total BS because I don't know a single person irl who uses light mode for anything. Sad to hear it was intentional, but I did see in the comments a link to submit a complaint about it so I would urge everybody to do that. https://shopify.link/bmyj \n\nThanks everyone &lt;3",
    "subreddit": "shopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 548,
    "downs": 0,
    "created_utc": 1728655335.0,
    "media": null,
    "is_video": false,
    "num_comments": 246,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.685920821079925
  },
  {
    "score": 536,
    "title": "Got Sued for $75k for ADA website claim. Didn't Settle. Won. AMA",
    "selftext": "Aight, I've been seeing a few of these ADA lawsuit posts on here and my heart goes out to all the entrepreneurs and operators who are dealing with these ADA claims.\n\nThe details:\n\n* Sued in NY by Mizrahi &amp; Kroup.\n* Plaintiff argued she was trying to buy Sea Salt Spray\n* We initially offered to settle for around $3k, they came back wanting $20k\n   * That pissed me off, so I stuck to that amount and told them the longer it progresses, the lower we'll be willing to settle for\n   * Eventually dropped the settlement offer to $1500, then was like ah fuck it, we're not settling\n* We had a terrible year last year, so it was all going to shit and figured I'd just go all the way to the bottom\n* Our law firm found a case that was dropped because plaintiff never contacted us before suing; so we used that in our defense\n* They eventually dropped after about a year of dealing with it\n* Our defense fees were \\~$15k and we're not going after lawyer fees\n* I'm interviewing my lawyer for my podcast next week and will ask him any questions I don't know the answer to here.\n\nI'll be heading to bed and working out in the morning. Will get to replying tomorrow afternoon. Be well!",
    "subreddit": "shopify",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 536,
    "downs": 0,
    "created_utc": 1726282396.0,
    "media": null,
    "is_video": false,
    "num_comments": 230,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.6617802756456275
  },
  {
    "score": 300,
    "title": "A plea to Shopify. From us small businesses.",
    "selftext": "Dear Shopify, many of your small businesses are struggling to manage credit card fees for payments, especially for already-discounted wholesale customer sales. Please, please PLEASE let us provide ACH payment as an option for lower tier plans. Your Plus plan is way out of reach for us.  \n\nIf you agree or support this, vote this post UP and comment. Trying to save small businesses here. Thanks in advance!",
    "subreddit": "shopify",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 300,
    "downs": 0,
    "created_utc": 1739379980.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.038204430394238
  },
  {
    "score": 213,
    "title": "We Need to Talk About Chargebacks. This System is Broken and Merchants Are Paying the Price.",
    "selftext": "I’ve hit my limit. And if you’ve run a Shopify store for more than 5 months, I bet you have too.\n\nLet’s talk about chargebacks because the current system is beyond broken. It’s abusive, one-sided, and honestly… a joke. And the worst part? It’s not changing. Why? Because no one is talking about how bad it really is and how bad it’s getting. \n\nI run a real business. We have clear return policies. We ship within 2-5 days in the US from our US store. We reply to every message within hours. We offer prepaid labels for returns. We give flexible resolutions. We do everything right. \n\nAnd yet… almost every week, a customer opens a chargeback.\nNot because something is wrong. Not because they reached out and we ignored them.\nBut because it’s easier to hit “dispute” on their bank app than to send an email or return the product.\n\nIn fact most never contact us even tho they get multiple emails from us for shipping and confirmations an delivery updates and the others contact us ask for a refund and as soon as we tell them you have to return but here’s a prepaid label they stop replying and open a chargeback instead. \n\nAnd we, the merchant, are the ones who pay the price:\n$15 fee before we can even defend ourselves\nDamaged dispute rate that hurts our Shopify score\nHours spent collecting evidence and screenshots\nAnd then pray that their bank will even review our 10+ pages of evidence which 50% of the time they don’t. \nThen we STILL have to send them to collections to recover what we lost\n(which, yes, we do because they deserve it and we are sick and tired of losing money because of shitty people)\n\nI spent 4 hours today just doing chargebacks. That’s half a day of work.\nThat’s time I should be using to grow my business not defend it against people who didn’t even bother replying to our return email. And guess what? All of them were BS from people not contacting us first to people asking for a refund but refusing to return it for a refund (and we include a prepaid return label btw!) \n\nAnd I know I’m not alone.\n\nEvery single chargeback I’ve received in the last 30 days has been completely baseless.\nWe show delivery proof. The customer never replies. They never return the item. They never even TRY to resolve it.\n\nYet the banks let them dispute it like it’s no big deal.\nNo evidence. No reason. Just a button. And we’re stuck footing the bill.\n\nLet me be clear:\nThis isn’t about better policies.\nThis isn’t about being a better business.\nThis is about a system that rewards bad customer behavior and penalizes merchants for existing.\n\nIf you’re dealing with this too, I want to hear from you.\nNot just to vent but because maybe it’s time we do something about it.\nBecause clearly Shopify, Stripe, PayPal, Visa none of them are going to fix it unless merchants push back together.\n\nWe need:\nBetter protection for small businesses\nA review system that penalizes false chargebacks and customers who take advantage of it\nReal consequences for abuse\n\nBecause right now? The scammers are winning. And we’re losing time, money, and our sanity.\n\nSo yeah I’m pissed. You should be too.\nLet’s stop pretending chargebacks are “just part of the game.”\nThey’re broken, they’re abused, and they’re driving good businesses into the ground.\n\nIm so sick and tired of these. And it’s funny that these same customers when they get sent to collections they ignore collections as well until they start reporting their credit score. Shopify devs (if you read this) please listen and help us merchants fight back. ",
    "subreddit": "shopify",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 213,
    "downs": 0,
    "created_utc": 1761857135.0,
    "media": null,
    "is_video": false,
    "num_comments": 360,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.32166737430202
  },
  {
    "score": 181,
    "title": "Need to vent. Shopify's Support is officially the worst it's ever been. Saddest part is 10 years ago Shopify Support was the best in class.",
    "selftext": "We are dealing with a minor issue I couldn't solve this morning so I reached out to the AI support chat.\n\nAfter a few minutes when the AI couldn't solve the problem it suggested I talk with a human and provided me a link to talk with human support.\n\nSeems simple enough, right?\n\nWRONG!\n\nIt takes me to a second AI where I explain that the first AI sent me here to talk to human support and I request to talk to a human. The AI denies that request - we rehash my issue - the AI still can't solve the problem so I ask again to connect me with a human.\n\nThe AI then tells me the following...\n\n*\"Shopify has updated its support system so that for most plans, including the Professional plan, the primary way to contact support is through the Help Center Assistant chat, which is available 24/7. Direct phone or email support is generally reserved for Shopify Plus or Retail plans.* ***This means that for your plan, human support is accessed by chatting with the Help Center Assistant first, which can then connect you to a human advisor if needed.***\n\n*If you're having trouble reaching a human advisor through the chat, try providing clear details about your issue and explicitly request to speak with a Support Advisor. This process helps route your request appropriately.*\n\n*So, while it might feel like an update has made it harder to contact a human, the chat assistant is designed to help triage and connect you to the right support based on your needs and plan type.*\n\n***If you want, I can help you draft a message to the chat assistant to increase your chances of reaching a human advisor.\"***\n\nThis is beyond contradictory, weird, and ultimately unhelpful. Two separate times the AI recognizes it cannot solve my problem - and it's only advice is to help me draft a message TO ITSELF to increase the chance that I can actually talk to a human.\n\nI remember the days when you could call up Shopify - talk to someone awesome who was super helpful - but now those days are gone.\n\nAbsolutely ridiculous - and I'm sure I'm not the only one facing these issues.\n\n**Update:**\n\nI am still in this chat as a personal mission now to connect with a human. I have asked to talk with a human at this point 9 seperate times - and the only help it has provided is either a link to a different AI - or suggesting it can write a prompt to increase the likelihood of talking to a human.\n\n**Final Update:** \n\nAfter 20 different iterations of asking to talk to human support (including suggestions in this thread) I am still no closer to talking to a human and ultimately solving my problem.  \n\nI need to get back to work - hopefully someone at Shopify reads this and realizes that this is not a one person issue - but a problem a lot of us face. ",
    "subreddit": "shopify",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 181,
    "downs": 0,
    "created_utc": 1756907988.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.076633687162305
  },
  {
    "score": 179,
    "title": "ChatGPT might be turning into a shopping platform and Shopify is behind it.",
    "selftext": "OpenAI is quietly building a shopping feature into ChatGPT, and all signs point to a full-on partnership with Shopify.\n\nA few developers recently found new code strings inside ChatGPT’s public files. Stuff like “buy\\_now,” “shopify\\_checkout\\_url,” and fields for price, shipping, and product ratings. These aren’t just placeholders. They’re showing up in both the web and Android app code, which usually means they’re close to shipping.\n\nIt looks like OpenAI is setting up a full shopping flow inside the chat. You’d be able to ask for a product, see reviews and pricing, then check out via Shopify w/o ever leaving the chat window. no clicking around, no bouncing between tabs. Just chat, browse, and buy.\n\nIf you’re a Shopify merchant, this is **massive**. You wouldn’t need to set up anything new. Your products could show up natively inside ChatGPT, ready for purchase, just like that. Shopify handles the checkout. ChatGPT handles discovery and recommendation.\n\nIt’s not just a cool idea — it makes sense when you look at where the industry is going. Microsoft already launched its Copilot Merchant Program. Perplexity has a one-click “Buy with Pro” flow. Shopify’s CEO literally told employees to “hire an AI before you hire a human” in a leaked memo. Everyone’s building for agent-led commerce right now.\n\nThe real opportunity here isn’t just AI shopping. It’s distrbution. Getting your product in front of the right customer is still the hardest part of ecommerce. If ChatGPT becomes a trusted shopping assistant, and Shopify is powering the backend, we’re looking at a new layer of the internet where purchase intent meets instant checkout.\n\nThere are still some big unknowns. Will this be pay-to-play for merchants? Will AI recommendations be accurate enough to trust? What happens if someone gets flagged or pushed down in results?\n\nBut if this rolls out the way it’s looking, it’s not a stretch to say that ChatGPT could become one of the most valuable ecommerce channels out there. No search. No scrolling. Just “what are the best wireless earbuds under $200” and a direct checkout link with zero friction.\n\nThe future of shopping might just be inside a chat window.",
    "subreddit": "shopify",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 179,
    "downs": 0,
    "created_utc": 1745339224.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.951691117455892
  },
  {
    "score": 173,
    "title": "A Guide to Prevent Fraudulent Chargebacks with Shopify Payments [2FA]",
    "selftext": "I've found the most simple and effective method to stop scammers and prevent fraudulent chargebacks. This guide is made for anyone running a Shopify store and using Shopify Payments. \n\nIt takes a minute to set up and it saved me thousands in chargebacks and product costs.\n\n✅️ **Setup guide:**\n\n1. Open your Shopify Dashboard\n2. Click on ‘Settings’\n3. Click on ‘Payments’\n4. Click on ‘Manage’ for Shopify Payments\n5. Scroll down until you find the 'Customer Billing Statement' section\n6. Add your ‘Company Name’ + 'Number Code' in the Customer Statement Descriptor. For example 'SP \\* Ecom Zone 8426'\n7. Update this code occasionally\n\n✅️ **How it works:**\n\nFor any medium/high-risk orders, email the customer and ask them to verify the number code that shows up on their bank statement. In the example above, the customer would have to provide the code: 8426. Place this order on hold until they verify your unique 4-digit code.\n\nMost scammers will only have the stolen credit card details and will not have access to the cardholders' bank account to verify this code.\n\nIf they cannot verify this 4-digit code even after you help them locate it, then simply cancel the order.\n\nIf the customer provides this 4-digit code and still opens a chargeback after processing their order, then it is very likely that you will win as long as you provide the bank with all of the evidence.\n\n&amp;#x200B;\n\n**✅️ Use cases**\n\n1. Medium-risk orders\n2. High-risk orders\n3. Multiple payment attempts\n4. The billing address doesn't match the credit card details\n5. The customer is shipping to another address with a different name\n6. High-value orders\n7. High-risk internet proxy used to place the order\n8. The cardholder's name provided does not match the name on the shipping address",
    "subreddit": "shopify",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 173,
    "downs": 0,
    "created_utc": 1695228402.0,
    "media": null,
    "is_video": false,
    "num_comments": 129,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.040020924436019
  },
  {
    "score": 171,
    "title": "Temu just paused Meta ads in the U.S. and this might be the best news ecommerce brands have had in a while",
    "selftext": "If you’ve ever felt like Meta ads were stacked against you, this is one shift to pay attention to.\n\nFor years, massive Chinese players like Temu, Shein, and Alibaba have poured billions into Meta’s ad auction. They scaled by flooding the platform with rock-bottom prices and hyper-optimized spend. You’ve probably seen it firsthand: your $80 product ad buried under five ads for $1 kitchen gadgets and $3 leggings..\n\nbut that’s changing now!\n\nDue to increasing pressure on the de minimis loophole (which lets foreign sellers import goods under $800 without paying U.S. duties), and a new wave of tariffs, Temu is reportedly pausing Meta ads in the U.S. entirely. Other sellers are pulling back too.\n\nThat opens up a ton of breathing room for a lot of business owners!\n\nHere’s what we’re already seeing:\n\n**1. Lower CPMs across accounts**\n\nless mega-spend = more space in the auction. In some verticals, we’ve seen CPMs drop 15–20% since the pause. Still early, but noticeable.\n\n**2. Better exposure for U.S. brands**\n\nWith fewer fire sale priced ads dominating the feed, US-based DTC brands are starting to get seen again. If your creative and CRO are solid, this is your moment to take back attention.\n\n**3. Pricing edge is narrowing**\n\nTemu wasn’t just winning with volume: they were skipping tariffs, enjoying cross border shipping subsidies, and bypassing compliance in a way U.S. brands never could. that’s getting addressed. It might not level the field overnight, but it’s a real start.\n\nIf you run a Shopify brand and have felt boxed out of Meta for the past year, this might be the window you’ve been waiting for! We’re already seeing results improve on accounts with strong creative and clean signal. Nothing crazy, but the playing field feels a little less tilted this week.\n\nWould love to hear from others. Have your Meta campaigns gotten cheaper or stronger lately? Seeing the same CPM shifts?",
    "subreddit": "shopify",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 171,
    "downs": 0,
    "created_utc": 1744924239.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.74155844257153
  },
  {
    "score": 167,
    "title": "I talk to store owners for a living and run a store, here's some common mistakes I've seen recently",
    "selftext": "I'm a part owner in a store and work with a lot of stores through our software and take a lot of calls with brands looking for advice.\n\nHere's a list of common mistakes that keep coming up...  \n  \nCommon mistakes:\n\n1. Running ads without enough reviews\n\n2. Running ads without customer data collection\n\n3. Running ads without large enough budgets to have actionable data\n\n4. Lack of product differentiation\n\n5. Lack of product descriptions\n\n6. Overuse of language that doesn't mean anything\n\n7. Unclear shipping and return policies\n\n8. Small details left out of product descriptions\n\n9. Lack of founder/brand story weaved into product pages\n\n10. Too much product variation between models that is unclear\n\n11. Overcomplicated marketing messaging\n\n  \nMost brands would do best to just simply...\n\n1. Tell me what you make\n\n2. Tell me what it's made of\n\n3. Tell me why the world needs your version of it and what makes it better\n\n4. Tell me what happens if I buy it doesn't work for me\n\n5. BONUS Tell me if you have an offer for first time purchasers or a sales item I can try to get started with your brand\n\n  \nOften times I find that store owners are constantly trying to do everything instead of just focusing on being consistent with the fundamentals.\n\nI read so many websites where the messaging is confusing and the benefit list is so long that it gets confusing, if you just focus on the top reasons people actually buy your product you'll be far better off.\n\nOne of the tips around this is make sure that every sentence on your website answers either, why you designed or made something some way, or how this design is better in some way.\n\nExample:\n\nWe decided to use seamless hems on our shorts to avoid chafing on your legs while running.\n\nvs.\n\nSeamless hems for a smooth feeling.\n\n  \nThe second one doesn't give you context as to why, it just restates the result of using seamless hems.\n\n  \nThis stuff isn't complicated but sometimes we get too close to the end result to realize that a lot of store websites don't actually convey a message that is differentiated or helpful in making a purchasing decision.\n\n\n\n",
    "subreddit": "shopify",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 167,
    "downs": 0,
    "created_utc": 1736871167.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8739755299414966
  },
  {
    "score": 166,
    "title": "Shopify Has The Worst Customer Support of Any Major Tech Platform",
    "selftext": "I'm in disbelief about the last three weeks dealing with Shopify \"customer support.\"\n\nI identified a bug related to image uploads into blog articles that one representative verified and said they would speak with the technical team about. \n\nI never heard back from that representative or the technical team.\n\n90% of Shopify \"customer support\" reps today cannot speak fluent English, never mind understand technical requests.\n\nIt's truly shocking how frustrating and terrible this company's support is, and while I used to recommend Shopify, I now recommend that entrepreneurs try WooCommerce first, because the quality of support has degraded so substantially in the past few years as Shopify has cut costs and support staff.",
    "subreddit": "shopify",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 166,
    "downs": 0,
    "created_utc": 1712714239.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.001778770324814
  },
  {
    "score": 164,
    "title": "We won our first chargeback 🎉",
    "selftext": "Just won our first chargeback through Shopify Payments. Here’s how it went down…\n\nCustomer placed their first order, and then accepted a post-purchase upsell (shows as a second transaction on their cc). Within 10 days of receiving their order, they initiated a charge back with the reason being fraudulent charge.\n\nWe emailed the customer with all the details of their customer journey… including how they found us (FB ad), when they visited, pages they viewed (including our Judge.me page), etc, when we shipped, and when they received it, etc. \n\nClearly stated that they did not contact us and we could have helped resolve the issue instead of them initiating a chargeback, and that we would like to help them resolve this if it truly was fraud. \n\nCustomer did not respond so we sent a follow up email, and called them and left a message in case our email was going to their junk folder. \n\nBy the due date of when our defence was due, customer had not responded, so we submitted all the evidence, including our emails and follow-ups, making it clear that the customer may no attempt to contact us before initiating the chargeback, and making it clear that we reached out multiple times without success.\n\nNext thing we know… We got noticed that the chargeback has been ruled in our favour! 🥳🎉\n\nSo we’re 1-0 in chargebacks 👏👏👏\n\nHope this helps others successfully fight chargebacks",
    "subreddit": "shopify",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 164,
    "downs": 0,
    "created_utc": 1745688173.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7817102824569995
  },
  {
    "score": 149,
    "title": "🚨 I worked inside the Shopify “speed optimization” scam on Fiverr — here’s how it really works (please read before you waste money)",
    "selftext": "Hi everyone,\n\nI’m posting this because I’ve seen too many Shopify store owners get scammed every single day on Fiverr and similar freelancing platforms. I know this because I was on the inside — I worked with sellers who sold “Shopify speed optimization” gigs.\n\nLet me tell you the truth: almost all of these gigs are fake.\n\n\n---\n\n🔎 How the Scam Works\n\n1. Fake scripts are injected into your theme.\n\nThese scripts detect when a speed testing tool (Google PageSpeed, GTMetrix, Lighthouse, etc.) is running.\n\nWhen detected, they temporarily block apps, images, or scripts just long enough to fool the tool.\n\nThe test then shows a 90+ score — but real visitors see no improvement at all.\n\n\n\n2. Temporary boosts only.\n\nThe “fix” doesn’t touch your actual store performance.\n\nIf the script breaks or gets removed, your store speed goes back to what it was.\n\n\n\n3. Hidden malicious code risks.\n\nSome sellers even insert hidden links, spam pages, or tracking scripts.\n\nI’ve personally seen collections for random keywords like “FIFA coins” being secretly added to stores.\n\n\n\n4. Merchants lose twice.\n\nYou pay $50–200 thinking your store is faster.\n\nIn reality, you don’t get conversions, your SEO doesn’t improve, and sometimes you even hurt your site.\n\n\n🙏 Why I’m Posting\n\nI don’t want to see more small businesses wasting money on fake promises. These sellers make hundreds per week selling the same copied scripts. Store owners are desperate for faster sites, and scammers exploit that.\n\nPlease be cautious. If a deal looks too good to be true, it probably is.\n\nIf you’ve already paid someone, check your theme code for suspicious scripts. Run real user speed tests (not just Lighthouse). And if you need optimization, look for reputable Shopify developers or agencies with verifiable case studies.\n\n\n---\n\n🛑 Warning Signs\n\nGig promises “90+ PageSpeed score in 24 hours” for dirt cheap.\n\nSeller shows test screenshots only, not real user results.\n\nYour site “feels the same” after work, but the test score jumps magically.\n\n",
    "subreddit": "shopify",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 149,
    "downs": 0,
    "created_utc": 1756991339.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.885485172728459
  },
  {
    "score": 146,
    "title": "Tariffs just made a $4 product land at over $10..this is getting wild",
    "selftext": "Seeing some crazy swings lately in landed costs, especially with China-origin stuff.\n\nOne example I came across recently: a shirt that costs $4 EXW out of China is now landing at $10.40 per unit after the 135 percent tariff, freight, customs, everything. That same product from Vietnam? About $6.50 landed. No difference in quality. Just where it came from.\n\nSome brands are shifting to EXW pricing to lower the declared value. Others are literally pausing shipments to see what happens with the next round of changes. A couple are even doing final-stage finishing in Mexico or Vietnam to shift the country of origin.\n\nBonded warehouses are coming up more too. Not ideal, but they give you time before paying duties.\n\nNone of this is perfect, obviously. But if you’re importing anything right now, it’s worth taking a second look at your landed cost math.\n\nCurious what other folks are doing.\n\nAre you pausing shipments or keeping them moving? Leaning into EXW or still using FOB? Sticking with current suppliers or looking elsewhere?\n\nwould love to hear what’s working (or not working) for you.",
    "subreddit": "shopify",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 146,
    "downs": 0,
    "created_utc": 1744337934.0,
    "media": null,
    "is_video": false,
    "num_comments": 146,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9259760021222636
  },
  {
    "score": 144,
    "title": "As a new Shopify store, I can't emphasize enough the importance of making the most out of the Marketing tools (mostly FREE) provided by Shopify itself",
    "selftext": "If you implement these steps before launch or as early as possible when your store is new, your business will benefit significantly:\n\n* **Setup Lead Capture with Shopify Forms (FREE)**: If you can't sell, at least capture your traffic to build trust and sell via email.\n* **Use Shopify Email (10,000 Emails FREE per month)** for Email Marketing, before jumping into any advanced or costly platforms.\n* **Setup the essential email flows automation**: Welcome, abandoned browse, abandoned cart, abandoned checkout, order confirmation, feedback/review request after fulfilled order, win back, etc.\n* **Enable Shopify Inbox**, setting up Instant Replies.\n* **Setup Shopify Shop Channel**: Pay attention to what % of products are not getting listed for missing categories. Update them.\n* **Setup Facebook &amp; Instagram Sales Channel** (Meta Business Manager, Ad Account, Pixel, CAPI, Catalog, etc).\n* **Setup Google &amp; YouTube Sales Channel** (Google Merchant Center, Google Analytics, Google Ads, YouTube).\n* **Setup TikTok Sales Channel**.\n* **A Review Plugin**.\n* **Shopify Collab** for partnering up with Creators.\n* **Discount** (Tip: Avoid sitewide discounts &amp; deep discounts that might burn money, attract low-quality customers. Improve AOV discounting for higher order value).\n* **Ensure cost, inventory, etc., are up-to-date for all products**.\n* **Integrate Triple Whale's FREE Founder Dash** (Add other expenses beyond Inventory cost). Measure the metrics that matter.\n\nNow full disclaimer. Even as a Shopify partner, I have to admit that some of the FREE Shopify apps have issues and the support team struggles to help. I sincerely hope that Shopify team is taking the negative reviews on their FREE apps seriously and taking steps to improve them.\n\nThere are 3rd party FREE alternatives as well.\n\nWhat apps do you use for Marketing?\n\n**I always recommend new DTC brands keep the tech expenses minimum and rather spend more on customer acquisition.**\n\nI have seen 7/8 figure brands drowning with subscription fees from platforms, that they barely use or get reasonable returns from.\n\n**Another important recommendation is to use a Shopify theme that you or any non-developer can customize just by dragging &amp; dropping sections &amp; blocks.**\n\nThere are great FREE themes &amp; then feature-rich paid themes like Debutify that you can customize yourself.\n\nYou don't need a developer or designer to start with. Researching the top e-commerce sites in your niche will give you pretty good website layout ideas.\n\nGood themes make it easy to create those layouts by any non-developer or designer.\n\nLet me know if you've found some value.   \nMay your store have an incredible 2024.   \nAll the very best.",
    "subreddit": "shopify",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 144,
    "downs": 0,
    "created_utc": 1703056744.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7414660422492316
  },
  {
    "score": 136,
    "title": "AI search is getting real (and bringing leads)",
    "selftext": "so here’s something kinda wild\n\nwe’ve been testing ai search optimisation across a few shopify stores  \nand our products are already showing up inside chatgpt, gemini and perplexity  \nfirst leads just came in too. all organic. no ads. no spend.\n\nthis is basically seo for ai search. and it’s real.\n\nif you want your store to show up, here’s what to do:\n\n1. make sure oai-searchbot can crawl your site (check your robots.txt file)\n2. write product titles the way people actually search like “eco-friendly glass lunchbox with lid” not “lunchbox 2.0”\n3. add structured data (json-ld schema) to your product pages include name, price, availability, reviews, etc\n4. upload your products to google merchant center chatgpt pulls from there too\n5. fill out this official form to get on chatgpt's radar: [help chatgpt discover your products](https://openai.com/chatgpt/search-product-discovery/)\n\ncouple more tips that helped us rank higher:\n\n→ describe buyer benefits (not just features)  \n→ mention price, eco-friendliness, handmade, award-winning etc  \n→ use multiple images, show products in use  \n→ keep info fresh – chatgpt skips outdated stuff  \n→ reviews matter – it highlights trusted products\n\nfeels like early google shopping all over again  \nbut this time small sellers have a chance to jump ahead before it gets crowded\n\nanyone else testing this yet? ",
    "subreddit": "shopify",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 136,
    "downs": 0,
    "created_utc": 1750249496.0,
    "media": null,
    "is_video": false,
    "num_comments": 110,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8868820565497355
  },
  {
    "score": 129,
    "title": "A Big Win For The Small Shopify Stores Of The World",
    "selftext": "Hello everyone I've been a watcher of this subreddit and I didn't want to say anything until the time came but I finally got my big win over the larger competitiors of the e-commerce industry I work in. Now I will say this isn't my shop so I will gladly give credit to the owners as I'm just the SEO guy, but we've officially started to outrank the much larger brands who once cast a shadow over the industry. We've hit the first page for a variety of different topics related to puffco's, bongs, bowls, and all your other smoking accessories that are offered from our shop and for those of you wondering what the effect has been so far lets just say we've over 8x the traffic to the site since starting over 6 months ago at roughly 100 users a month as we now sit at roughly 800-1400 users a month.\r  \n\r  \nI'm super excited to post this win as I hope it gives hope to the other smaller shops trying to make it as too often I see people start their e-commerce jounrey only to be demoralized and close down when they realize the odds they are up against. Feel free to ask me any questions as this was a long time in the making with essentially a complete rework of all things SEO including content, title tags, heading tags, schema, and almost anything else you can think of and I'm glad to share any technics I've used along the way. But a huge win for the little guys and hopefully we can continue to keep this ball rolling!",
    "subreddit": "shopify",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 129,
    "downs": 0,
    "created_utc": 1684171624.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6253352806667047
  },
  {
    "score": 124,
    "title": "If you missed what Shopify just dropped in the Winter 26 Editions, I have covered it here.",
    "selftext": "Shopify has rolled out more than two hundred product updates. This is one of their biggest releases ever and it sets the tone for how AI will shape commerce for the next decade.\n\nThe theme is Renaissance Edition. It reflects how art and science come together when AI and creativity power modern entrepreneurship. Shopify has reached a major AI inflection point and this update proves it.\n\nSidekick, Shopify’s AI Assistant, received the most impactful upgrades.  \nSidekick Pulse is now a proactive engine that scans your store, customers, and markets without waiting for prompts. It sends insights like reactivation ideas, ready-made campaigns, and discount suggestions.  \nAppGen now lets you generate custom Shopify apps automatically.  \nFlow automations can be built using simple text prompts.  \nTheme editing is now conversational. You can change layouts, styles, and components just by describing what you want.  \nSkills now allow merchants to share reusable prompts and workflows with the broader community.\n\nShopify also introduced Agentic Commerce. Your product catalog can now appear inside AI chat platforms like ChatGPT with no work from your side. These AI storefronts preserve your brand’s look, feel, and configuration.\n\nOnline Store updates focus on merchandising and testing. Rollouts let you schedule and coordinate product drops, discounts, and theme changes with built-in traffic splits for experiments. SimJim gives you simulated customer testing. It acts like a virtual focus group and helps you test changes even with low traffic.\n\nTinker is Shopify’s new creative playground. It is designed for early stage entrepreneurs to turn ideas into visuals, concepts, and plans using AI.\n\nFor retail, the new POS Hub improves reliability and connectivity. It acts as a small computer that keeps your store hardware synced and stable.\n\nProduct Network allows merchants to pull products from other Shopify merchants. This helps brands expand their catalog safely while increasing conversions and average order value.\n\nDevelopers get significant improvements across APIs, performance layers, and builder tools, pushing Shopify’s ecosystem forward.",
    "subreddit": "shopify",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 124,
    "downs": 0,
    "created_utc": 1765448650.0,
    "media": null,
    "is_video": false,
    "num_comments": 117,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.807851016661119
  },
  {
    "score": 124,
    "title": "$4,200 chargeback. Yikes.",
    "selftext": "We are UK based and  had a customer from Canada purchase a high-ticket item with their address being a US parcel forwarder.  Because the value was high and a parcel forwarder was involved, I contacted the customer to verify our security identifier with their bank and asked for ID. Everything checked out: they provided a Canadian ID, and I saw a previous abandoned checkout from them using a Canadian address.\n\nWe sent it signed and delivered, thinking we were done. They handled the UPS import documentation too, so it even passed UPS brokerage security checks (for a non-US resident, this is actually quite a lengthy process, and requires lots of sensitive information such as SSN/SIN).\n\nThen, 15 days later, boom: chargeback for 'product not received.'\n\nWe’d had zero emails or live-chat messages from them, so it came completely out of the blue. \n\nFirstly, I'm an idiot for even going through with this. You can say it a million times in the comments, and it will be well deserved. If you come across this post on Google, don't be like me.\n\nHere’s the thing: when I reached out to the forwarder they were incredibly helpful, basically oversharing everything. They confirmed the package was delivered, gave me the name of the recipient (which matches the customer’s), their forwarding address, a scanned delivery log, and even an export log showing it was dispatched to the customer’s Canadian address, the same one from that abandoned checkout.\n\nI’m know it's not looking good regardless, but how would you approach the chargeback response? For this value I’m also considering legal action, especially since we now have a confirmed address. The customer seems to be real in every sense, but just wants a free product and is taking a chance on a chargeback.\n\nI don't even know how to approach the chargeback too. Would you even mention a freight forwarder involved, or just say parcel was delivered and provide proof?",
    "subreddit": "shopify",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 124,
    "downs": 0,
    "created_utc": 1746740552.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.780723558653277
  },
  {
    "score": 121,
    "title": "Amazon’s “shop stores directly” scraping shopify sites and placing orders",
    "selftext": "My site, along with countless others are being scraped for Amazon’s app.  Products I don’t even have anymore (like fully deleted from the back end) are being sold under this “shop stores directly” section of the app. They use AI images of items that aren’t mine, and authorizing orders to my site for items that are out of stock. I did not opt in to this nor is there an easy way to opt out. How did this happen and what is Shopify doing to rectify this?! \n\nI posted a reel about it on my IG if you wanna see what I’m talking about (bobodesignstudio) \n",
    "subreddit": "shopify",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 121,
    "downs": 0,
    "created_utc": 1766973854.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7380212607349765
  },
  {
    "score": 121,
    "title": "2.5 million in fraudulent orders",
    "selftext": "I have a huge problem and Shopify has mentioned they cannot help and do not give refunds once processed. They insist there is no support phone number and can only discuss the matter via chat.\n\nMy orders spiked due to fraud. I literally sold 2.5 million in a week and normally just sell about $600 - $800 per month lol\n\nBecause my orders process through authorize.net who also identified the orders as fraud just like Shopify but didn’t process them, Shopify support is saying they did their part in sending the orders to authorize and need to charge. I literally owe close to 10k or more (losing control in tracking) because of this fraud orders.\n\nI need some serious guidance. This has set my business bank account into a negative balance 😢 ",
    "subreddit": "shopify",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 121,
    "downs": 0,
    "created_utc": 1746534644.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7890127633071335
  },
  {
    "score": 118,
    "title": "$2700 Chargeback Opened 450 Days Later for a second time!!! Shopify doesn’t care!!!",
    "selftext": "\nWe verify every order over $1000 since we deal with higher end devices. He opened it for \"item not as described\" which is notoriously hard for sellers to win. We say, ship it back and we will refund you. He says there's a swollen battery he can't return it to us via mail. \n\nWe’ve shipped tens of thousands of batteries and never had anyone tell us we cant but this guy starts quoting ups and lithium rules. So we open an ups hazmat. Nope, he says the managers still preventing him. We call and talk to the manager and he says the customer claimed it was smoking and sparking. He's setting up a narrative.\n\nSo he on his own then contacts \"Americase\" to help strengthen his baseless claims. He has Americase write us saying he can't ship it. I contact them as well and they say he was trying to convince them to write the email which they did. At this point, I opened a fraud case with my local police department. I tell them they're now involved in the case. \n\nThey apologize and say he was trying to manipulate the situation. They write an email that I use as evidence against Kyle. They give me the box for free which I ship directly to him. Guess what, he claims ups still won’t take it. UPS says he never showed up. \n\nSo, my chargeback response has a police report, America's rep, ups rep,  hazmat rep, etc. and guys I actually won! It was a great feeling.\n\nBut how, 365 days exactly from when the chargeback was found in our favor and 450 days since the item was received  the somehow has opened another chargeback. \n\nI contact Shopify and it’s a joke. From all research this should NOT be possible without some special situation. Shopify agrees but say I need to treat it like a new chargeback and even through its duplicative will not close it! \n\nShopify doesn’t care about your money and doesn’t go to bat for you when you need it. If any of you have any advice I’m all ears. Ty in advance. \n\n",
    "subreddit": "shopify",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 118,
    "downs": 0,
    "created_utc": 1761912937.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6924715067611578
  },
  {
    "score": 113,
    "title": "Shopify should be offering a partial refund for going down like this",
    "selftext": "I don’t even have a stake in this financially, as I build stores for clients, but man… worst possible day to go down. If I was an actual customer of Shopify I’d be expecting some kind of compensation at this point. If I was a developer responsible for the system architecture related to this crash, I’d be shitting my pants right about now too. Just one person’s opinion, but this whole thing is kinda pathetic and a really bad look for Shopify. \n\nI ride for this platform (as a dev, anyway) but this is becoming a problem much more frequently than it should ever be lately!",
    "subreddit": "shopify",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 113,
    "downs": 0,
    "created_utc": 1764611469.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6524422526868863
  }
]