[
  {
    "score": 6233,
    "title": "I wrote a 680-page Interactive Book on Computer Science Algorithms",
    "selftext": "Hi everyone! \nAs an educator, I'm always looking for ways to make learning more engaging and hands-on. A few months ago, I started experimenting with this idea of making comprehensive books that feature interactive diagrams, equations and code.\nSo I started with a chapter on sorting but it then snowballed into a 22-chapter book that took nearly 6 months to complete.\n\nSome unique features of the book include:\n • 300+ fun interactive visualizations to explain concepts and walk-through solutions visually.\n • All 250+ code snippets featured \n in this book can be interacted with, and have a visual debugger that shows how variables change as the program runs. You can also play, pause, rewind, and step through each snippet.\n • There are a variety of solved problems for each topic, accompanied by an embedded minimalist python IDE. You can solve problems directly in the book and view multiple solutions per problem.\n • Each solution is also accompanied by live visualizations and python implementations.\n\nYou can check out the book here:  [cartesian.app](https://cartesian.app)\n\nI’d genuinely love to hear what you think, especially if you’re a student, educator, or a self-taught learner!",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 6233,
    "downs": 0,
    "created_utc": 1750684462.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/jaxb9d3qfo8f1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/jaxb9d3qfo8f1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/jaxb9d3qfo8f1/DASHPlaylist.mpd?a=1770353715%2CYzk1YmZlYjM2YWNmMGNmNWU1NTRjZDJhZTc3YjJjN2UzYmY4MDNkZjEzNGI3M2MyYjFkZGFkNTM1YmJmNzEyYQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 57,
        "hls_url": "https://v.redd.it/jaxb9d3qfo8f1/HLSPlaylist.m3u8?a=1770353715%2CZTZlM2E3ODZiNjc3MDc1MzQzN2YxZGEzZTk4MDE1MGQ5NWJiNjZkMTRlYjQwZWI5NmIzNGZhZmYwZWZmMWE5Nw%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 867,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.999026660529068
  },
  {
    "score": 4588,
    "title": "I made an app where you collect every cat you meet as stickers in your own cat-a-log",
    "selftext": "I’m a big cat lover (despite being terribly allergic), and back during the pandemic I spent way too much time on Animal Crossing. My completionist self was obsessed with filling out the fossils, fish, and insects list…\n\nFast forward a few years, now that I have more iOS experience under my belt, I thought it would be fun to recreate this feeling but with cats in my own personal “cat-a-log.”\n\nThe app is simple:\n\n* Snap cat pictures.\n* Identify breeds and get an information sheet.\n* Collect cats as cute stickers in your personal collection.\n* Organize your catalog by cat names or breeds.\n* Share the cats you’ve met as stickers through WhatsApp, Messages, and more.\n\nRight now you can scan one cat per day for free. I’d love for you to give it a try and let me know what you think:\n\n[https://apps.apple.com/us/app/cat-identifier-catsnap/id6749846041](https://apps.apple.com/us/app/cat-identifier-catsnap/id6749846041)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 4588,
    "downs": 0,
    "created_utc": 1759161824.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/07murpx7n4sf1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1920,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/07murpx7n4sf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/07murpx7n4sf1/DASHPlaylist.mpd?a=1770353715%2CMTg2ZmI5ZGI4YWZjYzZkOGVhMGI2NTg5MjFlYTE5MGZlOGMzNTEyMTQxNzZkNWY3OWMxNTlmMmZiYmExOWUzMQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 9,
        "hls_url": "https://v.redd.it/07murpx7n4sf1/HLSPlaylist.m3u8?a=1770353715%2CNDE4NTg0M2E3NmQyYzM2NTRkM2I4ZWRlZTU0OTVhNzM2ODA1N2YyYmUwOGJkODIwMjc3ZGM5NDU1OGM2NDQ2ZA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 327,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.662154979550499
  },
  {
    "score": 4575,
    "title": "My silly \"secret chat\" app got its first paying user. I emailed him. It turns out he's using it in a way I never, ever imagined.",
    "selftext": "Hey Reddit,\n\nSo I have this little iOS app called MojiCode. It's a pretty simple side project of mine: you type in text, and it spits out a string of emojis. The idea was for friends to send goofy, coded messages to each other. I built it to be a fun toy, basically.\n\nA few days ago, one of my first paying users emailed me about a minor bug. We sorted it out, and just out of curiosity, I asked him: \"By the way, what are you and your friends mostly using the app for?\"\n\nI was expecting to hear something about secret crush confessions or gossiping in class.\n\nHis reply blew my mind. He said:\n\n\"Oh, I don't use it for chats at all. I use it as a password manager.\"\n\nI was so confused, so I asked him to explain. His system is brilliant:\n\nHe set one single, memorable Super Key for the app. Now, whenever he needs to save a password, he encrypts it with MojiCode (e.g., \"MyAmazonP@ssw0rd0922\" becomes 😍🍑🖤🥥😛...etc.). He then saves that harmless-looking emoji string in his unsecured notes app.\n\nTo anyone who snoops on his phone, it just looks like he's saving weird emoji combos. But for him, he only needs to remember his one single Super Key to decrypt any password he needs.\n\nI, the creator of the app, had never even considered this. I made a toy for passing secret notes, and this guy turned it into a personal, low-tech password vault.\n\nIt's such a wild and humbling feeling... Has anyone else had their project's users completely surprise them with an unexpected use case? I'd love to hear your stories.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 4575,
    "downs": 0,
    "created_utc": 1754452681.0,
    "media": null,
    "is_video": false,
    "num_comments": 309,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.626166862702104
  },
  {
    "score": 3490,
    "title": "I waited 15 years to build this app. Apple finally made it possible in iOS 18.2",
    "selftext": "In 2009, I was a solo iOS dev who wanted a simple feature: to see my friends’ Facebook photos when they called. That turned into MyPhone+, which went viral and completely changed my life.\n\nBy 2012, it evolved into [Sync.me](http://Sync.me), doing Caller ID and spam blocking mostly on Android, because iOS didn’t allow real-time call identification.\n\nFor over a decade, we kept hitting the same frustrating wall: Apple didn’t allow real-time Caller ID. No way to show who was calling while the phone was ringing.\n\nWe tried everything: workarounds, Siri hacks, manual lookup widgets. None of it felt native, fast, or right.\n\nFast-forward to 2025. Apple opened the Live Caller ID Lookup API in iOS 18.2, and I immediately jumped in to finally build what I always wanted the iPhone to have.\n\n🚀 Introducing: Livecaller  \n[https://www.livecallerid.com](https://www.livecallerid.com)\n\nA real-time Caller ID app for iPhone:  \n\\- Shows who’s calling - live, during the ring  \n\\- Spam call blocking  \n\\- No creepy permissions  \n\\- 30-second setup  \n\\- Covers 4+ billion numbers globally  \n\\- Free to use\n\nWould love to get your thoughts, feedback, and suggestions!  \nAMA about the API, tech stack, launch, or lessons from chasing this for 15 years.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 3490,
    "downs": 0,
    "created_utc": 1746609119.0,
    "media": null,
    "is_video": false,
    "num_comments": 639,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.673539835806122
  },
  {
    "score": 3193,
    "title": "Smoking neighbors hate this little trick.",
    "selftext": "My neighbor is smoking on the balcony, and smoke goes to my home with little kids. I talked with him several times, didn't help. It's his territory, so not much I can do, besides closing the doors. But at least i can use this fake smoke detector with VERY ANNOYING random buzzer. It starts buzzing when i connect to it my iPhone via BLE. Makes it not as relaxing to smoke on the balcony as it planned to be for him. I'm going to train this mofo with reinforcement learning like a fkn Pavlov Dog.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 3193,
    "downs": 0,
    "created_utc": 1761817071.0,
    "media": null,
    "is_video": false,
    "num_comments": 387,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.488750774599568
  },
  {
    "score": 3072,
    "title": "I got tired of fake BS, so I built a livestream map where you can show the world what's actually happening on the ground",
    "selftext": "UPDATE: WOW, this has been an insane few days. We have been blown away by the overwhelming love and support from this community and we were not expecting this kind of attention! We have gotten so many messages urging us to keep going and telling us that this is something the world really needs. Your kindness and enthusiasm has made us more motivated than ever to see it through and build something truly great. We are working frantically behind the scenes to ensure Hereabout lives up to its potential. Thank you so much and stay tuned - there's more to come!\n\n[https://hereabout.app/](https://hereabout.app/)\n\nAndroid Play Store: [https://play.google.com/store/apps/details?id=com.stormbyte.ui](https://play.google.com/store/apps/details?id=com.stormbyte.ui)\n\niOS App Store: [https://apps.apple.com/us/app/hereabout-app/id6478040527](https://apps.apple.com/us/app/hereabout-app/id6478040527)\n\nDiscord server: [https://discord.gg/x2vqyDQw](https://discord.gg/x2vqyDQw)\n\nYou can share your story exactly where it happens.\n\nCamera only - no uploading from camera roll. No editing. No fake AI BS.\n\nJust real people &amp; real places, exactly as it happened.\n\nYou can organize content into layers on the map. Think of them as communities.\n\nYou subscribe to only the ones you want.\n\nAvailable on Android &amp; iOS.\n\nShare your communities with other people like this: [https://hereabout.app/share/layer/4abf5895fea](https://hereabout.app/share/layer/4abf5895fea)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 3072,
    "downs": 0,
    "created_utc": 1762714022.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/o1ez4bns0a0g1/CMAF_720.mp4?source=fallback",
        "has_audio": false,
        "height": 1280,
        "width": 632,
        "scrubber_media_url": "https://v.redd.it/o1ez4bns0a0g1/CMAF_96.mp4",
        "dash_url": "https://v.redd.it/o1ez4bns0a0g1/DASHPlaylist.mpd?a=1770353715%2CZmZhNTI4ZjY2ODdjNDI2M2JiOGIxNTM1ODU2OTlhYjMxNDczYjM3MjYwMWNmOGQxMGZjZDdmNWUyZTQwZWYzZA%3D%3D&amp;v=1&amp;f=sd",
        "duration": 13,
        "hls_url": "https://v.redd.it/o1ez4bns0a0g1/HLSPlaylist.m3u8?a=1770353715%2CMWRkMTZlYmVjZWNhM2IyMzNmOGUxNzA0OGIyYjVlYzFkMGUyN2Q0YjZhNGJmNzViYzAyOTIwNjljN2Q1OWVjMw%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 253,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.424979418566347
  },
  {
    "score": 2962,
    "title": "I build a visual Wikipedia Browser because I got sick of tabs",
    "selftext": "Hi everyone, after two months of work I've put [https://www.wikiboard.org](https://www.wikiboard.org) (visual rabbithole/research browser for Wikipedia) online for testing. This has been a passion project for me and I'm not seeking financial gain from it, I just dislike getting lost in tabs. If you ever start on an article like Line dancing and end up on the article about the Hubble Space Telescope, WikiBoard might be for you :)\n\n**You can look up any article, browse the home screen, draw connections, add post-it nodes and save your boards locally!**\n\nLet me know what you guys [think!](https://www.reddit.com/r/WikiBoard/) If you'd like to get updates about the project, you can join the subreddit: [https://www.reddit.com/r/WikiBoard/](https://www.reddit.com/r/WikiBoard/)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2962,
    "downs": 0,
    "created_utc": 1762373938.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/zctnfi64yhzf1/CMAF_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/zctnfi64yhzf1/CMAF_96.mp4",
        "dash_url": "https://v.redd.it/zctnfi64yhzf1/DASHPlaylist.mpd?a=1770353715%2CMTAyNzI0MDBhODEwM2MwYzVlMmQxODE1MzA2MmIxNzhmZmRkNTc3MWM2ZjMzZmJkYWNkMzBiMTQ2MTFmYzgwMA%3D%3D&amp;v=1&amp;f=sd",
        "duration": 49,
        "hls_url": "https://v.redd.it/zctnfi64yhzf1/HLSPlaylist.m3u8?a=1770353715%2CMTM4YmM4NjJlZWE1MGE2N2UwM2E0NGQ5ODUyYjFhYjljZTNkMTAyN2IwYzg5ZGEzMDUzNDIzNzRiMjQ3NGU5MA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 342,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.481878711501436
  },
  {
    "score": 2499,
    "title": "Lost my job after 20 years. Tried sending résumés, but it was like shouting into the void. So I decided it was time to take control myself.",
    "selftext": "I'd like to say, like other developers I've read about, that they quit their jobs to be able to make this or that app. My case was unusual. The company I'd been working for for 20 years suggested I retire on February 28th. Suddenly, I was out of work, with three children: one with Down syndrome at 22, and two little ones, ages 9 and 6.\n\nMy wife and I decided to take things slowly, but at the same time with concern. I spent the first three months reworking my CV, applying on LinkedIn and other sites, but each time I realized it wasn't what I wanted to do. Twenty years ago, before entering the corporate world, I made a living programming in #C or Visual Basic, and as Steve said, I'd been rejected, but I was still in love with programming, and like any great relationship, it just gets better and better as the years go by.\n\nMy corporate job wasn't programming, but I still programmed in my free time; I always enjoyed it. So I started programming, just because, listening to music with my headphones.\n\nSuddenly, I realized I wanted to use those songs to wake up, but iOS 18 and later doesn't allow it. I said to myself, there must be a way, I want to do it, and I think I've achieved it, although I really still want to improve it and make it better. I was finally able to make my first app on iOS: [SpotiActions](https://apps.apple.com/pe/app/spotiactions/id6748419049), and I had to set a price. I wanted it to be low enough so that more people could have it. I didn't add subscriptions, just a one-time fee.\n\nI wanted them to know the story, and believe me, not so they would buy it, **but I must admit it would help me a lot if you did**. To really make some money, I think there should be a lot of in-app purchases. I hope I can achieve that.\nI wanted to share the story with this community because you can understand start again or have other projects.\n\nMy native language is Spanish, so I use AI to translate to English, I hope sounds natural\n\nI wanted to share the story with this community because you can understand start again or have other projects \n\nI really want to read your thoughts 🙌  \n\nhere: what app does: https://www.reddit.com/r/iosapps/s/4d5vwH0x6Q",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2499,
    "downs": 0,
    "created_utc": 1756738859.0,
    "media": null,
    "is_video": false,
    "num_comments": 160,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.2288529466879625
  },
  {
    "score": 2345,
    "title": "I built a Chrome extension that converts prices into time — 700 people already use it",
    "selftext": "Hi everyone! 👋 I’m a solo developer from Taiwan and I just released **Pause Buy** (f.k.a. *Time Cost Converter*), a Chrome extension that shows any online price as the hours you’d need to work to afford it. It’s a tiny “speed bump” to help curb impulse buys by asking: **“Is this worth** ***X*** **hours of my life?”**\n\n**Key features**\n\n* 🏷️ **Instant price-→-time conversion** – works on Amazon, Walmart, Best Buy, and most other shopping sites.\n* 🔄 **Two display modes** – “Price + Hours” or “Hours-only”, toggle on the fly.\n* ⚙️ **Custom hourly wage** – set pre-tax or after-tax income so the math feels personal.\n* 🔒 **Privacy-first** – no tracking, no ads; everything runs locally in your browser.\n\n**Try it out** Chrome Web Store: [https://chromewebstore.google.com/detail/%E8%A1%9D%E5%8B%95%E8%B3%BC%E7%89%A9%E6%8A%91%E5%88%B6%E5%99%A8-pausebuy/imbaoelmkgfojohehkdloaihgjngdccn](https://chromewebstore.google.com/detail/%E8%A1%9D%E5%8B%95%E8%B3%BC%E7%89%A9%E6%8A%91%E5%88%B6%E5%99%A8-pausebuy/imbaoelmkgfojohehkdloaihgjngdccn)\n\n**Back-story**\n\nA quick proof-of-concept video I posted on Threads Taiwan hit \\~1 M views in a week. The flood of DMs shaped the final product (the dual display modes came straight from user feedback). Now that the extension is live, I’d love to hear what the r/sideproject community thinks.\n\n**Looking for**\n\n1. **UX feedback** – Is the overlay helpful or distracting? Any edge cases I missed?\n2. **Feature ideas** – multiple wage presets, daily budget reminders, etc.\n3. **Launch advice** – best ways to reach personal-finance or minimalism communities outside Taiwan.\n\nThanks for reading, and 謝謝你們 in advance for any feedback! 🙏",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2345,
    "downs": 0,
    "created_utc": 1749279998.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/g3x367kdfg5f1/DASH_720.mp4?source=fallback",
        "has_audio": false,
        "height": 720,
        "width": 1098,
        "scrubber_media_url": "https://v.redd.it/g3x367kdfg5f1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/g3x367kdfg5f1/DASHPlaylist.mpd?a=1770353715%2CMjE0MzRjMTg3MTBlODg2Y2M2NTUyYjdlZGMzZWMzMDdhZjZhODdjNjAzYmFjMWI0OTc5MzExZDJhOWYwMTFmMw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 19,
        "hls_url": "https://v.redd.it/g3x367kdfg5f1/HLSPlaylist.m3u8?a=1770353715%2CZDExMjQzZWUyNmVmOWQ1ZjE3M2NjNmRmMTdmY2Y0OTIzOGQyMDJmY2ExY2UxMDg3NTQ1M2RhMTA4NDhlYzI2MQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 185,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.247584479888468
  },
  {
    "score": 2305,
    "title": "I invented a timelapse camera for houseplants and brought it to market (I quit my 9-5 as software engineer for this)",
    "selftext": "This is my biggest project so far. Today is September 15, 2025, and I first started tinkering with the idea back in November 2024. I got serious about it around February 2025.\n\nI’m incredibly proud of what I’ve built. It’s a complex piece of work, and it took countless late nights. I had to bring together so many different technologies and skills I’ve taught myself over the years. I’m 28 now, and when I was 18, I made the decision that I didn’t want to wake up at 30 full of regret. *The pain of discipline or the pain of regret.* Consume less, produce more.\n\nThe idea came after I started my first job as a software engineer and moved into my first apartment with big, bright windows. For the first time, I could actually have houseplants, something I’d wanted for years. Around the same time, I picked up two new hobbies: 3D printing and electronics. Those, combined with my software background, made this project possible.\n\nI made everything myself except the electronic module (ESP32-CAM, which I buy). Everything else, I built from scratch in just a few months:\n\n* Designed and 3D printed the case\n* Built the app\n* Set up the backend server with user management, authentication, image processing, video generation, AI models for enhancement &amp; interpolation, order management, password resets, device management\n* Programmed the ESP32 logic\n* Built the shop website (no Shopify)\n* Created and managed social media accounts to find customers\n\nMy product has been live for about 4 months now, and I’ve made double-digit sales. Not a lot yet, but I’m confident I can grow this with better marketing. I’m more of a maker than a marketer, so this part is challenging for me. You can check out my videos on Instagram at **plantcam.io**.\n\nStarting today, I’m committing to posting one video every single day. The product is stable and delivers great results — my main issue is that I’ll run out of money soon if sales don’t pick up. But honestly, I’m happy and proud of what I’ve built.\n\nI’d love to hear feedback. Please keep it constructive — I’ve had plenty of positive reactions, but there are always a few people who just throw negativity around. Otherwise, I’m happy to answer questions.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2305,
    "downs": 0,
    "created_utc": 1757970561.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/4giifg0w8epf1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1920,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/4giifg0w8epf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/4giifg0w8epf1/DASHPlaylist.mpd?a=1770353715%2CMWY3ZjQ4NDA0ZTMxZmEyMWZhYTBiNzUxNDYzY2U2NWI0YmUyZTVhMjg2ZjkzYzM4OWFjZjgxNTdmYTQxMDNiMg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 38,
        "hls_url": "https://v.redd.it/4giifg0w8epf1/HLSPlaylist.m3u8?a=1770353715%2CNmJlNzYwYmMwMTI2MTVmY2FlZGNiNDM3YWEzZGM3MTNlMDUyMzliMTExMjU1ZDlkZDlkMDJhMGQ1ZjIxODI5ZA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 189,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.237236103435095
  },
  {
    "score": 2173,
    "title": "My App surpassed $100k in revenue",
    "selftext": "My app just reached 100k in total revenue, and it’s growing (mostly organically).\n\nRevenue for the last month is approaching 12k, so 2025’s yearly revenue will easily exceed 100k as well.\n\nNot a unicorn yet, but fuck yeah, it’s profitable and it’s the most important thing I have done in my life.\n\nSo this post is to celebrate, share my experience, and make it useful for my fellow solo hackers.\n\n**Why I Built It**\n\nThe app itself is a language-learning app and it’s a textbook example of doing something you would buy yourself if it existed. I am a polyglot, and I love learning languages. All my adult life I’ve been in a constant process of learning a foreign language - brushing up my French or Spanish, refreshing my Polish, dabbling into Japanese and Mandarin, or speedrunning Slovak to actually use it in Slovakia.\n\n*If anyone is interested in the method itself, it’s a speech-centric approach based on the comprehensible input hypothesis, the comprehensible output hypothesis, and spaced repetition for memorization:* [*in more detail*](https://www.reddit.com/r/Natulang/comments/1e96ujj/natulang_speechcentric_language_learning/) \n\nAfter years of learning, I had my learning approach sharpened and polished: a simple strategy to go from zero to conversational in a foreign language fast and with consistent results. I was incredibly disappointed that no one had implemented anything similar to it in a single-app package. After another futile effort to find such an app, I decided to develop my own. Luckily I’m a software engineer and a really good one, so I decided to make yet another language-learning app.\n\nThe path from first commit to release took only 5 months, and another 2 months to add enough content to start premium subscriptions. Two years later, it’s 100k.\n\n  \n**The Hiring Myth (The useful part)**\n\n[*Hire the best*](https://youglish.com/pronounce/hire_the_best/english#google_vignette)\n\nI promised this post would be useful to you, so here starts the useful part. There are plenty of advice for entrepreneurs, but I feel like most of it is just bullshit circulating. Everyone repeats the same things: \"Think big\", \"Hire the best\", \"Look for a blue ocean\", \"Develop your brand\", \"Make a product that users love and it’s enough\", and so on, without actually putting any meaning in these words.\n\n***There is no rule that is universally applicable, not even this one.***\n\nAnd despite being true, “Hire the best” isn’t very useful until you have a strategy for doing it.\n\nI’ve heard it thousands of times in different forms: \"Hire the best\", \"A’s hire A’s, B’s C’s, C's hire dogs\", \"If you hire the best people you will succeed even if you do everything else wrong\". I’m sure you can continue the list.\n\nBut the question is: \"**How?**\" How do you actually hire the best?\n\nTo release the app, I needed a native Spanish linguist to create content for the course.\n\nAfter 20 years in software development, having been interviewed at Amazon, FB, Google, and Microsoft, and conducting countless interviews myself, I knew that hiring is hard. But my task seemed simple and straightforward, and I didn’t expect any pitfalls. So I just followed my first instinct: \"Hey, Facebook friends, can you recommend a Spanish-native linguist?\" And I got a recommendation, of course.\n\nYou can’t underestimate the incompetence of a linguist found through Facebook. I won’t go into details, but it was a train wreck: a complete inability to write high-quality content, a failure to follow simple three-step logic, and constant schedule disruptions.\n\nAfter this failure, I knew that if I wanted to make an app for 20+ languages, I needed a more robust and predictable process.\n\n**The Right Process**\n\nMy logic was simple - if you take 20 random linguists, their skill levels will likely follow a normal (bell-curve) distribution. So out of 20, you get about 3 great, maybe one exceptional, and 10 will be below average. For my project, having a \"great\" linguist was enough.\n\nFinding a pool of hundreds of specialists is easy nowadays -Fiverr, Upwork, and other services help.\n\nHow do I evaluate skills? This part is straightforward. I needed linguists to create content in the form of lessons, so the test task was creating a lesson. Upon success, I gave two additional lessons to work closely with them and check communication skills.\n\nOf course, all interview tasks were paid at the candidate’s standard rate; otherwise, you can’t convince a dozen competent people to dedicate even a few hours of their time.\n\nTo find my Spanish linguist, I conducted seven interviews and hired the best one. The candidate was great: smart, creative, precise, and logical.\n\nSince then, I’ve conducted nearly 100 interviews, and I’m very happy with the results. I hired five more linguists, and working with each of them is a delight.\n\nSo the playbook is as follows:\n\n1. **Skill distribution is a bell curve**: if you need great talent, run \\~10 interviews. If you need an exceptional one, be ready for 20+.\n2. **Evaluate with real work**: your interview/test should mirror the actual tasks.\n3. **Compatibility fit**: follow up with a collaboration task for communication and teamwork.\n\nOf course, this playbook isn’t applicable everywhere, but in many cases it can greatly simplify your headhunting process, and don’t use your social networks for hiring – most likely, the \"talent\" you find will be the one no one else needed.\n\nThat’s it for today. If you want to check out my app, it’s called Natulang. It’s great on iOS or Mac (4.9 rating), not great on Android because of flawed speech recognition. It supports 8 languages now, and it’s really the fastest way to become conversational in a foreign language.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2173,
    "downs": 0,
    "created_utc": 1753082986.0,
    "media": null,
    "is_video": false,
    "num_comments": 235,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.258715541235329
  },
  {
    "score": 2102,
    "title": "I made an app that turn selfies into a perfectly aligned timelapse of your life",
    "selftext": "I started taking a selfie every day on Jan 1st, 2023, and by the end of the year, I realized how much time I wasted manually adjusting my photos for a timelapse. That’s when SelfieStory was born—to make documenting your growth easy and effortless.\n\nI think it’s perfect for tracking weight loss, watching kids grow, documenting hair changes, creating flipbooks, and capturing all of life's special moments in general.  \n\nIt’s a good resolution to take a selfie every day this new year! Would love any feedback and happy to connect / share more details.\n\nYou can find SelfieStory here:\nProduct Hunt: https://www.producthunt.com/posts/selfiestory\nApp Store: https://apps.apple.com/us/app/selfiestory-picture-everyday/id6736484622",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2102,
    "downs": 0,
    "created_utc": 1735815787.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/h5fvoofhbkae1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1440,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/h5fvoofhbkae1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/h5fvoofhbkae1/DASHPlaylist.mpd?a=1770353715%2COWJiMWM5ZDE5MzVhMmIxMmFhZDY1YWMxYjQ4NjE2YjEzMzk5ODE4YzQ3MzViOGIyMjQ4YmU4NmYxYjQ3OGEzMw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 79,
        "hls_url": "https://v.redd.it/h5fvoofhbkae1/HLSPlaylist.m3u8?a=1770353715%2CZjhmMDExM2QzNDQyZDBjNjA2ZGYxZmUwNDI4ZTkzMGRmODEyZTdlZWNlODFlZTlmMWVjMjEzMDQ5OTFiNDBjMQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 266,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.263594903368609
  },
  {
    "score": 1988,
    "title": "Two people in North Korea used my SaaS app!!!",
    "selftext": "Two people in North Korea used my SaaS app!!!  \n  \nSo I’ve been working on this little project called Text Blaster Pro a tool for sending personalized bulk SMS using your own phone plan.\n\nI check analytics every morning, and today I nearly spit out my coffee. Two new users… from **North Korea**! Like… what??\n\nI honestly didn’t think people there even had access to the internet.. Now I’m sitting here wondering who are they?!",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1988,
    "downs": 0,
    "created_utc": 1755478981.0,
    "media": null,
    "is_video": false,
    "num_comments": 119,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.065725406148248
  },
  {
    "score": 1965,
    "title": "Microsoft Rejected Me, So I Built My Own Excel...",
    "selftext": "Microsoft rejected my job application… so I built my own terminal-based Excel viewer: vex\n\nI think if Vim and Excel had a child raised by a Go developer… it would look like this.\n\nI wrote vex because I got tired of Excel roasting my MacBook fans alive. LibreOffice feels like it was coded in Minecraft. Numbers refuses to open actual CSVs.\n\n**Features:**\n\n* hjkl navigation\n* / search\n* Jump to cell\n* Copy row/cell\n* Formula toggle\n* Themes\n* Tab/Shift+Tab - Next/previous sheet\n* Live charts: bar, line, sparkline, pie\n* Visual range selection + immediate charting\n\nThis is my apology to every dev who’s ever opened a CSV larger than 500 rows.\n\n**Edit:**\n\nThe link: [https://github.com/CodeOne45/vex-tui/](https://github.com/CodeOne45/vex-tui/)\n\nPS: I never open-sourced a project, so most doc and structure is vibe-coded",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1965,
    "downs": 0,
    "created_utc": 1764239648.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/bwxz0c552s3g1/CMAF_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1670,
        "scrubber_media_url": "https://v.redd.it/bwxz0c552s3g1/CMAF_96.mp4",
        "dash_url": "https://v.redd.it/bwxz0c552s3g1/DASHPlaylist.mpd?a=1770353715%2CYTc2ZWYyZmEyNGM3YzkwNzk0NjI3N2E0OTQ2NjRlYjRkYjc4YzJmYzU2NjlkODc4YTgyMTM2NzRjOGNiY2NiNg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 67,
        "hls_url": "https://v.redd.it/bwxz0c552s3g1/HLSPlaylist.m3u8?a=1770353715%2CZmE4ZGM5ZWE1MjQ4ZDgzMmQxOWVlOTcyZmE4ODQ2YWFkOGZkZmZkNTQwZjQwMjUwOTRlNDk4N2YyNzI0OTQyYg%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 183,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.153492425000885
  },
  {
    "score": 1901,
    "title": "I've launched 37 products in 5 years and not doing that again",
    "selftext": "After launching 37 different products over the last few years, I’ve had one go viral and almost all the others struggle to get any traction at all.\n\nLike many indie makers, I used to think the best strategy was to just keep launching, make more bets, and hope one finally catches fire.\n\nBut here’s what I’ve learned:\n\n* Virality is rare and nearly impossible to predict\n* Most of my launches that failed didn’t actually fail, they just grew much slower than I expected\n* My current project, Refgrow, took over 6 months to get the first paying customer, but now it’s growing slowly and steadily with almost no marketing budget\n* Sticking with one project and improving it, even when growth is painfully slow, seems to produce more consistent results than chasing the next hit\n\nI’m curious, for those of you who have been building for a while:\n\nDid you find success by focusing on one project and giving it time, or by making lots of new bets?\n\nHas \"slow growth\" ever paid off for you?\n\nIf you had to start over, would you pick patience or a high volume of launches?\n\nWould love to hear stories, lessons, or any advice from other indie founders in the same boat.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1901,
    "downs": 0,
    "created_utc": 1753093697.0,
    "media": null,
    "is_video": false,
    "num_comments": 246,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.203058989231228
  },
  {
    "score": 1900,
    "title": "After 4 months of late nights, my app Comforto finally made it to the App Store",
    "selftext": "Hey everyone,\nI’ve always been the kind of person who starts too many ideas and rarely finishes one.\nBut this time I actually saw it through.\n\nFour months ago, I had this weird little thought during an awkward social moment — “What if I could just trigger a real phone call to get out of this?”\n\nThat thought became Comforto — an app that gives you a real phone call when you need one:\n\t•\tA friendly voice to calm you before a big interview or class\n\t•\tA believable excuse to leave an uncomfortable situation\n\t•\tOr just someone to “call” when you’re feeling anxious or alone\n\nI had zero experience with voice agents when I started. I broke things constantly.\nApple rejected my first two submissions.\n\nBut after endless debugging and a few sleepless nights… it’s live.\n\nI’m not expecting it to blow up or anything, but I’m proud it exists.\nIf it helps even one person feel a little safer, calmer, or more in control — that’s enough.\n\nPlease give it a try and let me know how was your call experience\nhttps://apps.apple.com/in/app/comforto-anxiety-relief-calls/id6754062249\n\nIf you’ve ever launched something after months of uncertainty, you probably know that quiet, surreal feeling when it finally goes live.\nThat’s where I’m at right now.\n\nAnyway, just wanted to share that small win.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1900,
    "downs": 0,
    "created_utc": 1761460105.0,
    "media": null,
    "is_video": false,
    "num_comments": 251,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.199682387256215
  },
  {
    "score": 1776,
    "title": "Built a Fake DM creation tool (went viral on X and got Featured on TechCrunch)",
    "selftext": "My friend posted on X about their new tool, went viral (over 725K views and 10k likes) and got featured on TechCrunch! I joined in to help him build.\n\n**Mockly** is a web app to create realistic-looking DM conversations for Telegram, WhatsApp, Instagram and 10+ other platforms. It's simple to use: Upload two photos (or don't) and start typing. Mockly creates the interface in realtime and lets you switch between platforms and light/dark mode. Export your creation as an image or video (coming soon).\n\nThe first paying customers are coming in and we're gathering as much information about their needs to improve our product. You can use it for free, so let me know what you think!",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1776,
    "downs": 0,
    "created_utc": 1752510659.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/08c4nbxdpucf1/DASH_720.mp4?source=fallback",
        "has_audio": true,
        "height": 720,
        "width": 966,
        "scrubber_media_url": "https://v.redd.it/08c4nbxdpucf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/08c4nbxdpucf1/DASHPlaylist.mpd?a=1770353715%2CZDY2NzRjMjUyMGExMTQ0ZThmODdjNTRkMDY2NGEyNzNjNDcxZGE0Njg3MzIzOTFkZThlMmNhZWNiOWNiOGRiZQ%3D%3D&amp;v=1&amp;f=sd",
        "duration": 32,
        "hls_url": "https://v.redd.it/08c4nbxdpucf1/HLSPlaylist.m3u8?a=1770353715%2CMTFjMzA5MWU2YmQ0MzUwNDFhZmRjMjM5YjQ5NDcwMjA5NjdjOGQ1NzgzMzk5MjI4MDVlYTBhN2UwNDgxOWRiYg%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.068109221777688
  },
  {
    "score": 1767,
    "title": "LLM running locally on a business card",
    "selftext": "I just made the world first business card with LLM running locally lol. So that I can give one out to everyone and let them chat to a ghost version of “me”.\n\nBest part is I designed it to be an Ouija board. So it has a fitting vibe.\n\nIf you would like to know more about the design process and how this works: https://youtu.be/WC3O2cKT8Eo\n\nThe source code and schematics can also be found in the description of the youtube video.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1767,
    "downs": 0,
    "created_utc": 1757195556.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/tdl9s9pg8mnf1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1920,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/tdl9s9pg8mnf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/tdl9s9pg8mnf1/DASHPlaylist.mpd?a=1770353715%2CYTgyODEzNDA5N2YwMjM0ZjA3YTEzY2U0ZmVmNTQyNGUxMzBjZTQyYzRmZmY5MjJlOThjYWI2NmEyOGUxZWI2Ng%3D%3D&amp;v=1&amp;f=sd",
        "duration": 37,
        "hls_url": "https://v.redd.it/tdl9s9pg8mnf1/HLSPlaylist.m3u8?a=1770353715%2CMjMzZjBiMDg5NDQ4ZDMzN2M5YzVjZDY5ZDU2MzBlYmI3YTk5M2FjMzRjMDU0NGM5NTdkY2NiN2ZjY2NkYzAzNA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.905031280684184
  },
  {
    "score": 1744,
    "title": "I made a site where you can send AI Prompts to a guy",
    "selftext": "Hello! This project is more of a thought experiment than anything else - if people could ask a person instead of an AI, would they? How would the quality of responses differ? What are people asking AI that a human could feasibly fulfil?\n\nIt's a silly one, I know, but- If anyone is interested in trying it out, I'd love to give some folks free credits for giving it a try, just to see what happens. I promise - I'm not going to be posting anyone's prompts, or otherwise putting them online. \n\nFor anyone interested, it's gregtheguy.com \n\nI'll give 5 free credits to the first 10 people to sign up, maybe more. Honestly, the paywall is mainly just to keep the site from being flooded and/or abused. \n\nThanks!",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1744,
    "downs": 0,
    "created_utc": 1754504963.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.041962315542702
  },
  {
    "score": 1713,
    "title": "I made a visual grid that shows your subscriptions sized by how much they actually cost you",
    "selftext": "Built this simple tool that turns your subscriptions into a proportional treemap - bigger boxes = bigger monthly spend. Makes it pretty obvious which services are eating your budget.\n\nNo signup, works right in the browser.\n\nTry it here: [Subscription visualizer](https://visualize.nguyenvu.dev)\n\nEdit: I didn't know it would get this much support from people. I will add more things that people requested and public the source code. You can join my [Discord](https://discord.gg/7M2ubuNxQU) server to wait for my announcement when its done\n\nEdit 2: Added more features and the source code, see [here](https://www.reddit.com/r/SideProject/comments/1ple3vd/update_i_made_a_visual_grid_that_shows_your/)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1713,
    "downs": 0,
    "created_utc": 1765359585.0,
    "media": null,
    "is_video": false,
    "num_comments": 224,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.152602076642861
  },
  {
    "score": 1683,
    "title": "5 years, 30+ failed projects… and finally one that’s growing",
    "selftext": "I could have stopped in 2021 or 2022 after many failures, but I kept building.\n\nI know indie makers who managed to become successful very quickly, but in 90% of cases it does not happen fast.\n\nFrom my experience (and from talking to many other indie makers) I’ve learned that 3 years is about the time it takes for most indie makers to start earning enough to work on their projects full time.\n\nI’m still building new products despite already having profitable ones.\n\nMy latest project, [Refgrow](https://refgrow.com), is the simplest way for SaaS founders to add an affiliate/referral program inside their app in minutes. I launched it because I saw how powerful referrals can be for growth and I wanted to make it effortless for other founders.\n\nIt has already brought in thousands in revenue and is growing faster than I expected. But none of this would have happened if I hadn’t started building and launching projects one after another back in 2021.\n\nThe main lesson: Consistency beats luck. Keep shipping, keep learning.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1683,
    "downs": 0,
    "created_utc": 1755163376.0,
    "media": null,
    "is_video": false,
    "num_comments": 184,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.087427951365138
  },
  {
    "score": 1621,
    "title": "My Chrome extension has hit 20 lifetime license sales! 🥳",
    "selftext": "I built a chrome extension as a distraction-free alternative to Grammarly.\n\nTo improve your articulation, vocabulary, and tone wherever you write.\n\nWith BYOK support.\n\nLink: [https://wandpen.com/](https://wandpen.com/)\n\nCouple of days ago, I have posted the update of it hitting 10 sales. Today, I have crossed 20 lifetime license sales. 🥳\n\nIf you have a question about building Chrome extensions, or BYOK apps, I would love to answer them.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1621,
    "downs": 0,
    "created_utc": 1761027803.0,
    "media": null,
    "is_video": false,
    "num_comments": 180,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.066390137309729
  },
  {
    "score": 1621,
    "title": "I built a free tool that turned my 15 PTO days into 53 days off",
    "selftext": "Hey r/SideProject,\n\nI was frustrated with how inefficiently I was using my limited PTO days, so I built **Holiday Optimizer** \\- a free tool that finds the optimal placement of vacation days around weekends and holidays to maximize your time off.\n\n**My personal result:** By strategically positioning my **15 PTO days** around weekends, public holidays, and company days off, the tool helped me get **53 total days off**!\n\n# How it works:\n\n1. Enter your annual PTO allowance.\n2. Select your preferred break strategy (long weekends, week-long breaks, extended vacations, etc.).\n3. Add any public holidays or company-specific days off (like Summer Fridays).\n4. Get your optimized schedule instantly, visualized on a calendar.\n\nThe tool only suggests future dates for the current year, ensuring the plan is practical.\n\n# Check it out:\n\n🔗 **Live Tool:** [https://holiday-optimizer.com](https://holiday-optimizer.com)\n\n**💻 Tech Stack:** Next.js/React, TypeScript, Tailwind CSS\n\nI'd love to hear your feedback! What strategies do *you* use to maximize your time off? I personally prefer week-long breaks (7-9 days) as they seem to give the best balance.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1621,
    "downs": 0,
    "created_utc": 1743278674.0,
    "media": null,
    "is_video": false,
    "num_comments": 176,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.076537483056041
  },
  {
    "score": 1553,
    "title": "I was working on a reverse farming game (where animals farm human products) along with my job.",
    "selftext": "Last year I got an amazing response to my game's idea which led me to quit my job and now I am regretting it as I am not able to find any publishers to fund my game.   \n  \nAnyways, the game is called Chiklet's Human Products and Whatever we do to animals on real farms, in this game, animals do to humans :)\n\nHow do you like the idea? I would love some feedback from you guys.\n\nHere is the [Steam Page](https://store.steampowered.com/app/3643250/Chiklets_Human_Products/?beta=1&amp;utm_source=reddit&amp;utm_medium=post&amp;utm_campaign=redditorganic), If any of you play games on steam, please consider wishlisting as it helps me a lot.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1553,
    "downs": 0,
    "created_utc": 1745179010.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/6vvp6bffo1we1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1080,
        "width": 1920,
        "scrubber_media_url": "https://v.redd.it/6vvp6bffo1we1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/6vvp6bffo1we1/DASHPlaylist.mpd?a=1770353715%2CZGU3MDkyODI5ZmYzMjQ4Y2RlZTkxYzJiNzk4ODkyY2RlM2VjODI4YjdhOGVkYmI4MzYxN2RmZjA3YWNiOWIwYw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 47,
        "hls_url": "https://v.redd.it/6vvp6bffo1we1/HLSPlaylist.m3u8?a=1770353715%2CMGRhYjRhYzNhNjEyMjU2ZTBhNDY3ODZjMmE0NzcxNmQyMTMzNDg2MWE1N2IyNmZlNWM5NzllYTQ2NDg5ZGFhOQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 210,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.088592242113742
  },
  {
    "score": 1537,
    "title": "I did it! $0 in 30 days!",
    "selftext": "Wanted to share what worked — or didn’t — for me — especially if you’re launching with no audience — no idea what you’re doing — and a burning desire to make exactly zero dollars.\n\nI built a tool — for no one in particular — and hit $0 revenue in just 30 days — that’s right — not a typo — not a humblebrag — just a bold, brutal zero.\n\nBut the surprising part?\n\nNone of it came from my blog — or SEO — or ads — or outreach — or basic product research — or asking literally anyone if they wanted this — or if it even made sense.\n\nIt came from — absolutely nowhere.\n\nBecause:\n- No one shared it in Facebook groups — because I wasn’t in any — and also — it sucked.\n- It wasn’t mentioned in newsletters — not even my own — because I forgot to send them.\n- No one embedded it in their tools — because no one knew it existed — not even my mom.\n\nThese weren’t random affiliates — because I had no affiliates — I didn’t even have a dashboard — or a login — or a reason to exist — honestly.\n\nI used a small tool I built — called Noflow — it just tracks my existential dread — directly into the UI — no redirects — just raw, native failure.\n\nThis is the first time I’ve seen distribution happen — in reverse.\n\nLike people actively avoiding it — as if visiting the site would somehow deduct money from their bank account.\n\nHappy to share how I set this all up — or how I convinced myself this was a good idea — if anyone wants a roadmap to rock bottom.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1537,
    "downs": 0,
    "created_utc": 1745506325.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.91369780974238
  },
  {
    "score": 1540,
    "title": "I am a lazyfck so i am building this",
    "selftext": "I keep downloading fitness apps and never using them. tried everything - myfitnesspal, nike training, all of them. download, use twice, delete.\nso im building something different. app tracks your actual workouts using your phone camera (works offline, no cloud bs). when you skip workouts it roasts you. when you try to open instagram or tiktok it makes you do pushups first. ( i have integrated like 28 exercises)\n\nstill early but the camera tracking works pretty well. reps get counted automatically and it knows if you are cheating,  will also detect bad posture etc.  \n\nCurios to see your comments, roasting etc.  If you want to get involved in this project, please dm me.\n\nI didnt know that i can edit the post  ;-( \n\nHere is the link to join the waitlist -- https://lazyfcks.vercel.app\n",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1540,
    "downs": 0,
    "created_utc": 1756065135.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/nx8fq7j7v0lf1/DASH_720.mp4?source=fallback",
        "has_audio": true,
        "height": 1280,
        "width": 590,
        "scrubber_media_url": "https://v.redd.it/nx8fq7j7v0lf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/nx8fq7j7v0lf1/DASHPlaylist.mpd?a=1770353715%2COGEwYjNiZjQ0YTQ5YmMxNzFmZjY0YWZlZWNlYTgzNGFlYzQ3YjljZDE1YzU3OWVjNjFjOTc3MTMzZjgwZjZhOA%3D%3D&amp;v=1&amp;f=sd",
        "duration": 10,
        "hls_url": "https://v.redd.it/nx8fq7j7v0lf1/HLSPlaylist.m3u8?a=1770353715%2CNWFjYWQyMjZiMDJmYTg5ZDQzN2I0OTk3Mjk1MzUzZjgxNGE0MjI4YjdhNWE2NTAwN2Y2ZTMyNzc1ZWJjODc3ZQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 339,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.188542097239547
  },
  {
    "score": 1527,
    "title": "I built a free tool that turned my 15 PTO days into 56 days off",
    "selftext": "Earlier this year, I built [Holiday Optimizer](https://holiday-optimizer.com) — a small free tool that helps you line up your PTO with weekends and holidays so a few scattered days off turn into real breaks.\n\nIt kinda went a little viral, and a bunch of people used it and shared great feedback — things like *“Can you plan by fiscal year?”*, *“My weekends are Fri–Sat,”* and *“What if I’ve already booked trips?”*\n\nSo I took some time to rebuild it properly.  \nNot a patch — just a cleaner, better version of the same idea.\n\n✨ **What’s new**\n\n**Flexible timeframes**  \nPlan for *2025*, *2026*, or any **custom 12-month window** — handy if your company resets PTO mid-year or runs on a fiscal cycle.\n\n**More personal options**  \nAdd vacations you’ve already booked so the tool plans around them.  \nCustomize weekends — Fri–Sat, Sun–Mon, whatever fits your schedule.\n\n**Cleaner flow**  \nLoads faster, looks tidier, and finally feels great on mobile.\n\n🧩 **Still here**\n\nAdd company days off like summer Fridays or winter shutdowns.  \nCombine public holidays with PTO for longer runs.  \nAutomatically skips past dates — every suggestion is bookable now.\n\n🪴 **Try it**\n\n1. Enter your PTO allowance\n2. Pick your timeframe\n3. Choose your break style — long weekends, week-longs, balanced mix, etc.\n4. Add holidays, company days, or existing trips → see how to stretch your PTO the farthest\n\n🔗 [**holiday-optimizer.com**](https://holiday-optimizer.com)\n\nWe spend enough time optimizing work.  \nThis one’s for optimizing **rest**.\n\nFor my setup (15 PTO days + 12 used public holidays + 7 used company days), the tool found a way to reach **56 total days off** in 2026.\n\nIf you used the old version, I’d love to hear how this one feels.  \nIf you’re new, try your 2026 plan — it’s quietly satisfying seeing how much time you can reclaim.\n\n\n\n\n\n**Bonus**\n\nI’ve started to see people share their results — a TikTok, a few tweets, a couple of LinkedIn posts.  \nIt’s been fun watching how differently everyone uses it depending on their holidays or country.\n\nIf you’re into making short posts or videos, this works great for that *“smart little hack”* moment — like *“how I turned 15 PTO days into X days off.”*  \nIf you share one, tag or mention [holiday-optimizer.com](https://holiday-optimizer.com) — I'd love to see it.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1527,
    "downs": 0,
    "created_utc": 1762088727.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.007168983767512
  },
  {
    "score": 1505,
    "title": "After quitting my job and a 5 year relationship heartbreak I decided to go all-in on my first app: SnapTask!",
    "selftext": "Hey everyone!\n\nI'm excited to share with you my accomplishment. Since I was a teen (around 2010) I started to become obsessed with the Apple world and the tech world in general and I always wished to create something on my own, but I never fully commited. Now at the beginning of this year I quit my job as a clerk because of stress and soon after that me and my girlfriend of a 5 year relationship broke up and I had to go live back with my parents. It has been a bit of a hard time.\n\nThen I was looking for ways to make cash and one day I was searching for a productivity app but couldn't find one that was exactly how I liked it, so I decided to give it a go and to try to create it myself and try to market it and finally get into the app business.\n\nAnd finally, after months of hard work, I managed to publish my app! I realize that it took me probably way too much considering what the app does but I'm still proud of my efforts and I intend to improve the app for a long time and keep it updated. (I actually managed to get my first customers on the app last week and it has been really thrilling, hoping of transforming it into an actually successful app).\n\n**Main features:**\n\nAside from the standard productivity features, I focused on **motivation**:\n\n\\-**Custom Rewards System:** You can set actual prizes for yourself when you complete tasks (this really helps with procrastination!).\n\n**-Long-term Vision:** I built dedicated sections for weekly, monthly, yearly and lifetime goals\n\n\\-**Time tracking and data:** Simple time tracking to see where your life is going.\n\n\\-**High customization of task recurrency**\n\n**-Diary and mood tracking**\n\n*(Working on the Apple Watch app and widgets for the next update!)*\n\n**Link to the App:**[https://apps.apple.com/us/app/snaptask-plan-your-life/id6746721766](https://apps.apple.com/us/app/snaptask-plan-your-life/id6746721766)\n\nI for sure would appreciate a lot your much valued feedback!\n\np. s.\n\nOn top of that, seeing how much fun I had working on the app I decided to try and make it my job to make apps for a living so I launched my website to make apps on commission.\n\nWhat do you think? I really need advice!\n\n[https://amadevs.eu/](https://amadevs.eu/)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1505,
    "downs": 0,
    "created_utc": 1765295562.0,
    "media": null,
    "is_video": false,
    "num_comments": 304,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.109974891538076
  },
  {
    "score": 1483,
    "title": "Starting your online business is so cheap today",
    "selftext": "• Figma: $0\n\n• Next.js: $0\n\n• Supabase: $0 (for up to 50k users)\n\n• Umami: $0\n\n• Resend: $0 (for up to 3k emails/month)\n\n• Domain: $10\n\n• Stripe: $0 (1.5% - 2.5% fee)\n\nIn the end, it’s just $10 and a couple of free hours per day — and you could potentially create a billion-dollar company.\n\nDon’t listen to pessimists who say, \"The chances are so low\" or \"Nobody will buy your product\". Low chances they have to get up off their lazy ass and start doing something themselves.\n\nI believe in you!",
    "subreddit": "SideProject",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1483,
    "downs": 0,
    "created_utc": 1732987883.0,
    "media": null,
    "is_video": false,
    "num_comments": 147,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.976564758640486
  },
  {
    "score": 1481,
    "title": "I’m a doctor from the UK. I have just launched an app to improve gut health!",
    "selftext": "Hi r/SideProject!\n\nJust released my second app after designing + building for ~6 months, alongside working as a resident doctor. \n\nThe app tracks fibre (fiber 🙄) plant foods and bowel habits, and calculates you a gut score.\n\nNo, it doesn’t count calories. Yes, you can analyse your poop with AI 🫠\n\nIt’s far from perfect atm, but it’s live. After trying too hard to perfect my last app (it failed), I’m trying to ship faster on this one.\n\nHere’s the link if you want to check it out: https://apps.apple.com/gb/app/gut-app-food-poop-tracker/id6744299849",
    "subreddit": "SideProject",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1481,
    "downs": 0,
    "created_utc": 1758288629.0,
    "media": null,
    "is_video": false,
    "num_comments": 258,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.097498085683935
  },
  {
    "score": 1479,
    "title": "Stop building useless sh*t",
    "selftext": "\"Check out my SaaS directory list\" - no one cares\n\n\"I Hit 10k MRR in 30 Days: Here's How\" - stop lying\n\n\"I created an AI-powered chatbot\" - no, you didn't create anything\n\nMost project we see here are totally useless and won't exist for more than a few months.\n\nAnd the culprit is you. Yes, you, who thought you'd get rich by starting a new SaaS entirely \"coded\" with Cursor using the exact same over-kill tech stack composed of NextJS / Supabase / PostgreSQL with the whole thing being hosted on various serverless ultra-scalable cloud platforms.\n\nJust because AI tools like Cursor can help you code faster doesn't mean every AI-generated directory listing or chatbot needs to exist. We've seen this movie before - with crypto, NFTs, dropshipping, and now AI. Different costumes, same empty promises.\n\nNope, this \"Use AI to code your next million-dollar SaaS!\" you watched won't show you how to make a million dollar.\n\nThe only people consistently making money in this space are those selling the dream and trust me, they don't even have to be experts. They just have to make you believe that you're just one AI prompt away from financial freedom.\n\nWhat we all need to do is to take a step back and return to fundamentals:\n\nIdentify real problems you understand deeply\n\nUse your unique skills and experiences to solve them\n\nBuild genuine expertise over time\n\nCreate value before thinking about monetization\n\nTake a breath and ask yourself:\n\nWhat are you genuinely good at?\n\nWhat problems do you understand better than others?\n\nWhat skills could you develop into real expertise?\n\nLet's stop building for the sake of building. Let's start building for purpose.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1479,
    "downs": 0,
    "created_utc": 1757775691.0,
    "media": null,
    "is_video": false,
    "num_comments": 205,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.047195325579534
  },
  {
    "score": 1424,
    "title": "I Built a Pornstar Analytics Platform",
    "selftext": "Hello r/SideProject \n\n  \nI’m excited to share a professional analytics tool I developed to evaluate the return on investment (ROI) for adult film performers based on their real-time engagement metrics across video platforms. This tool, available at [insightengine.adultdatalink.com](http://insightengine.adultdatalink.com), provides actionable insights for stakeholders in the adult entertainment industry.\n\nThe tool is designed for content creators, producers, or investors who want to assess a performer’s market performance and potential ROI. It aggregates engagement data to quantify a performer’s \"stock value,\" helping users make informed decisions about collaborations, marketing, or content strategies.\n\n\n\n# How It Works\n\n**Data Sources**: The tool collects data from video platforms, including:\n\n   * Total video views\n   * Likes (based on ratings)\n   * Comments\n   * Followers (total videos as a proxy)\n   * Posting frequency (how often videos are uploaded)\n\n**Stock Value Calculation**: A performer’s stock value is computed using a weighted formula:textCollapseWrapCopy`stock_value = (0.3 × likes) + (0.2 × comments) + (0.3 × followers) + (0.1 × ratings) + (0.1 × post_frequency)`Each metric is normalized (scaled relative to the dataset’s maximum) to ensure fair comparisons.\n\n**Posting Frequency**: This measures how often a performer posts, calculated as:textCollapseWrapCopy`frequency = total_videos ÷ (days between first and last post + 1)`It reflects a performer’s activity level.\n\n**Engagement per Post**: Engagement is calculated for each video:textCollapseWrapCopy`engagement = views + (rating ÷ 5 × 100)`This combines views with a normalized rating (converted to a percentage).\n\n**Historical Stock Data**: The tool tracks stock value over time by comparing engagement (views and ratings) across posts, adjusting the value to reflect trends.\n\n\n\nTry the tool at [insightengine.adultdatalink.com](http://insightengine.adultdatalink.com) and share your feedback!",
    "subreddit": "SideProject",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1424,
    "downs": 0,
    "created_utc": 1751788701.0,
    "media": null,
    "is_video": false,
    "num_comments": 227,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.022782287844756
  },
  {
    "score": 1419,
    "title": "I worked 2 jobs to bootstrap this, spent 2 years researching, and almost a year building an app that can guess a mental state from phone sensor and usage data, and offer timely support",
    "selftext": "Hello wonderful people,\n\nI'm Alex 👋 I struggle with anxiety (*yes, I'm dying inside posting this).* I always thought it would be great to know when my mental health was about to go down, and what was affecting it, so I can manage it better. I interviewed over 100 people with mental health conditions from anxiety to bipolar ([Reddit helped](https://www.reddit.com/r/BipolarSOs/comments/16rlyvz/developing_a_help_tool_for_people_with_bipolar/)), and found the struggle was shared.\n\nBut what I kept hearing was:\n\n↳ seeing triggers and patterns is real help for mental health, \n\n↳ but it requires self-reporting (mood diary, journalling, etc.),\n\n↳ but self-reporting requires motivation,\n\n↳ and motivation is one of the first things that goes out the window when you're near an episode.\n\n*The hypothesis was that someone or something should be doing it for you for it to work.*\n\nSo in 2023, I started reading all the research I could find on predictions of mental state, and analysed all threads on triggers and early signs of mental health shifts here on Reddit ([bless Reddit](https://www.reddit.com/r/dataisbeautiful/comments/1mozybt/oc_most_frequently_mentioned_depression_symptoms/)). I met researchers who had been doing it since 2014.\n\nAround 10 months ago, a friend of mine, Varvara, and I started building. We created 6 versions of the approaches and the app. \n\nAll failed. \n\nHigh effort → Still high effort → IS IT A MENTAL HEALTH APP FOR... DOGS?! → Still high effort. \n\nWe kept iterating and finding a way to use sensor data as much as possible to model mood, habits, surroundings, events FOR users, instead of making a user self-report everything.\n\nNow it feels like we have a *minimum viable product* with what feels like a *good plan* to turn it into a *minimum valuable product*.\n\n**It's called Anticipate, and what it currently does is:**\n\n🧠 Analyses sleep (Apple Watch, or modeled based on device motion), activity, triggers and good events, weather, and travel, and makes a mood prediction with an explanation of why this prediction was made.\n\n🗓️ Automatically logs moods and factors in the calendar, so you can see correlations.\n\n🧡 Support: audio guided self-care routines (so far, recorded by me)\n\n**Who it's for:**\n\n* You want to monitor your mental health over time.\n* Life happens, and you don't have time to log things manually.\n* Your anxious/ADHD brain needs a clean non-stimulating design.\n\n*We keep working →*\n\n**What's in development:**\n\n* Free plan with full access to all essentials.\n* More pre-calculated insights to link to your mental health: exposure to sunlight, time outside, rest time, screen time, binge-watching, time with others, etc.\n* More and better self-care audio routines with real humans.\n* Real help hub with a collection of helplines, therapists, psychiatrists, etc.\n* Hopefully, getting closer to turning this lil side project into a **safe** useful tool that can help people with serious conditions. *That's why we started after all.*\n\n👉 Try it on the App Store - [https://apps.apple.com/gb/app/mood-tracker-anticipate-ai/id6746043684](https://apps.apple.com/gb/app/mood-tracker-anticipate-ai/id6746043684) **\\[WE MADE FULL VERSION OF IT LIFETIME FREE FOR TODAY &amp; TOMORROW SO YOU CAN TRY IT\\]**\n\n*p.s. We would appreciate any feedback, challenges, and guidance. And if you like it, we would really appreciate your kind review. It means more than you can imagine. I appreciate you.*",
    "subreddit": "SideProject",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1419,
    "downs": 0,
    "created_utc": 1758799466.0,
    "media": null,
    "is_video": false,
    "num_comments": 236,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.052162517388108
  },
  {
    "score": 1412,
    "title": "Bought an online business for $11K, 3x’ed my investment in 27 minutes",
    "selftext": "I was telling my friend this story and he got very excited, so I thought this might be a nice one to share here for some side project inspiration. I actually 3x’ed the investment in cash and I didn’t even account for the appreciation of the asset value. Here’s how I did that, sorry for the long read.\n\n\n\nFor some context, I have an online business with around 50 employees but on the side I really enjoy digging through sites like Flippa to find these small online businesses that are not monetized the right way. My favourite ones are the ones that can run on auto-pilot. \n\n\n\nWhen I say ‘auto-pilot’, I do mean that. I bought this website in 2013 and the site has not had anything added to it for it least 7/8 years. I don’t do any marketing and I don’t think about it. The only thing is that sometimes the site goes offline for some reason and then one of my devs gets pinged automatically and he fixes it. Then I have my assistant sending out an invoice once per quarter to the advertiser who bought all the ad space on the website. The advertiser pays $15K per year and has been doing this for the last 6/7 years or so. \n\n\n\nSo this website is a free vector website. It’s very simple; people google something, land on the website and can download the images without giving their email or anything. The images were created by the seller and his team.\n\n\n\nI found the website in 2013 when I was scrolling through Flippa and I felt right away that this could be a gem. The website was getting a lot of traffic, but the seller said he was banned from Google Adsense and monetized with Yahoo ads. He was making around $600 a month at 350K pageviews a month. \n\n\n\nI thought I could do better. \n\n\n\nAt the time, I already had experience buying websites from Flippa and I had my fair share of buying sites that turned out to be total crap. I would normally not buy sites before doing proper due diligence, but sometimes you just know something is good and then you need to be quick.\n\n\n\nThe site was for sale for around $12K I believe and after thinking things over for half an hour or so, I sent the seller a message saying ‘if you reduce the BIN price to $10K, I’ll click the buy button and we have a deal’. He was online and responded right away that he was willing to part with his site for $11K. ‘Deal’ I said.\n\n\n\nWe discussed details about the transfer and all but in the meantime I already started to execute my plan I had in mind to increase the income significantly. My thesis was that this site was very under-monetized. Just putting Adsense back on there would have already increased the income quite a bit, but I didn’t want to risk having my own Adsense account banned and I believed there would be better ways to monetize this site.\n\n\n\nSo from the moment I clicked the buy now button, I drafted a short email and sent it out to stock photo sites. There were many stock photo companies at the time that were well-funded and it seemed that the traffic of my fresh purchase was perfectly relevant for what they offer. It just made sense; you drive traffic from Google to free stock images, people click through to your website and when they visit the page to download the free image you came for, they’ll get slapped with ads from images that are often nicer than the free image. How these stock photos usually do this, is they show a widget on the publisher’s website that recognizes the theme of the main image on the page and they show related images from their database. It makes for a perfectly relevant ad that drives highly-targeted traffic to their website.\n\n\n\nSo back to the email I sent out. This was a very simple email saying ‘Hey I run this stock image website and we’re getting 350K pageviews per month. I’m looking for an exclusive partner to work with for our ad traffic and I really like the quality of your stock images. I’m sending this out to 3 companies that I think would be the best partner and I’m asking for what I think is a great deal for you as an advertising partner. I’m asking a fixed price of $3K per month with a minimum duration of 6 months. \n\n\n\nI quickly found the email of the marketing departments from the 3 biggest stock sites and sent this email to them. I quickly received an email from one of the companies saying ‘We’d like to buy the space for 12 months if you could give us one month for free’. My first thought was ‘damn, I’ve sold too cheaply’ but I realized this was actually a great deal, especially when I looked at the clock and saw that from the moment I bought the site, just 27 minutes past and I made a deal for $33K..exactly 3 times what I paid for the site. \n\n\n\nI lost that contract after a few years after losing a good bit of organic search traffic but signed another exclusive advertiser soon after for a lower amount. All good, because this site has really been passive income for many years with zero content updates and just paying for hosting and sending invoices to the advertiser. Most of the sites I bought in the past require more work, so don’t get all excited and start buying websites left and right.   \n  \nAny questions? Just ask. Not going to share the url though.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1412,
    "downs": 0,
    "created_utc": 1744171359.0,
    "media": null,
    "is_video": false,
    "num_comments": 175,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.992898495755633
  },
  {
    "score": 1401,
    "title": "We made a free tarot reading ai website with animated cards",
    "selftext": "We created [Tarotoo.com](http://Tarotoo.com), a fun free tarot card reading website.  While many people view tarot as a mystic dark science or strange secret thing for psychic reading and fortune telling, we believe it’s a fantastic tool for self-reflection and even entertainment. So we wanted to present tarot reading in an insightful and fun way in the same time.\n\nTo make the experience even more engaging , we’ve animated the tarot cards so each of them tell a small story, this add more liveliness to each reading. There are several choices for readings: between premade readings and Ai tarot. Support for several languages. No need for registration. I hope you enjoy it!\n\nedit: there is also an ai chat with a psychic and fortune teller too. video added\n\nhttps://reddit.com/link/1es8zo3/video/slhknjbk7tpd1/player\n\n",
    "subreddit": "SideProject",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 1401,
    "downs": 0,
    "created_utc": 1723659885.0,
    "media": null,
    "is_video": false,
    "num_comments": 451,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.224317231036331
  },
  {
    "score": 1392,
    "title": "I built a Visual Search Engine that lets you explore Reddit content (SFW + NSFW)",
    "selftext": "Got \\~300k Reddit images, GIFs and videos (from \\~550 subreddits) searchable so far.\n\nSearch uses AI (an embedding system similar to OpenAI CLIP) to understand image content, not just titles or keywords. You can search with queries like \"red car at night\" or \"drawing of city skyline.\" You can also filter by subreddit and NSFW/SFW.\n\nAnd if you like an image/GIF/video, there's a cool feature to find visually similar content.\n\nFeedback appreciated, and I'm happy to answer any questions!\n\n  \n[https://infini.wtf](https://infini.wtf)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1392,
    "downs": 0,
    "created_utc": 1746951502.0,
    "media": null,
    "is_video": false,
    "num_comments": 211,
    "num_reports": null,
    "over_18": true,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.034619046888339
  },
  {
    "score": 1357,
    "title": "After 1 year of building, my app finally made it to the app store",
    "selftext": "Hey everyone,\n\nI'm Don 👋 and I'm really bad at finishing things (posting this is scary af). \n\nWe built a web version of a budgeting app last year. A lot of our users said they preferred a mobile app version because they don’t have a lot of time to review transactions and keep up with their finances. \n\nSo me and my friends we decided to build an app (we had never built one before) \n\nSpent months trying to understand app development, apple legal procedures, etc.\n\nBuilt 7 versions. All sucked.\n\nToo gamified → Too boring → WAIT THIS IS JUST ANOTHER BUGDET APP\n\nBut we kept at it and built the app we would want to use to track our finances. It’s empathetic, practical and fun to use. \n\nIn simple words Hatching is a financial wellness app. We are not fully there yet but that’s our goal. As of now this is Hatching:  \n\n• Judgment-free support - Like having a financial friend who gets it\n• Track spending effortlessly - See where your money goes across all accounts\n• Save money automatically - Visual progress makes building savings fun and easy\n• Never miss bills - Smart reminders prevent costly late fees\n\n\nPlease give it a try. And message me if u have any questions \n\nhttps://apps.apple.com/ca/app/hatching-spend-smart-save/id6744309218\n\np.s. Would love any feedback or ideas. And if you like it, a review would mean everything. ",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1357,
    "downs": 0,
    "created_utc": 1759263058.0,
    "media": null,
    "is_video": false,
    "num_comments": 170,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.98439782514056
  },
  {
    "score": 1329,
    "title": "I wrote a python script that blocks me from coding until I hit 10,000 steps",
    "selftext": "I'm a software engineer by profession. I’ve been pretty regular with the gym, but not enough walking.\n\nSo I made a simple Python script that blocks me from coding until I hit 10,000 steps. If I haven’t walked enough, it just kills VSCode, the terminal, whatever I try to open on my laptop.\n\nIt runs in the background and syncs with Google Fit. Super basic, but it’s working. I’ve walked over **250 km** this month because of it.\n\nHere’s roughly how I set it up:\n\n* Created a Google Cloud project\n* Enabled Google Fit API\n* Set up OAuth 2.0 creds\n* Downloaded `client_secrets.json`\n* Installed the Google Fit Python libraries\n* Pulled today’s step count\n* If it’s under 10k, it finds and kills coding apps on my Mac\n\nIf this kind of stuff interests you, I’ve built a bunch of other weird little side projects:  \n[https://www.pankajtanwar.in/side-hustles](https://www.pankajtanwar.in/side-hustles)\n\nI’m also on Twitter:  \n[https://twitter.com/the2ndfloorguy](https://twitter.com/the2ndfloorguy)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1329,
    "downs": 0,
    "created_utc": 1753957327.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.877564889937398
  },
  {
    "score": 1317,
    "title": "My weekend side project ended up paying for my house. Still feels surreal.",
    "selftext": "I started it like any side project... just for fun. No plan. No deadline. No idea it would go anywhere.\n\nI was playing with a physics engine (**Box2D**), trying to make bridges wobble realistically. That turned into **Cargo Bridge**, a goofy web game where tiny porters tried to cross your fragile creations… often screaming as they fell.\n\nI threw it online without expecting much. But then traffic started rolling in. First a few plays. Then thousands. Then millions.\n\nEventually it passed 100 million plays. And the money I earned from it? I used it to build the house I’m sitting in right now.\n\nhttps://preview.redd.it/i94wx4dmq57f1.png?width=1536&amp;format=png&amp;auto=webp&amp;s=375b7bdb6443c346e6c2100e8c7e941c835f4d25\n\n👉 I wrote about the whole journey — the messy beginnings, unexpected virality, and what I’d do differently today. [https://medium.com/javascript-in-plain-english/i-just-wanted-to-play-with-physics-100-million-people-ended-up-playing-my-game-ba717a9756ef](https://medium.com/javascript-in-plain-english/i-just-wanted-to-play-with-physics-100-million-people-ended-up-playing-my-game-ba717a9756ef)\n\nIf you’re hacking on something weird on weekends… who knows where it might lead. Feel free to ask me anything!",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1317,
    "downs": 0,
    "created_utc": 1750022293.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8495760971493125
  },
  {
    "score": 1303,
    "title": "I spent a year building this cause I can't pay 200usd for a DAW just to record a voiceover.",
    "selftext": "The problem: I wanted to record voiceovers with professional audio effects. The \"solution\" was buying expensive DAW software, installing VST plugins, learning complex interfaces, and hoping my CPU could handle it all. Not exactly beginner-friendly.\n\nSo I built VocalLab - a browser-based audio processor that runs entirely locally.\n\n**What it does:**\n\n* Professional audio effects (EQ, compressor, reverb, gate) applied in real-time\n* Routes to OBS, Discord, Zoom, or any app via virtual audio cables\n* Records two tracks simultaneously: one with effects, one \"safety\" track without\n* Auto-saves every 5 seconds - even if your browser/PC crashes, your recording is safe\n* 100% local processing - audio never leaves your device\n\n**The goal:** Make professional audio effects accessible without learning Pro Tools or spending $600 on a DAW.\n\nEverything is free except custom presets and dual-deck processing (₹199/month or $5/month).\n\nCheck it out: [https://vocallab.io](https://vocallab.io)\n\nWould love feedback, especially on what features matter most to you!",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1303,
    "downs": 0,
    "created_utc": 1760305345.0,
    "media": null,
    "is_video": false,
    "num_comments": 137,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.92021713459652
  },
  {
    "score": 1287,
    "title": "I built real dark mode for my website - your cursor is now a flashlight",
    "selftext": "I spent my weekend building the most unnecessary portfolio feature - a real dark mode 🔦\n\nyour cursor is now a flashlight. everything else? complete darkness. move around to read. that's it.\n\nwhy? please don't ask that question :)\n\nyou can try it out on my website - [https://www.pankajtanwar.in/](https://www.pankajtanwar.in/) (theme switch on top right - works better in desktop though)\n\nThis isn't even my weirdest project. I've got a whole portfolio of questionable decisions here: [https://twitter.com/the2ndfloorguy](https://twitter.com/the2ndfloorguy)  \n  \nthe full collection if you're into weekend projects that make zero business sense: [https://www.pankajtanwar.in/side-hustles](https://www.pankajtanwar.in/side-hustles)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1287,
    "downs": 0,
    "created_utc": 1759642125.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/tlpxsvbta8tf1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1080,
        "width": 1894,
        "scrubber_media_url": "https://v.redd.it/tlpxsvbta8tf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/tlpxsvbta8tf1/DASHPlaylist.mpd?a=1770353715%2CNmJhMWU2YTIzNjQ4OTkzMjhmMThjNmQ2MDE4NDRiZTUzNjhkOGI5OTYwZWI2ODJlODIyZjg1Y2Y3Zjg4NzQ4Nw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 24,
        "hls_url": "https://v.redd.it/tlpxsvbta8tf1/HLSPlaylist.m3u8?a=1770353715%2CZWVjNWEwN2EzOTA5N2QyYjdiMzliZjNiZjE2YzNmYzg3OTExMWFkYWZlZjc3YWI2NGM0ODY2MjY5MWRmNmI2Ng%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 124,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.900870869527822
  },
  {
    "score": 1271,
    "title": "My completely free budget tracking app reached 8000 daily active users",
    "selftext": "Yesterday, for the first time, over 8,000 people used my app!\n\nI actually wanted to make the post at 10,000, but I just had to share it now.\n\nI made the app free at the beginning of 2024, and since then the number of users has been continuously growing.\n\nI’m just so happy :)\n\n\\-----\n\nI was frustrated with budget tracking apps, especially recurring transactions. Every app I tried seemed to break down at some point due to time zone glitches, syncing errors, or missed/duplicated recurring payments.\n\nSo I built my own.\n\nIt’s completely free, simple, and reliable. No subscriptions, no ads, no tracking.\n\nWould love your feedback!\n\n[https://apps.apple.com/us/app/budget-expense-tracker-monee/id1617877213?uo=4](https://apps.apple.com/us/app/budget-expense-tracker-monee/id1617877213?uo=4)\n\n[https://play.google.com/store/apps/details?id=app.monee](https://play.google.com/store/apps/details?id=app.monee)\n\n\\[Monee is currently the #1 budget tracker in Germany on iOS. Android version was just released 2 weeks ago\\]",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1271,
    "downs": 0,
    "created_utc": 1756652517.0,
    "media": null,
    "is_video": false,
    "num_comments": 312,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.087259280085619
  },
  {
    "score": 1150,
    "title": "I wrote a Python bot that automatically texts my mom when I stay late at work. So she doesn’t have to worry.",
    "selftext": "Just wanted to share something small I built.\n\nI usually call my mom every night. But some days, work runs late and I forget to update her — and she starts worrying.\n\nSo I wrote a Python bot that checks if I’m still connected to office WiFi after 7 PM. If I am, it sends her a message like:  \n**\"Still at work, might be a little late. Will call you in a bit or tomorrow morning.\"**\n\nIt’s nothing fancy, but it gives her peace of mind. Thought I'd share in case anyone finds it useful or wants to build something similar.\n\n\\------\n\nIf this kind of stuff interests you, I’ve built a bunch of other weird little side projects:  \n[https://www.pankajtanwar.in/side-hustles](https://www.pankajtanwar.in/side-hustles)\n\nI’m also on twitter, if you want to say hii :  \n[https://twitter.com/the2ndfloorguy](https://twitter.com/the2ndfloorguy)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1150,
    "downs": 0,
    "created_utc": 1754375513.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.738284786486938
  },
  {
    "score": 1145,
    "title": "I made $54k in 10 months from an app I built in my room",
    "selftext": "10 months ago I launched [Buildpad](https://buildpad.io/). It’s a platform where users research and build their products. It went on to make $54,000 which is kinda insane for me to think about.\n\nI was very new to marketing when launching it. The main channels I picked were X, Reddit, but also Product Hunt of course. So I just started building a following together with my app as it grew. This is a “hack” imo as long as you build a good or at least interesting product. As my product grew so did my following. It was like a self-feeding cycle.\n\nHere are my stats so far:\n\n- 10k+ total signups\n- 400 active paying subscribers\n- $54,000 revenue\n- 30k+ unique website visitors per month\n\nThis was unimaginable to me a couple of months ago and I’m genuinely thankful for reaching this point. But of course I want to continue growing and taking this even further. There’s no plan to stop and now I’m thinking about how to take this to $50k/mo and then $100k/mo.\n\nThe path I see forward from here is finding a marketing channel that I can scale. I’m looking at different ways of producing content right now for example. Because if I can figure it out myself first then I can start paying others to create content for me and that’s where I can see crazy scaling start happening. I will experiment both with content in written format and video format to see what works best. Paying others to create content is also where it becomes more passive for me.\n\nYou shouldn’t underestimate how far you can get simply by setting your aim very high and then working towards that and improving every day as you go. I’m super excited for my journey coming up in these next few months. If you’re on this same journey with me, keep going! We’re all gonna make it.",
    "subreddit": "SideProject",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 1145,
    "downs": 0,
    "created_utc": 1755705235.0,
    "media": null,
    "is_video": false,
    "num_comments": 221,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.914861104856691
  },
  {
    "score": 1136,
    "title": "Could this help people with phone addiction? (honestly)",
    "selftext": "This app basically asks you to say out loud a pre-imposted phrase before you can open a distracting app. I was thinking maybe instead of repeating a phrase, the user should say how much time they want to spend on it, like “5 minutes” and then the app would open only for that amount. \n\nThe point here is, speaking is a layer of friction that might be able to help those who struggle with the phone daily. \n\nWhat do you think?",
    "subreddit": "SideProject",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1136,
    "downs": 0,
    "created_utc": 1757581930.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.863806094215575
  },
  {
    "score": 1127,
    "title": "7 days, 61 commits — my first solo app is now live on the App Store!\nBuilt 100% by myself, from UI/UX and coding to marketing and operations.\nIt’s an incredible feeling to create something from scratch and have full control every step of the way.",
    "selftext": "1. Tech Stack  \n• iOS native only.  \n• Front-end: SwiftUI  \n• Back-end: Swift  \n• DB: SwiftData\n\n2. UI/UX  \n• Logo: spun up with GPT-4.  \n• A few marketing screens in Figma.  \n• All pages coded directly in SwiftUI. \n\n3. Site &amp; Policies  \n• Added a couple pages to the company site.  \n• Deployed in seconds via AWS Amplify.\n\n4. IDE Workflow  \n• 99% Xcode—hand-typed code, instant flow state.  \n• Used Cursor once to auto-generate demo data.  \n• AI = tireless intern. \n\nTry it on AppStore, any feedback is highly appriciated!  \n[https://apps.apple.com/us/app/fullpack/id6745692929](https://apps.apple.com/us/app/fullpack/id6745692929)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1127,
    "downs": 0,
    "created_utc": 1747879984.0,
    "media": null,
    "is_video": false,
    "num_comments": 169,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.902533560336461
  },
  {
    "score": 1064,
    "title": "My app made 17k this month 🤯 FINALLY the hard work is paying off.",
    "selftext": "Being a founder is tough but on days like this it makes it all worth it.\n\nI remember celebrating each sign up and now I suddenly find myself living the dream that only existed in my mind back then.\n\nWhat a crazy ride this has been!\n\nSafe to say, there’s been many low points and doubt along the way, and the work isn’t finished. This is only the beginning.\n\nBut there’s nothing quite like seeing my code in action, powering my app used by thousands.\n\nJust wanted to take this moment to reflect and share some inspiration with the community. \nFeel free to share your project in the comments too. I always like seeing what’s being built out there.\n\nHere’s my project: [aicofounder.com](https://aicofounder.com)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.83,
    "subreddit_type": "public",
    "ups": 1064,
    "downs": 0,
    "created_utc": 1758199385.0,
    "media": null,
    "is_video": false,
    "num_comments": 130,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.708485255602638
  },
  {
    "score": 1067,
    "title": "Got DDoSed and 24k fake users signed up in 2 hours — lessons learned",
    "selftext": "Last night, my little SaaS got absolutely wrecked.\n24,000 “users” signed up in just 2 hours. I didn’t know whether to feel flattered or cry.\n\nThe setup (aka: my false sense of security)\n\t•\tSignups were just a POST to my backend — no real validation.\n\t•\tI’d return a Stripe payment link immediately.\n\t•\tA task queue would handle the rest.\n\t•\tIf payment wasn’t completed in 20 min, the user was auto-deleted.\nI thought: “No one will spam a signup flow. It’s pointless. And the queue will handle it”\n…boy, was I wrong.\n\nWhat happened\nSomeone hammered the endpoint with a lot of traffic.\n\nThe queue filled up with tens of thousands of fake signups. My Mixpanel graph basically went vertical.\nNo actual user data was lost or compromised — they just sent so much that it flooded the system. Backfilled the queue. \n\nOne silver lining: my task queue setup saved me. It handled the insane throughput on just two 512 MB instances without completely collapsing. One FastApi backend and one worker. \n\nI added stricter rate limits that night to stop the flood. The next day, I briefly took the app down (~15 min) to run a cleanup script and remove all the junk accounts.\n\nFixes put in place\n\t•\tMuch stricter rate limiting\n\t•\tBetter scaling rules for the task queue\n\t•\tUsers now expire from the DB by default unless payment is confirmed\n\nLessons learned\n\t•\t“No one will do this” is not a security strategy\n\t•\tAuto-expiry is great, but you need a strong gate before the queue\n\t•\tKeep a “nuke spam users” script handy\n\t•\tScaling and rate limiting need to be planned together\n\n\nBeing transparent here so others can learn from my mistake — please don’t be too harsh but feel free to ask anythibg, Reddit 😅\n\nAttached: my Mixpanel “WTF happened” spike 📈\n",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1067,
    "downs": 0,
    "created_utc": 1755293976.0,
    "media": null,
    "is_video": false,
    "num_comments": 192,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.906349907196424
  },
  {
    "score": 1066,
    "title": "I built Caffeine Clock, the caffeine tracker app that I always wanted to exist",
    "selftext": "Hi guys!\n\nI would love to show you **Caffeine Clock 2.0**, a tracker I made that shows you your caffeine levels now and in the future, helping you **have undisrupted sleep by timing your caffeine better.**\n\nA bit of context - as a guy who drinks a lot of caffeine, I wanted to make a good caffeine tracking app for a long time, since nothing I found at the time was sufficient. I wanted to make an app that would be easy to use, show you exactly when you’d have enough caffeine to not have your sleep disrupted, and could add all the drinks I usually drink, for free.\n\nAfter several iterations, I am now releasing the second major version of Caffeine Clock, which is the caffeine tracking app I always wanted to build.\n\n**Some highlights:**\n\n* **Accurate caffeine algorithm** — able to take the absorption rate and a “sipping” duration into account to actually give you a realistic estimate\n* **Comprehensive onboarding**, which (at least I hope) asks relevant questions supported by studies — those will set your caffeine half-life and sleep-safe threshold\n* **Over 200 drinks in the database** — or create your own as well\n* **Fully offline** — the data is only on your phone. No login, nothing. You can move the data from phone to phone\n* **Analytics** — including average caffeine consumption, a streak of days where your caffeine amount was good at your bedtime, drinks breakdown, etc.\n* **Localized** into five languages (some of them AI-translated; please help me if you find something weird)\n* **Free**. It is supported by ads, and there is an option to support the app and remove them.\n\nI would love to hear your feedback. Please, check it out for yourself and let me know what you think!\n\n**Play Store Link:** [https://play.google.com/store/apps/details?id=com.AWSoft.CaffeineClock](https://play.google.com/store/apps/details?id=com.AWSoft.CaffeineClock)\n\n**App Store Link:** [https://apps.apple.com/us/app/caffeine-clock-track-caffeine/id6504160396](https://apps.apple.com/us/app/caffeine-clock-track-caffeine/id6504160396) (if you're seeing old screenshots on some device sizes, those are being fixed now, the app is new)  \n**Website:** [https://www.caffeineclock.app/](https://www.caffeineclock.app/)  \n**ProductHunt launch:** [https://www.producthunt.com/products/caffeine-clock?launch=caffeine-clock](https://www.producthunt.com/products/caffeine-clock?launch=caffeine-clock)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1066,
    "downs": 0,
    "created_utc": 1759516301.0,
    "media": null,
    "is_video": false,
    "num_comments": 152,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.85551013483327
  },
  {
    "score": 1049,
    "title": "I built an AI that turns bad phone photos into menu-ready shots. Is this food catfishing?",
    "selftext": "Hi Side Projectors,\n\nI’ve been working on a tool called **PlatePhoto** **AI** \\- Realistic and professional food photo generator.\n\nThe problem I noticed is that a lot of great local food spots in NYC have unappetizing photos on delivery apps like UberEats or DoorDash. Hiring professional photographers is time consuming and expensive. \n\nPlatePhoto AI takes a phone photo of food, enhances the texture, fixes the lighting, and generates a clean background, all while trying to keep the food looking \"real\" (not AI fake).\n\nIt’s currently in MVP and I’m looking for honest feedback on the output quality.\n\n1. Does the food look too AI-generated?\n2. Is the UI simple enough for a non-tech restaurant owner?\n\nLink: [https://platephoto.com](https://platephoto.com)\n\nThanks for taking a look!\n\n",
    "subreddit": "SideProject",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 1049,
    "downs": 0,
    "created_utc": 1764543542.0,
    "media": null,
    "is_video": false,
    "num_comments": 167,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.79384393993287
  },
  {
    "score": 1033,
    "title": "I made Google but for NSFW subreddits",
    "selftext": "**Reddit NSFW Search Engine and List of All NSFW Subreddits Broken Down by Category:** [**https://nsfwdog.com**](https://nsfwdog.com)\n\nHi everyone! As someone who spent way too much time scrolling through Reddit trying to find the right communities, I got frustrated with how scattered NSFW Reddit actually is, and how hard it is to discover specific subreddits based on your fetishes. So, I decided to create a complete directory of all NSFW communities.\n\nWhat started as a simple directory quickly turned into a full-blown search engine for all NSFW subreddits, indexed and organised.\n\nSome features that make it different:\n\n* **Smart Search:** Find specific porn subreddits and other diverse Reddit NSFW communities by vibe, not just exact keywords. Looking for something specific? You'll actually find it.\n* **Curated Categories:** Browse by interest instead of hunting blindly through random links. Whether you are looking for a complete list of NSFW subreddits broken down by category or exploring a particular niche interest, it's all here.\n* **Clean Interface:** No clutter. Even the words in subreddit names are separated for easy readability.\n\nCheck it out here: [https://nsfwdog.com](https://nsfwdog.com)\n\nTry it out and let me know which feature you liked the most. Also, if you need any new feature or notice any bug, please let me know in the comments too without hesitation and I’ll make it happen asap. If you like the website, please either upvote this post or share it with your friends, it will help me a lot :)",
    "subreddit": "SideProject",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1033,
    "downs": 0,
    "created_utc": 1764228983.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": true,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.800084556597042
  },
  {
    "score": 1023,
    "title": "My app just hit 2k downloads!",
    "selftext": "Thought this would be a fun share. I checked my lifetime analytics today and saw that I cracked 2,000 downloads! I'm stoked\n\nAs I've been improving the app, things have been getting a lot easier. I'm consistently talking to users, having purchases come in, getting positive and constructive feedback.\n\nI thought it would be helpful to share some of what I've learned during this process.\n\n1. Talk to users, talk to users, talk to users, find a way to talk to users. They WILL NOT use the app the way you expected.\n\n2. UX/UI MATTERS! People want an app that feels premium and are willing to overlook bugs and issues if the app feels nice enough.\n\n3. It will take time. It took a while to make onboarding good enough that people would happily pay for the app. And I'm a software engineer by trade. Be patient with yourself.\n\n4. Try to wait for someone to ask for a feature before you build it. Or find a way to validate that people want it. I have an easier time building cool stuff that no one wants than I do talking to customers. But that doesn't work.  \n\n\nI'm building Socialite, an opinionated relationship manager for everyone. It is backed by research and thoughtfully designed.\n\n  \nhere's a little more info about the app if you are curious.\n\nTools to help with relationships don't need to be expensive or overly complicated. They should be built with opinions and a focus on accountability. They should be thoughtfully designed and backed by research.\n\nWith relationships, consistency is everything. Socialite is designed to make consistency inevitable.\n\nI'd love to hear your thoughts -&gt; [caleb@thesocialite.app](mailto:caleb@thesocialite.app)\n\niOS download -&gt; [https://apps.apple.com/us/app/socialite-stay-connected/id6471198543](https://apps.apple.com/us/app/socialite-stay-connected/id6471198543)  \nandroid waitlist -&gt; [https://www.thesocialite.app/](https://www.thesocialite.app/)\n\nBTW, we are currently running a Black Friday Sale on Lifetime access (I've extended the sale because of positive reception)\n\n",
    "subreddit": "SideProject",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1023,
    "downs": 0,
    "created_utc": 1764701426.0,
    "media": null,
    "is_video": false,
    "num_comments": 183,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.87020886814458
  },
  {
    "score": 1011,
    "title": "I created a free AI image upscaler",
    "selftext": "because most of them that already exist are about like this:\n\nyou have to navigate through 5 different extremly slow loading pages to sign up (so that they can spam your email). Once you finally submitted your image to be upscaled, they will ask you to pay monthly to download the image. and many do not even support large images.\n\nSo I created this free alternative. It is slow because it is free. But the results are great! And you do not need to sign up, no hidden newsletter &amp; no subscriptions.\n\nI launched it today on producthunt - it would be nice if you leave a review &amp; upvote if you like it:\nhttps://www.producthunt.com/posts/free-ai-image-upscaling\n\n",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1011,
    "downs": 0,
    "created_utc": 1725355027.0,
    "media": null,
    "is_video": false,
    "num_comments": 262,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.957658386748659
  },
  {
    "score": 1012,
    "title": "Just Launched A Gamified Travel App Where You Unlock The Globe - Need Advice",
    "selftext": "I just launched Surveyor-64, something I made because I wanted to use something just like it. The whole idea is that you can track where you've been by unlocking a map, but unlike scratch maps where each country/area is an arbitrary and different size, in this app, all \"sectors\" are made equal... who's to say you won't find something worth seeing in the middle of nowhere as opposed to a city center, and you can't claim you've \"been to\" a place if you've just been to one tiny corner of it.\n\nBecause I was making this based on what I wanted to exist, I didn't do any market validation whatsoever, but I'm curious if anyone has any feedback on making it something more people would like to use. Right now I have a whopping total of 1 organic download... and I've put forward 0 effort to marketing (I guess this post counts as marketing)... just looking to see if anyone has any advice on growing the user base in general.\n\n",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1012,
    "downs": 0,
    "created_utc": 1753390491.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 2400,
        "fallback_url": "https://v.redd.it/g47uaa4lxvef1/DASH_720.mp4?source=fallback",
        "has_audio": true,
        "height": 1280,
        "width": 590,
        "scrubber_media_url": "https://v.redd.it/g47uaa4lxvef1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/g47uaa4lxvef1/DASHPlaylist.mpd?a=1770353715%2CNjA3YWJhMjczZjdiOGE1YTc1MGZmOWZiZGM0ZjBiMWQ3ZmUwMzQwYTg1MzBhMDJhNmRhZDM0MDlkNTYxNjFlMw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 28,
        "hls_url": "https://v.redd.it/g47uaa4lxvef1/HLSPlaylist.m3u8?a=1770353715%2CNTk3OGU5MWEwOTQwNzExYWYxZWVmZDEwOGUwZDU2NjlkNDM1YmM0ODIxYzczY2ZmNjFkYmRiMTBlOGZjZjdmZg%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 221,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.921285932585599
  },
  {
    "score": 996,
    "title": "I build tool for managing all your paid subscriptions in one sleek menu bar app",
    "selftext": "[**Subscription Day**](https://apps.apple.com/ua/app/subscription-day-calendar/id6743316600?mt=12) to eliminate the chaos of surprise charges and forgotten cancellations. Here’s what makes it stand out:\n\n* **Visual Calendar:** Instantly view the current month and upcoming payments.\n* **Custom Notifications:** Set reminders so you never miss a charge.\n* **Highlights:** Easily flag key items like annual, trial, or one‑time payments.\n* **Statistics:** Dive into your projected yearly budget, average monthly costs, and peak spending months with an intuitive radial chart.\n* **Custom own categories:** Organize categories the way you like it\n* **Multi-Currency Support:** Prices convert on the fly, so your statistics always display in your chosen currency.\n* **Status Management:** Seamlessly mark subscriptions as canceled or active, with accurate updates in your stats.\n* **Quick Addition:** Start typing a service name and our smart auto‑suggest kicks in with logos, categories, and colors – plus, swap logos easily with drag &amp; drop.\n* **Data Export:** Effortlessly import and export your subscription data in CSV.\n\n**⚡️ Secret Bonus:** *Try shaking the PRO purchase window for a fun Easter egg!*\n\nThe app is **free**, but comes with limitations. I prepared a **50% discount** on the lifetime license, available &amp; valid until the end of April 6**.**",
    "subreddit": "SideProject",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 996,
    "downs": 0,
    "created_utc": 1743770654.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/7npw1es1ctse1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1080,
        "width": 1716,
        "scrubber_media_url": "https://v.redd.it/7npw1es1ctse1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/7npw1es1ctse1/DASHPlaylist.mpd?a=1770353715%2CYWJiOGZmY2FhYzQ0MThiN2I0OTY2Y2RlMDgwODVjZGYyYjQ4MTI4MzcyOWZmMGY5YjkwYTdiZDlkNzgwZTEyNw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 11,
        "hls_url": "https://v.redd.it/7npw1es1ctse1/HLSPlaylist.m3u8?a=1770353715%2CN2RiNDIxNTI2MGEzMzk0NDY5NWUzN2I2ZTA4YjkwMGQ4MjZhYmNhYzVjYWY4N2I3YTVjYzBkZWQ1OTg3ZmQ2Mg%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 200,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8927931870219
  }
]