[
  {
    "score": 10268,
    "title": "What’s the best site to buy Google reviews?",
    "selftext": "\nI’ve noticed more businesses quietly using review generation services to improve their local SEO. Some claim to buy Google reviews, but I’m curious about how effective and safe that really is in 2025. I’m not talking about random fake reviews, more like structured ones that help boost visibility in the map pack and build social proof for local searches.\n\n If you’ve tested any sites for this, how did it go?\n\n- Did your rankings in Google Maps or local searches increase? \n\n- Were the reviews written naturally or obviously templated?\n\n- And most importantly, did any of them get flagged or removed over time?\n\nI’m trying to figure out if this still works for reputation management or if Google’s detection systems have gotten too sharp. Real experiences or insights appreciated.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 10268,
    "downs": 0,
    "created_utc": 1761891810.0,
    "media": null,
    "is_video": false,
    "num_comments": 261,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Requests recommendations about sites for buying Google reviews; no clear framework or steps.",
    "composite_score": 5.9631787995174115
  },
  {
    "score": 2186,
    "title": "Should I sell my app for $2M? Currently doing $33K/month profits",
    "selftext": "I have an app on play store that is doing around $33k/ month in profits. Almost all the traffic is organic, I spend around $180 per month on ads. This app has 1.5M monthly active users and gets 400K downloads every month. Last year, it was doing around 270k downloads per month. I am offered $2M for this app. Should I sell?\n\nEdit: I’m 26 years old, app is in tools category, launched in 2018, 8M+ downloads, biggest competitor has 90M+ downloads (launched in 2012)\n\nEdit 2: I already have $500K invested in stocks as a backup ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2186,
    "downs": 0,
    "created_utc": 1703763818.0,
    "media": null,
    "is_video": false,
    "num_comments": 916,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Asks whether to sell a profitable app, seeking external advice rather than presenting a model or steps.",
    "composite_score": 5.533533450872648
  },
  {
    "score": 2192,
    "title": "What would happen if I paid employees well above average and took 10-15% margin instead of 20-30%?",
    "selftext": "I’m toying with the idea of paying my employees and contractors (Home Service Business) much more generously and adding incentive bonuses so that are paid well above the average for their line of work, as long as they deliver quality work. To do this, I would need to take a pay cut and only take a 10-15% profit margin instead of a 20-30% margin. My vision is that by paying more, I’ll have more loyalty, higher satisfaction and most importantly, they will deliver high quality work and keep our customers happy. Then I will be able to scale faster. Has anyone tried this? What would be the risks or downsides of this, other than making less money? ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2192,
    "downs": 0,
    "created_utc": 1739985375.0,
    "media": null,
    "is_video": false,
    "num_comments": 759,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Central idea is a mental model about trading higher pay for lower margins and the associated risks.",
    "composite_score": 5.508945427817919
  },
  {
    "score": 2147,
    "title": "Lost my biggest client because I missed their Reddit complaint - a $50k lesson in humility",
    "selftext": "I've been running a small software development agency for the past 3 years. We had a steady stable of clients, but one in particular made up about 40% of our revenue - about $50k annually. Everything seemed to be going great until last month.\n\nTurns out, their CTO had posted about some performance issues on Reddit three weeks ago. Not even a complaint really, just asking if anyone else was experiencing similar issues with their integration. A competitor saw it within hours and jumped into their DMs with a solution. By the time I found out about the post (through a casual mention in a meeting), they had already started migrating to the competitor.\n\nThe worst part is the issue they posted about was something we could have fixed in 15 minutes. It was a common configuration problem we'd solved for other clients dozens of times.\n\nI got cocky. Thought I had a great relationship with this client and they'd always come to us directly with issues. Learned the hard way that customers don't always complain to your face - they ask their peers first.\n\nNow I'm religiously checking Reddit, industry forums, and review sites daily. Probably overcorrecting, but losing your biggest client has a way of changing your habits.\n\nAnyone else learn an expensive lesson the hard way? I'd rather learn from others than to run into another seemingly simple but expensive oversight again.\n\nEdit: For those asking - yes, I tried to fix things. Had an emergency meeting, offered solutions + credit, but they'd already signed with the competitor and had made their mind up.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 2147,
    "downs": 0,
    "created_utc": 1731002279.0,
    "media": null,
    "is_video": false,
    "num_comments": 303,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.57,
    "category_rationale": "Shares a real-world lesson learned with implications for client management and preventive practices.",
    "composite_score": 5.270971068831894
  },
  {
    "score": 2112,
    "title": "Our aluminum suppliers are saying prices aren't going to go up just 25% to cover the new tariff, they'll be going up 80%...",
    "selftext": "We source aluminum from two different sources for our business and they're both telling us that prices will not only be going up 25% to cover the tariffs, they'll be going up 80% as there are also pricing restrictions currently in place for their industry that will be lifted as part of this.\n\nDoes anybody know if this is legit or if they are just colluding to use this as an opportunity to pad their profits?\n\nI won't pretend to be a tariff or economic expert but our material prices going up 80% is going to have a much larger impact on us than a 25% increase would.\n\nIdeally we can keep this from becoming political, but I know where it's likely to end up (but hopefully I can at least get an answer to my question in the midst of it).\n\nThanks in advance!",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2112,
    "downs": 0,
    "created_utc": 1739402862.0,
    "media": null,
    "is_video": false,
    "num_comments": 351,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Inquires whether an expected price increase is legitimate or collusive; lacks a structured argument.",
    "composite_score": 5.310670828791379
  },
  {
    "score": 1951,
    "title": "Does anybody else have that employee, or those employees, who just can’t grasp the impact of the tariffs?",
    "selftext": "One of my employees just doesn’t understand how the tariffs work. His hours are getting cut, almost entirely, and he thought I was giving him the run around when I told him it was because of the tariffs. They’ve slowed sales in our industry and increased our costs, plain and simple. \nHe asked, condescendingly, why Canada and China having to pay us an extra tax would slow down sales on the consumer end. Said it shouldn’t make a difference on packaging. I’ve explained it to him before they hit, and it seemed to go in one ear and out the other. I had just placed a few orders at increased pricing so I gave him the most top to bottom explanation I could down to the individual duties applied to different materials in our components. \nHe was shocked that tariffs were just an extra tax on us and that the US doesn’t just have the capability to produce EVERYTHING. At the end, he said that’s not what he thought when he voted for them and didn’t understand why he was told the other countries pay the tariffs. \nAnother one of our guys was into the tariffs until I explained it. He did some research and got it instantly. His hours weren’t at risk but he was still pissed off at how badly it will impact his family and the business. \nI’m sick of explaining tariffs and wish that people were better at doing their own research. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 1951,
    "downs": 0,
    "created_utc": 1741757014.0,
    "media": null,
    "is_video": false,
    "num_comments": 481,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Vent about colleagues’ misunderstanding of tariffs with strong frustration and moral stance.",
    "composite_score": 5.299503332450097
  },
  {
    "score": 1736,
    "title": "PSA: Make Sure Your Website is ADA Compliant ",
    "selftext": "I’m a lawyer, but not your lawyer. This isn’t legal advice. Just smart business practice. \n\nI have a small business client that was just hit by a lawsuit alleging that their e-commerce website isn’t in compliance with the [ADA Website Accessibility Rules](https://www.ada.gov/resources/web-guidance/). There are law firms that file thousands of these lawsuits per day to shake down small businesses for thousands of dollars over something that can be fixed cheaply and easily. It is disgusting. \n\nYou can go on Fiverr or a similar website and have your site brought into compliance for a couple of hundred dollars. I urge you to do it asap to avoid one of these nonsense lawsuits. There are free website “compliance checkers” that you can use too to get an idea of whether your website is in compliance. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1736,
    "downs": 0,
    "created_utc": 1708304060.0,
    "media": null,
    "is_video": false,
    "num_comments": 345,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Provides practical business guidance on ADA compliance and risk avoidance.",
    "composite_score": 5.221837867843487
  },
  {
    "score": 1620,
    "title": "I quit my 9-5 thanks to my mobile beer bar and high-ticket sales. ",
    "selftext": "After having my mobile beer trailer for a couple of months I have been booked almost every weekend since I got it up and running. A minor problem was that people also wanted cocktails not just beer, so I started hiring a certified bartender every time a customer would ask if I offered that as well. I started marketing it as well as a higher package once I did my business started booming. I've also met great people along the way, I met a guy who manages a sales team, and he offered me a job on the spot because he liked my customer service, and I took it. It's been 3 months from accepting that job offer. The mobile beer trailer plus being a high ticket remote closer has changed my life I don't have to work a 9-5 and I get to work from home and make my own schedule. Now I'm on a mission to save up to open up something small. I want to try and make my own beer and open up a micro-brewery in the next 2 years.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1620,
    "downs": 0,
    "created_utc": 1725990274.0,
    "media": null,
    "is_video": false,
    "num_comments": 198,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Narrates a personal success story and lessons learned from entrepreneurship.",
    "composite_score": 5.094209553053369
  },
  {
    "score": 1616,
    "title": "No, seriously, what happened to LinkedIn?",
    "selftext": "So today (with a thought of dusting off my profile and networking with like minded business owners) I finally logged into LinkedIn after ages. It felt like opening a haunted house.\n\nInbox avalanched with spam, chaotic mix of motivational posts and low-effort memes. Some guy just called himself “synergy wizard”.\n\nNot sure what should I make out of it. Is LinkedIn still useful in 2025 or it’s just a corporate Tinder with extra steps?\n\nP.S. Wow this post blew up. If you need a Skype replacement to call landlines and mobiles worldwide, check out [Callshake](https://callshake.com/).",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1616,
    "downs": 0,
    "created_utc": 1738947056.0,
    "media": null,
    "is_video": false,
    "num_comments": 402,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Raises a question about LinkedIn usefulness with opinions; minimal substantive content.",
    "composite_score": 5.246362542976956
  },
  {
    "score": 1522,
    "title": "Closing my business after 18 years",
    "selftext": "This is long, and to some degree this post is a way for me to help make sense and reflect on my decision to close my business after 18 years.  We fabricated and installed stone, quartz and solid surface countertops and decorative surfaces for mostly commercial construction projects and some residential work.  We have done work at the White House, Camp David, Various Senate and Congressional office, the cafeteria at the Supreme Court, the capital visitors center.  Many small projects at various government agencies including CIA, NSA, and at the pentagon.  There were hundreds of popular restaurants in the D.C. area.  Hundreds of McDonalds restaurants throughout PA, MD and Virginia.  Schools, churches, apartment complexes and condos.  Thousands of small office spaces throughout the area.   To date we have done over 32,000 jobs over 18 years.  I drive throughout the city and memories of many many projects come to mind.   I thought I did everything right.  \n\nWe tried to run a fair and safe operation for my staff.  We paid my employees a competitive wage, so that they would stay.  We paid our vendors on time so that they would help me out when I had a special request.   I reminded my staff that my boss was our customers and that my boss could fire us at any time.   We worked hard to perform our craft at a high level, while serving a wide range of customers from low budget developers to the most demanding architects and designers. \n\nWe survived multiple economic down turns.  We had no debt, and we were profitable 17 of the 18 years.  Some were profitable enough to add new equipment and justify controlled expansion and new investment.   I had plans of working another 5-7 years while taking on new employee partners that would eventually buy me out.  But, that’s not going to happen.  \n\nIt might be tempting to pin the challenges on the economy, but that would be an oversimplification. We made a major miscalculation in the real estate market beginning around 2020 and that mistake lead to me closing today.  \n\nThe primary issue stems from a significant imbalance in the commercial real estate market. Shifts in demographics due to COVID altered demand, squeezing the availability of light industrial manufacturing spaces in central Maryland. This drove up rental rates far beyond standard inflation. Moreover, a few untimely events that were particular to our scenario played a role. I believed I had prepared sufficiently, but the eventual outcome was beyond my prediction.\n\nIn 2018, my building’s landlord suffered a stroke. After his recovery, he decided against tying up the majority of his wealth in real estate. We’d been his tenant for roughly 12 years. Wanting liquidity, he decided to sell the building, as his family was neither interested nor capable of managing such properties.\n\nSurprisingly, the building was sold almost immediately. The new landlord assured us of no immediate changes. However, the situation took a turn when COVID hit in March 2020. Upon lease renewal, our rate was hiked by 50%. After some negotiation, we settled for a one-year extension. As 2021 unfolded, the business landscape remained unpredictable. The rental market seemed stable, but both we and our landlord felt the uncertainties. Upon another lease negotiation, our rate was increased by an additional 15%. The relocation of our business, along with necessary upgrades, would be extremely expensive, which made staying put for another year more convenient.\n\nOur property search in 2022 began with optimism. After exploring several properties, we were met with an unforeseen hurdle. Merritt, the largest commercial property owner in the region, was hesitant to lease to us, severely limiting our options.\n\nAs we searched, rental rates had surged. Warehouses were going for as much as $20/sf. Agents explained that major corporations, driven by “the Amazon effect”, had been securing warehouse spaces to be closer to Amazon distribution centers.\n\nIn May, we identified a promising location in nearby. The negotiations were progressing until unexpected costs were introduced, far exceeding our initial agreement. Feeling taken advantage of, we walked away.\n\nIn August, a potential opportunity near Balttimore surfaced through our lawyer. Everything seemed perfect, but unforeseen emotional factors from the owner and challenges surrounding the lease start date led to another dead-end.\n\nThen, the economy took a turn for the worse. Our sales and work booking rates dropped significantly. With a dim outlook for the future.  additionally Election years in the DC market are always slower for commercial construction, as the various businesses that support (or leech from) the government sit on the sidelines waiting to decide how to invest in their local offices.  We questioned the wisdom of investing heavily in a rushed relocation, and a long-term lease.\n\nOn September 6th, after nights of pondering, I decided not to proceed. My partners and I concluded it was wiser to walk away with our current assets, providing capital for potential new ventures or adding to my retirement fund.\n\nThe subsequent days were heart-wrenching. I had to relay the sad news to my dedicated staff, some of whom had been with me for nearly two decades. Despite the challenges, I worked tirelessly to ensure their well-being and future employment.\n\nI’ve now started informing my long-term customers, who were equally shocked by our closure.  The first four customers I informed all offered me a job.  I was honored, but graciously declined.  It was comforting to know that they cared.  \n\nThis has been the most challenging task of my life, barring the eulogy I delivered for my late brother. \n\nThe upcoming tasks are daunting: winding down the business, completing existing jobs, selling our assets, and vacating the property by December 29th.\n\nAs I type this, I don’t yet know what my future holds.  I do know that for the first time since my youth, when I delivered newspapers I’ll be unemployed.\n\n.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1522,
    "downs": 0,
    "created_utc": 1696128991.0,
    "media": null,
    "is_video": false,
    "num_comments": 387,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Reflective post detailing a long-running business closure and the lessons from it.",
    "composite_score": 5.212115766133146
  },
  {
    "score": 1470,
    "title": "Most People in Marketing Are Completely Useless",
    "selftext": "Yeah, I said it. And deep down, you know it’s true.\n\nEverywhere I look, I see marketers who don’t actually know how to sell. They call themselves *growth hackers* and *branding experts*, but all they do is tweak colors, obsess over engagement rates, and copy whatever’s trending on Twitter.\n\nAsk them how to create actual demand for a product? Blank stares.  \nAsk them how to position a brand so people *remember* it? Radio silence.  \nAsk them how to make a marketing campaign print money? Suddenly, it’s all *“brand awareness”* and *“building community.”*\n\nThis is why most businesses burn through cash and get nowhere. Because the people running their marketing don’t understand that marketing is supposed to do one thing: drive revenue.\n\nGreat marketing isn’t about looking busy. It’s about making people want what you’re selling—so bad that they feel stupid *not* buying it. It’s about positioning, psychology, and execution.\n\nSo yeah, most marketers are useless. But the ones who actually know how to create demand, drive obsession, and turn branding into money? They run the world.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1470,
    "downs": 0,
    "created_utc": 1741044094.0,
    "media": null,
    "is_video": false,
    "num_comments": 385,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Strong emotional rant criticizing marketers without actionable content.",
    "composite_score": 5.150906325063408
  },
  {
    "score": 1403,
    "title": "There’s big money in D2D sales if you have the mentality. ",
    "selftext": "Hit $22,000 gross in two weeks as a handyman. I target upper middle class neighborhoods and go door to door. No ads, no flyers, no website yet even. Just magnetic business cards I hand out when I can’t make a sale. \n\nI specialize in jobs that provide high perceived value that I can knock out quick and charge at least a couple hundred bucks for. Mostly exterior repairs, fixes, etc. Average around $200-$400 an hour per job that way. \n\nIt’s amazing how much effort and money people (Myself included in the past) put into getting customers to come to them but won’t take a single step in the other direction. Everything changed when I stopped focusing on building websites/apps, optimizing google ads, obsessing over my google business profile, etc and just went out and knocked on doors. \n\nI was a software engineer for 10 years when I got laid off February 2024. Months of failed jobs apps led me to start doing some personal training, I had a lot of experience in the strength world and did ok, enough to pay bills but nothing like the salary I was used to. Started providing handyman services but wasn’t getting many leads through the usual recommendations for local service businesses. Needed cash fast and started going door to door. If I can do it, so can you. Get out there and make things happen, don’t just sit back and wait. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1403,
    "downs": 0,
    "created_utc": 1735760054.0,
    "media": null,
    "is_video": false,
    "num_comments": 327,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.68,
    "category_rationale": "Describes a repeatable door-to-door sales method to achieve high earnings.",
    "composite_score": 5.110304029649626
  },
  {
    "score": 1363,
    "title": "Started offering a \"throwaway\" service to keep customers happy and now it makes more than my actual business",
    "selftext": "I need some perspective here: I run a small landscaping company, been doing it for about 4 years now. Standard stuff like lawn maintenance, seasonal cleanups, mulching, the usual.\n\nAbout 8 months ago I had this one client who kept asking if I could pressure wash their driveway while I was already there doing their yard. I said sure whatever, charged them like $75 extra just to not deal with scheduling another visit. Took me maybe 30 mins.\n\nWord got around I guess because then other clients started asking. I figured why not, easy add on right? Fast forward to now and I'm getting calls specifically for pressure washing. Like people don't even want the landscaping part anymore they just want their driveways, decks, house siding done.\n\nDid the math last week and the pressure washing stuff brought in almost double what the landscaping did last month. I've got some money saved up from the busy season and Stаke so I could buy better equipment and actually pivot to this full time but it feels weird abandoning what I started with?\n\nAnyone else deal with something like this where a side thing accidentally became the main thing? Do I just roll with it or am I overthinking this",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1363,
    "downs": 0,
    "created_utc": 1760540467.0,
    "media": null,
    "is_video": false,
    "num_comments": 254,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Discusses pivot of service offering and revenue impact; seeks perspective.",
    "composite_score": 5.0805844605374375
  },
  {
    "score": 1352,
    "title": "I don't care to hustle my entire life, my goal is to be a lazy business owner",
    "selftext": "Social media and puff pieces like to highlight the nonstop 24/7/365 hustler. Love to glorify the grind. Yes it's initially necessary to get a business off the ground but it doesn't have to be that way your entire career. In person I know more business owners that do little work. Come in at 10am and leave at 2pm. They're just not on social media bragging about how hard they work nor can you even find much by Googling them. They have little to no ego and don't care about the spotlight or being noticed as the founder. They put in the HARD work in the beginning but they've setup their businesses to run without them. They hire hustlers to grind it out and go to bat for them. They just need to periodically check up on things and will step in on big transactions and business dealings.  \n\nOn the outside looking in they appear lazy. But I realize they're smart, they're buying back their freedom by hiring and delegating to others. I don't really care to be known as the founder/CEO. I just want the freedom to do whatever I want and my business generate revenue without needing me day to day.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1352,
    "downs": 0,
    "created_utc": 1673457545.0,
    "media": null,
    "is_video": false,
    "num_comments": 272,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Advocates a lazy, delegated business model with some personal philosophy; not steps.",
    "composite_score": 5.084379120118001
  },
  {
    "score": 1335,
    "title": "I Took Over a Commercial Gym and it's Been a Nightmare.",
    "selftext": "Edit: this post got way more comments and attention than I ever would have guessed. Thank you all for the helpful suggestions. I've added an addendum at the bottom of the original post.  \n  \nSome background: about ten months ago a friend told me about a gym in my city that was being evicted. The gym was a franchise and had been at that location for about 20 years and I drove by it all the time and it always seemed busy so I was intrigued. I did some sleuthing, found the eviction case in the court records, and when I skimmed it over it seemed like there were major partnership issues between the owners of the gym. I looked up the gym owners and they were suing each other. There was a \"for lease\" sign at the entrance to the shopping center so I called and, surprisingly, it was the actual property owner who answered. Nice old guy. He'd owned the property for close to 30 years. To prevent the story from becoming too long I negotiated a very favorable lease on the gym. I don't know why I thought it was a good idea to get into a business I have no background in but it's almost like I got sucked in by the idea of getting a good deal... which is a weakness of mine.\n\nSome brief background on myself: I have a full time job that pays well. Financially I'm in a good spot but part of me wants/wanted to own a couple of businesses. Maybe it's ambition or maybe all of the \"passive income\" slop somehow seeped into me, idk. However I work a ton and have **zero** time to actually run a business. This was clearly my first mistake but I didn't realize how bad the gym business was.\n\nA bank had a lien on the equipment and I tried to get in touch with them to buy the equipment but I was never able to get in touch with anyone. So I bought a mixture of new and used equipment for the gym and this was a **huge** mistake. The new equipment worked fine. The used equipment has been a nightmare. Treadmills constantly break and replacement parts are hard to find. The selectorized weight machines have had tons of weird problems like squeaky bearings that are impossible to fix. The company I bought the used equipment from sold it as \"refurbished\" and supposedly gave me a five year warranty on the equipment but I'll let you guess how that's worked out. Literally from my first complaint they've ghosted me.\n\nI went with ABC Fitness as my payment processor because every gym I have ever been a member of in my life used ABC Fitness so I figured \"if everyone uses them I should just use them\". When I spoke to their sales people they basically pitched it as taking 5% of my gross revenue and they really upsold their ability to retain members collect on outstanding balances. I made the mistake of not reading every single word of the contract and missed a ton of fees. Right now with all of the additional fees they charge they are effectively taking close to 10% of my gross. Also, their hardware and software is absolutely archaic.\n\nI started interviewing staff and hired what I **thought** was a manager from a gym on the other side of the city. It turns out he was not a manager but just an hourly employee. That's on me for not doing sufficient due diligence but, at the same time, he completely lied about his experience. He went so far as to tell me (and for some reason I believed him) that he knew how to run ad campaigns on Google and Facebook. I should have known that was too good to be true but I was wearing rose colored glasses.\n\nWe opened in November and the first blow was that we were not able to get much of the old membership. They had all moved on to other gyms. The manager I hired and gave an ad budget to? I have no idea what he spent the money on. The money went to Google and Facebook but the ad campaign was not effective at all. Our membership fell way short of my targets. We only got about 400 members instead of the 750 I was hoping for. What's worse, starting around March, about 23% of membership just stopped paying. These were people that had signed up for annual plans (for the lower rate) but their credit cards wouldn't process. It was shocking to see. We're slowly grinding and adding new members but I'm way behind where I'd hoped to be.\n\nMy hourly employees have been less than reliable. Part of their duties is to clean the gym and the restrooms. I have cameras in the gym that I sometimes watch and they basically all just hang around the front desk. What does my \"manager\" do? Nothing. He just walks around aimlessly. Based on network traffic (which I can monitor) it appears he spends most of his day on sports betting websites.\n\nI go in to the gym once per week to check on things and I do a quick meeting with my manager (who I should fire). He gives me an update on how things are going and what ideas he has to drive membership and revenue in general. So far he has:\n\n1. Brought in a third party to sell drinks and supplements. They're supposed to pay us rent. They are yet to pay us a dime. I need to \"evict\" them but I don't even know how that works.\n2. Brought in several trainers that were all supposed to pay us rent. Maybe three trainers have paid us two or three times each so far. I keep telling my manager that they need to pay or get out. He's adamant that they need to \"build their client base\". I know most gyms sublet the training rights to a third party but my manager thought that since we are just starting out the best thing to do would be to \"rent\" directly to trainers.\n3. Brought in some body builders to do photo shoots. His rationalization was that it was \"free advertising\". I actually think it has been counterproductive and these people act like they own the gym.\n\nThere's more. This has gotten much longer than I anticipated and has been a bit of a rant but it's like every aspect of this business blows. I feel like everywhere I turn is a scummy used car salesman with no end in sight. Here's a summary of my lessons learned:\n\n1. Don't buy a business if you have a full time job that leaves you with zero time to be involved.\n2. Don't buy used gym equipment thinking you're getting a better warranty.\n3. Verify people's resumes.\n4. Read every last word of your contracts.\n5. If you don't have a good manager don't assume your hourly employees will magically step up to the plate.\n\nThe one silver lining in all of this is that the landlord has been super responsive in handling things like roof leaks and broken HVACs (he agreed to handle the HVACs for the initial term of the lease... like I said I got a great lease). I've heard so many stories over the years about bad landlords that this has been a breath of fresh air.\n\nWhat am I going to do from here? I have no idea. I'm sure I'll figure it out.\n\n**Addendum**  \nFirst, I want to address the combination of new vs used equipment. I bought new free weights, olympic weights, benches, etc. because the price difference between new and used was minimal. I bought used cardio equipment because my choice was between new equipment with a 1 year warranty from a vendor that was on the other side of the country or used equipment with a five year warranty that was refurbished from a seller that was six hours away. I went in saw the equipment in person. I never expected them to completely ghost me on warranty claims.\n\nSecond, I'm firing the manager this coming week and I'm just going to have hourly employees cover the gym while I look for a new manager. \n\nThird, I'm going to overhaul the incentive structure for my hourly employees to sign up new members and I'm going to change the pay and incentive structure for the incoming manager. \n\nFourth, I'm going to personally investigate the situation with the trainers who aren't paying and the guy who's selling drinks and supplements and not paying. The theory that they're paying the manager directly is plausible.\n\nAgain, this got way more comments than I ever imagined so I'm sorry if I don't respond to you directly. Thank you for all of your input.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1335,
    "downs": 0,
    "created_utc": 1750384166.0,
    "media": null,
    "is_video": false,
    "num_comments": 291,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal narrative about gym acquisition with ongoing problems; no clear framework.",
    "composite_score": 5.085997883863736
  },
  {
    "score": 1229,
    "title": "My friend got an ada demand letter and showed me the actual settlement agreement they wanted him to sign, this is insane!",
    "selftext": "My buddy runs a small shopify store, he got hit with an accessibility demand letter last month from some law firm. The initial demand was for $20k settlement plus legal fees, they sent over the actual settlement agreement template and the terms are wild beyond just the money.\nAgreement requires: bringing site into \"substantial compliance\" with wcag 2.2 level aa within the term of agreement, 24 month monitoring period where they can come back and check, if you breach any terms they can reopen the case, strict confidentiality clause so you can't even tell other business owners about the amount or terms.\nThe kicker is buried in section 4 about remediation, you have to make \"good faith efforts\" but there's no clear standard for what that means. So even after paying $20k+ and doing work, they could potentially argue you didn't try hard enough.\nI talked to a lawyer who said these agreements are designed to be vague so they can keep coming back, the confidentiality clause means most business owners can't even compare notes or warn each other.\nAnyone else seen agreements like this? Trying to figure out if these terms are standard or if this firm is extra aggressive.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1229,
    "downs": 0,
    "created_utc": 1764672930.0,
    "media": null,
    "is_video": false,
    "num_comments": 341,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.55,
    "category_rationale": "Describes aggressive ADA settlement terms and solicits experience; informational.",
    "composite_score": 5.091918164467466
  },
  {
    "score": 1217,
    "title": "Homeless guy abuses free burger privilege, loses it when I can't deliver",
    "selftext": "Hey fellow Redditors,\n\nI own a burger joint that I've been running for 6 months now. Since day one, I've been giving a free burger to a homeless guy who comes in 3 times a week. I've always been happy to help him out, but last week, things took a turn.\n\nHe came in on a Saturday, and I had to tell him I couldn't give him a free burger because I was running low on product. I offered him a side of fries instead, but he lost his temper and started cussing at me. He claimed I was 'full of shit' and that I had plenty of product, which wasn't true.\n\nAs the owner, I'm used to dealing with difficult customers, but this guy's behavior was unacceptable. I yelled at him to leave and told him not to come back.\n\nI know some of you might think I'm a jerk for cutting him off, but honestly, I feel like he took advantage of my kindness for too long. Has anyone else had to deal with a similar situation? How did you handle it?",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1217,
    "downs": 0,
    "created_utc": 1760368375.0,
    "media": null,
    "is_video": false,
    "num_comments": 375,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Anecdote about coaching/free burger policy and a conflict with a customer.",
    "composite_score": 5.085741210760688
  },
  {
    "score": 1172,
    "title": "UPS and DHL are now telling shoppers and business they owe shipping fees due to new China tariffs",
    "selftext": "WIRED here – we just published a story on how UPS and DHL have begun charging higher import duties and processing fees. Over the past 24 hours, US shoppers have reported receiving notices from UPS and DHL stating they owed between $20 to over $50. Some small business owners say the new fees are forcing them to temporarily halt sending orders to the US completely.\n\nHave any of you encountered this?\n\nHere's our full story: [https://www.wired.com/story/tariffs-china-prices-fees-shein-temu/](https://www.wired.com/story/tariffs-china-prices-fees-shein-temu/)",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1172,
    "downs": 0,
    "created_utc": 1738799090.0,
    "media": null,
    "is_video": false,
    "num_comments": 372,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "News item with a question to readers about tariffs impacting shipping costs.",
    "composite_score": 5.075152428019873
  },
  {
    "score": 1144,
    "title": "Has Trump's return to power affected your small business?",
    "selftext": "\nHey Reddit,\n\nAs a small business owner, I'm curious how others are faring since Trump's return to the White House in January.\n\nI do web development work (based in Europe but with a lot of US based clients) and haven't noticed any significant changes with my US clients yet. Business seems steady so far.\n\nHas anyone else experienced any changes - positive or negative - in their small business operations in the past couple months? Curious to hear perspectives from different industries.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 1144,
    "downs": 0,
    "created_utc": 1741627965.0,
    "media": null,
    "is_video": false,
    "num_comments": 1562,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question asking about impact of politics on small business.",
    "composite_score": 5.3157849756855
  },
  {
    "score": 1091,
    "title": "I want my husband to sell his business",
    "selftext": "My husband(37 M) has a trucking company and its breaking him down slowly every single day. We cant pay our bills, our credit cards are maxed out, all our savings are gone, we have no retirement. We are going on year 5. I have done my best accounting and money management for him that I can but I cannot solve the issue of not enough revenue. (Nor can i be his manager) Our busy season doesn’t make enough money to cover our slow season. Our debt to income ratio is too high. Expenses are out of control. \n\nWe now have a nine month old daughter and I can not go on like this anymore. Its time to close shop. I am brought to my knees thinking about him giving up his dream but he is a shell of a human. The life is drained from him. Im worried about his mental health. His friends &amp; parents call me because they are also so worried about him. \n\nThere is a union job waiting for him he would roughly make $200k a year doing this. This is clearly a no brainer for me because I am not emotionally attached to the trucking business. Its clearly not working. \n\nAm I the asshole for asking him sell his trucks? He says that he deserves to live his dream and still continue to do this everyday. I am so torn. This will bring us to bankruptcy. \n\nAny words of encouragement for him or advice ? \n",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1091,
    "downs": 0,
    "created_utc": 1740532041.0,
    "media": null,
    "is_video": false,
    "num_comments": 324,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.63,
    "category_rationale": "Personal plea seeking advice on whether to push husband to sell his trucking business.",
    "composite_score": 5.0066643188581565
  },
  {
    "score": 1064,
    "title": "Stripe is holding $8,000 of my money indefinitely. My post on r/stripe hit 16k views and was removed. Here are the receipts.",
    "selftext": "I run a small business in Australia. Stripe is keeping $7,946 of my money permanently. When I posted about it on r/stripe, it hit 16,000 views within hours. Then the mods removed it. Screenshots attached.\n\nThis is what happened.\n\nA client paid me $5,500 USD for completed AI development work. Stripe refuses to release it. Their justification: a completely unrelated $50 dispute from a random person. That dispute is already resolved. The person got their refund weeks ago. Case closed.\n\nDespite that, Stripe is using this resolved $50 dispute to hold nearly $8,000 that has nothing to do with it.\n\nKey facts:\n\n• I passed all verification requirements. Identity, documents, compliance checks. Dashboard showed all tasks completed.\n\n• Stripe froze my account the day before the payout was scheduled. Not during any investigation. They waited until the last moment.\n\n• Stripe claimed they would refund money to customers within five days. My client confirmed they received nothing. Stripe kept the funds.\n\n• My client provided a signed statement confirming the payment was legitimate, the work was delivered, and no dispute will ever be filed. Stripe ignored it.\n\n• All communication from Stripe is a copy-paste response: “high risk.” No explanation, no evidence, no path to resolution.\n\nThe numbers:\n\nDisputed amount: $50\nAmount Stripe is keeping: $7,946\nRatio: 160 times the disputed amount\nThe dispute is from a different customer and is already resolved.\n\nWhat I’ve done:\n\n• Complaint filed with Stripe. Their final answer: “We’re keeping your money.”\n• Complaint filed with AFCA (Australian Financial Complaints Authority). Case number: 12-25-334332\n• Final Notice filed in SA Magistrates Court. Case number: FNL-25-010285\n• Report filed with ACCC for unconscionable conduct. Reference: accc-report:0098524\n• Posted on r/stripe. Removed after going semi-viral. Screenshots attached.\n\nI followed every rule. Verified identity. Provided documentation. Delivered the work. My client is happy. Stripe decided to keep the money anyway.\n\nIf Stripe can withhold funds arbitrarily, ignore evidence, and silence criticism, every small business is at risk.\n\nSharing this so others understand the danger before relying on Stripe.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1064,
    "downs": 0,
    "created_utc": 1765222286.0,
    "media": null,
    "is_video": false,
    "num_comments": 297,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Vent about Stripe with detailed grievances and no actionable steps.",
    "composite_score": 4.999457739812884
  },
  {
    "score": 1053,
    "title": "Just landed my biggest sale ever thanks to my competitor",
    "selftext": "I repair phones and computers and the business I run with my wife is pretty brand new (started at the end of 2022). We have 41 google reviews, all 5 stars, and I take care of 2-3 customers a week while working a regular 8-5 since the business doesn’t quite pay all the bills yet. \n\nMonths ago I found out that a competitor of mine is a microsoldering specialist. I don’t even know how to do basic solder yet, just haven’t had a ton of drive to learn since even if I did it would represent such a tiny percentage of my business. But I wanted to make sure I had a relationship with this guy because it was a miracle at all that there was someone like this in my small town. \n\nHe ended up being really happy to find someone else in town that was as professional and reliable as he was, and he told me he would throw me work every now and then when he got too busy and couldn’t add it to his schedule. \n\nThis week I got a text from him about a job installing new network equipment for a customer who wants cameras in his big detached garage. Went out on Tuesday and did a site survey, and submitted - what was to me - a bonkers quote of $3K. More than I’ve ever quoted in the entire history of the business so far. \n\nThe quote was accepted immediately and I was paid within an hour. Holy crap. \n\nI’m confident in my ability to do the job, as I used to do this kind of work for a full time job, but *man* does it feel good to land a job this big. It’s going to be very good for the growth of the company too! I’m gonna take a ton of photos and make a gallery out of it for the website to show off my work. \n\nExciting times ahead! ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1053,
    "downs": 0,
    "created_utc": 1721328023.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal success anecdote without a clear list, model, or steps.",
    "composite_score": 4.803114091572793
  },
  {
    "score": 1027,
    "title": "I inherited $250K. I have no skills, no job, no plan — and I’m terrified it’s going to melt away.",
    "selftext": "**[I'm reading all the comments one by one. Your advices are very valuable to me.]**\n\nI have $250,000 in capital, inherited from my father. I have no job experience, no formal skills, and no concrete business idea right now. But I don’t want this money to just sit around or slowly melt away.\n\nI'm 26 years old. I studied computer programming.\n\nHere’s what I don’t want:\n\n• I don’t want to gamble the money away on crypto, day trading, or some scammy startup idea.\n\n• I don’t want a passive income fantasy — I want to work, I just don’t want to manage employees or dive into something way over my head.\n\n• I don’t want to wake up 5 years from now with the money gone and nothing to show for it.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1027,
    "downs": 0,
    "created_utc": 1750363216.0,
    "media": null,
    "is_video": false,
    "num_comments": 1316,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Seeking advice with no concrete plan or steps; narrative.",
    "composite_score": 5.276786002140149
  },
  {
    "score": 964,
    "title": "Lost revenue is way more expensive than people can comprehend",
    "selftext": "I'm not a traditional business owner. I am a truck driver owner operator, going on 4 years. My revenue is about $225k/year. If I could make $25k more revenue it would be life changing. Nearly all profit. Downtime for maintenance and repairs costs me so much more than just the thousands in actual repair bills. It costs momentum. \n\nIf I get home on Monday, with plans to leave on Thursday, if shit doesn't go absolutely right on Monday Tuesday Wednesday at the shop then Thursday is fucked and my whole week is fucked because good loads are hard to get on Friday and that's $3k in unplanned lost revenue that I would only make $500 off of.\n\nI make very little money off the first $3,000 weekly revenue. All my money is made from over $5,000 revenue. And that's bare minimum to make a living and save for maintenance.\n\nBusiness math defies logic. It's its own math.\n\nI used to run a small traditional business with one employee. I would take that any day. I cashed that out to buy my truck. Biggest mistake I ever made. And missing out on 4 years of my kids lives. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 964,
    "downs": 0,
    "created_utc": 1738698491.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Reflective business narrative without actionable guidance.",
    "composite_score": 4.730740562314105
  },
  {
    "score": 959,
    "title": "I purposefully allow my employees to gossip / talk bad about me. ",
    "selftext": "They don’t know that I know but I do, and I don’t do anything about it. I find that it creates a “camarederie” between them and actually makes their work easier and more efficient. And as a small business owner with a labor shortage I can’t afford to hire other people and trust them. Anyone else do this? \n\nTo give context; I am a very young (26, started at 22) business owner of a small construction company. My employees are 40-50 of age and they always complain about my lack of experience, lack of knowledge, that I’m a “pussy” and that I’m running the business wrong and other dumb shit. It doesn’t bother me really as long as they do the work which they do well. And the business is growing well, so. Also helps them blow off steam. What do the seasoned business owners think about this ? \n\nEdit: for those asking, we specialize in prefabricated structures. Look up Rayco prefab aruba on insta / fb ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 959,
    "downs": 0,
    "created_utc": 1722204479.0,
    "media": null,
    "is_video": false,
    "num_comments": 273,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Question about management approach; no structured content.",
    "composite_score": 4.913646514449763
  },
  {
    "score": 959,
    "title": "Disclose your tariffs",
    "selftext": "I know a lot of us are concerned about how we stay profitable when taxes on imports just jumped 10-50% percent starting today. \n\nHere’s what we are going to do - disclose the tariffs. \n\nReceipts will say - \n\nProduct X - $100\nSales tax -   $6\nShipping -    $12\n\nTotal        -    $118\n\n(The product costs includes approximately $24 in tariffs.)\n\nConsumers will balk at higher prices but we’re going to try to explain that it’s not money in our pocket. It’s tariffs. \n\nEasier for us because we import directly and can track tariffs. Won’t be so easy for some folks based on what they sell. \n\nBut we want our customers to know that price increases are largely due to tax (tariff) increases. We are going to try not to raise our base prices or profit margins. \n",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 959,
    "downs": 0,
    "created_utc": 1743684718.0,
    "media": null,
    "is_video": false,
    "num_comments": 254,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Prescriptive pricing approach and rationale for tariff disclosure.",
    "composite_score": 4.8830413232565455
  },
  {
    "score": 925,
    "title": "I made $3.5k in my first week",
    "selftext": "So I started a little side hustle business and made some social media posts that exploded in my area. I was aiming to make an extra $250 a week on top of my full time job salary that is plenty for me, I’m getting married in April and saving for a house so I thought why not try and make some extra cash. I have done nothing for my business other than just put my phone number out there.\n\nI only do my side hustle on the weekends and did $3.5k my first weekend and have another $3.1k lined up for the next weekend. Now I’m wondering if maybe I need to start an LLC or something like that because that’s a lot more money that I ever imagined and I didn’t even think about the legal aspect. I don’t know what to do because I’m so happy it took off like that but I’m also nervous about doing it the right way. What do I do? Please help!",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 925,
    "downs": 0,
    "created_utc": 1732858727.0,
    "media": null,
    "is_video": false,
    "num_comments": 176,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Anecdotal side-hustle success story without steps or model.",
    "composite_score": 4.780597619862838
  },
  {
    "score": 927,
    "title": "My biggest customer for almost 15 years gone last friday. 3 kids. Nervous. Just need to vent.",
    "selftext": "I started my maint business almost 15 years ago. This customer has been steady money and they were my first big customer. Nothing crazy as far as profits but over 200k a year in revenue however my operaring costs are high. They recently made some changes and hired a new gm and he decided to keep maint in house rather than using us as a sub. I told them I wanted to put them in an agreement because the new person was having a field day because there are no boundaries and they kept wanting more but wanted to take more money from the budget. This has been 90 plus percent of our income because they required so much of our attention morning noon and night. That's part of the reason it's been hard to scale the company. But I have been trying... Oh and they also took one of my employees out of 3 of them and will keep them in house now. I now have no regular income other than some small accounts we service and I just need to vent.  My kids are all under 15 years old. I'm 37. Luckily my wife is being supportive and said she's not concerned about income cus she knows I'll sell services but I'm scared right now and I know it's cus I'm scared of letting my family down. I know things could be worse and trust me I will learn from this but I'm still anxious as hell. Any body else ever deal with anything like this? I feel so many different emotions. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 927,
    "downs": 0,
    "created_utc": 1725838161.0,
    "media": null,
    "is_video": false,
    "num_comments": 342,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional vent about losing a major client and financial anxiety.",
    "composite_score": 4.947695036240248
  },
  {
    "score": 927,
    "title": "Our Family Business is DYING",
    "selftext": "My family runs a trophy and medal business. The shop is my father's pride and joy, he worked hard and the business provided what we needed. But ever since the pandemic, our income plummeted. What we earn now is just enough to keep us afloat. \n\nI am the successor of the shop, I have no idea nor experience in the field of business. My father was diagnosed with alzheimer's and my mother has hypokalemia. I am senior in college and debating whether I should drop my degree and work on the shop.\n\nI have been reflecting over this since my parents can't work like they can before. I am scared that the business will be unsalvageable when I come up with a decision. The shop feels like ticking bomb and I am panicking on how to defuse it.\n\nI hope you can give me some tips? Thank you everyone. \n\nEdit:\nThank you all for your kind words and suggestions, I will update you all. Again, thank you.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 927,
    "downs": 0,
    "created_utc": 1724069526.0,
    "media": null,
    "is_video": false,
    "num_comments": 744,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Seeking tips for turning around a struggling family business.",
    "composite_score": 5.131126112593008
  },
  {
    "score": 924,
    "title": "The Reason I rejected a large order that would have tripled my revenue",
    "selftext": "A boutique chain contacted me a few months ago with an enormous candle order, which was sufficient to triple my monthly income. It's not hyperbole. I was initially ecstatic, of course. The fine print, however, caught my attention.\n\nThey requested branded labels, net 60 terms of payment, personalized fragrances, and the ability to return unsold items within 30 days. \"\"This is risky,\"\" my instinct told me right away, but the money was very alluring.\n\nIn an attempt to defend it, I ran numbers and lost sleep for a few nights. Ultimately, I declined. Given the uncertainty surrounding payment delays and possible returns, I simply couldn't take on that much inventory risk.\n\nRather, I proposed a smaller trial order that would be paid for up front and could be expanded if things worked out. They passed, but to be honest, I'm still happy with the choice.\n\nSince Alibaba is where I get the majority of my jars and labels, a sudden scale-up would have required significant financial commitment. Cash flow is crucial when managing a small business. If the terms could ruin you, not every \"\"big break\"\" is worth it. Saying no is sometimes the stronger and wiser course of action.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 924,
    "downs": 0,
    "created_utc": 1754582237.0,
    "media": null,
    "is_video": false,
    "num_comments": 190,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Explains a prudent business decision and underlying cash-flow rationale.",
    "composite_score": 4.826658416362896
  },
  {
    "score": 908,
    "title": "My gf's family own a small donut store in SoCal and Krispy Cremes is opening a retail headquarters 100 feet away across the street",
    "selftext": "Not much to say, but was curious what you recommend what you might do to stay relevant.  The actual owner doesn't like change and doesn't want to change any menu items or revamp anything.  If you were faced with such a big competitor 100 feet away, what would you do? \n\nEdit: I am so overwhelmed with all your responses!!  I never expected to get so many ideas and support!!  This started as a curiosity and now I'm really learning so much from everyone!  Thank you from the bottom of my heart! ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 908,
    "downs": 0,
    "created_utc": 1736748707.0,
    "media": null,
    "is_video": false,
    "num_comments": 632,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Requests strategic advice for competing with a nearby big competitor, not a how-to list.",
    "composite_score": 5.071765738230646
  },
  {
    "score": 899,
    "title": "What business were you a part of or saw first hand that made an absolute killing ? ",
    "selftext": "A friend's parents owned a restaurant equipment supply company. They would sell new stuff to a new restaurant. Restaurant would go bust, they buy it back pennies on the dollar, resell and repeat.\n\nThey sold the business maybe 5 years ago, the guy ran it almost in the ground. They bought it back pennies on the dollar. Just sold it again last year. They have more money than they know what to do with.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 899,
    "downs": 0,
    "created_utc": 1716816753.0,
    "media": null,
    "is_video": false,
    "num_comments": 422,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for anecdotes/stories of businesses that made big profits, a request for examples.",
    "composite_score": 5.002412693126846
  },
  {
    "score": 896,
    "title": "Doordash is offering my restaurant a $20,000 signing bonus if we use them for 90 days.",
    "selftext": "Doordash has been trying to get me to join them for months now, but I've been telling them repeatedly that we are happy with our local food delivery company. They have said multiple times that we are one of the top searched for restaurants in their app, but I never really believed them, as I assumed they probably say that to everyone who isn't on their platform. \n\nFast forward to today, after many attempts to set up a meeting with me, we finally sat down. The rep said that we are one of the \"top accounts\" in the county, and his boss has authorized a number of things if we sign with them. This includes a 3 month contract, no commitment on our end (we can cancel at any time), they will march th delivery charge of the local company we are currently using, and if we complete the 3 month contract, they will give us a $20,000 some gning bonus, no strings attached. \n\nAnyone have any experience with this, or have any insights whatsoever on this matter? \n\nIt may seem like a no brainer, but we are a small outfit, and if they actually deliver the increase in sales they are projecting for us, we may not be able to handle it, while also properly servicing our current customer base. That is more of a side note to the post, my main question is regarding this $20k bonus, and if anyone has dealt with this before?",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 896,
    "downs": 0,
    "created_utc": 1697599523.0,
    "media": null,
    "is_video": false,
    "num_comments": 413,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Seeking experiences and guidance on whether to take a $20k signing bonus and contract terms.",
    "composite_score": 4.9887926136045415
  },
  {
    "score": 886,
    "title": "Finally stopped offering discounts “just to be nice”",
    "selftext": "I used to give random discounts to almost everyone who asked. “It’s fine, I’ll just take a little less,” I’d tell myself, thinking it would help me keep customers happy.\n\nAll it did was make me tired and broke. The people who haggled the most were also the hardest to please.\n\nLast month I stopped. I stuck to my prices and said, “Sorry, that’s the rate.” You know what happened? Almost no one left. In fact, I got more respect, faster payments and fewer headaches.\n\nThe people who value your work will never argue over the price ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 886,
    "downs": 0,
    "created_utc": 1761137805.0,
    "media": null,
    "is_video": false,
    "num_comments": 126,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.82,
    "category_rationale": "Narrative about pricing discipline that leads to better customer relationships; conveys a general principle.",
    "composite_score": 4.734825480309705
  },
  {
    "score": 865,
    "title": "I Cannot Believe People Still Do This",
    "selftext": "\nTwo years ago, I left my family's boutique during the pandemic to become a software developer. Last August I returned to help my dad's struggling business. What I found shocked me.\n\nMy father was still using a notebook for bookkeeping he'd had for years. He wouldn't even use simple spreadsheets on excel because they were too complicated. The software options were also either too expensive for him or just not specific for his clothing store needs.\n\nI coded a simple digital digital cashbook for him and he finally budged. Everything in one place with a simple interface for him.\n\nWhat shocked me the most though is that I realized other local shop owners were also using the notebook method. They thought going digital was too complex or expensive.\n\nI'm curious are there other small businesses that still use a notebook to track finances? What's stopping you from going digital?",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 865,
    "downs": 0,
    "created_utc": 1723389422.0,
    "media": null,
    "is_video": false,
    "num_comments": 348,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.46,
    "category_rationale": "Uses a story to prompt others about going digital; primarily a discussion prompt.",
    "composite_score": 4.898930605496937
  },
  {
    "score": 867,
    "title": "Running a business is lonely as hell.",
    "selftext": "Nobody really tells you that when you start.\n\nYour friends and family support you, but they don’t *get it*. Your old coworkers don’t understand why you’d leave a stable paycheck. Your employees (if you have them) don’t see the stress you carry trying to make payroll.\n\nAnd when things get hard—and they always do—it’s just *you* staring at your books at 11 PM, wondering why you’re making less than you did at your old job.\n\nMost businesses don’t fail because the owner wasn’t capable. They fail because they got stuck. And when you’re alone, *stuck* turns into *shut down*.\n\nHere’s what helped me:\n\n* **Stop trying to “figure it out” alone.** You don’t get extra points for struggling in silence.\n* **Find people who understand the pressure of running a business.** Not just people who talk about it—people actually doing it.\n* **Have someone to call when things go sideways.** Because eventually, they will.\n\nI had to learn this the hard way. If you’re stuck in that lonely phase, figure out a way to change it. If you don’t know where to start, I can tell you what worked for me.\n\nHow do you handle the lonelier parts of running a business?",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 867,
    "downs": 0,
    "created_utc": 1741794850.0,
    "media": null,
    "is_video": false,
    "num_comments": 173,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Offers concrete steps and tips for dealing with loneliness in running a business.",
    "composite_score": 4.786294349317792
  },
  {
    "score": 858,
    "title": "There is no money in the coffee business.",
    "selftext": "I might get a lot of hate for this but anyone who owns a coffee shop or a coffee business barely makes any livable money. The reason most open a coffee shop is because they are really passionate about coffee and have been making coffee their entire life ( worked as a barista) and thought that opening a coffee business would be a vialble business but in reality working a 9-5 job is much better with guranteed pay, holidays and stress free mind. The risk-reward ratio for opening and running a coffee business is extremely high considering how much investment it takes to open a coffee shop for extremely low profit margin.\n\nA friend of mine runs a speciality coffee shop with only 3 employees and has a revenue of over 700k, yet he barely makes 70k on net profit. He was working as a designer and making 95k with unlimited PTO at a tech company before this but now he only takes 1 day off a week for the past 2 years.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 858,
    "downs": 0,
    "created_utc": 1750812344.0,
    "media": null,
    "is_video": false,
    "num_comments": 416,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Explains why coffee businesses often have low profits and shares data; opinion-based.",
    "composite_score": 4.949061191318121
  },
  {
    "score": 849,
    "title": "Lost my shit today, what would you do?",
    "selftext": "I get to work, my employee left me a note on top of the time sheets that said: \"Here are these (time sheets) for you to also check to make sure we didn't steal (underlined twice) from you!\n\nThis was after a $2k bonus and PTO for Xmas eve (and of course Xmas).  \nI asked about it, she said she didn't feel appreciated and not trusted because I asked to see the payroll time sheets.\n\nI run a small private practice mental health office. I'm used to dealing with emotional people, but they pay me to help them with their emotions, not the other way around. So I was livid and told her to go home and come back to work on Monday and let me know if she still wants this job.  \nWhat would you do?\n\n\\*the $2k bonus was the second yearly bonus she received. I also used my personal money to help with her dental emergency over the summer (on my vacation.)\n\nUpdate: She apologized. She stated that she has been depressed. Also, I do not expect her of stealing, as the payroll is also monitored by an outsourced bookkeeping /CPA.   \nThanks to all who offered advice and words of support. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 849,
    "downs": 0,
    "created_utc": 1735326021.0,
    "media": null,
    "is_video": false,
    "num_comments": 453,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Vent/complaint about an employee issue with a request for advice on how to handle; emotional.",
    "composite_score": 4.9554468521428445
  },
  {
    "score": 851,
    "title": "Avoid Square at all costs.",
    "selftext": "This is INSANE. I can’t believe I am having to post this, but I hope it helps others. \n\nAfter two years of processing payments, with zero notice, and zero reason given Square closed our account Saturday in the middle of the day. I wish I could say we are alone, so many folks have posted on the BBB that this makes me think that this isn’t just immoral, it maybe isn’t legal. \n\nHaving customers waiting in line and no phone support till Monday, we emailed like hell trying to get ahold of someone, anyone, to explain why. The response? \n\n“After a comprehensive review of your account, we have determined that we are still unable to process payments for your business. Our decision to deactivate your account is final. We understand that it can be frustrating to have your account deactivated. However, due to security concerns and the obligations of our agreements with card networks and other financial institutions, we cannot provide additional details. For more information about our policies on this matter, please review sections 12 and 13 of our General Terms of Service.”\n\nMy partner and I are literally gutted. On top of that, our funds are frozen in the account till August and we are potentially facing bankruptcy because we did our banking, savings, everything with square. We are scrambling, but as a small business this has completely and utterly put us in a bind that I can’t believe we would ever face. \n\nI can’t believe this is allowed, I am in such shock. How am I going to make payroll? How are we going to be able to pay our rent? We have been in business for two years, never once had a chargeback - Not. A. Single. One. \n\nAnd they can’t even tell us why? Complete BS. \n\nI hope everyone who reads this takes it as a warning and avoids Square at all costs. I know I am not alone in reading reviews now, but I (like many) feel duped into trusting what I thought was a reliable service. \n\nDoes anyone have any suggestions as to what we should do? ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 851,
    "downs": 0,
    "created_utc": 1747098147.0,
    "media": null,
    "is_video": false,
    "num_comments": 316,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Rant about Square closing accounts and the impact on the business; emotional.",
    "composite_score": 4.885969225875576
  },
  {
    "score": 843,
    "title": "I've kept 200 people employed for years. A tariff might end that overnight.",
    "selftext": "Hi guys,I run a company in Vietnam that sells wood materials for furniture manufactures like plywood, MDF, laminated panels, the raw stuff that turns into desks, cabinets, shelves. For years, U.S. buyers have been one of our biggest markets, keeping designers on budget, and honestly keeping my 200+ employees in jobs as well.\n\nNow with all this talk of a 25% tariff on furniture imports, I’m just… exhausted. Others are rushing to front-load shipments now, trying to beat the tariff window. Meanwhile, my workers are asking if hours will be cut, and I don’t even know how to answer them.\n\nWhat makes it worse is, even if these tariffs happen, does anyone really believe thousands of Americans will suddenly want to clock into a cheap furniture factory in North Carolina or Ohio tomorrow morning? We all know the answer. The U.S. makes maybe 20% of its own furniture right now, the rest is imported.\n\nInstead of generating more jobs, this just feels like a tax on everyone: higher prices for U.S. families, canceled orders for exporters like my company, and a ton of uncertainty hanging over small businesses who are already stretched thin.\n\nThis could be the first time trade policy is threatening my entire business. Has anyone else here had orders disrupted or fears of it because of tariffs? How are you preparing? Any suggestions for me? \n\n",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 843,
    "downs": 0,
    "created_utc": 1756044889.0,
    "media": null,
    "is_video": false,
    "num_comments": 332,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Describes tariff uncertainty and asks for input from others on preparations; seeks guidance.",
    "composite_score": 4.840064563378815
  },
  {
    "score": 834,
    "title": "Chinese aluminum parts tariff 73% (before Trump's latest increase)!!",
    "selftext": "We have a small business and ordered $3,380 worth of aluminum parts from China. Parts entered USA on 3/31/25. DHL requires $2,483.21 for \"import duty\" or they will send back the parts 5 days. When we asked for a bill, this is what DHL sent:\n\n[https://drive.google.com/file/d/1oFimeRm8D0hPwXpr3MMlWViVJn4Nf3Ac/view?usp=sharing](https://drive.google.com/file/d/1oFimeRm8D0hPwXpr3MMlWViVJn4Nf3Ac/view?usp=sharing)\n\nCan this be right?",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 834,
    "downs": 0,
    "created_utc": 1744050737.0,
    "media": null,
    "is_video": false,
    "num_comments": 236,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question about tariff and import duties with no actionable guidance.",
    "composite_score": 4.836560648488654
  },
  {
    "score": 813,
    "title": "Customer ordered $210 worth of stuff and then cancelled",
    "selftext": "So a customer ordered cookies and brownies totaling $210, her appointment to pick up is at 1 and my shop closes at 2 pm. The girl who works there told me that she called 5 minutes before 2pm saying she will be leaving her house now and she wanted chocolate too (her house is an hour away from the shop and with traffic these days, it might be 30 minutes additional). \n\nMy employee told her that she'll wait until 2:30 pm. The customer then said she's cancelling the order. \n\nNow, she left me a bad review saying that my employee was throwing temper tantrums at her and that her appointment at 1 is actually at 3 pm. \n\nI really hate people like that. At what point is 1 pm pick up appointment became 3 pm appointment? \nI should have asked her for payment up front.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 813,
    "downs": 0,
    "created_utc": 1701204584.0,
    "media": null,
    "is_video": false,
    "num_comments": 242,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Emotional complaint about a customer dispute and scheduling expectations.",
    "composite_score": 4.823427541688357
  },
  {
    "score": 810,
    "title": "I'm on target to do well over $100k in revenue with my one man operation cleaning business this year!",
    "selftext": "I am super stoked when I took a few minutes to run the numbers of what I've done since January 1 this year and looking at all the upcoming business along with a few business contacts I've secured in the past few days.\n\nQuick back story. I have a business and marketing degree and was in sales. Got laid off too Many times. The last time was two years ago.\nThe wife and I decided to pack up and give Florida a try after that. The housing market was insane at the time and jobs in Florida don't pay shit along with a higher cost of living then North Carolina.\n\nI told my wife \"I could do well with a cleaning business down there\". With no money in savings to fall back on, I got down there with $500 in equipment and hustled like hell everyday until I secured some commercial contacts and some steady residential customers.\n\nWe were doing great in Florida but hurricane ian came in and took the home we were renting.\n\nWe decided to move back to North Carolina. I thought there was no market for the cleaning business here so I started to look for a \"real job\".\n\nAfter over 50 places applied to and absolutely no call backs I decided to try thy business here too. That was in November and I was scared to death as we only had $4k to ride out until I started to get business.\n\nIt was a bit slow at first and I was literally counting the days until that money ran out.\nOur bank account never hit 0 but it got a hell of a lot closer than I was comfortable with. 6 months later and we're doing well and able to save a good bit of money every month.\n\nAfter running all those numbers from today I was super excited and had to tell someone other than my wife.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 810,
    "downs": 0,
    "created_utc": 1687296715.0,
    "media": null,
    "is_video": false,
    "num_comments": 170,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal revenue milestone narrative without a guiding explanation or steps.",
    "composite_score": 4.753018909407233
  },
  {
    "score": 806,
    "title": "Started showing my actual costs to customers and it weirdly helped my business",
    "selftext": "I run a small cleaning service (just me and 2 part timers) and I was always nervous about being too expensive compared to the franchise operations.\n\nAbout 3 months ago I had this customer who kept pushing back on a quote for a deep clean move out. Instead of just dropping the price like I normally would, I was honestly just tired and broke down exactly what everything cost. Like I showed them the supply costs, explained labor hours, even mentioned that I keep some money saved aside (like $7k from Stаke) for equipment replacements that I factored into pricing.\n\nThey ended up booking it AND referred their realtor to us. Now I do this with most estimates when people seem hesitant and my close rate went from like 40% to almost 70%. People seem to actually appreciate seeing where their money goes instead of just getting a final number.\n\nI thought being transparent would make me look amateur or unprofessional but its been the opposite. Had a property manager last week tell me she went with us specifically because I \"didn't treat her like an idiot\" when explaining costs.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 806,
    "downs": 0,
    "created_utc": 1767325331.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.85,
    "category_rationale": "Central claim about cost transparency improving pricing with supporting reasoning.",
    "composite_score": 4.616622760343854
  },
  {
    "score": 795,
    "title": "Have my first lawsuit hearing Monday.",
    "selftext": "I own a business that custom paints high end bicycles. These paint jobs start at $1000 and I've done them all the way up to $12,000.\n\nLast June a customer of mine was able to use UPS to steal their completed frame and ghost me. \n\nThis customer sent in their bike frame, a 3T Exploro gravel bike frame. He wanted an American flag paint job. (In hindsight, this felt appropriate (s)). The paint job was completed some time in May of 24. We reached out to the customer to let them know the bike was completed and sent them a link for payment. The customer said they were out of the country and would pay when they returned. Odd but whatever. When our jobs are completed we box them up and put a shipping label on them. This is so we can include shipping to the customer. We are next door to a UPS drop location so when a customer pays we walk their box over and off it goes. \n\nA few weeks ago by and this frame is still in the shop, annoying but not crazy uncommon. I am out of the state at an event my business sponsors and I get a notice that the frame has been picked up by UPS. I quickly call my shop and ask about it. My employee said that UPS came in saying they had a scheduled pick up and at that moment we only had the one box waiting. My employee assumed the customer had paid so she let UPS take it. Now I don't blame my employee. This isn't how things normally work, she was alone in the shop, and assumed I had set this up. I was annoyed but was not too concerned. I contacted the customer and asked if they had scheduled a pick up, they denied knowing anything about it. At that time I believed them but now I suspect they orchestrated this whole thing. After that email the customer cut off all communication and blocked me. Through tracking I saw the frame was delivered to his stated address in Memphis but that was all. For the next few weeks UPS would come in asking where the pick up was that was scheduled. When looking at the requests they all had some version of my name as the customer. I told UPS to never pick up from my store, that I would always go next door to drop off. \n\nAt the time this happened I assumed the customer would end up paying. Over the 11 years I've owned my business my customers often have felt like friends, so it took me a while to realize I have been stolen from. I even paid for back ground checks to see if the customer had died (has happened before) or was in jail. I also went to local Facebook groups in Memphis asking if anyone knew this person. \n\nFinally this fall I decided it was time to take this customer to court. I am in St Louis County MO and all the filing and paperwork was really easy. I am sueing him in small claims so now lawyer. I think I'm in for $75.00 and a few hours of work. \n\nI expect the customer won't show up so I'm ready to file a writ of execution to have property seazed to pay the debts owed. \n\nSo far I feel like the effort and cost has been worth it. I don't want to just roll over and accept this kind of treatment and am willing to do it just for the principle of it. Never been to court other than for a couple basic traffic tickets but I have all the documentation and conversations in text. I rarely talk with customers on the phone. So I think it should be fairly straight forward. \n\n\n\nEDIT 1:\n\nHad court today and defendant didn't show. Not surprised. Won the judgement. \n\nI then went downstairs and filed a civil levy (what they call it in St Louis County.) Once that is completed that will go to the Shelby County Sheriff's levy division. I need to call them to go through the steps they require. In Shelby county they seem to call it a writ of execution. In St Louis they said they use that term for landlords??? 🤷\n\nSpent 30 min in court and 30 min filing the levy. \n\nTo answer some comments that were being asked or stated often. \nWe have started taking 50% down payments on work. This event wasn't the top reason why, but it was part of the reason. Cash flow was the biggest reason. \n\nNo I still print out shipping labels. I wear lots of hats and it is just easier to do this once than to quote the shipping and then come back and do it again. This way of theft cannot happen again. It has been dealt with. \n\nI didn't get mad at my employee because in the end it is my fault. I did not create processes to handle something like this. That has been taken care of. \n\nSo far the time and money spent on this is worth it to me because fuck this dude. He's the one who is in the wrong. Sure there were mis-steps by others but he is the thief. \n\nI'll update again when I know more. Might be a couple months though. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 795,
    "downs": 0,
    "created_utc": 1740251350.0,
    "media": null,
    "is_video": false,
    "num_comments": 212,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Long anecdote about a legal dispute lacking instructional content.",
    "composite_score": 4.7926028694570375
  },
  {
    "score": 790,
    "title": "Worst time for everyone? This is my worst November in about 10 years of business",
    "selftext": "I own a hair salon. Typically, November is my busiest season. It has been SO quiet. A lot of my colleagues are also saying the same thing and have had to close up shop because of it - or get a second job. \n\nPeople keep saying it will get better and the economy will bounce back but I don't know. I am so close from just throwing in the towel, closing up shop and getting a corporate gig.\n\n\nedit: LOVE the camaraderie. Great (or no so great) to see other people also having hard time but we are all in this together. Really cool to see people lifting each other up and hoping things get better for you all! \n\nHope you all have killer Decembers and can buy the best gifts you and your loved ones deserve",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 790,
    "downs": 0,
    "created_utc": 1700012030.0,
    "media": null,
    "is_video": false,
    "num_comments": 857,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Emotional distress about a slow business period with a call for solidarity.",
    "composite_score": 5.084920127422029
  },
  {
    "score": 781,
    "title": "Suicide and small business owners",
    "selftext": "This post hurts to write.  A guy, in my town, a fellow small business owner took his own life because of his business failing.  \n\nI do not want to simply the issues someone goes through.  I lost my business 10 years ago, had to rebuild at 43, while fighting the federal government and eventually lost my freedom for 9 months.  Home for two years and rebuilt a business for the third time, Yes, there were many days that got dark, but I'm here to say to anyone that is going through tough times, trust me when I tell you, this too shall pass.  \n\n&amp;#x200B;\n\ngod bless and feel to reach you for support. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 781,
    "downs": 0,
    "created_utc": 1702274044.0,
    "media": null,
    "is_video": false,
    "num_comments": 303,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Post focusing on suicide awareness and support, not actionable guidance.",
    "composite_score": 4.854643544864225
  },
  {
    "score": 746,
    "title": "How Are U.S. Small Businesses Handling 104% Tariffs on Products That Can Only Be Sourced from China?",
    "selftext": "Hi everyone,\n\nI’m part of a Chinese manufacturing company that has been exporting indoor playground equipment globally for over 15 years — mainly to small business clients like family entertainment centers, kids' cafés, and franchises.\n\nJust last week, **the U.S. tariff on our category jumped from 34% to 104%**. One of our American customers said, *“There’s no way I can make a profit now.”*\n\nI'm not here to promote or sell anything — I’m genuinely looking to understand how **U.S. small businesses are adapting to these new tariffs**, especially when:\n\n* The products are not produced locally in the U.S. at all.\n* Alternatives (e.g., India, Vietnam) don’t offer the same quality or safety certifications.\n* Buyers still need these products for planned launches or seasonal openings.\n\nA few questions I’d love your insight on:\n\n* If you were affected by similar tariffs, how did you manage or negotiate around them?\n* Have you worked with suppliers that ship through third countries to reduce the duty impact?\n* How do you communicate such a big cost jump to your customers?\n\nI truly believe this issue affects both sides of the supply chain. I’m here to listen and learn from your experiences — thanks in advance.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 746,
    "downs": 0,
    "created_utc": 1744166491.0,
    "media": null,
    "is_video": false,
    "num_comments": 412,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Request for experiences on tariffs; lacks procedural guidance.",
    "composite_score": 4.8712956276436
  },
  {
    "score": 745,
    "title": "Family is making $27k+/month from our Coffee Shop Drive Thru (2 locations). Only want to sell for $1M+... Is that realistic?",
    "selftext": "Title pretty much says it all. I'm not sure the $1M valuation is realistic but other people have said 7x of annual Net Income ($2.2M) is a realistic sales price. Does anyone have any experience here? The company is branded well (especially for the market), has systems set in place requiring only 1 operator to be paid out of that $27k monthly, and is the highest rated local coffee shop in the area. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 745,
    "downs": 0,
    "created_utc": 1742688327.0,
    "media": null,
    "is_video": false,
    "num_comments": 271,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Valuation-related question about a family-run coffee shop; no steps.",
    "composite_score": 4.795023279489768
  },
  {
    "score": 742,
    "title": "My small business is failing after seeing multiple 6 figure years ",
    "selftext": "Hi I don’t know where else to post. I am just beside myself. I own a small jewelry business. I opened my small biz 5 years ago. I’ve made multiple 6 figures in one year. Since 2023 my sales have been dwindling BAD. I realized that if I don’t find a job I won’t be able to pay any of my bills anymore. I poured my heart and soul into this small business. Is anyone else in the jewelry world seeing declining sales? I had 4 videos go viral in the span of two weeks, maybe I made $200 in sales from those videos. My viral videos used to convert so well for me. One million views = $30k in one day. Now, I’d be lucky if I make $500 from a viral video. I have done everything I can to save my small business and I’m feeling super sad about all of this.  ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 742,
    "downs": 0,
    "created_utc": 1713812198.0,
    "media": null,
    "is_video": false,
    "num_comments": 459,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Emotional lament about declining business with no actionable steps.",
    "composite_score": 4.899867729601362
  },
  {
    "score": 743,
    "title": "Someone I just me: “How many employees do you have?” Me: “I’ve got 3, 1 sales rep and 2 drivers”. Them: “well, everyone has to start somewhere.” Me: “Yah, I guess that’s true…”",
    "selftext": "Me as soon as I get outside: “Motherfucker, do you know how hard and long I worked to be able to employ 3 people?  Who do you think I am fucking FedEx?  Why don’t you start a company and see how long it takes you before you can afford 3 employees?  Start somewhere??? Asshole, I started a long fucking time ago, and I’m still fucking here!” \n\nMe with a follow up email: “Thanks for the opportunity! Hope to hear from you soon!”\n\nRant over.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 743,
    "downs": 0,
    "created_utc": 1691977443.0,
    "media": null,
    "is_video": false,
    "num_comments": 180,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Pure emotional vent about belittling remark and the hardship of building a small team.",
    "composite_score": 4.712912222980471
  },
  {
    "score": 740,
    "title": "I'm really tired of people trying to sell me ChatGPT wrappers.",
    "selftext": "I run a small law practice. The amount of marketing by charlatans trying to convince me to incorporate their shitty LLM program into my business is nauseating. The courts have been very consistent about sanctioning attorneys who file LLM-written briefs that hallucinate case citations. I will never use an LLM in my business. Period.\n\nI know this must apply to other industries. What's the most ridiculous business case you've been pitched by the AI-scammers?",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 740,
    "downs": 0,
    "created_utc": 1743530687.0,
    "media": null,
    "is_video": false,
    "num_comments": 151,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Venting about marketing scams around AI/LLM with a strong stance against adoption.",
    "composite_score": 4.688240001951714
  },
  {
    "score": 732,
    "title": "USA based businesses, how close are you to seriously struggling due to China tariffs?",
    "selftext": "Hello. I am a full time artist managing a small art business. I have one employee. About half of my merch with all my designs printed on it comes from China. I've tried finding manus in the US to no avail. I'm about two weeks away from basically being screwed as my stock runs low.  I've had highs and lows but never such an abrupt loss of revenue that's pretty much out of my control. I'm not sure what to do. Where are you guys at?",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 732,
    "downs": 0,
    "created_utc": 1745814579.0,
    "media": null,
    "is_video": false,
    "num_comments": 545,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Open request for experiences on tariff impact; lacks actionable guidance.",
    "composite_score": 4.908700295993496
  },
  {
    "score": 725,
    "title": "My story….",
    "selftext": "So I come from a very rural and poor area (avg. household income $41,000) with jobs that offer $10hr-$15hr. My half brother has been in drain cleaning for 7 years. He told me how he can’t move up. I told him to show me the equipment and I would buy it and setup the business. Fast forward 3 months we invested $6,900 dollars in tools and equipment and now make on average $1,000 a day with only 4 or 5 hours of physical work. We are just getting started but the growth is phenomenal for such a small investment. We are both in our 20’s still an minorities. We have basically proven you can succeed anywhere. If there isn’t jobs then create them is my philosophy.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 725,
    "downs": 0,
    "created_utc": 1680089267.0,
    "media": null,
    "is_video": false,
    "num_comments": 198,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Personal success story that presents a philosophy about creating opportunity.",
    "composite_score": 4.722863158904946
  },
  {
    "score": 711,
    "title": "Business is failing.... Struggling to get out of this funk.",
    "selftext": "Backstory: I sold everything I owned in 2021 and quit my job of 10yrs. Well paying job, but wanted to take the leap and scratch my entrepreneur itch. Moved across the country (from California to South Carolina) and bought an existing business. The business is a custom furniture shop, we design and build custom furniture for clients and designers around the area. The first year was great, we did 30% more in sales than the previous owner ever did in 7 years of business. Designed and created some insanely cool furniture. I had to purchase bigger and more efficient equipment to keep up with our demand, this meant taking out a loan of $50,000 in July of 2022. Sales picked up even more, and I ended up hiring 2 more guys (now 4 total). All was going fine up until about June of 2023, sales dropped off. I still had a strong feeling that we had something good going so I decided to double down and take out another $30,000 loan and invest in marketing and a little more equipment. This is where I feel I messed up. Took the loan, and basically used it to pay my guys while the company was \"slowly\" drowning. \n\nAs of 2 weeks ago, I had to let 2 guys go. As of next week I will have to let the last 2 guys go. I'm out of money. Feel like complete shit. Feel paralyzed mentally and am unable to think of a single move to make to get out of this hole.  I have a lease for the next 8 months on a 3,600 sq ft shop. \n\nI'm not writing all of this for sympathy, more so for encouragement. Has anyone else been in this situation? What did you do? I don't plan on quitting until I'm bankrupt but man its getting hard. I'm having mental breakdowns every other day and feel worthless. ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 711,
    "downs": 0,
    "created_utc": 1696469406.0,
    "media": null,
    "is_video": false,
    "num_comments": 606,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Emotional breakdown post about business failure with a request for encouragement/advice.",
    "composite_score": 4.971574339174485
  },
  {
    "score": 703,
    "title": "Bought a small 3 bay car wash. Thoughts?",
    "selftext": "Bought a small, 3 bay car wash with 1 vending machine in a small town in rural MO (1k people) \n\nThe previous owner had ZERO numbers. Just utilities. \n\nIt’s all cash, has credit card machines but did not have internet that was fast enough. (Just got starlink hooked up and have cameras for now and ready for cc soon) \n\nI’m 2 weeks in and it’s done about $600 in revenue (minus about $120 in soda cost) \n\nAfter expenses I am suspecting it will profit about $600 a month as is (includes new internet bill) \n\nOnce I get everything on cc, and going to add 1 more dual vending I think I can get it to 2k a month revenue. \n\nI bought for 60k, will put about 5k in to get it where I would like.\n\nDid I make a  bad buy? ",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 703,
    "downs": 0,
    "created_utc": 1748131744.0,
    "media": null,
    "is_video": false,
    "num_comments": 278,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for evaluation of a potential purchase; presents numbers but no steps.",
    "composite_score": 4.7828747607789115
  },
  {
    "score": 692,
    "title": "ATTN: Check your GoDaddy subscriptions right now.",
    "selftext": "Hope to shed some light on this situation I have found myself in. I am an entrepreneur. One hard working human. Over the weekend, I (painfully) realized why I’m so broke.\n\nGoDaddy has been charging me hundreds of dollars more than expected—without any notice. Every. Single. Month. \n\nWhen I asked for a breakdown of the charges, their support team dodged my questions, sent me in circles, and refused to issue a refund.\n\nWhat Happened:\n\n* Increased renewal prices without warning (by more than 54 percent in some cases).\n* Charged me for \"free\" services.\n* Auto-renewed a three-year domain plan I had already paid for.\n* Support was useless—kept sending me to links instead of answering my concerns.\n\nExpenses to Watch Out For:\n\n* Websites + Marketing Lite - Renewal - 1 year\n* .ORG Domain Registration\n* Full Domain Protection (that I never asked for)\n\nWhen I pushed back and demanded an itemized breakdown, they kept avoiding the question. I had to involve my bank (Chase Business Disputes) and report them for deceptive billing.\n\nWarning for Small Business Owners:\n\nCheck your GoDaddy subscriptions now.\n\n* Turn off auto-renewals—they hike prices without warning.\n* Compare renewal costs—sometimes, canceling and repurchasing is cheaper.\n* If they refuse to refund you, file a dispute with your bank (under \"overcharging,\" not fraud).\n\nI am confident I am not alone here. Lets raise awareness around this corrupt platform. Best of luck to all!",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 692,
    "downs": 0,
    "created_utc": 1741314750.0,
    "media": null,
    "is_video": false,
    "num_comments": 179,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.78,
    "category_rationale": "Provides warning and a sequence of practical steps to avoid being overcharged by GoDaddy.",
    "composite_score": 4.680869487163459
  },
  {
    "score": 694,
    "title": "What no one tells you about hitting the 6-Figure mark",
    "selftext": "I was chatting with a friend today who was all hyped about turning 4K into 200K or even 2M. And I'm like, \"how about focusing on making your first sale first?\" (He is starting a small online business)\r  \n\r  \n\\- I've started three businesses; the first two didn't work out.\r  \n\\- Took one business from zero to 100K in three years. Yep, years, not months.\r  \n\r  \nI'm not a millionaire or an MBA grad. I've just worked my butt off to get better at what I do.\r  \n\r  \nI’ve spent a lot of time with other entrepreneurs and I wanted to say a few things that I are usually never shared about entrepreneurship:\r  \n\r  \n**First sale over millions:** the first time I made a sale, I cried. I had put in so much work, and finally, someone believed in my product enough to buy it. It's a moment that makes all the sleepless nights worth it. Don't chase millions; focus on that first sale. It's a game-changer.\r  \n\r  \n**The hustle can be brutal**: You think you're gonna work a few hours a week and become a millionaire? it doesn't work like that. I've had weeks where I barely made enough to cover my bills, despite working 100-hour weeks. It's a grind, but if you stick with it, the payoff can be huge. Just don't expect it to happen overnight.\r  \n\r  \n**Don't be a copycat**: I spent way too much time trying to emulate other successful entrepreneurs. Big mistake. The moment I embraced my unique style and approach, things started to click. You've got to be you because nobody else can. Also, entrepreneurs usually only tell the good things about their journey (1% of it), so you always feel you are a failure in comparison. \r  \n\r  \n**The emotional toll:** running a business can mess with your head. I've had relationships fall apart and missed countless social events because I was tied to my work. It's a sacrifice, but one I knew I had to make. Still, it's essential to find a balance; otherwise, you'll burn out.\r  \n\r  \n**Learning vs. Doing**: I used to hoard courses and books thinking they'd make me successful. But knowledge is useless without action. These days, I focus more on implementing what I learn, rather than just consuming information.\r  \n\r  \n**Lonely journey**: Most of my friends with 9-5 jobs just don't get the stress and responsibility that come with running a business. It can be isolating, but it's crucial to surround yourself with people who understand your journey and can offer genuine advice.\r  \n\r  \n**Get help, seriously**: The moment you can afford it, delegate. I used to hate admin tasks, so hiring a VA was a game-changer for me. It freed me up to focus on what I'm good at.\r  \n\r  \n**The youtube trap**: It's easy to get sucked into the success stories and think that's the norm. But those guys went through a lot of failures to get where they are. Your journey is your own; don't compare it to a highlight reel.\r  \n\r  \n**The long game**: If you can pay your bills this month, you're doing alright. If you can pay them next month too, you're killing it. The real wins in business come from sustained effort over time, not overnight success.\r  \n\r  \n**You're a rare breed**: If you've started a business, you're already ahead of the game. You're one of the brave souls willing to take a risk and chase a dream. Never forget how awesome that makes you.\r  \n\r  \nStarting a business makes you a special kind of crazy, in a good way. You're chasing your dreams, and that's something to be proud of. Surround yourself with people who get it and will keep it real with you. And more importantly, surround yourself with people that will tell you the truth.",
    "subreddit": "smallbusiness",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 694,
    "downs": 0,
    "created_utc": 1696338979.0,
    "media": null,
    "is_video": false,
    "num_comments": 128,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.68,
    "category_rationale": "Offers a set of entrepreneurship insights presented as multiple actionable points.",
    "composite_score": 4.617279659739738
  }
]