[
  {
    "score": 1026,
    "title": "How to speak so that people respect you (learned this after years of being ignored)",
    "selftext": "I used to be the person who got talked over in meetings, whose suggestions got dismissed, and who people just didn't seem to take seriously.\n\nTurns out, it wasn't what I was saying it was HOW I was saying it. These small changes in how you speak can completely transform how people see you:\n\n1. Slow down your speech. Nervous talkers rush their words. Confident people take their time. Speak like every word has weight. People will lean in instead of tuning out.\n2. Lower your voice at the end of statements. Don't end sentences like questions? It makes everything sound uncertain? Lower your tone at the end. It signals confidence and finality.\n3. Use fewer filler words \"Um,\" \"like,\" \"you know\" these kill your credibility. Pause instead. Silence shows you're thinking, not just filling space. Pauses make people pay attention. Because that way they understand you put effort into the words you say.\n4. Stop over-explaining \"I think we should do X\" hits harder than \"Well, I mean, maybe we could try X, but I don't know, what do you think?\" Say what you mean. Period. Don't make it long but keep it short.\n5. Match or mirror their volume If someone speaks softly, don't shout. If they're animated, bring energy. But always stay slightly calmer than them. You become the steady presence in the room.\n6. Use definitive language. Replace \"I feel like\" with \"I think.\" Replace \"maybe\" with \"likely.\" Replace \"I guess\" with \"I believe.\" Own your words. The kind of words you use dictate the image people have to you. As much as possible don't swear especially in professional settings.\n7. Don't fill every silence. Let your words breathe. When you finish making a point, stop talking. The urge to keep explaining shows insecurity. Plus the more you talk the more people will care.\n8. Speak to the person, not the group. Even in group settings, make eye contact with individuals. \"John, what's your take?\" vs \"What does everyone think?\" Direct connection creates respect. Because the more you talk to everyone the less chances anyone will respond.\n\nWhat I noticed when I started doing this:\n\nPeople stopped interrupting me mid-sentence. My ideas actually got heard and considered. Colleagues started asking for my opinion instead of talking around me.\n\nI realized I was apologizing for having thoughts. \"Sorry, but I think...\" or \"This might be dumb, but...\"\n\nStop apologizing for existing. Your ideas have value. Speak like you believe it.\n\nPractice this: Record yourself having a conversation (with permission). Listen back. Count the filler words, notice your tone, hear how you end sentences. It's eye-opening. Or just record yourself talking to yourself. It works either way.\n\nHow you speak is how people think of you think (Perception). If you sound uncertain, they assume you are uncertain. If you sound weak they will assume you are not trustworthy.\n\nYou don't need to be the loudest person in the room to command respect. You just need to sound like you respect yourself first.\n\nKeep learning. I had to learn this for years. Have a good day!\n\nIf you liked this post perhaps I can tempt you with my [weekly newsletter](https://www.theimprovementletter.com/?utm_source=r/socialengineering_how_to_speak_so_that_people_respect_you_learned/&amp;utm_medium=email&amp;utm_campaign=reddit_post&amp;utm_term=Post&amp;utm_content=1). I write actionable tips like this and you'll also get \"Delete Procrastination Cheat Sheet\" as thanks",
    "subreddit": "SocialEngineering",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1026,
    "downs": 0,
    "created_utc": 1755473835.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.492251290514415
  },
  {
    "score": 719,
    "title": "Reading \"How To Win Friends and Influence People\" is literally a cheat code.",
    "selftext": "For five years, I had chronic social anxiety and that changed when I owned \"How to Win Friends and Influence People.\" I’d read it, highlighted passages but actually not put it to work.\n\nThen the pain of my having bad social skills got bad enough. The isolation started to feel less like a choice and more like a prison. That's when I re-opened the book and started applying the principles for real this time.\n\nI went from being ignored to people asking advice for me now.\n\nHere’s the raw, unfiltered breakdown of the techniques I stole from Carnegie that actually changed everything:\n\n* I started using names a lot. It felt unnatural, almost manipulative at first. Instead of a generic \"thanks,\" it became \"Thanks, Sarah.\" Instead of \"good point,\" it was \"That's a sharp insight, Mike.\" I expected people to find it weird. Instead, they lit up. Their entire demeanor changed. You can see a flicker of recognition in their eyes, a small spark that says, \"You see me.\"\n* forced myself to become interested. I used to fake interest in other people's lives. It was exhausting and transparent. But instead of letting that past I decided to find somethin we can connect to. This was especially great when I realized my other co-worker also liked to draw. We became friends instantly when I knew he can also paint.\n* I forced myself to be humble. My old self was desperate to prove my intelligence. I’d correct people, one-up their stories, and offer unsolicited \"better\" ways of doing things. It was pure insecurity. I switched tactics. Now, when someone explains something, I ask, \"How did you even think of that?\" or \"What was your process for figuring that out?\" People hate being corrected.\n* stopped pointing out mistakes. A coworker screws up in a meeting. The old me might have pointed it out to look sharp but now \"I think those numbers might be from last quarter, we should double-check,\" or \"I might be misremembering, but I thought we agreed on X.\" It gives them an out. They get to fix the mistake without being publicly humiliated. They never forget who had their back in a moment of weakness. It helps a lot.\n* Instead of thinking what to say, I listened. I used to treat conversations like a debate. While the other person was talking, I'd think of what to say next. It was exhausting because I was performing a constant mental juggling act. I forced myself to stop. To just shut up and absorb what the other person was *actually saying*. To ask questions about *their* points. Suddenly, conversations weren't work anymore. When you stop trying to steer, you can actually enjoy the ride.\n* I celebrated people's wins. When a coworker did something well, I’d mention it to others, especially to people in charge. \"Did you see how Sarah handled that client? It was brilliant.\" It costs you nothing. Zero effort. But the person you celebrated will see you as an ally for life. People never forgive those who gossip about them but never forget those who praise them behind their backs.\n\nI hope this was helpful. This is what I use a lot even now. If you have questions feel free to ask.\n\nIf you liked this post perhaps I can tempt you with my [weekly newsletter](https://www.theimprovementletter.com/?utm_source=r/socialengineering_reading_how_to_win_friends_and_influence_people/&amp;utm_medium=email&amp;utm_campaign=reddit_post&amp;utm_term=Post&amp;utm_content=1https://www.theimprovementletter.com/?utm_source=r/habits_how_to_speak_so_that_people_respect_you_learned/&amp;utm_medium=email&amp;utm_campaign=reddit_post&amp;utm_term=Post&amp;utm_content=1). I write actionable tips like this and you'll also get \"Delete Procrastination Cheat Sheet\" as thanks\n\nThanks for reading",
    "subreddit": "SocialEngineering",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 719,
    "downs": 0,
    "created_utc": 1755911466.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.514581722053053
  },
  {
    "score": 669,
    "title": "The fact that the safety vest and clipboard tactic working is crazy.",
    "selftext": "Listen I'm not saying it works everywhere but as a truck driver in some cases it works well...\n\nNow I won't disclose where and who but I work for a company that drops trailers at a  warehouse.  Now lately during the week it's been chaotic, the line to get into the office on the other side is horrible.  Last week I decided to see if they left the door open on the side of the building I need to drop and pickup at.\n\n  Mind you I'm not doing anything besides walking in to the other side, getting my paperwork and walking out.  So I'm doing nothing nefarious.  However seeing that they leave the door open left me with this idea.\n\n I can't take credit for it but I truly wanted to see if it worked so I can cut down on my time spent here.  So I put on the safety vest, and grab my clipboard.  At first employees just looked and moved on... every employee just ignored me... that day I had to pass back and forth 4 times... (dumb reasons but whatever)\n\n\nSo earlier today I tried it again... again I kept getting looked at.  Not one word said to me.  Grabbed my paperwork and walked back.  This time I had an employee talking to me.  Literally asking me if I was just getting there to clock in. 😏\n\nIn truth I was honest with him and he didn't care, but at first he was thrown off thinking I was an employee.  The fact that it worked that well was insane to me, how many people just don't recognize who works there and who doesn't, and doesn't think about the security.\n\nNow again I wasn't there to do any harm and I just wanted a short cut to get in and get out... but I thought I'd share the story on how effective that knowledge is...\n\nEdited: to improve quality of read.",
    "subreddit": "SocialEngineering",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 669,
    "downs": 0,
    "created_utc": 1757019329.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.467531481022254
  },
  {
    "score": 576,
    "title": "7 psychology secrets that make people instantly respect you (learned this the hard way)",
    "selftext": "I used to be the guy everyone walked over. At work, in relationships, even with strangers which made me felt invisible.\n\nThen I discovered these psychology tricks that completely flipped how people treat me. Now people actually listen when I speak.\n\nHere's what I learned:\n\n1. Stop over-explaining yourself. The more you justify your decisions, the weaker you sound. Say \"I can't make it Friday\" instead of \"I can't make it Friday because my cousin's dog has a vet appointment and...\" which sounds bad like you're running away from it.\n2. Use the 2-second pause before responding to anything, count to two. It shows you're thoughtful, not reactive. Plus, it makes people hang on your words. Silence makes people perceive your words as credible.\n3. Match their energy, then dial it down 10% If someone's excited, be interested but stay slightly calmer. If they're angry, be concerned but composed. You become the stable one they look up to. Most people are emotional so if they see you are not they will respect you.\n4. Ask \"What do you think?\" instead of giving advice firs. People respect those who value their opinions even when you know the answer, let them feel heard first.\n5. Stand up straight, but relax your shoulders. Confidence is shown when your taking up your space comfortably. This one changed how people see me instantly.\n6. Remember small details about people like \"How did your presentation go last week?\" These little callbacks show you actually pay attention. It's rare, and people notice when you mention things that are easy to forget.\n7. Say \"I don't know\" when you don't know. Pretending to have all the answers makes you look insecure. Admitting ignorance? That takes real confidence. Being honest about your knowledge makes you genuine.\n\nRespect isn't about being the loudest or smartest person in the room. It's about being genuine, thoughtful, and secure enough to let others shine too.\n\nTry just ONE of these this week. You'll be shocked at how differently people respond to you.\n\nIf you liked this post perhaps I can tempt you with my [weekly newsletter](https://www.theimprovementletter.com/?utm_source=r/darkpsychology_7_psychology_secrets_that_make_people_instantly/&amp;utm_medium=email&amp;utm_campaign=reddit_post&amp;utm_term=Post&amp;utm_content=1https://www.theimprovementletter.com/?utm_source=r/habits_how_to_speak_so_that_people_respect_you_learned/&amp;utm_medium=email&amp;utm_campaign=reddit_post&amp;utm_term=Post&amp;utm_content=1). I write actionable tips like this and you'll also get \"Delete Procrastination Cheat Sheet\" as thanks",
    "subreddit": "SocialEngineering",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 576,
    "downs": 0,
    "created_utc": 1756295478.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.231915271676859
  },
  {
    "score": 385,
    "title": " How to NEVER let anyone get to you",
    "selftext": "I used to be someone who got agitated very quickly.\n\nI got tired of looking like that. So I figured out a social engineering tip to NEVER let anyone get to you. It’s pretty simple, some people already do this automatically, so this might be common sense for those some.\n\nBefore I go over the steps, it’s important to realize why people make backhanded comments, jabs and under the table insults.\n\nIt’s to get you emotional.  \nIt’s to get a rise out of you.  \nIt’s to get you to get flustered.\n\nThey do this to gain a sense of control.\n\nThink of this way. Negative emotions and control are *inverse*.\n\nThe more the negative emotions you display, the less control you have.  \nThe more control you have, the less negative emotions are displayed.\n\nBut there’s a bigger problem.\n\nIf someone is able to get you flustered in a public setting, the snowball starts rolling down the hill.\n\nYou’ll realize you are flustered.  \nYou’ll recognize others see you flustered.  \nYou’ll become even more anxious and in your head.\n\nThen…\n\nYou’ll become even more flustered.  \nYou’ll look even more flustered in front of others.  \nYou’ll become even more anxious than you were before.\n\nRinse and repeat. Now you’ve lost control of the situation.\n\nIt becomes a nasty cycle.\n\nThe trick is to never **show** that what was said bothered you. We are only humans, no one is ever 100% confident. It’s more pragmatic to learn how to get around unnecessary comments.\n\nIn order to do this, you must know exactly how to respond.\n\nHere are the exact steps:\n\n1. Catch when someone makes a backhanded comment.\n\nExample A: “He’s so much better than you at pickle ball.”  \nExample B: “You really think you are better looking than him?”  \nExample C: “Why’d you wear that?”\n\n2. Figure out which emotion or state of mind arises because of that comment.\n\nExample A: Defensiveness  \nExample B: Embarrassment  \nExample C: Insecurity\n\n3. Determine the opposite emotion or state of mind.\n\nExample A: Receptiveness  \nExample B: Indifference  \nExample C: Confidence\n\n(Example B is not exactly opposite but still works)\n\n4. Respond as if you were feeling that opposite emotion.\n\nExample A: *“He really is! His serve is amazing, I need to work on that.”*  \nExample B: Nonchalantly *“Ah yeah, he really is.”*  \nExample C: *“I think I look great!”*\n\nThis works because you responded in the exact opposite way they expected you to. Most of the times, they won’t know what to say next.\n\nThey’ll be at a loss for words. You’ll still be in control.\n\nIf anyone has any other cool methods or how this could be improved would love to hear about it.",
    "subreddit": "SocialEngineering",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 385,
    "downs": 0,
    "created_utc": 1718723605.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.23135927244269
  }
]