[
  {
    "score": 784,
    "title": "Stop Creating Content Nobody Watched: Here’s what works in 2025",
    "selftext": "I've been managing social for 3+ years and I've never seen so many marketers waste time creating content that gets close to ZERO traction. The landscape has completely changed, but most of us are still using 2020 playbooks.\n\nHere's what's actually working right now (spent $80k+ testing this across 30+ clients in 2024):\n\n1. Stop trying to be everywhere. Pick ONE platform and absolutely crush it. When we focused just on TikTok for our clients, average views went from 1-2k to 20k+. More importantly, engagement rate jumped from 0.8% to 4.2%. Better to be a king on one platform than a nobody on all of them.\n2. Reaction content is the cheat code right now. Instead of creating original content from scratch, we have clients react to viral fails/trends in their industry. Example: Had a plumber client react to horrible DIY plumbing videos with \"here's why this could cost you $10k to fix.\" His most viral video hit 1.2M views. Basic green screen, zero fancy editing.\n3. Drop the \"professional\" look. Our most successful videos look like they were filmed in 5 mins (because they were). Raw, unpolished content consistently outperforms fancy produced videos. One of our best performing videos was literally shot in a client's car between meetings.\n4. Scale your content without killing yourself. We went from creating 2-3 pieces of content per client per week to 10-15 by working smarter. Take advantage of all the new tools coming out to help with scripting, ideation, and generation (to an extent). Our engagement actually went UP with more content. If you aren’t creating enough content, you are going to hit a wall.\n5. Pattern interrupts in first 2 seconds. Start with controversy or confusion. Instead of \"Hey guys, today we're talking about...\" we start with \"You're probably doing this completely wrong...\" Watch time jumped 40%.\n\nNobody cares about your perfectly edited carousel posts or beautifully designed graphics. They care about solving their problems or being entertained.\n\nThis isn't theoretical BS - we're seeing these results consistently across different niches. Happy to share more if anyone's interested.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 784,
    "downs": 0,
    "created_utc": 1737850294.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Numbered list of distinct content strategy items.",
    "composite_score": 4.566414650241224
  },
  {
    "score": 397,
    "title": "I spent $173K on LinkedIn, Meta, Reddit, and Google Ads for B2B. Here’s what worked for me",
    "selftext": "(And before anyone says it. Yes I revised this with ChatGPT because my thoughts can be scattered sometimes but this isn’t BS. Just trying to help.)\n\nNot here to flex. Just want to share what 1+ years, 117 ad campaigns, and a healthy dose of trial-and-error taught me about running B2B ads across the big platforms.\n\nI run a niche marketing agency for service-based businesses—consultants, SaaS startups, fractional execs. You know, the folks who live and die by qualified leads, not likes.\n\nI’ve personally managed $173,000 in paid media across LinkedIn, Reddit, Meta (FB/IG), and Google Search. Here’s what the data—and the headaches—taught me:\n\n⸻\n\n🧨 LinkedIn Ads: High-stakes poker… but worth it\n\n• CPC averages? $11 to $24 (yes, really).\n\n• But LinkedIn is the only platform where I can say with 99% confidence: the right people saw my stuff.\n\n• Most profitable campaign? A client case study carousel that cost ~$5,200 and booked 38 qualified sales calls. Closed $92K in contracts.\n\nWarning: Cold audiences will ignore you unless you’ve already built some trust through content or retargeting.\n\n⸻\n\n🧠 Reddit Ads: The unexpected MVP (if you play it cool)\n\n• Reddit’s where smart, skeptical people hang out. They don’t want to be sold to—they want insight.\n\n• I dropped ~$7,800 on promoted posts in subs like r/smallbusiness, r/startups, and r/marketing.\n\n• ROI? Modest in terms of direct conversions, but HUGE in SEO and content reach. Several threads are still sending traffic months later.\n\nTreat it like a content platform with a boost button, not a traditional ad channel.\n\n⸻\n\n📉 Meta Ads (FB/IG): Cheap reach, expensive leads\n\n• CPMs were dreamy ($4–$7). CTRs looked great.\n\n• But most leads? Cold, unqualified, and bounced before I could say “nurture sequence.”\n\n• Great for brand awareness and retargeting, but not where you go for B2B buyer intent.\n\n• Best performer: 30-sec explainer reel + retargeted testimonial carousel. But ROAS still lagged behind LinkedIn by a long shot.\n\n⸻\n\n🔍 Google Search Ads: Intent goldmine… if you can afford it\n\n• We spent $48K here—mostly on niche service keywords.\n\n• Highest ROAS came from localized or “solution-aware” searches like “fractional CMO for SaaS” or “B2B content strategy agency.”\n\n• The downside? Crazy CPCs. $9–$40 depending on competition.\n\nIf your landing page sucks, you’re lighting cash on fire. But if it converts, it converts hard.\n\n⸻\n\n💡 What I’ve learned:\n\n1. No ad fixes a weak offer or bad messaging. Learned that the expensive way.\n\n2. LinkedIn converts, but only if you warm them up. Thought leadership + retargeting is the play.\n\n3. Reddit is SEO with benefits. It won’t make you rich overnight, but it will make you visible.\n\n4. Google is for closers. Meta is for lurkers. Reddit is for thinkers. LinkedIn is for decision-makers. Adjust accordingly.\n\n5. You need a content system behind the ads. Traffic is useless without a nurture path.\n\n⸻",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 397,
    "downs": 0,
    "created_utc": 1749239726.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.76,
    "category_rationale": "Data-driven explanation of ad performance with lessons learned.",
    "composite_score": 4.3630794146528
  },
  {
    "score": 386,
    "title": "I analyzed 1000+ viral hooks and found some patterns not enough people talk about",
    "selftext": "Built and trained an AI tool that creates viral hooks for any topic and went down a rabbit hole on what makes content perform. Here are some patterns I found that don’t get enough attention imo.\n\n(P.S. My background is in neuroscience + neurotech, and seeing those principles show up in content has been wild. Happy to dive deeper if you’re curious!)\n\n**Contradictions &amp; Contrast**\n\nHooks with contradictions just get the work done.\n\n\"I'm drunk, but Imma do my best to tell this story\"  \n\"Terrified? Absolutely. Ready? Not really. Worth it? 100%.\"\n\nYour brain can’t scroll past unresolved tension. Found this in \\~30% of top performers (and tbh these always get me too - I find myself watching the entire thing every damn time).\n\n**The Specificity Effect**\n\nThe more weirdly specific you get, the more people relate. Speak to one person instead of an audience, and you'll see the magic happen.\n\nGeneric: \"If you ever get bloated after a meal...\"  \nSpecific: \"If you've ever secretly unbuttoned your jeans at dinner and hoped no one noticed - this is for you\"\n\nHyper-specificity creates instant credibility (people’s brains go, “This person actually lived this”. Works across every platform.)\n\n**Timeframe Tension**\n\nUnexpected timeframes are chef’s kiss:\n\n\"3 years of back progress in 30 seconds\"  \n\"Three months ago I had 0 followers, today I’m at 211K\"\n\nShort, punchy timeframes have major viral potential. The dopamine hit is insane; you kick off an elite curiosity loop and give the viewer hope that whatever this is, it’s possible. Found this in almost every major growth story hook.\n\n**POVs = Advice in Disguise**\n\nThe most engaging POV hooks aren’t actually real POVs, but rather advice disguised as scenarios:\n\n\"POV: you figured out how to not pay a fortune for drinks at festivals\"  \n\"POV: You don't feel like cooking, but still want a home-cooked meal\"\n\nThis is kind of genius, cause people’s defenses are down when they think they’re just relating to a scenario, not receiving instruction.\n\n\\-------------------\n\nOverall, there’s a shift away from “guru” hooks toward ones that don’t feel like hooks at all. Everything I’ve collected in 2025 points to the same trend: The best hooks read like genuine human moments someone just happened to articulate perfectly.\n\n\\* All examples are real viral hooks I’ve collected and used for AI training\n\n(Edit: I've been asked multiple times, so the tool's name is Captain Hook AI)\n\nI have plenty more, let me know if part 2 would be of interest :)\n\n\\- Shani",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 386,
    "downs": 0,
    "created_utc": 1758121987.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.82,
    "category_rationale": "Explains viral-hook patterns and mental-model-like insights.",
    "composite_score": 4.316774891818761
  },
  {
    "score": 250,
    "title": "Monthly Self Promotion/Advertisement Thread for Social Media Marketers",
    "selftext": "Hello, /r/socialmediamarketing Community!\n\nWelcome to our **Monthly Advertisement and Self Promotion Thread!** This is your space to offer your services if you're a social media marketer. Whether you're offering services or showcasing your portfolio, feel free to share what you've got to offer to potential clients and those in need of your services.\n\n**Posting Guidelines:**\n\n* Briefly describe your services or skills.\n* Include any relevant experience or credentials.\n* Keep it concise and professional.\n* Please adhere to the subreddit's general rules.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 250,
    "downs": 0,
    "created_utc": 1709308885.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Announcement/guidelines for a self-promotion thread, not instructional.",
    "composite_score": 3.9278249718646814
  },
  {
    "score": 249,
    "title": "From “blocked by a top creator” to a working X growth system",
    "selftext": "**TL;DR** I tried to grow on X by being a reply guy, got flagged as “AI” and blocked by a big account, then rebuilt my process to sound human, be useful, and compound attention. This is the exact system I use now. No hype. No pitch. Steal it.\n\n(Read time \\~ 8 minutes)\n\n# Context and the punch in the face\n\nI am launching multiple projects this year. One shipped fast, but a social style product needs distribution. X turned out to be the best place to find users and get feedback.\n\nI went all in on replies. It worked at first. Then a top creator publicly blocked me because a tool rated my reply “likely AI.” That stung. It also forced me to fix my voice and my process. I kept what worked and killed what felt fake.\n\n# What actually moves the needle on X\n\n* **Replies beat original posts at the start.** Early replies under big accounts put you in front of more people, faster.\n* **Volume matters, but quality controls survival.** 20 to 30 replies per day is fine. Weak replies get you muted.\n* **You need a spine of original posts.** Aim for 3 to 5 of your own tweets daily. Talk about what you are building, problems you are solving, and small wins.\n* **Speed to comment is leverage.** Sort by Latest in the right communities and reply fast while the first wave of attention is still hot.\n* **Pick your pond.** Build in public, indie makers, SaaS founders, startup. Start there, then branch out to your niche.\n\n# The daily system I use now\n\n**Time budget: 60 to 90 minutes.**\n\n1. **Warm up, 10 minutes** Skim your lists. Like a few posts. Leave one short reply that adds something obvious but useful. Get typing rhythm.\n2. **Reply block, 30 to 45 minutes**\n\n* Open the right communities. Sort by Latest.\n* Hit fresh posts from accounts with reach or momentum.\n* Leave 15 to 20 replies. Short. Specific. Helpful.\n* Goal per reply: teach one thing or remove one doubt.\n\n1. **Your own posts, 10 to 15 minutes** Schedule 3 for the day. One progress update, one tiny lesson, one question that invites answers.\n2. **Follow up, 10 to 15 minutes** Answer people who answered you. This is where followers convert. Treat replies like DMs in public.\n\n# How to write replies that do not get flagged as AI\n\nThese rules came from painful trial and error.\n\n* **Write how you talk.** Short sentences. Everyday words.\n* **Cut fluff words.** Unlock, empower, supercharge, elevate. Delete.\n* **Be specific.** Replace “great advice” with “this line about shipping ugly v1 is gold.”\n* **No em dashes.** Periods and commas only.\n* **Do not mirror the tweet too closely.** Mention one detail, then add new info.\n* **If it is a simple question, answer with one line.** Respect time, yours and theirs.\n* **Admit doubt.** “Not sure about X, but Y worked for me with 3k users.”\n* **One emoji max.** Use it like salt, not soup.\n\n# My personal guardrails that improved results\n\nI literally taped these above my screen.\n\n* If I do not know, I do not pretend.\n* No hashtags in replies.\n* No dashes. No fancy synonyms.\n* Do not try to sound smart. Sound useful.\n* Do not overquote the original tweet. Add value and move on.\n* Make small, human grammar. One short imperfection can help you feel real.\n* When in doubt, say less.\n\n# Templates you can paste and adapt\n\nUse these as starting points, then add one specific detail from the original tweet.\n\n* **Micro-win:** “Did this last week. Result was X. Two tips that saved me time. A) \\_\\_\\_\\_\\_\\_. B) \\_\\_\\_\\_\\_\\_.”\n* **Pushback with care:** “Counterpoint. Tried \\_\\_\\_\\_\\_\\_ with 1k users. It backfired because \\_\\_\\_\\_\\_\\_. What fixed it was \\_\\_\\_\\_\\_\\_.”\n* **Resource without spam:** “Quick pointer. Search for \\_\\_\\_\\_\\_\\_ + \\_\\_\\_\\_\\_\\_. The first two results are solid. Helped me cut setup from 2 hours to 20 minutes.”\n* **Connect dots:** “This pairs well with \\_\\_\\_\\_\\_\\_. If you stack them, you get \\_\\_\\_\\_\\_\\_. Not perfect, but it got me from A to B.”\n* **Clarify request:** “Do you want examples for B2B or consumer? The playbook is different. Happy to share 3 from whichever you need.”\n* **Cheer with substance:** “Love this. One thing to watch when you scale to 10k users is \\_\\_\\_\\_\\_\\_. Caught me off guard.”\n\n# 7 day ramp that builds momentum\n\n**Day 1** Define your three content pillars. Example. Build in public, distribution lessons, tiny tech tips.  \n**Day 2** Build a private list of 50 accounts in your niche. Use it daily.  \n**Day 3** Write 10 reply templates like the ones above. Keep them short.  \n**Day 4** Ship 3 of your own posts and 20 replies. Track which replies get any engagement at all.  \n**Day 5** Double down on what got replies. Kill what got ignored.  \n**Day 6** Post one small thread that teaches one thing you did this week. 5 to 7 lines. No fluff.  \n**Day 7** Audit. Which topics pulled real conversations. Keep those. Cut the rest.\n\nRepeat weekly. The compounding is real.\n\n# Metrics I track and why\n\n* **Replies per day** simple output target.\n* **Reply hit rate** replies that get any engagement divided by total replies. Aim to raise this from 10 percent to 25 percent.\n* **Profile visits per day** tells you if your replies send people home.\n* **Follows per 100 profile visits** sanity check for your bio and pinned post.\n* **Original posts that sparked comments** tells you what to post more of.\n* **Time to first reply on big posts** lower is better.\n\n# What got me blocked and how I fixed it\n\nI leaned on AI writing too hard. The wording was clean and empty. A tool flagged it. A creator blocked me. That sucked. I rebuilt my approach.\n\n* I added a tiny personal input to every reply. One lived experience or number.\n* I wrote a few rules that force my voice. No corporate words, no showy grammar, no dashes, no hashtags, no puff.\n* I built a crude scorer to shame my own replies before posting. You do not need a tool. Read your reply out loud. If it would sound weird in a bar, rewrite.\n\n# Common pitfalls to avoid\n\n* Replying to everything. Spray and pray gets you muted.\n* Echoing the tweet with new words. Adds nothing.\n* Selling in replies. It burns trust.\n* Debating for sport. You are not in school. You are building a business.\n* Quoting big accounts with zero context. Dead on arrival.\n\n# Monetization reality check\n\nAt around 10k followers, one focused hour per day can bring meaningful income from ads or small offers. Not millions. Enough to matter. Focus on serving a specific crowd and the rest follows.\n\n# Final notes\n\nI did build a small Chrome extension for myself to speed up replies with personal inputs but you do not need it to win but it will save you time and save you when you are out of ideas. But more than my extension, you need a system, a voice, and consistency.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 249,
    "downs": 0,
    "created_utc": 1755784743.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.93,
    "category_rationale": "Explicit sequence of daily steps to achieve growth on X.",
    "composite_score": 3.689911684825456
  },
  {
    "score": 202,
    "title": "Generated 30 million views last month on all socials and STILL got scolded by owner’s wife",
    "selftext": "I’m in a horror show position right now, truly awful. I was asked to take over marketing for a 7 figure company owned by a boomer aged couple. They run a right wing e-commerce, and the entire concept and design is incredibly dated. Website from early 2000s, spam looking email, etc.\n\nOn top of the marketing, I was asked to take over all social media since I had about 9 years experience posting. I accepted with minimal pay increase because we needed someone who knew what to do.\n\nFast forward 2 months, I have every metric up. Facebook account over 100k followers and 25 million views last month, IG at 75k followers and about 6 million views last month. TikTok I created a month ago with just under a million views in the first month. I’m also handling X, YouTube, and redesigning the website, emails, and building an affiliate program.\n\nI have been criticizing the old emails and web design (not in a harsh way, but a serious way as it’s bad) over the past couple weeks. I’ve noticed the owners wife becoming incredibly defensive at these claims saying “our website and emails have always worked” even though I am being tasked with increasing revenue since it’s down.\n\nRecently, the wife blew up at me for a post. Created a group chat and said it “needs to be taken down immediately and doesn’t fit the brand.” I panicked and couldn’t find the post, meanwhile she was posting in the chat that I need to have a meeting about “how to follow our brand guidelines.”\n\nLo and behold, I finally found the post on Facebook dated 8 months before I started. I informed her it was an old paid ad from the previous company and that I was never given access to the ads to take it down.\n\nShe then called me with the owner accusing me of “lying about being a social media expert” and that I never paid attention to ads (this specific ad had 72 total views) and that clearly they someone who understands Meta ads.\n\nKeep in mind one week before this I delivered a report showing I single handedly generated 25 million monthly views on Facebook alone which was a 14,000% increase, and every single metric was up between 800%-2000%+. I was shocked, and clearly I may have offended her with my criticism of some dated web elements she may have been a part of. I was berated directly after completely revamping their socials!\n\nGoes to show you that this can very much be a thankless job! And never go above and beyond for those that take you for granted.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 202,
    "downs": 0,
    "created_utc": 1749184477.0,
    "media": null,
    "is_video": false,
    "num_comments": 145,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.66,
    "category_rationale": "Emotional grievance about a conflict with the owner’s wife; venting more than instruction.",
    "composite_score": 4.094672465805432
  },
  {
    "score": 196,
    "title": "$80 a month?! I'm tired of this shit.",
    "selftext": "Just saw *another* job post offering $80/month for social media management. Like... what are we doing here?\n\nYou want strategy, content creation, scheduling, engagement, reports, growth... all that, for the price of a dinner? Be serious.\n\nSocial media isn’t just \"posting stuff.\" You want real results? You want someone to build your brand online, bring in leads, manage your community?\n\n**Then pay a normal f\\*cking price.**\n\nI’m exhausted seeing platforms flooded with people expecting full-service marketing for peanuts. And the worst part? Some freelancers still take these gigs, because they’re desperate or just starting out, which keeps the whole cycle going.\n\nCan we please stop normalizing trash rates? Can we start treating digital work like actual work?",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 196,
    "downs": 0,
    "created_utc": 1752137378.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.88,
    "category_rationale": "Emotional complaint about underpaid freelance social-media work.",
    "composite_score": 3.8960418513534147
  },
  {
    "score": 187,
    "title": "From 100 views to 100k and I’m sharing what worked",
    "selftext": "So I finally figured out why my short-form content was stuck at 200-500 views despite following all the \"best practices.\" Turns out I was making five critical retention mistakes that completely invisible without proper data tracking.\n\n\nMistake #1: The \"fake suspense\" opener. Starting with \"Wait for it...\" or \"You won't believe this\" actually decreases retention by 23% in the first 3 seconds (based on my last 50 videos). What works: ultra-specific, mid-action opens. Instead of \"This workout changed my life,\" try \"I did 100 squats for 30 days and my knees started clicking.\n\n\nMistake #2: The 4-7 second death valley. This is where 60% of viewers bail if you don't give them a \"commitment reason.\" I was doing slow builds - huge mistake. Now I drop the most shocking visual, stat, or statement right at the 5-second mark. Think of it as your \"stay hook\" - different from your scroll-stopper.\n\n\nMistake #3: Deadly pacing patterns. Any pause over 1.2 seconds = immediate drop-off. I learned this by tracking frame-by-frame retention. Your brain thinks \"dramatic pause,\" but viewers' thumbs are already swiping. Cut everything 30% shorter than feels natural.\n\n\nMistake #4: The \"reveal too early\" trap. If you show the end result in the first 10 seconds, retention drops 40%. People think they got what they came for. Always tease the outcome, show the process, THEN reveal. Works every time.\n\n\nMistake #5: No \"rewatch triggers\" Content that gets rewatched gets pushed harder by algorithms. I now intentionally place quick text overlays, fast transitions, or \"blink and you'll miss it\" elements that make people go back. Increased my rewatch rate from 8% to 31%.\n\n\nHere's the thing - I only figured this out because I started obsessively tracking micro-metrics. Not just views and likes, but second-by-second drop-off points, rewatch patterns, exactly which frames caused people to engage vs. scroll away.\n\n\nInstagram and TikTok's native analytics barely scratch the surface. I found this analytics tool that breaks down everything - shows me heat maps of exactly when people drop off, which elements drive rewatches, what pacing patterns work best for my niche, even tracks emotional engagement points.\n\n\nIt's honestly like having x-ray vision for content performance. My last 6 videos averaged 15k views, with one hitting 78k just by following what the data told me.\n\n\nThe tool costs money (like $10/month I think?) but it's paid for itself 10x over in terms of growth and brand deals I've landed from better performing content.\n\n\nIf anyone wants to know what it is, feel free to ask me - happy to share since it literally changed my entire approach to content creation. Not affiliated with them or anything, just genuinely think more creators should know about tools like this.\n\n\nAlso down to share specific examples of before/after retention curves if that would help anyone!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 187,
    "downs": 0,
    "created_utc": 1756656962.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.74,
    "category_rationale": "Enumerated retention mistakes and tips for increasing views.",
    "composite_score": 3.890733474455502
  },
  {
    "score": 180,
    "title": "I’ve been working in social media marketing for 20 years and it’s never been this bad.  This is why 👇",
    "selftext": "We’ve had 10yrs+ of everyone being conditioned by every big guru that VIRAL fixes all the problems.\n\nMore followers DOES NOT MEAN ANYTHING.\n\nBut now we see pretty much every industry, b2b, b2c ANY sector - trying to go viral.\n\nThe editing, the pattern interrupts, the psychology plays, the engagement groups…\n\nAll of that never went away.\n\nNever got policed and now it’s just me telling everyone I can it’s not about the views - it’s about converting attention to sales.\n\nAm I alone?  Is anyone else trying to get this message across too or is it just they don’t listen anymore? ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 180,
    "downs": 0,
    "created_utc": 1760352167.0,
    "media": null,
    "is_video": false,
    "num_comments": 71,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Opinionated critique of guru culture and viral strategy; venting.",
    "composite_score": 3.883844823084819
  },
  {
    "score": 173,
    "title": "Meta Business Suite is an abomination",
    "selftext": "I've been managing social media accounts for a decade and I’m not exaggerating when I say Meta Business Suite is the worst platform I’ve ever used (SM management or otherwise). Truly. It is an absolute disaster of a tool, and every time I open it, I wonder if anyone at Meta has actually used this thing in a real-world workflow.\n\nJust spent 30 minutes trying to tag four orgs in a basic Facebook + Instagram post. Checked all the handles in a separate tab, copied and pasted the exact names, added and removed the @ multiple times, moved my cursor around, triple-checked the spelling. The selector UI dropdown glitched all over the screen like it was running on a potato. Clicked one profile? It selects another. Sometimes the one I need doesn’t even show up, even though the username is right. Sometimes the whole caption deletes itself for fun when you toggle between FB and IG.\n\nAlso, why can’t you do carousel posts for Facebook? Why is that just… not a thing? Not to sing LinkedIn's praises (because they have their issues), but their content types are far better. Why is the image order randomly scrambled every time, even when you number them pre-upload? Why is the analytics tab so laughably barebones?!\n\nYou're telling me the \"geniuses\" at meta can't build a functioning management platform for their own software?!\n\nI’m forced to use this nightmare because my client won’t pay for proper third-party tools. So here I am, smashing my head against my desk just trying to schedule a post.\n\nIs there a reason it's this bad? Like, genuinely, am I missing something? \n\nI miss Sprout... Hell, I would take Buffer over this.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 173,
    "downs": 0,
    "created_utc": 1742923569.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Frustrated critique of Meta Business Suite with platform-specific complaints.",
    "composite_score": 3.8936392352745433
  },
  {
    "score": 159,
    "title": "I'll host a zoom on how to start an Smma.",
    "selftext": "Over the last few months I've gotten a lot of messages from people asking how I started and run my agency. I'm not one of those gurus making 100k+ a month but I'm comfortable. If I were to host a zoom showing people how to start a marketing agency and make an extra 5 to 8k a month would people be interested? I wouldn't charge for it but if people do decide to start their own I'd just ask they use my affiliate link for the various softwares needed to run things smoothly. This way I can make some money but they don't have to spend money to learn ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 159,
    "downs": 0,
    "created_utc": 1720212756.0,
    "media": null,
    "is_video": false,
    "num_comments": 172,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Proposal to host a webinar about starting an SMMA; no explicit steps or items.",
    "composite_score": 4.035643034220323
  },
  {
    "score": 144,
    "title": "Any cheap SMM panels that actually deliver stable results?",
    "selftext": "Hey folks,\n\nI’ve been trying out a few cheap SMM panels for small TikTok and Instagram campaigns, but most of them have been disappointing including continuous ‘processing’ status, huge drops, no proper refill and poor support.\n\nI’m just looking for something that’s affordable, stable and has good support.\n\nIt feels like every small panel is just reselling from the same main SMM providers anyway, but some seem to perform way better than others. Does anyone know which main provider or panel still gives reliable results?\n\nThank you!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 144,
    "downs": 0,
    "created_utc": 1761652047.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for affordable, stable SMM panels; primarily a request for resources rather than content.",
    "composite_score": 3.976932020074094
  },
  {
    "score": 127,
    "title": "Can't do this anymore.... content creation is taking a toll on me.",
    "selftext": "I feel fucking lost. I need to be real for a minute. I am completely burning out managing content creation (YouTube &amp; Instagram) and could use some genuine advice.\n\nSome context — I started working as a social media manager at a startup 6 months ago. While I love the creative aspect of it and have ideas, I am struggling to translate them into actual engaging content.\n\nBeen doing this for 6 months. The thing that is killing me is not even the workload, it is the mental exhaustion of feeling like I'm making no impact.\n\nWhat’s making me upset:\n\n* Making content on YouTube for 6 months with basically no growth despite posting\n* Constantly second-guessing what my audience actually wants to watch because of no growth.\n* Hard to stick to posting consistently\n* Feeling overwhelmed trying to manage multiple apps and platforms simultaneously (YouTube Studio, Instagram, Docs, Slack, Premier Pro and ChatGPT)\n* Every time I open the analytics I feel sick to my stomach\n\nMy bosses are supportive (for now), but I see the look in their eyes when I show them analytics. They're waiting for results. I keep telling them the next vidwo will do better but honestly idk anymore.\n\nI scroll through other brands' feeds and it's like they know some secret I don't. I know I'm probably not alone in this, but it feels isolating. I see other brands crushing it with their content, while I'm here questioning every post.\n\nI would love to hear some advice. Especially appreciate hearing from people who managed to push through this kind of burnout. Also let me know if there are tools/frameworks that can inspire/help me manage this job properly.\n\nEDIT: Thank you for all the amazing responses already. Really means a lot to know I'm not alone in this. Learned some game-changing frameworks (focus on ONE platform first, value over volume, storytelling over algorithms). \n\nAlso discovered some helpful tools (like Content calendars and Craftroom.ai) for managing the content chaos. Going to stop trying to be everywhere and start making content I actually give a fuck about. Will make you proud, I promise! ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 127,
    "downs": 0,
    "created_utc": 1736617069.0,
    "media": null,
    "is_video": false,
    "num_comments": 55,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Open vent about burnout and emotional strain with a plea for advice.",
    "composite_score": 3.7088039831509687
  },
  {
    "score": 122,
    "title": "What’s the ONE social media tool you wish you had discovered earlier?",
    "selftext": "Hey everyone!  I’m diving deep into social media management and noticed that there are so many tools out there — some save tons of time, others just add more confusion.  \nIf you could pick *one tool* that completely changed the way you handle content, comments, or engagement, what would it be? And why?  \nI think this could help beginners (like me!) avoid wasting time and go straight to what actually works.  \nLooking forward to your suggestions — thanks in advance!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 122,
    "downs": 0,
    "created_utc": 1758829256.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for a single tool recommendation; no actionable steps or system described.",
    "composite_score": 3.7624541314465265
  },
  {
    "score": 118,
    "title": "Is Organic Social Media growth almost dead? ",
    "selftext": "I've been handling social media pages and accounts for a year now and what i've noticed is that even clients with 15K+ followers get very low engagement (around 15-30 likes on static posts, 2-3k plays on reels)\n\nClients with lower following 500-1000 get a very low engagement rate on static posts i.e around 8-10 likes, no comments\n\nHashtags aren't making any difference like they used to do a few years ago.\n\nAm i the only one facing these problems? \n\n",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 118,
    "downs": 0,
    "created_utc": 1718474532.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Discussion about perceived declines in organic growth; lacks explicit guidance or structure.",
    "composite_score": 3.907109260569761
  },
  {
    "score": 111,
    "title": "I'm starting to get sick of this",
    "selftext": "i need some advice or maybe just to vent a little. my client keeps expecting me to post “viral” content every single day. they send me examples from nike, wendy’s, duolingo, all these massive brands, and ask why we’re not getting that kind of engagement.\n\ni’ve tried explaining that those companies became *companies* first and a *social media personality* later. they have years of brand equity, budgets, teams, and a loyal audience. we’re literally a small business with maybe 2k followers and a few hundred likes on a good week.\n\nand it’s not just the content. they expect me to constantly engage with followers, reply to every comment, dm, mention, even during my off hours. i’ll get messages at night like “hey someone commented on our post, can you respond?” like i’m supposed to be on 24/7.\n\nno matter how many times i say it, they just don’t get that not every post can go viral, and that social media growth takes time and consistency, not daily miracles.\n\nhonestly some days i just want to throw away everything i own, move to some quiet mountain village in a random country, and live without wifi for the rest of my life. social media has started to make me feel sick, and i hate that something i used to enjoy now just drains me.\n\nhow do you all deal with clients like this? do you set harder boundaries or just ride it out until the contract is done?",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1759931493.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Frustration with client expectations and boundaries; emotional venting.",
    "composite_score": 3.691882940175565
  },
  {
    "score": 106,
    "title": "Want to delete TikTok from my life but I’m a social media manager",
    "selftext": "Are there any social media managers \nout there struggling and at the point where they feel like they must delete TikTok from their lives for the betterment of their mental health? Emma chamberlain was recently interviewed about why she left TikTok and I agree wholeheartedly with her sentiments. \n\nI think about it everyday. The toxicity that TikTok brings into my life is crippling. When im on the app, I’m being shown what to think, how to do things, how horrible the world is, how bad people are suffering financially, and I just can’t do it anymore. It’s exhausting. Not to mention, I spend so much time on there. But, part of my job duties include managing social median platforms for the company I work for, along with a team of content creators. So I feel like I’m trapped. \n\nI wasn’t even hired as a social media manager. I’m a graphic designer wearing multiple hats. \n\nLooking for advice other than to get a different job.\n\nUPDATE: Wow. I’m blown away by how many responses this got. Thank you to all who have taken the time to give me advice or those who have simply just made me feel like I’m not alone in feeling this way. Wishing everyone peace of mind and happiness. 🫶 ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 106,
    "downs": 0,
    "created_utc": 1705347871.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Personal struggle with mental health due to work; seeks practical advice but mainly venting.",
    "composite_score": 3.607385449502609
  },
  {
    "score": 97,
    "title": "The Easiest and FASTEST way to go Viral (Anyone can do it) ",
    "selftext": "I created a lesson plan that I teach to my somewhat ‘small’ group of 19,000 business owners. \n\nI call it the Viral Video Cheat Code. \n\nBefore reading, I will say my video/content agency has produced over 100,000,000 views for our clients organically and over double that for paid impressions. (TikTok &amp; Meta Ads) \n\nWe work with pages that start from 0 up to established creators that have millions of followers. \n\nI have worked on over 100 accounts and this method I’m about to share has DOMINATED lately. \n\nIt pretty much requires 0 skill and little to no effort, but time and time again, it crushes in the algorithm. \n\n#1 - Reaction content, and not just your normal, Picture in Picture in screen, watching the video and laughing at it, but very similar style to what Ugo Lord (The Social Media Lawyer) does. \n\nPlay an already viral video that is within your niche/industry, and give your take/opinion on it. \n\nThe reason a lot of people don’t get reach is they lose their viewers within the first 3-5 seconds. The data never lies. \n\nThey lack a good hook, and mastering a good hook is a skill. \n\nThese already viral videos are PROVEN to capture attention, so when you pair a viral video and your take on it, you immediately get engagement. People will agree or disagree with you, which in result, pushes the video even further. \n\nLet’s use a plumber for example, they have 0 to little social media and content experience but they want to do content. There are SO many viral videos of TERRIBLE plumbing jobs. The plumber can play a clip of the bad job and come on screen and give a quick take “this is EXACTLY what happens when you hire the cheapest plumber” \n\nAnother example, how many times have you seen someone give horrible financial advice online, some of this stuff is completel garbage. Lets say your an accountant and you see someone giving bad advice. — play the viral video with the bad advice and you come on screen with your take on the facts. (or you can be on screen the whole time watching the video - similar to how Jasmine DiLucci does it)\n\nSimple. Easy. Effective. \n\n#2 - there is a viral video style going around where something will happen like a soccer ball gets kicked towards the screen and then the creator will appear and have the ball miss them and then they go into their take. \n\nSame principle, different format. (Leveraging a viral video as a hook) \n\nThis is working like crazy too. \n\nI’ve tested it out so much and the results are crazy every time. \n\nMinimum 10k views - which could be huge to some people. \n\nPeople will hate on this like they do but irdgaf. I’m gaining my clients thousands of followers and millions of views each week leveraging this strategy. \n\nI made a whole free ebook and some YouTube videos about the Viral Video Cheat Code, I won’t put the links here incase people will think I’m self promoting but if you want to see them, just DM me. \n\nI always get push back from some people when sharing this method, and I get that it’s not a long term strategy for every brand or will work for everyone, but for the majority, it will work, and I didn’t title this thread ‘the best content strategy for long term growth’ for a reason, I’m just stating, this is the EASIEST and FASTEST way to go viral. \n\nTL:DR - Take already viral videos and use them in the beginning of your videos to react or give analysis on ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 97,
    "downs": 0,
    "created_utc": 1724477731.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Describes a concrete, repeatable method to go viral using reaction content and hooks.",
    "composite_score": 3.6630261615734536
  },
  {
    "score": 93,
    "title": "We tested replying to every comment. The results were insane.",
    "selftext": "Most brands focus 100% on what they post… and 0% on what happens after.\n\nWe ran an experiment to see what would happen if we **actively engaged with comments at scale** instead of just letting them sit there. Every comment got a reply, a hide, or a delete.\n\nHere’s what changed:\n\n* **Follower growth:** Up 53%\n* **Reach:** Up 39%\n* **Engagement:** Up 31%\n\nAnd we didn’t post more. We just engaged better.\n\nReplying kept posts in the feed longer, brought people back through notifications, and created more opportunities for engagement loops. But most brands still ignore their comments entirely.\n\nCurious...how do you handle comments? Reply to everything, ignore most, or somewhere in between?",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 93,
    "downs": 0,
    "created_utc": 1742400401.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Shares experimental findings on engagement strategies and their impact.",
    "composite_score": 3.3793391940108015
  },
  {
    "score": 94,
    "title": "Social Media Marketing News you should care about today ",
    "selftext": "\n\n1/ Meta has started testing unskippable video ads on Instagram.\n\n2/ From 5th July, Google will stop indexing sites that don't work on mobile.\n\n3/ LinkedIn expands access to video ads.\n\n4/ TikTok is showing more content you engaged with in the past with labels 'You liked' and 'You Downloaded'.\n\n5/ Threads App launched swipe right on a post to like option.\n\n6/ **Bugs:** ChatGPT was partially down yesterday and Youtube's 'Thumb' icon is disappearing when you like a video.\n\n7/ Youtube expands Community Posts to all users and announces new AI Tools for creators, available in the YT Studio.\n\n8/ Perplexity Pages launched last week are now showing up in Google AI overviews.\n\n9/ Video and Connected TV ads now supported in Microsoft Advertising Editor + Netflix Inventory is available to more CTV advertisers in different regions. (ads/microsoft/com)\n\n10/ Spotify is increasing their subscription prices for second time this year. Max and Peacock are also increasing their prices.\n\n11/ Paramount and Skydance merger is official now.\n\n12/ Instagram launches new broadcast channel features: Go live with members, chat themes, emoji moderation and QR code creation.\n\n***I hope this helps to plan your week ahead. Credit: The Social Juice Newsletter.***",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 94,
    "downs": 0,
    "created_utc": 1717597490.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Digest of multiple news items presented as a numbered list.",
    "composite_score": 3.0942992304806696
  },
  {
    "score": 91,
    "title": "This Viral Video Strategy is Working Like CRAZY",
    "selftext": "This is WILD... People may hate but I have to share this... I tested this new strategy for the past month, doing a mix of green screen/reaction/commentary or explainer content, and discovered a CHEAT CODE to going Viral.... literally 🤯\n\nMost people struggle to go Viral online and I have done content in the past that straight FLOPS, but this time EVERY SINGLE VIDEO was hitting on all platforms.\n\nI got over 4,000,000 views on YT, gained over 5,000 subscribers, 500K+ IG Views, 1,000,000+ FB Reel Views and its still going... \n\nNow if you have seen Ugo Lord (The 'Modern Age Attorney' with over 1.6M subs on YT) he sort of uses this strategy, he will play a viral or controversial clip and then position himself after as the Expert giving advice or his opinion on the topic. There is another woman named Jasmine DiLucci (Tax Attorney/Professional with 100K + Followers on IG &amp; 80k+ Subs on YouTube) who is doing a similar strategy, playing a viral or controversial video within her niche and giving an expert opinion/advice afterward. \n\nAll of their videos are hitting the algo's like crazy and so many people could be adopting this strategy for themselves or their clients.\n\nFor example, imagine you have a plumber as a client, normally their content would be boring and no one would ever watch past the first 3-5, maybeee 7 seconds. But imagine if you took a Viral Plumbing fail - like a super bad plumbing job or set up (like a basement flooding due to an inexperienced plumber) and then a plumber gave his reaction to \"This is why you don't hire the cheapest job\" kind of commentary. Simple short and sweet. That video would probably do 10K-100K+ views on Socials and appeal to a mass audience. Now do this time and time again with other plumbing fails and I can almost guarantee they would gain MASSIVE followers and views. Pair that with running some lead gen ads and now you have a swarm of organic content hitting the algos and when leads click on their profile from the ads to social verify, they would see viral videos, increasing the likelihood of doing business with them...\n\nNow I know this post is long-winded but its because I really believe so many people could use this to their advantage across many different niches...\n\nLet me know what you guys think, would this or would this not work for you and/or your clients?\n\n\\*\\*Oh yeah I also tested this out for one of my clients already who has 100K+ TikTok followers and we have REALLY bad views for the past 90 days (went from doing 2-10K average to 200-1000 views max average and literally had the viral video cheat code do 367k views on her TikTok - see YouTube video where I show screenshots)",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 91,
    "downs": 0,
    "created_utc": 1718936806.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Explains a viral strategy and the reasoning behind it.",
    "composite_score": 3.478022055135349
  },
  {
    "score": 89,
    "title": "These creative strategist tools finally got me out of my disorganized nightmare",
    "selftext": "I’m here to save y'all from the hellhole I was in. I’ve been doing creative strategy for 3 years and finally stopped relying on my brain to remember where I saved things. My so called \"system\" before was pure chaos, stuff scattered across 4 different apps with no rhyme or reason.\n\nI tried notion as many people recommended it, but keeping it updated was a second job and the breaking point was prepping a competitor deck and spending all night trying to find where I'd saved everything. Found maybe half, the rest were dead facebook links.\n\nBut I finally gave up on notion and started using an actual ad library a few months back which took me a minute to get used to but at least I'm not hunting through dead links anymore, still not sure I'm using it right tbh but it's less chaotic than before… So my advice: find a good tool instead of trying to do everything yourself! Believe me, it is worth it.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 89,
    "downs": 0,
    "created_utc": 1765211882.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Describes the reasoning for using a tool system to reduce chaos.",
    "composite_score": 3.3361193099157394
  },
  {
    "score": 92,
    "title": "This hack is now of the most powerful I know to get unlimited leads",
    "selftext": "Here’s a simple and effective method to extract followers from any LinkedIn company page and turn them into leads\n\nI tested it yesterday and pulled over 75,000 profiles, results were solid.\n\nHere’s how it works :\n\nStep 1: Start a free trial of Sales Navigator  \nStep 2: Add a job title on your profile like “Intern” at the company you want to target  \nStep 3: In Sales Navigator, use the filter “People following my company”, this becomes available since LinkedIn thinks you’re part of that company  \nStep 4: Export the list, enrich the data (email, role, etc), and use it in your outreach  \nStep 5: Remove the intern job, pick another company, repeat the process\n\nSuper useful to build targeted lists from pages that already gather your ideal audience\n\nCheers !",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 92,
    "downs": 0,
    "created_utc": 1760081278.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.93,
    "category_rationale": "Provides explicit, sequenced steps to generate leads from LinkedIn.",
    "composite_score": 3.3867224070750623
  },
  {
    "score": 86,
    "title": "Is social media marketing still effective in 2025? What factors are driving results today?",
    "selftext": "I'm curious to hear from professionals and practitioners in the field-do you still find social media marketing to be a worthwhile investment in 2025?\n\nIf yes, what strategies or platforms are delivering real value?\n\nAre there specific factors, like content style, audience targeting, or platform algorithms, that you believe are making the biggest difference now?\n\nNot looking to promote anything or sell services, just genuinely interested in learning how others are adapting their approach and what’s working in today’s landscape. \n\nWould love to hear your thoughts or real-world experiences.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 86,
    "downs": 0,
    "created_utc": 1754306594.0,
    "media": null,
    "is_video": false,
    "num_comments": 118,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "A discussion prompt asking if social media still works and what factors matter.",
    "composite_score": 3.7272927333148838
  },
  {
    "score": 88,
    "title": "How do you come up with creative design ideas for social media posts?",
    "selftext": "\nI mainly focus on marketing strategy, so when it comes to designing graphics for social, I get stuck pretty often. I’m open to learning and improving, but honestly, I hit creative blocks all the time and it gets really frustrating. People keep telling me to “simplify,” but that’s easier said than done.\n\nAny tips or methods for coming up with design ideas? I use Canva (just basic, nothing advanced) and would love advice on how to get better at this.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 88,
    "downs": 0,
    "created_utc": 1751658086.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Primarily a request for design-idea tips rather than a concept or steps.",
    "composite_score": 3.6160514367051406
  },
  {
    "score": 85,
    "title": "Spent $100m in the last 3 years - just some useful tips!",
    "selftext": "**Context**\n\nI'm the Director of Performance at a mid-size performance &amp; creative agency based in London. We're currently running across 30-40 accounts. I work across both Meta &amp; Google directly (Our team is small but mighty!), with SC, Pinterest, Bing etc sprinkled in. We work with the likes of large, £200k a week spends to £1k. I also personally have a lot of experience in B2B also.\n\n**General Advice I think can make a difference**\n\n1. **Paid Advertising Alone Won’t Save Your Business**\n   * **Why Paid is Limited:**\n      * Paid advertising thrives at the bottom of the funnel, targeting people who are already familiar with your brand or actively searching for your product. Its shit for stable new customer acquisition.\n      * Relying solely on paid ads will cap your growth—paid works best as a stable support structure, not the foundation.\n   * **What Really Drives Growth:**\n      * Focus on building **brand awareness** through organic efforts and creative outreach. The founders going out and doing the ground work are what allows us to scale businesses more rapdily, paid growth is incremental and painful.\n      * This applies to businesses of all sizes—from startups spending £1,000 per week to major retailers like Holland &amp; Barrett.\n2. **Evaluate Every Step of the User Journey**\n   * **Understand Where Conversions Drop:**\n      * Many founders &amp; businesses overlook the importance of optimising the entire funnel. If in-platform CPA spikes, they're sitting ducks.\n      * It’s not just about driving traffic; it’s about what happens after users land on your site, the checkout, the repurchasing.\n   * **Key Areas to Review:**\n      * Conversion rates: Are website visitors turning into customers?\n      * Traffic flow: Where are users dropping off in the journey?\n   * **The Real Difference Makers:**\n      * While paid ads (e.g., Meta) can lower CPA by 20–40%, the **big wins** come from CRO (Conversion Rate Optimisation) and CRM (Customer Relationship Management) after for sustainable business growth.\n\n# Platform Notes\n\n# Meta Advertising Structures\n\n1. **Campaign Structures That Work**\n   * Bottom-of-Funnel (BoF):\n      * Allocate \\~10% of your total budget.\n      * Target conversions and optimise for lower-funnel activity.\n   * Top-of-Funnel (ToF):\n      * Use the remaining budget, but still optimise for conversions (not awareness).\n      * Apply an Advantage+ Shopping Campaign (ASC) targeted toward bottom-line conversions.\n   * Pure Top-of-Funnel Awareness Campaigns:\n      * Only viable if you’re spending significant sums and can let them run long-term.\n2. **The Organic Effect**\n   * What is it?\n      * The organic effect is the correlation between your Meta ad spend and organic or direct traffic not tracked by Meta.\n      * Meta’s attribution is unreliable—monitor blended CPA instead of in-platform CPA.\n   * Key Takeaway:\n      * Look at the overall business impact (e.g., total sales, organic traffic, and blended CPA) rather than just Meta’s reported metrics. *They lie a lot.*\n3. **Campaign Types: ASC vs. CBO/ABO**\n   * Advantage+ Shopping Campaigns (ASC):\n      * Highly effective \\~70–80% of the time.\n   * CBO (Campaign Budget Optimization) and ABO (Ad Set Budget Optimization):\n      * Consider only for larger budgets (e.g., £100k/week or more).\n4. Attribution\n   * 7 day Click\n      * Currently find this to be a winner more foten than not, but it's a painful transtion.\n      * From what we can tell, 1 day view takes in any impression from the user to attribute a sale, which is a tad BS.\n\n# Google\n\n* **Brand Search &amp; Shopping:**\n   * Allocate 5–10% of the budget.\n   * Use high target CPA/ROAS for brand shopping. The algo will naturlaly gravitate to your brand terms (Y*ou can't target brand terms in shoppping for those that are new!*)\n* **Performance Max (PMAX):**\n   * Exclude brand traffic for better new customer prospecting.\n   * Use lower target ROAS for scaling.\n* **Non-Brand Search:**\n   * Foundational but challenging and expensive to optimise.\n   * Requires a significant budget for effective testing.\n* **Campaign Structures:**\n   * Single product: 2–3 campaigns max.\n   * Multiple products: Use product-split PMAX campaigns, not sure why people don't do this more often.\n\nFeel free to AMA below, the info above should be generally useful for most businesses.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1736682823.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Contains enumerated tips organized as numbered points.",
    "composite_score": 3.218970127396986
  },
  {
    "score": 82,
    "title": "A client doesn’t like that our reels went viral “too fast”",
    "selftext": "We have been posting reels for a client on TikTok for 2.5 months. After such time I noticed a pattern that when we or they posted from Friday to Monday, their reels did better. We did a reel on this schedule and then got 10k views. We reported it to the client and they said “those numbers are insignificant. We are working towards higher numbers.” Specifically this came from their “social media expert” who has been posting low quality reels that average 700-1500 views. When we were hired, the client said we would be working alongside that person so they could prepare the performance. This “insignificant numbers” comment seemed to come from that person, who had one or two reels with 20k views. Very low quality content with ugly captions in times new roman font with no creative input; only old stock footage.\n\nSo we continued to make reels with similar posting schedule and higher quality b roll , posting in that period, and then 3 reels then went to 42k views, 60k views and 88k views. The client got 1600 followers and tons of comments and DMs.\n\nThe client then accused us of using “TikFame” which we had never even heard of, and said the growth was too fast to be “organic.” This social media person went out of their way to compile a packet of screenshots of 300 accounts to “prove” they were fake followers. But our team reviewed them and do not see they are fake.\n\nI have done social media for an influencer with 4 million followers and another with 10 million. I have no need to fake our work. At this point we are concerned this person is jealous or worse, sabotaging our progress and we are considering dropping the client.\n\nCan anyone recommend tools to accurately analyze followers to see if they are bots or somehow fake? This is beyond frustrating and the clients wants to remove the followers because “they are trying to grow a sincere following.”\n\n",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 82,
    "downs": 0,
    "created_utc": 1721090418.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.77,
    "category_rationale": "Emotional grievance about a client and viral growth ethics.",
    "composite_score": 3.3983350623150175
  },
  {
    "score": 85,
    "title": "I'm a Social Media Strategist &amp; Content Producer – AMA and Free Advice",
    "selftext": "For over 10 years I've developed social media strategy and produced content for brands like Redbull, Wix, National Geographic, and several big music artists and content creators on YouTube, Instagram, and TikTok. I've also helped several startups and small businesses grow organically on social media from scratch, all organic, no paid ads.\n\nI attribute a lot of my early success to those willing to give advice on Reddit and YouTube. So I like to pay it forward by giving free social media advice, and give out the information and knowledge I wish I had in the beginning.\n\nIf you don't know where to start, you're feeling stuck, or you want a second opinion on your strategy or content, please don't hesitate to leave a comment! I'm happy to help.\n\nP.S. You can also see more advice I've given on other threads in my comment history!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1767048879.0,
    "media": null,
    "is_video": false,
    "num_comments": 126,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Announcement/AMA invitation with no substantive content to classify.",
    "composite_score": 3.721400311721546
  },
  {
    "score": 80,
    "title": "What’s the most underrated Social Media tactic you’ve used that actually worked?",
    "selftext": "We often hear about the “big” strategies, viral videos, influencer partnerships, and paid ads - but sometimes, it’s the smaller, overlooked tactics that end up delivering surprising results.\n\nFor example, I once focused entirely on optimizing the first 3 seconds of Stories content and saw engagement jump without increasing budget or posting frequency.\n\nCurious, what’s your most unexpected win in social media marketing that others rarely talk about? It could be a post format, timing trick, or even a platform feature most people ignore.\n\nLet’s share ideas that the algorithms don’t usually push into case studies.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 80,
    "downs": 0,
    "created_utc": 1754904616.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asks for underrated tactics; prompts discussion rather than presenting content.",
    "composite_score": 3.628244645187959
  },
  {
    "score": 80,
    "title": "I like data, so I went through 10,114 TikTok videos to do an analysis of them.  Here's what I found out.",
    "selftext": "I wanted to answer a simple question:\n**What creative patterns actually show up again and again in high-performing short-form?**\n\nThis is from a blog post on my site, but I will just copy the text here rather than link to the site.\n\nThis post shares anonymized, aggregated insights from that dataset. It’s directional, not gospel. \n\n---\n\n## TL;DR (Yes some of these you will know, some maybe not)\n\n* **Hooks win or lose the video**: open with *problem-first*, *contrarian*, or *micro-proof* to lift hold rates.\n* **Speed matters**: a visible change in the first **0:02–0:03** correlates with stronger retention.\n* **On-screen text is underrated**: captions + VO consistently outperform VO-only in info-heavy niches.\n* **Clarity beats clever**: straightforward claims (“I spent $24 on this and…”) outperform vague “you won’t believe…” teases.\n* **Show the outcome early**: an early glimpse of the payoff (before/after, result, end-state) outperforms delayed reveals.\n* **CTAs work best when native**: “save this,” “link in bio for the exact kit,” or “comment ‘recipe’ for details” beat hard sells.\n\nWhat annoys me about this list is that it all seems like \"common sense\" but my reality is difference and I need to do a better job of executing on how I should do it rather than just wing it most of the time due to time constraints.\n\n---\n\n## About the dataset (what I analyzed)\n\n* **10,000+ TikTok videos** across consumer niches (beauty, wellness, home, creators/AI/tools, fashion).\n* Mix of UGC, brand, and creator content.\n* I extracted **transcripts**, **visual beats**, **on-screen text**, and **structural cues** (first cut timing, CTA presence, etc.).\n* I then grouped patterns and compared them against engagement proxies (saves, comments, shares, completion signals where available).  In this case I would single out certain videos and target the stats.\n\nI'm not going to lie, this wasn't a straightforward task.  I have built an online video platform that ingests thousands of saved videos across TikTok/Reels/Youtube and analyzes them.  But I still had to pour through the analysis with the help of AI of course to pull out interesting data from some extensive searches.  At first, I didn't know what I was looking for but then it started to make sense as I saw patterns.  I won't bore you with the details, so let's get to the meat!\n\n---\n\n## 1) Hooks: what grabs attention in the first 3 seconds\n\n**Top recurring hook styles:**\n\n1. **Problem-first:** “My skin hates winter. Here’s what fixed it.”\n2. **Contrarian take:** “Stop double-cleansing—do this instead.”\n3. **Micro-proof:** “I used this for 7 days—look at day 7.”\n4. **Confession/relief:** “I wasted $300 on serums until…”\n5. **Price reveal early:** “This is $14 and beats the $60 one.”\n\n---\n\n## 2) Structure &amp; pacing: how winning videos “move”\n\n**Patterns that correlated with better hold rates:**\n\n* **Visual change by 0:02–0:03** (cut, zoom, or B-roll swap).\n* **On-screen text in frame 1** (keyword/benefit).\n* **Beat map:** hook → micro-proof → how-to or steps → soft CTA.\n\n**Test this simple beat map**\n\n1. Hook (problem/contrarian) – **0:00–0:02**\n2. Micro-proof (result/clip) – **0:02–0:04**\n3. Steps/“how” – **0:04–0:15**\n4. CTA (save/comment/learn more) – **last 2s**\n\n---\n\n## 3) Format choices: what to shoot for different goals\n\n* **Testimonial + price reveal** → strong for **conversion** clips.\n* **Routine/step-by-step** → strong for **consideration** (saves).\n* **Reaction/duet** → strong for **awareness** (comments/shares).\n* **Before/after** → strong across **beauty/home DIY/fitness**.\n\n---\n\n## 4) Voice, text &amp; audio: make it legible and fast\n\n* **VO + on-screen captions** beat VO-only in instructional niches.\n* **Keyword-first text** (“Acne routine for dry skin”) outperforms vague titles.\n* **Music** is a supporting actor; clarity of *message* drives performance.\n\n**Checklist**\n\n* Add **on-screen text** in the first frame.\n* If VO is dense, keep captions on.\n* Prioritize **clean audio** over trendy tracks.\n\n---\n\n## 5) The CTA: small asks &gt; big asks\n\n* Native actions win: “save this,” “comment ‘template’,” “DM me ‘hook’.”\n* For product clips, CTAs that point to **exact items or recipes** reduce friction.\n* Early micro-CTA (“watch the end for the side-by-side”) helps retention.\n\n---\n\n## 6) Niches &amp; nuances (directional patterns)\n\n* **Skincare/beauty:** proof visuals + captions; early result glimpse.\n* **Home/DIY:** materials on-screen + step labels; fast cuts.\n* **Fitness:** timer overlays + rep counts; avoid meandering VO.\n* **SaaS/AI/tools:** screen recordings with **large text** and **cursor highlights**; promise → demo → recap.\n\n---\n\n## A repeatable test plan (use this next week for your clients!)\n\n1. Pick 1 concept.\n2. Shoot **3 hook styles** (problem, contrarian, proof).\n3. Make **2 structure variants** (early result vs. delayed result).\n4. Add **on-screen text** to both; keep VO the same.\n5. Ship 4–6 total variants.\n6. Measure **hold to 3s**, **saves**, **comments**.\n7. Keep the winning hook + structure; rotate topics.\n\nThe algorithm isn’t random, it rewards clarity, speed, and proof. In the case of TikTok, it gives points of varying values based on forwards, saves, comments, likes, etc.  I just thought it was interesting to see if I could validate the findings.\n",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 80,
    "downs": 0,
    "created_utc": 1754728220.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.79,
    "category_rationale": "Shares data-driven insights and patterns from analysis.",
    "composite_score": 3.4141362692622934
  },
  {
    "score": 79,
    "title": "Liquid Death is going viral on LinkedIn but not for one of their ads",
    "selftext": "A friend of mine recently sent me a snippet of a recap of a talk from Andy Pearson, the VP of Creative at Liquid Death. I guess its getting sent around to a bunch of social media marketers. I read through it and decided to watch the whole talk, and man, this was some good stuff. He broke down what they are doing, how they are doing it, and why they are doing it. \n\nHere are some of my key takeaways from the talk.\n\n**Embrace Worst Practices**: Sometimes, the most unconventional ideas can lead to the most significant breakthroughs. Their success stems from its willingness to challenge norms and embrace what others might consider \"stupid.\"\n\n* “If we can entertain ideas that are truly and genuinely dumb. You're starting from a place that no one has bothered to start from before. You're starting from somewhere that is so stupid. You would never consider it, but we start there with a lot of stuff we do.”\n\n**Make Entertainment, Not Marketing**: Focus on creating engaging and entertaining content that resonates with audiences rather than traditional marketing tactics that may be ignored.\n\n* “ We don't want to make marketing. The world doesn't need more marketing. The world needs more laughs. That's sort of the filter we always put over work, is can we bring real joy to people? Can we make them laugh? Can we bring something they didn't expect?”\n\n**Have Fun**: Infusing fun into the creative process not only enhances the work environment but also fosters a connection with consumers who appreciate the joy and humor in marketing.\n\n* \"If we have fun, if we can bring fun into what we do, and if we all agree that that is something that we all want more of in the world, how much better would everything be?\"\n\n**Challenge Conventional Wisdom**: Don't be afraid to question established practices in your industry. There may be better ways to approach problems that have yet to be explored.\n\n* “It's very funny to me because a lot of people are like, you're crazy to call something liquid death and put it in this can, right? I would argue, you'd be crazy to enter a category and look exactly like everything else in that category, right?”\n\nAlso one of my favorite quotes -  “Design is used for marketing and marketing sucks. So, design doesn't suck per se, but it's used for something that sucks. So, that kind of sucks too.”\n\n",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1734126537.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Curated set of marketing takeaways presented as distinct items.",
    "composite_score": 3.331271869071437
  },
  {
    "score": 76,
    "title": "$1000/month for social media in 2025?",
    "selftext": "hey. few months ago my partner and i started a very small social media agency who help ‘small/new’ businesses grow on social media.\n\nwe provide tailored strategies to each business that we sign up and so far we’ve had excellent results. organic and paid both. clientele is mostly clothing, food, real estate, e-commerce. \n\nwe charge a minimum of $1000 as our fee. a lot of people have told us that we’re charging kind of low for what we’re providing. a client said another agency did the exact same work that we’re doing and charged them 2k/month?\n\nmy question is: is $1k/month making us look unprofessional? or beginners? is it working against our idea? (should we start charging more in 2025?)\n\n(we do 15 posts/reels/tiktoks, fb ads (proven strategies), content strategy, growth strategy, copywriting and in some cases have also looked after websites for just a couple more hundreds) \n\nthe whole idea about not charging more than $1k was to provide local/small businesses some really good work and then grow with them. while the bigger agencies provide a lot less in this cost, we provide more to make ourselves stand out.\n\nTIA. good day! ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1730156968.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Mostly a pricing/positioning question with descriptive context rather than a clear model or steps.",
    "composite_score": 3.5757332346118065
  },
  {
    "score": 79,
    "title": "Facebook ads are dead. ",
    "selftext": "I used to consider myself a good digital marketer. However, my ads are flooded with bot activity. Tracking tools are showing completely different numbers to “links clicked” etc. \n\nThe ratio of actually a real human clicking most be about 10% at this point. \n\nAnd yes, before you roast me! I’ve had a really bad run!! \n\nIs there anybody out there who has a winning formula these days! I’ve just scanned r/facebookads - everybody seem to be having the same issue.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1725830633.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.77,
    "category_rationale": "Emotional vent about bot issues and seeking advice.",
    "composite_score": 3.5010274148281892
  },
  {
    "score": 77,
    "title": "Free TikTok advice from an expert",
    "selftext": "im James, founder and CEO of dailydropmedia, a TikTok Marketing agency. I don't want to be lie and say that im doing this just to help you, i am doing this so we can hopefully find more clients for us and to prove our expertise. However, we won't charge you money unless you want ***us*** to promote your product, so the advice is free\n\nif you need help with TikTok, ask ahead, if you think we know what we are doing then you can ask us to help you.\n\nI can help you create content styles, check out your account and tell you what you are doing wrong, and if you are starting from scratch and you have doubts i can help with that too.\n\nAsk your questions people!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1759302585.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Offers free expert TikTok advice and guidance.",
    "composite_score": 3.4482914826019644
  },
  {
    "score": 76,
    "title": "Anyone else feeling so burnt out",
    "selftext": "And I don't mean being underpaid/overworked (although that is perfectly valid reason to feel burnt out.) I mean truly existentially sick and tired of social media. The constant opinions on TikTok from 14 year olds, the filming and exploitation of strangers for engagement, the constant negativity (as trite as that sounds) I genuinely can't take it anymore. I tried taking a break for a week (hard when it's your job) and upon returning I am twice as disgusted. \n\nPerhaps this is just a product of getting older. I'm 26 and have seen the way social media has evolved over the past 20 years, and it's really boiled down to every other post you see being an ad in some (often insidious) way. Ironic given my line of work. IDK! Anyone else feel like this? ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1744984087.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Emotional burnout rant about social media.",
    "composite_score": 3.3129607295085006
  },
  {
    "score": 75,
    "title": "I grow 300k followers in 10 months on Instagram - AMA",
    "selftext": "Last year I started growing an IG theme page in the travel niche about a popular city in Europe. After 10 months in May I hit 100k followers and now its at 160k. With the same strategy I launched a new accounts in April for another city and its at 85k right now. Also one for a client thats at 13k at the moment.\n\nI use freebie travel guides to get leads integrated with manychat. With all the 3 pages I get around 150 organic leads daily. Plus, after they message for the free guide I upsell them with paid services and give them more value through emails where I share affiliate links.\n\nRecently began collaborating with restaurants, activities and travel apps in the cities to build them a social presence for a monthly retainer fee and also some on commission.\n\nFeel free to ask any questions you might have! I want to be valuable :)",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 75,
    "downs": 0,
    "created_utc": 1736342387.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Shares personal growth results and strategies, offering insights.",
    "composite_score": 3.447951527081186
  },
  {
    "score": 73,
    "title": "Grew a brand from 3K → 39K followers… but my client says it’s not converting 😩",
    "selftext": "Hey everyone,\nI could use some outside perspective from fellow social media managers.\n\nI’ve been managing the Instagram for a niche e-commerce brand for two years now. When I started, the page had about 3.5K followers — today it’s nearly 39K, all organic.\n\nThe numbers are great:\n\t•\t9.6% engagement rate by reach (2025)\n\t•\tConsistent saves, shares, and link clicks\n\t•\tLots of comments and cultural conversations\n\t•\tFollowers that actually care about the brand and products\n\nMy main goal for the first two years was brand awareness and community building, and I feel like I really nailed that. But now that we’ve grown the audience, my client (the CEO) says the account “isn’t converting.” Sales directly from social are low, even though there’s clear purchase intent.\n\nHe’s suggesting:\n\t•\tSwitching to an Instagram Shop account\n\t•\tIncreasing influencer collaborations each quarter\n\t•\tPossibly adding ManyChat or automations for DMs\n\nI’m open to exploring those, but I’m hesitant about converting to a shop account — I’ve heard it can restrict certain types of content or features, and our top-performing posts are emotional, cultural, and educational storytelling, not hard-sell content.\n\nSo for those of you managing social for e-commerce or niche cultural brands:\n👉 How do you bridge the gap between engagement and sales?\n👉 Is switching to a Shop account worth it in 2025?\n👉 Would you focus on influencers, chat automation, or a retargeting funnel first?\n\nWould really appreciate any advice or real-world experience you can share 🙏",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1762931375.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Open request for external advice; content is mostly questions with context.",
    "composite_score": 3.526762351426826
  },
  {
    "score": 73,
    "title": "How I grew from 200 to 20000 views per video — here’s what finally clicked",
    "selftext": "I was stuck at around 200 views per video for months despite trying all the usual tips — hashtags, posting times, trends. Then I shifted my focus to **viewer retention** and it changed everything.\n\nHere’s what helped me finally break through:\n\n1. **Start with impact, not mystery.** Forget vague “wait for it” intros. Lead with a clear, specific hook that tells viewers exactly what to expect.\n2. **Hit the “golden seconds.”** Most people decide to keep watching or scroll away between seconds 4 and 7. Drop your best line or visual right there to hold their attention.\n3. **Speed up your edits.** Long pauses or slow cuts make people swipe. Tighten your pacing so there’s never a dull moment.\n4. **Tease, don’t reveal.** If you show the full ending too early, viewers lose interest. Build suspense by teasing the result, then reveal it near the end.\n5. **Encourage rewatches.** Add subtle details or quick text that make people want to watch again — it’s great for the algorithm.\n\nI tracked all this by looking at retention graphs and heatmaps. If you’re curious about how to analyze your own videos, feel free to ask!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1754901365.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Provides a concrete, sequential framework to boost video views.",
    "composite_score": 3.089231719730976
  },
  {
    "score": 72,
    "title": "i quit the brand but here is some free sauce",
    "selftext": "{Yes revised with Gpt for clear wording} hi i used to run meta ads for clothing brand doing under $20K not there anymore (management sucked ) but wanted to share what actually worked for us\n\nsimple setup- one campaign, one ad set, broad interest like t-shirts if that’s what we sold, No crazy lookalikes or exclusions.\n\nonly 2 main creatives most of the time.\n\nwinning offer: “free gift with your first order” outperformed discounts, bundles, and BOGO. felt like a bonus, not a sale.\n\nbest creatives: clean, high-quality photos from real shoots Not overproduced just well-lit and composed. Way better than UGC or graphic-heavy stuff.\n\none strong creative with a clear offer beat 10 average ones every time.\n\nhope this helps someone- just showing what helped us, happy to answer any questions.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1750524334.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.72,
    "category_rationale": "Gives practical, sequential campaign setup recommendations.",
    "composite_score": 3.0304441148401184
  },
  {
    "score": 69,
    "title": "I analyzed 1000+ viral hooks and found some patterns not enough people talk about (Pt. 2)",
    "selftext": "Back at it again! If you don't remember me, I collected 1000+ viral hooks to train an AI and ended up going down a rabbit hole on what makes content perform. You loved part 1, so here's part 2 with more patterns that don't get enough attention imo (and are extremely relevant in 2025).\n\n(P.S. My background is in neuroscience, and seeing these principles manifest in content has been fascinating. Happy to geek out if you're into this stuff)\n\n**Weaponized self-awareness**\n\nThe new vulnerability looks like this:\n\n\"Being sensitive is so embarrassing like how am I supposed to tell you I'm upset because your energy felt off\"\n\n\"My biggest red flag is feeling like I can't date anyone until I become the woman of my dreams and have everything figured out\"\n\nThis is precision oversharing. We're wired for emotion &amp; gossip (don't hate the player, hate the game). But when it hits this precisely, you don't just stop scrolling, you stick around. Those who can't relate stay for the novelty. Those who can stay because it feels almost forbidden to articulate online.\n\n**The insider secret hook**\n\n15% of mega-viral hooks implied secret/insider knowledge:\n\n\"I'm not allowed to share this but my HR friend revealed...\"\n\n\"I just discovered one of the biggest secrets that the system doesn't want us to know about modern-day psychology and therapy\"\n\nYour brain treats secrets like emergency survival info. We literally cannot scroll past something that might be forbidden knowledge. It's evolutionary - the tribe member who knew the secrets survived longer.\n\n**Anti-hooks are the new hooks**\n\nThe best hooks now openly admit they suck, almost trying to un-hook you:\n\n\"A terribly long video that might change everything for you\"\n\n\"5 reasons that make me wildly unsuccessful on Instagram... and I am ok with it\"\n\nIn a room crowded with people offering quick wins &amp; overnight transformations, the opposite hits different. Talk about a pattern interrupt! It's like the law of attraction - by trying to 'repel' people who might not fit your video, you don't just ensure the right people stick around, you ironically draw in even more people.\n\n**Algorithm as matchmaker**\n\nThis one's been gaining sooo much popularity it's insane (especially on TikTok):\n\n\"If you're young and you're gonna be successful (which you probably are, since the algorithm put this on your screen)...\"\n\n\"This video is gonna reach the girl who really needs to hear this... I'm not even gonna use a hashtag, because you're meant to hear this.\"\n\nCreators are talking to the algorithm like it's a divine matchmaker, trusting it to deliver their message to exactly who needs it. And people stop because what if the algorithm really did choose them?\n\n\\---------------------------------------\n\n\\* All examples are real viral hooks I’ve collected and used for AI training (all from 2025)\n\nThis was fun! Part 3?\n\n\\- Shani from Captain Hook AI",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1758727477.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Offers analysis of viral hooks and mental models for content.",
    "composite_score": 3.2384619580230534
  },
  {
    "score": 70,
    "title": "Is anyone using AI tools to speed up content creation?",
    "selftext": "Hey everyone,\n\nI’ve been working on my own content after hours, mainly YouTube, X, and LinkedIn. It’s been pretty overwhelming. I love creating, but keeping a consistent posting schedule while having a full-time job is tough. Writing script and editing short-form videos especially eats up my time, and I feel like my output never matches my ideas.\n\nLately, I am thinking about using AI tools to help streamline things, maybe to brainstorm ideas, repurpose content, or automate parts of my workflow. But I’m still not sure what’s actually worth using or what really helps in practice.\n\nWould love to hear from anyone here who’s been using AI to make content creation easier. What tools or workflows have made the biggest difference for you?",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1760871574.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.64,
    "category_rationale": "The post is a question seeking AI tools/workflow recommendations rather than presenting a list, model, or steps.",
    "composite_score": 3.553152262391853
  },
  {
    "score": 70,
    "title": "y’all i’m over social media - but it’s my job",
    "selftext": "will try to keep this short and to the point. english isn’t my 1st language, apologies for anything that sounds weird.\n\never since the tiktok “ban”, i found myself disgusted with social media and the narrative it’s constantly pushing. since the app got back, it’s not what it used to be. i see changes on facebook too - why am i, a person in central europe, seeing “a woman drowned this person in louisianna” as a first post on my wall, after opening the app??\n\nit just ruined the whole experience. i now see SM as a tool to manipulate and keeping us as products. the injustice and weird practices make me not proud of my job, because i’m essentially trying to make good quality content and spend time on it, but it doesn’t go viral.\n\nYOU HAVE TO HAVE A GOOD HOOK! EVEN IF IT IS NEGATIVE! well i don’t want to. why do i have to manipulate people into reading stuff? how do these fake pranks have thousands of likes? why do people click the like button?? \n\ni work for corporate and have guidelines, and the product is a service. so it’s a lot of writing and stock pictures - that doesn’t help too.\n\ndoes anyone deal with the same thing, are you planning to switch professions?\n\nthank you! ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1744112461.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Clear emotional vent about social media and job-related frustrations.",
    "composite_score": 3.2746222667278717
  },
  {
    "score": 71,
    "title": "What happened in marketing and social media last week? (Snap vs Pinterest) ",
    "selftext": "\n\n#Top 6 Updates of the Week: \n\n* Instagram users in U.S. can now create AI versions of themselves. \n* Snapchat reaches 850M users, 11 million premium subscribers in Q2 with ad revenue increase. \n* Google introduces new reporting and genAI tools to Performance Max. \n* Meta’s ad revenue in Q2 increased to $39 billion, thanks to AI.  \n        * Family DAP (daily active people) was 3.27 billion on average for June 2024, an increase of 7% year-over-year.\n* Pinterest added only 4 million new monthly active users in Q2, a huge drop in platform user growth. \n* Microsoft shares Q2 earnings, reports an 10% revenue increase for LinkedIn and strong user engagement growth. \n\n#Trending \n\n* Google Ads hit by major reporting glitch, exposing competitor data.  \n* U.S. Senate passes landmark bills to protect kids online. \n* Pinterest and LinkedIn team up with Publishers to sell Ads. \n* Amazon Ads services revene grew 20% YoY in Q2, reaching $12.77 billion. \n* Google pulls back AI Gemini ad after backlash.  \n        * Apple also pulled back their ‘OOO’ ad for being called out as ‘outdated and stereotypical’.\n* Disney and Spotify partner with Yahoo for audio ads. \n* Outbrain confirms Teads purchase in a $1 billion deal.  \n* LinkedIn introduces verification for company pages. \n* Snapchat publishes new study with National Research Group, sharing shopping insights, 82% snapchatters consider shopping to be a primary hobby, versus 59%. \n* British Library, Tate and 13 other museums in London and Oxford selects ‘Anything is Possible’ to handle their planning and buying.  \n* Google introduces 3 new AI features to Chrome for product discovery.  \n* US Senators propose new bill to combat AI deepfakes.  \n* e.l.f. Cosmetics is celebrating Olympics with Hot Girl Walk championships. \n* Twitch mobile app gets a redesign, the new update puts their TikTok-style feed in the focus.  \n* Snapchat adds new AR experiences for 2024 Olympics. \n* Vinted enlists Vicky Pattison to host new Channel 4 entertainment series. \n* Substack App introduces new mobile editor to write and publish posts. \n* John Lewis boosts retail media business with Epsilon partnership. \n* US Ad business lost 500 jobs in July as the labor market weakened. \n* Dash Drink’s brave OOH takes a stab at Coca Cola. \n* Reddit CEO says Microsoft and others need to pay to search the site. \n* Mischief US and Carter’s show messier side of childhood in back-to-school campaign. \n\n#TikTok 🎶 \n\n* TikTok launches new app centre for businesses, providing easy access to marketing tools. \n* TikTok presents their first-ever Visionary Voices Africa list.  \n* TikTok and CreatorIQ publish new report on Top 100 brands winning big with Creators.  \n* Justice Department defends TikTok ban law, sharing TT collected U.S. users’s views on gun control, abortion and religion. \n* TikTok launches In-app hub for Olympics, it includes a medal table. \n* TikTok is spending $20 million a month at OpenAI through Microsoft. \n* ISpot.tv to provide cross-platform ad measurement with TikTok. \n\n\n #Instagram &amp; Threads 🗂️ \n\n* Threads App reaches 200M monthly active users. \n* Instagram is getting rid of ‘Posts count’ from Profile Page. \n* Threads releases TikTok-like blue search label to be seen above posts. \n* Instagram testing a new feed with reels that include notes from your friends. \n* Instagram Carousels got text overlays feature recently, now the feature includes new fonts. \n* Instagram now allows users to link their Spotify accounts for easy music discovery. \n* Instagram reels now have a prompts feature, next to polls. No idea what it does, prompts are show up just like captions. \n* IG Broadcast channel gets ‘imagine’ sticker feature. \n\n#Meta 😅\n\n* Meta under investigation for running hundreds of ads for Cocaine, Opioids and other drugs.  \n* Meta quietly scraps Celebrity AI chatbots as they fell flat with users.  \n* Celebs are out, Business AI bots are In. Meta is developing AI bots to help businesses with transactional engagement. \n* Meta to pay $1.4 billion to settle Texas facial recognition data lawsuit.  \n* Facebook’s U.S. Gen Z users are projected to increase from 49.0% (33.9M) in 2024 to 56.9% (40.5M) by 2028.  \n* WhatsApp rolling out a feature to share voice messages with Meta AI. \n\n\n#X (Twitter) 🕹️\n\n* Elon Musk accused of not labelling Deepfake video of Kamala Harris. \n* X aka Twitter disappeared from Mac App Store and then relaunched on macOS. \n* X expands Safety X support centre with new facility in Texas.  \n* xAI considers buying Character AI. \n* X could soon launch ‘parody’ label for parody accounts. \n* Paris Olympic Medalists are getting affiliate badges. \n* Edit functionality for DMs is coming soon. \n* Elon Musk’s X suspended ‘White Dudes of Harris’ account and reinstated after backlash from Media. \n\n\n#Youtube 🕹️\n\n* YouTube sports viewing soars as streaming moves to big-screen TVs. \n* YouTube announces changes to YPP suspension appeals and simplifies the channel page.  \n\n#Google 🔦 \n \n* Google Ads introduces new consent settings tab in Data manager. \n* Google Ads to let you set up message assets to click-to WhatsApp for some advertisers. \n* Google is showing X carousels less often for news topics. \n* Google Ads introduces new surcharges for specific jurisdictions. \n* Google updates image search features and shares on insights on how they handle deepfakes. \n* Google Discover promoting AI overviews for Olympic Games in Paris. \n* Google streamlines ad creation with Merchant Center-Ads integration. \n* Cloud expands its database portfolio with new AI capabilities. \n* New Google Business Profile AI tool creates a menu from an image. \n* Google introduces INP improvement for Publisher Tag Ads Library. \n\n\n#Agency News \n\n* ASOS hires Mother’s The Or as new ad agency. \n* Publicis Groupe hired as new media agency for Rocket Companies. \n* Krow Group hired as new lead creative agency for Benson for Beds. \n* Havas acquires Australian media agency and creative production company, Hotglue. \n* L’Oréal International distribution selects Wavemaker as EMEA Strategic Partner for Media Buying and Planning. \n* Spirit Airlines names Tombras Agency of Record. \n* Zaxbys appoints GS&amp;P as new creative agency. \n* Ogilvy PR launches Influence Shield, a new offering to manage Influence Risk.  \n* Hudson Rouge appointed as lead agency for Lobos 1707 super premium Tequila. \n* The AA appoints The Gate as CRM Agency. \n* McGarrah Jessee launches new social media agency, Look Squirrel. \n* Marketing Agency Myosin launches new platform that lets consumers give your media budget to Charity.  \n* Stagwell revenue grew 6% YoY in Q2, thanks to new clients such as Chevy and Cadillac. \n* Corona Extra appoints GSD&amp;M as the lead creative agency. \n* Boldspace appointed by Obrizum to rebrand AI-powered learning solutions.  \n* VIVAIA appoints Edelman Australia as PR AOR. \n* Assembly appointed by Pipedrive, Tech Firm as global media partner. \n* Luton Airport Express selects Leith, Scottish agency as creative AOR. \n* ThePub adds content production mandate for TD in Canada. \n\n#AI 🤨\n\n* WPP and Nvidia partner to generate 3D Ads using GenAI.  \n* Google’s partnership with AI startup AThropic faces scrutiny from UK competition watchdog.  \n* Software lab Forum3 launches Spok, an AI Marketing Expert. \n* Reddit acquires Memorable AI to enhance advertising performance. \n* Canva acquires Leonardo AI to boost its GenAI efforts. \n* Perplexity AI launches ad revenue sharing program for publishers. \n* Github launches GitHub models, a new generation of AI engineers. \n* OpenAI launches Advanced voice mode, currently rolling out to GPT Plus users. \n\n#Microsoft &amp; LinkedIn\n\n\n* LinkedIn is finally getting an easy to access ‘save’ button, available alongside engagement icons.  \n* LinkedIn agrees to pay $6.6 million to settle advertisers’ lawsuit over alleged overcharges. \n* Microsoft makes Skype ad-free, good. \n* Nvidia and chip shares soar as Microsoft increases AI spending. \n* Microsoft's Azure networking took a worldwide tumble. \n\n\n#Marketing &amp; AdTech \n\n* MiQ to acquire Pathlabs, expanding programmatic excellence to Independent Agencies. \n* impact (dot) com unveils fully customisable customer referral solution. \n* Discord on Xbox will soon let you watch your friends’ streams.  \n* The Guardian issues apology after ‘watch porn’ ad displayed next to child abuse article.  \n* Etsy to launch paid buyer membership program.  \n* simpli.fi expands CTV Product suite, giving advertisers greater pricing flexibility and more. \n* NBCUniversal tops Olympics record as ad sales surpass $1.2B. \n* Experian rolls out retail media network solution.  \n* For National Avocado Day, Chipotle and Wonderskin launched ‘Lipotle’ Lip stain. \n* Hyundai splits CMO role into creative performance positions. \n* Pacsun partnered with Pinterest for ‘Better in Baggy’ fall campaign.  \n* Kiehl’s launches first-ever intimate care line: Kiehl’s personals.  \n* Rokt partners with Vinted, powering new revenue opportunities.  \n* IAS announces mobile in-app support for first attention product. \n* Twitch loses 10% of market share to YouTube and Kick. \n\n**I hope this helps to plan your week ahead.**",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1723040175.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "A roundup presented as a top updates list of many items.",
    "composite_score": 3.0513774899272406
  },
  {
    "score": 65,
    "title": "Tips for working with Fiverr UGC creators?",
    "selftext": "I’m looking to validate a new product idea and figured UGC-style content might be the fastest way to test messaging. I’ve worked with UGC creators before, but never on Fiverr or similar platforms. I noticed Fiverr has quite a few people offering this service.\n\nSince I’m new to using Fiverr for UGC, I’m wondering if anyone has tips for working with creators there. What should I ask for up front, and what helps avoid endless back-and-forth?\n\nAlso, are there any other platforms you’d recommend for affordable and quick UGC content?",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1758046039.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asks for tips about working with Fiverr UGC creators; no structured how-to or list yet.",
    "composite_score": 3.2014207360182834
  },
  {
    "score": 68,
    "title": "Starting my Digital Marketing journey – what’s the best skill to master first?",
    "selftext": "Hey everyone!\nI recently started a digital marketing course, and I’m amazed by how broad this field is – SEO, social media, ads, content, email marketing, automation… it feels endless!\nFor those already working in digital marketing:\n\nWhat was the first skill you mastered that really helped your career?\n\nIf you had to restart in 2025, which area would you focus on first?\n\nLooking forward to your thoughts!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1755494485.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "A request for guidance on the best skill to master; a simple question without content structure.",
    "composite_score": 3.5263797224331053
  },
  {
    "score": 67,
    "title": "Methods to grow client accounts on IG these days?",
    "selftext": "Been working with a few clients in the fitness, influencer and travel niches, and growth has been tough this year, especially post-algo changes in early 2025!\n\nI tested a few things:\n\nReels 3x per week (moderate traction)\n\nStory polls daily (solid engagement)\n\nA mass DM outreach strategy using a tool  (not bad but it worked much better before)\n\nCommenting on similar accounts, and liking photos of the users that are following competitors (we did gain some likes back but not much new followers)\n\nGetting into comment for comment groups (nothing at all, you just have more comments under the posts)\n\nFollow, unfollow is long gone now, so from that we are getting almost no results, and I think that method was good probably few years ago\n\nI’m curious: what’s actually working for you guys lately? What can you recommend? I am open to try all new methods on some of my accounts, and if it works do it on my clients accounts. ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1751999933.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Enumerated methods for growing Instagram accounts, forming a items list.",
    "composite_score": 3.306087928377346
  },
  {
    "score": 64,
    "title": "Why We Stopped Calling It \"Top of Funnel\".",
    "selftext": "The funnel is dead.\n\nWell, not the idea that people go on a journey before they buy. That's obviously real. But this fantasy that they move in a neat little line from awareness → consideration → purchase?\n\nYeah, no.\n\nPeople don't flow anymore. They bounce around. They disappear for three months and come back because someone mentioned you in a Reddit thread. Or their coworker sent them that carousel they saved forever ago and forgot about.\n\nBut we're still out here measuring everything like it's 2015.\n\nHere's what's broken about \"top of funnel\" thinking:\n\nIt acts like the first thing someone sees is the most important thing. So we lose our minds over the first click, the first ad, the first impression. We build these attribution models that hand all the credit to whatever happened last. Or first. Or within a 7-day window we made up.\n\nThat's just not how people buy stuff.\n\nSomeone sees your TikTok. Doesn't click. Two weeks later they Google you because the hook stuck in their head. They land on your site, scroll around, leave. A month later they see a founder video on Instagram that answers the one thing they were worried about. Still don't buy. Then they get retargeted with a testimonial and that's when they convert.\n\nSo what drove the sale?\n\nAll of it. None of it. The whole damn system.\n\nWe started calling it \"surround sound\" instead.\n\nShow up enough places. Be helpful enough times. Stay consistent. So when someone's finally ready to move, you're not just an option, you're the obvious choice.\n\nYou're not hunting for one magic touchpoint. You're building a presence that makes trust feel inevitable.\n\nHere's what that actually looks like:\n\nWe publish organic content that teaches people something and shows how we think. We run paid ads to people who've already watched 30, 60, 90 seconds of that content. We show up in Reddit threads and LinkedIn comments where our people are actually asking questions.\n\nAnd yeah, we track assisted conversions. Branded search lift. Post-purchase surveys that straight-up ask: \"what made you choose us?\"\n\nThe data's messier. But it's real.\n\nWhen a CFO asks \"okay but what's the ROI of that TikTok?\" we don't say \"we can't measure it.\"\n\nWe say: \"Here's how many people searched our name the week that video blew up. Here's the spike in demo requests from people who engaged with three different pieces of content before booking. Here's what actual customers told us when we asked.\"\n\nYou're not trying to prove one campaign worked. You're proving the system works.\n\nSo if you've ditched last-click attribution and started measuring the full journey, what changed for you? What metrics actually made the story clear enough that finance believed you?",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1763382345.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Presents a mental model critique of funnel thinking and what actually drives sales.",
    "composite_score": 3.2510646070264992
  },
  {
    "score": 64,
    "title": "What does content strategy really mean?",
    "selftext": "I recently made the transition from journalism to content marketing, and while I'm excited about the switch, I'm trying to get a better grasp on content strategy development. I've noticed that while everyone talks about how crucial having a solid content strategy is, it's surprisingly difficult to find concrete examples of what one actually looks like in practice.\n\nMy journalism background has given me strong writing and research skills, but I realize that content marketing requires a different approach - especially when it comes to strategic planning and measuring success. I've been reading a lot of articles and guides, but they tend to stay quite theoretical, often just repeating phrases like 'align with business goals' and 'create valuable content' without showing how this translates into actual planning.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1732272311.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Explains what content strategy means and how to translate theory into practice.",
    "composite_score": 3.372147584432649
  },
  {
    "score": 65,
    "title": "I was *stuck* in 200 views IG HELL. But now I'm getting 2K views on every post. ",
    "selftext": "I have been a social media manager for 3 years.   \n  \nMy biggest achievement is that I scaled an Instagram page to 64K. It took me 2 whole years to do that and a mix of organic and paid marketing, but mostly organic.   \n\n\nGaining confidence from this project, I took on a client from another country who I did not know had \\*bought\\* followers on their account - 1.2K of them. :(\n\nIt was only after I started working with this client, I was made aware of it. \n\nNow, for those of you who don't know - fake followers is a guaranteed way of killing reach. \n\nWhy? \n\nBecause the algorithm first shows your post first to your existing followers. \n\nAnd this first interaction decides how far and wide your post will actually go. \n\n- THE MOST DREADED STATE ARRIVED- \n\nI posted 5 times a week for 3 months from this client's post. But I still wasn't getting out of the 200 views IG hell. \n\nThe maximum I got was 16K views on a reel - but that was ONLY because we collaborated with a big account (with 112K followership). \n\nNow when the agreement was coming to an end, I adapted some measures to break out of this hell: \n\n1. I added hashtags that put me on the trending pages along with influencers. \n\n2. I made a robust improvement in my content strategy (better collaborations, strategic placements, improved content, and more.)\n\n3. CRAZZZYYY Engagement like 50 comments a day. \n\nFinally after the grind, around the 5th month, our posts have started to get 2K views each. \n\nThe followers are coming in. \n\nWe are seeing traction. \n\n2 things happened for me: \n\n1. I found out that buying followers is NOT the death of an IG page (I so strongly believed it in the past). \n\n2. I also believed that engagement was important but not that much - until I proved myself wrong. \n\nFellow, social media managers - how have you handled accounts with fake followers? There are so many floating around. \n\nAlso, what would you add to the list of things that should be done. \n\n",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1726934762.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.62,
    "category_rationale": "Contains a reproducible sequence of actions (steps) to improve IG performance.",
    "composite_score": 3.039543935541869
  },
  {
    "score": 64,
    "title": "LinkedIn Growth in 2025: New Study Reveals What Actually Works",
    "selftext": "Just read through Metricool’s massive 2025 LinkedIn report (577k posts from 47k+ accounts) &amp; thought I’d share some of the key stuff in case you’re trying to grow on LinkedIn right now.\n\n• clicks are up 28%   \n• interactions are up 31%   \n• video posts are up 53%   \n• carousels (PDFs) get the most engagement - 45.85% avg   \n• polls get 206% more impressions than other post types \\[still underused\\]   \n• text-only posts did worst across the board   \n• only 17.68% of pages gained followers \\[so growth isn’t easy, but possible\\]\n\nposting habits:\n\n• avg page posts 12.24 times/month   \n• big pages post 43x/month   \n• even small pages got 22.4% more impressions this year just by staying consistent\n\nlinks:\n\n• posts with external links got more interactions (+13.57%) and more impressions (+4.9%) \\[so yeah, linking out is totally fine if the content delivers\\]\n\nbest posting day:\n\nTuesday best specific time: Thursday, 5:12pm \\[weirdly specific but hey, data\\]\n\nby industry:\n\n• tech, media, education post the most   \n• finance, oil/gas, utilities = highest CTR   \n• manufacturing has fewer followers but higher engagement\n\nmy takeaways:\n\n• carousels and polls are gold right now   \n• video is climbing fast, especially in impressions   \n• regular posting still works, even for small pages   \n• you can link off-site — LinkedIn won’t punish you for it   \n• niche industries can do well with loyal audiences\n\ntools you should know:\n\n• LinkedIn schedulers (with carousel + video support)   \n• lead gen tools that work with Sales Navigator or LinkedIn search   \n• ai carousel generators \\[really helpful if you’re not a designer\\]   \n• lightweight editors for video snippets from long-form content   \n• post assistants that write native-style LinkedIn copy\n\n\\[just don’t go full AI robot, it still needs your tone\\]\n\nhope this helps anyone trying to make LinkedIn actually work this year. let me know if you want tool recs for something specific, I tested way too many. ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1744497318.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.9,
    "category_rationale": "Data-driven list of metrics, posting tactics, and recommended tools.",
    "composite_score": 3.120958986170696
  },
  {
    "score": 64,
    "title": "90% of brands don’t actually have a “brand.”",
    "selftext": "After 5 years in branding strategy and copywriting, here’s what I’ve learned:\n\n1.Most brands don’t sound bad, they sound just like everyone else.\n\n2.Posting daily doesn’t build trust. Consistency in tone does.\n\n3.“Aesthetic” is overrated.\n\n4.Good design can’t fix confusing messaging.\n\n5.Copy is not captions. Copy is clarity.\n\n6.Founders who want “trending reels” rarely build lasting brands.\n\n7.Brands that communicate like humans always outperform brands that communicate like brochures.\n\n8.If you can’t explain your value in one line, your audience won’t understand it in 20 posts.\n\nCurious to know how other my fellow founders and marketers see this!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1763440443.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.86,
    "category_rationale": "Structured as a numbered list of branding insights.",
    "composite_score": 3.2305189774986585
  },
  {
    "score": 64,
    "title": "8 AI tools tailored for social media marketers",
    "selftext": "Social media marketing is hectic, but when you've got the right tools, everything flows smoother. As someone deeply ingrained in the field, I've curated a list of AI tools perfect for us in the SMM world. Take a peek:\n\n* *AI Voice Generator* \\-➛ **Lovo.ai**\n\nPerfect for crafting voiceovers without hiring a professional. Ideal for video content on platforms like IG and TikTok.\n\n* *Summarize Meetings* \\-➛ **Tldv.io**\n\nNever miss the crucial points from your strategy meetings. Instantly capture the essence for your future campaigns.\n\n* *AI Social Toolkit* \\-➛ **Boost App Social**\n\nThis has been my secret weapon. Generate content ideas, captions, and even relevant hashtags.\n\n* *AI Workspace* \\-➛ **Day.io**\n\nA virtual space to get your SMM ideas flowing, perfectly aligned for our dynamic workspace needs.\n\n* *SEO Articles Expert* \\-➛ **Trolly.ai**\n\nUp your blog and post-game by ensuring you're SEO optimized. Essential for driving organic traffic.\n\n* *Image Generator* \\-➛ **Lexica.art**\n\nVisual content is king. Create stunning images for your campaigns, ensuring that your brand stands out.\n\n* *AI Newsletter* \\-➛ **theaicolony.beehiiv.com**\n\nStay updated with AI trends in SMM. One newsletter that's helped me stay ahead in my game.\n\n* *Generate a Blog From Scratch* \\-➛ **Simulai.co**\n\nTurn your ideas into engaging blogs. Ideal for those brand stories you've been meaning to tell.\n\nAlways test and adapt. Tools are great, but it's how you leverage them that truly makes the difference.\n\nShare your favorite tools in the comments, and let's learn together!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1697529885.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Explicitly lists 8 AI tools with brief descriptions.",
    "composite_score": 3.256095238722349
  },
  {
    "score": 59,
    "title": "I don't know if I can do social media marketing anymore",
    "selftext": "**For context:** I'm 25, spent my first year out of college doing internal marketing and then have this past year of agency under my belt. I'm feeling so overwhelmed with client expectations, workload, etc. and think I am just burnt out from social media and my job. \n\nBut now is not the time to job-hop but I think I have to go back to internal marketing for my mental health's sake or even quit and get an admin job or something. \n\nI just need more work life balance, be able to fully clock out, etc. But I also tell myself to be an adult, that this job offers benefits, flexibility, etc, but something's just tugging at me to quit. I am just ranting at this point. But I need advice or comfort or anything at all. thank you :) ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1759242377.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Expresses burnout with emotional venting and seeks support.",
    "composite_score": 3.2442302660547533
  },
  {
    "score": 61,
    "title": "App Developer Here! Looking for Creator with 100k followers!",
    "selftext": "If you have a social account that's has 100 k followers and alot of engagement. I am here to offer my revenue sharing of 30% of what my app earns in profit. \n\nI'm an app developer, can develop dozens of app per month and increase revenue. \n\nI have made few dozen of apps looking for content creator or account holder of accounts with tons of followers on their social account.\n\nLet's connect and collaborate, earn money together.\nI'm open for discussion in DM.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1740913312.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Promotional outreach solicitation with no substantive content.",
    "composite_score": 2.828421685162235
  },
  {
    "score": 62,
    "title": "Mastering Instagram Hashtags in 2023: Captions vs. Comments",
    "selftext": "**Understanding Instagram Hashtags: The Basics and Beyond**\n\nInstagram hashtags have come a long way since their inception, evolving from a simple categorization tool to a robust mechanism for content discovery and audience engagement. Why are Instagram hashtags so essential? By using relevant hashtags in your posts, you boost the chances of your content being discovered by users interested in your niche. This can lead to higher engagement rates, more followers, and a more successful Instagram account.\n\nBeyond acting as a categorization tool, hashtags play a crucial role in Instagram's search functionality. Users can search for hashtags in Instagram’s search bar or click on a hashtag in a post to find all other posts with the same hashtag. By strategically choosing and using relevant hashtags, you can widen your content’s exposure and attract new followers.\n\n**Placing Hashtags in Captions: The Detailed Look**\n\nThe placement of your hashtags can have a significant impact on their effectiveness. There are several advantages to placing your hashtags directly in your post caption. It ensures that all aspects of your post - visual content, text, and hashtags - are cohesive. Furthermore, having your hashtags in the caption makes them immediately visible to users as they scroll through their feeds, increasing the likelihood that they will take notice of your content and engage with it.\n\nHowever, there are some downsides to consider. A caption overloaded with hashtags can appear spammy, detracting from your post's aesthetic. Additionally, as new comments pile up, the visibility of your hashtags in the caption may be affected, which could potentially reduce the discoverability of your post.\n\n**Using Hashtags in Comments: A Deeper Insight**\n\nOn the other hand, placing hashtags in the first comment of your Instagram post is an alternative strategy that many marketers swear by. This approach can help maintain a clean and aesthetically pleasing caption while still benefiting from the discoverability that hashtags provide. Moreover, hashtags in comments remain visible at the top of the comment section, ensuring that they don't get buried by new comments.\n\nHowever, this strategy is not without its potential pitfalls. For instance, if you edit, delete, or hide the comment containing hashtags, you risk affecting your post's discoverability. Moreover, if you fail to post the hashtags as the first comment immediately after uploading, you might miss out on valuable initial engagement.\n\n**The Art and Science of Choosing the Right Hashtags**\n\nThe optimal number of hashtags for Instagram posts is a subject of much debate. While Instagram allows up to 30 hashtags per post, a more balanced approach recommends using 10-15 relevant, strategically chosen hashtags. This approach helps avoid appearing spammy while still reaching a wider audience.\n\nFinding the best hashtags for your niche involves a mix of research and experimentation. One effective method involves studying your competitors and other successful accounts in your niche. Take note of which hashtags they use and experiment with them in your posts. Other techniques include using hashtag research tools, joining industry-specific communities, and staying up-to-date with popular trends and news related to your audience.\n\n**Adapting Your Hashtag Strategy for 2023: Trends and Future Projections**\n\nAs Instagram continues to evolve, so do the best practices surrounding hashtags. Influencer marketing, branded hashtags, and the rising popularity of Reels content are some of the trends to watch out for. These trends could impact how effectively you reach and engage with users using hashtags.\n\nOne projection for the future of hashtag etiquette includes the increased importance of using a wider variety of niche-specific hashtags to reach users interested in your content. The ever-changing nature of Instagram means it's crucial to continuously test, analyze, and adjust your strategies based on your unique audience, goals, and content.\n\nIn conclusion, there’s no definitive answer as to whether placing hashtags in captions or comments is superior. Instead, it's important to experiment and find what works best for your specific needs and goals. With a mindful approach to hashtag use and a willingness to adapt to the ever-changing Instagram landscape, you can harness the power of hashtags to extend your reach, boost your engagement, and achieve greater success on the platform​.\n\nRemember, Instagram is a space for creativity and connection. Whether you're a brand, a content creator, or a user seeking to grow your following, being authentic and genuine in your interactions can go a long way. As you navigate the world of hashtags, keep in mind that your ultimate goal should be to create content that resonates with your audience and builds a sense of community.\n\n**Here are a couple more resources that can provide further insights:**\n\n[Instagram Hashtags: Everything You Need To Know in 2023](https://later.com/blog/ultimate-guide-to-using-instagram-hashtags/)\n\n[Mastering Instagram Hashtags in 2023: Captions vs. Comments](https://follify.net/instagram-hashtags-in-captions-vs-comments)\n\n[Instagram ](https://blog.hootsuite.com/instagram-hashtags/)[Hashtags: Ultimate Guide \\[100+ Hashtags for 2023\\]](https://blog.hootsuite.com/instagram-hashtags/)\n\n**Happy hashtagging!**",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 62,
    "downs": 0,
    "created_utc": 1685993948.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Provides an analytical guide on hashtags with pros/cons.",
    "composite_score": 3.215204467462378
  },
  {
    "score": 58,
    "title": "Hi, I’m Ervin, founder of Publer (bootstrapped to $2M ARR) — AMA!",
    "selftext": "Hey Reddit!\n\nAfter 12 years of competing with Buffer, Hootsuite, Later, and co., I think we're finally making a name for ourselves.\n\nWe crossed $1M ARR in 2023 and, a year later, hit $2M ARR. We currently serve nearly half a million users.\n\nI'm the founder of Publer, bootstrapping since day one, and still enjoying this roller coaster ride.\n\nAsk me anything, literally!\n\nI will go Live and answer every question on January 14th at 4:30 PM CET / 9:30 AM CT.\n\n&gt;Thank you everyone for your questions!\n&gt;\n&gt;Feel free to ask more questions as I do check Reddit once in a while.\n&gt;\n&gt;Outside Reddit, you can find me on any social network.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1736766141.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "AMA/promo post; mostly self-promotion, no substantive analysis.",
    "composite_score": 3.491868681291534
  },
  {
    "score": 59,
    "title": "What exactly does a social media manager do?",
    "selftext": "I would like to get some advice as I felt like I’ve been scammed recently. \n\nI hired a social media manager to manage my business social media account. I’ve paid this person a huge sum of money. \n\nI haven’t been getting any results and found out that this person has been using chat gpt for all the captions and even the hashtags are from chat gpt. Content were also provided by me from my content library so my social media manager does not have to come up with any designs for content posting. \n\n$3000 for copywriting &amp; hashtags from chat gpt and nothing else was done. I am feeling quite depressed about this and do feel like I’ve been cheated. \n\nSo what exactly does a social media manager do and what is the amount that I should be paying because it seems like with chat gpt, I could just do everything myself.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1685351108.0,
    "media": null,
    "is_video": false,
    "num_comments": 115,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.66,
    "category_rationale": "Vent about being scammed and questions about role; emotional.",
    "composite_score": 3.560380244997103
  },
  {
    "score": 58,
    "title": "I have to market more, but I love building SaaS....",
    "selftext": "I love the process of building a new project. All parts, from setting up the foundations, architecture, planning all... The issue is it doesn't matter how good of a project you make, if you don't market it, it's just a hobby.\n\nI heart something that really hit me years ago, if you don't earn money in the first 2 years, it's just an expensive hobby. I'm writing this as I'm currently building a pretty cool project (PostFast), and its a social media scheduler, but it's growing into more of a tool even for large SMM agencies.\n\nThe thing is I want to build more and more cool features, but it won't matter if I don't get more clients. I do have currently some clients, but it's definetly not enough to be a full-time job, and I'd love to be building a full-time SaaS.\n\nI think that this is something a lot of founders struggle with (the dev oriented ones), and we need to understand that if we don't market, we won't have the time to build. So this is my \"way\" of marketing, at least showing my story... :)",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1750186227.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares a mental model about marketing necessity for SaaS success.",
    "composite_score": 3.093897641169985
  },
  {
    "score": 61,
    "title": "Want to reach 30-40 million people? Here’s the short version:",
    "selftext": "\nIt won’t cost you anything… all you need is:\n\n\t•\tA main account on IG, YouTube, X, FB, TT, and of course, Reddit.\n\t•\t4-5 auxiliary and test accounts per platform to support your main ones.\n\t•\tA newsletter with a fun topic about your niche that people will actually want to read.\n\t•\tA website to drive traffic to, where you can go in-depth and cross-promote across your platforms. Your website is the central hub—where it all gets organized, spread out, and supported.\n\nOn your website, run a blog with all the links and resources related to your niche. The goal is to get traffic flowing to all your outlets and have it circle back to your site. Your website talks to Google and the social networks, helping them understand what kind of followers your accounts are looking for.\n\nThis is before you even post.\n\nDo your research, experiment, study trends and how they fit with your niche. Stay on top of all the news, events, predictions, and analysis in your niche. Make sure everything is live and ready to be seen—whether by humans or bots.\n\nAdd a game to your website to keep people engaged longer. Google will reward that, and it helps social media algorithms find the right followers for you. More time on your site = better analytics, and that leads to better content discovery.\n\nDid I mention a blog? Yeah, you need one—aim for 5-10 posts a day. Start with one a day and ramp up, so Google doesn’t think you’re spamming but sees you producing consistent, quality content that the AI loves.\n\nAlso, make sure your metadata is on point. Upload a bad video or file, and your account could get flagged and go on a month-long vacation while you clean up your act.\n\nBonus tip: Create a free WordPress plugin. Maybe it’s a highlight reel of your best content, or a news feed. Or, if you’re feeling ambitious, build something like a voiceover tool that hooks directly to other sites via API and produces awesome voiceovers. Or maybe a chatbot trained as a sales assistant that others can embed on their site—basically an army of bots helping followers or replacing customer support. That bot could even feed information back to you, allowing you to learn from its usage.\n\nBut you get the point.\n\nIt’s all connected. I include a lot of this in my services, but the real challenge is finding people to do the work. And trust me, someone needs to manage all of this content—ideally you, especially if you live in the country you’re targeting. It’s mostly copy-paste, but it’s a LOT of copy-paste, and if someone screws it up… it all goes to 💩.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1726138077.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Provides a step-by-step plan with concrete actions to reach a big audience.",
    "composite_score": 3.1060013368652135
  },
  {
    "score": 55,
    "title": "My boss is too demanding - social media manager",
    "selftext": "Hi. Long story short, I’m a college grad in my first real job. I work as a social media/marketing manager for a small real estate company. My bosses are asking too much I think. They are really strict about having a post every single day (7 days a week) and having something on our story 24/7. They say this is to increase visibility. Which, I understand to some extent, but here’s the problem: WE DONT HAVE THAT MUCH CONTENT. They expect me to pump out post after post, even though we realistically only have maybe 4 decent posts a week (usually about new listings or final sales). I don’t know what to do. They’ve complained to me our social media is “dead” even though I do try to have at least 1 story each day, and 5-7 posts a week. But the posts are easy boring posts that don’t drive engagement because they also give me a shitload of other projects to tackle like graphic designing a whole magazine for them (that’s a whole other issue). So basically I don’t have much time to brainstorm good content ideas, and the ideas I have would take time to make. I want to tell them its quality over quantity but they’re stubborn middle aged women who probably won’t listen and are just going to be upset I’m “telling them how to run their business”…even though I was hired to handle all the marketing. I really would like to make more complex posts like reels and BTS, but I can’t with the amount of other things I have to do. And even then, I wouldn’t have a post like that ALL the time. What do I do? Am I just a bad social media manager? Are their expectations too high? I don’t know.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1746368549.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.76,
    "category_rationale": "Emotional grievance about demanding boss and workload.",
    "composite_score": 3.327402023787669
  },
  {
    "score": 55,
    "title": "My Ads Suck - How Do You Fix Meta Ads?",
    "selftext": "Long story short I won’t bore you all with the details but we hired a designer on a freelance site who made around 10 decent looking ads (at least i thought they were). \n\nRunning them we’re getting a $4 CPC and a 0.5% CTR to our site. This is not good and I know we should be aiming for under $1 cpc and higher CTRs.\n\nOur site is good, we use other channels that work like influencers, but I can’t seem to get these Meta creatives to work for some reason. Just looking at the funnel, it has to be on the ads we’re running because once people visit the site they do purchase, but riht now its expensive to get people onto our site.\n\nAny suggestions or advice would be appreciated, especially with creatives - thank you!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1744918396.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question/request for advice on fixing Meta ads; lacks a structured list or actionable framework.",
    "composite_score": 2.868884369585313
  },
  {
    "score": 55,
    "title": "Advertising on Social because that's where the people are....but are they!?",
    "selftext": "Younger millennial here. That works in social media advertising! Quite honestly...I cant tell you when the last time (or if Ive ever even purchased!?) through a social media ad. Have I been influenced by them? Yes. Have I ever actually clicked on one (even RT) and bought through that ad link...nope. Lets take a step back... as a consumer, have you?? Safe to say the exception here is Influencer marketing.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1762778316.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Mostly a reflective take on social ads with no clear steps or model.",
    "composite_score": 3.2370799553660685
  },
  {
    "score": 57,
    "title": "400 Million views and I can’t land an interview",
    "selftext": "I started doing social media for a local small business about a year and a half ago. When I was brought on they had very minimal social media presence, about 9k total followers and about the same monthly impressions. \n\nSince I was brought on, I started doing fun, light hearted videos that blew us up, and we’ve consistently gotten 30 Million+ views every month since then, totaling about 400 Million across all platforms. We’ve gotten sponsorships, monetization, interviewed by major news outlets, a YouTube play button, and business has been absolutely booming. Every video is conceptualized, written (lots are skits), filmed, edited, and posted by me, so I have plenty of experience in the entire process of creating viral content. \n\nThat being said, I’m ready to move on to a bigger company with growth opportunities, and I’ve applied for over 30 social media manager/video editor positions but haven’t gotten any responses. I feel like I’m going crazy, is it the market being so oversaturated with social media managers? Should I turn away from full time positions and try to go the freelance route? ",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1754094972.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal career story with questions; not a list, guide, or argument.",
    "composite_score": 3.317912995730947
  },
  {
    "score": 55,
    "title": "We drove 1.46 million clicks from Pinterest last year - and we don’t even run ads",
    "selftext": "No hacks.  \nNo bots.  \nNo large team behind all this.\n\nJust a really simple system:  \n→ We use Pinterest’s own keyword/traffic data  \n→ we write content *Pinterest users are already searching for*  \n→ we pin consistently without burning out\n\nWe spent months analyzing what makes some of our pins explode and others flop, looking at trends data, where we could find them ranking, etc.\n\nOnce we found a clear answer though, it was a little embarrassing that we didn’t see it earlier.\n\n**Pinterest literally** ***tells*** **you what people are searching for on their own site.**\n\nJust go to any idea page on Pinterest, and they show you how many monthly searches there are for that phrase.\n\nSo we built our entire Pinterest strategy around that.\n\nInstead of just *repurposing* Google-optimized blog content…\n\nWe *started* with Pinterest keyword data first.\n\nFor example, “home office ideas” is getting \\~400k searches/mo, so we don’t even guess if this is a good keyword to target or not (if we were in the decor niche).\n\nOnce we have a solid base of high-ranking keywords, we then *create content* (and pins) around that keyword.\n\nThen we optimized *everything* for it:  \n\\~ The pin graphic image  \n\\~ The title  \n\\~ The description  \n\\~ The blog post headlines\n\nWhen you combine Pinterest SEO with smart blog content and consistent pinning, traffic comes pretty naturally\n\nObviously not overnight.  \nBut week after week, following this method, it grows fairly steadily. \n\n**Remember** \\- Pinterest users aren’t aimlessly scrolling. They’re searching. With intent.\n\nAnd when your content matches what they’re *already* searching for, they start to click. A lot.\n\nThat’s why this works so well - whether you’re just getting started or feel stuck at 10 views a day.\n\nSo if you’re posting and not seeing traction, or haven’t started because it seems confusing, you’re probably ignoring the keyword part.\n\nAnd that’s the core of the whole game.\n\nAgain, we didn’t have a huge team.  \nWe didn’t start off pinning 50 pins a day.  \nWe don’t have ‘brand colors’ we primarily stick to or a one-size-fits all template we use.\n\nWe just knew (after learning) what our audience was searching for - and then gave it to them so that they could find it.\n\nFor one account, that led to:  \n• 49.5M+ impressions  \n• 1.46M outbound clicks  \n• 157,000 saves  \n• And more than 13.6M unique viewers\n\nAll in the last 12 months.\n\nSo if you’re not seeing results from Pinterest yet…\n\nthere’s probably just *one* piece missing.\n\nHappy to share more if it’s helpful.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1763412995.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.85,
    "category_rationale": "Offers a repeatable Pinterest strategy with explicit steps and execution details.",
    "composite_score": 3.216339277389844
  },
  {
    "score": 53,
    "title": "After helping 80+ clients grow on Instagram, here's what I learned (and what most people still get wrong)",
    "selftext": "When I first started managing Instagram accounts, I thought growth was all about good-looking posts and the right hashtags. Fast-forward to now after helping over 80 clients across different niches. I've realized it's the complete opposite.\n\nAlmost every client I worked with made the same mistakes before I guided them:\n\nPosting whenever they \"felt like it\" with no structure or rhythm.\n\nOverthinking the look of their feed instead of focusing on the message behind it.\n\nCopying big creators instead of understanding what made them connect in the first place.\n\nIgnoring their audience replying to comments, sure, but never starting real conversations.\n\nChanging direction too fast the moment a post underperformed.\n\nOnce we fixed those patterns and focused on consistency, storytelling, and engagement, everything changed. Their pages started to feel more personal, their content flowed better, and their engagement naturally grew no gimmicks, no fake followers.\n\nHere's what actually worked:\n\nShow up more than you show off. People follow presence, not perfection.\n\nThink human, not algorithm. If you hold attention, the algorithm follows.\n\nYour energy matters. If you're having fun creating, people feel it.\n\nEvery detail adds up. Bio, highlights, tone they all build your brand story.\n\nNow, when I scroll through new accounts, I can instantly tell who's about to grow and who's holding themselves back usually, it's just one or two small tweaks away.\n\nI've shared this because I see a lot of people putting in real effort but missing the small stuff that actually drives growth. If you ever feel stuck or unsure about what's keeping your page from moving forward, you can always reach out I don't mind sharing a few insights.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1763246804.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Central insights about growth factors and guidelines for Instagram without a strict step sequence.",
    "composite_score": 3.103257677831765
  },
  {
    "score": 53,
    "title": "Client wants to pay half what they used to and expects three times the content",
    "selftext": "Same client who paid us $4200/month last year for 3 posts a week. Now they're offering $2000/month and want daily content on Instagram, TikTok and LinkedIn.\n\nI said that doesn't work and they sent me like 8 competitor accounts posting multiple times daily. Why aren't you doing this.\n\nThose brands have teams. Or they're spending what you used to pay us per month just on production. Doesn't matter to them they want it.\n\nSo I'm looking at needing maybe 45 pieces of content this month. We can shoot 18-20 if weather's decent and nobody flakes. That covers half. What am I supposed to do for the rest.\n\nWhen they see iPhone photos and Canva templates they're going to lose their minds. Already know how that conversation goes.\n\nTalked to someone at an event a while back who said their clients keep asking why everything costs money now. Like they think you just type something and content appears. But those same clients freak out if anyone suggests their brand uses that stuff. Makes sense.\n\nThe visual content is what kills us. We can handle strategy and captions. It's getting enough images and video that don't look like garbage.\n\nwe're using APOB now for product images. Helps with the volume thing but still need real shoots for main content.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1764079750.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Describes pricing negotiations and workload; no clear steps or model.",
    "composite_score": 3.2940000167106405
  },
  {
    "score": 53,
    "title": "Can’t do this anymore... content creation is taking a toll on me.",
    "selftext": "Can’t do this anymore... content creation is taking a toll on me.  \nI feel fucking lost. I need to be real for a minute. I’m completely burning out managing content creation (YouTube &amp; Instagram) and could use some genuine advice.\n\nSome context - I started working as a social media manager at a startup 6 months ago. While I love the creative aspect of it and have ideas, I’m struggling to translate them into actual engaging content.\n\nThe thing that’s killing me isn’t even the workload, it’s the mental exhaustion of feeling like I’m making no impact.\n\nWhat’s been rough:\n\n* Posting on YouTube for 6 months with basically no growth.\n* Constantly second-guessing what my audience actually wants.\n* Struggling to post consistently.\n* Feeling overwhelmed juggling multiple apps (YouTube Studio, Instagram, Docs, Slack, Premiere, ChatGPT).\n* Every time I check analytics, I feel sick.\n* My bosses are supportive *for now*, but I see the look when I show them flat numbers.\n* Other brands make it look effortless, like they know some secret I don’t.\n\nI know I’m probably not alone in this, but it feels isolating. I scroll through other brands’ feeds and wonder what I’m missing.\n\nWould really appreciate advice from people who’ve pushed through this kind of burnout. Also open to any tools/frameworks that made the process less overwhelming.\n\nEDIT: Thank you for all the amazing responses already. Really means a lot to know I'm not alone in this. Learned some game-changing frameworks (focus on ONE platform first, value over volume, storytelling over algorithms). Also discovered some helpful tools (like Content calendars and feedblast.ai) for managing the content chaos. Going to stop trying to be everywhere and start making content I actually give a fuck about. Will make you proud, I promise!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1757798194.0,
    "media": null,
    "is_video": false,
    "num_comments": 48,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Emotional burnout confession with a plea for advice; tone leans toward venting.",
    "composite_score": 3.2899917998372255
  },
  {
    "score": 51,
    "title": "What are your most SUCCESSFUL TIPS to being an amazing Social Media Manager",
    "selftext": "I just started at a job in social media, I'm coming from TV and holy heck it's a hard job, I feel like I'm managing like a million things at once? \n\nHOW CAN I BECOME A BETTER SOCIAL MEDIA MANAGER? I feel like I'm falling behind, and nothing is working? \n\nI feel like I'm constantly creating, and I don't know how to be better? Maybe I'm just being hard on myself. What are your BEST tips to being in this career? Help!",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1749497003.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Request for tips on being a better social media manager; lacks substantive content.",
    "composite_score": 3.291184688381921
  },
  {
    "score": 51,
    "title": "Who's doing social media marketing for e-commerce? I think I'm missing something",
    "selftext": "I have a small e-commerce store that gets some sales, I have good reviews, I have a decent ad campaign with retargeting ads, and I get some sales from ads. But I only get a few sales a week.\n\nBut I want a few sales a day, and theoretically, I can just increase my ad spend 5x, but that feels like putting all my eggs in one basket. A very expensive basket.\n\nSo I've been learning about organic social media marketing, and like, I make content and I post stuff 2-3 times a week. I try to be mindful of my copy, but it's like I'm invisible. My engagement is super low, views are low. I'm still pushing forward, it’s disheartening sometimes, but I'm gonna figure it out. \n\nI think it's because my content doesn’t “connect” with the audience. I’m not hooking attention, or I’m not reaching the right audience. Or maybe I just don’t know how to get enough eyes on me. My blog content is completely crickets too. Am I just a boring writer?\n\nI think I’m missing something and I have no idea what it is. If anybody is a social media influencer and can leave me some tips, that’d be.\n\nI’ve also considered reaching out to agencies like Clectiq, Disruptive Advertising, and VaynerMedia for help with refining my social media strategy, but I’m curious to hear if anyone has experience working with them or similar agencies.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1745507282.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asks for tips on improving social media strategy; no substantive content.",
    "composite_score": 3.257395271994667
  },
  {
    "score": 51,
    "title": "Never working for a small business owner ever again",
    "selftext": "I’m working remotely for a small B2B product team, signing a 3-month contract with them at $2k per month. It takes me 6-8 hours per day to figure out everything, which I didn’t really expect. The whole working process lacks communication and clear guidelines. They’ve told me that I am not the most important thing, and the worst part is THEY DON’T RESPECT MY WORK AT ALL!\n\nEverything went well initially, and they paid me $1.5k per month for the digital marketing part. However, things changed after they added $500 more for the email marketing part. I had never done this job before, but they promised I wouldn’t have to worry about leads and sales. I accepted the offer hoping to learn something new and started assisting with their email campaigns. That’s when the nightmare began. No one prepared a lead list for me. I had to pay for extra tools like Leadsnavi and Mailchimp to push everything forward. Although they said they would cover the fees afterward, it’s still a waste of time for me to apply for the claims.\n\nMoreover, they expect me to take responsibility for sales! That is just crazy. Too many assholes over there. I’m considering quitting before the contract ends.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1741775112.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Strong venting about a difficult client and contract with moral disappointment.",
    "composite_score": 3.163037365809937
  },
  {
    "score": 50,
    "title": "I get paid to make memes, Ask Me Anything.",
    "selftext": "My [last post](https://www.reddit.com/r/SocialMediaMarketing/comments/zso3e7/ask_me_anything/) here blew up!\n\nFor those who don’t remember, I’m that guy making $30,000/month managing social medias for startups.\n\nI grew my [Twitter](https://twitter.com/iamjasonlevin) to 10,000+ and now startups pay me to manage their twitters, write content, and make memes for them. \n\nWhile doing this work, I’ve met a bunch of other professional meme makers. I’m even writing a [book](http://memesmakemillions.com) about the meme business. \n\nAsk me anything.",
    "subreddit": "SocialMediaMarketing",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1675890661.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Announcement of an AMA and self-promotion, with no clear list, steps, or argument.",
    "composite_score": 3.237208110898331
  }
]