[
  {
    "score": 236,
    "title": "Made a new rental building",
    "selftext": "In my last multiplayer playtrough I've made a building that turned out to be **very well received by the community** (ty &lt;3) as a rental in the workshop, it was designed to be **cheap and compact**, yet still provide everything I needed—even in the late game. However, once my company grew to 100s employees**,** it became **very cramped**.\n\nSince that first building was surprisingly popular, I decided to put **more effort** into this new one, both to make it look nice but also focusing on **space and comfort**. Another advantage of designing it as a **rental from the start** (rather than primarily as a blueprint) is that it frees me from some constraints like **space limitations and building costs.**\n\nThis new building offers plenty of space, an abundance of elevators, stairs, top-notch security, food dispensers, and extra amenities in every corner. Plus, all bathrooms include showers for cyclists. Here's the rooms breakdown:\n\n* **A central \"Aquarium\" Office** that comfortably hosts 24 team members**.**\n* **4 Single/Leader Offices** per floor for focused management.\n* **4 Small Offices** per floor (8 people each) for streamlined team collaboration.\n* **2 fully-equipped Meeting Rooms** per floor**.**\n* **A huge canteen** with plenty of resting spaces to keep your team refreshed.\n* **Underground server rooms,** including a small starter SCM room**.**\n* **3 huge Manufacturing Rooms** with **helipad integration** for high-output production.\n\nThat's it! I hope you like it. If you have any feedback or suggestions feel free to share, here are the links:  \n[New Building - \"Roundy Aquarium\"](https://steamcommunity.com/sharedfiles/filedetails/?id=3449600559)[Old building I mentioned - \"Lazy Square\"](https://steamcommunity.com/sharedfiles/filedetails/?id=3408738961)[All my Buildings Collection](https://steamcommunity.com/workshop/filedetails/?id=3449612692)\n\n",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 236,
    "downs": 0,
    "created_utc": 1742653739.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Bullet list of distinct building features/rooms.",
    "composite_score": 3.576293339506076
  },
  {
    "score": 125,
    "title": "Sky Park Towers",
    "selftext": "# WORKSHOP RELEASE: Sky Park Towers (Mega-Capacity Office Campus)\n\nReady to build a tech empire that stands out? Introducing **Sky Park**, a breathtaking, multi-tower office complex designed to be the ultimate headquarters for your booming software company in *Software Inc.*\n\nThis isn't just one building; it's an entire campus of sleek, modern towers that will redefine your city's skyline and give your employees an unparalleled work environment.\n\n# Why Sky Park is Your Next HQ:\n\nThis design is a high-capacity, premium HQ built for your multi-billion dollar empire.\n\n* **ICONIC ARCHITECTURE:** Sky Park features multiple elegant, curved towers with expansive glass exteriors. It's a true visual upgrade for your game world, radiating prestige and innovation.\n* **MAXIMUM FOOTPRINT:** Boasting a massive **$14,261** of total floor space, you have abundant room to house every division—from R&amp;D to marketing—in a spectacular setting.\n* **UNMATCHED CAPACITY:** Pre-configured and optimized to support an incredible **495 computer stations**! This is a massive, ready-to-deploy workspace that eliminates the setup headache.\n* **PREMIUM VALUE:** The in-game construction reflects the complexity and scale of a real-world asset, with an estimated building cost range of **$18.19 milion to $29.86 milion**. A true statement investment for your corporation.\n* **BRIGHT &amp; OPEN:** The extensive use of glass ensures that natural light floods every floor, creating a positive work atmosphere that boosts those all-important in-game environment scores.\n\n**Transform your** ***Software Inc.*** **experience.** Give your virtual employees the best, and watch your company thrive in the stunning environment of Sky Park!\n\n**Download Sky Park Towers on the Steam Workshop today!** [https://steamcommunity.com/sharedfiles/filedetails/?id=3617398494](https://steamcommunity.com/sharedfiles/filedetails/?id=3617398494)",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 125,
    "downs": 0,
    "created_utc": 1765747032.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Bullet-point feature list of Sky Park HQ; product description.",
    "composite_score": 3.423434562956682
  },
  {
    "score": 112,
    "title": "🏢 Workshop Showcase: Panorama Tower (Mega Office HQ)",
    "selftext": "**Tired of boring box buildings in your** ***Software Inc.*** **game?** 😴\n\nUpgrade your company's headquarters instantly with the **Panorama Tower**! This isn't just an office—it's a **massive, architectural marvel** designed for peak efficiency and jaw-dropping aesthetics in your game world.\n\n# ✨ Why Build with Panorama Tower?\n\nThis design is a **max-capacity, premium HQ** built for your multi-billion dollar empire.\n\n* **MAXIMUM SPACE:** A huge **14,472 sq m** footprint means you can house all your teams—from the smallest support group to the biggest AAA development team—all under one stylish roof.\n* **PEAK CAPACITY:** Pre-configured and optimized to support **326 ready-to-use computer stations**! Just download, plop it down, and staff up your company immediately.\n* **MODERN DESIGN:** Say goodbye to simple squares. The Panorama Tower features a stunning, **all-glass facade** that lets in incredible natural light (boosting those in-game environment ratings!) and looks *amazing* on the skyline.\n* **LUXURY FEEL:** Inspired by high-end, real-world corporate architecture, your virtual employees will be happier, more productive, and feel like they work for the top company in the world.\n\n# 💾 Workshop Details:\n\n**Footprint** | 14,472 sq m (Huge!)  \n**Max Workstations** | 326 Computers  \n**Estimated Cost** | $14M – $32M (Varies based on in-game components/furniture)  \n**Style** | Ultra-Modern, Glass, High-Rise\n\n**Ready to give your developers the HQ they deserve?**\n\n**➡️ Click to Download Panorama Tower on the Steam Workshop!** [https://steamcommunity.com/sharedfiles/filedetails/?id=3615345059](https://steamcommunity.com/sharedfiles/filedetails/?id=3615345059)\n\nIf you enjoy my work, consider supporting me on [buymeacoffee.com/majoroxch](http://buymeacoffee.com/majoroxch) &lt;3",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 112,
    "downs": 0,
    "created_utc": 1764513538.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.86,
    "category_rationale": "Bullet-point features and specs of Panorama Tower.",
    "composite_score": 3.145063445651429
  },
  {
    "score": 107,
    "title": "New Mod Added",
    "selftext": "[https://steamcommunity.com/sharedfiles/filedetails/?id=3493232122&amp;searchtext=Modern](https://steamcommunity.com/sharedfiles/filedetails/?id=3493232122&amp;searchtext=Modern)\n\njust sharing my new created mod after 3 years lol. subscribe if you want. will add and update for more\n\n🔧 Modern Softwares  \n**Modern Softwares** is a mod designed to *expand your software development experience* by introducing fresh content, features, and specialization options to your game.  \n  \n  \n  \n📦 What’s Included?  \nThis mod introduces **new types of software**, **expanded game genres**, and **an innovative specialization**, giving your gameplay more depth and creative flexibility.  \n  \n🆕 New Software Type:\n\n* **Game Engine** — Develop your own powerful engines to dominate the game development scene.\n\n🎮 New Game Genres:Break the limits of traditional genres! This mod adds a wide variety of **modern and popular game genres**:  \n  \n\n\n* 🛡️ **RPG** \n* 🧭 **Adventure** \n* 🔫 **FPS** \n* 🕹️ **Simulation** \n* ⚔️ **RTS** \n* 🧩 **Puzzle** \n* 👊 **Fighting** \n* 🏅 **Sports** \n* 🌲 **Survival** \n* 🎯 **Battle Royale** \n* 🏢 **Management** \n* 🏎️ **Racing** \n* 🌆 **City Builder** \n* 🐣 **Indie** \n* ⚔️ **MOBA**\n\nEach genre opens up *unique project possibilities*, allowing players to diversify their portfolios and development strategies.  \n  \n🤖 New Specialization:\n\n* **Artificial Intelligence (AI)** — Train your staff in this cutting-edge field and unlock *AI-enhanced software features*!\n\n  \n  \n🚀 To Be Added:Future updates will introduce even more software categories and content:  \n  \n\n\n* 📱 **Social Media Apps** \n* 💘 **Dating Apps** \n* 💰 **Finance Apps** \n* 🎲 **Betting Apps** \n* ➕ *...and more!*\n\n  \n  \n🚧 Development Note:This is an **ongoing project**, and more features, categories, and software types are planned for future updates!  \n  \n  \n  \n👍 Support the Mod!If you like the mod, don’t forget to **Rate**, **Favorite**, and **Share**!  \nFeedback and suggestions are always welcome in the **comments section**.",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1749055996.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "List of new mod features and updates.",
    "composite_score": 3.26092375548695
  },
  {
    "score": 107,
    "title": "AppLab Major Update Now Live!",
    "selftext": "🔗 [Steam Page](https://steamcommunity.com/sharedfiles/filedetails/?id=3467899025)\n\n🔗[Our Discord Server](https://discord.gg/dAvDPkkJQq)\n\nWe’re back with a major update that expands AppLab’s scope and brings your Software Inc. experience closer to modern-day tech development. This release not only simplifies the category structure for better clarity, but also adds two brand-new software types—pushing your virtual company into the AI era and beyond.\n\n\n\n🆕 What’s New:\n\n🧠 Large Language Models (LLMs) – Available from 2017\n\nDevelop cutting-edge AI systems like ChatGPT and GitHub Copilot! This new category includes:\n\n\n\nText Generation AI\n\n\n\nCode Assistant AI\n\n\n\nAI Chatbot Frameworks\n\n\n\nEach with advanced features like Transformer Networks, Fine-Tuning Modules, Prompt Editors, and scalable Inference Infrastructure.\n\n\n\n📱 Application Platforms\n\nA fresh category that brings modern, everyday software to life:\n\n\n\nProductivity Tools\n\n\n\nE-Commerce Platforms\n\n\n\nNews Aggregators\n\n\n\nVirtual Event Hosting\n\n\n\nFitness &amp; Wellness Apps\n\n\n\nDesigned with realistic features like cross-platform support, cloud sync, business integrations, and more.\n\n\n\nThese additions come with full mod compatibility and won’t interfere with vanilla gameplay—just expand it.\n\n\n\n🔮 What’s Coming Next:\n\nWe’re currently exploring the addition of VR (Virtual Reality) software as the next major content drop. A poll will be posted in the Discord server to decide if this feature should be added to AppLab or released as a standalone mod. Most likely, it will be included as part of AppLab for a unified experience.\n\n\n\n⚖️ Upcoming Balance Updates:\n\nWe’re also working on balancing tweaks to fine-tune development difficulty, progression, and profitability across software types. These adjustments aim to keep gameplay fun, rewarding, and appropriately challenging.\n\n\n\nThanks for your continued support and feedback!\n\nJoin the discussion and help shape future updates in the community Discord.",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1750771839.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Patch notes styled as a feature update with enumerated items.",
    "composite_score": 3.3005143785107625
  },
  {
    "score": 95,
    "title": "Beta 1.8.12 officially out",
    "selftext": "[Steam Post](https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1789580505465147)  \n#Full patch notes  \n**Changes**  \n  \n* Player can now pick subsidiary product specialization and subsidiaries will no longer count towards AI company limit in the market  \n* Project management can now handle porting tasks  \n* Added ability to pick cooldown between projects for project management  \n* Increased Phone and Console prices  \n* Rebalanced AI research strategy, modified by difficulty, where the highest difficulty will have almost everything patented  \n* Rebalanced AI company expenses to even out bankruptcies between company types  \n* A lot of columns have an added totals row in the list panels, which can be switched between sum, mean, median, min, max and range, depending on its value  \n* You can now choose to disable pause or force max time speed when day time limit is up in multiplayer  \n* The game will now try to auto-resolve a bankruptcy, if possible, when the player has neglected the bankruptcy warning  \n* All future save files will now include a company logo in the thumbnail for easier identification  \n* Added warning when a printer is blocked because of other boxes on the conveyor belt  \n* All lights now become greyscale when activating a data overlay  \n* Surveillance station can now be repaired while in use by security staff  \n* Added a send home button to the team window, useful if you've changed a team's schedule and don't want them to finish their current shift  \n* You can now place company logos on walls in basements  \n* To increase save stability, the Tools and OSs variables of the SoftwareProduct class have been deprecated in favor of various getter and setter methods, so some code mods might break. Look for the Add, Get, Remove, Has and Count methods, if your mod breaks  \n  \n**Fixes**  \n  \n* Fixed cooks putting their arms inside their heads when zooming out...  \n* Fixed bug that could make AI and project management order a huge amount of copies of an archived product  \n* Fixed mismatched tooltips in product detail window  \n* Fixed police drone permanently breaking rented buildings  \n* Fixed game not updating alpha phase team assignments in design phase when renaming a team  \n* Some optimization fixes for large saves that have a lot of lamps and many friendships per employee across teams  \n* Fixed overlapping text on some tasks in grouped task mode  \n* Fixed event timeline in product detail window not being consistent between tabs when units, income and reputation graphs end at different times  \n* Fixed labels not being aligned in role management window when UI size is not 100%, 150% or 200%  \n* Fixed project management porting tasks sticking around in project management window  \n* Mentors and social leaders no longer add to the noise level of their target's environment (but adds more to everyone else's\\)  \n* Fixed text in lists bleeding into neighbour columns  \n  \n  \n#Patch notes for Beta 1.8.12  \n**Changes**  \n  \n* Player can now pick subsidiary product specialization and subsidiaries will no longer count towards AI company limit in the market  \n* Increased Phone and Console prices  \n* Rebalanced AI company expenses to even out bankruptcies between company types  \n* You can now place company logos on walls in basements  \n  \n  \n**Fixes**  \n  \n* Fixed labels not being aligned in role management window when UI size is not 100%, 150% or 200%  \n* Fixed project management porting tasks sticking around in project management window  \n* Mentors and social leaders no longer add to the noise level of their target's environment (but adds more to everyone else's\\)  \n* Fixed text in lists bleeding into neighbour columns",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1738063860.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.8,
    "category_rationale": "Patch notes with changes and fixes (enumerated items).",
    "composite_score": 3.334331224367531
  },
  {
    "score": 92,
    "title": "🏢 Prime Office Space: PROXIMA – Where Modernity Meets Productivity",
    "selftext": "Looking for an office that inspires? Proxima Towers is where modern design meets maximum productivity!\n\nThis landmark building features: • 10,352 sq m of beautifully designed, light-filled space. • Ready to support 302+ employees with sleek, ergonomic workstations. • Stunning modern architecture—all glass façades, clean lines, and a prime location. • The ideal setting to attract top talent and elevate your brand image.\n\n💰 Smart Investment: Built to the highest standards, with an estimated value between €10.3M and €21.8M.\n\nYou can download this mod on Steam workshop, enjoy ;)\n\nIf you enjoy my work, consider supporting me on [buymeacoffee.com/majoroxch](http://buymeacoffee.com/majoroxch) &lt;3",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 92,
    "downs": 0,
    "created_utc": 1763588494.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.83,
    "category_rationale": "Bullet list of Proxima Towers specs and cost.",
    "composite_score": 3.3578597490303492
  },
  {
    "score": 88,
    "title": "Software Inc. goes 64-bit",
    "selftext": "[Steam Post](https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5747233970426003680)  \nWith 64-bit numbers, you should see less errors when handling large sums of money. Compatibility with 32-bit systems won't change. Older saves will be converted automatically and will no longer work in older versions of Software Inc.  \n  \n    \n[Image](https://steamcdn-a.akamaihd.net/steamcommunity/public/images/clans//8600182/cf4f9459538d091f53fb3fb7e8cc2afbb8c542a4.png)    \n  \nThis update also introduces a way to centralize kitchens using conveyor belts!  \n  \n#Patch notes  \n**Changes**  \n  \n* Moved from 32-bit to 64-bit decimal numbers for most money and simulation calculations to improve precision and stability  \n* Added food input and output for conveyor belts so kitchens can be centralized (Unlocked by completing the canteen task\\)  \n* Expanded random name generation for more product categories and companies  \n* Reduced the effect on colleagues when their friends retire amicably  \n* Luxury food can now only be delivered by cooks  \n* Employees now get a mood buff when eating cooked food  \n* Added prompt when prematurely ending network deal or hiring employee that is less than 3 years from retirement  \n* Furniture placed on an exterior wall can now be placed up against the edge of the wall  \n* Food that is thrown out due to expiring has been added to the bills breakdown of the finance window as food waste  \n* When trading lead designer owned IP, their actual cut is now listed in the prompt  \n* Menu cats are now pettable  \n  \n**Fixes**  \n  \n* Fixed subscription income not scaling with days per month  \n* Fixed incorrectly receiving platinum awards  \n* Fixed house shader  \n* Fixed PC addons being in the wrong location after moving and rotating table  \n* Fixed Unity causing imperceptible incorrect implicit conversion from float to byte colors  \n* Fixed old well maintained computers giving employees a big boost  \n* Fixed bug where the same issue notification could pop up multiple times if it was raised and fixed multiple times in the same frame  \n* Fixed staff arriving multiple times on the same day if they are set to leave when finished  \n* Multiplayer stability fix for getting stuck at midnight  \n* Fixed moods fading too quickly when employees are home",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 88,
    "downs": 0,
    "created_utc": 1716044424.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.8,
    "category_rationale": "Patch notes and changes (enumerated items) about 64-bit update.",
    "composite_score": 3.048875008812922
  },
  {
    "score": 85,
    "title": "Building inspiration",
    "selftext": "I saw a post from a user here asking how to get inspiration for building HQs. I'm not one to say anything... but here are some of my inspirations and constructions.\n\nI usually do some research on HQs from big companies like Nvidia, Google, Apple, Oracle... you get the idea.\n\nThen I do some research on modern buildings around the world, office buildings known for being modern.\n\nI do a lot of research on Google Maps and search for images like “office building hall,” “office building open space,” and “modern office building elevators.”\n\nAlways with this kind of mindset.",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1759834827.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Provides guidance and rationale on how to find design inspirations.",
    "composite_score": 2.9230590786033988
  },
  {
    "score": 84,
    "title": "Beta 1.8.4 out on unstable branch",
    "selftext": "[Steam Post](https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6250522009509201685)  \n[Click here to see how to join the Unstable branch.](https://cdn.akamai.steamstatic.com/steamcommunity/public/images/clans/8600182/25ae553d2719e68f310e4af62bd3e2c05283ede6.png)  \nThis update has a lot of big balancing changes that are likely to cause some issues. Feel free to use the in-game reporting tool to report any issues you have, particularly with project management, publishers, IT and maintenance balancing, and employee effectiveness.  \n  \n#Patch notes for Beta 1.8.5  \n**Changes**  \n  \n* The rent overlay can now toggle the player owned color to show only grouping, to reduce confusion about the rent room accessibility error  \n  \n  \n**Fixes**  \n  \n* Fixed error when skipping to next day with a project mangement task with no leader assigned  \n* Fixed tasks sometimes not being properly removed from project management  \n* Reduced founder stress by 25%, since they don't take food or toilet breaks to calm down  \n* Fixed getting publishing deals requiring release before current date  \n* Fixed being able to get publishing deals even if disabled in difficulty options  \n* Fixed handling of add-on printing for project management  \n* Fixed bug that would incorrectly report on physical sales for subscription-based products and add-ons causing over-ordering by AI  \n  \n  \n  \n#Patch notes for Beta 1.8.4  \n**Project management**  \n  \n* Replaced project management point system with a mistake system  \n* You can now add previous products to a project management task to automate existing tasks  \n* You can now let project manager handle ordering copies or setting print job maximum every day  \n* The amount of projects that have active tasks for project management now increases stress for leader  \n  \n**Publishers**  \n  \n* You can now pick between different publishing deals  \n* Successful publishing deals now increases relationship with a publisher which makes them give better deals  \n* Game now adds reputation from publisher in sales and marketing calculations, but publisher takes 75% of fans from product  \n* Publishers now have a recoup target before lowering their royalty cut  \n* Publisher funding is now increased if marketing or printing is disabled  \n* You can now get a publisher after a product has released or publisher has closed down  \n* Added detailed publisher info in product detail window  \n  \n**Other changes**  \n  \n* There's a new IT-support staff related furniture that can be unlocked by owning a subsidiary  \n* Founders can now get stressed  \n* Employees no longer wait their turn when they are queued for something if they are closer, thereby heavily increasing food and toilet throughput  \n* Employees will now wait outside bathroom if it is occupied, instead of just not using the toilet at all  \n* Added a minimum 6 month grace period before spawning a company in an under served market, to give the player some reaction time  \n* You can now procure more gold, silver and copper at a time, and the size of the current gold object has been heavily reduced as a result  \n* How many bugs an employee can fix is no longer based on the most skilled person on the same team, but the most skilled person in any team assigned to the task  \n* Prints per month column in manufacturing window now accounts for contracts and deals being completed  \n* Improved manufacturing stats  \n* Burglar and police drone warnings are now more prominent and you can auto-follow the action  \n* The contract window has been split into available and completed tabs for less visual clutter  \n* The game now officially supports objects that can both be snapped to something or placed on the floor directly  \n* You can now find locked furniture when searching for it specifically, to avoid confusion as to why some furniture is missing  \n  \n**Fixes**  \n  \n* Fixed furniture search algorithm not properly taking verticality into account, making employees sometimes choose furniture far away on other floors  \n* Fixed bug where employees would sit sideways in their chair after having gone to an empty vending machine  \n* Fixed solar panel and leather couch not working in any data overlay  \n* Fix for elevators becoming stuck because they think somebody hasn't properly entered them yet  \n* Made it so the BetterSoftwareDevelopment mod can't cancel digital distribution platform support  \n* Fixed not being able to search for logos with special characters  \n* Fixed Walk Instead trait not actually applying properly  \n* Fixed long standing bug that made IT and maintenance repair tasks take zero seconds, they now take between 1 and 20 in-game minutes, depending on object complexity  \n* Fixed original price of precious metals not loading properly",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1726054262.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Patch notes with changes and fixes presented as a list.",
    "composite_score": 3.3506302661253957
  },
  {
    "score": 84,
    "title": "OMEGATECH #weareomega",
    "selftext": "OmegaTech Campus is the most brilliant project of its founder, Gilbert Rat, who manages his empire from the most luxurious office at the top of the Core building, where the most brilliant projects are born.\n\nOmegaTech Campus currently has modern, state-of-the-art buildings dedicated to support and marketing, a modern data center building, and a research building nearing completion that will house more than 100 programmers, designers, and artists for future projects. We also have a growing factory where various prototypes are produced, as well as all OmegaTech physical items.\n\nOmegaTech, founded in 1990 in a humble garage, now has 18 years of life in a modern campus and successes such as Virushunter 1.0, Virushunter 2.0, Virushunter 3.0, Virushunter 4, Virushunter 5, and the future banger OmegaVirushunter 6.  \nNot to forget other office markets such as OmegaPages, OmegaSutido 2D in the video market, and OmegaZIP.\n\nOmegaTech is currently the largest online store market with OmegaStore, where it sells its products as well as those of its competitors.\n\nIn the pipeline is what will be the biggest revolution in the mobile phone market, the OmegaPhone, and in the video game console market, the OmegaGameBox, which will be a strong bet in new markets.\n\nSome say that Gilbert Rat is a visionary, perhaps the man of the century, but his employees know him as Sir Gilbert the Rat.\n\nI hope you like it.\n\n(UPDATE)\n\nGuys, I've finished the research building.\n\n[OMEGATECH Research Building](https://www.reddit.com/r/SoftwareInc/comments/1nlap2t/omegatech_research_building_weareomega/)",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1758211017.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional narrative detailing OmegaTech's projects/assets; not a list, no steps or model.",
    "composite_score": 3.340528573081252
  },
  {
    "score": 81,
    "title": "Patch notes for Beta 1.8.17",
    "selftext": "[Steam Post](https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1800357164499735)  \nThis update is a bit smaller than usual, as work is mostly focused on the campaign mode currently.  \n  \n**Beta 1.8.18 has a workaround for the new grass system failing on certain Linux and very few Windows systems**  \n  \n#Patch notes for Beta 1.8.17  \n**Changes**  \n  \n* The bus stop has been reworked so the starting plot reaches the sidewalk on all new maps  \n* Updated all employee names (Delete the names txt files in the Mods folder before launching to get the updated names\\)  \n* HR now differentiates between education and hiring when picking specializations  \n* Precious metals are now sold automatically when moving company  \n* Staff schedule changes now make staff come in on the same day if possible  \n* The employee window will now show an icon for each role an employee is actively away taking courses for  \n* Added specialization levels required for a project to the pie charts in the design document window  \n* Made employees more likely to pick subway going home, if they used subway to arrive  \n* Saving the game manually will now try to overwrite the last manual save before trying to auto save  \n* Player will now be warned if failure to file a tax report would result in a lawsuit, due to illegal activity during the year  \n  \n  \n**Fixes**  \n  \n* Fixed cases where undoing construction would bring back furniture in the wrong order causing them to disappear  \n* Fixed some money inputfields not working with currency short form enabled  \n* Fixed employees being able to get stuck in the air specifically on 1st floor below a ramp  \n* Fixed courier shipping capacity estimate being wrong with more days per month  \n* Fixed company stock selling slider being stuck at max in some cases  \n* Fixed grass not consistently growing back, based on game speed and time skipped every day  \n* Employees with designer as a secondary role will now still have their lead design stats shown in the UI  \n* Fixed game not being able to load mods that only contained name generators",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 81,
    "downs": 0,
    "created_utc": 1748172659.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Patch notes presented as a bullet list of changes and fixes; items constitute a list.",
    "composite_score": 3.213285528537135
  },
  {
    "score": 81,
    "title": "New content update out",
    "selftext": "[Steam Post](https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6474562312195449163)  \n    \n[Image](https://steamcdn-a.akamaihd.net/steamcommunity/public/images/clans//8600182/680795307349e1997c246d2b16be7f2a8869611c.png)    \n  \n#Patch notes  \n**Content**  \n  \n* New chairs  \n* New lamps  \n* New big plants  \n* New desk  \n* Overhauled cubicle wall  \n* Overhauled doors  \n* Bigger version of radiator and ventilation unit  \n* New car model starting from 1990s  \n* Expanded random name generation for some product categories  \n  \n**Changes**  \n  \n* Overhauled how employees react to wage changes, making them continually unsatisfied with getting less than they want  \n* Added option to force lights to be always on  \n* Placing unfurnished blueprints now retains structural elements, such as elevators and stairs  \n* Added ability to rebind key to disable grid in build mode  \n* Toggling first person mode now auto enables ceiling mesh generation and regenerates all room meshes  \n* Added new State column in employee overview window to show when an employee will arrive again  \n* You now get a chat message from the game about kicking old players if someone can't join a full game with less than 4 players connected  \n* Added ability to limit future jumps in random name generator by prefixing jumps with a '-'  \n  \n**Fixes**  \n  \n* Bug regarding building paths in multiplayer would add paths on top of paths every load causing huge performance issues (Paths will be reset in old multiplayer saves after this patch and players will only be able to see their own paths going forward\\)  \n* Better handling of secondary tasks when max task limit is enabled  \n* Fixed days per month setting not being retained when starting a new company in the same save  \n* Fixed stock notification and archive settings for products not being loaded for clients in multiplayer  \n* Fixed task limit being reset when renaming a team  \n* Fixed ceilings not being generated properly when enabled since atrium update  \n* Fixed old buildings being loaded in when cancelling company restart and starting new game  \n* Changed how fire inspector checks for escape violations so rooms with missing stair connections are always marked correctly  \n* Possible fix for LAN mode being nearly unplayable on some specific network configurations",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 81,
    "downs": 0,
    "created_utc": 1713182435.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Content update patch notes enumerating new content and changes.",
    "composite_score": 3.1409351071033793
  },
  {
    "score": 78,
    "title": "The Rise and Fall of Mitch Maximus, Tax Criminal Extraordinaire",
    "selftext": "Mitch is a white collar criminal. Mitch built a giant vault for his gold bars. Then he built another vault and buried his personal lair within waves of precious metals. But apparently a windowless building still was too \"visible\" for his mountainous lucre. Still, he ignored their warnings. Then, the audit came. He was found guilty of tax fraud. Droves of police came to despoil him. One by one, ore was carried off. Carrier drones blasted blasted through the walls. Agents combed every last corner. His castle was raized. Until finally, there was nothing left.",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1683183163.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Narrative about a tax fraud figure with moral judgement but no actionable steps or model.",
    "composite_score": 3.235672720818282
  },
  {
    "score": 74,
    "title": "OmegaTech Jungle Studios #WeAreOmega #FromOmegaToTheJungle #InnovationByOmega #GilbertRat",
    "selftext": "January 2010 marks the 40th anniversary of our great leader Gilbert Rat, but also the inauguration of the latest video game studio on the market. Introducing Jungle Studios.\n\nA 10-story building ready to go with all the latest technology on the market, equipped for teams of designers, programmers, and artists. This is where the best video games the world has to see will be born, as always, all created and conceived by our great and almighty leader Gilbert Rat.\n\nJungle Studios was born inside the OmegaTech Campus, and its inauguration was attended by several notable figures who came from all over the world to pay homage to our great leader, names such as Hideo Kojima, Sid Meier, and Markus “Notch” Persson, all of whom were welcomed with champagne and delicious cookies.\n\nOmegaTech is currently in the HR market to fill the teams and at Ikea to buy the missing furniture.\n\nI hope you like it.\n\n(It's still a work in progress, several rooms still need to be furnished, and there are certain colors/textures that don't quite match.)",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1759316202.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Promotional post about a new studio, no list or instructions.",
    "composite_score": 2.8411218907515314
  },
  {
    "score": 72,
    "title": "Patch notes for Beta 1.8.11",
    "selftext": "[Steam Post](https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1789580505302956)  \nThis update will be on the unstable branch for a couple of days, since it makes changes to the save system.  \n  \n[Click here to see how to join the Unstable branch.](https://cdn.akamai.steamstatic.com/steamcommunity/public/images/clans/8600182/25ae553d2719e68f310e4af62bd3e2c05283ede6.png)  \n  \n**Changes**  \n  \n* Project management can now handle porting tasks  \n* Added ability to pick cooldown between projects for project management  \n* Rebalanced AI research strategy, modified by difficulty, where the highest difficulty will have almost everything patented  \n* A lot of columns have an added totals row in the list panels, which can be switched between sum, mean, median, min, max and range, depending on its value  \n* You can now choose to disable pause or force max time speed when day time limit is up in multiplayer  \n* The game will now try to auto-resolve a bankruptcy, if possible, when the player has neglected the bankruptcy warning  \n* All future save files will now include a company logo in the thumbnail for easier identification  \n* Added warning when a printer is blocked because of other boxes on the conveyor belt  \n* All lights now become greyscale when activating a data overlay  \n* Surveillance station can now be repaired while in use by security staff  \n* Added a send home button to the team window, useful if you've changed a team's schedule and don't want them to finish their current shift  \n* To increase save stability, the Tools and OSs variables of the SoftwareProduct class have been deprecated in favor of various getter and setter methods, so some code mods might break. Look for the Add, Get, Remove, Has and Count methods, if your mod breaks  \n  \n**Fixes**  \n  \n* Fixed cooks putting their arms inside their heads when zooming out...  \n* Fixed bug that could make AI and project management order a huge amount of copies of an archived product  \n* Fixed mismatched tooltips in product detail window  \n* Fixed police drone permanently breaking rented buildings  \n* Fixed game not updating alpha phase team assignments in design phase when renaming a team  \n* Some optimization fixes for large saves that have a lot of lamps and many friendships per employee across teams  \n* Fixed overlapping text on some tasks in grouped task mode  \n* Fixed event timeline in product detail window not being consistent between tabs when units, income and reputation graphs end at different times",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1737633667.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Patch notes with enumerated changes; list-style.",
    "composite_score": 3.1265192026995683
  },
  {
    "score": 65,
    "title": "Patch notes for Beta 1.8.19",
    "selftext": "[Steam Post](https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1805431065498153)  \n**Beta 1.8.21 fixes more deadlock issues during construction**  \n  \n#Patch notes for Beta 1.8.20  \n**Fixes**  \n  \n* Fixed possible deadlocks that could freeze game when deleting or undoing furniture construction  \n* Force recompile code mods, to fix broken function references  \n  \n  \n#Patch notes for Beta 1.8.19  \n**Changes**  \n  \n* You can now manually update frameworks, each update takes longer than the last  \n* Frameworks now still boost development speed for features using newer tech, but at a reduced rate  \n* Framework speed boosts now also apply to product updates  \n* You can now iterate on the last peer review if it has not already been done and you can promote to beta from the peer review window  \n* You can now see competitor products on the market triangle in the design document window and right click to see details  \n* Server lists are now sorted by name  \n* Clarified how many boxes a courier can transport per month in hiring desciption  \n* Player will receive a notification about awards, if they have permanently disabled the prompt  \n  \n  \n**Fixes**  \n  \n* Updating a product will no longer update the framework that was developed with it  \n* Fixed list sort not being stable with filters active, i.e. sorting by one column and then another would jumble the first sort after a second or so  \n* Fixed very rare race condition that could break path finding  \n* Fixed post marketing task using last month's income in description with more days per month  \n* Fixed company logo not being visible on lower floors with walls lowered  \n* Fixed losing reputation for a development deal when the IP is bought out, cancelling the deal  \n* Fixed planned burglary still being carried out after disabling burglaries  \n* Fixed not being able to change hardware design type because buttons were 1 pixel tall  \n* Fixed lists bugging out when using vertical scroll bar  \n* Fixed some grabbable items not being visible in first person mode  \n* Fixed missing SFX in first person mode",
    "subreddit": "SoftwareInc",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1753192844.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Patch notes with multiple sections and bullet fixes; list-style.",
    "composite_score": 3.1716039268698313
  }
]