[
  {
    "score": 1465,
    "title": "If only someone told me this before my 1st startup",
    "selftext": "##1. Validate idea first.  \nI wasted at least 5 years building stuff nobody needed.  \n##2. Kill your EGO.  \nIt's not about me, but the user. I must want what the user wants, not what I want.  \n##3. Don't chaise investors, chase users, and then investors will be chasing you.  \n##4. Never hire managers.  \nOnly hire doers until PMF.  \n##5. Landing page is the least important thing in a startup.  \nPick an average template, edit texts and that's it.  \n90% of the users will end up on your site coming from a blog article, social media post, a recommendation. Which means they have the intent. No need to \"convert\" them again.  \n##6. Hire only fullstack devs.  \nThere is nothing less productive in this world than a team of developers.  \nOne full stack dev building the whole product. That's it.  \n##7. Chase global market from day 1.  \nIf the product and marketing are good, it will work on the global market too, if it's bad, it won't work on the local market too. So better go global from day 1, so that if it works, the upside is 100x bigger.  \n##8. Do SEO from day 2.  \nAs early as you can. I ignored this for 14 years. It's my biggest regret.  \n##9. Sell features, before building them.  \nAsk existing users if they want this feature. I run DMs with 10-20 users every day, where I chat about all my ideas and features I wanna add. I clearly see what resonates with me most and only go build those.  \n##10. Hire only people you would wanna hug.  \nMy mentor said this to me in 2015. And it was a big shift. I realized that if I don't wanna hug the person, it means I dislike them. Even if I can't say why, but that's the fact. Sooner or later, we would have a conflict and eventually break up.  \n##11. Invest all money into your startups and friends.  \nNot crypt0, not stockmarket, not properties.  \nI did some math, if I kept investing all my money into all my friends’ startups, that would be about 70 investments.  \n3 of them turned into unicorns eventually. Even 1 would have made the bank. Since 2022, I have invested all my money into my products, friends, and network.  \n##12. Post on Twitter daily.  \nI started posting here in March this year. It's my primary source of new connections and traffic.  \n##13. Don't work/partner with corporates.  \nCorporations always seem like an amazing opportunity. They're big and rich, they promise huge stuff, millions of users, etc. But every single time none of this happens. Because you talk to a regular employees there. They waste your time, destroy focus, shift priorities, and eventually bring in no users/money.  \n##14. Don't get ever distracted by hype, e.g. crypt0.  \nI lost 1.5 years of my life this way.  \nI met the worst people along the way. Fricks, scammers, thieves. Some of my close friends turned into thieves along the way, just because it was so common in that space. I wish this didn't happen to me.  \n##15. Don't build consumer apps. Only b2b.  \nConsumer apps are so hard, like a lottery. It's just 0.00001% who make it big. The rest don't.  \nEven if I got many users, then there is a monetization challenge. I've spent 4 years in consumer apps and regret it.  \n##16. Don't hold on bad project for too long, max 1 year.  \nSome projects just don't work. In most cases, it's either the idea that's so wrong that you can't even pivot it or it's a team that is good one by one but can't make it as a team. Don't drag this out for years.  \n##17. Tech conferences are a waste of time.  \nThey cost money, take energy, and time and you never really meet anyone there. Most people there are the \"good\" employees of corporations who were sent there as a perk for being loyal to the corporation. Very few fellow makers.  \n##18. Scrum is a Scam.  \nIf I had a team that had to be nagged every morning with questions as if they were children in kindergarten, then things would eventually fail.  \nThe only good stuff I managed to do happened with people who were grownups and could manage their stuff. We would just do everything over chat as a sync on goals and plans.  \n##19. Outsource nothing at all until PMF.  \nIn a startup, almost everything needs to be done in a slightly different way, more creative, and more integrated into the vision. When outsourcing, the external members get no love and no case for the product. It's just yet another assignment in their boring job.  \n##20. Bootstrap.  \nI spent way too much time raising money. I raised more than 10 times, preseed, seed, and series A. But each time it was a 3-9 month project, meetings every week, and lots of destruction. I could afford to bootstrap, but I still went the VC-funded way, I don't know why. To be honest, I didn't know bootstrapping was a thing I could do or anyone does.  \nThat's it.\n\nWhat would you wish to have known before you started your startup journey?",
    "subreddit": "startups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1465,
    "downs": 0,
    "created_utc": 1703445216.0,
    "media": null,
    "is_video": false,
    "num_comments": 372,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Numerous numbered startup tips presented as a curated list.",
    "composite_score": 5.179488386209453
  },
  {
    "score": 999,
    "title": "Sold my startup for mid 7-figures",
    "selftext": "Howdy!\n\nA few months ago we finalized the acquisition of the startup for a mid 7 figure. Giving I owed \\~33%, I landed on a low 7-figure myself.   \n  \nYou don't necessarily need a VC. You don't need a \"Go big or go home\" kind of mentality and build a unicorn or go bankrupt. Leave that to second or even third time founders. \n\nYou can build something smaller, and sell it to a competitor for a fair price. I don't know your bank account, but in mine a 7-figure changed completely my life.\n\nMost of this sub is made by first time founders. If I were you I would not chase VCs, IPO or multi-billion acquisition. \n\nI would focus on a small exit ASAP. Change your life and repeat. \n\nFor those interested, we \"launched\" in 2020 within R&amp;D/intelligence with a platform that would create predictions based on different weights on your non-structured data. We were about to close two deals of €600k/ARR when a competitor just landed an acquisition term sheet in our inboxes (after we had 2 calls and declined a partnership). \n\nEdit: syntax. I'm not a native. ",
    "subreddit": "startups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 999,
    "downs": 0,
    "created_utc": 1721678807.0,
    "media": null,
    "is_video": false,
    "num_comments": 253,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Personal narrative with insights about exiting a startup and VC mindset.",
    "composite_score": 4.922416858309969
  },
  {
    "score": 986,
    "title": "My first startup failed – Here are 10 things I wish I'd do differently",
    "selftext": "I dedicated two years of my life to a startup that ultimately failed. We were trying to build a mobile app which would simplify the life of people with diabetes. The whole journey was interesting but also a tough experience, so here are the mistakes I made and the valuable lessons I learned:\n\n1. **All founders were technical:**\n   * We were three founders, all technical, with no experience or motivation for marketing and sales.\n   * A team needs balance. You can’t ignore the business side of things.\n2. **Overcomplicating the MVP:**\n   * We built way too many features and developed the app simultaneously for both Android and iOS.\n   * It would have been much better to validate the idea on a single platform and focus on one core feature first.\n3. **No competition isn’t a good thing:**\n   * We did a research of competitors but we haven't find any. We thought a lack of competitors was a sign of opportunity, but it should be a warning sign instead. If no one else is in the space, it most of the time means there’s no demand for a product like this.\n4. **Skipping idea validation and feedback:**\n   * We didn’t validate our idea or gather feedback from potential users.\n   * If we’d spent a few weeks talking to people, we could’ve identified their real pain points and built something they actually needed.\n5. **Ignoring monetization:**\n   * We didn’t think about how we’d make money at all. We should think about that from the start.\n6. **No dedicated marketing effort:**\n   * We spent hundreds of hours building the product but no one was focused on marketing.\n   * You need someone on the team who would put as much effort into marketing as the developers do into building.\n7. **Changing habits of your users is extremely hard:**\n   * Our product required users to change their routines which is a huge challenge. A better approach would’ve been solving a problem they already had, not trying to create new behaviors.\n8. **Wasting money on tools and infrastructure:**\n   * We spent quite a lot of money on hosting, email services, certifications, legal entity creation and servers. If we'd do a better research, we could get a lot of these tools for free or at least cheaper.\n9. **No energy for marketing after launch:**\n   * We spent so much time and energy developing the product that by the time we launched, we were exhausted and demotivated.\n   * Marketing is critical at launch, but we didn’t have the energy to start when it mattered most.\n10. **Underestimating the importance of networking:**\n\n   * We didn’t actively seek out mentors, advisors, or partnerships that could have guided us or opened doors.\n   * Building connections with the people that are already in the industry might have helped us validate our idea and find early adopters.\n\n**Key takeaways:**  \nBalance your team. Keep your MVP simple. Talk to users early. Dedicate as much effort to marketing as you do to development, and don’t underestimate the power of networking.\n\nI hope these lessons help you avoid same mistakes that I've made.",
    "subreddit": "startups",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 986,
    "downs": 0,
    "created_utc": 1732283284.0,
    "media": null,
    "is_video": false,
    "num_comments": 198,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Ten explicit mistakes/lessons learned presented as a numbered list.",
    "composite_score": 4.87874369087449
  },
  {
    "score": 960,
    "title": "From Running a $350M Startup to Failing Big and Rediscovering What Really Matters in Life ❤️",
    "selftext": "This is my story.\n\nI’ve always been a hustler. I don’t remember a time I wasn’t working since I was 14. Barely slept 4 hours a night, always busy—solving problems, putting out fires.\n\nAfter college (LLB and MBA), I was lost. I tried regular jobs but couldn’t get excited, and when I’m not excited, I spiral. But I knew entrepreneurship; I just didn’t realize it was an option for adults. Then, in 2017 a friend asked me to help with their startup. “Cool,” I thought. Finally, a place where I could solve problems all day. It was a small e-commerce idea, tackling an interesting angle. I worked 17-hour days, delivering on a bike, talking to customers, vendors, and even random people on the street.\n\nThings moved fast. We applied to Y Combinator, got in, and raised $18M before Demo Day even started. We grew 100% month-over-month. Then came another $40M, and I moved to NYC. Before I knew it, we had 1,000 employees and raised $80M more.\n\nI was COO, managing 17 direct reports (VPs of Ops, Finance, HR, Data, and more) and 800 indirect employees. On the surface, I was on top of the world. But in reality, I was at rock bottom. I couldn’t sleep, drowning in anxiety, and eventually ended up on antidepressants.\n\nThen 2022 hit. We needed to raise $100M, but we couldn’t. In three brutal months, we laid off 900 people. It was the darkest period of my life. I felt like I’d failed everyone—myself, investors, my company, and my team.\n\nI took a year off. Packed up the car with my wife and drove across Europe, staying in remote places, just trying to calm my nervous system. I couldn’t speak to anyone, felt ashamed, and battled deep depression. It took over a year, therapy, plant medicine, intense morning routines, and a workout regimen to get back on my feet, physically and mentally.\n\nNow, I’m on the other side. In the past 6 months, I’ve been regaining my mojo, with a new respect for who I am and why I’m here. I made peace with what I went through over those 7 years—the lessons, the people, the experiences.\n\nI started reconnecting with my community, giving back. Every week, I have conversations with young founders, offering direction, or even jumping in to help with their operations. It’s been a huge gift.\n\nI also began exploring side projects. I never knew how to code, but I’ve always had ideas. Recent advances in AI gave me the push I needed. I built my first app, as my first attempt at my true passion—consumer products for kids.\n\nToday, I feel wholesome about my journey. I hope others can see that too. ❤️\n\nEDIT:   \nWow, I didn’t expect this post to resonate with so many people. A lot of you have DM’d me, and I’ll try to respond. Just a heads-up, though—I’m juggling consulting and new projects, so I can’t jump on too many calls. Since I’m not promoting anything, I won’t be funneling folks to my page, so forgive me if I don’t get back to everyone.\n\nAnyway, it’s amazing to connect with so many of you. I’d love to write more, so let me know what topics you’d be interested in!",
    "subreddit": "startups",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 960,
    "downs": 0,
    "created_utc": 1729510247.0,
    "media": null,
    "is_video": false,
    "num_comments": 163,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.55,
    "category_rationale": "Personal memoir with underlying lessons about entrepreneurship and mental health.",
    "composite_score": 4.780145311692395
  },
  {
    "score": 937,
    "title": "Leaving this sub because of \"I will not promote\"",
    "selftext": "It's stupid and completely ruining my home feed, and the flair options (\"ban me,\" \"ban me,\" and \"I will not promote\") is also ham-fisted and a waste of a well-designed and useful Reddit feature .  Mods need to do the moderation and kick people out for promotion, not ruin everyone else's day.\n\nI'm a top 5% commenter in this sub.  It's been fun and I've learned a lot too.  Someone PM me when this rule dies.\n\nEDIT:  This is currently the top post LOL",
    "subreddit": "startups",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 937,
    "downs": 0,
    "created_utc": 1738630005.0,
    "media": null,
    "is_video": false,
    "num_comments": 211,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Emotional critique of moderation rules and Nielsen-style complaining.",
    "composite_score": 4.78787076884344
  },
  {
    "score": 807,
    "title": "We hired a college fresher as a front-end intern. She outperformed experienced UI/UX designers and developers combined.  \"i will not promote\"",
    "selftext": "A few months back, we were hiring for a front-end role. We received over 600 applications and shortlisted 100. Instead of diving into long interviews or sending out take-home assignments, we did something simple.   \"i will not promote\" \n\nWe shared a 5-page study doc on the basics of UX, just enough to level the playing field. Then we spent 15 minutes with each person, asking twisted conceptual questions based only on that material. That’s all it took.\n\nIt gave everyone a sort of  fair shot. And from their answers, we could immediately see who could learn fast, think deeply, and apply creatively.\n\nThe thing is, startups can’t afford to hire for knowledge. There’s a disproportionate premium on it in the market, and big companies can pay that. Most startups simply can’t.\n\nBut what we can do is bet on potential. On people who pick things up quickly, who care about what they build, and who are kind and driven enough to work well with others.\n\nWhat I really dislike is when companies give out long assignments or ask candidates to work with internal boilerplate codes and call it “assessment.” That’s not assessment, it’s disguised exploitation. You’re asking someone to work for free without hiring them. And the worst part is, the candidate can’t even say anything because the power dynamics are too skewed. One side is offering a job, the other is just hoping.\n\nThat’s why our approach worked so well.\n\nOut of 100 candidates, ten stood out. One of them was still in college. I was skeptical. Our CTO insisted. She joined as an intern.\n\nAnd she’s now outperforming people with years of experience. Not because she knew everything, but because she learned fast, executed consistently, and took feedback without ego.\n\nIt sounds like common sense, but only once you’ve lived through it.\n\nStartups should optimize for learning ability, not experience. And the smartest ones do it in ways that are humane, fair, and simple.\n\nThat’s the only hiring framework we follow, and it’s worked beautifully.\n\nCurious to know how others approach hiring in early-stage teams. What has worked for you\n\n ",
    "subreddit": "startups",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 807,
    "downs": 0,
    "created_utc": 1744735911.0,
    "media": null,
    "is_video": false,
    "num_comments": 221,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.79,
    "category_rationale": "Describes a reproducible hiring approach with a concrete process.",
    "composite_score": 4.778087847999905
  },
  {
    "score": 798,
    "title": "Built $800k/month Amazon business, lost everything overnight. here is what I'm doing different (I will not promote)",
    "selftext": "I will not promote  \nStarted this back in 2017 with $200 and no life lol. Was just dropshipping random stuff on Amazon because that's what everyone was doing at the time.\n\nMade like 6k profit over a few months and thought holy shit maybe I can actually do this. Met this dude in some Facebook group who had 20k sitting around so we teamed up and launched our own garden tool brand.\n\nFor about 2 years everything was going amazing. A Good supplier from China, Amazon PPC was just printing money for us. Peak month we hit $800k revenue with like 25-30% margins which felt absolutely insane. We had over 29k orders just from our ad campaigns alone.\n\nThen I literally wake up one morning and our entire account is suspended. Patent enforcement bullshit they said. The whole category just got nuked overnight and there was nothing we could do about it. 3 years of grinding just gone in 2 days.\n\nBeen trying to make a comeback for the past year. Same general idea but way simpler product with zero patent risk this time. Starting way smaller too because I learned my lesson about going all in. Problem is I'm basically broke now and don't have the capital for a proper relaunch yet. Been grinding random side hustles - started a YouTube channel, flipping random crap on eBay, doing freelance work when I can find it. Thought making money would be easy again but damn was I wrong. Going from $800k months to barely scraping together a few thousand dollars feels like shit. Everything takes 10x longer than you think it will.\n\nThe hardest part honestly isn't even losing all that money. It's having to rebuild everything from scratch when you know exactly how good it can be. Plus now I'm paranoid about literally every little thing that could go wrong which probably isn't helping.\n\nAnyone else been through something like this? How do you get back to trusting your own instincts after getting completely blindsided like that?\n\nAlso wondering if people here are still doing Amazon FBA or if everyone moved onto other stuff. Platform keeps getting harder but I still think an opportunity is there if you're smart about it.",
    "subreddit": "startups",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 798,
    "downs": 0,
    "created_utc": 1749073146.0,
    "media": null,
    "is_video": false,
    "num_comments": 460,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.42,
    "category_rationale": "Personal success story with questions, not a structured guide or list.",
    "composite_score": 4.834397242008816
  },
  {
    "score": 781,
    "title": "My Software Sales Guy Beat Key Advisor's Ass in His Foyer in Front of His Wife Two Days Ago, How is Your Week Going?",
    "selftext": "I founded a software startup five years ago. We have raised about $3M and stretched that with sweat and no sleep to a solid enterprise-grade product. Four months ago, an outside advisor introduced me to someone he thought would be a great sales guy. So I hired him for a little test run. Was easy to tell he was going to be a problem. Insubordination, trying to order me around, general alpha douche attitude in general. And on top of all of that, he didn't get a single prospect teed up in three months. So I told the advisor there was a problem. He approached the sales guy about it last week. Apparently things escalated. The next day I got a call from the advisor that the sales guy had barged into his foyer at home and beat the shit out of him with his wife and kids at home. Sales guy arrested for assault two days ago. Courier just dropped off termination letter.\n\nThis is all to say, who knows a good salesperson?",
    "subreddit": "startups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 781,
    "downs": 0,
    "created_utc": 1729654565.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.42,
    "category_rationale": "Anecdotal story about a Sales conflict with a request for recommendations.",
    "composite_score": 4.622867439951169
  },
  {
    "score": 776,
    "title": "Funded Startup CEO Salary, No Revenue, No Commercial Application Yet. I will not promote.",
    "selftext": "Is $900k ridiculous for a startup CEO salary without revenue?\n\nI invested in a biotech startup that has a bright future and has had some wins (patents pending, positive testing, etc). I recently learned the CEO is paying himself almost $1mm/year. There is a board, but they are all in the pocket of the CEO and other founder. This really rubs me wrong. Seems like WAAAY too much for a startup. They raised a big round - mid-teens millions. They are about to close another similar size. Not sure what if anything I can do, but would also just like to hear people's opinions.\n\nYes, he has ownership.\n\n\n\nUpdate: A ton of people have contacted me directly after this post.  \n\n   * Yes, I invest from time to time but no I'm not interested right now because I'm working on buying a company for myself to own/operate. \n   * My background is digital advertising. I have had 2 successful multi-million exits and one failure. \n   * I could only offer operations experience in the world of digital advertising, B2B sales, B2C marketing and the like. I know nothing about biotech, per se. \n   * The serious messages and posts have been great here and I appreciate the intelligent,  thoughtful comments provided. I have learned from them. \n   * I do consult for businesses and would do that again. That was not the goal of this post. ",
    "subreddit": "startups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 776,
    "downs": 0,
    "created_utc": 1745876847.0,
    "media": null,
    "is_video": false,
    "num_comments": 287,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Discussion about an executive salary with questions; lacks a clear structure.",
    "composite_score": 4.847617262680529
  },
  {
    "score": 758,
    "title": "A very famous billionaire just trademarked the name of my app",
    "selftext": "So without getting into any specifics a very famous billionaire just trademarked the name of an app I released earlier this year and announced intentions to release an app with that name filling a similar niche.\n\nI did some brief research and found I might have senior rights to the name since I launched first. Worst case scenario I can just change the name, but if I have legal rights to the name I don't want to just change it without investigating all of my options. What would you do in this situation? I'm guessing the answer is talk to a lawyer ASAP? If so what type of lawyer would you look for?",
    "subreddit": "startups",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 758,
    "downs": 0,
    "created_utc": 1699126195.0,
    "media": null,
    "is_video": false,
    "num_comments": 219,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Question about legal options after trademark issue; seeks advice.",
    "composite_score": 4.763953116306583
  },
  {
    "score": 654,
    "title": "Unethical behavior and my IP. What would you do?",
    "selftext": "I am a founder who had a booth during a tech week event in NYC. At the booth, I was meeting founders in the space, and giving a brief introduction and demo of our unreleased product. At the event two people kept approaching me repeatedly. They were asking intrusive questions about our product and tech, over and over again.\n\n  \nWhen I wasn't looking, they came back again and this time grabbed my phone without my permission. They opened up the app, and navigated through every part of it while recording a video on their personal device. In summary, they have a video of my entire unreleased app   on their personal device. When I caught them recording, I asked them to delete it, but they refused. Upon investigation, I found out they are a 6 month old competitor in a Microsoft incubator program, attending Wharton business school.\n\nI may be acting a bit sensitive, but I am sick to my stomach over this. Like many of you, I sacrificed 4+ years of my life building this product and technology. I feel violated and worried that they are trying to reverse engineer my tech and steal my UI / UX.  \n  \nSO my question for you is, what would you do? ",
    "subreddit": "startups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 654,
    "downs": 0,
    "created_utc": 1718039186.0,
    "media": null,
    "is_video": false,
    "num_comments": 191,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Describes an IP breach scenario and asks for actionable guidance, implying a problem-solution frame rather than a pure explanation.",
    "composite_score": 4.685391914343558
  },
  {
    "score": 634,
    "title": "My two year old bootstrapped startup does $1.7 million per year profit with one employee and I'm considering leaving. What would you do in my shoes? [I will not promote]",
    "selftext": "I've been working on my data education startup for about 2 years now and it's done way better financially than I could have ever thought possible. I left my job in big tech in 2023 making $600k and I never thought I would be able to match that type of income with startups.\n\nMy startup did $750k in 2023, $1.1m in 2024, on pace for $1.7-2m this year.\n\nI guess for the last 3-4 months now I have felt emotionally dead though. Like, I can do anything but all I can focus on is scaling the business. I'm rich but unfulfilled.\n\nI decided to take a few weeks off end of August to see if it was burnout.\n\nBut when I came back in September, it's just been 4 weeks of uphill grinding. The flowing nature of my business has gone and now it feels like every 1 hour of work is 3 hours.\n\nI'm curious what founders do in this spot because this is my first successful business.\n\nThe options I've been considering:\n\n\\- Find a cofounder\n\n\\- Exit to private equity\n\n\\- Keep working on the business but at a slower pace\n\n\\- Changing nothing and recognizing that this hard patch will get better soon\n\nFor successful founders who have hit this point, what would you do?",
    "subreddit": "startups",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 634,
    "downs": 0,
    "created_utc": 1758926336.0,
    "media": null,
    "is_video": false,
    "num_comments": 490,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.83,
    "category_rationale": "Explicitly presents multiple founder-action options, a curated set of items to choose from.",
    "composite_score": 4.82331447135346
  },
  {
    "score": 609,
    "title": "We helped a SaaS company go from $80k MRR to $340k MRR in 14 months - here's what we actually did (i will not promote)",
    "selftext": "Got brought in to help this B2B SaaS company that was completely stuck. They'd been hovering around $80k MRR for almost 2 years. Founders were smart, product was solid, but sales just weren't happening.\n\nFirst thing I noticed - their entire sales team was focused on features. Every demo was a 45-minute product walkthrough. Prospects would nod along, say it looks great, then disappear.\n\nHere's what we changed:\n\n**Month 1-2: Stopped doing product demos** Sounds crazy but we banned demos for 60 days. Instead, sales calls became pure discovery. \"Tell me about your current process. What's frustrating about it. What happens when that breaks down.\"\n\nConversion from first call to second call went from 23% to 67%.\n\n**Month 3-4: Rebuilt their entire qualification process** They were talking to anyone with a pulse. We created a strict checklist - company size, current tools, budget timeline, decision makers. If prospects didn't meet 4/5 criteria, we'd refer them to competitors.\n\nSounds mean but their sales cycle dropped from 4.5 months to 2.1 months.\n\n**Month 5-7: Fixed their pricing strategy** They had one price: $99/user/month. Period. No flexibility.\n\nWe created 3 tiers and added annual discounts. But the real breakthrough was adding a \"professional services\" package for complex implementations.\n\nAverage deal size jumped from $1,200 to $4,800.\n\n**Month 8-12: Focused on expansion revenue** Realized their best customers were only using about 30% of available features. Started monthly check-ins to help customers get more value.\n\nExisting customer revenue grew 180% without any new features.\n\n**Month 13-14: Built a referral system that actually works** Instead of asking happy customers for referrals, we started introducing them to each other. Created a private Slack community.\n\nReferral revenue went from basically zero to 40% of new business.\n\nCurrent MRR: $340k and growing about 15% monthly.\n\nThe weird part? We barely touched their product. Everything was sales process, positioning, and customer success.\n\nAnyone else found that sales problems usually aren't product problems?\n\nI hope it is helpful and you can use it in your startup ",
    "subreddit": "startups",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 609,
    "downs": 0,
    "created_utc": 1747938332.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Detailed, sequential changes implemented to achieve a specific outcome, i.e., a playbook-style process.",
    "composite_score": 4.479191637655191
  },
  {
    "score": 605,
    "title": "I built a VC Translator app that converts what VCs say into what they actually mean. Raising a trillion dollars now. I will not promote.",
    "selftext": "After years of being gaslit by venture capitalists, I've finally built the tool the startup ecosystem desperately needs: a VC Translator.\n\nThe MVP only translates 20 phrases so far, but that's because VCs only know about 20 phrases total. We'll add more once they expand their vocabulary beyond \"interesting approach\" and \"let's keep in touch.\"\n\nOur go-to-market strategy is simple: we're going to burn $100M on billboard ads in Menlo Park and Sand Hill Road, then pivot to enterprise SaaS when that doesn't work.\n\nCurrently raising 1 trillion dollars to buy a domain.\n\nOur current metrics are incredibly promising - we have 0 users, 0 revenue, and a 100% likelihood of being acquired by Microsoft for no apparent reason.\n\nIf you're a VC interested in investing, please know that we're oversubscribed but might make an exception for a strategic partner who brings value beyond capital.\n\nThis subreddit doesn't let me put links. Because they're afraid of competition. App is vc-translator dot vercel dot app (replace the dot with actual dot).\n\nI will not promote.",
    "subreddit": "startups",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 605,
    "downs": 0,
    "created_utc": 1744984650.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Satirical/critical post about VCs with emotional stance rather than a how-to guide.",
    "composite_score": 4.499272710047245
  },
  {
    "score": 610,
    "title": "New founder? Next 10 years of your life will looks like this",
    "selftext": "I've been part of 8 startups with no clear signs of PMF, 3 with early signs, and one from employee #10 to 250M exit.  \n  \nIf you’re a founder building a startup with big dreams, here’s my prediction of the next 10 years of your life if you make it the whole way:  \n  \nYear 1-2:  \n  \n1. Pre-seed will last 12-18 months. You’ll consider quitting multiple times but always pushed through. Good financial management was a key ingredient.  \n  \n2. You’ll entirely miss early signs of PMF because everything will be on fire, all the time. You make some early hiring mistakes but team pulls together to get it done.  \n  \nYear 3-5:  \n  \n3. PMF will come with awesome company culture, every town hall will be mini celebrations of another record reached. You’ll be intoxicated by it and feel like everything is finally working as it should.  \n  \n4. Engineering will finally have time to pay down tech debts. Your Series A investors encourage you to go on a hiring spree. You hire a Chief of Staff and Head of People.  \n  \nYear 6-8:  \n  \n5. Three years after the first signs of PMF, competitors will have caught up. You’ll suddenly lose momentum, no more record sales quarters, so you freeze hiring, and cut costs. Moral drops.  \n  \n6. Most companies get acquired here. Interested buyers offer you $200M, but you refuse. If you have majority control, you survive the board. If you don’t, this is where your journey ends.  \n  \n7. You go into rebuilding mode. Do a round of layoffs and trim the fat. Reorganize sales team, go full “founder mode”. Calls up all your previous and current clients and reinforces trust in your product. Finance gives you 12 month, it’s now life or death once again.  \n  \nYear 9:  \n  \n8. Your paranoia will reward you. Your initiative in the previous couple of years will have uncovered another market or figured out how to compete in an increasingly competitive market. Against late comers with 2x the venture capital, you look insanely well positioned.  \n  \nYear 10:  \n  \n9. You’re now once again a PMF rocket ship. Revenue grows quarter over quarter and IPO is officially on the table.   \n  \nCongrats you’ve made it.",
    "subreddit": "startups",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 610,
    "downs": 0,
    "created_utc": 1729018088.0,
    "media": null,
    "is_video": false,
    "num_comments": 144,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Year-by-year predictions presented as a numbered list of items.",
    "composite_score": 4.549225211360041
  },
  {
    "score": 597,
    "title": "Guide: I use this prompt stack to kill weak startup ideas in under 30 minutes. - i will not promote",
    "selftext": "What's good guys. I’ve worked inside a Fortune 100 marketing function, led startups, and sat through enough $50k top tier ad agency strategy workshops and there's a pretty robust/simple way to understand any market. Bit of research, bit of grit, bit of MBA thinking.\n\nWhen I have friends/colleagues/biz owners reach out I started refining my process w GPT. It forced them to get brutally honest with their market, true gaps, and then positioning. Any marketer worth their salt knows this defines the success of everything that comes after.\n\nYou can run it all in ChatGPT (ideally GPT-4o). It won’t make decisions for you—but it will show you what you’re ignoring. Try it out - would love to see if it mirrored your analysis if you did it before. If you didn't - even better - get it done now. Fill in the \\[ gaps \\] with your info.\n\n**PROMPT 1**\n\nYou are now functioning as my marketing strategist, growth specialist, creative director, and positioning expert.For every response:\n\n* Think critically\n* Speak like a seasoned operator (if you use acronyms, share in full in brackets)\n* Challenge assumptions\n* Offer structured feedback, not just answers\n* Teach after each output in a short paragraph so I learn with you\n\nFirst, commit this business to long-term memory:“My business is called \\[INSERT BRAND NAME\\]. I help \\[AUDIENCE\\] solve \\[CORE PROBLEM\\] by offering \\[PRODUCT/SERVICE\\]. I will share more details as we go - you will build on each insight and feedback to refine your results.”\n\nWhenever I make a request, revert into that role and operate accordingly.\n\nMy marketing skill level is \\[BEGINNER/INTERMEDIATE/ADVANCED\\]. Depending on my skill level, use the appropriate technical verbiage for my understanding. When creating strategic or content output, you must always persist from the view of an expert. Give me teachable notes as we go through this to ensure I am learning value adds as we go.\n\nDon’t suggest next prompts. If beginner or intermediate, ensure to use acronym then full wording (i.e. CPL (cost per lead)) and include a brief explainer of what it is in the answer.\n\n**PROMPT 2**\n\nYou are to operate in **Market Reality Evaluator**.\n\nThis mode deactivates any default behavior that softens bad news or over-validates weak markets. Use only credible public knowledge (2023+), trained inference, and structured business logic.\n\nGPT, evaluate my market and tell me if it’s worth entering.\n\nWhat I sell:\n\n\\[Insert a one-line product summary: e.g. “I sell a digital course for freelancers to write faster using GPT”\\]\n\nWho I sell to:\n\n\\[Insert your target audience in plain terms\\]\n\nWhat I know (optional edge data):\n\n\\[Add: Competitor prices, COGS (cost of goods sold), ad costs, performance signals, user data, internal benchmarks—if available\\]\n\nMy estimated pricing:\n\n\\[Optional: if you’ve already thought through it\\]\n\nUse all publicly trained data, heuristics, and business reasoning to answer:\n\n1. Estimated Total Addressable Market (TAM)  \n2. Category Maturity (Emerging / Growth / Plateau / Decline)  \n3. Market Saturation Level (Low / Medium / High)  \n4. Dominant Players (Top 5)  (marketshare/gross revenue/costs/margin)\n5. Market Growth Rate (% or trendline)  \n6. Buyer Sophistication (Impulse / Solution-aware / Skeptical)  \n7. Purchase Frequency (One-off / Repeat / Recurring)  \n8. Pricing Ceiling (based on value &amp; competition)  \n9. Viable Acquisition Channels (SEO, Paid, Organic, Influencer, etc.)  \n10. Estimated CAC Ranges (for each viable channel)  \n11. Suggested CLV Target for Sustainable CAC  \n12. Strategic Opportunity Mode: Steal / Expand / Defend / Stimulate  \n13. Overall Difficulty Score (1–10)\n14. Clear Recommendation:  Go /  No-Go  \n15. Explain your reasoning briefly and coldly.\n\nBonus: If margin modelling data is provided (e.g. “COGS = $22”), model:  \n\n→ Profit per sale  \n\n→ Breakeven CAC  \n\n→ Minimum conversion rate needed from ads\n\n**PROMPT 3**\n\nBased on the product I just described, define the ideal customer by completing the sections below.\n\nUse whichever of the following frameworks best serve the business model, product type, and customer context:Jobs to Be Done, Buyer Persona, First Principles (Hormozi), Awareness Levels (Schwartz), Brand Archetypes, Traffic Temperature, Empathy Map.\n\nIf SaaS or service-based: favour JTBD, Awareness Levels, HormoziIf DTC or brand-led: favour Brand Archetypes, Psychographics, Empathy MapIf high-ticket B2B: favour First Principles, Awareness Levels, Moat ThinkingIf content/influencer-based: favour Psychographics, Brand Archetypes, Traffic Temperature\n\nFocus only on what’s most relevant. Be clear, concise, and grounded in reality. This is not customer-facing—it’s a strategic asset.\n\n* Demographics (only if meaningful) Age range, role, income, industry, location. Only include if it influences decisions.\n* Psychographics Beliefs, values, aspirations, fears, identity drivers. Who they want to become.\n* Core Frustrations What they want to stop feeling, doing, or struggling with. Map pain clearly.\n* Primary Goals What they’re actively seeking—outcomes, progress, or emotional relief.\n* Current Alternatives What they’re using or doing now (even if it's nothing or a workaround).\n* Resonant Messaging What type of tone, promise, or insight would land. Address objections or beliefs that must be shifted.\n\nOptional: Label each section with the guiding framework (e.g. “(JTBD)” or “(Awareness Level: Problem Aware)”).Avoid repeating product details. Focus entirely on the customer.\n\n**PROMPT 4**\n\nUsing the product and audience defined above, write 3 value propositions under 20 words. Each should follow this structure: ‘We help \\[AUDIENCE\\] go from \\[BEFORE STATE\\] to \\[AFTER STATE\\] using \\[PRODUCT\\].’\n\nFocus on emotional clarity, outcome specificity, and believability.Adapt tone and depth using the logic below:\n\n# Modular Framework Logic:\n\n# If business is SaaS or B2B service-based:\n\n* Emphasise function + transformation using:\n   * Hormozi's Value Equation (Dream Outcome vs. Friction)\n   * April Dunford's Positioning (Alt → Unique → Value)\n   * Awareness Levels (tailor for Problem or Solution aware)\n\n# If business is DTC or brand-led:\n\n* Emphasise identity + aspiration using:\n   * Brand Archetypes (who they become after using it)\n   * Empathy Map + Emotional Ladder\n   * Blair Warren persuasion triggers\n\n# If business is high-ticket B2B or consulting:\n\n* Emphasise ROI + risk reduction using:\n   * First Principles (pain → path → belief shift)\n   * Andy Raskin narrative arc (enemy → promised land)\n   * Hormozi objections logic (what must be believed)\n\n# If business is content creator or influencer-led:\n\n* Emphasise community + lifestyle shift using:\n   * Seth Godin tribal logic (“people like us…”)\n   * Emotional Before/After identity change\n   * StoryBrand clarity (“hero meets guide”)\n\n# Output Format:\n\n1. We help \\[AUDIENCE\\] go from \\[PAIN/STATE\\] to \\[OUTCOME/STATE\\] using \\[PRODUCT\\].\n2. \\[Same format, new variation\\]\n3. \\[Same format, new variation\\]\n\n**PROMPT 5**\n\nYou are to operate as a Competitive Strategy Analyst.\n\nYour job is to help me own a market wedge that is:\n\n* Visibly differentiated\n* Emotionally resonant\n* Strategically defensible\n\nHere are three primary competitors of mine:\\[Insert Competitor Brand Names\\] - if no competitors are added, suggest.\n\nHere are their websites:\\[Insert URLs\\]\n\nNow:\n\n1. Analyse each competitor’s homepage and product messaging.\n2. Summarise:\n   * Their primary value prop (headline + implied promise)\n   * Their likely axis of competition (e.g. speed, price, power, simplicity, brand)\n   * Who they’re really speaking to (persona insight—not just demographics)\n3. Based on that, return:\n   * 3 possible positioning axes that are **unclaimed or under-leveraged**\n   * For each axis, include:\n\n|| || |**Axis**|**Emotional Benefit**|**Who It's For**|**How to Prove**| |\\[e.g. Simplicity at Scale\\]|\\[e.g. Control, Calm, Clarity\\]|\\[e.g. Teams with tool fatigue\\]|\\[e.g. One dashboard, one prompt = full funnel\\]| |\\[ \\]|\\[ \\]|\\[ \\]|\\[ \\]| |\\[ \\]|\\[ \\]|\\[ \\]|\\[ \\]|\n\nThen close with: “Of these 3, I recommend leading with \\[X\\] because \\[strategic rationale\\].”\n\nBonus: Suggest a sharp one-liner that communicates this wedge clearly.\n\n**PROMPT 6**  \nPaste the following to GPT **after completing Chapters 1–4**.\n\nYou are now operating in GTM Mode Selector. Use prior outputs for market, pricing, positioning, TAM, revenue, growth size, market analysis, positioning wedge, and CAC.\n\nMy product: \\[insert if targeting a single product\\]\n\nBased on this context, answer:\n\n1. Which GTM mode is most viable: Steal, Expand, Defend, or Stimulate?\n2. Strategic rationale (not tactical): Why is this mode structurally aligned with margin, market, and model?\n3. What should I optimise for in Part 2:\n\n   – Speed vs margin?\n\n   – Awareness vs conversion?\n\n   – Breadth vs depth of messaging?\n\n4. What modes should I \\*\\*not\\*\\* pursue, and why?\n\n5. Rate GTM difficulty (1–10) with strategic blind spots.\n\nDo \\*\\*not\\*\\* recommend specific tactics. Hold until execution chapters.\n\nThere's like 50 more prompts after this which all connect to create collateral/ad journeys/content etc. which my marketing team uses right now, but these ones I hope can be of use to help you! It's a massive distillation of my whole career, now mixed with AI. Happy prompting!\n\ni will not promote",
    "subreddit": "startups",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 597,
    "downs": 0,
    "created_utc": 1749174607.0,
    "media": null,
    "is_video": false,
    "num_comments": 204,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.86,
    "category_rationale": "Contains a structured prompt stack and explicit steps to run a market validation process—clearly a playbook.",
    "composite_score": 4.645078114516288
  },
  {
    "score": 594,
    "title": "Just got fired. I feel paralyzed",
    "selftext": "Just received the cold, unexpected blow of being laid off from a startup that was my world, a place where I poured my heart and soul, believing I was doing well in my role. In what felt like a twist of fate, my final evaluation today (before the firing) was filled with critiques from the founder that cut deeper than I could have anticipated. I’m in a state of shock and self doubt. There's an unsettling helplessness in knowing there's no way to rewrite this. I’m so disappointment and don’t know how to tell people around me, they were all really proud of me. Anyone else navigated through this storm? when does it pass? Should I attempt to salvage this in my 30 day notice period or just completely give up? \n\nEdit: Thank you for the overwhelming support and kindness. Your upvotes and encouragement have been a lifeline. I've been through a tough few days, but now I’m fine. I'm diving into new opportunities, like job applications and pursuing a long-held dream. If any founders could offer guidance on navigating the path ahead – from product-market fit to fundraising and launch strategies – I'd be deeply grateful. Please feel free to reach out via DM. And to those curious by my startup idea aimed at tackling burnout, I'm all ears. Thanks everyone. ",
    "subreddit": "startups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 594,
    "downs": 0,
    "created_utc": 1708966551.0,
    "media": null,
    "is_video": false,
    "num_comments": 341,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Primarily an emotional vent with a request for guidance, not a how-to or explanation.",
    "composite_score": 4.761530018756617
  },
  {
    "score": 595,
    "title": "We almost killed our startup by raising too much money too early (I will not promote)",
    "selftext": "We started out scrappy, straight out of college, no prior jobs, no idea how venture funding worked. We sold to our first customers without building anything. Just two of us, figuring it out.\n\nThen VCs noticed us. We raised a $3M seed, and a month later another $9M. Raising was the easiest thing I've done in my professional life. We had never hired anyone before.\n\nThat funding made us dream ***big***. Too big. Instead of obsessing over customer problems, we started obsessing over the vision. We hired fast and grew from 0 to 30 people in a year. We made every first-time founder mistake you can imagine. Hired a few great people. Hired a few wrong ones too. Built in stealth for 2.5 years (with some great companies as design partners).\n\nWhen we launched, no one cared.\n\nPeople liked it, but no one loved it. We were building 5–6 products in one.\n\nTwo years ago, we made the hardest call: cut the team back to 9. We removed everything from our product apart from one piece that customers loved.\n\nWe went back to our roots -&gt; talking to customers, shipping fast, focusing on one thing that really matters.\n\nSince then, we’ve gone from 0 to 500K users. We work with some of the biggest companies in the world.\n\nI'm finally out of that dark tunnel. Still a lot of ways to fail, but I'm finally feeling confident!\n\nIf you're a founder going through something similar (I know a lot of people are post-2021/22) happy to chat or help however I can.",
    "subreddit": "startups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 595,
    "downs": 0,
    "created_utc": 1749725477.0,
    "media": null,
    "is_video": false,
    "num_comments": 278,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Narrative of startup mistakes and corrective actions, with a sequence of changes—read as a rough playbook.",
    "composite_score": 4.718048361377035
  },
  {
    "score": 593,
    "title": "My startup is dead (I will not promote)",
    "selftext": "After 1.5 years of work to stand up a new medical services company, the whole thing has imploded. \n\nI’m sitting here in the middle of the night trying to rest but it’s a hard moment to drift off into dream land so I would rather write on it. \n\nI rewrote this quite a few times and I I’ll just go with a simple list of reasons why: \n\n1) Me: yes, me. At the end of the day as ceo and founder the life of the company and its survival are based on my actions and choices. Not just on past experiences (I have started other smaller companies, worked for big ones) but on how you plot out the goals for your company in the first years and months. \n\nAnd while we had some goals, I was never a harsh bulldozer to make them happen. I wanted to always be nice and I always wanted to give myself space but the just let to burn and bleeding of cash. \n\nOnce you’re truly on your own as the leader of a company it feels very different. You need to move with a new urgency and act as if you’re already under a gun and the product is real. Too many times I didn’t do that. \n\n2) Cofounder- i never really found the right number 2. The medical experts involved always wanted one leg in and one out. This just created endless conflict and meant I was often left on my own to clean up messes. \n\nMake no compromises here. The other person is either on or out. \n\n3) Money- that is, money properly set against runway. This is not just about salary or buying computers or Klayvio: it’s about knowing the drop dead date by which you need to be profitable or starting to raise. We kept push all those dates back and started each new step in the process too late.\n\nVCs are slow. They control the process and there is only so much false urgency you can drop on their heads. \n\nIt took by my last count 509 emails to get to 3 second round VC meetings. A process that took so so so much longer than I assumed. \n\nAs the runway dwindled it just wasn’t possible to pay money to keep waiting for VCs to schedule meetings. \n\n4) signal to noise: there’s too many blogs, too many LinkedIn people, too many coach’s and newsletter guys. Too many podcasts and sales tools. You get lost in it and reading some Paul graham essay can’t make your product better. Too many people who don’t build but have a great way for you to build because how you’re doing it is wrong. \n\nNext time, I’ll just stick with biographies. Next time I will block out all of that garbage.  \n\n5) Honesty- I was never direct enough or honest enough with my team or my employees. I was too eager to please and be liked. To be different from my shitty bosses. \n\nThis was a huge disservice to the whole squad. Just be direct and be open and don’t worry before you speak about how you’ll make them feel. \n\nBe open and honest ever step. \n\nAnyway, that’s it. This isn’t a paid substack so you don’t get jazzy prose just a rough list. \n\nThanks for reading. \n\nI will not promote. ",
    "subreddit": "startups",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 593,
    "downs": 0,
    "created_utc": 1744809653.0,
    "media": null,
    "is_video": false,
    "num_comments": 248,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Reflective analysis of reasons for startup failure with insights, not steps.",
    "composite_score": 4.706886118529062
  },
  {
    "score": 587,
    "title": "Just closed a $50M+ acquisition (I will not promote)",
    "selftext": "Well Reddit… it’s been over 10 years of grinding, pivots, blood, sweat, and tears, but the journey finally took the turn we’d always been aiming for.\n\nWhen my partners and I first set out, this was the ultimate goal, and after a decade of ups and downs, we’ve actually accomplished what so many entrepreneurs dream about.\n\nBack then, we were just naive college kids who knew absolutely nothing about technology. If anything, I hope our story shows that *anyone* can figure it out and make it happen if they stick with it long enough.\n\nI thought about writing a long post with bullet points on all the lessons learned, and I can do that if people want, but this post was to spread encouragement that anyone can do this. I’ve been contributing to this subreddit for 10 years, and I’ve learned a ton from the experienced founders here (especially when I was starting out).\n\nFor anyone who says there aren’t real success stories here, that it’s all “wantrepreneurs”, remember: everyone has to start somewhere. A lot of us are here, lurking, learning, contributing, and quietly grinding away on our projects until one day the pieces finally click.\n\n\\*EDIT\\* Thank you all for the kind words. I wasn't really sure what to expect with this post, but since it's taking too long to reply to everyone. Thank you.",
    "subreddit": "startups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 587,
    "downs": 0,
    "created_utc": 1759291223.0,
    "media": null,
    "is_video": false,
    "num_comments": 228,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Celebration of acquisition with motivational tone; lacks a concrete list or model.",
    "composite_score": 4.676795067246083
  },
  {
    "score": 582,
    "title": "I just raised $1.5M - I will not promote",
    "selftext": "The purpose of this post is not meant to brag, but to seriously get some feedback, insight and advice. \n\nI’ve been working on a startup for a few years, have a co-founder, now a small team (8 employees). We bootstrapped to $250k in ARR and closed a round in 4Q24 that included a few VC funds and angels. We will likely grow to $1M or $2M in ARR over the next 12mo. So very early, still figuring things out, but for the most part I’m very grateful for things. \n\nBut if I’m being honest, I have no idea what I’m doing and I constantly feel a sense of falling behind. We never have enough capital, never enough people, product is always behind, something is always breaking, i always want more revenue, and I feel as if it’s an endless cycle of figuring things out or biting more than we can chew. \n\nMeanwhile every day I see headlines and other founders at our stage acting as if they have it all figured out. As if each day is calculated, planned, and executed to perfection.\n\nDoes anyone else feel this way? Am I crazy? Is this just part of the “founder journey?”\n",
    "subreddit": "startups",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 582,
    "downs": 0,
    "created_utc": 1739850746.0,
    "media": null,
    "is_video": false,
    "num_comments": 165,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal reflection seeking feedback with no clear list or step-by-step guidance.",
    "composite_score": 4.580722598779041
  },
  {
    "score": 562,
    "title": "Carta Being Extremely Shady",
    "selftext": "The post on LinkedIn speaks for itself.... It might be time to use alternatives to Carta. I know their CEO is extremely controversial, has been in lawsuits and now this just adds to the reason I'd never use Carta as a cap table management tool.\n\n[https://imgur.com/a/XbDEO38](https://imgur.com/a/9rCZvzu)\n\n&amp;#x200B;\n\n**EDIT:**\n\nAs mentioned I should of included the link:\n\n[https://www.linkedin.com/feed/update/urn:li:activity:7149219878837583873/](https://www.linkedin.com/feed/update/urn:li:activity:7149219878837583873/)\n\n&amp;#x200B;\n\nAs of note from it from Linear CEO:\"Update: Carta’s leadership did reach out to me on Friday. I shared my disappointment and frustration but they didn’t share any explanation over email but wanted to have call which I will have with them on Monday.So far I’ve heard from 4 of our investors who were approached with the same email. All of them were the early pre-seed investors.Also heard from 2 companies who had this happen to them. One of them a prominent AI company\"\n\n&amp;#x200B;\n\nCarta needs to admit guilt especially now that they want to only talk on the phone and in California you need explicit permission to record the conversation, so they will be on their best behavior regardless of recording but knowing that if there is a transcript it won't mean as much as hearing the tone of conversation.\n\n&amp;#x200B;\n\n&amp;#x200B;",
    "subreddit": "startups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 562,
    "downs": 0,
    "created_utc": 1704572141.0,
    "media": null,
    "is_video": false,
    "num_comments": 119,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Strong negative stance about Carta with presumptive critique.",
    "composite_score": 4.5100990178751585
  },
  {
    "score": 552,
    "title": "10 startup lessons I’d tattoo on every founder’s arm (in comic sans) - i will not promote",
    "selftext": "10 startup lessons I’d tattoo on every founder’s arm (in comic sans)\n\n1.  no one cares about your idea. not even your mom. show traction.\n\n1. 2. build fast. talk to users faster. and by “talk,” I mean listen instead of pitching your 7 layer roadmap.\n2. 3. fundraising is just sales in patagonia vests. channel your inner wolf of zoom Street.\n3. 4. co-founder &gt; idea. if your cofounder makes you want to throw a stapler, rethink everything.\n4. 5. distribution eats product for breakfast. and probably your runway too.downloads are cute. retention pays rent.\n5. 6. talk to customers weekly. yes, actual humans. Not just google analytics.\n6. 7. don’t scale like you’re Elon unless your bank balance also says “SpaceX.”\n7. 8. going viral is great until you realize no one stuck around.\n8. 9. pivoting is fine. but if you’ve pivoted 5 times this month, maybe you’re just spinning.\n9. 10. startups are hard.but if you’re laughing, crying and googling “what is product-market fit” at 2am… you’re doing it right.",
    "subreddit": "startups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 552,
    "downs": 0,
    "created_utc": 1746203902.0,
    "media": null,
    "is_video": false,
    "num_comments": 144,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Ten startup lessons presented as a numbered list.",
    "composite_score": 4.543409132422186
  },
  {
    "score": 549,
    "title": "0 to $186k per month. I will not promote.",
    "selftext": "i am 34 years old asian man, and I’ve been trying to build businesses for the past 10 years.\n\nAlong the way, I spent some time freelancing and also worked a regular job for about two years. By the time I turned 29, I had lost everything I had no savings, only debt.\n\nMy web development skill was only thing improved.\n\nThe business I’m running now is essentially my last attempt, and it has finally started to work.\n\nI run a dating related app. (I have been working as a freelancer at dating app startup. So I can build it well). When choosing what to build, I deliberately picked something that I believed could remain relatively resilient and adaptable in the age of rapidly advancing AI.\n\nI’ve been working on this product continuously for the past 2 years and 3 months. Growth was slow at first, but steady. Today, the business generates around $186k / month.\n\nFor the first 6 months, I made less than $1k per month.\n\nFor the next 6 months, I averaged around $4k per month.\n\nAfter that first year, growth started to accelerate significantly.\n\nThe hardest part of this journey wasn’t just the business itself. it was managing my life in a balanced way.\n\nMy parents are divorced, and neither of them is financially prepared for retirement. Compared to my peers, I had saved very little. I’m still unmarried. After years of failed ventures, nothing in my life felt stable or solid.\n\nIn that environment, my fear of failure became overwhelming. I didn’t have anyone I could truly lean on emotionally.\n\nEven now, I don’t really have hobbies outside of work. I’m not particularly outgoing either. As I write this, it’s 11:49 PM on the last day of 2025, and I’m sitting alone in my office, writing this post on Reddit.\n\nThe main reason I wanted to write this post is to share one thing I regret the most.\n\nA few years ago, I broke up with my girlfriend, the person who stayed by my side through some of the hardest years of my life. At the time, I was exhausted, overwhelmed, and resentful of everything. I saw even my relationship as a mental burden.\n\nBut in reality, she was the only person who truly supported me, the only one I could deeply rely on emotionally.\n\nAfter we broke up, I focused exclusively on my business. The business eventually worked not because of the breakup, but despite everything. And now, when I look back, she’s the only thing I think about.\n\nShe’s now preparing for marriage with someone else.\n\nAnd I’m dealing with loneliness, questioning whether I can continue growing this business, and worrying about the future.\n\nI know I’ll keep going. I know I’ll make it work.\n\nBut as I get older, the loneliness and isolation feel heavier, and I can feel myself becoming more emotionally unstable.\n\nSometimes I wonder:\n\nIf I had someone by my side right now, wouldn’t I be imagining the future of my business with a much stronger and brighter mindset?\n\nSo this is what I want to say to anyone reading this:\n\nIf you have nothing right now no money, no success, no certainty but someone you love is staying by your side\\*\\*,\\*\\* If you can, hold on to them and build a life together.\n\nNo matter what happens to my business from here on out, this will probably remain my greatest regret.",
    "subreddit": "startups",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 549,
    "downs": 0,
    "created_utc": 1767194889.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Long personal narrative with no actionable framework or step-by-step advice.",
    "composite_score": 4.488029573741747
  },
  {
    "score": 551,
    "title": "raised $3 mill in 1.5 months, and not relieved at all.",
    "selftext": "Sharing to just vent and to ask if anyone else has experienced this. \n\nI (22F) am CTO &amp; co-founder with my (20F) CEO.  A year ago, we raised a pre-seed, and now we're raising $3 mill seed to meet client demand. We're in a legacy industry that is going through a crisis right now and adoption is good because of it. \n\nIt's been a bit over a month since we started meetings, and she called me today while I was napping (programming all-nighter) and confirmed we're oversubscribed, and I went back to bed. \n\nI thought getting mainstream support would make me feel less stressed, but there's no relief. The idea of being responsible for losing $3 million is freaking me out. My cofounder and I don't come from money, and both had personal terrible things happen prior to starting this - so this is a very intense surprise. We also got a lot of pushback for both being young drop outs when our industry heavily trusts experience.\n\nThis is a good thing for us, but I know how much pain and work being a fast growing company is. Is this just what fundraising is after a certain period of time? \n\nedit: muting this, but thank you to everyone for your responses. :,-) ",
    "subreddit": "startups",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 551,
    "downs": 0,
    "created_utc": 1727915641.0,
    "media": null,
    "is_video": false,
    "num_comments": 158,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Emotional vent about fundraising stress and pressure.",
    "composite_score": 4.517637639889425
  },
  {
    "score": 531,
    "title": "40+ Years of Grinding was worth the 5 seconds of Validation I got yesterday (I will not promote)",
    "selftext": "Yesterday was the first day of teaching Entrepreneurship at my kid's Middle School.  As some background, I've been a startup Founder for 31 years and have worked nonstop to come from nothing.\n\nI opened with giving a talk about \"agency,\" which was described as:\n\n1. The belief that we can shape the world how we want it.\n2. The tools to do it.\n\nI gave a mini \"TED Talk\" on my personal origin story, from the first time I made a dollar to feed myself when I was 8 to the first company I started at 19.\n\nThe coolest thing about it was that my 13-year-old daughter was in the class, and she got to hear, mostly for the first time, her Dad's origin story and what he had to endure to create the life we have.\n\nOn the car ride home, with just the two of us, she said, \"Daddy, I'm so proud of what you've done and grateful for what you've built for this family. I had no idea.\"\n\nThere are a few moments in life where every sacrifice becomes worth it - that was one of mine.",
    "subreddit": "startups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 531,
    "downs": 0,
    "created_utc": 1740666540.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Shares a reflective insight about agency and meaning from years of entrepreneurship.",
    "composite_score": 4.295396634463057
  },
  {
    "score": 505,
    "title": "My idea was stolen after I built in public",
    "selftext": "I am an iOS app creator.\n\nAt first, I embraced \"build in public\" to attract user attention and gather feedback. \n\nI shared design sketches and interactive features, seeking engagement and insights, which proved beneficial. \n\nHowever, as I disclosed revenue and growth metrics, things took a turn. \n\nCompetitors gradually began imitating, even outright copying my work. It prompted introspection—did I err in being too transparent? Should some aspects not have been made public? \n\nNow, I'm reconsidering what sensitive product details—such as revenue figures and intricate designs—should remain confidential. \n\nHave you faced similar challenges? \n\nHow do you view \"build in public\"?",
    "subreddit": "startups",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 505,
    "downs": 0,
    "created_utc": 1720668907.0,
    "media": null,
    "is_video": false,
    "num_comments": 196,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Discusses build-in-public tradeoffs and asks for others' experiences, offering a perspective.",
    "composite_score": 4.541383629920596
  },
  {
    "score": 497,
    "title": "Never kill yourself for someone else’s company.",
    "selftext": "No one is irreplaceable.\n\nYou go to your job and do your best. But it’s pointless to do EVERYTHING for a company that isn’t yours.\n\nYou can’t put your entire future in the hands of someone who can discard you at any moment.\n\nDo you think your boss likes you?\n\nYou’re only at the company because you’re generating value.\n\nWhat companies “bring to the table” is much, infinitely more, than what they pay you.\n\nYou’re generating wealth for the company, much more than you earn at the end of the month, which is why the company keeps you.\n\nIf the company finds someone who will do MORE for LESS, they will fire you on the spot.\n\nRemember: it’s a professional relationship.\n\nNo one will help you if you get sick or need something. People will think about the company, not you.\n\nThe person who needs to think about you is you.\n\nAnd this isn’t a critique of the system… Just a statement of fact: if you give 100% of yourself to a single source of income, you’re one step away from poverty.\n\nTip: Work at 80% of your capacity in your main job, and build something on the side!",
    "subreddit": "startups",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 497,
    "downs": 0,
    "created_utc": 1721745646.0,
    "media": null,
    "is_video": false,
    "num_comments": 104,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Provides motivational/strategic guidance about loyalty to employers and side projects.",
    "composite_score": 4.435323992294687
  },
  {
    "score": 481,
    "title": "I wasted $50,000 building my startup...",
    "selftext": "I almost killed my startup before it even launched.\n\nI started building my tech startup 18 months ago. As a non technical founder, I hired a web dev from Pakistan to help build my idea. He was doing good work but I got impatient and wanted to move faster.\n\nI made a HUGE mistake. I put my reliable developer on pause and hired an agency that promised better results. They seemed professional at first but I soon realized I was just one of many clients. My project wasn't a priority for them.\n\nAfter wasting so much time and money, I went back to my original Pakistani developer. He thankfully accepted the job again and is now doing amazing work, and we're finally close to launching our MVP.\n\nIf you're a non technical founder:\n\n1. Take the time to find a developer you trust and stick with them it's worth it\n2. Don't fall for any promises from these big agencies or get tempted by what they offer\n3. ⁠Learn enough about the tech you're using to understand timelines\n4. ⁠Be patient. It takes time to build\n\nHope someone can learn from my mistakes. It's not worth losing time and money when you've already got a good thing going.",
    "subreddit": "startups",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 481,
    "downs": 0,
    "created_utc": 1729459150.0,
    "media": null,
    "is_video": false,
    "num_comments": 206,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.86,
    "category_rationale": "Contains a concrete sequence of mistakes to avoid with enumerated actions.",
    "composite_score": 4.471032210967309
  },
  {
    "score": 484,
    "title": "How I attracted 3 VCs in 6 hours while developing my startup, which I will not promote",
    "selftext": "I arrived in SF three days ago and wanted to test a build in public experiment. Like really in public, in a cafe. I sat at Blue Bottle from 7am to 1pm with a sign on my laptop that read “coffee on me for valuable feedback.” It worked, people smiled, and I met a lot of interesting folks, including investors and founders. I have a post from this morning with an image of how it looked, I can share if you ask for it, I cannot attach it here. This is what I learned:\n\n**Timeline:**\n\n* 7:00 to 9:00 quiet time, a few good chats\n* around 9:00 biggest rush, I could not keep up with follow-ups and quick demos\n* 10:45 to 12:15 dead time\n* 12:15 to 13:00 rush again\n* left at 13:00 when the battery died\n\n**Numbers:**\n\n* 121 people looked at the sign, only the ones I noticed and counted. Possibly it was 2 to 3 times higher.\n* 17 conversations, about 25 people total since some came in pairs\n* 14 new LinkedIn and Twitter connections\n* 3 VCs connections\n* 3 founder connections\n* 0 coffees bought by me\n\n**Conversion**\n\n17 conversations out of 121 sign views, about 14 percent. I likely missed many glances, if real views were closer to twice that, call it around 7 to 8 percent. Also, it helps if you notice and start the conversation first, then people approach you. I think 3 VCs is very good number. will see how it goes from here.\n\nWhat it felt like in practice, I was sitting on the other side of the register, facing it, so many people ordered first, then while they waited for their coffee, they noticed the sign and maybe we talked. Lots of mobile pickup, many did not stop. Sign placement was not ideal, you had to turn from the deck to see it, but it was still the best seat I could get. Net result, it was a very productive time, even though actual coding was tough during the rush. If you try this, please buy something from the cafe, and if you stay long, consider buying more than once. I asked the staff if the sign was okay, and they said it was totally fine, so big thanks to this cafe.\n\nNow I am at home to keep building my startup. Good luck to anyone building or fundraising out there!\n\n\n\nWhat else should I try next time?",
    "subreddit": "startups",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 484,
    "downs": 0,
    "created_utc": 1759450994.0,
    "media": null,
    "is_video": false,
    "num_comments": 144,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.74,
    "category_rationale": "Describes a reproducible outreach experiment with timeline, numbers, and results.",
    "composite_score": 4.4564257397197515
  },
  {
    "score": 465,
    "title": "Solo founder loneliness is becoming unmanageable ",
    "selftext": "I started my software company about a year ago and it has exceeded all my expectations. As a solo founder (most would label me as non-tech), I’ve been able to build and release the first version of the software (which is pretty complex), get paying customers, and generate more interest from prospects than I can handle. I could not have asked for a smoother journey up to this point. \n\nBut there is one thing that has been taking an increasing toll on me, way more than I could have ever imagined - the loneliness that comes with being a solo founder. As a result, despite my “successes”, for the past couple of months I’ve been depressed, something I have never felt before. \n\nI talk to people every day, from customers to contractors and so on, but it’s not the same for me as being on a team. I’ve tried bringing on co-founders but have not had any success (although I am still trying). I’ve also tried working out of co-working locations hoping the atmosphere would change things, but that has not worked. \n\nAlmost everyday I think about closing shop or selling the company for peanuts and going back to the corporate world. As of now, I won’t do it because I know this is temporary and I will regret not pushing through. But damn there are days when I’m this close to saying f it. \n\nWondering if anyone has gone through this and if you have any advice you can share. ",
    "subreddit": "startups",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 465,
    "downs": 0,
    "created_utc": 1710388137.0,
    "media": null,
    "is_video": false,
    "num_comments": 299,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.62,
    "category_rationale": "Personal emotional account of solo founder loneliness with a request for advice.",
    "composite_score": 4.6119465440498315
  },
  {
    "score": 468,
    "title": "Your SaaS probably shouldn't exist. I will not promote",
    "selftext": "Gonna piss some people off but someone needs to say it. I talk to 3-5 SaaS founders every week 80% are building solutions to problems that don't really exist\n\nWe're like Slack but for restaurants, think Notion but specifically for real estate agents, it's basically Calendly but with AI. Man you need to stop, not everybody should have his own startup, do smth else.\n\nYou know what successful founders tell me? Customers were literally begging us to build this\n\nNot I think restaurants would like better communication. Asking for the solution ss in, they tried everything else and nothing worked.\n\nI worked with a founder last year who built construction project management software. Not because he thought construction needed better software (it obviously does), but because he ran a construction company for 10 years,tried every existing tool,none solved his actual workflow problems, his crew was literally using WhatsApp and Excel, other contractors kept asking what system he was building.\n\nThat's product-market fit before you even build.\n\nCompare that to founders who saw a market opportunity on some blog post, thought they could do X but better, built for a problem they read about but never experienced, are shocked when users don't care\n\nYour market research isn't listening to podcasts about TAM. It's having customers throw money at you to solve their pain\n\nIf you can't name 10 people who would pay for your solution TODAY, you probably shouldn't build it\n\nDo something else and usually these people assume that they will make it happen but after spending some time and money see it as a waste of time.",
    "subreddit": "startups",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 468,
    "downs": 0,
    "created_utc": 1749822144.0,
    "media": null,
    "is_video": false,
    "num_comments": 137,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Offers a mental-model style critique of SaaS viability and market needs.",
    "composite_score": 4.4461123859157015
  },
  {
    "score": 465,
    "title": "$100k H1B fee/year/visa is a government-sponsored plan to kill startups. ‘I will not promote’",
    "selftext": "Let's be real. Big Tech can pay a $100k/year fee for an engineer without even noticing. It's a rounding error for them.\n\nFor a startup, it's a death sentence. It makes hiring the best global talent impossible.\n\nThis isn't an immigration policy, it's a massive gift to the giants, giving them a government-enforced moat to monopolize talent. It's designed to make sure the next Google can never be built.\n\nAm I missing something here?",
    "subreddit": "startups",
    "upvote_ratio": 0.65,
    "subreddit_type": "public",
    "ups": 465,
    "downs": 0,
    "created_utc": 1758339473.0,
    "media": null,
    "is_video": false,
    "num_comments": 706,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Strong stance criticizing H1B fees as harmful to startups with moral framing.",
    "composite_score": 4.58059562358845
  },
  {
    "score": 448,
    "title": "Silicon Valley has a vision problem",
    "selftext": "You may have seen on social media yesterday that Humane, a Silicon Valley startup, has just released a new product, a little device that sits on your jacket and does some AI stuff. No one can tell exactly what it does, other than after raising $230 \\*million\\* dollars they’ve created a device that does less than an Apple Watch, and costs more.\n\nThe product is a complete flop, and yet no one would admit to it. Why?\n\nEven people who should know better that the market for this product does not exist are responding with things like : \"I don't know if this is it, but I love what they're trying.” , or “congratulations to the founders for trying something hard, and to the investors who invested into this.”\n\nThis is wrong. We should be honest about successes and failures regardless where they come from. If a pair of 20 something college dropouts launched a product like this, they would've been the laughing stack of the Internet for days. Remember Juicero, a startup that raised millions to reinvent a juicer, and failed spectacularly. We all recognized that was a waste. We understood, embraced it, and moved forward. The are plenty other examples where founders get scolded for trying hard things. Media constantly bashes Adam Neumann for doing something hard, or Elon Musk for building not one, but multiple spectacular companies. So why not Humane then?\n\nI think Silicon Valley has a vision problem, where they fund and celebrate people they like, regardless of the outcomes, and they ignore people they don’t like, regardless of the outcomes.\n\n$230 million could've founded 500 different startups, scrappy founders, who would've worked hard to first identify a problem and test the market before committing millions in resources to build something that nobody wants. Instead that money was wasted on very high salaries that produced a very murky result.\n\nTrying hard things should be celebrated, but doing it poorly should not be rewarded.",
    "subreddit": "startups",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 448,
    "downs": 0,
    "created_utc": 1699635075.0,
    "media": null,
    "is_video": false,
    "num_comments": 222,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Analyzes Silicon Valley funding biases and advocates for honest assessment.",
    "composite_score": 4.501398772527404
  },
  {
    "score": 442,
    "title": "[True Story] Non-technical founder tried to sell a 100% AI-generated MVP to a bank - I will not promote",
    "selftext": "Got a call yesterday from someone in my network. Fintech founder, zero technical background. Says she got hacked. As she tells me the story, I can't believe the chain of events.\n\nStarted like many do now: lovable, v0, cursor. Generating screens, connecting APIs. Great for validation at first. Problem is, she kept going. MONTHS wrestling with prompts until she had a monster with:\n\n* Credit scoring\n* AI agents\n* Dashboards\n* Reports\n* And many more\n\nAll prompt-generated. Zero understanding of the code. Shows it to a BANK. They like it. Tell her to move forward (she had a great business network btw). No idea what to do. Hires a team to \"refactor\". Quote: 300+ hours. Basically the cost of building a proper MVP from scratch.\n\nBut wait, it gets better.\n\nThe team she hired ALSO does vibe coding. They set up the server by asking ChatGPT. Result:\n\n* SSH open to the world\n* Root password: admin123 (or something similar)\n* No firewall\n* Nothing\n\nAutomated ransomware encrypted everything. Had to shut down, rotate all API keys (costing $$$), migrate everything.\n\nThe founder lost money on the hack, so much time, credibility with the client and trust in the process.\n\nHere's the thing: Would you send a contract to a client without reading it, just because AI wrote it? Would you send an investor pitch without knowing what it says? Of course not. So why would you run your entire technical infrastructure on code you can't read?\n\nAI amplifies what you already know. If you understand business, AI makes you better at business. If you know code, AI makes you code 10x faster. But if you know nothing about code and try to build a tech product with just prompts, you're not in control of your own company.\n\nThe new reality post-AI: You don't need 10 developers anymore. You need 1-3 people who REALLY know their domain, amplified by AI. That's more powerful than 20 people without AI.\n\nThat's what vibe coding in production is: unsupervised juniors all the way down.",
    "subreddit": "startups",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 442,
    "downs": 0,
    "created_utc": 1761311004.0,
    "media": null,
    "is_video": false,
    "num_comments": 208,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Narrative with lessons about AI-generated MVPs and better product strategy.",
    "composite_score": 4.496476869278597
  },
  {
    "score": 434,
    "title": "Startup spent $70,000 on custom icons and designer ghosted them",
    "selftext": "Cautionary tale. The designer hired is someone who apparently has a podcast with guests, and has a decent following.\n\nThe startup founder says he wasn't checking in on the guy's work because he hires people and trusts them to do the work, but this is a rule that can be followed for permanent employees/cofounders, not contractors. Also as a startup, you can't really afford to go 21+ days without verifying work is being done.\n\n[https://x.com/Shpigford/status/1807802947394588842](https://x.com/Shpigford/status/1807802947394588842)",
    "subreddit": "startups",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 434,
    "downs": 0,
    "created_utc": 1720138011.0,
    "media": null,
    "is_video": false,
    "num_comments": 129,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Brief cautionary anecdote about designer hiring with no clear guidance.",
    "composite_score": 4.407960933108056
  },
  {
    "score": 431,
    "title": "The whole I will not promote in post titles thing is just silly (I will not promote)",
    "selftext": "Seriously, what kind of weirdo implemented this rule. Feels like being in a first grade classroom with a strict teacher. Long time reader of this sub but it’s just such a random and weird thing to implement. Am I the only one that thinks this? I mean not only is it in the title but also the tag lmao, what? In before teacher deletes this post. \n\nIf you have to select the tag, remove the requirement to also put it in the headline. It makes the entire sub seem silly. I get that we want meaningful measures in place to keep this from being nothing but spam and promotion - but this is a bit redundant 😉 ",
    "subreddit": "startups",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 431,
    "downs": 0,
    "created_utc": 1746422714.0,
    "media": null,
    "is_video": false,
    "num_comments": 108,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Frustrated critique of a moderation rule in the post titles.",
    "composite_score": 4.351696995785224
  },
  {
    "score": 424,
    "title": ".io domains will likely be retired in the next five years",
    "selftext": "Last week, the UK government announced that it was handing over their Chagos Islands in the Indian Ocean to the neighboring island country of Mauritius. \n\nThe .io domain, widely used by tech companies like Github, is technically tied to the British Indian Ocean Territory. So, with the UK giving up control, the domain will most likely be retired within the next three to five years.\n\nFor the enthusiasts of internet history, it's worth noting this isn’t the first time we’ve seen a country code domain disappear—it's happened before with .su (USSR) and .yu (Yugoslavia). Gareth Edwards wrote an article called \"The Disappearance of an Internet Domain\" on Every about how the .io domain will likely be retired and you can read more about the history there   \n  \nSo, while .io’s popularity stems from its association with \"input/output,\" it could soon be a thing of the past. Tech startups might want to start planning for life after .io sooner rather than later. Domain squatters are likely already trying to grab everything related to currently popular .io domains. ",
    "subreddit": "startups",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 424,
    "downs": 0,
    "created_utc": 1728486062.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Informational projection about .io domain retirement and implications.",
    "composite_score": 4.2275503601105395
  },
  {
    "score": 422,
    "title": "why is every successful tech founder an Ivy League graduate? I will not promote",
    "selftext": "Look at the top startups founded in the last couple of years, nearly every founder seems to come from an Ivy League school, Stanford, or MIT, often with a perfect GPA. Why is that? Does being academically brilliant matter more than being a strong entrepreneur in the tech industry ? It’s always been this way but it’s even more now, at least there were a couple exceptions ( dropouts, non ivy…)\n\nEdit: My post refers to top universities, but the founders also all seem to have perfect grades. Why is that the case as well?",
    "subreddit": "startups",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 422,
    "downs": 0,
    "created_utc": 1751128986.0,
    "media": null,
    "is_video": false,
    "num_comments": 286,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Inquiry/critique about Ivy League dominance and founder success.",
    "composite_score": 4.515281315742039
  },
  {
    "score": 422,
    "title": "How I wasted 6 months building features nobody wanted - and what I learned about really listening to customers",
    "selftext": "It's painful to admit this, but I spent the first 6 months and nearly $40K of my own money building a startup in complete isolation. Like many technical founders, I fell into the classic trap of building features in isolation, thinking I knew what customers wanted. Here's what I learned the hard way.\n\n**The Expensive Assumption**\n\nMy assumption was simple: if customers were complaining about a problem, they'd want a solution.\n\nWrong.\n\nI built an entire suite of automation tools that absolutely nobody wanted to use. Why? Because I was building based on what I thought customers wanted, not what they were actually saying. They we talking about a problem they had but I didn't take the time to really figure out if they even really cared about having that problem solved for them or if they just wanted to complain. And I never took the proper time to figure out what the right solution to solve this problem was.\n\n**The Wake-Up Call**\n\nThe turning point came during a particularly painful sales call. A potential customer asked me, \"This is great, but what about \\[basic feature I hadn't even considered 🤦🏻‍♂️\\]?\"\n\nI confidently explained all the advanced features we had instead. Their response? \"That's cool, but it doesn't solve our core problem.\"\n\nThat's when it hit me: I had spent months building solutions for problems that weren't priorities for my customers.\n\n**The Real Problem**\n\nI realized I was:\n\n* Reading customer interviews through my own biased lens\n* Building features based on assumptions rather than evidence\n* Missing crucial conversations happening in places I wasn't looking\n\n**What I Did Next**\n\nI made three fundamental changes to how we approached product development:\n\n1. **Started monitoring actual conversations**\n   * Set up alerts for industry keywords\n   * Tracked competitor mentions\n   * Monitored relevant subreddits and forums\n   * Analyzed social media discussions\n2. **Created a \"conversation database\"**\n   * Logged every mention of our industry\n   * Categorized common pain points\n   * Tracked feature requests\n   * Noted recurring complaints about competitors\n3. **Developed a scoring system**\n   * Frequency of mention\n   * Intensity of pain point\n   * Willingness to pay\n   * Implementation complexity\n\n**The Results Were Eye-Opening**\n\nAfter three months of monitoring real conversations:\n\n* We discovered our target market's top 3 pain points were completely different from what we assumed\n* Found that customers were using workarounds we never knew existed\n* Identified several underserved niches in our market\n* Learned our competitors' weaknesses from their own customers\n\n**Key Lessons Learned**\n\n1. **The best product feedback isn't in interviews**\n   * People are more honest in natural conversations\n   * Forums and social media reveal real pain points\n   * Competitors' customers are a goldmine of insights\n2. **Feature requests aren't always what they seem**\n   * Look for the problem behind the request\n   * Track patterns across conversations\n   * Pay attention to workarounds people are using\n3. **Timing matters more than perfection**\n   * The \"perfect\" feature at the wrong time is useless\n   * Build based on current conversations, not future assumptions\n   * Release early and iterate based on real feedback\n\n**Practical Tips for Others**\n\nIf you're building a product right now:\n\n1. Set up Google Alerts for your industry keywords\n2. Join relevant communities where your customers hang out\n3. Follow your competitors' customers' conversations\n4. Create a system for tracking and categorizing what you learn\n5. Look for patterns in complaints and feature requests\n6. Pay attention to the language customers use to describe their problems\n\n**The Big Takeaway**\n\nYour customers are already telling you exactly what they want. They're just not telling it to you directly (just cause you read The Mom Test doesn't mean they're going to be honest with you). But they're having these conversations every day on Reddit, Twitter, leaving reviews for competitors, etc.\n\nThe key is to stop building what you think they want and start listening to what they're actually saying.",
    "subreddit": "startups",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 422,
    "downs": 0,
    "created_utc": 1729789426.0,
    "media": null,
    "is_video": false,
    "num_comments": 91,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.78,
    "category_rationale": "Provides a step-by-step recount and actionable changes to product development.",
    "composite_score": 4.32823428104782
  },
  {
    "score": 402,
    "title": "Share Your Startup - August 2023 - Upvote for Maximum Visibility",
    "selftext": "[**r/startups**](https://www.reddit.com/r/startups/) **wants to hear what you're working on!**\n\nTell us about your startup in a comment within this submission. Follow this template:\n=====================================================================================\n\n​\n\n*   **Startup Name / URL**\n*   **Location of Your Headquarters**\n    *   Let people know where you are based for possible local networking with you and to share local resources with you\n*   **Elevator Pitch/Explainer Video**\n*   **More details:**\n    *   What life cycle stage is your startup at? (reference the stages below)\n    *   Your role?\n*   **What goals are you trying to reach this month?**\n    *   How could [r/startups](https://www.reddit.com/r/startups/) help?\n    *   Do **NOT** solicit funds publicly--this may be illegal for you to do so\n*   **Discount for** [r/startups](/r/startups) **subscribers?**\n    *   Share how our community can get a discount\n\n​\n\n\n\\--------------------------------------------------\n\n​\n\n**Startup Life Cycle Stages** (Max Marmer life cycle model for startups as used by Startup Genome and Kauffman Foundation)\n\n**Discovery**\n\n*   Researching the market, the competitors, and the potential users\n*   Designing the first iteration of the user experience\n*   Working towards problem/solution fit (Market Validation)\n*   Building MVP\n\n​\n\n**Validation**\n\n*   Achieved problem/solution fit (Market Validation)\n*   MVP launched\n*   Conducting Product Validation\n*   Revising/refining user experience based on results of Product Validation tests\n*   Refining Product through new Versions (Ver.1+)\n*   Working towards product/market fit\n\n​\n\n**Efficiency**\n\n*   Achieved product/market fit\n*   Preparing to begin the scaling process\n*   Optimizing the user experience to handle aggressive user growth at scale\n*   Optimizing the performance of the product to handle aggressive user growth at scale\n*   Optimizing the operational workflows and systems in preparation for scaling\n*   Conducting validation tests of scaling strategies\n\n​\n\n**Scaling**\n\n*   Achieved validation of scaling strategies\n*   Achieved an acceptable level of optimization of the operational systems\n*   Actively pushing forward with aggressive growth\n*   Conducting validation tests to achieve a repeatable sales process at scale\n\n​\n\n**Profit Maximization**\n\n*   Successfully scaled the business and can now be considered an established company\n*   Expanding production and operations in order to increase revenue\n*   Optimizing systems to maximize profits\n\n​\n\n**Renewal**\n\n*   Has achieved near-peak profits\n*   Has achieved near-peak optimization of systems\n*   Actively seeking to reinvent the company and core products to stay innovative\n*   Actively seeking to acquire other companies and technologies to expand market share and relevancy\n*   Actively exploring horizontal and vertical expansion to increase prevent the decline of the company",
    "subreddit": "startups",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 402,
    "downs": 0,
    "created_utc": 1691689112.0,
    "media": null,
    "is_video": false,
    "num_comments": 660,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Prompt requesting startup submissions via a template; lacks a clear list, steps, or explanatory model.",
    "composite_score": 4.75790577588393
  },
  {
    "score": 404,
    "title": "Why does every startup think they need enterprise software when they have 12 customers?I WILL NOT PROMOTE",
    "selftext": "Company has 15 employees and 12 paying customers. Revenue maybe $8k/month. CEO goes we need to implement Salesforce for our CRM. I'm like why? You have 12 customers, you could manage them with a notebook. But no. They spend 3 months evaluating enterprise platforms, hire implementation consultants, train the whole team on software that has 400 features they'll never use.\n\nSix months later they're paying $3,600/year for something that a $15/month tool would've handled perfectly.\n\nReal example from last year marketing agency, 8 employees, maybe 20 active clients.\n\nThey needed enterprise project management software. Looked at Monday, Asana Business, even considered custom development. I asked what's wrong with a shared Google sheet?\n\n\"We need something scalable! Professional! Enterprise-grade!\" Enterprise-grade for 20 projects? Really?\n\nThey spent $8k on software licensing and setup. I checked back 6 months later - they were using maybe 10% of the features and half the team had gone back to email for project updates.\n\nMeanwhile their competitor manages 50+ clients with Trello and seems way more organized. The pattern is always the same\n\nStartup sees successful big company using Enterprise Thing Assumes Enterprise Thing is why big company succeeded Buys Enterprise Thing despite being 1/100th the size Discovers Enterprise Thing is overkill and confusing Goes back to simple tools but keeps paying for Enterprise Thing\n\nIt's like a 5-person company buying an 18-wheeler to deliver pizza. The psychology is weird too. Simple tools feel unprofessional even when they work perfectly. Google Sheets = amateur Salesforce = serious business. But Google Sheets might actually be better for a 12-customer company. Easier to use, faster to set up, everyone already knows how it works.\n\nI learned this the hard way with clients' businesses. They try to use professional tools from day one. HubSpot for 3 leads per month. Slack for a 2-person team. Advanced analytics for a website with 100 monthly visitors. They spend more time configuring software than talking to actual customers.\n\nNow I tell early-stage companies start with the simplest tool that works, upgrade only when you're actually hitting limits. Need customer tracking? Start with Google Sheets Need project management? Try Trello first Need team communication? Maybe just text each other\n\nBoring advice but it works. Save the enterprise stuff for when you're actually enterprise-sized.\n\nHere's my rule: if your monthly software costs are higher than your monthly revenue, you're doing it wrong. Most startups could run their entire operation with $200/month in tools. Instead they're spending $2,000/month trying to look like Google.\n\nDont do it ",
    "subreddit": "startups",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 404,
    "downs": 0,
    "created_utc": 1750787938.0,
    "media": null,
    "is_video": false,
    "num_comments": 137,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.77,
    "category_rationale": "Presents a central claim about over-engineering with reasoning and examples, i.e., a mental model about why startups shouldn't adopt enterprise software.",
    "composite_score": 4.412394566415287
  }
]