[
  {
    "score": 511,
    "title": "Brooo.... my startup just made its first ever sale, I’m shaking 😂",
    "selftext": "Not even kidding, I was refreshing my dashboard like a psycho and boom, first sale!!\n\n[Altrix](https://www.altrixautomation.com/) (my AI automation + web dev agency) finally got its first paying client after weeks of rejection and ghosting.\n\nFeels like someone finally believed in the idea.\n\nMight be small for some, but for me it’s huge. Sending virtual hugs to all solo founders grinding out there.❤️",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 511,
    "downs": 0,
    "created_utc": 1760324383.0,
    "media": null,
    "is_video": false,
    "num_comments": 152,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4691156763846305
  },
  {
    "score": 442,
    "title": "I wasted $50k because I thought the code was the expensive part.",
    "selftext": "Yeah, you read that right. We burned through an extra $50k not because our developers were slow, but because we were idiots about what an MVP actually costs.\n\nEveryone tells you to focus on the \"minimum\" and \"viable.\" What they don't tell you is that \"code\" is maybe half the battle. We obsessed over features and engineering timelines, and completely ignored the iceberg of costs lurking below the surface.\n\nOur first big punch to the gut? Legal. We launched our app, got a bit of traction, and then Apple rejected an update. Why? Our privacy policy and terms of service were garbage templates we pulled offline. That was a frantic two week scramble and a $5,000 bill from a lawyer we hadn't budgeted for.\n\nThen came the marketing \"budget.\" We figured the product was so good it would sell itself. Spoiler: it didn't. We had to spend thousands on ads just to get our first 100 users. Another unplanned expense.\n\nBut the real killer was support and operations. As soon as people started using the product, the bug reports and \"how do I do this\" emails flooded in. My cofounder and I were spending half our day answering support tickets instead of building the business. The \"viable\" part of our MVP was a joke because the user experience, including support, was terrible. We had to hire a part time support person way sooner than we planned.\n\nThis is the stuff the \"lean startup\" gurus conveniently forget to mention.\n\nAn MVP isn't just a piece of software. It’s a tiny, functioning business. And businesses have costs beyond the factory floor.\n\nSo here’s the rule we now live by at my agency: Take your most realistic, padded developer estimate. Then, add 50% on top of that for the \"everything else\" fund. This covers your legal setup, your initial marketing spend, your analytics tools, your server costs that will inevitably spike, and the cost of actually supporting your first users.\n\nAnd even that is before you add a 25% \"shit will hit the fan\" buffer. Because it always does.\n\nStop thinking of your MVP as a product launch. Start thinking of it as a business launch. The code is just the ticket to the game. Actually playing it is what costs you.\n\nWhat's the dumbest non code cost that almost sank your startup? Let's hear the war stories.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 442,
    "downs": 0,
    "created_utc": 1761498024.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.30771727186829
  },
  {
    "score": 335,
    "title": "Stop coding. You're building something nobody wants.",
    "selftext": "I mean it. Too many founders are so high on their own idea they spend months and thousands of dollars building a product that solves a problem nobody actually has. Your idea is a worthless assumption until someone who isn't your mom is willing to pay for it.\n\nThe \"gurus\" sell you on hustle and vision. I'm telling you that's how you go broke. Before you hire a dev or write a single line of code, you need to find the truth, not just confirmation.\n\nHere’s how you do it without a dev team.\n\n**1. Nail your one sentence hypothesis.**\n\nForget 50 page business plans. Write this down and stick it on your wall:\n\nMy target customer, [BE SPECIFIC], struggles with [A PAINFUL, SPECIFIC PROBLEM] and would pay to have it solved.\n\nA founder wanted to build a fitness app. Vague. He went to r/Fitness and realized what people actually hated was logging their workouts in confusing apps. His new hypothesis: “Gym goers who are serious about lifting struggle with clunky workout trackers and would pay for a faster, simpler way to log their sets and reps.” See the difference?\n\n**2. Run cheap experiments to prove yourself wrong.**\n\nYour goal here isn't to get a \"yes.\" It's to see if your idea can survive contact with reality.\n\n*   **The Landing Page Test:** Use Carrd or Notion to build a one page site. Don’t talk about features. Talk about the painful problem and the beautiful outcome your solution provides. Add a \"Get Early Access\" button that collects emails. If you can’t get 100 people to give you an email address, you sure as hell won't get them to give you a credit card.\n\n*   **The Manual 'Concierge' Service:** Sell the solution and deliver it yourself by hand. I know a founder who validated a complex B2B automation tool by running the entire service on Google Sheets and a bunch of Zaps for his first ten paying clients. They never knew. They just knew their problem was solved. He didn't build the real software until he had revenue.\n\n*   **The Social Media Smoke Test:** Post about the problem you’re solving on LinkedIn, Twitter, or a relevant subreddit. Don't pitch your product. Just talk about the pain. \"Anyone else hate how long it takes to [do X]?\" The responses will tell you everything. If people don’t even care enough to complain about the problem, they will never pay for a solution.\n\n**3. Read the results like a cold blooded realist.**\n\nLook at the data. A high email signup rate is a good signal. A bunch of people willing to pay you to solve the problem manually is an amazing signal.\n\nSilence is also data. Silence is a \"no.\"\n\nA lack of interest isn't a failure. It’s a cheap lesson. It’s a gift. Pivoting now costs you a weekend. A failed launch after six months of coding will cost you your savings and your sanity.\n\nStop treating your idea like a precious baby. Treat it like a lab rat. Put it through the maze. If it dies, you get another one. That's how you find the one that gets the cheese.\n\nWhat's the most expensive assumption you've ever made building a product?",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 335,
    "downs": 0,
    "created_utc": 1762102814.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.150152823035064
  },
  {
    "score": 314,
    "title": "What's the dumbest app idea you've had that you secretly think might work?",
    "selftext": "I want an app that just doesn't let you when you're about to make questionable 2am purchases online. Like a digital intervention friend that's like looking forward for your future best type stuff. Imagine you're scrolling Amazon at midnight, cart full of random shit you definitely don't need, and you get app notification like \"bro cmon, you still doing it remember when you bought 5 tees and only wore them once?\"  \n  \nCould have different intervention levels too. Like gentle friend mode, all the way up to brutal honesty mode. The premium version could sync with your bank account and be like notifying you of your available budget. Like if I win some money playing on Stake it reminds me what I need to buy and what I don't. My impulse control is nonexistent and my apartment looks like a Amazon warehouse exploded. Last week I bought a mini waffle maker at 3am because I thought I was gonna become a breakfast person... and I'm not one.  \n  \nWhat's your funny but maybe genius idea? Please tell me y'all have equally or similar chaotic late night shopping habits.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 314,
    "downs": 0,
    "created_utc": 1751489104.0,
    "media": null,
    "is_video": false,
    "num_comments": 149,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.321356183317441
  },
  {
    "score": 304,
    "title": "30 startup ideas I found after analyzing millions of podcast episodes (w/ problem, solution &amp; source)",
    "selftext": "Hey,\n\nI've been a bit of a podcast nerd for a long time. Around a year ago I began experimenting with transcription of podcasts for a SaaS I was running.\n\nI realized pretty quickly that there's a lot of knowledge and value in podcast discussions that is for all intents and purposes entirely unsearchable or discoverable to most people. I ended up stopping work on that initial product (party for lack of product/market fit, and partly because podcasting was far more interesting), and focussing on the podcast stuff full-time instead.\n\nGiven I'm in this space, have millions of transcripts, and transcribe thousands daily... I've been exploring fun ways to expose some of the interesting knowledge and conversations taking place that utilize our own data/api.\n\nI'm a big fan of the usual startup podcasts (My First Million, Greg Isenberg, etc. etc.) and so I built an automation that turns all of the startup ideas discussed into a weekly email digest.\n\nI always struggle to listen to as many episodes as I'd actually like to, so I thought I'd summarise the stuff I care about instead (startup opportunities being discussed).\n\nI thought you guys would find it interesting to see some of the ideas we've had so far.\n\nThey range from being completely whacky and blue sky, to pretty boring but realistic.\n\nA word of warning before anyone says – this is a big mixture of tech, ai, non-tech, local services, etc. ideas:\n\n1. Some of the ideas are completely mundane, but realistic (e.g. local window cleaning service)\n2. Some of the ideas are completely insane, blue sky, but sound super interesting\n\nHere's the latest 30:\n\n|Idea Name|Problem|Solution|Source|\n|:-|:-|:-|:-|\n|Tiger Window Cleaning - Premium Local Window Service|Local window cleaning service targeting homeowners. Traditional companies charging 2x market rate. Making $10k/month from $200 initial investment.|Local window cleaning service combining competitive pricing ($5/pane), excellent customer service, and quality guarantees. Uses modern tools like water-fed poles for efficiency. Implements systematic approach to customer communication and follow-up.|The Side Hustle Show - \"630: How this College Student’s Side Hustle Brings in $10k a Month\"|\n|Porch Pumpkins - Seasonal Decoration Service|Full-service porch pumpkin decoration. Homeowners spend $300-1350 per season. One operator making $1M in 8 weeks seasonal revenue.|Full-service seasonal porch decoration service focused on autumn/Halloween, including design, installation, maintenance, and removal. Offering premium curated pumpkin arrangements with various package tiers.|My First Million - \"The guy who gets paid $80K/yr to do nothing\"|\n|Silent Companion - Professional Presence Service|Professional silent companions for lonely people. Huge problem in Japan/globally. $68/session, $80k/year per companion. Non-sexual, just presence.|A professional companion service where individuals can rent a non-judgmental, quiet presence for various activities. The companion provides silent company without the pressure of conversation or social performance. They accompany clients to events, meals, or just sit quietly together.|My First Million - \"The guy who gets paid $80K/yr to do nothing\"|\n|VulnerableLeader - Leadership Authenticity Training Platform|Leadership vulnerability training platform. Leaders struggling with authentic communication. $2k/month per company subscription.|Leadership Vulnerability Platform - A digital training platform combining assessment tools, guided exercises, and peer support to help leaders develop authentic communication skills. The platform would include real-world scenarios, video coaching, and measurable metrics for tracking leadership growth through vulnerability.|Entrepreneurs on Fire - \"How to Create an Unbroken Business with Michael Unbroken: An EOFire Classic from 2021\"|\n|OneStepAhead - Micro-Mentorship Marketplace|Marketplace for 30-min mentorship calls with people one step ahead. Professionals seeking specific guidance. Takes 15% of session fees.|MicroMentor Marketplace - Platform connecting people with mentors who are just one step ahead in their journey for focused, affordable micro-mentorship sessions.|Entrepreneurs on Fire - \"How to Create an Unbroken Business with Michael Unbroken: An EOFire Classic from 2021\"|\n|NetworkAI - Smart Network Intelligence Platform|AI analyzing your network to find hidden valuable connections. Professionals missing opportunities in existing contacts. $49/month per user.|AI Network Navigator - Smart tool that analyzes your professional network across platforms, identifies valuable hidden connections, and suggests specific actionable ways to leverage relationships for mutual benefit.|Entrepreneurs on Fire - \"How to Create an Unbroken Business with Michael Unbroken: An EOFire Classic from 2021\"|\n|SalesForce-as-a-Service - White Label Enterprise Sales Teams|White-label enterprise sales teams for B2B SaaS. Companies need sales but can't hire/train. Recruit retail sellers, train for tech, charge 30% of deals closed.|Create a white-label enterprise sales team by recruiting natural salespeople from retail and direct sales backgrounds (e.g. mall kiosks, cutco knives). Train them specifically in B2B SaaS sales techniques and processes. Offer this trained sales force to tech companies on a contract basis.|My First Million - \"Life Hacks From The King of Introverts + 7 Business Ideas | ft. Nick Gray\"|\n|TechButler - Mobile Device Maintenance Service|Mobile tech maintenance service. Clean/optimize devices, improve WiFi, basic support. $100/visit to homes. Target affluent neighborhoods.|Mobile tech support service providing in-home device cleaning, optimization, and setup. Focus on common issues like WiFi improvement, device maintenance, and basic tech support.|My First Million - \"Life Hacks From The King of Introverts + 7 Business Ideas | ft. Nick Gray\"|\n|WelcomeBot - Automated Employee Onboarding Platform|Automated employee welcome platform. HR teams struggling with consistent onboarding. $99/month per 100 employees.|An automated onboarding platform that creates personalized welcome experiences through pre-recorded video messages, scheduled check-ins, and automated swag delivery. The platform would ensure consistent high-quality onboarding regardless of timing or location.|Entrepreneurs on Fire - \"Free Training on Building Systems and Processes to Scale Your Business with Chris Ronzio: An EOFire Classic from 2021\"|\n|ProcessBrain - Business Knowledge Documentation Platform|SaaS platform turning tribal knowledge into documented processes. Business owners spending hours training new hires. $199/month per company.|A software platform that makes it easy to document and delegate business processes and procedures. The platform would include templates, guided documentation flows, and tools to easily share and update procedures. It would help businesses create a comprehensive playbook of their operations.|Entrepreneurs on Fire - \"Free Training on Building Systems and Processes to Scale Your Business with Chris Ronzio: An EOFire Classic from 2021\"|\n|RealViz3D - Real Estate Visualization Platform|3D visualization service turning architectural plans into photorealistic renderings for real estate agents. Agents struggling with unbuilt property sales. Making $30-40k/year per operator.|Professional 3D modeling and rendering service that creates photorealistic visualizations of properties before they're built or renovated. The service transforms architectural plans into immersive 3D representations that show lighting, textures, and realistic details. This helps potential buyers fully understand and connect with the space before it physically exists.|Side Hustle School - \"#2861 - TBT: An Architect’s Side Hustle in 3D Real Estate Modeling\"|\n|GroundLevel - Executive Immersion Program|Structured program putting CEOs in front-line jobs. Executives disconnected from workers. $25k per placement.|A structured program that places executives and founders in front-line jobs (retail, warehouse, service) for 2-4 weeks with documentation and learning framework. Similar to Scott Heiferman's McDonald's experience but productized.|My First Million - \"He Sold His Company For $15M, Then Got A Job At McDonald’s\"|\n|TradeMatch - Modern Manufacturing Job Marketplace|Modern job board making manufacturing sexy again. Factory jobs paying $40/hr but can't recruit. $500 per successful referral.|A specialized job marketplace and recruitment platform focused exclusively on modern manufacturing and trade jobs. The platform would combine TikTok-style content marketing, referral programs, and modern UX to make manufacturing jobs appealing to Gen Z and young workers. Would leverage existing $500 referral fees and industry demand.|My First Million - \"He Sold His Company For $15M, Then Got A Job At McDonald’s\"|\n|PublishPlus - Publishing Backend Monetization|Backend monetization system for publishing companies. One-time customers becoming recurring revenue. Grew business from $2M to $110M revenue.|Add complementary backend products and services to increase customer lifetime value. Develop software tools and additional services that natural extend from initial publishing product. Focus on high-margin recurring revenue streams.|My First Million - \"I Lost Everything Twice… Then Made $26M In 18 Months | Alex Hormozi Interview\"|\n|Somewhere - Global Talent Marketplace|Platform connecting US companies with vetted overseas talent. Tech roles costing $150k locally filled for 50% less. Grew from $15M to $52M valuation in 9 months.|Platform connecting US companies with pre-vetted overseas talent at significantly lower rates while maintaining high quality. Handles payments, contracts, and quality assurance to remove friction from global hiring.|My First Million - \"I Lost Everything Twice… Then Made $26M In 18 Months | Alex Hormozi Interview\"|\n|GymLaunch - Rapid Gym Turnaround Service|Consultants flying to struggling gyms to implement proven member acquisition systems. Gym owners lacking sales expertise. Made $100k in first 21 days.|Expert consultants fly in to implement proven member acquisition systems, train staff, and rapidly fill gyms with new members. The service combines sales training, marketing automation, and proven conversion tactics to transform struggling gyms into profitable businesses within weeks.|My First Million - \"I Lost Everything Twice… Then Made $26M In 18 Months | Alex Hormozi Interview\"|\n|ContentMorph - Automated Cross-Platform Content Adaptation|AI platform converting blog posts into platform-optimized social content. Marketing teams spending 5hrs/post on manual adaptation. $199/mo per brand with 50% margins.|An AI-powered platform that automatically transforms long-form content (blog posts, podcasts, videos) into platform-specific formats (Instagram reels, TikToks, tweets). The system would preserve brand voice while optimizing for each platform's unique requirements and best practices.|Entrepreneurs on Fire - \"Digital Threads: The Entrepreneur Playbook for Digital-First Marketing with Neal Schaffer\"|\n|MarketerMatch - Verified Digital Marketing Talent Marketplace|Marketplace for pre-vetted digital marketing specialists. Entrepreneurs spending 15hrs/week on marketing tasks. Platform takes 15% commission averaging $900/month per active client.|A specialized marketplace exclusively for digital marketing professionals, pre-vetted for specific skills (video editing, social media, SEO, etc.). Platform includes skill verification, portfolio review, and specialization matching.|Entrepreneurs on Fire - \"Digital Threads: The Entrepreneur Playbook for Digital-First Marketing with Neal Schaffer\"|\n|FocusMatch - Research Participant Marketplace|Marketplace connecting companies to paid research participants. Companies spending weeks finding people. $50-150/hour per study.|Online platform connecting companies directly with paid research participants. Participants create detailed profiles and get matched to relevant studies. Companies get faster access to their target demographic while participants earn money sharing opinions.|The Side Hustle Show - \"639: 30 Ways to Make Extra Money for the Holidays\"|\n|LightPro - Holiday Light Installation Service|Professional Christmas light installation service. Homeowners afraid of ladders. $500-2000 per house plus storage.|Professional Christmas light installation service targeting residential and commercial properties. Full-service offering including design, installation, maintenance, removal and storage. Focus on safety and premium aesthetic results.|The Side Hustle Show - \"639: 30 Ways to Make Extra Money for the Holidays\"|\n|KidFinance - Children's Financial Education Entertainment|Children's media franchise teaching financial literacy. Former preschool teacher creating 'Dora for money'. Books, videos, merchandise potential.|Character-driven financial education content for kids, including books, videos, and potentially TV show. Focus on making money concepts fun and memorable.|The Side Hustle Show - \"How a Free Challenge Turned Into a $500,000 a Year Business (Greatest Hits)\"|\n|FinanceTasker - Daily Financial Task Challenge|Free 30-day financial challenge with daily action items. People overwhelmed by money management. Makes $500k/year through books, speaking, and premium membership.|A free 30-day financial challenge delivering one simple, actionable task per day via email. Each task includes detailed scripts and instructions. Participants join a Facebook community for support and accountability. The program focuses on quick wins to build momentum. Automated delivery allows scaling.|The Side Hustle Show - \"How a Free Challenge Turned Into a $500,000 a Year Business (Greatest Hits)\"|\n|FinanceAcademy - Expert Financial Training Platform|Premium financial education platform. $13/month for expert-led courses and live Q&amp;As. 4000+ members generating $40k+/month.|Premium membership site with expert-led courses, live Q&amp;As, and community support. Focus on specific topics like real estate investing, business creation, and advanced money management.|The Side Hustle Show - \"How a Free Challenge Turned Into a $500,000 a Year Business (Greatest Hits)\"|\n|SolarShine Pro - Specialized Solar Panel Cleaning Service|Solar panel cleaning service using specialized equipment. Panels lose 50% efficiency when dirty. $650 per job, automated scheduling generates $18k/month from repeat customers.|Professional solar panel cleaning service using specialized deionized water system and European cleaning equipment. Includes automated 6-month scheduling, professional liability coverage, and warranty-safe cleaning processes. Service is bundled with inspection and performance monitoring.|The UpFlip Podcast - \"156. $18K/Month with This ONE Service — Niche Business Idea\"|\n|ExteriorCare Complete - One-Stop Exterior Maintenance Service|One-stop exterior home cleaning service (solar, windows, gutters, bird proofing). Automated scheduling. $650 average ticket. 60% repeat customers on 6-month contracts.|All-in-one exterior cleaning service offering comprehensive maintenance packages including solar, windows, gutters, roof cleaning and bird proofing. Single point of contact, consistent quality, and automated scheduling for all services.|The UpFlip Podcast - \"156. $18K/Month with This ONE Service — Niche Business Idea\"|\n|ContentAds Pro - Smart Display Ad Implementation|Display ad implementation service for content creators. Bloggers losing thousands in ad revenue monthly. Makes $3-5k per site setup plus ongoing optimization fees.|Implementation of professional display advertising through networks like Mediavine that specialize in optimizing ad placement and revenue while maintaining user experience. Include features like turning off ads for email subscribers and careful placement to minimize impact on core metrics.|The Side Hustle Show - \"636: Is Business Coaching Worth It? A Look Inside the last 12 months of Side Hustle Nation\"|\n|MoneyAppReviews - Professional Side Hustle App Testing|Professional testing service for money-making apps. People wasting time on low-paying apps. Makes $20k/month from affiliate commissions and ads.|Professional app testing service that systematically reviews money-making apps and creates detailed, honest reviews including actual earnings data, time investment, and practical tips.|The Side Hustle Show - \"636: Is Business Coaching Worth It? A Look Inside the last 12 months of Side Hustle Nation\"|\n|ConvoTracker - Community Discussion Monitoring Platform|Community discussion monitoring across Reddit, Twitter, HN. Companies missing sales opportunities. $499/month per brand tracked.|Comprehensive monitoring system that tracks competitor mentions and industry discussions across multiple platforms (Reddit, Twitter, Hacker News, etc.) with automated alerts and engagement suggestions.|In the Pit with Cody Schneider | Marketing | Growth | Startups - \"this founder got to $7M ARR in under 2 years: here’s why Vanta is compliance theatre not real cybersecurity\"|\n|SecurityFirst Compliance - Real Security + Compliance Platform|Security-first compliance platform built by hackers. Companies spending $50k+ on fake security. Making $7M/year showing why current solutions don't work.|A compliance platform built by security experts that combines mandatory compliance requirements with real security measures. The solution includes hands-on security testing, expert guidance, and a focus on actual threat prevention rather than just documentation. It merges traditional compliance workflows with practical security implementations.|In the Pit with Cody Schneider | Marketing | Growth | Startups - \"this founder got to $7M ARR in under 2 years: here’s why Vanta is compliance theatre not real cybersecurity\"|\n|LinkedInbound - Automated Professional Visibility Engine|LinkedIn automation for inbound job offers. Professionals spending hours on manual outreach. $99/month per job seeker.|Automated system for creating visibility and generating inbound interest on LinkedIn through coordinated profile viewing and engagement. Uses multiple accounts to create visibility patterns that trigger curiosity and inbound messages.|In the Pit with Cody Schneider | Marketing | Growth | Startups - \"this founder got to $7M ARR in under 2 years: here’s why Vanta is compliance theatre not real cybersecurity\"|\n\nHope this is useful. If anyone would like to ensure I include any particular podcasts or episodes etc. in future posts, very happy to do so.\n\nI'll generally send \\~5 ideas per week in a short weekly digest format (you can see the format I'd usually use in here: https://podcastmarketwatch.beehiiv.com/).\n\nCheers!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 304,
    "downs": 0,
    "created_utc": 1731363015.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.025691767706654
  },
  {
    "score": 249,
    "title": "Stop wasting $10K building an app no one wants",
    "selftext": "I’ll say it again, if you’re spending money before validating demand, you’re not building a startup, you’re funding a fantasy.\n\nToo many “founders” drop $15K to $20K building products nobody asked for, polishing logos, hiring developers, all while skipping the most important step: proving someone actually wants it.\n\nHere’s what you should do instead,\nTake $500 to $1,000, that’s it.\nUse it to build a clean landing page, a logo, and set up your ad accounts.\nThen run traffic, TikTok, Instagram, Google, whatever channel makes sense.\nWatch how people behave, do they click, do they sign up, do they care?\n\nThat’s validation,\nNot your pitch deck, not your “waitlist,” not your friends saying “it’s a great idea.”\n\nIf nobody clicks, congrats, you just saved yourself $19K and six months of delusion.\nIf they do, now you’ve got data, something real, a foundation to build from.\n\nValidation isn’t optional, it’s the whole game.\nBefore you spend a dime building, test with traffic, test by intent, let the market tell you the truth.\n\nSerious question, how many of you have actually fallen into this trap before? Built something, spent thousands, and later realized you should have just tested the idea first? What did you learn from that experience",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 249,
    "downs": 0,
    "created_utc": 1760869671.0,
    "media": null,
    "is_video": false,
    "num_comments": 154,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.205605857757183
  },
  {
    "score": 238,
    "title": "i hacked together something that cuts API integration from days to seconds..",
    "selftext": "i was super tired of losing entire days just wiring up backend integrations every single time my app needed a new API. Last weekend I said screw it and whipped up a quick script that basicaly automates the whole thing. You feed it a messy API spec (or even just a URL), it figures things out, and you get a fully deployable backend.  \n  \nIs this a pain you've felt? Or am I solving just my own annoyance?  \n  \nWhat red flags pop up immediately?  \n  \nWould anyone want to test it out and help me find where it breaks? Comment if you do",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 238,
    "downs": 0,
    "created_utc": 1750805586.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.876927896612119
  },
  {
    "score": 230,
    "title": "Share your startup, I’ll find 5 potential customers for you (free).",
    "selftext": "Hey everyone,\n\nI’d love to help some founders here connect with real potential customers.  \nDrop your startup link + a quick line about who your target customer is.\n\nWithin 24 hours, I’ll send you 5 people who are *already showing buying intent* for something like what you’re building.\n\nI’ll be using our tool [gojiberry.ai](http://gojiberry.ai), which tracks online conversations for signals that someone is in the market. But this is mostly an experiment to see if it’s genuinely useful for folks here.\n\nAll I need from you:\n\n* Your website\n* One sentence on who it’s for\n\nCapping this at 20 founders since it requires some manual work on my end.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 230,
    "downs": 0,
    "created_utc": 1757249321.0,
    "media": null,
    "is_video": false,
    "num_comments": 270,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.270096625329348
  },
  {
    "score": 214,
    "title": "Pitch your startup idea in 5 words or less. Let’s self promote",
    "selftext": "I work at Forum Ventures; we’re a B2B SaaS accelerator and pre-seed fund run by former founders. We write $100K VC cheques at the idea and pre-seed stage, helping founders go from zero to one.\n\nWhen pitching its important to keep things short and concise to maximize responses; lets put that to practice here by pitching your startup idea in 5 words or less. Include a link too!\n\nWe’ll make this a thread of partnership and mutual support.\n\nAs a founder first accelerator, our team at Forum is happy to chat if you’re building something early-stage.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 214,
    "downs": 0,
    "created_utc": 1763405984.0,
    "media": null,
    "is_video": false,
    "num_comments": 779,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.4609857612608455
  },
  {
    "score": 208,
    "title": "You’re overcomplicating it. Just solve a real problem. (Got my SaaS to $3,600 MRR)",
    "selftext": "First off, [MRR proof](https://imgur.com/a/NdybW3R) since it's Reddit.\n\nI see so many people making this same mistake when trying to build the product that’s going to make them passive income.\n\nYou find what you think is the perfect idea for a product, then you do a little market research and find out someone else has built it already.\n\nYou conclude that it’s over. It’s already been done so you have to start all over again and find a new perfect idea. **That’s the first wrong conclusion.**\n\nThen you try finding the idea that’s going to change the world, that will reinvent the whole industry. You spend hours searching for an idea like this and most of you never find it. You conclude that maybe entrepreneurship isn’t for you and you should go back to the 9-5. **That’s the second wrong conclusion.**\n\nNow you’re all out of ideas. You have no clue where to look for new ones, nothing interesting comes to you, and everyone else takes all the good ideas that you should’ve thought of. You conclude that you’re simply not creative enough to come up with good ideas. **That’s the third wrong conclusion.**\n\nThat's three strikes. You’re out.\n\nNow, let’s look at why all these three conclusions are wrong:\n\n**Someone has already built the idea**\n\nYou mean that someone has already validated that demand exists and that people are willing to pay for a solution? Or do you mean that this business has taken every single customer that exists on the market, like every last one? Just because business X solves Y problem doesn’t mean that every person in the world who experiences Y problem knows about business X.\n\nThe truth is, you could build the exact same solution and still capture your share of the market. However, the better approach is to find your unique spin on the idea to better serve a specific group of people that business X might miss.\n\n**Your idea has to change the world to be worth building**\n\nDoes it? When was the last time you paid for a tube of toothpaste? Did you buy it hoping it would change your life? Did you even think twice about buying it? You just need to start by solving a problem that people experience. If your solution is valuable to them, they will tell you by giving you their hard-earned value (money) in return. It’s time to stop thinking of yourself as Steve Jobs, it’s just holding you back.\n\nNow, this simple idea will change over time as you receive customer feedback and start shaping it into something that people really want. Eventually, you might actually find yourself with a product that changes the world, but it all starts with just solving a real problem.\n\n**You’re not creative enough to come up with a good idea**\n\nYou don’t have to be especially creative to find a good idea. Just look at problems you experience yourself. This could be in your day-to-day life, at work, in an industry you have experience in, or in something you’re passionate about. Start by simply looking for a problem, not a solution. Is your life problem-free? Congrats, Buddha. For the rest of you, it shouldn’t take long to find a problem with potential here.\n\nIf you still need more help, try this [tool](https://buildpad.io/?ref=Reddit) to find a problem and to do simple market research to see if it’s worth solving.\n\nWhat I want to achieve with this post is to get some of you over the barrier of endlessly searching for perfect ideas. The real work is in constantly improving the product to slowly shape it into something that’s really good. That’s where you should be spending your time.\n\nDon’t look for a million-dollar idea, just solve a real problem.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 208,
    "downs": 0,
    "created_utc": 1743427206.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.775885744632182
  },
  {
    "score": 199,
    "title": "I built a no BS LinkedIn - hit #1 on HackerNews",
    "selftext": "**What happend**  \nLaunched on Hacker News 2 days ago and…\n\n* 🔥 450 upvotes\n* 💬 450 comments\n* 👀 17k+ visitors\n* ✅ 420 signups\n* 📥 330 waitlist entries\n\nAll 100% bootstrapped. MVP built with React,Python MongoDB and of course Cursor \\^\\^.\n\nNow I’m trying to figure out:\n\n* Do I keep it free for users and charge recruiters?\n* Is this just a spike or a wedge into something much bigger?\n* Should I stay bootstrapped or raise a small round to accelerate growth?\n\nWould love to hear from other indie hackers here - what would you do?\n\n**Backgrounstory if interested:**  \nI built [**Openspot**](https://heyopenspot.com/) out of personal frustration. I was tired of the resume black hole and the performative chaos of LinkedIn, as I wasnt able to get the internship I wanted.  \nThat led me to building my own micro site and uploading a video resume on youtube which than got me my internship instantly...but I wondered If I can help people achieve the same much simpler.\n\nSo I build:  \nA public directory for people open to new opportunities.  \nNo feed. No likes. Just clean, modern, beautiful and customizable profiles (video, audio and images optional) that help you actually stand out with unique \"Behind The Profile\" prompts crafted just for you.\n\n",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 199,
    "downs": 0,
    "created_utc": 1743027326.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8790316674813807
  },
  {
    "score": 189,
    "title": "I made a ‘Tinder for Ideas’ because I was tired of my ideas dying alone in my notes app",
    "selftext": "I use to have a lot of ideas in my mind... Some are worthwhile (I believe but never say never), some are not, but I struggle to work alone to them because I feel I don't have the support or recognition.\n\nIt seems I work more when I do something with someone, is it only me??\n\nSo, going to the point, I've created an app (Swidea.fyi) where we can submit ideas and swipe (like tinder ahah) others' ideas.\n\nThe cool parts that you can connect based on a concept. After making a match, you can communicate and engage with the other individual to talk about the concept that ignited your shared curiosity.\n\nI've just lunched so I hope you will like and try it, please tell me if it was bad idea :D\n\n**In 10 hours I've reached 55 users**, not epic but not bad thanks to a single reddit post. Since I've received good feedbacks so far, I've decided to insert notifications and improve the swiping.\n\nI'll let you know below how it goes with users and If I succeed to get 1k active users, let's see!!\n\nPlease let me know if you want to try!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 189,
    "downs": 0,
    "created_utc": 1734345980.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.872829226144651
  },
  {
    "score": 178,
    "title": "What's your startup idea for 2026? Let's self promote.",
    "selftext": "Christmas and the New Year is just around the corner! We're getting ready for another year of cool startup ideas. What are you building or planning to build for the incoming year of 2026?\n\nI work at [Forum Ventures](https://www.forumvc.com); we’re a startup accelerator and pre-seed fund based in New York, investing in pre-revenue, idea stage entrepreneurs who are highly technical or young and scrappy.\n\nLet's make this thread a channel for you to promote your own startup idea, find opportunities, and partnerships.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 178,
    "downs": 0,
    "created_utc": 1766512828.0,
    "media": null,
    "is_video": false,
    "num_comments": 400,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.289425217289985
  },
  {
    "score": 177,
    "title": "Most startup ideas now are moronic",
    "selftext": "I went to a startup fair some time back and there was one booth where a guy was talking to around 50 people at a time like he was Steve Jobs in his prime. \n\nSo I heard his product idea. It's basically a social media app for everyone in your neighborhood. You can post notes, media, comment on other peoples posts, etc. and it's supposed to bring everyone in the neighborhood closer together.\n\nSO it's pretty much just a crappier version of Facebook, because instead of interacting with the whole world, the network is now even smaller and localized to your immediate neighborhood.\n\nI feel like most of the people getting into this are just copy cats and in it solely for the money. They just have to build SOMETHING no matter what it is.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 177,
    "downs": 0,
    "created_utc": 1763242794.0,
    "media": null,
    "is_video": false,
    "num_comments": 125,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.020605274867675
  },
  {
    "score": 170,
    "title": "Wasted $3k because I didn't properly research my business name. Learn from my stupidity.",
    "selftext": "Month 2 of building my cleaning service and I already learned an expensive lesson.\n\nWhat happened:\n\nSpent weeks on the perfect name: \"SparkleClean Solutions.\" Designed logo, printed cards, built website, bought van decals.\n\nThen tried to register my LLC.\n\nRejected.\n\n\"Sparkle Clean Services\" already existed in my state. Secretary of State considers \"Solutions\" vs \"Services\" too similar - same industry, phonetically identical.\n\nI Googled it, checked domains, searched Instagram. But never checked the STATE BUSINESS REGISTRY.\n\nThe damage:\n\n* $450 printed materials\n* $280 van decals (never used)\n* $1,200 website redesign\n* $150 domains I can't use\n* 40 hours lost\n\nWhat I should have done:\n\n1. Check state business registry FIRST (every state has searchable database)\n2. Search USPTO trademark database\n3. Test similar spellings/variations\n4. Verify you can legally use certain words (\"Certified\" requires actual credentials)\n5. Think about expansion (my new name \"ClearView Home Services\" works for future services too)\n\nFound this guide from [InCorp](https://www.incorp.com/resources/knowledge-base/how-to-name-your-business) that covers the entire legal naming process - wish I'd read it BEFORE starting.\n\nNew process: Brainstormed 10 names → eliminated 6 after state search → eliminated 2 after trademark search → registered immediately → THEN started branding.\n\nPro tip: Register FAST once available. While redesigning, someone took my backup name. These databases are public.\n\n30 minutes of research upfront saves weeks of expensive rework.\n\nAnyone else learn this the hard way?",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 170,
    "downs": 0,
    "created_utc": 1760735623.0,
    "media": null,
    "is_video": false,
    "num_comments": 57,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8047101071736225
  },
  {
    "score": 154,
    "title": "We went from 0 users to 1600+ users after 80 days of effort and $0 spent.",
    "selftext": "I'll tell you exactly how we did it, but first you should know:\n\n**the bar is a lot lower than you think.**\n\n* Most people aren't following a clear process for building and launching their products.\n* Most people quit trying after 2-5 months.\n* Most people don't have a plan.\n\nYou don't need to work 70 hour weeks and be an expert to succeed. You just need to not make the common mistakes and stick around for a bit longer. That's enough.\n\n**Now, here's exactly how we went from 0 users and 0 traffic to 1600+ users with 80 days of effort and $0 spent:**\n\nStep 1 - Foundation:\n\n* You shouldn't build any random idea. Your idea needs to be validated or else it won't resonate.\n* We used the Reddit to determine market demand for a few different ideas.\n* We found one idea that indicated market demand and that we felt excited about.\n* So we started building right? Nope.\n* We reached out to potential users about the idea we had and kindly asked if they would help us by answering 6-7 questions. We found these people on Reddit and X.\n* Their answers indicated that people had the problem we were looking to solve and that they were interested in the product we would build, and even be ready to pay for it if it was good.\n* Great. Now we build.\n\nStep 2 - Building:\n\n* This is the easy part. We knew what we should focus on from the feedback so we let that guide our building.\n* We built fast. 30-45 days for the MVP.\n* We made sure that our MVP actually solved the problem we had identified.\n* That's it. Time to market this MVP and see if we can get some users.\n\nStep 3 - Marketing:\n\n* First we set a clear goal. We wanted as much feedback as possible so we were going to need active users. Let's say 20 active users, that was our goal.\n* Then we selected 2 marketing channels we believed in. What marketing channel you select depends on where your potential users are and who they are. For us it was Reddit and X.\n* Then we set daily volume targets. For example, post 50 replies on X on relevant posts.\n* So we had our daily targets, meaning we knew exactly what to do every day. We thought it would be reasonable to expect that we can hit our goal of 20 active users in 2 weeks.\n* Then we just executed our marketing plan. It was easy, because we knew what to do every day. No questions.\n* 10 days later we were at 70+ users. We had hit our goal.\n* The feedback on our MVP was good so we got the green light to build the full product. Let’s go!\n\nStep 4 - Build again:\n\n* This time we had much better feedback.\n* We removed everything that was bad.\n* Added some good things.\n* And made sure we were still focused on solving the core problem.\n* Voila, we had a pretty awesome product at this point that users actually want.\n* Time for the official launch.\n\nStep 5 - The launch\n\n* Since our product is made for founders, Product Hunt was the perfect place for us to launch.\n* We prepared a demo of the product, wrote a launch post, said our prayers, and then we launched.\n* During the launch, we tried to drive as much traffic to our Product Hunt page as we could.\n* This meant creating a lot of content on X and Reddit.\n* It was a close race for the top 5 spots. Our small team of 2 brothers vs the large VC backed companies.\n* In the end we claimed the 4th spot on product of the day with 500+ upvotes. Success!\n* You can find the launch post here: [https://www.producthunt.com/products/buildpad#buildpad](https://www.producthunt.com/products/buildpad#buildpad)\n\nStep 6 - Iterate\n\n* At this point we had over 1k users and had gotten our first paying customers too.\n* Now it was just about iteration.\n* Collect feedback &gt; improve the product &gt; market more &gt; collect feedback …\n* This is what we did to get to 40+ paying customers and 1600+ users.\n\nBut how did we know that these are the steps we should take to get there? How did we come up with this plan? The truth is, **we stole it.**\n\nLet me explain myself.\n\nEarlier this year we failed hard. We spent months building a product that people didn't want. We tried everything to make it work (including spending $1k on ads), but we weren't able to turn it into a success.\n\nIt was really weird because we thought we had something good. The product made sense to us.\n\nFinally, we came to a point of sober thought. We had wasted months on a bad product. That sucked, but at least there were some lessons to be learned.\n\nWhen reflecting on what had gone wrong, it became clear. **We had made the same mistakes that 95% of entrepreneurs make.**\n\nWe didn't follow a clear process. We spent our time on the wrong things. We didn't have a plan. There were a lot of mistakes and we kept seeing other people make them too.\n\nSo what if we build a product that solves that problem?\n\nA business building platform for entrepreneurs. The idea spoke to us deeply. We feel your struggles. We know how much it sucks to spend months building something, only to find out that no one wants it.\n\n**The product we built was meant for you and us.**\n\nNow to the cool part.\n\nWe used the product we built to get help building the product we built. Confusing? Let me explain:\n\nThe process I outlined above that got us our first 1600+ users wasn't us just freestyling. It was a carefully crafted process by Buildpad.\n\nWe started building Buildpad and as we did we used it at the same time to guide ourselves. **In a way, Buildpad built Buildpad.**\n\nSuper meta, I know.\n\nBut that's what happened. And if you’re tired of building failed products, maybe give Buildpad a chance?\n\nProbably don't build another Buildpad though. My head starts spinning when I think about the meta of that.\n\n**But you can build something you feel passionate about and that people will pay you for.** Or you can import your existing project and get help in getting that off the ground.\n\nOnce you've gotten your first payments and things are looking good for your business, perhaps you will consider giving us some feedback so we can make Buildpad even better.\n\nThis was a long post but it's something close to my heart. I hope you could learn something from our failures and our successes. And if you think Buildpad might be for you I'll leave a [link.](https://buildpad.io/?ref=Reddit)\n\nI'm happy to offer my input in the comments if you have any questions.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 154,
    "downs": 0,
    "created_utc": 1732213270.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7345659259600845
  },
  {
    "score": 144,
    "title": "My First No-Code SaaS Took off - $8K in 40 days",
    "selftext": "Hey Reddit! I wanted to share my journey with Directify, a no-code directory website builder I've been working on, and how it's absolutely crushed its first month.\n\n## The Backstory\nLike many of you, I've been grinding on side projects for years. I started to sell Starter Kits by the beginning of the year, and among them I had Directory Starter Kit. One of my customers who bought that, asked me \"Do you plan to have Directory as a SaaS one day, to not care about hosting, fully no-code, easy setup, templates, etc\". That's when the idea poped out and Directify was born.\n\n## What is Directify?\nIt's a no-code platform that lets users:\n- Create directory websites in minutes\n- Add listings, categories, and search functionality\n- Add custom codes, styles, \n- Monetize through paid listings and ads\n\n## The Numbers\n- Revenue: $8199 in first 40 days\n- Users: 263\n- Directories created: 330\n- Listings added: 3647\n\n## Key Learnings\n1. Solve a real problem people actually have\n2. Price competitively (starts at $24.5/month)\n3. Focus on user experience\n4. Provide killer customer support\n\n## Challenges\n- Initial marketing was tough\n- Lots of late nights debugging\n- Constant feature improvements\n\n## Next Steps\n- Add more template designs\n- Provide more customizations\n- Expand marketing channels\n\nWould love to hear your thoughts and experiences with no-code tools! Any questions about Directify, ask away.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 144,
    "downs": 0,
    "created_utc": 1733478000.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6502599305948427
  },
  {
    "score": 139,
    "title": "Share your startup, I’ll find 5 potential customers for you (free).",
    "selftext": "Hey everyone,\n\nI’d love to help some founders here connect with real potential customers.  \nDrop your startup link + a quick line about who your target customer is.\n\nWithin 24 hours, I’ll send you 5 people who are *already showing buying intent* for something like what you’re building.\n\nI’ll be using our tool [gojiberry.ai](http://gojiberry.ai), which tracks online conversations for signals that someone is in the market. But this is mostly an experiment to see if it’s genuinely useful for folks here.\n\nAll I need from you:\n\n* Your website\n* One sentence on who it’s for\n\nCapping this at 20 founders since it requires some manual work on my end.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1758128837.0,
    "media": null,
    "is_video": false,
    "num_comments": 302,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.09184934992939
  },
  {
    "score": 137,
    "title": "I stopped waiting for the perfect startup idea and started running weekly experiments instead",
    "selftext": "For years I believed the main problem was not having “the” idea. I kept thinking once I stumbled on that one perfect concept, everything else would flow. So I hoarded startup ideas in notes apps, revisited them, tweaked them, but never seriously tested any. It felt safer to stay in the thinking phase than risk proving an idea wasn’t good.\n\nWhat changed was discovering how many successful founders simply treated ideas like hypotheses. In a collection of real founder stories inside a [Foundertoolkit](http://foundertoolkit.org) I use, the consistent theme was that most winning products weren’t their first ideas, they were the survivors of a ruthless validation process.\n\nSo I set a rule for myself: one idea, one weekend, one clear outcome. Every Friday I pick a single idea and spend the evening digging for real-world complaints about the problem online. If I can’t find people actively struggling with it, the idea doesn’t move forward.\n\nIf it passes that test, Saturday is for talking to people and asking if they’d pay a specific price to solve that problem. No more vague “would you use this?” conversations. I lifted the exact questions from those founder interviews because my own attempts were always too soft. If I can’t get at least a small number of clear yeses, the idea is dead.\n\nOnly then do I throw up a landing page and attempt to get a few signups or pre-orders. By Sunday night I have a decision based on behavior, not my attachment. I’ve killed far more ideas than I’ve kept, but for the first time I have one that passed every stage and is turning into something real.\n\nThe irony is the moment I stopped idolizing startup ideas and started stress-testing them is when I finally found one worth committing to.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 137,
    "downs": 0,
    "created_utc": 1766158828.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.679003731600187
  },
  {
    "score": 135,
    "title": "I made a website where you can “pretend” to work and actually build  instead of feel umemployed",
    "selftext": "Hey Reddit,\n\nThis started as a personal problem.\n\nWhen I wasn’t working, I realized the hardest part wasn’t money — it was the **loss of routine, purpose, and confidence**. Days blurred together. Motivation dropped.\n\nSo I built a small web app called **WorkMode**.\n\nIt’s a **virtual job simulator** where you:\n\n* Choose a role (Business Analyst, Software Engineer, Content Writer, etc.)\n* Get realistic, role-based tasks\n* Complete tasks, earn XP, track progress\n* Receive “boss-style” feedback\n* Feel the structure of a workday without real pressure\n\nIt’s not a game, and it’s not fake motivation either.  \nThink of it as **“fake work → real skills.”**\n\nI’m still early and actively improving it, so I’d genuinely love:\n\n* Feedback\n* Feature ideas\n* Criticism (brutally honest is fine)\n\nIf this sounds useful (or even just interesting), I’d appreciate you checking it out.\n\n[https://www.producthunt.com/products/workmode-2](https://www.producthunt.com/products/workmode-2)\n\nThanks for reading 🙏",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 135,
    "downs": 0,
    "created_utc": 1765774286.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.690265246613311
  },
  {
    "score": 133,
    "title": "I'm building a new website that is the IMDB of Youtube channels",
    "selftext": "Youtube is full of quality content but it is sometimes hard to find it so I created [a website](https://www.favoree.io/search/category/all/name/all/min/0/max/0/rating/0/ratingFun/0/ratingLearn/0/ratingEmotional/0/order/highest/language/English/allTopics/all/subTopic/all/rankingRatingMoodDef/all/context/all/level/all/platform/all/tag/all/duration/all) where you can rate and review channels and that helps you discover new ones.\n\nThe goal is to make a platform like IMDB or Rotten Tomatoes but for Youtube content. I want to go the opposite direction to Youtube that for instance removed the dislikes on videos.\n\nFor now there are not so many channels but users can submit content and I'm adding more everyday.\n\nI offer you different new ways to discover new content our website: Detailed filters (topic, duration, type of video, mood...) / Advanced search / Top similar channels\n\nI would be really happy to receive candid feedback on it and if it is something you could use!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 133,
    "downs": 0,
    "created_utc": 1675788939.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.717725417052601
  },
  {
    "score": 132,
    "title": "Bro I cried after my 10th sale… nobody told startup life feels like this",
    "selftext": "Last night around 2:14 AM, I refreshed my dashboard for the 192829th time,… and boom - Rixly finally hit **10 paying customers**.  \nI literally sat back and laughed like a mad guy.  \nNot because 10 is big…. but because **it finally felt REAL**.\n\nThe last 3 months I was:\n\n* eating Maggi like it’s a food religion\n* replying to Reddit posts from bathroom\n* getting rejected by 37 SMB owners\n* learning Reddit’s rules like CA exam\n\n[Rixly](https://www.userixly.com/) is a small tool, just helping SMBs find leads on Reddit… but these 10 sales taught me that **consistency beats talent** any day.\n\nIf you're stuck at 0 - keep pushing.  \nYour “10” will come. Maybe at 2:14 AM too.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.7,
    "subreddit_type": "public",
    "ups": 132,
    "downs": 0,
    "created_utc": 1763785801.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6466692382658605
  },
  {
    "score": 129,
    "title": "I paid 5 influencers on LinkedIn to promote my SAAS : here’s what $1250 got me",
    "selftext": "A few weeks ago I decided to test something new for my SaaS.  \nInstead of running more cold email or ads, I tried using LinkedIn influencers.\n\nI wanted to get people to comment on a post, send them a Notion resource, and redirect them to my site.\n\nThe experiment ran for two weeks, and I spent 1,250 dollars in total for five influencers.\n\nYou can check [the influencer's post + profile here](https://www.notion.so/Proof-of-influencer-campaign-29bb9abcbe3f80f8aefff2323103f3e4?source=copy_link)\n\n**Step 1: Finding influencers**\n\nThere are basically two types of influencers. The niche experts who have small but super relevant audiences. And the viral creators who get huge reach but with less qualified people.\n\nI picked a mix of both.\n\nI searched for people who had already done sponsored posts for competitors. I DMed more than fifty of them, compared pricing and engagement stats, and selected five.  \nI wrote the posts myself and made the visuals so everything looked consistent.\n\n**Step 2: The process**\n\nEach influencer posted exactly what I gave them.  \nWhen people commented, they replied with a Notion link. The more comments, the more reach, the more clicks.\n\nInside that Notion page, I included a link to my SaaS trial and a “book a demo” button.  \nEach influencer had a personalized page with a tracking link.  \nOne of them even customized the page for their French audience and it performed better than the generic version.\n\nI made sure the Notion resource gave a lot of real value so people thought, “If this is free, the paid version must be crazy.”\n\n**Step 3: The results**\n\nI spent 1,250 dollars. Two influencers brought absolutely nothing. Not even a single visit. Probably engagement pods.\n\n$500 wasted.\n\nThe other three actually worked.\n\nThe first one brought around 75 new signups, 25 trials, 12 paid conversions, and seven demo calls with large teams.  \nThe second one brought 27 signups, nine trials, four paid conversions, and one demo call.  \nThe third one brought 12 signups, five trials, and three paid conversions.\n\nIn total that’s 19 paying customers at 99 dollars per month.  \nThat’s 1,900 dollars in recurring revenue for 1,250 spent.  \nNot bad at all, and definitely something I’ll keep doing.\n\n**What I learned**\n\n\\- Negotiate hard. Prices can easily drop by two or three times if you push a bit.  \n\\- Avoid fake influencers. Many are just engagement groups.  \n\\- Make sure they reply to every comment with your link. If not, do it yourself.  \n\\- Always pay after posting, never before.\n\nI also tried boosting the posts with ads, but it didn’t make much difference.\n\nNext step is to find better influencers, scale the system, and maybe try TikTok next.  \nIf anyone’s interested, I can share the Notion template and DM scripts I used.\n\nIf you have any questions, feel free to ask !\n\nHere [are all the proofs](https://www.notion.so/Proof-of-influencer-campaign-29bb9abcbe3f80f8aefff2323103f3e4?source=copy_link) (influencer urls + posts)",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 129,
    "downs": 0,
    "created_utc": 1762192184.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5396828108279648
  },
  {
    "score": 127,
    "title": "Made $24K this month with my 4-month-old SaaS, here’s what worked (and what didn’t) + Proof",
    "selftext": "Hey everyone,\n\nI launched [this tool](https://gojiberry.ai) in May, and we made around $24K in September.\n\nIt hasn’t all been smooth sailing, so I’ll share what worked, what didn’t, and what I’d do differently.\n\nQuick disclaimer: when I started this SaaS, I had zero audience in the niche I was targeting. However, I already had experience in SaaS, having built and sold one that reached 500K ARR pretty fast. So I knew how to handle a team, find a CTO cofounder, etc.\n\nIt’s definitely not easy. The first months mean no salary and constant reinvestment. Without experience and being solo, building a SaaS feels almost impossible.\n\nFor me, it’s a “second stage” business, something to do once you already have some money and security.\n\nToday we have over 200 customers and more than 18,000 monthly website visits. Here’s how we got there.\n\nWhat didn’t work: Twitter was a total flop, my account didn’t take off. SEO is super slow; we spent quite a bit on articles, but results take time. Paid influencer posts weren’t worth it yet. Reddit ads didn’t perform as expected. Cold calling also wasn’t worth the effort.\n\nWhat worked:\n\n\\-Reddit brings about 30% of our traffic. We post daily across subreddits, mixing value posts, resources, and updates. It drives a lot of volume, though conversion rates are moderate. (You probably saw us a lot on Reddit... yes... it works !)\n\n\\-Outreach is our top conversion source. We use our own tool, to find high-intent leads showing buying signals on LinkedIn, then reach out via LinkedIn and cold email. We send 3000 emails per day + as many linkedIn invitations as we can.\n\nWe get 3-5x more replies by email and on LinkedIn with our own tool compared to when we used Apollo or Sales Indicator databases. Using your own tool is honestly the key to building a successful SaaS, you always know exactly what needs to be improved.\n\n\\-LinkedIn inbound works great too. We post daily, and while it brings less traffic than Reddit, the leads are much more qualified. We use 3 accounts to post content. Some days it can bring us 10 sales.\n\nOur magic formula is 3k emails sent per day + 1 LinkedIn post per day + 5 reddit posts per week.\n\n\\- Our affiliate program has also been strong. We offer 30% recurring commissions, and affiliates have already earned over $3K. The key to a successful affiliate program is paying your affiliates as much as possible and giving them a full resource pack so it’s easy for them to promote your tool including videos, banners, ready-to-post content, and more.\n\n\\-Free tools worked incredibly well too. We launched four and shared them on Reddit and LinkedIn, which brought consistent traffic and signups every day. It’s pretty crazy because we put very little effort into it, yet every day people sign up for trials thanks to these free tools.\n\n\\- One big shift was moving from sales-led to product-led growth. Back in May, I was doing around 10 calls a day. It worked but wasn’t scalable. Now people sign up automatically, even while I sleep, and we only take calls with larger teams. It completely changed my life.\n\nWe’re a team of three plus one VA, spending zero on ads. Our only paid channel is affiliate commissions.\n\nGoal for December: hit 1M ARR.\n\nIf you have any questions, I’m happy to share more details and help anyone building their own SaaS.\n\nCheers !\n\n[Proof](https://gojiberry.ai/proof)",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 127,
    "downs": 0,
    "created_utc": 1759728846.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6169819374188026
  },
  {
    "score": 122,
    "title": "The 'One-Pager Test' - How I know if a startup idea will work in 60 minutes",
    "selftext": "I used to spend months building ideas that flopped.\n\nNow I test ideas in 60 minutes with a one-pager.\n\n**Here's the system:**\n\n**Step 1: Write the offer (10 min)**\n\nOne sentence: \"I help \\[WHO\\] achieve \\[WHAT\\] by \\[HOW\\].\"\n\nExample: \"I help $2M service businesses systematize hiring by building their recruiting SOPs.\"\n\nIf you can't write this clearly, the idea is fuzzy. Stop.\n\n**Step 2: List 10 people who'd pay for this (10 min)**\n\nNot \"target market.\" Actual names.\n\nIf you can't name 10 real people who'd buy this, you don't have a business. You have a theory.\n\n**Step 3: Pricing gut check (5 min)**\n\nWhat would you charge?\n\nIf it's under $1k and requires your time, it's a job, not a business.\n\nIf it's over $10k, can you deliver the outcome? Honestly?\n\n**Step 4: Draft the sales conversation (15 min)**\n\nWrite the exact words you'd say to sell this.\n\nIf it takes more than 2 minutes to explain, it's too complex.\n\n**Step 5: Send it to 5 people (20 min)**\n\nThe 10 names from Step 2? Text 5 of them.\n\n\"Hey, working on a new offer. Would you pay $X for Y? Honest feedback?\"\n\n**If 3+ say yes → validate further (pre-sell it)** **If 0-2 say yes → kill it and move on**\n\n**What this prevents:**\n\n* Building products nobody wants\n* Wasting months on vague ideas\n* Falling in love with bad concepts\n\n**I've killed 12 ideas in the last 2 years using this.**\n\nSaved me probably $200k in wasted time and money.\n\n**The lesson:**\n\nDon't build it and hope they come.\n\nValidate it before you build anything.\n\nPs, I share growth frameworks over on r/modernoperators - come join if you’re an experienced founder",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 122,
    "downs": 0,
    "created_utc": 1762889580.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4225413639910514
  },
  {
    "score": 123,
    "title": "I am building Tinder for Startups",
    "selftext": "I’ve been working on a small side project called [firstusers.tech](http://firstusers.tech/)  \nIt’s basically like Tinder, but for startups and early adopters\n\nHere’s how it works:\n\n* You submit your startup (it takes less than 2 minutes)\n* Early adopters sign up and pick their interests or needs (like marketing, design, productivity, etc.)\n* When you submit, the platform automatically matches you with people who actually care about that category\n* They get an email notification, and your startup shows up on their dashboard\n\nThe goal is to help startups get their **v**ery first users and feedback without having to spam social media or cold email strangers.\n\nAnd yes it’s completely free to submit your startup or to join as an early adopter\n\n [http://firstusers.tech/](http://firstusers.tech/)",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 123,
    "downs": 0,
    "created_utc": 1758091304.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.809034723008483
  },
  {
    "score": 121,
    "title": "What kind of start up is truly worth starting in today’s world?",
    "selftext": "With the economy shifting, tech constantly evolving, and more people working from home or freelancing, it feels harder to know what kind of business actually has long-term potential. I’m looking for ideas that are practical, in demand, and not insanely expensive to start. Whether it’s something online, local, or service-based, I’d love to hear what you think is genuinely worth pursuing right now and why.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 121,
    "downs": 0,
    "created_utc": 1752480552.0,
    "media": null,
    "is_video": false,
    "num_comments": 159,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8859198220027107
  },
  {
    "score": 117,
    "title": "Let’s Validate Each Other’s Ideas!",
    "selftext": "Drop what you’re working on right now  product, startup, side project and how you’re getting it in front of people.\n\nLet’s discover, support, and learn from each other’s journeys.\n\nI’ll go first\n\n**Eatease** a platform to discover hidden food stalls &amp; local shops that never show up on Google Maps.  \nBuilding in public, sharing raw daily updates, and shaping the product with community feedback.\n\nYour turn what are you building?",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 117,
    "downs": 0,
    "created_utc": 1754906906.0,
    "media": null,
    "is_video": false,
    "num_comments": 348,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.078294720785715
  },
  {
    "score": 119,
    "title": "The lessons I learned scaling my app from $0 to $30k/mo in 1 year",
    "selftext": "* 80%+ of people prefer Google sign in\n* Removing all branding/formatting from emails and sending them from a real name increases open rate\n* You won’t know when you have PMF but a good sign is that people buy and tell their friends about your product\n* 99.9% of people that approach you with some offer are a waste of time\n* Sponsoring creators is cheaper but takes more time than paid ads\n* Building a good product comes down to thinking about what your users want\n* Once you become successful there will be lots of copy cats but they only achieve a fraction of what you do. You are the source to their success\n* I would never be able to build a good product if I didn’t use it myself\n* Always monitor logs after pushing new updates\n* Bugs are fine as long as you fix them fast\n* People love good design\n* Getting your first paying customers is the hardest part by far\n* Always refund people that want a refund\n* Asking where people heard about you during onboarding makes marketing 10x easier\n* Marketing is constant experimentation to learn what works. Speed up the process by drawing inspiration from what works for similar products.\n* Don’t be cheap when you hire an accountant, you’ll save time and money by spending more\n* A surprising amount of users are willing to get on a call to talk about your product and it’s super helpful\n* Good testimonials will increase the perceived value of your product\n* Having a co-founder that matches your ambition is the single greatest advantage for success\n* Even when things are going well you’ll have moments when you doubt everything, just have to shut that voice out and keep going\n\nFor context, [my app](https://buildpad.io) guides users through ideation and idea validation.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 119,
    "downs": 0,
    "created_utc": 1767362439.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3968174985992774
  },
  {
    "score": 120,
    "title": "My app makes $1.1k/mo and I haven’t told my family",
    "selftext": "Hi guys, 2 months ago I launched [this app](https://shipper.now/) focused on product development that I had been working really hard on.\n\nIt started out with me just being annoyed by trying to build stuff with ChatGPT so I created a solution I thought was better.\n\nIt got some traction but nothing huge, around 3 weeks in it was doing $50/mo. I talked to my family about it and they were supportive of course but as you can imagine not super impressed. You know how it is.\n\nAnyway, I’ve been grinding for another month and a half now and have made some good product decisions, gotten feedback from customers, and shaped up my marketing. I don’t know what happened this September but I got busy as heck and now I just closed at $1.1k/mo. It’s kinda hitting me now that I’m actually making real money and I haven’t told my family or anyone.\n\nI was waiting for this moment for weeks and now that it’s finally here I don’t know if it’s even time yet…\n\nShould I tell them? How much do you share with your friends and family?",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1758792168.0,
    "media": null,
    "is_video": false,
    "num_comments": 70,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.653414544675988
  },
  {
    "score": 107,
    "title": "Your perfectly clean code is a sign you're about to fail.",
    "selftext": "Let me be direct. If you’re a pre launch founder and your code is perfect, you’re not building a business. You’re building a museum piece that no one will ever see.\n\nTech gurus love to preach about the evils of “tech debt.” They make it sound like a cardinal sin. It’s not. Tech debt is a tool. It's a calculated loan you take against your codebase to ship faster and find out if anyone actually wants your product.\n\nI once watched a startup burn through their entire seed round building an infinitely scalable, beautifully architected backend. Six months of work. The code was pristine. The problem? They ran out of money before they could show it to a single customer. Perfect code, zero users, dead company.\n\nStop trying to avoid tech debt. Start managing it strategically. Here’s how.\n\nDon't refactor because your code feels “messy.” That's your ego talking. You refactor only when the debt starts costing you more than the interest payments. We call this the “Refactor Window,” and it only opens at specific times.\n\nThe window opens when a messy part of your codebase is actively slowing down the delivery of a feature that users are screaming for. Or when a critical system, like payments, is so fragile that you’re terrified it will break with the next user signup.\n\nHere's a real world example. Early on, our checkout flow was held together with duct tape and hope. It was ugly. But it worked. We ignored it for months while we focused on validating the core product. The moment our user growth started to hockey stick, that was our signal. The risk of the system failing was suddenly higher than the cost of a two week rewrite. That’s the Refactor Window.\n\nSo how do you actually do this without getting lost in a six month refactoring black hole?\n\nForget the fancy code analysis tools. Just ask your lead developer this question: “What part of our codebase makes you want to throw your laptop out the window every time you touch it?” I guarantee their answer will point you to the highest priority debt.\n\nThen, don't boil the ocean. Don't rewrite the entire app. Scope the fix to that one specific module. Timebox it. Two weeks, max.\n\nAnd for the love of god, explain the value to your non technical cofounder in simple terms. Not \"We're refactoring the service layer to implement the repository pattern.\" Try this: \"We're spending a week reinforcing the foundation. It will let us build the next three features twice as fast and stop the site from crashing during busy hours.\"\n\nThe goal is not zero tech debt. The goal is a profitable company. Obsessing over code purity before you have product market fit is one of the most sophisticated and expensive forms of procrastination I've ever seen.\n\nAnyone else learn this lesson the expensive way?",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.77,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1761670821.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4515443741747434
  },
  {
    "score": 103,
    "title": "Share your startup, I will give you honest feedback for free",
    "selftext": "Hi founders!\n\nI love seeing new ideas come to life, and I also know how hard it is to get some honest feedback when you're trying to build something new. I have some free time on my hands, so I'm down to check out what you're building and hopefully offer a new perspective on it.\n\nShare your link!\n\nEdit: Wow! Didn’t expect this post to blow up like this. I’m overwhelmed! Sorry if I wasn’t able to check out every site, but I wish everyone the best, and remember it’s all about providing real value and marketing the hell out of your site!\n\nEdit2: Also my first SaaS [themarktr.com](https://themarktr.com) is in pre-launch. I’d appreciate some feedback! ",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 103,
    "downs": 0,
    "created_utc": 1759138756.0,
    "media": null,
    "is_video": false,
    "num_comments": 310,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.945913533812199
  },
  {
    "score": 96,
    "title": "Every export button in an existing SaaS is a $$$$ idea",
    "selftext": "I recently came across a youtube pod where they have layout few interesting framework on identifying great SaaS AI ideas that can generate millions of dollars in revenue. \n\nOne of them was exploring any existing SaaS platform it can be either Zoho or Hubspot or Quickbooks or any major SaaS in the market and look for the export button. After that identify what user usually does with that data once it is exported - are they generating any report, are they feeding it in some other tool, etc. and based on the insights try to built an AI automation that can fulfill that gap. \n\nBenefit you get is, you already have thousands of business already using that SaaS, you have your TAM well defined and you just need to pitch/promote your micro SaaS/AI to those customers and start generating revenue. \n\nSuggest what are your thoughts on this framework? ",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 96,
    "downs": 0,
    "created_utc": 1741196880.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4057417386022637
  },
  {
    "score": 92,
    "title": "3 signs you’re building something nobody wants",
    "selftext": "I see a lot of posts on here talking about idea validation and how important it is.\n\nI think many founders read those posts and agree with them even though they haven't properly validated their idea themselves.\n\nYou are fooling yourselves. The chances that you’re building something nobody wants are high, especially if you’re a new founder.\n\nYou’re gonna be biased towards your idea and it’s very difficult not to be.\n\nSince I’ve built both apps with no demand and strong demand, I thought I’d share what the difference in those experiences looked like for me.\n\nHopefully you can read this and it will help you figure out if you might be in the “risk zone” of building something nobody wants.\n\nThe signs:\n\n**1. The difficulty of marketing**\n\nMarketing is difficult. It’s the same for everyone. But marketing an app that nobody wants is near impossible.\n\nI put about the same amount of effort into marketing my first app (no demand) and my current app (strong demand).\n\nAfter 5 months of marketing my first app (which was an AI form for sales people), I didn't have a single active user. I could get people to check out my landing page but VERY few signed up and practically no one used it.\n\nWhen I did marketing for my current app (product development platform) it took 2 weeks to get my first 100 users. I guess I'm a bit of an extreme example since the difference in demand was so big, but still you get it.\n\nIf all your marketing efforts don’t lead to any results, you’ve likely built something nobody wants.\n\nI know it’s difficult here to judge if it's just that your marketing is bad and you’re not doing enough or if your product lacks demand. A way to tell the difference here is if you can get traffic to your site or nor.\n\nIf you can't get traffic to your site = bad marketing\n\nIf you can and the traffic converts to users = good sign\n\nIf you can and it doesn’t convert = bad sign\n\n**2. People’s reactions**\n\nPeople rarely complimented my AI form or said anything close to “this is useful to me”.\n\nSince day one people have been saying how good my current idea is and how much potential they see in the product.\n\nNo one ever gave me feedback on my AI form but I get feedback all the time now. People want to get involved and help and it's been like that since I launched my MVP.\n\nI don't want this to sound like some form of bragging. I'm just trying to convey that if people aren’t hyped and excited about your product then it’s a bad sign.\n\nYou can definitely tell when people are genuinely impressed by your product and when it's more \"meh\", so this signal is pretty easy to pick up on.\n\n**3. Your groundwork**\n\nHow did everything start with your product? Did you try to solve a problem you experienced yourself or that you knew others experienced? Did you talk to people before building? \n\nMy first product was quite spontaneous and didn’t really solve a problem for me. I wanted to build something to get better at coding and I fell in love with my product as I started building.\n\nMy goal became to make it better and better because I was proud of it, it was cool, and it looked good.\n\nMy product now came directly from a problem that really bothered me, and before I started building it I spent time on the groundwork. I reached out to my target audience to understand the problem better, understand them better, and get input on my idea.\n\nIf you didn’t begin by talking to people to validate the problem and your solution, then you’re definitely in the “risk zone”.\n\nIt’s possible that you came up with a “million-dollar idea” just through intuition but it’s not likely.\n\n**Final thoughts**\n\nAccept that every founder is very biased towards their own idea and will bend reality to make it fit their narrative. Also accept that you’re more likely than not one of them.\n\nEscape this bias by relying on data for your decisions, because data doesn’t lie. The data comes from doing proper market research and talking to your target audience before building.\n\nI hope this post can help some of you fall out of love with your unvalidated product.\n\np.s. [my app](https://buildpad.io/) for the curious",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 92,
    "downs": 0,
    "created_utc": 1762786265.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4185579377138877
  },
  {
    "score": 86,
    "title": "I got pissed off a recruiters ghosting me... so I built a CRM to track them during my job hunt",
    "selftext": "Title says it all really (excluding the stupid typo - should be 'at' instead of 'a').\n\nI’m **pissed** \\- yet again some twat recruiter vanishes into thin air halfway through my interview process. No calls, no emails, nothing. Ghosted like my last Tinder date. Well, I got so pissed off I went and built my own damn solution: **RecRadar** (https://www.recradar.io).\n\nIt’s 100% **free**, and I’m smashing through development right now with a **mid–late May** launch in mind. If you’re sick of flaky recruiters, get on the **waitlist** and be one of the first to test it.\n\n# What makes RecRadar a lifesaver?\n\n* **Role Tracking:** Log every job you apply for, track which stage you’re at (Applied → Phone Screen → Onsite → Offer) and never lose sight of that dream gig again.\n* **Recruiter Interactions &amp; Notes:** Jot down every email, call or awkward “just checking in” moment. No more guessing who said what.\n* **Reviews &amp; Ratings:** Give recruiters stars (or rotten tomatoes) based on how they treat you.\n* **Mark as Ghosts:** Spotted someone who went AWOL? Tag ’em as a **ghost**—their profile gets a big spooky badge ⚰️ so other hunters know to steer well clear.\n* **Top Recruiters Leaderboard:** Find the best in your country by average review score. It’s like TripAdvisor for recruiters, but with far fewer soggy breakfast photos.\n* **Blacklist:** Got a particular recruiter you never want to deal with again? Chuck ’em on your blacklist and you’ll see a warning if their name pops up on any new role.\n* **Data Analysis Dashboards:** See your stats at a glance, total roles interviewed for vs total ghosted from, acceptance rates, follow-ups pending… all the sweet, sweet numbers.\n\nI’m proper chuffed with how it’s coming together, but I need **you** to make it even better. Sign up for early access, give brutal feedback, and help build the ultimate anti-ghosting toolkit:\n\n👉 **Join the waitlist at** [**https://www.recradar.io**](https://www.recradar.io) 👈\n\nLet’s stick it to the flaky recruiters and take back control of our job hunts.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 86,
    "downs": 0,
    "created_utc": 1745782429.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3346248734744215
  },
  {
    "score": 87,
    "title": "This is how I find my startup ideas. How do you find yours?",
    "selftext": "Hey everyone,\n\n  \nI often see questions around here about how to come up with startup ideas. I think it's one that a lot of people struggle with so just wanted to see if anyone is doing anything out of the ordinary to get their creative juices flowing. Usually my startup ideas come when I least expect it, as in when I'm not actually trying to think of an idea but I've found a few ways that help me at least get the balls in motion for coming up with ideas and they generally plant seeds for me to come up with ideas at a later stage. This worked for [my startup idea](https://www.startersyrup.com) so hopefully it can help some people out.\n\n  \n**Trustpilot**\n\n1. Go to Trustpilot\n2. Select the business category that your interested in\n3. Check out the top companies\n4. Filter by 2 &amp; 3 star reviews (1 star reviews aren't the best for this because it's just people hating on the product)\n5. See if you could solve any of the frustrations of the customers and you might just stumble upon a new startup idea\n\n  \n[**Acquire.com**](https://Acquire.com)\n\n1. Go to [aquire.com](https://aquire.com) (you'll need to sign up)\n2. Filter companies that are doing over 100K a year (you can change this number but filtering over this number can get you some really good ideas)\n3. Look for product ideas that resonates with you\n4. Are there any features that are missing from the product? If so you could be onto something.\n\n  \n**Ahref keyword generator**\n\n1. Go to [https://ahrefs.com/keyword-generator](https://ahrefs.com/keyword-generator)\n2. Search for random stuff to find keywords with a high volume (number of people searching) with a low KD (Keyword difficulty - how difficult it would be to rank in the top 10 on google. 20 and below would be what we're looking for here)\n3. Based on what you find do a search on Google and see if there is any tool on top of Google. If not then you've found an idea that might be worth going with. If there already is a tool maybe you could build a better one?\n\n  \nThese are my go tos on how to get the creative juices flowing and they tend to help me when I'm drawing blanks on coming up with ideas.\n\n  \nThen when I have an idea for a product I ask myself the following questions to make sure it's something I want to pursue:\n\n  \n\\&gt;Would I use the product?  \n\\&gt;Can I find the audience for this product?  \n\\&gt;Can I win their attention?  \n\\&gt;Can I build it in 1 month max?",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 87,
    "downs": 0,
    "created_utc": 1708380474.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0835582973419906
  },
  {
    "score": 81,
    "title": "I spent 2 years building a health-tech app. It failed. Here is the honest post-mortem",
    "selftext": "For two years, my startup was my life. We poured everything into a mobile app for diabetics.\n\nThe code was clean. The architecture was scalable. The mission was noble.\n\nAnd we failed.\n\nWe were a classic founding team: **3 Coders, 0 Marketers.** We spent nights debating tech stacks and zero minutes talking to customers. We fell into the \"Field of Dreams\" trap: *If we build it, they will come.* (They didn't).\n\nI wrote a full breakdown of the 10 reasons we shut down, but here are the 3 that hurt the most:\n\n**1. The \"Mansion\" MVP** We didn't build a Minimum Viable Product. We built a mansion. We developed for iOS AND Android simultaneously before we had a single user. *Lesson:* If you haven't validated the idea, build *one* feature on *one* platform.\n\n**2. The \"No Competition\" Trap** We did a competitor analysis and found nothing. We celebrated. In reality, an empty market is usually a red flag. It means there is no market. If a real problem exists, someone is usually already trying to solve it.\n\n**3. We Wasted Money on \"Pro\" Tools** We wanted to feel like a \"real company,\" so we burned cash on premium hosting, enterprise email, and legal structures before we had $1 in revenue. *Lesson:* You can run a startup for almost $0 these days. Don't scale your costs before you scale your revenue.\n\n**The Full Retrospective** I broke down the other 7 mistakes (including why \"Trying to change human behavior\" is a death sentence for apps) in the full post here:\n\n[**https://www.unboxth.xyz/2025/12/my-first-startup-failed-here-are-10.html**](https://www.unboxth.xyz/2025/12/my-first-startup-failed-here-are-10.html)\n\nHappy to answer questions about the shutdown process or the tech we wasted time on.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 81,
    "downs": 0,
    "created_utc": 1764758223.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4630401906268107
  },
  {
    "score": 82,
    "title": "My app makes $30k/mo after 13 months. How I would start again from $0",
    "selftext": "So last year I launched [my app](https://buildpad.io) that helps with market research and guidance from idea to product. It resonated well with people when I launched and keeps growing at a steady pace. I launched 13 months ago and now it makes me $30k/mo ([Stripe pic](https://imgur.com/a/sBqCo4X))\n\nI see a lot of people here that struggle to make their apps work which made me think about how I would do it if I had to start again from 0.\n\n**Here it is:**\n\nI’d start by finding a group of people to solve a problem for. I would go on the subreddits I visit the most myself, sort by top posts and make a list of common questions and pain points people in the community bring up.\n\nFrom that list I would write down the 2-3 problems that get brought up the most. Then I’d use any LLM with deep research (Claude is best) and just ask it to do a thorough market analysis of the problem statement to validate whether the problem is real. My goal would be to understand how large the market is, how the problem impacts people/businesses (the problem should be painful), and what existing solutions there are.\n\nIf the market exists, I’d build a very simple solution either with code or using no-code tools. Just aiming to be able to say that I have a simple solution for the problem. Once I have a basic version, I’d go back to the same subreddit where I found the problem and then launch it there.\n\nIn the beginning I want a lot of feedback in order to improve the solution so I would also look for Facebook groups, discord groups, etc, where the people that have the problem hang out. Then I would be active in the community, post value, comment, DM, and mention my solution when I genuinely think it could help someone. This is how I got my first users for two previous projects so I know it works.\n\nOnce I start getting some traction, I’d look to automate marketing more by sponsoring newsletters, substacks, influencers, basically anyone who writes content relevant to my target audience. In my experience, ROI on smaller creators with a relevant audience is great.\n\nWhile the marketing is rolling I would spend my time improving the product until I reach a few thousand per month in revenue. At that point it’s time to make the choice whether I want to cut down my time to just a few hours a week and cruise or spend more time to grow the project.\n\nThis path isn’t complicated, I’ve been through it twice. It just takes dedication in the beginning and not giving up even though you might not see fast or obvious results. There will be days when it seems like nothing is working, but if you keep pushing through it and stay rational, the results will come.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 82,
    "downs": 0,
    "created_utc": 1762008160.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1521237219039144
  },
  {
    "score": 87,
    "title": "Entrepreneur Looking to Connect with other Entrepreneurs",
    "selftext": "Hi fellow entrepreneurs!\n\nI'm a first time founder in the software industry trying to figure everything out on my own. And honestly, the journey is tougher than I expected. The late nights, the self-doubts, the \"am I doing this right?\" moments can stop us from pushing forward and sometimes kill our dreams because we lose momentum. I'm surrounded by friends who work a 9-5 job so I feel like I don't have anyone to turn to when I need a little nudge pursuing my dreams.\n\nI'm a down to earth person who genuinely wants to connect with someone who doesn't trying to sell me something. I'm looking for meaningful conversation about business and life, supportive friends who'd help and push each other to succeed, who'd listen to your self-doubts and pull you out of it, who can relate with your struggles, who would be there to celebrate your wins, like a true friend. It would be nice if there are a group of supportive people who grind with you until late nights, even if we're all working on different things.\n\nBesides the business stuff, I like spending time with my 6 cats and partner. Sometimes I enjoy a good TV show that sparks my creativity. I'm also into online gaming (Overwatch 2, Overcooked, etc.) as my stress outlet.\n\nIf you're also looking for a genuine friend to connect on business or life, I'd love to connect with ya! Cheers!!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 87,
    "downs": 0,
    "created_utc": 1756511820.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6516921350073153
  },
  {
    "score": 80,
    "title": "A few years ago, I had this idea I really believed in.",
    "selftext": "I spent weeks thinking through every detail — what it would look like, how it would work, why it mattered.\nBut I never built it.\n\nNot because the idea was bad.\nBut because I didn’t have anyone around me who was thinking the same way.\nNo one to discuss it with.\nNo one to build it with.\n\nSo it stayed in a doc. Like most ideas do.\n\nLately, I’ve been thinking about that.\nAnd I realized what if we had a small group of people who actually built instead of just talked?\n\nNo hype. No pressure.\nJust people sharing ideas, teaming up when something clicks, and pushing each other to take action.\n\nSo I’m starting a small community.\nNothing fancy. Just a space to talk, test, and maybe launch a few things.\n\nLet’s see where it goes.\nNot trying to build something huge. Just something real.\n\n",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 80,
    "downs": 0,
    "created_utc": 1750815032.0,
    "media": null,
    "is_video": false,
    "num_comments": 73,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5556008787441375
  },
  {
    "score": 78,
    "title": "we hired 3 senior engineers in 14 days after struggling for 6 weeks to hire one",
    "selftext": "I'm the cto at a series a company and hiring has been brutal. We needed senior backend engineers who know our specific stack (golang, kubernetes, distributed systems). Spent 6 weeks working with our first recruiter and got nowhere. Candidates either weren't senior enough or wanted 300k+ which we couldn't swing.\n\nTried something different. Connected with a recruiter who specializes in exactly our stack and only works with companies at our stage. She understood the technical requirements immediately, didn't send us random resumes, and actually screened for culture fit.\n\nEnded up hiring 3 people in 2 weeks. All of them are working out great 2 months in. The difference was working with someone who really knew what we needed instead of a generalist recruiter.\n\nBiggest lesson is that specialized recruiting matters way more than i thought. Spending time finding the right recruiter saved us months.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1761673138.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3552020804503946
  },
  {
    "score": 77,
    "title": "I never realized how powerful expired domains are",
    "selftext": "Around two weeks, I launched my newest project – a tool-based website called terrific.tools.\n\nWhen I initially connected Google Search Console, I was surprised to find tons of notifications and over 100 already indexed pages.\n\nTurns out, the domain had been owned by someone else before who seemed to have been working on it for some time.\n\nWhile it unfortunately didn’t have tons of existing links pointing to it, it still seemed to have enough of a good standing with Google for search traffic to start dripping in (https://ibb.co/9sYfmzv)\n\nMoreover, my newly published tool pages are indexed instantly.\n\nIn the age of AI and instant content creation, getting pages to index isn’t as easy as it used to be in my blogging days (I am a former full-time blogger whose sites were decimated by Google, fyi).\n\nFeeling the pain right now with another project of mine, which is build on a fresh domain and only has 5% of all pages indexed after 1.5 months.\n\nPlus, the owner also ran a tool-based website, so some of his previous tools remain listed in Google Search Console (= free keyword research haha).\n\nWhile I stumbled upon this domain by accident, there are certainly more systematic ways to discover expired domains.\n\nYou can use sites like ExpiredDomains\\[dot\\]net or SpamZilla to find even juicer expired domains (they provide additional data like search volume or existing backlinks).\n\nIt’s also a great way to do keyword research and validate demand, especially if you prefer building smaller, more niche applications.\n\nJust make sure to check before you purchase an expired domain whether it had any penalties and other oddities. Would recommend getting the cheapest Ahrefs plan and see what backlinks it has pointing to it, traffic history, and the content it used to rank for.\n\nFor my next project, I plan on experimenting with exact-match domains (e.g., createrandomcolors.com), so I’ll certainly be on the lookout for expired tld’s to speed up the ranking process.\n\nLet me know if you have any questions about the whole process. ✌️",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1732861326.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1551402322183213
  },
  {
    "score": 71,
    "title": "I paid 2 influencers on LinkedIn to promote my SAAS : here’s what $500 got me",
    "selftext": "Today, I ran a small experiment:\n\nI paid two LinkedIn influencers to promote my SaaS.\n\nI’ll share everything : prices, process, results, etc\n\n🎯 Why I did it\n\nLinkedIn is already my best acquisition channel.\n\nSo I thought: instead of posting only on my own profile, what if I leveraged other people’s reach?\n\n🔍 Step 1: Picking influencers\n\nThere are two types:\n\nNiche experts : small but ultra-qualified audience\n\nViral creators : huge reach, lower precision\n\nI went with the second type:\n\n• One French influencer (for the francophone market)\n\n• One Turkish influencer (posting in English)\n\nTotal budget: $500 for 2 posts (one each).\n\nI wrote the posts myself and validated their visuals.\n\nTo find them, I simply looked for influencers who had already done sponsored posts for competitors.\n\nThen I went into their DMs and talked to dozens of people until I had pricing grids, reach estimates, and finally made my choice.\n\n⚙️ Step 2: The process\n\nEach time someone commented, the influencer replied with a Notion resource (lead magnet).\n\nThe goal of the influencers’ posts was to generate as many comments as possible, the more comments, the more reach; the more reach, the more people see the post.\n\nI asked the influencers to reply to every single comment with a Notion link, so even people who didn’t comment would see the link when scrolling through the comments, and end up clicking on it.\n\nInside that page, I linked to:\n\n→ My SaaS trial\n\n→ A “book a demo” CTA\n\nThe French influencer customized the Notion page.\n\nThe English one used a generic version.\n\nBoth performed well, but personalization clearly helped engagement.\n\nThe influencer’s goal is to bring as much visibility and engagement as possible to the post.\n\nInside the Notion page, of course, I provide a ton of value, exactly what people commented for.  \nThe idea is to flood them with so much value that they think:  \n“Wow, if this is free, I can’t even imagine what I’d get if I paid.”\n\n📈 Step 3: The results (after 10h)\n\n• $500 spent (2 posts live)\n\n• 18 trials (card added)\n\n• 50+ new signups\n\n• 9 paid conversions expected (≈$990 MRR)\n\n• 5 demo calls booked (large sales teams: 10–30 reps each)\n\nThat means I’ll likely recover my $500 within a week, and everything after that is pure profit.\n\nPlus, the posts keep bringing impressions and future traffic.\n\n🔁 Step 4: What’s next\n\nThis worked insanely well.\n\nNext step → scale it with more influencers in different niches.\n\nIf I could run this every day, I would.\n\nIf you want to check : [Here is a doc](https://www.notion.so/LInkedIn-Influencer-s-results-293b9abcbe3f8099afa5ef2c5b1f4fe8?source=copy_link) with links to both posts + notion exemple\n\nCheers !",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1761749643.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0650569571204054
  },
  {
    "score": 74,
    "title": "From 0 to €10K MRR with my SaaS (twice), what actually worked",
    "selftext": "Hey everyone 👋  \nI’m a two-time SaaS founder.  \nI scaled my first company around €500K ARR before selling it.  \nNow I’m building a second SAAS and we just passed €10K MRR a few months ago,\n\nAfter doing it twice, I wanted to share what really helped me reach this milestone, the exact process I used, from idea validation to first clients and scaling.\n\n# Why €10K MRR is the real milestone :\n\nAt €10K MRR, everything starts to make sense.  \nYou know people want your product.  \nYou have predictable revenue.  \nAnd you can finally focus on systems instead of survival.\n\nY Combinator says it best: €10K MRR and 100 customers usually means real product–market fit.\n\nHere is how you can do it :\n\n# 1. Validate fast, pivot faster\n\nWhen I started my second SaaS, I had two ideas.  \nThe first was an AI note-taker. People signed up but never paid.  \nThe second was a GTM and outreach platform. People paid immediately.\n\nWe built landing pages for both, collected feedback, and pivoted before writing a single line of code.  \nIf people are ready to give you their card before the product exists, that’s the signal you need.\n\nIf they say “interested”, but no payment, that’s not validation.  \nYou just saved months of your life.\n\nThe fastest validation loop is simple.  \nCreate a landing page.  \nTalk to ten potential customers.  \nIf at least two are ready to pay, build.  \nIf not, move on.\n\n# 2. Build one painkiller feature\n\nIf you’re a marketer, find a technical cofounder.  \nIf you’re a developer, find someone who can sell.  \nAvoid agencies at this stage, you’ll lose control.\n\nFocus on solving one painful problem better than anyone else.  \nDon’t add new features unless they increase retention, revenue, or customer results.\n\nWe started with one thing: finding high intent leads.  \nIt worked, so we doubled down.\n\n# 3. Find your pricing sweet spot\n\nPricing is just testing in disguise.\n\nI tested 499, 297, 199, and 99 euros per month.  \nAt 499, I sold a few but churned fast.  \nAt 297, more sales but too many demos.  \nAt 99, we finally hit volume and retention.\n\nNow we’re fully self-serve with a 7-day free trial.\n\nUse competitors as your starting point.  \nIf they’re selling at a price, it means buyers are already comfortable there.  \nYou can always adjust later.\n\n# 4. Get your first ten customers\n\nYour first customers come from human conversations, not automation.  \nForget ads or funnels for now.\n\nTalk to people on LinkedIn, Reddit, or via cold email.  \nBook calls, show what you’re building, and listen to feedback.\n\nI manually messaged hundreds of people on LinkedIn.  \nEach reply became a potential demo.  \nI closed the first ten clients like that, one by one.\n\nYour target is simple: twenty to thirty meetings, ten paying customers.\n\n# 5. Handle support and customer success early\n\nAdd a small chat bubble to your website.  \nReply fast, even if it’s just to say you saw their message.\n\nBook short calls at day seven and day fifteen with each new customer.  \nAsk what they like, what they don’t, if they’d recommend you, and if they’d leave a review.  \nIt’s easier to keep a customer than to find a new one.  \nWhen someone cancels, it’s already too late.\n\nSupport is your best retention engine at the beginning.\n\n# 6. How we scaled to €10K MRR\n\nAfter validation and first clients, growth came from three main channels.\n\nLinkedIn outreach brought around 25 percent of our sales because we target warm leads instead of cold ones.  \nPeople who like, comment, or follow competitors reply ten times more often than random cold lists.  \nCold outreach usually gives one or two percent response rates.  \nWarm, high intent outreach gives twenty-five to forty percent.  \nThe difference is intent.\n\nReddit became our second strongest channel.  \nIt brings thirty percent of our trials and tons of SEO traffic.  \nWe post weekly in SaaS and founder subreddits, share case studies, and answer questions.  \nNever just drop links. Give value, tell stories, and mention your tool only when it’s relevant.\n\nCold email became the third pillar.  \nWe send around one hundred thousand emails per month, but only to leads who showed a recent buying signal on LinkedIn.  \nThat’s the key.  \nStatic databases go stale fast.  \nReal-time signals convert three to five times better.\n\n# 7. Add compounding channels\n\nOnce revenue started coming in, we built small side channels that compound over time.\n\nPosting daily on LinkedIn to attract inbound messages.  \nBuilding free tools on our website that attract the right audience.  \nListing our SaaS on a hundred AI directories for long-tail SEO.  \nPublishing one blog post per week written with ChatGPT.  \nCreating YouTube tutorials with no editing, just sharing the process.\n\nEach of these channels adds a few users per week, and together they make a difference.\n\n# 8. The four week action plan\n\nWeek one is foundation. Set up your lead capture, build a simple outreach system, and start talking to people.  \nWeek two is optimization. Double down on what brought you the best conversations.  \nWeek three is scale. Add multi-channel outreach and post consistently.  \nWeek four is compound. Keep engaging, and let intent signals do the work for you.\n\nBy the end of the month, you’ll have real leads, real demos, and real revenue.\n\nI’m sharing all of this because I wish I had a post like this when I started my first SaaS.  \nIf you’re building something new, validate fast, stay close to users, and focus on warm channels.\n\n[I made a longer blueprint here if you are interested](https://gojiberry.ai/10kmrr)\n\nCheers !",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1760016237.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.273243145471194
  },
  {
    "score": 69,
    "title": "I’m publishing 1 startup idea every week until I hit on a winner. Here’s week 3.",
    "selftext": "I'm on a mission to create a hit product.  \nSince March, I've been publishing one service idea per week.  \nThis week marks my third one!\n\n#1: GrowthTok  \n- A database of successful titles that leveraged TikTok  \n- No need to dig through TikTok for viral content  \n- A great source of inspiration for your own posts  \nPage: https://growthtok.webflow.io/  \n\nThoughts:  \n- As a Webflow beginner, it took quite a bit of effort  \n- I thought it had strong potential (like Mobbin!), but the response was a bit underwhelming\n\n#2: Consumer Startup Ideas  \n- I love consumer products, so I curated a list of niche, successful products with revenue data, product pages, and TikToks  \n- I thought it might inspire others to see what unexpected things are actually selling  \n- Created on Notion to speed things up  \nPage: https://consumer-startup-ideas.super.site/\n\nResult:  \n- With just a light promo, got about 10 sign-ups  \n- There might be a small but real demand for it\n\n#3: Personal Assistant AI \"Riley\"  \nThe world's first personal AI service that calls you every morning to help you manage your tasks.\n\n01. Get a call from \"Riley\" every morning  \n02. Update your to-do list by talking  \n03. Set reminders for anytime you like  \nPage: https://eggplant-gruyere-da7.notion.site/Personal-Assistant-AI-Riley-1be3f44887d28082b9c5d75f17ea390c\n\nThis is the first time I'm sharing this one publicly!  \nWhat do you think? Personally, I feel like this could be a really strong idea.  \nWouldn't you want one?\n\nIf you have any thoughts or feedback, I'd love to hear it! 😊\n\n\np.s.  \nThank you so much for your interest in Riley!  \nHow are you currently managing your to-dos? Do you have any struggles with it?\n\nPersonally, I’ve tried many to-do apps, but none of them lasted more than three days for me. I always end up going back to pen and paper.  \nThat’s why I believe helping people consistently update their to-dos without forgetting could be the key to solving this common problem.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1742642491.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.287489838322662
  },
  {
    "score": 70,
    "title": "Made $34K this month with my 5-month-old SaaS, here’s what worked (and what didn’t) + Proof",
    "selftext": "Hey everyone,\n\nI launched [this tool](https://gojiberry.ai) in May, and we made around $34K in November\n\nIt hasn’t all been smooth sailing, so I’ll share what worked, what didn’t, and what I’d do differently.\n\nQuick disclaimer: when I started this SaaS, I had zero audience in the niche I was targeting. However, I already had experience in SaaS, having built and sold one that reached 500K ARR pretty fast. So I knew how to handle a team, find a CTO cofounder, etc.\n\nIt’s definitely not easy. The first months mean no salary and constant reinvestment. Without experience and being solo, building a SaaS feels almost impossible.\n\nFor me, it’s a “second stage” business, something to do once you already have some money and security.\n\nToday we have over 300 customers and more than 30,000 monthly website visits. Here’s how we got there.\n\nWhat didn’t work: Twitter is still super slow, my account didn’t take off. SEO is super slow; we spent quite a bit on articles, but results take time. Cold calling also wasn’t worth the effort.\n\nWhat worked:\n\n\\-Reddit brings about 30% of our traffic. We post daily across subreddits, mixing value posts, resources, and updates. It drives a lot of volume, though conversion rates are moderate. (You probably saw us a lot on Reddit... yes... it works !)\n\n\\-Outreach is our top conversion source. We use our own tool, to find high-intent leads showing buying signals on LinkedIn, then reach out via LinkedIn and cold email. We send 3000 emails per day + as many linkedIn invitations as we can.\n\nWe get 3-5x more replies by email and on LinkedIn with our own tool compared to when we used Apollo or Sales Indicator databases. Using your own tool is honestly the key to building a successful SaaS, you always know exactly what needs to be improved.\n\n\\-LinkedIn inbound works great too. We post daily, and while it brings less traffic than Reddit, the leads are much more qualified. We use 3 accounts to post content. Some days it can bring us 10 sales.\n\nOur magic formula is 3k emails sent per day + 1 LinkedIn post per day + 5 reddit posts per week.\n\n\\- Our affiliate program has also been strong. We offer 30% recurring commissions, and affiliates have already earned over $3K. The key to a successful affiliate program is paying your affiliates as much as possible and giving them a full resource pack so it’s easy for them to promote your tool including videos, banners, ready-to-post content, and more.\n\n\\-Free tools worked incredibly well too. We launched four and shared them on Reddit and LinkedIn, which brought consistent traffic and signups every day. It’s pretty crazy because we put very little effort into it, yet every day people sign up for trials thanks to these free tools.\n\n\\- One big shift was moving from sales-led to product-led growth. Back in May, I was doing around 10 calls a day. It worked but wasn’t scalable. Now people sign up automatically, even while I sleep, and we only take calls with larger teams. It completely changed my life.\n\n\\-Influencer posts : We pay influencers to post about us on LInkedIn, it has been working really well.\n\nWe’re a team of three plus one VA, spending zero on ads. Our only paid channel is affiliate commissions.\n\nOur goal for end of December was 1m ARR. It will be less. We failed but it's growing.\n\nIf you have any questions, I’m happy to share more details and help anyone building their own SaaS.\n\nCheers !\n\n[Proof](https://gojiberry.ai/proof)",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.59,
    "subreddit_type": "public",
    "ups": 70,
    "downs": 0,
    "created_utc": 1765098634.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2684533520415315
  },
  {
    "score": 69,
    "title": "After 20 Failures, I Finally Built A SaaS That Makes Money 😭 (Lessons + Playbook)",
    "selftext": "Years of hard work, struggle and pain. 20 failed projects 😭\n\nBuilt it in a few days using Ruby on Rails, PostgreSQL, Digital Ocean, OpenAI, Kamal, etc...\n\nLessons:\n\n* Solve real problems (e.g, save them time and effort, make them more money). Focus on the pain points of your target customers. Solve 1 problem and do it really well.\n* Prefer to use the tools that you already know. Don’t spend too much time thinking about what are the best tool to use. The best tool for you is the one you already know. Your customers won't care about the tools you used, what they care about is you're solving the problem that they have.\n* Start with the MVP. Don't get caught up in adding every feature you can think of. Start with a Minimum Viable Product (MVP) that solves the core problem, then iterate based on user feedback.\n* Know your customer. Deeply understand who your customer is and what they need. Tailor your messaging, product features, and support to meet those needs specifically.\n* Fail fast. Validate immediately to see if people will pay for it then move on if not. Don't over-engineer. It doesn't need to be scalable initially.\n* Be ready to pivot. If your initial idea isn't working, don't be afraid to pivot. Sometimes the market needs something different than what you originally envisioned.\n* Data-driven decisions. Use data to guide your decisions. Whether it's user behavior, market trends, or feedback, rely on data to inform your next steps.\n* Iterate quickly. Speed is your friend. The faster you can iterate on feedback and improve your product, the better you can stay ahead of the competition.\n* Do lots of marketing. This is a must! Build it and they will come rarely succeeds.\n* Keep on shipping 🚀 Many small bets instead of 1 big bet.\n\n**Playbook that what worked for me (will most likely work for you too)**\n\nThe great thing about this playbook is it will work even if you don't have an audience (e.g, close to 0 followers, no newsletter subscribers etc...).\n\n**1. Problem**\n\nCan be any of these:\n\n* Scratch your own itch.\n* Find problems worth solving. Read negative reviews + hang out on X, Reddit and Facebook groups.\n\n**2. MVP**\n\nSet an appetite (e.g, 1 day or 1 week to build your MVP).\n\nThis will force you to only build the core and really necessary features. Focus on things that will really benefit your users.\n\n**3. Validation**\n\n* Share your MVP on X, Reddit and Facebook groups.\n* Reply on posts complaining about your competitors, asking alternatives or recommendations.\n* Reply on posts where the author is encountering a problem that your product directly solves.\n* Do cold and warm DMs.\n\nOne of the best validation is when users pay for your MVP.\n\nWhen your product is free, when users subscribe using their email addresses and/or they keep on coming back to use it.\n\n**4. SEO**\n\nROI will take a while and this requires a lot of time and effort but this is still one of the most sustainable source of customers. 2 out of 3 of my projects are already benefiting from SEO. I'll start to do SEO on my latest project too.\n\nThat's it! Simple but not easy since it still requires a lot of effort but that's the reality when building a startup especially when you have no audience yet.\n\nLeave a comment if you have a question, I'll be happy to answer it.\n\nP.S. The SaaS that I built is a [tool that automates finding customers](https://customerfinderbot.com/) from social media. Basically saves companies time and effort since it works 24/7 for them. Built it to scratch my own itch and surprisingly companies started paying for it when I launched the MVP and it now grew to hundreds of customers from different countries, most are startups.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1744787637.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2337076873812167
  },
  {
    "score": 67,
    "title": "The $1 Hack That Kills the Freemium Trap",
    "selftext": "Every new SaaS is expected to launch with a generous free plan.  \nBut too often, it just creates a huge support load from users who never had the slightest intention of paying, while draining focus away from the real customers.\n\nOur solution? We killed the free plan.  \nInstead, we added a $1 “freemium” and we refund the dollar after payment.\n\nThat tiny friction point removed 99% of free riders, fake cards, and time-wasters… while keeping conversion rates insanely high.\n\nCurious to hear from others:  \n→ Has freemium been a growth engine for you, or just a slow distraction?\n\nYou can try our funnel here : [gojiberry.ai](http://gojiberry.ai)  \nIt converts really well !",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1758547065.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9819805888596544
  },
  {
    "score": 66,
    "title": "How to get startup ideas😭",
    "selftext": "I DONT WANT TO WASTE MY LIFE AND BRAIN!!!!!!  \n  \ni have seen videos about elon and steve jobs and read isaac book on ELON . i am 23m medical student. i feel startup scary. i must have many wrong learnings about startups. i havent read books about startups. just watched few y combinator youtube channel videos. it is looking worth pursuing journey in life but i dont know anything about ideas for startup or how everything works . also i have limiting beliefs that i am lazy, not intelligent, uncreative person for startups .or i ll never have startups or businesses running. but at the same time i dont want to waste my life in hospital s or doing just ordinary person tasks. i think i should not waste my intelligence. life is precious.\n\nplease tell how to get started on this problem solving journey. and get ideas and execute them with violent effort. videos and books resources are also welcome.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1767086527.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.430119796196798
  },
  {
    "score": 69,
    "title": "I built a platform for app testing and it just hit 245 users!🎉",
    "selftext": "Two months ago I launched an app testing platform where indie devs can upload their apps to get some first users and their feedback. Since then I've been posting about it on Reddit and users grew slowly but steadily each day.\n\nI'm so happy and I'm working on improving the app every day! Thank you to everyone who joined.\n\nThe platform works like this:\n\n* You can **earn credits** by testing indie apps (fun + you help other makers)\n* You can **use credits to get your own app tested by real people**\n* No fake accounts -&gt; all testers are **real users**\n* Test more apps -&gt; earn more credits -&gt; your app will rank higher -&gt; you get more visibility and more testers/users\n\nSome improvements I implemented in the last days:\n\n* you can now comment on feedback and have conversations with testers\n* every new user now has to submit at least one feedback before uploading an app\n* extra credit rewards for testing 5 and 10 apps\n* you can now add a logo to your app\n\nYou can check it out here (it's totally free): [https://www.indieappcircle.com/](https://www.indieappcircle.com/)\n\nI'm glad for any feedback/suggestions/roasts in the comments.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 69,
    "downs": 0,
    "created_utc": 1762520472.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4142042969019286
  },
  {
    "score": 63,
    "title": "Tested 4 startup ideas in 6 months, killed 3 early - here's how I figured out which one to actually build",
    "selftext": "\nUsed to spend 4-6 months building each idea before showing it to anyone, then launching to complete silence. Did that twice over 2 years, wasted probably $7K and countless hours. Decided to completely change my approach and test ideas way faster before committing to building anything substantial. The new process was forcing myself to validate demand before touching code. For each idea I'd spend 2 weekends just researching, finding people actively complaining about the problem on Reddit and forums, DMing 15-20 of them asking about their current solutions and what frustrated them most. If fewer than 10 people responded or showed real interest, I'd kill it immediately and move to the next idea.\n\nIdea 1 was a scheduling tool for consultants. Found maybe 8 complaints total, got 3 DM responses, nobody seemed that bothered by current solutions. Killed it after one weekend. Idea 2 was a content calendar for small agencies. Found 25+ complaints, got 12 responses, but when I asked if they'd pay $39/month most said probably not or maybe $15. Pricing signal was too weak, killed it after weekend two. Idea 3 was invoice tracking for freelancers. Found 40+ complaints, DMed 30 people, got 18 responses with real frustration about losing track of unpaid invoices. When I asked about paying $19/month, 7 people said yes immediately. Built a landing page that weekend describing the solution, posted it back in those communities, got 32 email signups and 4 people actually paid upfront through Stripe giving me $76 before building anything. That validation felt completely different from the previous two.\n\nSpent 3 weeks building the simplest version, launched it to those 32 people, got 9 more paying in week one. That was 7 months ago, now at $2.1K monthly with 114 paying users. Growth is steady at 10-15% monthly, mostly from word of mouth and organic search from blog posts I started writing in month 3. The fast validation approach came from studying founder journeys in [FounderToolkit](http://foundertoolkit.org/) where successful people killed bad ideas in days not months. Saved me from wasting 8-12 months building ideas 1 and 2 that would've failed. Now I can test 3-4 ideas in the time it used to take me to build one wrong one.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1767363996.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2143312243675304
  },
  {
    "score": 66,
    "title": "Idea: A Modern Flip Phone That Only Does 4 Things. Text, Call, Camera &amp; Payments. Thoughts?",
    "selftext": "I just had this idea and wanted feedback.\n\nWhat if we brought back flip phones, but redesigned them for today—with a premium look, minimal distractions, and just the essentials?\n\n\nConcept is a modern flip phone that only does:\n1. Text\n2. Call\n3. Camera (simple, clean rear camera only)\n4. Online Payments (QR, UPI, NFC)\n\n\nThat’s it.\nNo social media. No internet browser. No App Store. Just a clean, focused device.\n\nThe back of the phone could have luxury-style design (metal, custom engravings, symbolic finishes) — not to look old-school, but to feel like a status symbol for people who value time and focus.\n\nIt wouldn’t try to compete with smartphones on features. It would compete on peace of mind, aesthetics, and intentional use.\n\n\nWould there be a market for something like this?\nIs this just nostalgia, or is there real demand for a distraction-free but usable phone with modern basics?\n\nAppreciate honest opinions—good or brutal.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 66,
    "downs": 0,
    "created_utc": 1749054998.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3903011409439197
  },
  {
    "score": 65,
    "title": "What’s one startup idea you wish someone else would build?",
    "selftext": "I’ve been thinking about how many problems we encounter every day that could easily be solved by a simple tool or automation, but most of us don’t have time to build *all* of them.\n\nIf you could snap your fingers and make one startup exist, something you personally need but haven’t seen built yet, what would it be?\n\nIt could be in any space: productivity, AI, health, education, creator tools, or even something super niche.\n\nCurious to hear the ideas you *wish* someone would run with (bonus if you’ve validated it a bit but can’t take it on yourself).",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1762770249.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5359057381862926
  },
  {
    "score": 64,
    "title": "What online business idea are you shocked no one has built yet?",
    "selftext": "You know that moment when you are using an app or browsing a website and suddenly think, \"Wait.. why does this not exist yet?\" Maybe it is a tool that would save people hours, a niche marketplace, or a clever service that feels inevitable once you hear it.\n\nI’m talking about those online-first ideas, SaaS tools, platforms, automations, digital services, that seem so obvious in hindsight but somehow haven’t been built (or haven’t blown up yet).\n\nWhat is your \"this should totally exist\" idea?\n\nWhether it is a tiny convenience or a game-changing startup, drop it below. Let’s see what the hive mind comes up with, who knows, maybe someone here will build it!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 64,
    "downs": 0,
    "created_utc": 1757920103.0,
    "media": null,
    "is_video": false,
    "num_comments": 167,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5780679975057867
  },
  {
    "score": 63,
    "title": "Looking for Teammates to Build a SaaS Startup Together",
    "selftext": "\nHey everyone,\n\nI’m a 24-year-old Mongolian who lived in Korea for about 7 years. I have a degree in IoT and am looking for like-minded people to collaborate on projects and turn them into a SaaS business.\n\nThis isn’t a job offer—I’m not offering a salary. Instead, I’m looking for teammates who are willing to work together, build something meaningful, and launch a startup. I’ll be using React and Python for web development, but I’m open to other tech stacks if it makes sense for the project.\n\nIf you’re passionate about building products, learning, and creating something from scratch, let’s connect!\n\nComment below or DM me if you’re interested. Let’s build something great together!\n",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1740735341.0,
    "media": null,
    "is_video": false,
    "num_comments": 77,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.487227275329127
  },
  {
    "score": 63,
    "title": "I got sick of LinkedIn and made my own job site for Big Tech and HFT Jobs.",
    "selftext": "Hey Reddit!\n\nWhen I was job hunting recently, I got frustrated with sites like LinkedIn. Jobs were often reposted but marked as new, filters didn't work well, and my applications seemed to go nowhere. So, I decided to build my own job board with these features:\n\n* **Fresh job listings** directly from company career pages, updated constantly—many new jobs are added every 5 minutes.\n* **Accurate posting dates**, so you know exactly when a job was added.\n* **Curated list of companies**: Over **400 top companies**, focusing on quality rather than quantity. This includes big tech names like **Google, Microsoft, Facebook (Meta), Amazon, and Uber**.\n* **Free-text search**: You can type something like \"Google Germany,\" and it will instantly list Google jobs in Germany.\n* **No login needed**.\n* **Fast and easy search and filtering**, including options specific to tech jobs.\n\nSo far, I've collected over **12,000 job postings**, and I'm planning to add more. While the site is focused on tech jobs, you'll find all kinds of desk jobs listed in the big tech and HFT companies.\n\nI'd love to hear what you think! Is it helpful? Any features you'd like me to add?\n\nCheck it out here: [leethub.io](https://leethub.io)\n\nHFT -&gt; [https://leethub.io/hft-jobs](https://leethub.io/hft-jobs)  \nEuropean Big Tech Jobs -&gt; [https://leethub.io/eu-top-tech-jobs](https://leethub.io/eu-top-tech-jobs)\n\nHappy job hunting!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1728510264.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.088904434673024
  },
  {
    "score": 63,
    "title": "The 4 Tools That Helped My Static Site Attract 7 Paying Customers",
    "selftext": "I’ve built static sites before, but this time I wanted to test whether it was possible to earn money without relying on ads, hype, or full-time effort. My focus was on working just evenings, using a clear tech stack, and maintaining consistency.\n\nHere’s a breakdown of the tools I used:\n\n**Autopilot Directory Submissions**  \n\nInstead of spending weekends filling out endless forms, I used [GMB](http://getmorebacklinks.org) to automatically submit my site to over 50 startup directories and niche SaaS listings. This boosted my Domain Rating (DR) from 0 to 6 in about three weeks and got my site indexed in just a few days. This was the pivotal moment that drove traction.\n\n**Static Site and Landing Page Builder**  \n\nNormally, I code my own sites, but this time I prioritized speed. [Framer](https://www.framer.com/) provided me with a clean, responsive site that had solid performance metrics in under a day. Additionally, managing SEO basics like titles, meta descriptions, and Open Graph tags was straightforward.\n\n**Content Drafting and Angle Testing**  \n\nFor my blog content, I used [Copy.ai](http://copy.ai) to quickly generate drafts focused on long-tail keywords. Instead of overthinking the content, I refined the drafts into two simple posts. One of them began to rank on Google within just two weeks.\n\n**Email Capture and Simple Drip Campaigns**  \n\nI added a lightweight email capture form to my landing page and connected it to [ConvertKit](https://kit.com). I set up a brief three-email sequence: an introduction, a value tip, and a soft call to action. This approach helped convert some trial users into paying customers without the hassle of manual follow-ups.\n\n**Results:**  \n\nIn just 30 days, while working only in the evenings, I managed to attract 980 organic visitors to my project. This traffic resulted in 31 trial sign-ups, with 7 of those converting into paying customers. My Domain Rating (DR) improved from 0 to 6 during this period, and I didn’t spend a single dollar on advertising. The total effort required about 10 hours per week, demonstrating that focused execution with the right tools can yield significant results even with limited time and no budget.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 63,
    "downs": 0,
    "created_utc": 1757983177.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0768763165629998
  },
  {
    "score": 62,
    "title": "The exact steps I took to validate my idea before building (now at $6k MRR)",
    "selftext": "I know what it's like to try to market a product that no one wants, I’ve built two that completely failed. No one wanted them and I wasted months trying to make it work.\n\nI’ve also built successful products and the key difference was that the successful products solved a real problem. It sounds obvious but it’s easy to forget sometimes.\n\nThe hard part is how you validate that you are solving a real problem so I thought I’d share exactly how I did it:\n\n**Step one: Start with a problem thesis and talk to users**\n\n* I was a founder and I had a problem that I suspected other founders had too\n* So I had my problem thesis and the next step was to talk to my would-be users to see if the problem was real and to understand their view of it better\n* I made a post on [r/SaaS](https://www.reddit.com/r/SaaS/) and [r/indiehackers](https://www.reddit.com/r/indiehackers/) asking founders to answer a few questions and in return I would give them feedback on whatever they were building\n   * The key part here was offering them something in return for their time. That makes it a lot easier to get answers\n   * Here's one of the posts if you’re curious: [https://www.reddit.com/r/indiehackers/comments/1ea1cpd/lets\\_exchange\\_feedback/](https://www.reddit.com/r/indiehackers/comments/1ea1cpd/lets_exchange_feedback/)\n* The got me in touch with 8-10 founders who were willing to answer my survey.\n* I asked questions about pain points related to the problem and tried to get an idea if they were willing to adopt the solution I had in mind.\n* The responses were positive so I had the green light to start building a simple first version\n\n**Step two: Building the MVP**\n\n* This is the easy part. Who doesn’t love building?\n* The critical thing here was that I tried to understand what the survey responses were telling me and built a bare bones solution addressing the pain points of these people\n* I built fast. Around 30 days for the MVP\n* That's it. It was time to market this MVP and see if I can get some users\n\n**Step three: Marketing and collecting feedback**\n\n* First I set a clear goal. It wasn’t about getting customers, I just wanted as much feedback as possible so I would need active users. Understanding how to make the product better is so much more valuable at this point\n* I set the goal of getting 20 active users in two weeks\n* Then I asked myself where my users hang out and the answer was X and Reddit\n* Next step was to set daily volume targets. I decided to do 5 posts and 50 replies on X every day and on Reddit I would just write a new post when I had something that had worked well on X\n* So I knew exactly what to do every day and then I just executed that plan. It was easy, because I just had to take action, no questions asked\n* Two weeks later I had hit 100 users\n\nThat was the validation process I used. From there on, all I had to do was improve the product based on what users were telling me and continue marketing. That has taken me all the way to $6k MRR with [Buildpad](https://buildpad.io) and growth just becomes easier with time.\n\nI hope my journey can inspire some of you to not give up and to follow a solid process for building your product.\n\nFeel free to ask if you have any questions.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 62,
    "downs": 0,
    "created_utc": 1756392537.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.134565010142719
  },
  {
    "score": 60,
    "title": "I got 1.9M views on a viral X post yesterday. Here is exactly how much MRR it generated.",
    "selftext": "Yesterday, one of my posts went viral on X and hit 1.9M views.\n\nI wanted to share a transparent breakdown of how that vanity metric actually translated into paid users for [my SaaS](https://gojiberry.ai).\n\nThe Funnel:\n\n* Viral Hook (Post 1): 1.9M views\n* The \"Plug\" (Post 2 &amp; 3): 78k and 62k views\n* Profile Visits: 2,700\n* Website Visitors: \\~1,000\n* New Accounts on my SAAS : 48\n* Credit Cards (Trials): 17\n\nThe Financials: My current trial-to-paid ratio is roughly 33%. Based on the 17 trials, I project gaining 6 paid clients.\n\nTotal Revenue Impact: \\~$600 MRR.\n\nLet's be honest, for almost 2 million views, 6 clients isn't huge.\n\nThe massive drop-off happened because I advertised the SaaS in the thread (posts 2 and 3) rather than the main post.\n\nThe fall from 1.9M to 78k views killed the conversion momentum.\n\nNext time, I’m going to pitch the product directly in the first post/video to capture that initial traffic, rather than relying on them clicking through a thread.\n\nOverall, $600 MRR is not life-changing, but it’s profitable and validates that the attention is there. I'm definitely doing it again.\n\n[Here is the tweet](https://x.com/romanbuildsaas/status/2006974222300831980?s=20)\n\nCheers!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1767452552.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9733938528498864
  },
  {
    "score": 60,
    "title": "I validate SaaS ideas in 48 hours now (used to take 3 months)",
    "selftext": "I used to spend months researching ideas before building, then more months building before learning nobody wanted it. Lost two years this way. Now I validate in one weekend using this framework. Tested on three ideas killed two Sunday night, built one that's now $7K MRR. Friday night (2-3 hours): Pick one specific problem for one specific audience. Not \"productivity tools for teams\" but \"time tracking for freelance designers billing hourly.\" Search Reddit, Facebook groups, Indie Hackers for \"[audience] frustrated,\" \"[problem] sucks,\" \"wish someone would build.\" Find 40+ unique complaints. If fewer than 15 unique complaints, kill the idea Friday night.\n\nSaturday morning (4-5 hours): DM 50 people who complained. Template: \"Hey [name], saw your post about [pain point]. Researching this problem can I ask 3 quick questions?\" Get 15-20 responses (30-40% response rate typical). Ask: what do you currently use, what's most frustrating about it, if I solved [specific pain] for $X monthly would you buy it? If 10+ people say yes at $15+/month, continue to next step. Saturday evening (3-4 hours): Build simple landing page on Carrd or Webflow. Explain solution in three bullets. Price it clearly. Add Stripe payment link or waitlist. Post in 2-3 communities: \"Building [solution] for [pain]. Early access [price]/month.\" Goal: 5+ clicking payment, 1-2 actually signing up.\n\nSunday: Review all data. Did 15+ complain? Did 10+ say they'd pay? Did 5+ click payment? Yes to all three = validated idea. No to any = kill it immediately, start new idea next Friday. My results: Idea 1 killed Friday (only 6 complaints found). Idea 2 killed Saturday (no real willingness to pay). Idea 3 validated Sunday (got 12 pre-orders at $79 each). Built it in 2 weeks, now $7K MRR. Complete framework with all templates in [Toolkit](http://foundertoolkit.org/).",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1763570450.0,
    "media": null,
    "is_video": false,
    "num_comments": 16,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.045554295699904
  },
  {
    "score": 60,
    "title": "Don't know anything about coding, yet wish to startup",
    "selftext": "I dont know a single line of code, but I have this strong urge to build a startup...\n\nI have always been drawn to building something of my own. I’ve been thinking more seriously about starting up from last 2-3 years.. maybe something digital, SaaS-based, or even a simple service that uses tech. But the truth is, I have absolutely no background in coding. Not even the basics 😢 The reason why I have failed to start something till now..\n\nIts frustrating sometimes because I see all these solo founders building apps from scratch and launching in a weekend, while I feel stuck not knowing where to begin 🙂‍↕️\n\nSo I wanted to ask people here who have been in this position or who understand the space,\nHow do non-tech founders make their way in the startup world?\nIs it smart to learn to code a bit just to understand how things work?\nOr should I focus on business, ideas, customers, and find someone technical to team up with?\n\nI’m genuinely open to all advice: books, courses, real talk, red flags, or personal stories. Just trying to figure out the best way to get started.. Grateful 🙌\n",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1753603726.0,
    "media": null,
    "is_video": false,
    "num_comments": 89,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4599510897304295
  },
  {
    "score": 57,
    "title": "Looking to connect with someone to brainstorm and maybe build something together (side project/startup)",
    "selftext": "Hey everyone,\nI’m a backend developer with around 1.5 years of experience, mostly in AI/ML and backend. Lately, I’ve been wanting to work on something meaningful outside my regular job — ideally a side project or early-stage idea that could grow into something real in the consumer space.\n\nI’m not looking for anything formal right now, just want to connect with like-minded people who are also thinking about building or experimenting with ideas. If you’re already working on something or just in the “figuring things out” phase, I’d love to chat and see if we can brainstorm together.\n\nLet’s talk one-to-one and see where it goes.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1759643735.0,
    "media": null,
    "is_video": false,
    "num_comments": 88,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4881229968853935
  },
  {
    "score": 53,
    "title": "Co-Founder left midway, learned more in 5 months than in 5 years.",
    "selftext": "Hey folks,\n\nI’ve been a backend engineer for about five years, but I’ve always leaned more toward the business side. My co-founder was the one who loved infra, Elastic, Redis, all the gritty stuff. I was more focused on product and ops.\n\nWe launched AroundU in July, it’s an app that helps people meet others nearby based on shared interests. Think football in Hyderabad or Charlie Puth fan meetup.\n\nEverything was fine… until he left midway. Suddenly I was staring at a backend I barely understood, full of services, schedulers, and configs that I didn’t set up.\n\nFor a week, I genuinely thought I couldn’t do it. But once the panic wore off, I just started learning, one fire at a time.\n\n**The backend chaos**\n\n*The first big hit was ElasticSearch.*\n\nOut of nowhere, the cert expired, and my main instances stopped connecting. Logs made zero sense. Every search query in the app started failing, which, of course, was most of the app.\n\nI spent 24 straight hours figuring it out, rebuilding certs, fixing cluster auth, learning how Elastic security actually works. It was painful, but also kind of addictive.\n\n*Then came Redis.*\n\nBots kept scanning for open ports, and before I knew it, my master nodes were turned into slaves. The system couldn’t write, and the app just... died.\n\nI locked everything down, closed the ports, added a VPC, set up auth, and rebuilt replication from scratch. That one took me from “I think I know Redis” to “I really know Redis.”\n\nAnd honestly, ChatGPT (for all the hate it gets) saved me more than once.\n\n**Where things stand now**\n\n* We’ve crossed 6K organic users and do around ₹1.25L in weekly volume.\n* The first payment, ₹149 felt like a million\n* Now people create their own lobbies like Charlie Puth fan meetup or Weekend football. That’s when it started feeling real again.\n\n**What I’ve learned**\n\n* You can learn anything when the alternative is watching the app die.\n* Always set up alerts before you need them\n* Sleep is optional, uptime isn’t\n* You don’t need a big team,  just a big enough reason to keep going.\n\nIf anyone’s been through similar chaos, co-founder leaving, infra blowing up, or random bot attacks. I’d love to hear how you handled it. Im still part time, but learning a lot.\n\nPs, as folk are dming me, app link -&gt; www.aroundu.in",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1762123669.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8439387533189406
  },
  {
    "score": 55,
    "title": "Any startup ideas without \"AI\".",
    "selftext": "I have seen like hundreds of post about startup ideas, and they are all, well, AI. I mean i understand that AI is this, AI is that, but there has to be new startups and ideas that don't have that \"AI\" in their startup. I am sorry but most of the AI startups are just rebranding of one another. \nAI is future, it is important and i genuinely love the people who are working on ideas with different usecases with AI. But there has to be models, ideas that don't have their core as AI or not surrounds the \"AI\". I mean it can have AI as their one of the feature but not just that only. ",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1761676381.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.341884906917685
  },
  {
    "score": 54,
    "title": "Free Startup Ideas Giveaway: I did the research, you do the building.",
    "selftext": "Hey everyone,\n\nI spend a lot of time analyzing online communities to find real, painful problems people are complaining about. The goal is to avoid building something nobody wants.\n\nI've found a bunch of validated ideas recently and wanted to give a few away. Please, someone build these.\n\n1.A Universal Concert Payment System\n\nThe Problem: Paying for food, drinks, and merch at concerts is a nightmare. You're stuck in long queues to top-up wristbands, you have no idea what things cost until you get to the front, and getting a refund for leftover money is basically impossible. You miss the music just trying to buy a bottle of water.\n\n\nThe Idea: A universal NFC card + mobile app that works across different festivals and venues. Features would include pre-loading money via the app, instant tap-to-pay at stalls, and a balance that carries over to the next concert you attend.\n\n\nWhy it'll work: The demand is massive. The frustration with unreliable refunds and missing the experience you paid for is a real, painful problem for millions of people.\n2.An AI-Powered Live Sales Coaching Tool\n\nThe Problem: Sales reps, especially new ones, freeze up on live calls. They get an unexpected objection or a technical question they can't answer, and the deal stalls. Confidence is shot, and opportunities are lost.\n\n\nThe Idea: A real-time AI tool that listens to sales calls and \"whispers\" suggestions in the rep's ear. It would offer live transcription, AI-generated responses for common objections, and instant retrieval of product info when a tricky question comes up.\n\n\nWhy it'll work: This has been explicitly requested in sales communities. A user literally said they wanted \"something that can basically whisper in my ear during sales calls.\" The need for in-the-moment support is huge.\n3.An Automated Guest Promotion Platform for Podcasters\n\nThe Problem: Podcasters put in a ton of effort to interview guests, but about 50% of those guests never share or promote the episode afterward. The host loses out on a massive potential audience.\n\n\nThe Idea: A platform that makes guest promotion ridiculously easy. After an episode goes live, the platform automatically generates custom social media graphics, quote images, and pre-written posts for the guest. It would provide them with a single link where they can \"one-click\" share everything to their own social channels.\n\n\nWhy it'll work: Hosts are desperate for this. They're already manually creating these assets. Automating it and making it seamless for the guest solves a huge marketing pain point for creators.\n4.A Smart Document Search for Healthcare Clinics\n\nThe Problem: Medical offices are drowning in scanned paper documents (patient histories, invoices, lab results). Even in a \"paperless\" office, these files are just images, meaning you can't search for text inside them. Staff waste countless hours manually hunting for specific information.\n\n\nThe Idea: A simple, secure software that uses AI-powered OCR (Optical Character Recognition) to make every scanned document in a clinic instantly searchable. A user could type \"John Smith invoice March 2024\" and the tool would immediately find and highlight the correct document.\n\n\nWhy it'll work: A user in the digital health space was already building a prototype for this, directly addressing the frustration that \"A lot of the PDF files within these software is not text searchable which is frustrating.\" This is a pure efficiency play for a massive industry.\n\n\nHappy building!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1757894005.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2217546178541117
  },
  {
    "score": 55,
    "title": "1,000+ places to promote your startup (and it’s free)",
    "selftext": "I compiled 1,000+ places to promote your startup (and it’s free).\n\nMost founders keep asking: where can I post, where can I get visibility, where can I launch?\n\nAnd usually, they end up with the same 3 startup directories everyone shares.\n\nI decided to go further.\n\nI built a complete database (free Google Sheet) with 1,000+ verified places to promote your product, including:\n\n\\- Startup directories (with Domain Rating &amp; submission requirements)\n\n\\- Subreddits ranked by size &amp; engagement\n\n\\- Discord / Slack communities with member counts\n\n\\- Newsletters with sponsorship pricing info\n\n\\- Facebook groups, LinkedIn communities, Telegram channels\n\n\\- Even specific subreddits that allow startup posts (with rules)\n\nWhat makes it different from other lists:\n\n\\- Shows estimated traffic/impact (high/medium/low)\n\n\\- All free to use\n\n\\- Direct links to submission pages\n\n\\- Constantly updated with new findings\n\n\\- A dedicated page to post YOUR startup easily\n\nIt took me weeks to compile and verify this. Hopefully it saves other founders time and helps you discover channels you didn’t know existed.\n\nIt's available here : [https://www.notion.so/1-000-places-to-promote-your-startup-268b9abcbe3f803592a1c29abf5ca5d6?source=copy\\_link](https://www.notion.so/1-000-places-to-promote-your-startup-268b9abcbe3f803592a1c29abf5ca5d6?source=copy_link)",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1757404777.0,
    "media": null,
    "is_video": false,
    "num_comments": 9,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9606880270062006
  },
  {
    "score": 54,
    "title": "Exploring AI for Streamlining Marketing and Operations in Early-Stage Startups",
    "selftext": "Hey everyone,\n\nRunning a startup often means juggling dozens of tasks at once, and for small teams, marketing can be especially time-consuming. Managing Google and Meta ads manually takes hours every week, and even small mistakes can impact results significantly. This makes me wonder how AI could play a bigger role in helping startups operate more efficiently.\n\nTools like Get-Ryze.аi can automatically manage and optimize ads, reducing the need for constant monitoring and manual adjustments. Seeing this in action got me thinking: if AI can handle ad optimization, what other repetitive or resource-heavy tasks could it take over? Could it help with content scheduling, customer engagement, or even workflow management for small teams?\n\nI’m curious about what the community thinks, are there gaps in the market where AI could save early-stage startups time and money? Or are current tools like Get-Ryze.аi already covering most of these opportunities? It seems like there could be room for new startup ideas focused specifically on making AI more accessible and useful for small teams with limited resources.\n\nWould love to hear your thoughts and any experiences you’ve had experimenting with AI in your startup workflows.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1761846224.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8248476916622534
  },
  {
    "score": 53,
    "title": "Airbnb but for Storage (P2P Storage Platform)",
    "selftext": "Hi everyone,\n\nI’m working on an idea for a peer-to-peer self-storage platform in Latin America. \n\nThe concept is to connect people with unused storage space (private garages, basements, etc.) with those in need of affordable, flexible storage solutions.\n\nSince I have a non-tech background, I was planning to build an MVP using a no-code/white-label marketplace platform.\n\nSome features I'm considering:\n- Space categories: private vs. business spaces\n- Dimensions: standard sizes (e.g., 2x2x4m)\n- Accessibility options: 24/7 vs. daytime, self-accessible vs. host access\n- Amenities: security, WiFi, CCTV, smoke detectors, etc.\n\nWould love your thoughts on:\n- Does that sound like a reasonable idea?\n- Do you think there is demand for this in Latin America or other emerging markets?\n- Any experience using no-code tools?\n\n\nThanks in advance for your input!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1735166822.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.303442688790827
  },
  {
    "score": 53,
    "title": "I built something cool hehehe",
    "selftext": "So after busting my ass off for around 3 weeks and 200+ hours of development time, I finally launched a really cool no-code AI chatbot maker. \n\nIt was such a huge work as it was something which was pretty complicated in general to build from scratch but I managed to pull it off anyway.\n\nHow is it different from competition ? \nI address one pain point specifically: Existing tools are complicated as sh*t. They not only provide 1000000 useless features, but the UI has a million different buttons doing a million different things and it is soooooooo overwhelming. \nI have tried to make my tool EXTREMELY simple. The UI is really soothing and I got good feedback for it.\n\nWhat do you guys think ? Is it a dumb SaaS ? Or could it make some money ? Shall I try running it for profit, or shall I just sell it ? Will people even buy it lol ?\n\nP.S There is no ads, no option to buy or anything I am selling you. \n\n[answerlyai.cloud](https://answerlyai.cloud) is my tool ❤️",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1733880334.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2512856881828363
  },
  {
    "score": 53,
    "title": "Stop overthinking. Just launch it.",
    "selftext": "I keep seeing the same trap when folks try to build the thing that will make them money.\n\nI’m a **solo founder.** I’ve shipped wins and buried duds. The main pattern I see in myself and others: we make it way too hard to start. Here are the three big strikes I see over and over.\n\n**Strike 1:** “Someone already built it.” That usually means demand is real, not that you’re blocked out. One pizza place in town doesn’t mean there’s no room for another. Pick a slice of the market they ignore, serve a tighter niche, use a different channel, or just be faster and kinder. You don’t need to be the only option—just a strong option for a clear group.\n\n**Strike 2:** “I need more features before I can launch.” Most people don’t want more features. They want a result. Ship the smallest thing that delivers one clear outcome. Let real users tell you what the next feature should be. If people won’t join a waitlist or prepay for the core promise, more features won’t fix it.\n\n**Strike 3:** “I need the perfect name, brand, and plan first.” You don’t. Use a working name. Grab any clean domain. Write a simple promise. Launch. Brand grows with use and feedback. Plans are guesses until someone outside your head pays attention.\n\nHow to launch in 48 hours\n\n* Write your promise: “I help \\[who\\] do \\[result\\] in \\[time/way\\].”\n* Pick one tight niche to start. Narrow markets are easier to win.\n* Make a simple landing page: headline, 3 benefits, 1 screenshot/mock, 1 CTA (waitlist or checkout).\n* Add a way to collect interest: email waitlist or a simple Stripe/Gumroad payment link.\n* Reach 20 people directly who match your niche. Ask for blunt feedback. Offer to onboard them yourself.\n* Post where your users actually hang out (niche subreddit, small community, relevant Discord). Follow the rules. Be human.\n* If you get crickets, change the promise or niche, not your tech stack. Iterate daily.\n\nWhat to track (early)\n\n* Signups per 100 visits\n* Replies from outreach\n* Time to first value for first users\n* One sentence people use to describe you back to you\n\nIf any of these go up after a change, you’re on the right path. Keep shipping. If not, tighten the niche or sharpen the promise.\n\nYou’re closer than you think. Launch something small this week. Learn in public. Iterate. Winners are usually the ones who stayed simple and kept moving.\n\nIf you still need more help, try this [tool](https://starterpilot.com/). It’s a kit I built that helps you validate the idea, pick a name, make a quick logo, build a clean landing page, and publish fast with a waitlist—so you can go from idea to live in a day.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1757233867.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.039365435976387
  },
  {
    "score": 51,
    "title": "I hate my ridiculous 9-to-5 job, working on my startup ideas is what keeps me going",
    "selftext": "To introduce myself, I am a Staff AI Engineer at a well-known company and my job involves leading cross-functional teams on major projects.\n\nI really hate my job.\n\nI’ve become a glorified project manager. I don’t build anything. I make decks, constantly battle ego-driven colleagues who ignore good engineering practices, and forced to follow absurd management requests. Worst part? We’re building something with zero PMF. The roadmap changes weekly based on the PM’s whims, with no user feedback. I haven’t written a single line of code in 3 years.\n\nBy early last year, I started mentally checking out (quiet quitting). I lost all passion. I nearly quit, but then my wife got laid off, so I stuck around. Around that time, I stumbled upon the indie hacking community and it changed everything.\n\nI always thought building a business required VC money and connections. This community showed me you can start small, solve a real problem, make a simple profitable product, and live your life to the fullest. That’s the life I wanted.\n\nI first tried building an AI-powered assessment tool for teachers. Since I had no time outside work and I never did frontend dev, I hired a full-stack contractor. Biggest mistake. There were constant delays and soon I realised that their incentive was never to deliver on time. The further they push, the more money they make.\n\nWhen I finally launched, it failed miserably, never got any traction. I relied on FB ads and cold outreach, which did work at bringing users but churn was really high. Never made any money. In hindsight, it wasn't solving any pain point.\n\nI shut it down earlier this year, but there was another idea in my head that kept consuming me.\n\nIt was based on a problem I personally faced. Updating software documentation is something many developers hate doing and yet the importance of up-to-date docs cannot be overstated.\n\nThis time I decided to do things myself. No contractors, no ads, no shortcuts. I'd code the whole thing myself like a true indie hacker.\n\nSince I'm good at Python and suck at frontend, I built it as a GitHub app so I only had to focus on the backend. Coded every morning from 5–8am before work. After a month of focused effort, the app is ready and submitted to the GitHub Marketplace for review. The app is called DeepDocs if you're interested.\n\nI feel like I’ve rediscovered the joy of building—just like in my early 20s (I’m in my 30s now). These days, my mood is surprisingly upbeat, even after meetings that feel like shouting matches. I don’t let any of it get to me, because I know something I actually love is waiting for me at home: my open VSCode editor.\n\nI'm also glad I'm doing it all myself this time so not wasting money unnecessarily. I still have a lot to learn about turning it into a profitable product, but I’m not in a rush.\n\nTL;DR: I hate my current job, but indie hacking gives me purpose and joy.",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1747286326.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.03904897316264
  },
  {
    "score": 48,
    "title": "My startup idea is a bit weird!",
    "selftext": "Hi, I'm a student and currently in 3rd year of undergrad. So here is the problem especially with women. Whenever I wanted to travel to a new place I searched the same thing, 'is this place safe to go'. Not the crime rates , just general safety, how safe is for women, how safe is neighborhood or transport . I tried asking many people, all answers were just based on 'vibes', I wanted to see real people experiences . Safety is best if people share there experience and google reviews are too generic , ratings are based on 'how good the coffee' was, not on safety !\n\nMost of the times I found myself in the room , I wanted to travel solo but same safety anxiety and no real data to see. It is so frustrating ! Maybe you guys can also relate, if you are living alone. As a student and traveler it is so frustrating to sit in front of screen for 5 hours just searching same question. Yes I can ask chat gpt, but for safety real people experience matter more I suppose. People post these experience but they are lost in communities.\n\nSo, I started building a product called 'Safe or Not', a  just type in the location and all stats in one place, even for streets. You can share the experience so other people can travel better.\n\n[Safe or Not](https://www.safeornot.space/community)\n\nYou can search for 'Bangkok' or 'Vietnam' for example\n\nFor context I have around 125 signups in around 2.5 months, purely from reddit, you can see my profile ! On daily basis I receive a traffic of 200-250 visitors.\n\nWanted to know your feedback!\n\n\nEdit: Holy fuck 40k views and 39 upvotes 🙏",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1763918722.0,
    "media": null,
    "is_video": false,
    "num_comments": 105,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3778490126608984
  },
  {
    "score": 50,
    "title": "I quit my job and made peanuts in almost a year. Reality behind those MRR screenshots.",
    "selftext": "Okay, I’ll be dead honest here, and sick of seeing people posting their MRR success stories. If you need a reality check, here is my story.\n\nI am a product designer based out of India, I quit my decently high paying job last December and have been trying to pursue this indie maker journey since then. It’s been almost 10 months now and I have realised it’s not easy.\n\nHere is my snapshot in a nutshell:\n\nLaunched two products, made just 8 sales and those projects are nowhere making any more money.\n\nAnd burned a hole in my pocket.\n\nI learnt that, it’s just not easy. \n\nFor a successful product, either you need an insight which gives you an edge over someone building in the same domain or rather you have some distribution to go with.\n\nAnd now I am back on a job hunt, super insecure because now I have to justify that one year which basically resulted in absolute 0.\n\nHere are few additional learnings:\n\n* Successful products aren’t built on top of other products. \n* Be really fast if you get an insight or some positive mover.\n* Build distribution.\n* If you are planning to quit, make sure if you have active cashflow coming in, that’s very very important.\n\nHowever, one positive highlight is that now I have execution capability which might come in handy.\n\nBack to job hunt now! The market looks grim, though. \n\nWish me luck!!",
    "subreddit": "Startup_Ideas",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 50,
    "downs": 0,
    "created_utc": 1730482939.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.047706428649589
  }
]