[
  {
    "score": 1984,
    "title": "Left a white-collar job 4 years ago to focus on a small \"side-gig\" commercial cleaning business I had that was grossing $9k/month. This month we will invoice $277k and are growing at a rate of $10k per month. AMA",
    "selftext": "In 2016 I came across an opportunity on bizbuysell.com to purchase a commercial cleaning \"business” that consisted of three commercial cleaning contracts, which grossed about $7k per month. Over the next three years I slightly grew that business to a whopping $9k per month in 2019. At that point I decided to leave my corporate job and focus on this business full-time.\n\nFrom 2019 to the point I posted my last post in 2022, I grew the business to $138k per month and was growing at a rate of $6-8k per month in recurring business.\n\nAs of last month, August 2023, we invoiced $277k, have 101 facilities under contract and about 150 part-time and full-time employees/contractors working with us.\n\nWe are now growing at a rate of around $10k per month and I am looking for an additional sales person as we speak to step on the gas a little more. I am also starting to look around for a potential new branch location out of state.\n\nOur clients and contracts are getting bigger which has been fun to see. For example, we now have 5 clients that have contracts which range from $10k-26k/mo. And we are currently in talks with another prospective business that will have a contract that exceeds $26k/mo.\n\nThings will obviously continue to change as we grow further, but we have figured out an operational structure that has allowed for our fast paced success that I think will scale with the business for a while.\n\n**AMA**\n\n*Since my last post many people have reached out and a good % of those people ask how they can get started, how to find employees, what supplies they need, where to buy supplies, etc. etc.*\n\n*I can't emphasize enough that you need stop analyzing everything and just get started. Like my own story shows, it took me a few years to even figure out what the heck I was doing before I started getting real traction.*\n\n&amp;#x200B;\n\n**BELOW ARE COMMON QUESTIONS THAT HAVE BEEN ASKED MULTIPLE TIMES IN THREAD**\n\n**Question # 1-**\n\nWhat is my take home and/or net profit per month?\n\n**Answer -**\n\nMy company is an S Corp and so I pay myself a $60k per year salary. I live a frugal lifestyle and that is all I currently take out of the company.Last months net profit % was 9.8%. Until recently my net monthly profit % was fluctuating around 2-4%. Why so low? Because I am in growth mode. I have hired proactively so that we have the infrastructure to handle future growth. If I were to pump the brakes on growth and focus on leaning this out I could probably get my net profit up to 15% (not including my $60k salary).\n\n&amp;#x200B;\n\n**Question # 2 -**\n\nWhat do you pay your cleaners?\n\n**Answer -**\n\nWe start cleaners at $17/hr. These are hourly positions. Some cleaners work just a few hours per week. Some work 20+ hours per week.\n\n&amp;#x200B;\n\n**Question # 3 -**\n\nHow do you get leads?\n\n**Answer -**\n\nWe do not use any social media or digital marketing. We only cold call, cold email, and drive around and walk into businesses. My sales person handles the entire sales process from cold leads to signing the contracts. Nothing in this process is outsourced and no automated email blasts or anything that would make our efforts seem unauthentic.\n\n&amp;#x200B;\n\n**Question # 4 -**\n\nHow much did you pay for the initial \"business\" of 3 contracts?\n\n**Answer -**\n\n$50k. This was all my savings.\n\n&amp;#x200B;\n\n**Question # 5** \\-  \nHow do you calculate your pricing? Per square foot? Per hour?  \n\n\n**Answer** \\-  \n98% of the time we provide a flat rate monthly cost (with a 1 year contract that auto-renews). So, we do not charge by the hour and only provide a s/f price if they request it.\n\nTo calculate pricing we do have a detailed spreadsheet that calculates the price based on a few different cost inputs. In summary, you need to know your costs to service the client and then tack on a markup.\n\n&amp;#x200B;\n\n**\\*\\*\\*I am trying to answer everyone's questions. However, and I don't mean to be rude, I can no longer respond to questions that have already been asked and answered in the thread.\\*\\*\\***\n\n**\\*\\*\\*If you would like to speak further about anything regarding my business and/or ask questions you may send me a DM. However, please either have already started your cleaning business or be 150% certain you are starting a cleaning business. \\*\\*\\***\n\n&amp;#x200B;\n\n&amp;#x200B;",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1984,
    "downs": 0,
    "created_utc": 1695057129.0,
    "media": null,
    "is_video": false,
    "num_comments": 712,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.436805276025067
  },
  {
    "score": 1036,
    "title": "Easiest money I made in my life.",
    "selftext": "I started a commercial cleaning business with my cousin, and we currently have two restaurants and a small office building within a short distance of each other. We are about five months in, three of which include all three contracts, and together it takes us about four hours from start to finish, not including drive time. We net about $5k each a month. This is by far the easiest money I have ever made, especially since we have a good routine down now. With one more quality contract, I'm quitting my day job and doing this full time. I can't believe I never did this sooner.",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1036,
    "downs": 0,
    "created_utc": 1701937203.0,
    "media": null,
    "is_video": false,
    "num_comments": 210,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.912919984037887
  },
  {
    "score": 1012,
    "title": "From an idea to replacing my full-time salary in 4 months and hitting $20 million in total sales as of this week. How I did it, and what's next!",
    "selftext": "12 Years ago I wrote a post on Reddit about my sweaty startup that led to a bunch of other redditors becoming millionaires.\n\nAs of 2 weeks ago I hit the $20 million dollar sales mark myself.\n\nProof cause it's Reddit: [https://capture.dropbox.com/sSU3bL9w5R7vSSVh](https://capture.dropbox.com/sSU3bL9w5R7vSSVh)\n\nSo how it started\n\nIn October 2011 I was reading an article about a guy that started a cleaning company in his city and is now doing $150,000 per year.\n\nI worked full-time, but figured, shoot, if he can pull that off, why can't I?\n\nI got to working in this order:\n\n1. I drew up a quick marketing plan-literally one page in bullet form\n2. Had a website built that featured some of the ideas that I thought was most appealing about his site.\n3. Asked my home cleaner if she would take the jobs if I got any and she basically said \"hells yeah\" (I now have a total of 40 cleaners)\n4. I brushed up on my adwords (I had already owned an Adwords guide and had dabbled in adwords before for another local company)\n5. Started Twitter and Facebook page.\n\nAll of this took like 3 weeks.\n\nI launched the site on November 3rd and had the first job on the first day.\n\nBy the end of November I made my first $1,000 profit, and in a few weeks did ($4,000 per month), which exceeded the take home pay from my full time job.\n\nQuit my job at the $40,000 per month mark and then went on to build a multi-million dollar company.\n\n[https://capture.dropbox.com/5EoDW1zGfXDvgbQZ](https://capture.dropbox.com/5EoDW1zGfXDvgbQZ) &lt;-Me quitting my job.\n\nThis post is three-fold. To say,\n\n1. This is not brain surgery and\n2. Don't overthink shit, sometimes just doing it is the only answer.\n3. I'm going to re-create the case study that I did as I built this company in real time, updated with what works in 2024 and you can follow along and do it yourself if you would like.\n\nOr you can hang out here for 10 more years without doing anything.\n\nAnyhow that's the plan, if you're down, let me know I'll go through every day what to do for the next 27 days and show you exactly how to build these companies.\n\nIn true reddit fashion you can tell me why this no longer works or the market is saturated or blah blah blah and I'll just giggle over here and keep going.\n\nEither way, It kicks off tomorrow if the admins here allow it.\n\nEdited to add this, it's screenshot after screenshot of countless redditors that followed my original case study and did it as well (some of them with bigger companies than mine). Did I fake all these screenshots too? lmao? [https://docs.google.com/presentation/d/1gUESPVsiuhxLCHHU0vBt7FwNpMM1QQPPwBz44RpZ6\\_o/edit?usp=sharing](https://docs.google.com/presentation/d/1gUESPVsiuhxLCHHU0vBt7FwNpMM1QQPPwBz44RpZ6_o/edit?usp=sharing)\n\nEdit: One day back on reddit reminded me why I stopped posting on reddit in the first place. Some of you are...special.\n\nYou can follow along here: \n\n[Day 1- The Industries that Work](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1atam05/day_1_choose_your_industry_live_20_million_dollar/)\n\n**Links to catch up with me:**  \n\\#1 - DM me on instagram: www.instagram.com/rohangilkes  \nFacebook group: https://www.facebook.com/groups/remotecleaning   \nMy Website: https://rohangilkes.com/  \nMy Twitter threads: https://rohansthreads.co/  \n",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1012,
    "downs": 0,
    "created_utc": 1708104913.0,
    "media": null,
    "is_video": false,
    "num_comments": 415,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.020156110673652
  },
  {
    "score": 800,
    "title": "Buying a bounce house for $700",
    "selftext": "I’m 21 &amp; was gna rent a bounce house for my bday for $300 but realized I could buy one &amp; start renting it out. Seems to be high in demand. Found one listed on marketplace for $700 for a commercial realllllly nice bounce castle guys just trying to get rid of. It’s gna be abt $1000 in total to get this thing. Is it really silly? My dad thinks it’s a great idea I’m about to pick it up but now I’m getting nervous. I don’t rlly have $1000 to waste but I figure I could always resell it? ",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 800,
    "downs": 0,
    "created_utc": 1742830454.0,
    "media": null,
    "is_video": false,
    "num_comments": 416,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.941200543571116
  },
  {
    "score": 509,
    "title": "How I started a dog poop scoop company and generated 200k in revenue in our first year of business 😀🐶💩",
    "selftext": "\nJust wrapped up the first year with Fresh Start - Pet Waste Removal, and we hit $200k in revenue! It’s been a wild ride, but here’s the blueprint we used to grow so quickly. Hopefully, this helps anyone thinking about starting something similar.\n\n\t1.\tFacebook &amp; Google Ads for Lead Generation\nWe run FB and Google ads to pull in 2-5 leads daily. Since pet waste removal is still a “new-ish” service, a lot of our ad spend goes towards educating people and building brand awareness. Key takeaway: NEVER pause or stop ad spend unless you absolutely have to. This constant visibility is what keeps our leads flowing.\n\n\t2.\tSolid Lead-to-Sale-to-Service Process\nIt’s one thing to get leads—it’s another to turn them into customers. This is where your team’s skills come in. Make sure your crew has the communication and personal touch to build trust, show value, and convert as many leads as possible. You’ll maximize your ROI if you nail this.\n\n\t3.\tHire the Right People\nWe needed a team that’s not just okay with the “dirty work” but who genuinely enjoy engaging with customers (and their dogs). Find people who can make a connection in person, on the phone, or even over text. Good people skills go a LONG way in this business.\n\n\t4.\tPrioritize Reviews\nCustomer feedback is huge. We made it a point to gather as many reviews as we could—right now, we’re sitting at 175+ 5-star reviews. Nothing builds trust and credibility faster. Plus, it helps a lot with search rankings!\n\n\t5.\tBrand Your Trucks\nOnce you have employees in trucks, get them wrapped. This isn’t just about looking professional; it’s a mobile billboard. People LOVE our branded trucks and mention them all the time, so it definitely adds to the overall customer experience.\n\nIf you’re serious about breaking into this industry, feel free to DM me. I’m focused on scaling Fresh Start, but I also have a marketing and coaching agency if you need help getting started in pet waste removal.\n\nHappy scooping!",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 509,
    "downs": 0,
    "created_utc": 1730571623.0,
    "media": null,
    "is_video": false,
    "num_comments": 300,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.621853423894858
  },
  {
    "score": 506,
    "title": "Made $500 in a week pulling weeds and light yard work w/ 0 experience . No internet needed. 6-10am. Only “$4” to start up.",
    "selftext": "Sales have been slow recently at my sales job, just enough money to have my bills paid but not enough to go on trips like I used to. I have zero experience with lawn care and wanted to make some extra cash. \n\nWent to dollar tree, bought index cards, a sharpie and sticky notes. Cost me $4. Made 30 makeshift business cards with the following info \n\n(Lawn Care Name)\n(My Name) \n(Phone #)\n\nI proceeded to walk to an upscale neighborhood ($700,000k+) homes which are huge where I live, you might have to hit the million dollar ones if you live somewhere expensive. All it really matters is that they have money. I went to a house that needed light weeds done, left my index card with a sticky note attached that said \n\nMoney for tools? Everyone knows someone who has a few tools around, you’d be surprised how much people are willing to help you when you are trying to help yourself \n\n(their exact address) super important \n(Your price) “Front weeds only”\n\nI did that 30 times and got 3 calls back for 5 total days worth of work. I averaged out $25/ per hour but I know I can make more per hour once I become more efficient with my time. \n\nI specially choose to not use the internet at all to get business, I’m just going to farm all the houses that are less than a mile away from me to do less driving. Plus I feel a lot more in control so I tell my clients that I’ll be there at 6am with a straight serious tone and they don’t question it\n\nalthough it’s not a crazy amount of money, I feel a lot more free now financially since i have an income source now instead of rotting away at my apartment trying to pay rent. \n\nIf anyone has any advice I can do to be more profitable I’m all ears ",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 506,
    "downs": 0,
    "created_utc": 1756727925.0,
    "media": null,
    "is_video": false,
    "num_comments": 116,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.474100890206417
  },
  {
    "score": 491,
    "title": "20 yr old making 100k+ a year",
    "selftext": "I just turned 20 this past February and I make 100k+ a year. I work in the oil field (specifically the refinery’s). I work 12 hour days everyday and 90% of the time it’s out of town. I have no life outside of work. Reason for this post is I wanna find something and go all in, I’m tired of living out of hotels and never being home. I have the money (still live with my parents), the work ethic, and the drive. I was thinking of dump trailers, I have a vehicle to pull one and the cash to buy one, seems a little saturated though(I live in a major city). Any leads on other business ideas would be much appreciated.",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 491,
    "downs": 0,
    "created_utc": 1743049489.0,
    "media": null,
    "is_video": false,
    "num_comments": 255,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.5710850854232845
  },
  {
    "score": 442,
    "title": "I started a home service biz in a new city 6 years ago at the age of 24. I became a millionaire by the time I turned 28. We are scaling just under 1M in growth per year. AMA",
    "selftext": "I wish there were more mentors in my industry to guide me, so I'm making this post in the hopes that I can help others.\n\n1) The major services we offer are window cleaning, pressure washing, and exterior painting.\n\n2) My inspiration:\n\nWhen I was 19 and starting business school, I realized nobody was actually teaching me how to run a business. I joined a company that taught students how to run businesses by painting homes. This is where I learned two MAJOR lessons.\n\nA) Most homeowners are stuck between a local guy who is unreliable and a big company that does not care. They are desperate for high-end trades and are willing to pay for them.\n\nB) Painting is difficult to scale because very few people paint their homes every year. Window cleaning is repeat revenue for life if you do a good job\n\nAfter building my student business for 4 years, I moved to a new city to start a window cleaning business with 2 goals. To be the best service in town while treating people properly.\n\nWhile you read this, please keep in mind that I had 4 years of training before this business. Although I started from nothing, I did understand the basics of selling and doing the service.\n\n3) How I got started:\n\nWe are in Canada and the winters get pretty cold -30 celcius/-22 Fahrenheit.\n\nNaturally, I saw this as an opportunity to knock on doors because nobody wanted to leave the house. I had no business cards, branding, or anything. I made a Word document contract, printed it out, and made it look semi-professional. Each time I got a lead, I would set them up for an in-person estimate the following weekend. I would then give them a quote, and take a 25% deposit by cheque to schedule jobs for the spring. (Some people did not trust me at first, but most of the time, I was able to present myself well enough that it was not an issue.)\n\nAs time passed, we improved everything. We began only accepting credit cards, using software to move away from paper, and built a website with proper branding.\n\nI posted ads to hire sales reps to knock on doors with me and do the labour in the summer. I barely needed any startup cash because the deposits covered most of it.\n\nI managed to book about 90k in jobs by the beginning of spring and finished the year with 300k in sales at a 30% margin.\n\n4) My Plan:\n\nMy father was an immigrant entrepreneur who was a slave to his business. From this, I learned that I never wanted my business to own me. I set a goal that within 3 years the business would be self-sufficient and not need me to work in it. To be clear, I am extremely passionate about business and was not looking to retire early. I just wanted to work ON IT instead of IN IT.\n\nBy the end of the second year, we hit 1m in sales and I knew I needed help. I was working 100 hrs a week and taking over 100 phone calls a day. I was managing so many jobs I could not focus on doing anything well. I convinced 2 best friends from my hometown to move here and help me run things with the promise that I would change their lives.\n\n5) Where we are today:\n\nWe are on track to do $4.5 million this year with 40 staff and healthy profit margins. The choice to hire my friends paid off as they are now running most of the front end of the business. After next year, I could leave the business and be hands-off for the rest of my life, but I want to stay involved and keep growing.\n\n6) Where I want to go\n\nI plan to hit 10m in the next 3 years and 50m in 10 years. I intend to dominate my local market first as this is a major city and then expand once we squeeze all the juice out.\n\n7) Advice:\n\nI could write a book on all the life/business lessons I've gained on this journey. Instead, I will let you guys ask whatever you want and do my best to answer in the hopes it helps others.\n\nP.s. the response to this post was far greater than I imagined it would be. I’ve contemplated building a course for trades since so many who have done it are offering sub par education. \n\nI’m now thinking I might just focus on my own for now and one day build one for free. When I do, I’ll come back to this post and tag you guys. \n\nI think business education should be made available to everyone and the world will be a better place",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 442,
    "downs": 0,
    "created_utc": 1711925913.0,
    "media": null,
    "is_video": false,
    "num_comments": 318,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.61829906775166
  },
  {
    "score": 398,
    "title": "Yet another Pet Waste Removal business, but it's become a monster in 3 months.",
    "selftext": "Hello all, I want some words from anyone on this. It's a doozy. \n\nI started a dog poop removal business 3 months ago, and it's taken off. \nAdmittedly, branding and marketing are my favorite parts of running a business, so that probably has a lot to do with it. But her we go.\n\nI'm no total newbie to the small business game, I ran an LLC for 3 years, a food truck, and it whent amazing. We only stopped because it was too time consuming and the profit margins were too wild to depend on, and life changes happened, nothing bad! \n\nBut this dog poop scoop business is a new beast. My new baby. \nIn the beginning I wanted 5 or 6 clients on a monthly subscription based service, to help with extra money. Well I got that, in the first 2 weeks. \nI chose a name that isn't funny like \"Poop Boys\" etc. It's a decent name that is safe for people to admit they are a customer of. My branding is also going well, two colors. Black and gold. I'm consistent with my style of online marketing, as well as using art that is within my taste but still unique. I also, bought good looking shirts and hoodies to look more professional over the competition. ( In my area, only one competition, 60 miles away) \n\nMy communication I try very hard at, as well as basic small business owner type mindset. Being a nice person for God's sake. \n\nBut after my initial boost of clients, I grew to 7, to 9 to 12 to 15 now at a total 39 residential properties. In three months. \nMy route is very well put together so time between properties is 2-5 minutes. \nROUGHLY 50$/hour while scooping poop. Not including billing and back end work. \n\nJust over 2,000$+ in revenue for my third month alone. NOT including the one time cleanups I do. From monthly subscription alone. Once a week. \nThe profit margin is massive, basically bags and gasoline, wear and tear on vehicles ( quite low) and starting equipment. \nMy city is about 20,000 people and I'm about to expand to nearby cities. One which is 40 miles away, 50,000 people. The other 30 miles away, 2,000 people. On the same highway so easy travel route. \n\nI'm taking the gamble, leaving a full time job I make 19.62$/hour at. To scoop dog shit and I love it. \n\nI'm believing in my work ethic and branding/marketing to make me a more successful person by running off of solely my own business. \n\nAny thoughts? \nBad idea? (To leave my full time job) \nGood idea? (To leave my full time job) \n\nI want to hear anything. I'm terrified, but ready to swim to survive. 🤘\n",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 398,
    "downs": 0,
    "created_utc": 1712456118.0,
    "media": null,
    "is_video": false,
    "num_comments": 312,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.583745064459973
  },
  {
    "score": 366,
    "title": "I’m 6 months into this home bakery thing. Here’s an update.",
    "selftext": "I began my cottage bakery business journey in March, quit my job the first week of June, and been doing this full time balls to the wall since then. It is hard work. I sell my regular loaves for $12 and inclusion sourdough loaves for $15 and scones, 4/$12. \nI get most of my supplies from BJ’s and Amazon. What sets me apart from my competitors is the flavors I provide. Granted, I have to play in my sandbox that NY allows me to and follow strict rules of what’s allowed and what’s not. Since march, I’ve paid my taxes twice. In March my income was $385, in August it was a little over $2k. Which might not be a lot for you all, but that’s a lot of bread. I’m able to pay my bills, buy groceries for my home, and I’m so proud of that. I started at nothing. Now I have 3 wholesale accounts. A farm-stand that I stock on weekends, pop up events a few times a month, along with my weekly pre orders (about 10-20 a week depending on the week). I am a busy gal. I hand mix everything. And I bake 8 loaves at a time in my regular old conventional electric oven doing the double pan method. Now that I’ve gotten a lot of the supplies I needed I feel as though I’m getting into a groove. I want to begin offering more items. It’s hard to find the time since I’m just one person. Next on the list is English muffins and bagels. I genuinely hate scones with my being. Dough on my hands, totally fine. Butter on my hands? Kill me. \nI just like to have these posts as real-time markers in my journey. \nI’m manifesting a brick and mortar commercial kitchen at least to rent to work out of next. After that, a small cafe open late nights that we can do karaoke and game nights at. \nAfter that- world domination. \nK thx for coming to my ted talk. ",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 366,
    "downs": 0,
    "created_utc": 1757180573.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.1288924024951825
  },
  {
    "score": 354,
    "title": "How I turned my last $103 into $3400 in 7 days with a sweaty “startup”",
    "selftext": "I own a small lawn care business. It’s been a love hate relationship. I've always looked at “non-sweaty” businesses with envy thinking it’s better on the other side. I'm tired of the seasonality, weather, hard work, and issues that come with my\nHome Service business. \n\nAs we were going into winter of last year, I saved up enough money with the plan to shut down my lawn business and start something non sweaty. I told my employees, customers, friends, and family what was going on. \n\nI tried starting several online businesses only generating DOZENS of dollars for each idea. It was a completely different game than I was used to. I was spending so much money trying to get them up and running. We also ran into many money issues like my truck breaking down, occasional things breaking in our home, and medical expenses. \n\nOn top of that, I have a wife and toddler who need to live as well. I was bleeding cash. \n\nCome late February, I was down to ONLY $103 in my bank account and panicking. Rent was due in 5 days and I felt helpless. I’ve given it my all and after wasting $15k+, I was mentally exhausted \n\nThe main issue in my business is I never have marketed consistently. Only when I need work. That’s why I always had big dips in revenue and never really stable. \n\nMy only 2 strong business skills I have is running Facebook ads and sales. That is it. \n\nI took the last of all of our money, and put it into my lawn care ad account on Facebook feeling like a failure. \n\nI made a campaign at $20/day split testing with $10/ad. It was a before and after photo of a lawn renovation we did with great results in under 4 weeks. I got 10 leads over 5 days and collected upfront payment from 2 customers by the 7th day adding up to $3400. \n\nThat same ad is still running and it has generated 21 times more profit than I’ve invested in marketing. \n\nThe humble lesson here for me is to market even when I have enough customers and if you have something working, think twice before killing it. \n\nNot a super impressive story but maybe this will give someone hope! I needed hope when I was completely dead in the water and really didn’t have any.\n",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 354,
    "downs": 0,
    "created_utc": 1742685738.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.257389039946416
  },
  {
    "score": 334,
    "title": "One of the least competitive services I’ve ever offered",
    "selftext": "No startup capital.  \nNo investors.  \nJust an old floor machine I got for free because someone was going to toss it. A non profit was selling their building and no longer needed the machine, but they wanted clean floors in their dining room to help with the sales process. I agreed to do the floors for free in exchange for the floor buffer.\n\nThat was 12 years ago. In that time, I taught myself how to **strip and wax floors** on a professional level, and I made over **$1,000,000** with that one machine.\n\nLet me break it down for you:\n\n# This isn’t just a one-time job, it’s recurring.\n\nMost commercial floors need:\n\n* **Daily**: Sweeping &amp; mopping\n* **Weekly**: Burnishing (high-speed polish)\n* **Monthly**: Scrub &amp; recoat\n* **Every 6–12 months**: Full strip &amp; wax\n\nIf you can land a client for the full cycle, you’ve got steady, predictable income all year long.\n\n# The math on a single 2,000 sq ft floor:\n\n* **Strip &amp; Wax** – $1.20/sq ft → **$2,400** (done 1–2x per year)\n* **Scrub &amp; Recoat** – $0.35/sq ft → **$700/month**\n* **Burnishing** – $0.10/sq ft → **$200/week**\n* **Daily sweeping/mopping** → **$45–$70/day**\n\nLet’s say they just want:\n\n* Strip &amp; wax 2x/year = $4,800\n* Scrub &amp; recoat monthly = $8,400\n* Burnish weekly = $10,400\n* Daily mop = $16,500\n\n**That’s $40,100 per year** — from one floor.\n\n# Costs?\n\n* Floor wax: \\~$100 per job\n* Stripper: \\~$30 per job\n* Pads, mops, bags, buckets: $20–30\n* Labor: Depends, but you can run lean — solo or with one helper\n\nStrip &amp; wax jobs take a few hours to one day.  \nScrub &amp; recoats are faster.  \nDaily mopping and burnishing can be delegated once you grow.\n\nI started by doing it all myself.  \nNow I have a crew and recurring contracts.  \nThis one skill changed my life.\n\n# Here’s the best part: There’s not much competition.\n\nYes, you’ll find other people offering floor care.  \nBut if you actually build a business around it with quality, systems, and reliability you’ll be one of maybe 2 or 3 real options in your area.\n\nA lot of mom-and-pop cleaners list it as a service but haven’t put in the time to do it right.  \nI know, because I get paid to fix their mistakes.\n\nAnd while big regional janitorial companies offer floor care too, their teams are tiny, undertrained, and usually minimum-wage workers with no real supervision.\n\nI worked for one of those companies.  \nGuys would skip work and go to the bar.  \nThey’d rummage through medicine cabinets in hospitals.  \nThey’d show up so hungover they’d sleep in the van the entire shift.\n\n**You can outcompete these people.**\n\nThis is a dying skill.  \nNot many people know how to do it right.  \nBut it’s **desperately needed** because proper floor care can extend the life of a $100,000 surface indefinitely years and prevent costly replacements.\n\nIt’s not glamorous.  \nIt’s not a \"startup.\"  \nIt’s not some automated passive-income fantasy.\n\nIt’s real work.  \nWith real clients.  \nAnd **real money**.\n\nSo if you're hunting for a practical business you can start with no capital, look down.  \nThere’s money on the floor.",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 334,
    "downs": 0,
    "created_utc": 1749240082.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.23228614311193
  },
  {
    "score": 263,
    "title": "I started an event rental business 8 months ago",
    "selftext": "So as the title says, I started an event rental business in April of 2023 ([www.woodburyeventrentals.com](https://www.woodburyeventrentals.com) for anyone who is curious).  We rent tables, chairs, linens, dance floors, and other core wedding/event items.\n\nAs I come to the end of the year and I am looking back at how things have gone, as well as looking forward to what's to come in 2024, I just wanted to write about some of the things that I have learned.\n\n1. Marketing is key, especially online marketing.  I partnered with a company ([www.recipi.com](https://www.recipi.com)) that specifically caters to event rental businesses.  They handled building my website, setting up Google ads, SEO, and general advice (since the owner also has 10 years as a successful rental company owner himself).  This year alone we have had over 5,400 visitors to our website, and over 400 inquiries between phone calls and website form submissions.  Byhaving this many leads we have been able to focus on the specific areas and events that we want, and we can avoid having to take every job that comes along just to get business.  This also means that I don't have to worry about dealing with the inevitable cheapskates and \"negotiators\" that we all eventually run across.\n2. One of the key strategies that Recipi and I came up with was to not invest in any equipment until after I had confirmed orders.  That meant that I had to make sure that I wasn't locking in a rental less than 3 weeks out, but that wasn't a big deal.  I actually booked my first order while sitting in LAX on vacation with my wife.  At the time, I didn't own anything other than a website.  But that one order (grad party) referred me to several other local moms, and it was off to the races.  By the time that I ordered my first collection of tables and chairs I had 5 orders confirmed and deposits made.  The second half of the strategy was to reach out to local venues and venue managers and try to make some partnerships.  While I haven't locked in a lot of these yet, I do have one venue owner that I have partnered with as their supplier for any hosted events.  I have also been added to two venues as one of their \"preferred vendors\" and I have made friends with a couple of local event planners.\n3. When it comes to the actual renting of equipment (the sweaty part, this is r/sweatystartup after all) work smarter not harder.  When I buy equipment, I see if there are carts, dollies, or other accessory equipment made for those items.  I have chair carts, table carts, dance floor carts, and wheeled cocktail table racks.  I realize that this might seem painfully obvious, but I also know that there are people out there who would skip the $125 chair cart and instead use a $15 furniture dolly from Harbor Freight, and just wrestle with the load to save the money.  But you will find that customers greatly appreciate it when you roll up to their event and you wheel a cart with their 40 chairs into their garage and let them know that they get to keep it.  These items also let you store more stuff in a smaller area, which when you're running the business out of your garage is very important.\n4. Don't ask for \"reviews\".  Ask for 5 STAR REVIEWS. If you did your job well, people will leave them for you.  If you send a thank you email with a link for them to do so, they will do it even more often.  I tried actually mailing thank you cards to people.  I sent out 20-30 cards and I got 1 review.  I have sent out probably 20-30 thank you emails and I have received the other 12 on my Google business profile.  Again this might seem obvious, but I wanted to make the point.\n\nOne note, most of the time you should (probably) do some market research and see who/what else is in your area that you're going to compete with.  I didn't do this.  I just pulled the trigger and ran with it.  I got somewhat lucky with my geographic location and the fact that the city that I'm in turned out to be underserved in the event rental area.   But I can also tell you that even if you are in a city with 5 other rental companies, there is a niche you can fill.  Whether you specialize in smaller orders or bifold tables that can be packed into a Honda Civic or you're the best at last minute jobs or you just happen to be the one source for folding farm tables and whiskey barrels you will get business.  Once you get a foot in the door and get a reputation going you will grow.\n\nThat's all I have for right now.  If you have any other questions DM me or leave a comment here and I will try to answer what I can.",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 263,
    "downs": 0,
    "created_utc": 1701484554.0,
    "media": null,
    "is_video": false,
    "num_comments": 181,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.286639620862369
  },
  {
    "score": 251,
    "title": "A niche business I built that turned into something surprisingly lucrative",
    "selftext": "\nA few years ago, I started a side project building in-pool loungers —basically, furniture that sits in shallow pool areas. I used pool plaster, polished to an ultra smooth finish, and it really clicked with high-end homeowners and pool designers who wanted something unique instead of the junky plastic lounge chairs that flood the market.\n\nIt started small—working out of my garage,  running ads on social media. But demand kept growing, and I realized there was a real niche here: luxury outdoor design that blends form, function, and custom work.\n\nNow I’m at a point where I can’t serve every region myself, not to mention the cost of shipping impacts the cost tremendously. So I’ve been quietly working on a way to bring on a few people who want to take this concept into their own markets. I figured this might resonate with folks here—people who don't mind getting their hands dirty, understand how to deliver quality, and want to own their time.\n\nNot trying to pitch anything hard here—just thought I'd share the experience in case someone out there is looking for a unique angle to build something of their own.\n\nHappy to answer any questions or talk shop in the comments.\n\n*Edit 5/23:\n\nMy account was suspended for 3 days because I sent too many DM's to people interested. I guess it raised spam flags. I'll do my best to reach out to everyone who showed interest. However,  send me DM's moving forward. Or email me: info at shelfloungers dot com\n\nThanks",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 251,
    "downs": 0,
    "created_utc": 1747679555.0,
    "media": null,
    "is_video": false,
    "num_comments": 249,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.3278705451175625
  },
  {
    "score": 250,
    "title": "Did I say $90k/mo? WE CROSSED $100K/MO!!",
    "selftext": "It’s wild to think that just 6 days ago I was hyped about hitting $90k in my cleaning business, and now we’ve crossed $100k. Adding $10k in a week was easier than I thought. Now, I can officially say I’m making 6 figures a month, lmao. Since hitting this milestone means I’m more busy than ever, I can’t answer all the questions right here—send me a PM and I’ll try to get back to you when I can.\n\nBut to summarize what helped me reach $100k/mo:\n\n1- Start, then ask how. I get a lot of DMs asking how, what, when, and they don’t even have their LLC yet. Get moving first.\n2- If you’ve got money, make it work for you. I’m running circles around old heads still knocking on doors to sell, since we’re spending big on ads and on our marketing team.\n3- Your website is your 24/7 salesman. My website guy told me this, and it shifted everything. If your website looks like it’s wearing a 1678 suit, no one’s buying.\n4- Never stop marketing, even when you’re fully booked. Hire more people, keep the momentum going.\n5- Hire talent, train them, and pay them GOOD. ",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 250,
    "downs": 0,
    "created_utc": 1728867937.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.997204353176888
  },
  {
    "score": 240,
    "title": "The grind was worth it.",
    "selftext": "Started a custom apparel business a little over 3 years ago. Put my literal blood, sweat, and tears into it as well as pretty much every cent I've made. Sitting at a show for a band I've liked since high school because they contacted me to do their merch. Bartender at the show asked about the hoodie I'm wearing because her bf has the same one and it's his favorite. I made it. Feeling pretty proud of myself and just needed to share. Keep at it. It's worth it.",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 240,
    "downs": 0,
    "created_utc": 1702341299.0,
    "media": null,
    "is_video": false,
    "num_comments": 25,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8245037165602773
  },
  {
    "score": 212,
    "title": "Just hit my first $10k month in junk removal",
    "selftext": "Hey all, \n\nI've been sharing my progress in here for a while now and I'm really happy to share where I'm at as of June 2025. We've just crossed 10k with 6 days left in the month and I'm honestly so surprised and happy that we made it. For reference, we've done 5500 in revenue for both April and May, and I was hoping to do maybe 7500-8000 in June. I really can't believe it and I'm more optimistic about my business than ever now. Yard signs are still my main lead source but i did land a big job from someone seeing my truck and calling. I also got a lot of jobs from my network and local community.\n\nI still have a lot to do. I need to upgrade to a bigger trailer to do more jobs without having to go to the dump so often, I still need way more leads coming in the door so I have to find a second reliable lead source to pair with yard signs (I'm looking into Google ads but I'm still skeptical about it), and I just need more and better systems to keep pricing consistent and train new team members.\n\nIf you're thinking about starting a sweaty startup, don't wait. I was never a blue collar guy, but I decided to start because of Nick Huber's blog, and I'm so glad I did. In 6 months you could have a thriving business, or you could be left with an idea that never got off the ground. These businesses are low risk and high upside and totally worth trying. Thanks for reading. ",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 212,
    "downs": 0,
    "created_utc": 1750797216.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.033019246469678
  },
  {
    "score": 208,
    "title": "I just started a dog-walking business and people are telling me to give up already...",
    "selftext": "I quit my \"big girl\" job in July because despite the money being good, I was absolutely miserable. I had no time to spend with my family and I was sick of being treated like dirt. I thought that if I follow my passion then life would reward me.\n\nI already have a few clients I built up from Wag and Rover, and I have one new client I just got this week. I made flyers and business cards, networked at the local animal shelter, pet stores, and retirement homes. I created a website, Facebook and Instagram as well. Business is slow as it has only been a month, so I am trying to be patient, but others around me are not and it's starting to irk me and make me doubt myself.\n\nI have a part-time job now to help keep our heads above water while the business grows and I fully expected the first couple of months to be financially difficult. I have talked to a lot of people about this and some are excited for me, while others, mainly my Dad and my brother, are asking me how long I plan on doing this and that I need to get a real job with benefits. It's incredibly discouraging and I guess I'm just here to ask how some of you have overcome the people you love not supporting you.",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 208,
    "downs": 0,
    "created_utc": 1724329427.0,
    "media": null,
    "is_video": false,
    "num_comments": 258,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.25429616815168
  },
  {
    "score": 204,
    "title": "90k/mo? WE DID ITT",
    "selftext": "I just hit $90k this month with my cleaning business, and it’s crazy because I recently posted about doing $70k-ish. You guys literally witnessed it happen in real-time. Honestly, it’s all about investing in the right people. I stopped trying to do it all myself and started hiring solid talent, paying them what they’re worth, and things shifted fast. If you’re serious about scaling, stop being cheap with your team—pay them right, treat them well, and your business will grow. That’s the real key, no shortcuts.",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 204,
    "downs": 0,
    "created_utc": 1728293223.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.961784492751604
  },
  {
    "score": 200,
    "title": "Just my two cents about YOUR sweaty startup",
    "selftext": "\nI lurk on this sub a lot. I always have irons in the fire. I have owned(and own) service type companies. I am middle aged, have seen what great success looks like, as well as great failure. I see a lot of posts on here about “how do I start _______ business”… This is my contribution, and I’m going to keep it simple, because it really is this simple. I don’t care what business you are looking to start.\n\n Find ONE specialty piece of equipment. ONE thing that will set you apart from the crowds. ONE thing that will help you solve a pain point quickly and effortlessly. If you can’t afford or find that piece of equipment that sets you apart, pick ONE specific thing you do. That’s your starting point. You are NOT a junk company, you are not a guy in a truck. You ARE a mattress removal company. Figure out the absolute cheapest and best value you can provide to a customer. \n\nI’ve always held to the advice to bill out as if you did have resources of the finished company you’re envisioning. Don’t. Do it as cheap as you can to get in front of as many people you can as possible. Do it as cheaply and efficiently as possible, and deliver and end result that exceeds the customer’s expectations. \n\nFocus on one very specific service, market and advertise extensively on this single service, and deliver beyond expectations on service and price. Figure out a way to do this so it’s not costing you money, but isn’t necessarily making you any either. \n\nYou are NOT a painter, everyone is a painter\nYou ARE a front door specialist, you paint front doors to a showroom finish for $200\n\nYou are NOT a junk removal company \nYou ARE a mattress removal specialist for $15\n\nYou are NOT a landscaper\nYou ARE a Edward scissorhands level hedge pruner\n\nFacebook page highlighting your very specific work, Facebook ads marketing this very specific service…. Do it cheap, good, and fast. Provide a service that exceeds expectations and people will leave organic comments, reviews. Now you are trusted, vetted, at least in the wild world of the internet. \n\nUse this as your spring board to increase your prices, (or figure out what they actually are) or to develop what services you actually do perform as a company. Don’t start your business looking to paint new construction, whole houses. You might not fail, but there is growth and performance struggles. Do something very specific and absolutely knock it out of the park everytime. \n\nThis has been a huge pivot and change of perspective on me in my older more mature years. I didn’t want to make a long winded unreadable post. I did want to contribute to this sub that has helped me so much over the years. If anyone is interested in hearing more of my perspective, I can make another post specifically about the service/equipment I offered.\n",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 200,
    "downs": 0,
    "created_utc": 1733598447.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.936233458770902
  },
  {
    "score": 201,
    "title": "If you had access to 50k or 100K what businesses would you start to replace your current salary.",
    "selftext": "Thinking of freeing up some equity and want to put it to work immediately. I have an extensive background in sales but I love working with my hands. I have experience driving large vehicles and hauling trailers. I'm really thinking about buying some equipment (skid steer, mini excavator, etc) or a 26' box truck. But I'm incredibly open to other ideas. So if it was you, what would you do, or what do you see a need for. For reference I am located near a major city in the South East. ",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 201,
    "downs": 0,
    "created_utc": 1734563292.0,
    "media": null,
    "is_video": false,
    "num_comments": 243,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.204046282615988
  },
  {
    "score": 200,
    "title": "Cleaning business at $350k rev, year 3 AMA (Im not selling a stupid PDF course)",
    "selftext": "my revenue: [https://ibb.co/Y7T0LqGg](https://ibb.co/Y7T0LqGg)\n\nI started a cleaning service in Toronto 3 years ago.  I know this isnt that impressive compared to other people doing 100k months on here, but its still something. I'd love to give back to the reddit community.  Everything I've learned is though here all these years.  AMA.  I will give you the real facts. Its not that easy to pull this off.  Im going to sleep here but ill answer if I get any question in the morning when I wake up.\n\n  \nedit: its 2:30 am here, i have to sleep. ill continue in the morning.",
    "subreddit": "sweatystartup",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 200,
    "downs": 0,
    "created_utc": 1740464626.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.057235279162199
  }
]