[
  {
    "score": 971,
    "title": "The Harvard technique to set goals you actually achieve",
    "selftext": "The Harvard Study Insight:\n\nA famous Harvard study revealed this surprising fact:\n\n83% of people don't set goals.\n\n14% have goals but don't write them down.\n\nOnly 3% write them down-and they achieve 10x more.\n\nSo, **write down your goals-it's a proven game-changer.**\n\nVague goal: I want to be fit. Harvard Goal: Lose 10 lbs in 3 months by running 3x a week.\n\nVague goal: I want to save money. Harvard Goal: Save $5,000 by reduing dining out to 2x/month\n\nVague goal: I will start a side hustle. Harvard Goal: Launch an Etsy shop with 10 items by December 31\n\nWhat they discovered:\n\nThe Harvard study also found this:\n\n**Setting time-bound goals increased success rates by 76%.**\n\nSharing goals with someone you truest added another 33%.\n\nSo, don't just set goals-set a deadline and tell someone about it.\n\n**Check off your progress:**\n\ncreate a checklist that get you closer to your goal. Try this:\n\nwake up 30 minutes earlier\n\ndrink 3 liters of water\n\nread 10 pages of a book\n\nmeditate for 5 minutes\n\ntrack your progress every day\n\nsay no to distractions\n\nfocus on one task at a time\n\n**Break it down:**\n\nTry this:\n\ntake your big goal and break it into 3-5 mini-goals.\n\nAssign each mini-goal a deadline.\n\nFor example:\n\nBig Goal: Start a business.\n\nMini goal 1: Research niche by Jan 15.\n\nMini goal 2: Create a prototype by Feb 20.\n\nMini goal 3: Launch by April 1.\n\nSmaller steps feel less overwhelming and build momentum.\n\n**Use the \"IF-Then\" Strategy:**\n\nPeople who use\"if-then\" planning are 300% more likely to stick to goals.\n\nDo this:\n\n\"If I feel to tired to work out, then I'll walk for 10 minutes instead.\"\n\n\"If I'm distracted by my phone, then I'll set a 30-minutes timer to focus.\"\n\nYes, planning for obstacles keeps you on track, no matter what.\n\n**The WOOP techniques:**\n\nwish: define what you want.\n\noutcome: visualize its impact on your life.\n\nobstacle: identify what might stop you.\n\nplan: prepare a step to overcome it.\n\nTry this for your next goal - it transforms obstacles into action plans.\n\n**The 90-Day rule:**\n\nResearch highlights: 90 days is the sweet spot for goal completion.\n\nWhy?\n\nIt's long enough to create momentum.\n\nShort enough the feel urgent.\n\nSet a 90-day deadline for your next goal. Track weekly progress to stay on course.",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "restricted",
    "ups": 971,
    "downs": 0,
    "created_utc": 1740731502.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.303230282765393
  },
  {
    "score": 636,
    "title": "I stopped “managing time” and started managing energy instead. Game changer",
    "selftext": "For years I tried every productivity method under the sun—time-blocking, Pomodoro, bullet journals, digital calendars with 5-minute intervals... you name it.\n\nAnd I’d always burn out.\n\nNot because I didn’t have time  \nBut because I had no energy left to *use* the time\n\nSo a few months ago, I flipped the script:\n\nInstead of asking, “How can I fit more into my day?”  \nI started asking, “When do I actually have energy to do certain things?”\n\nHere’s what changed:\n\n**1. I stopped fighting my natural rhythm**  \nTurns out, I’m not a morning person. Forcing deep work at 6am was killing me. Now I batch creative work for afternoons and do admin in the morning when I’m slower.\n\n**2. I use “energy anchors” instead of strict routines**  \nInstead of rigid schedules, I have 2-3 anchor points in my day that keep me grounded (like a workout around 2pm or a 30-min reset walk at 6pm). These keep me consistent without burning me out.\n\n**3. I allow myself to** ***not*** **do things**  \nSome days I wake up foggy and I’ve learned to just ride that wave. Instead of wasting 3 hours trying to force a task, I push it to a better window or cut it entirely. Productivity doesn’t mean perfection.\n\n**4. I build my to-do list around** ***focus windows***  \nI only plan 2–3 deep tasks a day, and I place them in the 90-min windows when I tend to have the most focus. The rest of the day is filled with low-energy, maintenance-type tasks.\n\n**The result?**  \nLess guilt  \nLess burnout  \nWay more done\n\nI’m curious if anyone else has made the switch from managing time to managing energy. How did it go for you?\n\nWould love to hear your systems or what’s worked best in terms of aligning tasks with your actual energy levels.\n\n**Edit:** this shift felt obvious in hindsight—[**It’s not burnout. It’s a leak in your energy field**](https://nofluffwisdom.com/p/it-s-not-burnout-it-s-a-leak-in-your-energy-field) from NoFluffWisdom nailed this mindset flip—energy first, schedule second",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.92,
    "subreddit_type": "restricted",
    "ups": 636,
    "downs": 0,
    "created_utc": 1743562633.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.15524907970231
  },
  {
    "score": 305,
    "title": "75 Productive Things to Do in Your Free Time",
    "selftext": "This post was originally published on [taking-time.com](http://taking-time.com) All links have been removed. Please check out the site or subscribe to my [newsletter](https://taking-time.kit.com/f6145996a0) if you found this post helpful!\n\nHave you ever had one of those days where you’ve watched everything there is to watch on Netflix and seen all there is to see on your socials, but you just keep scrolling anyway, hoping for something new? Maybe you’re stuck in a waiting room, staring at the clock, or have a lull in your workday and would love to get something done. Well, you have come to the right place! Turns out there are *plenty* of productive things to do to make the most of your time—whether you’re at home, at work, or out and about.\n\n# It Only Takes Five Minutes\n\nIf you’re struggling to pull yourself out of a rut but want to do something productive, start with just *five minutes.* Pick an activity, set a timer, and tell yourself that when the five minutes are up, you can go back to relaxing guilt-free. Chances are, once you get started, you’ll want to keep going. But even if you don’t, those little bursts of productivity add up over time.\n\n# The 80/20 Principle\n\nRemember, you don’t have to be productive *all the time.* The 80/20 Principle (or Pareto’s Principle) suggests that 80% of your results come from just 20% of your actions. That means it’s totally okay to take a break and recharge! But when you do feel like getting something done, this list of 75 productive things to do will help you use your time wisely.\n\n# Productive Things to Do at Home\n\nYour home is full of opportunities to get things done. Whether you’re in the mood to organize, clean, or cook, here are some productive activities to tackle at home:\n\n* Declutter your home. Some great places to start include your pantry, fridge, freezer, wardrobe, beauty products, junk drawer, toys, or books.\n* Deep clean your home by focusing on often-overlooked areas like the oven, fans, baseboards, and windows. \n* Rearrange furniture or décor to create a fresh layout that makes your space feel brand new without spending any money.\n* Upcycle or refinish a piece of furniture or décor to give old items a new life.\n* Start a garden or plant some seeds, even if it’s just herbs on a windowsill.\n* Create a meal plan to organize your meals for the week and save time and money.\n* Cook a new meal by trying out a recipe you’ve been meaning to make.\n* Bake something homemade and consider sharing it with friends or neighbors.\n* Create a list of birthdays to ensure you never forget another important date.\n* Make a “when did I last” list to track recurring but infrequent tasks like oil changes or deep cleaning.\n\n# Productive Things to Do at Work\n\nIf you have downtime at work, use it to get ahead on projects, organize your workspace, or develop your skills.\n\n* Organize your workspace by decluttering your desk and improving efficiency.\n* Update your resume and LinkedIn profile to stay prepared for new opportunities.\n* Set professional goals or intentions by thinking about where you want to be in a year.\n* Plan out your workweek by prioritizing tasks for maximum efficiency.\n* Take an online course to learn new skills and advance your career.\n* Clean out your inbox by deleting or unsubscribing from unnecessary emails.\n* Schedule meetings or follow-ups to stay proactive in networking.\n* Review past projects to identify ways to improve your workflow.\n* Create a new workflow or process to streamline your tasks.\n* Make a list of industry-related books to read to keep learning and growing.\n\n# Productive Things to Do on Your Phone\n\nInstead of endless scrolling, turn your phone time into *productive time.*\n\n* Delete unused apps to free up storage space.\n* Organize your photo gallery by deleting duplicates and backing up favorites.\n* Set up app limits or screen time restrictions to reduce distractions.\n* Create playlists by organizing music for workouts, relaxation, or motivation.\n* Listen to an educational podcast to learn something new on the go.\n* Update your contacts by deleting duplicates and organizing them.\n* Set up autopay and automatic savings transfers to make money management effortless.\n* Research investment opportunities to explore stocks, index funds, or retirement accounts.\n* Make a “to buy” list to reduce impulse spending.\n* Brainstorm side hustle ideas by considering ways to earn extra income.\n\n# Productive Things to Do Online\n\nThe internet is full of ways to be productive—here are a few!\n\n* Unsubscribe from spam emails to keep your inbox clutter-free.\n* Sell unused items online to declutter and make some extra cash.\n* Take a free online course on websites like Coursera, Khan Academy, and Udemy.\n* Research charities or causes to donate to to support something meaningful.\n* Take an online personality or career test to learn more about yourself.\n* Plan your next grocery order to save time by ordering online.\n* Find and download free printables for budgeting, meal planning, and productivity. (hint: Look back through previous Taking Time newsletters for some great ones! 😉 )\n* Set up banking alerts to stay on top of your finances.\n* Join an online community to connect with like-minded people.\n* Compare prices before making a purchase to ensure you get the best deal.\n\n# Productive Things to Do in the Morning\n\nStart your day with intention and productivity!\n\n* Create a to-do list to prioritize your day’s tasks.\n* Meditate or do deep breathing exercises to set a calm tone for the day.\n* Journal about your goals and intentions to write down your thoughts.\n* Read a book or listen to an audiobook to learn something new.\n* Exercise or stretch to get your body moving.\n* Make a healthy breakfast to fuel your day properly.\n* Review your schedule to plan your time wisely.\n* Do a quick home reset by making your bed and tidying up.\n* Listen to motivational content such as a podcast, TED Talk, or inspiring music.\n* Do something creative by writing, drawing, or brainstorming ideas.\n\n# Productive Things to Do at Night\n\nWind down while still getting things done.\n\n* Reflect on the day by considering what went well and what can be improved.\n* Unplug from screens to give your eyes and mind a break.\n* Do a relaxing self-care activity such as a mani/pedi, face mask, or bath.\n* Write in a gratitude journal to focus on the positives.\n* Prep for the next day by laying out clothes, packing lunches, and setting the coffee timer.\n\n# Conclusion\n\nWhether you’re at home, at work, or on the go, there’s always something productive you can do—even if it’s just for five minutes! Productivity doesn’t mean doing *everything* all the time, but rather making the most of the moments when you *do* want to get something done.\n\n",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "restricted",
    "ups": 305,
    "downs": 0,
    "created_utc": 1739975510.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9183270473373826
  },
  {
    "score": 293,
    "title": "I don’t need more hours I need fewer priorities",
    "selftext": "I used to obsess over time management.  \nTrying to squeeze every drop out of the day.  \nPerfect calendar. Color-coded blocks. Pomodoro everything.\n\nBut I was still overwhelmed.  \nStill tired.  \nStill feeling like nothing important was getting done.\n\nHere’s what finally clicked:\n\n→ My problem wasn’t time it was *focus*  \n→ I didn’t have too little time I had too many obligations  \n→ Most of what filled my schedule didn’t actually move the needle\n\nSo I did something radical:  \n→ Cut 80% of the to-do list  \n→ Chose 1–2 things that actually mattered  \n→ Let the rest be noise\n\nNow I do less but it *lands* harder  \nBecause I’m not scattered  \nI’m aligned\n\nIf you’re managing every hour but still feel behind, it might not be a scheduling issue.  \nIt might be a priority problem.\n\nWhat’s one thing you stopped doing that gave you more real time than any tool or hack ever did?",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "restricted",
    "ups": 293,
    "downs": 0,
    "created_utc": 1746308908.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.75043795343597
  },
  {
    "score": 203,
    "title": "Most people don’t manage time, they manage guilt",
    "selftext": "A lot of people think they have a time management problem  \nWhat they really have is a **decision fatigue + guilt loop**\n\n* You start the day late, feel behind\n* Then you overcompensate, overplan, and burn out\n* You get distracted, feel bad about it, and spiral into “I’ll be better tomorrow”\n* Rinse, repeat\n\nI was stuck in that cycle for years until I made one shift:\n\nI stopped managing my *schedule*  \nAnd started managing my *energy*\n\nNow I plan my day based on:\n\n* 1–2 energy-heavy tasks that get done early\n* Low-effort admin tasks for when my brain’s tired\n* A hard stop time so I don’t fall into the “just one more thing” trap\n\nIt’s not about doing more—it’s about doing what matters while you still have *clarity*\n\nI wrote more about this shift here if it helps anyone:  \n[**NoFluffWisdom**](https://NoFluffWisdom.com/Subscribe)\n\nWhat’s your go-to move when your time plan crashes—but the day isn’t over yet?",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "restricted",
    "ups": 203,
    "downs": 0,
    "created_utc": 1743440317.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.33816016308988
  },
  {
    "score": 146,
    "title": "For anyone who lives in Google Calendar — this tiny tool surprised me",
    "selftext": "Just wanted to share something I have be working on and found it really helpful!\n\nIt’s this small Chrome extension that lets you add stuff to Google Calendar by either typing, highlighting, or even screenshotting the info. Like… no switching, no opening your calendar in a new tab. It just quietly does its job in the background.\n\nPls don't expect much — the UI is kind of rough (someone please gift me a designer lol), but it actually works really well. Especially with time zone stuff, which usually breaks my brain.\n\nIf your brain also lives in Google Calendar 24/7 like mine does, this might be worth a try.\n\n[https://ada-calendar.com/](https://ada-calendar.com/)\n\nCurious if anyone else has found it?",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "restricted",
    "ups": 146,
    "downs": 0,
    "created_utc": 1744849311.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6789181967816735
  },
  {
    "score": 130,
    "title": "How Do People Manage Their Weekends?",
    "selftext": "I recently had a health scare and am now *highly* motivated to prioritize my health. Slowly and sustainably over the past \\~1.5 years: I have increased my sleep (I was really shortchanging myself), I now go to the gym after work, M-Th. When I get home, I cook simple, healthy meals that don't take more than \\~30 minutes to make. (spouse does their own thing per their own diet plan)\n\nThe results:  \nThe Positive: I feel great, and my health numbers are improving. I now feel like I won't suddenly drop dead of a heart attack or stroke (I'm middle aged).\n\nThe Negative: I don't have time for anything else now, during the week! Hence, I'm posting here in the TimeManagement sub. M-Th is work, walk the dog, gym, dinner, shower, bed. Rinse &amp; Repeat. Fridays is no gym, so my spouse and I usually go out or relax at home.  \nThat leaves Saturday &amp; Sunday to do some very heavy lifting: family time, socializing with friends, volunteering, groceries, laundry, other chores, life admin, &amp; (maybe, if there's time) hobbies. What this means is I'm perpetually behind on non-laundry chores &amp; life admin (family, friends, volunteer work, groceries, &amp; laundry are the top priority things that always get done), and I almost never have much time for my own interests (maybe one day a month which, let me tell you, means I make progress on personal projects at a glacier's pace). The most urgent chores &amp; life admin manage to get done, but there are a lot of areas that are neglected and that future-me will pay for.\n\nMy M-Th schedule is extremely tight: I keep trying to do \"just\" 15 minutes of chores or life admin each day, but between having to walk the dog, time spent speaking with my spouse about each other's days, clean up after dinner, etc (all the little things that fill in the time gaps), I am already going to bed 10 minutes later each night than my declared \"lights out\" time (this is me remaining \"strict\" on that!).\n\nTL;DR: prioritizing my health means I now struggle to find time for chores &amp; life admin (things that used to happen after work during the week), and hobbies are a rare occurrence.",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "restricted",
    "ups": 130,
    "downs": 0,
    "created_utc": 1746212049.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5498769165115673
  },
  {
    "score": 101,
    "title": "I stopped wasting my first hour of the day and it made everything else easier",
    "selftext": "for a long time, i felt like my mornings were slipping through my fingers. i’d wake up, grab my phone, and scroll through random apps without even thinking. sometimes it would be ten minutes, sometimes an hour. and every time, i’d start the day feeling behind and unfocused\n\nthen i came across something from dr huberman explaining how early sunlight helps regulate dopamine, cortisol, and your circadian rhythm. it sounded simple, but powerful. so i tried one change. no phone until i went outside and looked at the sky for a few minutes\n\nthat small habit completely shifted my mornings. i stopped wasting time on things that didn’t matter and started the day with more clarity and intention. it helped me make better use of the rest of my time too, because i wasn’t starting the day in reactive mode\n\ni ended up building a small app that helps keep this habit going by locking your favorite apps until you scan the morning sky. if you want to hear more, happy to share it",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "restricted",
    "ups": 101,
    "downs": 0,
    "created_utc": 1745381855.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1251757969537395
  },
  {
    "score": 94,
    "title": "Time management didn’t fix my productivity—ownership did",
    "selftext": "I tried every system—time-blocking, Pomodoro, GTD, habit stacks.  \nThey helped… until they didn’t.\n\nBecause the real problem wasn’t my schedule.  \nIt was my *avoidance*.\n\nI wasn’t managing time.  \nI was managing discomfort.  \nDodging the hard stuff by optimizing the easy stuff.\n\nColor-coded calendar? Check.  \nEndless to-do list rewrites? Check.  \nActual progress on what mattered? Barely.\n\nHere’s what finally shifted things:\n\n→ I started assigning *energy* to tasks, not just time  \n→ I made one non-negotiable per day—and crushed it early  \n→ I built in *space*, not just blocks  \n→ I tracked actions, not hours\n\nMost importantly:  \nI stopped treating time like the solution  \nAnd started treating *focus* like the currency\n\nCurious—what’s one change you’ve made to your time management that actually moved the needle long-term?",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.94,
    "subreddit_type": "restricted",
    "ups": 94,
    "downs": 0,
    "created_utc": 1746243838.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2707692348166884
  },
  {
    "score": 76,
    "title": "What if you didn't waste time scrolling?",
    "selftext": "No one ever decided they’ll spend their free evening scrolling socials for hours.\n\nYet everyone does it. So much of life is spent scrolling endlessly on a little device. It made me wonder:\n\nWhat if we didn’t have it?\n\nNo endless entertainment. No addictive tool always in your pocket. Just nothing.\n\nNow you suddenly have to choose what you’re going to spend your time doing. Or you stare at the wall.\n\nImagine that. Check your screen time, and imagine you had that time every day, being forced to just stare at the wall. Being forced to be bored.\n\nMaybe you could do it for a day. Or 2. Maybe even an entire week.\n\nBut after a while, you would get absolutely sick of it. And you’d take action. You’d start something, find a new thing to do. Something that interests you, some new life experience. Anything to escape those horrific hours of boredom every single day.\n\nYou’d go out in the world more often. You’d meet new people. You’d build stronger relationships. Your life would start to look different.\n\nMy question to you is: What would your thing be? Do you know what you would do if you couldn’t distract yourself?\n\nAnd if you don’t,\n\nAre you ever going to find out?",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "restricted",
    "ups": 76,
    "downs": 0,
    "created_utc": 1738346310.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.1610813481962943
  },
  {
    "score": 73,
    "title": "Most time management problems are really decision fatigue in disguise",
    "selftext": "People spend so much time trying to “optimize” their schedule.  \nNew calendars, new apps, time-blocking templates, color-coded systems.\n\nBut most of the time, the real problem isn’t lack of structure—it’s too many open decisions.\n\nYou wake up and already your brain is juggling:\n\n* should I work out first or check email?\n* what’s the priority today?\n* do I feel like starting with the hard task or the easy one?\n* should I push that meeting?\n\nEvery one of those tiny questions burns mental energy  \nAnd by 10am, you feel “busy” even if you’ve barely done anything that mattered\n\nI used to keep searching for better tools  \nBut the biggest shift came from setting **fewer choices**\n\nNow I decide once, not daily\n\n* same work start time every day\n* same lunch window\n* same shutdown routine\n* non-negotiable deep work block (even if it’s just 30 mins)\n\nIt sounds rigid, but it actually gives you more room to focus—because your brain isn’t negotiating all day\n\nThe truth is, most people don’t need better time management  \nThey need better boundary management  \nDecide once, and protect the decision  \nThat’s where consistency lives\n\nCurious—what’s one recurring decision you’ve removed from your day that made everything else smoother?\n\n  \n**Edit:** really appreciate the thoughtful replies—if anyone’s into deeper breakdowns like this, I write a short daily thing here: [NoFluffWisdom](https://NoFluffWisdom.com/Subscribe). no pressure, just extra signal if you want it",
    "subreddit": "TimeManagement",
    "upvote_ratio": 1.0,
    "subreddit_type": "restricted",
    "ups": 73,
    "downs": 0,
    "created_utc": 1742958093.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.070776713226948
  },
  {
    "score": 57,
    "title": "How I reclaimed my time (and sanity) with energy-based scheduling",
    "selftext": "Last year I hit a breaking point. My calendar was a mess of overlapping commitments, I constantly underestimated task duration, and despite working longer hours, I accomplished less each day. Sound familiar? After trying countless time management approaches, I discovered my fundamental problem: I was treating all hours as equal when they're absolutely not.\n\n# The breakthrough system:\n\n   * **Energy-time mapping**: I tracked my natural energy patterns for two weeks and discovered clear patterns—high focus (7-10am), communication energy (11am-1pm), analytical thinking (2-4pm), and administrative capacity (4-6pm)\n   * **Time blocking by energy type**: Instead of scheduling by project, I now block my calendar according to energy requirements. Creative work happens exclusively in my morning blocks, meetings mid-day, and email/admin during lower-energy periods\n   * **Realistic duration buffers**: I now add 25% time buffer to all estimates and include transition time between different types of work\n   * **\"No meeting\" time blocks**: I've established sacred 90-minute deep work blocks that no meetings can interrupt, non-negotiable\n   * **Weekly time audit**: Each Sunday, I review where my time actually went versus where I planned it to go, helping me catch time leaks and improve future estimates\n\nThe most dramatic change came when I stopped fighting my natural rhythms. I used to force myself to tackle complex problems at 4pm when my brain was fried, wasting hours on what would take minutes in the morning. Now I protect my peak hours religiously for high-value work. I've documented my complete time management framework here: [Banishing Burnout: A Time Management Guide](https://baizaar.tools/banishing-burnout-a-todoist-guide/)   \n  \n**What energy patterns have you noticed affecting your productivity?** ",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.99,
    "subreddit_type": "restricted",
    "ups": 57,
    "downs": 0,
    "created_utc": 1742581823.0,
    "media": null,
    "is_video": false,
    "num_comments": 10,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.02662433614205
  },
  {
    "score": 54,
    "title": "Any tips for better time management?",
    "selftext": "Hello! Lately, I've felt like there just need to be more hours to get everything done. I'm juggling a full-time job, personal responsibilities, and trying to pursue personal goals, and it feels like there needs to be more time to do it all.\n\nI know I'm not alone in struggling with time management, but I'm ready to change and improve at prioritizing my tasks, setting goals, and maximizing my productivity. I started to use a time management app, but my daily habits are still off. That's why I'm reaching out for guidance.\n\nDo you have any tips or strategies that have worked for you in improving your time management skills? Maybe you've found a book, podcast, or course that has helped you manage your time more effectively. Or perhaps you've worked with a time management coach or expert who has provided personalized guidance on better managing your schedule.\n\nI'm open to any suggestions, so please feel free to comment below. I'm excited to hear your insights and implement new strategies for improving my time management skills. Thank you in advance for your guidance!",
    "subreddit": "TimeManagement",
    "upvote_ratio": 1.0,
    "subreddit_type": "restricted",
    "ups": 54,
    "downs": 0,
    "created_utc": 1681459888.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3794383146860656
  },
  {
    "score": 45,
    "title": "A time management technique that actually works (for me at least!)",
    "selftext": "So, we've all tried those daily schedules where you assign tasks to specific time slots, right? But let's be real, how often does that actually work out? One task runs long, and suddenly your whole day is thrown off...stressful!\n\nHere's what I've been doing instead, and it's been a game-changer:\n\n1. Forget about planning just one day at a time. Think bigger - like 3 months bigger.\n2. Instead of hours, think in \"sessions\". Each session has a start time and duration.\n3. Assign a number of sessions to each activity over the 3 months.\n\nFor example: 36 gym sessions, 1 hour each, 9-10 AM on M-W-F for 3 months.\n\nThe beauty of this system? \n- You're working towards actual goals, not just daily to-dos.\n- Missing a session here and there isn't the end of the world. (34 out of 36 ain't bad!)\n- You can learn from each session and improve the next one.\n\nI've found this takes a lot of the pressure off and helps me stay focused on the big picture. Plus, it's way more flexible for real life!\n\nWhat do you guys think? Anyone tried something similar? ",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.98,
    "subreddit_type": "restricted",
    "ups": 45,
    "downs": 0,
    "created_utc": 1733384331.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8748790864012363
  },
  {
    "score": 42,
    "title": "the truth about managing our screen time",
    "selftext": "I've spent the last year deep down the digital minimalism rabbit hole, trying dozens of products, and writing extensively about how this will impact our future.\n\nAs I plan my 2025 digital minimalism goals, these two ideas are top of mind...\n\n**1) All screen time is not created equal**\n\nTotal screen time isn’t the best measure of digital wellbeing. Our phones are still the greatest tools we have at our disposal and they should be used as such. Setting goals around the total screen time number makes us feel like we ‘failed’ when we use our devices for their intended purposes (maps, communicating with loved ones, taking photos, listening to music etc).\n\nMeasuring at the app level is far more meaningful and a key indication of progress. Identify the apps that cause the most trouble—whether it’s Instagram, TikTok, or your email—and focus on reducing time spent there. By targeting these specific habits, the larger screen time number will naturally start to come down.\n\nJust as Netflix views sleep as their largest competitor, our technology usage competes with other valuable activities for our remaining time. With an average of 8 hours spent sleeping and 9 or more hours dedicated to work, our favorite hobbies and personal goals often compete directly with smartphone usage.\n\n**2) Reducing screen time is worthless unless you invest that time into something fulfilling**\n\nThe real value of freeing up your time is redirecting it into things that bring you joy. If doomscrolling TikTok or debating politics on Reddit truly makes you happy, then fine, keep at it. But for most of us, our time is better spent on relationships, personal growth, or meaningful pursuits.\n\nTo effectively measure the impact of reducing smartphone addiction, identify an offline goal, relationship, or activity in which you want to reinvest your time. Track how much time you spend on this activity while keeping the rest of your time allocation constant. If your screen time goes down and your time spent working towards your goal goes up, you are making positive progress.\n\nFor example, I decided I wanted to spend more time reading instead of being on my phone. As my screen time decreased, my daily reading time (and the amount of books I read per month) increased. The extra time was clearly coming from reduced phone usage.\n\nIt’s important to note that engaging in offline activities doesn’t always mean you need to be doing something specific or productive. In fact, one of the most valuable offline pursuits is simply spending time alone doing nothing.\n\nSolitude allows us to reflect, recharge, and reconnect with ourselves on a deeper level. It provides a space for introspection, creativity, and self-discovery. So, as you work on the reducing your smartphone addiction, remember that carving out time for solitude is just as important as engaging in other offline activities. Embrace the quiet moments and allow yourself to simply be present without the need for constant stimulation or interaction.\n\nWhile this may seem challenging at first, start small and be patient with yourself. Identify specific offline goals, track your progress, and celebrate the positive changes you see. Over time, these small shifts can lead to significant improvements in your overall well-being and happiness. By focusing on what truly matters, you can create a more balanced and enriching relationship with technology, one that enhances rather than detracts from your life.\n\np.s. -- this is an excerpt from my [weekly column ](http://readreboot.com/)about how to build healthier, more intentional tech habits. Would love to hear your feedback on other posts.",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "restricted",
    "ups": 42,
    "downs": 0,
    "created_utc": 1734697669.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7104534577475956
  },
  {
    "score": 42,
    "title": "Recognizing Time Wasters in Your College is very important",
    "selftext": "Because Not Everything That Fills Your Time Is Worth It\n\nLet’s be honest:\nCollege life is packed — not always with productive stuff, but with a lot of noise.\n\nYou attend classes, work on assignments, hang out with friends, maybe even start something on the side.\n\nBut at the end of the day, you still feel like you did nothing.\n\nWhy?\nBecause you’re busy being busy…\nnot busy being effective.\nAnd that’s where time wasters creep in silently.\n\nTime wasters aren’t just about procrastination or laziness.\nThey’re things that feel productive…\n...but don’t really move you forward.\nThey’re the habits, distractions, and default routines that eat your hours — and leave you tired, unfulfilled, and stuck.",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.96,
    "subreddit_type": "restricted",
    "ups": 42,
    "downs": 0,
    "created_utc": 1748256384.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.9928452560560004
  },
  {
    "score": 40,
    "title": "\"You just need to manage your time better\" — actually, no.",
    "selftext": "One of the most frustrating pieces of advice I’ve ever received was:\n“You just need to manage your time better.”\n\nAs if poor time management was the reason I felt constantly behind - while balancing a full-time job, side hustle, and actual human needs like sleep and food.\n\nHere’s what I’ve learned instead:\nYou can be great at managing your time and still get nowhere if you’re managing the wrong tasks.\n\nThe truth is: not all to-dos are created equal.\nOnce I learned to focus on the 20% of actions that brought 80% of my results (thank you, 80/20 principle), everything changed.\n\nSo yeah - time management matters.\nBut task management? Prioritization? Learning what to let go of? That’s the real unlock.\n\nAnyone else feel like “good time management” isn’t enough sometimes?",
    "subreddit": "TimeManagement",
    "upvote_ratio": 1.0,
    "subreddit_type": "restricted",
    "ups": 40,
    "downs": 0,
    "created_utc": 1748114753.0,
    "media": null,
    "is_video": false,
    "num_comments": 24,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.061753861055754
  },
  {
    "score": 32,
    "title": "I made a death calendar to remind us that our time is limited (free)",
    "selftext": "I’ve always been amazed by how short life is.  \nBut the thing is, it’s so easy to get caught up in the day-to-day, work, deadlines, chores, and forget that time is slipping by.\n\nSo I made this little [thing](https://www.lifeisshort.fyi/) (free). It shows\n\n* How much time do I have left → Motivate me to spend my time on important things, since my time here is limited\n* When others started something big in their lives → Remind me that I’m not late. Some people start early. Others start late. We’re all on different timelines, and that’s okay.\n\nThis idea had been stuck in my head for ages, and I finally managed to build it (I'm not technical, so it’s still pretty early stage)\n\nHope it helps someone out there too :)\n\nP.S. I set this as my default Chrome tab to remind me daily",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.97,
    "subreddit_type": "restricted",
    "ups": 32,
    "downs": 0,
    "created_utc": 1745163618.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.7231351945975497
  },
  {
    "score": 31,
    "title": "How do you (normal people) go about “chores”?",
    "selftext": "I was wondering how normal people typically go about doing things. By things, I mean like washing their clothes, cleaning their room, cutting their nails, etc. Like, do you realize on a day like “oh I need to do A B and C” and then immediately when you get the time to, get up and do all 3? Or do you still chill at home and think “oh I need to do A” and then later on at some point you just end up doing it? And then you go back to chilling and then eventually you end up also doing B?",
    "subreddit": "TimeManagement",
    "upvote_ratio": 1.0,
    "subreddit_type": "restricted",
    "ups": 31,
    "downs": 0,
    "created_utc": 1735517404.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.882786230871559
  },
  {
    "score": 30,
    "title": "We gotta stop joking about brain rot because it's real",
    "selftext": "I know we all joke around about the term brain rot but we should probably start taking it more seriously.\n\n***Our mindless scrolling, dopamine savoring, quick-hit content consumption is actually deteriorating our brain.***\n\nIt’s *giving us* [digital dementia.](https://pmc.ncbi.nlm.nih.gov/articles/PMC5855412/?utm_source=readreboot.com&amp;utm_medium=referral&amp;utm_campaign=the-truth-about-brain-rot) \n\nThe concept of \"digital dementia\" proposes that our heavy reliance on the internet and digital devices might harm cognitive health, leading to shorter attention spans, memory decline, and potentially even quickening the onset of dementia.\n\nA [major 2023 study](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10621115/?utm_source=readreboot.com&amp;utm_medium=referral&amp;utm_campaign=the-truth-about-brain-rot) examined the link between screen-based activities and dementia risk in a group of over 462,000 participants, looking specifically at both computer use and TV watching.\n\nThe findings revealed that spending more than four hours a day on screens was associated with a higher risk of vascular dementia, Alzheimer’s, and other forms of dementia. Additionally, the study linked higher daily screen time to physical changes in specific brain regions.\n\nAnd listen, I normally hate when people reference studies to prove a point because you can find a study to back up whatever opinion you have, but this is pretty damning.\n\nAnd unfortunately, it makes complete sense. Smartphones primarily engage the brain's left hemisphere, leaving the right hemisphere—responsible for deep focus and concentration—unstimulated, which can weaken it over time.\n\nThis also extends to how we handle memory. We’ve become pros at remembering *where* to find answers rather than storing those details ourselves.\n\nThink about it: how often do we Google things we used to memorize?\n\nIt’s convenient, but it may also mean we’re losing a bit of our own mental storage, trading depth for speed.\n\nThe internet’s layout, full of links and bite-sized content, pushes us to skim, not study, to hop from one thing to the next without really sinking into any of it. That’s handy for quick answers but not great for truly absorbing or understanding complex ideas.\n\nSocial media, especially the[ enshittification](https://www.ft.com/content/6fb1602d-a08b-4a8c-bac0-047b7d64aba5?utm_source=readreboot.com&amp;utm_medium=referral&amp;utm_campaign=the-truth-about-brain-rot) of everything, is the ultimate fast food for the mind—quick, convenient, and loaded with dopamine hits, but it’s not exactly nourishing.\n\nEven an hour per day of this might seem harmless, but when we look at the bigger picture, it’s a different story.\n\nJust like with our physical diet, consuming junk on a regular basis can impact how we think and feel. When we’re constantly fed a stream of quick, flashy content, we start craving it. Our brains get hooked on that rush of instant gratification, and we find it harder to enjoy anything slower or deeper.\n\nIt’s like training our minds to expect constant stimulation, which over time can erode our ability to focus, be patient, or enjoy complexity.\n\nThis type of content rarely requires any deep thought—it’s created to grab attention, not to inspire reflection. We become passive consumers, scrolling through a feed of people doing or saying *anything* they need to in order to capture our attention.\n\nBut what’s actually happening is that we’re reprogramming our brains to seek out more of this content. We get used to a diet of bite-sized entertainment, which leaves little room for slower, more meaningful experiences that require us to actually engage, to think, or even to just be.\n\nI can go in 100 different directions on this topic (and I probably will in a later post), but for the sake of brevity, I’ll leave you with this:\n\n**Please, please, please be mindful of your content diet. Switch out short clips for longer documentaries and videos. Pick up a book once in a while. Build something with your hands. Go travel. Do something creative that stimulates your brain.**\n\nYou’re doing more damage than you think.\n\n\\--\n\np.s. - this is an excerpt from my [weekly column](https://readreboot.com/subscribe) about building healthier relationships with tech. Would love any feedback on the other posts.",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.95,
    "subreddit_type": "restricted",
    "ups": 30,
    "downs": 0,
    "created_utc": 1732478170.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.442422321194104
  },
  {
    "score": 31,
    "title": "What do yall do when you impulsively wanna do so many things at one time?",
    "selftext": "What the question says, right now I wanna watch like 10 different videos that peaked my interest on my YouTube feed, indie games, thought provoking commentaries, and watch bleach on top of that, as well as squeeze in the time to play my game. How do you guys deal with this feeling? Impulsive feeling, rather. It feels like such a rush of excitement I have to indulge in but I know it would most likely lead to overstimulation, and then mental burn out. ",
    "subreddit": "TimeManagement",
    "upvote_ratio": 1.0,
    "subreddit_type": "restricted",
    "ups": 31,
    "downs": 0,
    "created_utc": 1748203577.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.0506822818331556
  },
  {
    "score": 29,
    "title": "Radical Time Management Advice: Delete 80% of Your Tasks and Commit to Only 3 Priorities Per Day",
    "selftext": "\nMost people drown in to-do lists, productivity hacks, and endless \"urgent but not important\" tasks. The radical way to manage time is to stop managing it and start eliminating distractions mercilessly.\n\n# 1. Cut 80% of What You Do – It's Useless\n\nApply Pareto’s Principle on steroids:\n\n* 80% of your results come from 20% of your efforts.\n* Identify that 20% and delete the rest.\n* Most emails? Ignore them.\n* Most meetings? Skip them.\n* Most social media scrolling, “research,” or low-impact work? Eliminate it.\n\n# 2. Commit to Only 3 Important Tasks a Day\n\n* Write down 3 non-negotiable priorities that move your goals forward.\n* If you do nothing else but these 3, you win the day.\n* Everything else is either a bonus or a distraction.\n\n# 3. Work in ‘Sprints’ and Take Aggressive Breaks\n\n* Use ultra-focused deep work sessions (60-90 min) with zero distractions.\n* Then take unapologetic breaks—rest is part of productivity.\n\n# 4. Say ‘No’ 10x More Often Than You Say ‘Yes’\n\n* If it doesn’t radically contribute to your life or goals, reject it.\n* Be ruthless with your time. Every yes is a no to something better.\n\n# 5. Measure Success by Results, Not Time Spent\n\n* It’s not about how long you work but what you accomplish.\n* Some people work 12 hours and achieve nothing. You can get more done in 3-4 ultra-focused hours than most do in a week.\n\nThis is radical because it goes against the traditional \"do more, work harder, stay busy\" mindset. Instead, do less but with extreme focus—and watch your results explode.\n\n# ",
    "subreddit": "TimeManagement",
    "upvote_ratio": 0.94,
    "subreddit_type": "restricted",
    "ups": 29,
    "downs": 0,
    "created_utc": 1738432479.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5316062568876716
  }
]