[
  {
    "score": 449,
    "title": "We’re in a UI war over book displays — help us break the tie",
    "selftext": "Currently arguing with our CEO and designer over how to display your book records 😂\n\nSo I thought — why not let people vote?\n\n\n\nWhich layout looks better to you?\n\n📚 Left = “stack style” (books piled up)\n\n📚 Right = “shelf style” (books standing up)\n\n\n\nThis is for the UI where you can view your monthly, yearly, and all-time book logs.\n\nWould love to hear your thoughts!\n\n\n\n(+ The feature's coming soon, so if you're interested, feel free to download the app from the link in my profile... please... 🙏😅  name: repov)",
    "subreddit": "UI_Design",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 449,
    "downs": 0,
    "created_utc": 1747629141.0,
    "media": null,
    "is_video": false,
    "num_comments": 336,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Two distinct layout options presented as items for voting.",
    "composite_score": 4.622027464211013
  },
  {
    "score": 302,
    "title": "Thank you all for your feedback. I’ve made the adjustments.",
    "selftext": "Hello everyone, it’s the Repov team who posted before—thank you so much for all your feedback! Based on your suggestions, we’ve made the following updates:\n\n* We’re giving users the option to choose their preferred view style, with “stacked” as the default.\n* We’ve removed gradients for better readability and will pull colors from ratings or cover images instead.\n* Book widths now adjust according to their ratings.\n* We’ve made the title more prominent at the top so you can instantly see how many books you’ve read. (Just to clarify, this screen isn’t the main feed—it’s the page where you can track your monthly or yearly reading count and feel that sweet sense of accomplishment.)\n\nAlso, as a Korean team, we realized vertical text felt natural to us—thanks for pointing out how it reads to everyone else! 🙏\n\nWe’ve also uploaded the movie and music UI—please take a look and let us know your honest thoughts.\n\nRepov is an app that makes it easy to record all your cultural experiences—books, movies, music, and more. We’d love your feedback after you give it a try!\n\nTo show our appreciation, drop your Repov nickname below and we’ll hook you up with a 90-day free plan. (If this causes any issues, we can remove it.)",
    "subreddit": "UI_Design",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 302,
    "downs": 0,
    "created_utc": 1747814486.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.74,
    "category_rationale": "Enumerated feature changes/updates in bullet-like items.",
    "composite_score": 4.0599915574701635
  },
  {
    "score": 278,
    "title": "Tried turning birdwatching into a collectible card UI",
    "selftext": "I’ve been working on a weekend side project that gamifies birdwatching. Every bird you spot becomes a collectible card that can level up as you log more sightings.\n\nMy main goal was to make a mix between a nature logbook and Pokémon cards. Each card has its own rarity, habitat, and little subtitle.\n\nAs you log sightings, the cards level up (eventually I will add cosmetic unlocks related to card level ups etc)\n\nBuilt the layout in SwiftUI and focused on keeping it bright/gamified but I’m not sure if there are too many clashes.\n\nWould love your feedback on the UI/visual feel as I am pretty new to this!",
    "subreddit": "UI_Design",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 278,
    "downs": 0,
    "created_utc": 1761693823.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Explains a concept/design idea (gamified card UI) and invites feedback.",
    "composite_score": 3.992210460161269
  },
  {
    "score": 262,
    "title": "I'm in love with this interaction I made, but...",
    "selftext": "I’ve been working on this tonight, and I am *so* in love with this transition animation. I could watch it forever. I am, however, very biased, and as the great John Siracusa said: nothing is so perfect that it can't be improved. With that in mind, what could I do to make this better?\n\nThis is part of a web app, and was made with html, css and a sprinkle of javascript; the intended audience is software developers.",
    "subreddit": "UI_Design",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 262,
    "downs": 0,
    "created_utc": 1752543927.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 800,
        "fallback_url": "https://v.redd.it/ji7jqq2hzxcf1/DASH_360.mp4?source=fallback",
        "has_audio": false,
        "height": 466,
        "width": 360,
        "scrubber_media_url": "https://v.redd.it/ji7jqq2hzxcf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/ji7jqq2hzxcf1/DASHPlaylist.mpd?a=1770354014%2CZDZiYjRkODg4ZDU2NDc4ZmE1ZGVlN2QwYjQ1ZWFjMWFhYTFkOGRlY2IyYWYwMDU1ZGQ5MTM5ZGE0MmZmZGM5Mw%3D%3D&amp;v=1&amp;f=sd",
        "duration": 16,
        "hls_url": "https://v.redd.it/ji7jqq2hzxcf1/HLSPlaylist.m3u8?a=1770354014%2CMmNkMGUyNTNjNmRmZjcyY2FiYmIyNWU5ZjNjNjQ5MWM1M2YwMGU5NzA2OWZmNjhkZmViMzQ1MTJhNWVlZTU0OQ%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Describes an interaction and asks for suggestions to improve; centers on design reasoning.",
    "composite_score": 3.9791899762795513
  },
  {
    "score": 229,
    "title": "I'm changing my app's home page from left to right, did I do it right?",
    "selftext": "Hey Reddit,  \nOur team recently updated the app’s UI, and I wanted to share the changes. The original version is on the left, and the updated one is on the right.\n\nThe previous design received feedback for being too text-heavy and having an unclear primary action. In response, we made a few changes:\n\n* Split the layout into two sections — core features and add-on features\n* Removed most of the text and enlarged the icons for a more visual-focused approach\n* Redesigned some icons to unify the style and better differentiate core features from the rest\n\nOpen to any thoughts or feedback!",
    "subreddit": "UI_Design",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 229,
    "downs": 0,
    "created_utc": 1752025201.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.77,
    "category_rationale": "Enumerated design changes and feedback requests.",
    "composite_score": 4.0399731986038345
  },
  {
    "score": 214,
    "title": "Would you give a rating for my UI design?",
    "selftext": "I’m currently working on an AI language translator app that focuses on modern design trends. The main goal is to make translation simple, fast, and visually appealing for users. I designed the app with a clean and minimal look, using smooth animations and a clear layout to make it easy to use. The color palette and typography are chosen to match the modern style and give a fresh, professional feel. Users can translate text or speech quickly with just a few taps, and the interface is designed to feel natural and user friendly. I tried to balance both the functional and visual sides of the design so it looks good while working smoothly. I’d really appreciate it if anyone could check out my design and give a rating or share feedback it’ll help me improve and make the app even better.",
    "subreddit": "UI_Design",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 214,
    "downs": 0,
    "created_utc": 1760609368.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Describes design and asks for rating/feedback; aims to improve understanding of the UX.",
    "composite_score": 3.8790631051145557
  }
]