[
  {
    "score": 5277,
    "title": "Debt free as of today (almost)",
    "selftext": "Just had to tell Reddit that as of today, I have £0 in credit card debt or any high interest debt. \n\nWhat a relief it is. \n\nThe only debt I now carry is a mortgage, a car and a motorcycle. \n\nTime to build the emergency fund 💰\n\nEDIT: OK so this blew up. \n\nCouple of things, thank you to everyone who’s said congratulations and provided advice or encouragement to me or others in the thread who have struggled with debt. \n\nTo those who have commented “So NoT DeBt FrEe tHeN” shut up and be happy for people.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 5277,
    "downs": 0,
    "created_utc": 1677495136.0,
    "media": null,
    "is_video": false,
    "num_comments": 489,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal debt-free milestone with little actionable guidance or a clear model.",
    "composite_score": 5.795067425898288
  },
  {
    "score": 4311,
    "title": "Finally paid off my debt and I'm so proud of myself",
    "selftext": "I'm not sure if this is the place, however after years of being bogged down and reading forums to try and sort myself out I've done it, I just have no one to share it with 😂\n\nAround 10 years ago, I had red letters coming through the door and I buried my head in the sand. I've never been good with money, example 5 years ago, going out and buying a used car from a dealership because oohh shiny.\n\nI remember just last year crying for hours to my step mum about how I was planning to split with my partner, sell my car to try and fund the debt, yet here I am, finally I own my car, I have nothing to pay on catalogue accounts, nothing on my credit card, I own everything.\n\nDon't get me wrong, it's been bloody hard. I've worked overtime as much as I could, never been on holiday anyway, but gave it my all to pay everything off, I made my final payment and I'm not ashamed to say I cried my heart out. Still can't quite belive after being in debt one way or another for over 10 years I'm done.\n\nDon't get me wrong, this is all to try and get a mortgage, but I'm free to work on that now.\n\nTo everyone who has left a comment saying how they done it, words of support or anything alone them lines, I thank you, as I have read so many messages saying how people done it and I took that on.\n\nTo anyone paying things off, although it is hard you got this, you can do it ❤",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 4311,
    "downs": 0,
    "created_utc": 1687780415.0,
    "media": null,
    "is_video": false,
    "num_comments": 441,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal debt payoff celebration without a clear structure or steps.",
    "composite_score": 5.6923898868532286
  },
  {
    "score": 3642,
    "title": "Born into poverty has been amazing for my finances",
    "selftext": "I was born in to real poverty in the very early 80s in Brighton. \n\n\nloads of times were we would be without electric, gas and food. I had a VERY poor childhood. My mother was a single mum with 3 kids and my mum was EXTREMELY poor with money.\nBeing brought up like this was the best thing for my adult finances. My mum showed me EXACTLY what NOT to do and I learnt lessons she refused to learn.\n\nI set myself some unbreakable rules when I entered the work force which I’ve NEVER broken. Not even once. Yes I have bought stuff I really could I really shouldn’t have but it has always been well within my buffer zone.\n\n\nI studied the financial system and found it really easy to understand but never really set out to make much money from the finance system but saw how you can easily get it to work for you if you follow your own rules and not theirs.\n\nThese are the rules I set myself and they have done me quite well over the years. I’ve never really struggled with my finances and thought maybe sharing my story may help some people? Maybe? Maybe not?\nWell these are my rules that have helped me over the years in no real order. \n\n•\tRespect every pound you make. When spending it, it needs to show it’s value when it is being used. It is always easier to save money than make money.\n\n•\tAlways live like you’re poor at your core. This doesn’t mean you cannot have nice things. Just means that when you buy nice things make sure you can easily afford it and never over stretch yourself.\n\n•\tUnderstand your next wage is NEVER guaranteed so NEVER and I mean NEVER depend on one income source. Since my mid 20s I’ve always had at least two sources of income.\n\n•\tLive off a credit card. Spend their money not yours. I saw very early on the level of protection you get by spending on a credit card. So again, from my mid 20s I’ve lived off cashback/reward credit cards which I’ve always paid in full at the end of the month. If I’m buying something on the credit card, I have the money in the bank.\n\n•\tKeep your out goings to a minimum. Never have that mind set “well it’s just another £200 a month I can afford that” it never ends well. \n\n•\tUse 0% finance on anything big if it is being offered with no fees even if it is just an intro offer. Just pay it off towards the end of the intro offer. Remember you’re spending someone else’s money so why risk your own? Very handy when buying a car. \n\n•\tUnderstand the value of the pound you make today will always go down tomorrow but the prices of services and products will go up. (yeah somethings do go down sometimes but normally stuff will always go up on a longer enough timeline.\n\n•\tUnderstand that truly rich people don’t look rich. Spending money on trying to look rich is one of the most counterproductive things you can do on this list and the thing I struggled/struggle with the most. When I started making some money in my mid/late 20s I REALLY wanted everyone to know I had money after spending so much of my life poor. Lucky for me that I grounded myself and never fell into a trap of buying flashy things for the sake of them being flashy for too long to damage me in any real way. \n\n•\tBulk buying things when they are on offer and shopping around. No matter how much money I have I’m ALWAYS looking for ways for my pound to work for me. My tooth paste that has a 3 years shelf life has gone down to £1.50 from £3.50? I’m buying at least 2 years wroth... Yeah I have a lot of supplies of things stored in my house lol We rarely run out of things.\n\n•\tAlways know your income and outgoings to the penny. It never fails to shock me the amount of people in my life that still doesn’t know this information!!\n\n\nSo yeah this post has become much longer than I planned it and it is the very first time I’ve ever written them down. Following these rules have really helped me in my life. Keeping an eye on the housing/banking markets has saved me so much money to spotting trends.\n\nAs soon as I saw interest start to rise I locked in our mortgage rate for 10 years at 3.49%. I wanted to lock in it a bit sooner at 2.75% (we were on 2.25%) but our FA kept telling me to hold off because it was going to drop back down again and we would waste the early repayment charge (which was about 5k) Even at 3.49% our FA and the bank really didn’t want us to remortgage but I did it anyway against their advice!\n\nSo that is my story. I’m in a great place now with my finances. The family and I live a very comfortable life style. I’m a sole trader and wife works part time so we can spend lots of time with the kids.\nWe own our own 4 bed end terraced house in a nice area with a very manageable mortgage (less than 25% of our monthly income)\n\nWe can go on nice holidays (not too flashy but nice). We drive what I call hidden flashy cars. My wife drives a newish Ford c max titanium x (which we got for an amazing price) and I drive a 12 year old Ford focus Sport which I’ve owned for 10 years.\n\nThe Cmax is an amazing car with all the fun toys and is lovely to drive but doesn't come with the cost of the “flashy car brand” tax. My car is still going strong because I look after it.\n\nI’m 40 and if anything happens to me I know that my family would be well taken care of.\n\nit has not been all smooth sailing, far from it but I do think following my rules on my money has really helped me in ways I can’t really put into words. I’ve tried to give advice to people because but they never followed it.\nI told my sister to lock in her rate on her mortgage when I did but she didn’t and is now looking at £500 extra a month :(\n\nSorry for the long post. Sorry for my poor grammar (im highly dyslexic) but if anyone wants to add to my post I’d love to hear your thoughts\n\neditted: lots of poor English, reddit app has no spell check. very bad for someone who is dyslexic lol\n\nEdit 2. Wow I never expected this post to go so crazy! When writing this it got nearly a million views! \n\n  \n\n95% of the comments have been great and I will reply to the DMs I promise. \n\n  \n\nGot a few personal attacks which is fine, it is the risk you take when you post anything onto the internet and some of you have made some great points that have worked for you.  \n\nNot once did I tell people to follow the rules, I set myself but said MAYBE they will help MAYBE they won’t but they did for me. \n\nThere is nothing special about me. I was kicked out of school at 14 with no exams and told by the system that I would make nothing of my life. Well I have. I’m extremely proud of myself and the amount of hard work I put into making sure that my family would not have to struggle. \n\nI see a few “you’re just lucky” posts. Yes you are correct, everything is down to luck. The next time you take a breathe is pure luck. \n\nThere are so many people struggling and MAYBE just MAYBE reading this post may help someone and going by the DMs and comments it will help. \n\nI stand by every word I have said in this sub, I don’t feed the trolls as I just find them funny! \n\nI really do wish the best for everyone reading this, I know times are hard but with work we can get on the other side of them. \n\nJust wanted to thank the mods, you have been amazing at keeping the post clean. You have done a great job at filtering the personal attacks. \n\nThis post was never really about me, it was about my story and I was hoping that passing on the knowledge I’ve gained could help others.  \n\nAt the end of the day, for me it is about personal responsibility and the willingness to make the hard choices to hit the goals I set myself.  \n\nWe are all different and that is a good thing. I wish you all the very best!",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 3642,
    "downs": 0,
    "created_utc": 1673777698.0,
    "media": null,
    "is_video": false,
    "num_comments": 425,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.78,
    "category_rationale": "Bullet list of financial rules/ridges that readers can follow.",
    "composite_score": 5.573663970793275
  },
  {
    "score": 3258,
    "title": "I just saved my first £1,000 and I feel amazing",
    "selftext": "I've never been great with money - typically within a few days of payday I would be broke. My mindset on money was totally wrong with \"oh I have £50 left, I can spend it on ___ because I'll just get paid again\"\n\nAbout 6 months ago I got fed up of feeling like I was never prepared for unexpected circumstances, especially as I now have a kid - I felt like this mindset just needed to change.\n\nI don't have a huge amount left after bills so I've only been able to save about £150 a month, but today - for the first time in my life - I have accumulated £1,000 in savings!\n\nIf something goes wrong with the car, it's ok!\n\nIf something goes wrong with the housing situation and we need to move and need another deposit (we rent privately), it's ok!\n\nIf almost anything goes wrong, it's ok!!!\n\nI know to some of you £1,000 is nothing, and I know it's not a huge amount and won't cover every eventuality, but to me it's one of my biggest accomplishments.\n\nI hope to keep it up and eventually put even more in each month - maybe one day I'll be able to buy my own house. ",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 3258,
    "downs": 0,
    "created_utc": 1710266419.0,
    "media": null,
    "is_video": false,
    "num_comments": 191,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal savings milestone with minimal instructional content.",
    "composite_score": 5.382234974816919
  },
  {
    "score": 3135,
    "title": "Bank and phone lessons learned after a robbery",
    "selftext": "I was robbed a few days ago and had my phone and bank cards taken. They also forced me to give them the unlock code for the phone. I've written this as a sort of lessons learned and next steps reflection to help me and thought I'd share it here to help others and get suggestions. Anything else you'd suggest? (I am based in London)\n\nThese were the cards taken:\n\nAmex (physical and app)\nMonzo (app)\nNatWest (app)\nStarling (Card and App)\nVirgin money credit card (card and app)\nVodafone sim (important consideration)\n\nThey were unsuccessful at taking any money out of any of the accounts, although they did try. Having a different phone unlock code to pin numbers for my cards helped (I insisted they were the same as I didn't actually know the pin numbers to my cards as I'm so reliant on contactless/ mobile). \n\nWe often talk about best deals and saving money but do we always consider what happens in a worse case scenario? Will the bank or provider be responsive in crisis?\n\n1. I did not have a back up phone or landline at home so needed to rely on a neighbour. I will be changing this. \n\n\n2. I tried contacting family members with a very old email I could get access to but they all assumed my email had been hacked rather than I was actually robbed. One even sent a WhatsApp message which was received by the attackers with a screenshot of the email. I will set up a system with them with a word we can use.\n\n\n3. I had all my bank cards either on phone or in wallet. They all needed to be cancelled leaving me with no way to access money.  I will be changing this with a backup card unconnected to phone. \n\n\n4. None of my email addresses worked on my desktop without a OTP from my phone or a recovery code from one of the emails. I will be changing this. \n\n\n5. At 10pm I tried to cancel cards: Amex, starling and Vodafone were easy to deal with and answered the phone quickly and blocked my accounts and number. NatWest put me through to voicemail, virigin money picked up the phone but failed security because I didn't have the account number for direct debit (as it was on the phone which was stolen and I'm paperless and had no access to email). Monzo forced me to use the app and made it really difficult to talk to a human. When I did they failed to actually block the account. I was able to get through to NatWest the next day, I'm still dealing with Monzo. \n\n\nFour days later I have access to all accounts on a new phone except Virgin Money which can take up to 11 days (in 2023..)\n\n\n6. Everything hinged on my phone number. I had no money or way to use public transport so had to walk to the Vodafone store who gave me a free replacement SIM once I had proved identity. I put this in an old phone and got access to email addresses and accounts again. This then gave me access to banking via phone number and emails. I am grateful they had a brick and mortar store. \n\nNext steps:\n- stop using Monzo, it's not worth it their customer service is awful. \n- stop using virgin money once current credit card is settled, so many options not worth the hassle. \n- continue to keep a backup old mobile phone for redundancy. \n- get a landline \n- have alternate one time password solution than phone (emergency email address not linked to my phone)\n- have a emergency card not registered to mobile banking with a small fund to last a few days on.\n- continue to use a mobile provider with a physical store in walkable distance\n\n\nEdit \n\n\n- thanks for all your support and I'm pleased this has been so helpful!\n\n\n- I didnt intend the takeaway from this to be that London is somehow bad or dangerous. That hasn't been, and still isn't, my experience. I'd encourage you to continue to visit and live in this wonderful city, as I intend to!",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 3135,
    "downs": 0,
    "created_utc": 1678448871.0,
    "media": null,
    "is_video": false,
    "num_comments": 558,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.78,
    "category_rationale": "Enumerated, actionable lessons and steps for handling a robbery and securing accounts.",
    "composite_score": 5.5975819579556125
  },
  {
    "score": 2952,
    "title": "Just paid off my car - Baffled by the response",
    "selftext": "Last month I finally paid off my car. I got it 2nd hand back in February 2020 and took out a personal loan to buy it (worked out cheaper than a car loan). I paid it off early by about 2 years, mainly because I recently got a (much) higher paying job.\n\nI told that to my parents, some of my colleagues and some close friends. Every single one of them asked the same thing.\n\n\"What are you going to buy now? You need something better to reflect your current means\"\n\nWhat the f.... ? What is this stupid mentality? I just erased debt that was costing me 3% a year and people expect me to go into another debt cycle costing me close to 7%?\n\nI am perfectly happy with my car. Yes, I would like to have some additional \"luxuries\" like an automatic gearbox or Android auto but IT IS A PAID OFF CAR and it is perfectly adequate for what I want it for.\n\n&amp;#x200B;\n\nEdit:\n\nWow, that has exploded. I wasn't expecting that. I can't answer every comment but I can address some common questions/observations\n\n* Why would I pay off a 3% loan when I can get 5% on a savings account\n\nFirst off I have already maxed out my L.ISA allowance for this tax year. This was my No1 priority. Secondly, I have enough money in a 5% ISA account and in my S&amp;S ISA to cover the outstanding balance 4 times over. I just wanted the weight off my shoulder and to know that I owe £0\n\n* Why would you talk with people about it?\n\nRelationships are different between people but with my colleagues, family and close friends we disscuss money issues, salaries, investments etc. Your relationship with your circle of people might be different.\n\n* Yes, I plan to keep the car for at least another 5 years. It only has 70k miles, it is from 2014 and it has been 100% reliable thus far. I also has £0 road tax and does 58MPG",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 2952,
    "downs": 0,
    "created_utc": 1702408109.0,
    "media": null,
    "is_video": false,
    "num_comments": 679,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional vent about others' reactions to debt payoff.",
    "composite_score": 5.5840179033181965
  },
  {
    "score": 2896,
    "title": "I saved my ten percent for a mortgage...",
    "selftext": "I'm 33. I make just over £30k a year. No dependants. No debts. A normal amount of outgoings (rent, Internet, phone bill, Netflix etc.)\n\nI've been putting money away whenever I can for about a decade now and have managed to put together £16,000.\n\nA house came up that I really like for £160,000, so I figured I have my ten percent saved so I should be able to get approved for a mortgage. \n\nWent to a broker and the best offer I got was just over £100k. \n\nIt looks like I'll have to somehow save another £44,000 to buy a house well below the average house price.\n\nHow do people get on the property ladder? It's starting to feel impossible. \n\nEdit: Wow! I wasn't expecting so many responses. \nI just wanted to say thank you to all of you who have replied. It has been very helpful and eye-opening. I appreciate it, and you've made me aware of avenues I didn't know about. ",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 2896,
    "downs": 0,
    "created_utc": 1747126615.0,
    "media": null,
    "is_video": false,
    "num_comments": 525,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal narrative about saving for a mortgage with questions, not a how-to.",
    "composite_score": 5.5349413672806325
  },
  {
    "score": 2804,
    "title": "Traveling by train? Do not forget to submit your delay or cancellation claim",
    "selftext": "Since going back to the office last year, so far I got back £152.84 from 5 delays and three cancellations, without counting this morning delay and this evening, what probably will be around £18. \n\nAs soon as you see the train slowing down and you hear the train manager \"apologizing\", take a picture of the ticket. Then, once you reach your destination if there is a delay of at least 15 minutes (at least with GWR) you have the right to a compensation. \n\nI have the delay repayment site in my bookmarks so it is easy to find. Then, when you have 5 minutes just submit the claim.\n\nSo there you go, do not forget to get your money back.\n\nEdit: per the recommendation of some nice people, do not forget to register to the auto delay repayments on the website of your train provider.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 2804,
    "downs": 0,
    "created_utc": 1674503524.0,
    "media": null,
    "is_video": false,
    "num_comments": 323,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.82,
    "category_rationale": "Step-by-step guidance for claiming train delay compensation.",
    "composite_score": 5.438205370695487
  },
  {
    "score": 2496,
    "title": "Update: My gf doesn't know how much debt she's in and I feel like she's hiding things",
    "selftext": "Edit: thank you for the good vibes after something we felt very vulnerable in sharing. And thank you for the encouragement and for sharing your own experiences, knowing that other couples have been in our shoes and came out stronger is so reassuring. My girlfriend is over the moon with the support and nice words.\n\nThree months ago I[ posted here](https://www.reddit.com/r/UKPersonalFinance/comments/1k8lto8/my_girlfriend_doesnt_know_how_much_debt_shes_in/) asking for some advice about my girlfriends debt.\n\nTo summarise, three months ago I realised my girlfriend not only was completely financially illiterate (e.g. she had no idea that paying a credit card was being in debt, she thought that was more like a big mortgage. I know...) but also she was in credit card debt and she didn't even know how much she owed as she was very ashamed and in denial. She had 5 credit cards (I was only aware of 2, not because she was hiding them but because they never came up in conversation) and was making minimum payments on all of them. Thanks to advice here, I signed her to ClearScore to check how much debt she was on: £8250, all in +30% interest cards.\n\nMy disappointment in her was her wake up call. I am extremely money savvy and I have the savings to cover her debt if needed. But I've works hard for it and I have made sacrifices so it would have seemed undair (she never asked me to, for the record).  She would also never learn that way so I told her I'd help her by teaching her about finances,  looking for better options to transfer the debt, etc., but the money sacrifice would have to be hers.\n\nWe started by creating a version of the budgeting spreadsheet I use for my finances, because she didn't know how much she spent on different things. At first I'd go through her bank account with her and tell her were to write every transaction, twice a week. After a while, she was doing it weekly by herself, while I updated my own spreadsheet (we call them \"financial meetings\", and we have a nice tea while doing it) After two months, we could see a pattern and tackle where the money goes. For example: she was suscribed to Prime, Netflix, Apple TV, Disney+, NowTV... And we basically only watch Disney (which I get free thanks to a Lloyds perk) and Netflix, so she cancelled everything else. \n\nShe's also transferred most of the debt to a 0% interest card (the debt with the highest interest), and stopped spending money on unnecessary things.\n\nAlso, I know that you're supposed to tackle the debt first before saving, but I wanted her to have a little satisfaction of watching her savings grow, which previously were 0, and getting her into the habit of saving money for her future. So every month, on payday, I recommended her to send money to her savings account (and LEAVING IT THERE), and pay for credit card debt, so she knows how much she has for the rest of the month. \n\nThere's also little tricks for unnecessary spending like she gave me all her credit cards so she can't use them, she deactivated GooglePay and contactless payment so she has to physically introduce the card and type the pin to buy (this slight inconvenience makes her more conscious of the money she's spending), etc...\n\n**The result?** In three months, not only her debt hasn't increased like it was the trend before, but it's gone down to £7000 (and considering she's low income right now, I'm extremely proud). She's put around 1700 into tackling her debt (although because only now we've managed to tranfser her debt to a 0% interest card, the high interests ate a lot of that) and her savings are £400.\n\nSeeing that if she wasn't in debt she would have £2100 right now makes her even more willing to clear this debt.\n\n\\----------------\n\nI just wanted to let people know, especially people with partners that seem a bit irresponsible with money, that change is possible, but they also need support and trust and patience. I'm extremely proud of her and she's in the path of clearing everything way before Christmas 2026, which is the goal I set for her.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 2496,
    "downs": 0,
    "created_utc": 1753285688.0,
    "media": null,
    "is_video": false,
    "num_comments": 157,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Describes budgeting process and 'financial meetings' with steps to help partner manage debt.",
    "composite_score": 5.2242470858285595
  },
  {
    "score": 2324,
    "title": "Child wasted £40k that we gave them for a house deposit. Need some financial and relationship advice.",
    "selftext": "Not quite sure what to do. Turning to some other people for help.\n\nI've ran a fair successful business and been fortunate enough to pay my child £40k in dividends - which is enough for a 25% house deposit in our area of the UK.\n\nI explained to my kid that he would need to set aside a percentage of it for tax.\n\nWell, tax season has come and gone, and when I spoke to my child about the house buying process it turns out they've blown through the money.\n\nAll of it.\n\nMy child owes around £3600 in tax to HMRC.\n\nThey are 20, finished university, and recently entered a job at £26k this year.\n\nThey also have £5k in credit card debt, which I discovered after prying.\n\nMy wife and I had cancelled rent this year in order to help them save and get on the housing ladder.\n\nI'm wondering whether we should bail them out of their taxes and credit card debt? Or if we should just let them learn a hard lesson and give them 3 months to find their own place?\n\nWe are undecided on whether we should take a gentle forgiving or hard approach. At the minute both options hold an equal weight in my mind.\n\nThe £40k was mostly spent eating out and going on \"experiences\" during a time when she had no job. My wife and I are often away for business, so we hadn't closely tracked what our adult child was doing.\n\nWe CAN afford to give another £25k in dividends to our child. However, my wife and I have never treated ourselves to £40k worth of experiences - so it is tempting to just buy a nice Pacific cruise.\n\nAny recommendations?",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 2324,
    "downs": 0,
    "created_utc": 1726326818.0,
    "media": null,
    "is_video": false,
    "num_comments": 560,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Difficult personal finance dilemma seeking advice, no clear steps or list.",
    "composite_score": 5.430904387854054
  },
  {
    "score": 2206,
    "title": "I made a website to calculate and visualise the UK taxes - Your Salary Calculator",
    "selftext": "Hello everyone!\n\nCalculate and visualize your take-home pay using **my pay calculator** considering income tax, national insurance, personal allowances and others.\n\nThis tool aims to be more intuitive than any others on the internet and will include additional features as requested by redditors in this subreddit.\n\n**The website is now available at** [My Pay Calculator](https://mypaycalculator.co.uk/)\n\n&amp;#x200B;",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2206,
    "downs": 0,
    "created_utc": 1694891168.0,
    "media": null,
    "is_video": false,
    "num_comments": 353,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Promotes a tax calculator tool; not a list or guide.",
    "composite_score": 5.360803964174549
  },
  {
    "score": 2021,
    "title": "Please tell me about the time you quit your well paid job due to stress, took some time out, then found something else and it all worked out OK.",
    "selftext": "Without going into too much detail, I've reached the point where I'm genuinely beginning to worry about the effect my job is having on my health, and I want to resign and take an extended period away from work to recover before getting back on the market. Something in the region of 3-6 months I think. Right now I could afford to do this, and still be in decent financial shape at the end.\n\nBut — the job is well paid for where I live, I have a mortgage and a family, and making enough to be comfortable in this economy isn't something to be lightly thrown away. It feels like a crazy thing to contemplate with the cost of everything going up the way it is. Like any good UKPFer, I'm also fairly horrified at the prospect of depleting my savings while having nothing coming in.\n\nIf you've done something like this, and you spent the money and then ended up back in another job feeling healthier and happier, and it all worked out OK, I'd love to hear about it. As much as I want to get out — no job is worth losing my health over — the prospect of actually doing it is making me feel seriously irresponsible.\n\n***\n\nEdit: thanks everyone for your thoughts and experiences. Really appreciate it. I've read all the comments and they've given me plenty to think about.\n\n***\n\nEdit 2: more amazing responses, including some very thoughtful DMs. This definitely seems to have hit a nerve — it seems that quite a lot of us have suffered/are suffering for our jobs! I hope things pick up for all of you who seem to be in the same boat as me.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2021,
    "downs": 0,
    "created_utc": 1682544142.0,
    "media": null,
    "is_video": false,
    "num_comments": 642,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Open-ended request for experiences about quitting due to stress; lacks a structured guide or list.",
    "composite_score": 5.452386637717093
  },
  {
    "score": 1996,
    "title": "I am 19, I have won the set for life lottery. What should I do. ",
    "selftext": "I’m unsure on what to do with money. I’m going to uni this September, don’t even know if I should go. But what else what I even do?\n\nAny recommendations on what to do with the money.\n\nI am unsure if I should tell anyone. One side is saying yes because it isn’t a large lump sum amount of money, people can’t really ask for anything. But another side is saying to not say anything.\n\nI also don’t know how to explain where this money came from if I don’t say anything.\n\nWhat should I do?\n",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 1996,
    "downs": 0,
    "created_utc": 1721320936.0,
    "media": null,
    "is_video": false,
    "num_comments": 563,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Open money question from a 19-year-old; no substantive content to classify.",
    "composite_score": 5.343517616862373
  },
  {
    "score": 1915,
    "title": "Guide to reducing your energy bills",
    "selftext": "I thought it might be useful to repost this [guide](https://www.reddit.com/r/UKPersonalFinance/comments/ykfuyb/guide_to_reducing_your_energy_bills/) on energy-saving tips, as although the winter months are now coming to an end, which means lower energy bills, it also means that this is the last month of the government's £400 energy grant.\n\nAs tariffs remain high, and with many people in the UK still needing to heat their homes well into the end of April/Early May, a lot of people will likely still struggle with energy costs.\n\nWith that said, and with the UK also experiencing a particularly cold spell of weather this week, here is a collection of ways to help reduce your energy bills:\n\n&amp;#x200B;\n\n**INTRO:**\n\nOne of the biggest ways in which people are overpaying for their energy bills is the unintentional, overuse of power. This is due to the fact that a surprisingly high amount of people don't know the 'kWh' of many household appliances, or how this number is calculated in the first place. So, let's start there:\n\nA Watt (W) is the unit of power by which electricity is measured. A Kilowatt (kW) is 1000 watts. So, one kilowatt hour (kWh) is the amount of energy you’d use if you kept a 1,000 watt (1kW)  appliance running for an hour. \n\nThis is the standard billing unit for energy providers, so a key part of reducing your household energy bills is to start putting a real money value on the kWh of your most used household appliances. So, with respect to this advice, here are a few ways to seriously save on your energy costs every month:\n\n&amp;#x200B;\n\n**HEATING THE HOME:**\n\n**PART ONE: THROW OUT THE FAN HEATER**\n\nMost of us are now paying around 34p per kWh, which means if an appliance has a rating of 1 kW, it costs 34p to keep it running for 1 hour.\n\nPut simply, humans need to stay warm when the weather is cold, this is probably the most obvious statement you'll read online today. However, what is less obvious to people is that the ways in which we choose to stay warm at home can mean the difference between paying £100-£200 more for your energy bills per month.\n\nI think for most people, it's obvious that some appliances cost more to run than others. However, I think the two main issues are that people don't think about the ways in which using more expensive appliances adds up over the course of 30 days, and also, common misconceptions about using certain electrical appliances to heat your home being cheaper than using the central heating.\n\nSo, going back to the title: A regular fan heater that you buy in Argos will use 1 kW, or 2kW if you have it on the second heat setting. This means that if your energy rate is 34p /kWh, you will pay 34p to keep this running for an hour at 1kW, or 68p to keep it running for an hour at 2kW (the second heat setting on most fan heaters).\n\nAn alarmingly high amount of people think that using a fan heater is cheaper than using the central heating, when in fact it can be up to 3 times more expensive than it would cost to power a radiator for an hour (Gas tariffs being around 10p/ kWh and assuming that a single radiator requires around 1.5kW to operate).\n\n&amp;#x200B;\n\n**Looking at how this adds up over the course of a month:**\n\nUse of fan heater for 3 hours per day at 2kW = £2.04\n\nFor one week: £2.04 x 7 = £14.28\n\nFor 30 days: £2.04 x 30 = **£61.20**\n\n&amp;#x200B;\n\nThis is a ridiculously high cost for a single appliance, especially considering that many people choose to have both the central heating on and use fan heaters to heat individual rooms at the same time.\n\nThis is where the alternatives come in, because as I said before, humans simply need to be warm when the weather is cold, **so** **it doesn't really matter how we achieve this, as long as we get it done.** With that being said, Here are some *much* cheaper ways to stay warm this winter:\n\n&amp;#x200B;\n\n|**Method**|**Cost To  Buy**|**Cost Per Hour (£/kWh)**|\n|:-|:-|:-|\n|Electric Blanket|£15-£45|3p|\n|Hot Water Bottle|\\~£5|6p|\n|Heated Gilet|£13-£40|1p|\n|Heated Gloves|£5-£10|1p|\n|Footwarmer|£20-£40|3p|\n\n&amp;#x200B;\n\n**ALSO:**\n\n**(1) Layer up.** Wear long sleeve thermals as your base layer, it goes a long way in conserving heat. They only cost around £6-8 and make such a difference.\n\n**(2) Use Extra Blankets:** If you find yourself at home during the day and feeling chilly, covering yourself in a blanket will often eliminate feeling the need to put the heating on.\n\n**(3) Go out for a walk:** Exercise helps warm us up. Bonus points if you go for a walk in the evenings when it's cooler, as you will appreciate the warmth inside your house more when you return.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**PART 2: GETTING THE MOST OUT OF YOUR CENTRAL HEATING:**\n\nSo, when it comes to having the heating on in winter, the word 'inevitable' comes to mind. For this reason, It's crucial that you're getting the most out of your heating system. I think that 2 things, in particular, are essential in achieving this:\n\n**(1)** **EFFICIENCY**\n\nAs mentioned above, it's really important that people understand how the standard units of energy are measured, and how their bills are calculated, in order to think of the way we use our heating in terms of real money.\n\nGoing back to Watts, the standard unit of measurement for energy used by electrical appliances, it's important to note that 1 Watt = 1 Joule per second. So, 1kW = 1000 Joules per second.\n\nHeat energy is also measured in Joules, so from here we can see why our gas tariffs are given in kWh, since the amount of heat energy we use in Joules can easily be converted to kW.\n\nI know, this is starting to get a bit thermal physicsy, but bear with me...\n\nOnce we realise that it requires more kW of energy to heat the water in our boilers to a higher temperature, it becomes apparent that if we were to lower the 'flow temperature' of our boilers (This is the temperature that the water is heated to in our boilers before it is sent off to the radiators in our homes) then this will require less energy, and ostensibly allow our boilers to operate more efficiently, and at a lower cost. Here's how:\n\nThe most common type of boiler in the UK is known as a condensing boiler, since 2005, all boilers installed in the UK must be this type of boiler by law.\n\nCondensing boilers are very clever, in that they recycle the latent heat energy from water vapors that would have been lost through the flue (a pipe that carries exhaust gases produced by a boiler outside the home and releases it into the atmosphere) in older boilers.\n\nIn order for these boilers to work closer to maximum efficiency, most energy companies recommend setting your flow temperature to around 60 degrees, with some even recommending this setting be as low as 50 degrees, if you have a newer home.\n\nThe thing is, **many people in the UK have this setting very high**, often around 80 degrees or so, and not only can it end up costing you more money to operate your boiler at this high setting, it also compromises the efficiency of the boiler.\n\nThe reason for this is that condensing boilers need to be able to, well, condense. The 'return temperature' (the temperature of the water when it returns to the boiler) plays a big role in this, because only at lower temperatures can condensation occur. Condensation needs to occur because when water vapor changes phase from vapor to liquid, the latent heat ( the heat energy required for the phase change to occur in the first place) is returned to the system. This heat energy being recycled means that less 'new energy' is needed to heat up the water in the system (See? Very clever).\n\nThe maximum temperature before condensing will no longer occur is known as the dew point, and is usually around 55 degrees. If your flow temperature is around 60 degrees, then your return temperature should be around 40 degrees, which will allow the process of condensation to occur and increase the efficiency of the system.\n\n**In Summary:** A lower flow temperature can increase the efficiency of your heating system and help save you money.\n\n**NOTE:** Although condensing boilers are the most common type in the UK, there are many different boiler manufacturers. Before you decide to adjust your flow temperature, consult the manual of the make and model of your boiler to be sure you are adjusting the correct setting. There should be two temperature settings on your condensing combi boiler, one is for adjusting the flow temperature and the other is for adjusting the hot water temperature (the temperature of the water that comes out of your taps). It's also a good idea to research this topic yourself, as your home/heating system may benefit from different settings than others.\n\n**NOTE 2:** If you have a boiler and a hot water cylinder, then you should **not** reduce the flow temperature, because unlike combi boilers, these boilers only have one temperature setting for both hot water and heating. This is important because the water in the hot water tank needs to be kept at at least 60 degrees in order to prevent the danger of legionella bacteria.\n\n&amp;#x200B;\n\n**(2) HEAT CONSERVATION:**\n\nAs important as having your heating system running efficiently, is conserving as much of the produced heat as possible. There is a number of things you can do to achieve this, Here's how:\n\n&amp;#x200B;\n\n**(1) Stop covering your radiators.** It may sound obvious, but so many of us do it. The worst offender is probably having closed curtains covering the top of your radiator, essentially ensuring that the hot air rises up and goes straight to the cold windows. Not good.\n\nYou also don't want furniture blocking the radiators, even though a lot of heat is given out the top, you still want the heat from the front of the radiator to be able to go out into the room.\n\nDrying clothes/towels on the rad? Not such a good idea. I'm not going to say that this 'blocks' the heat coming out of the radiators exactly, because heat transfer is more complicated than that, but if you cover an entire radiator with a wet towel, for example, you'll notice that the room is  a lot slower to heat up. A good way to dry your clothes faster indoors is by placing a dehumidifier next to the clothes horse, it works a treat.\n\n**(2) Draught Proof your windows:** This one sounds like a big job but it's actually very easy to do and can make such a difference. All you need to do is apply self-adhesive foam tape to a window frame. Draughts also occur in cracks between the window frames and the surrounding walls – it’s worth considering using sealant or putty in these.\n\n**(3) Use Draught Excluders:** Having a draught excluder for your front/back door will not only make your home feel warmer as less heat escapes and less cold air is let in, but can also help reduce heating costs.\n\n**(4) Keep doors closed:** Leaving doors open is the fastest way to allow heat to escape from a room. Be sure to keep doors shut in order to keep the rooms you are spending your time in warmer and cosier for longer.\n\n**(5) Thermal-lined curtains:** These are heavier curtains that help keep the heat in your rooms for longer and can certainly be a worthwhile investment for your sitting room or bedroom.\n\n**(6) Fill in the gaps in wood flooring/ Use large rugs:** You may notice that cold air comes up through the gaps in your wood flooring, so a worthwhile way to prevent this from happening is to fill in these gaps using some. floorboard gap filler. However, if you don't want to go to the trouble of doing that, using large rugs to cover your wooden floors can also be very effective.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**OTHER ENERGY COSTS:**\n\n&amp;#x200B;\n\n**(1) SHOWERS:**\n\nThe average electric shower in the UK operates at about 10kW. This means that a 6-minute shower uses about 34p of energy. Most people shower once per day, and in houses with 3 or 4 people, this cost can really start to add up.\n\nIn the winter, people will often spend longer in the shower because it's a nice way to warm up. However, this can also lead to people taking 10 or 15-minute showers, which can double or even triple the amount you're spending to operate this appliance every month.\n\nShortening your shower times can save you £100s over the course of a year, but on a monthly basis here are some comparisons for thought:\n\nSingle person who takes a 6-minute shower (34p approx) every day of the month: 34p x 30 = **£10.20**\n\nSingle person who takes a 15-minute shower (85p approx) every day of the month: 85p x 30 = **£25.50**\n\nHousehold of 4 people who each take a 6-minute shower daily: 34p x 4 x 30 = **£40.80**\n\nHousehold of 4 people who each take a 15-minute shower daily: 85p  x 4 x 30 = **£102**\n\nAs you can see, the extra time you spend in the shower can lead to a sizeable difference in your energy bills at the end of the month. I know, the thought of cutting down shower times is a bit grim, but it's still good to know that it's a potential way to reduce your energy bills this winter if you wish to do it.\n\n&amp;#x200B;\n\n**(2) WASHING AND DRYING:**\n\nWashing Machines can be anywhere between 0.7-3 kW. Meaning the amount it costs to operate one per hour can vary depending quite a bit depending on the efficiency of the machine.\n\nA 0.7 kW machine should cost about **24p** to operate for an hour. Whereas a 3 kW machine will cost around **£1.02** to operate for the same amount of time.\n\nYou can easily check the kWh of your machine so that you have a better idea of how much energy it's using, but no matter what the hourly cost is, here are a couple of things you can do to reduce the amount you're spending on washing every month:\n\n**(1) Use the Quick Wash Setting:** This is my go-to cycle on the washing machine ever since energy bill armageddon. On most washing machines, it's a 20-minute cycle, and honestly, if it's just clothing that you've worn once and then thrown in the wash basket, you really don't need more than 20 minutes for a wash cycle. Of course, for stained or more odorous laundry, you can use a longer wash time, but for most washes that you put on, the 20-minute cycle more than does the job. Doing this can reduce your washing costs quite a bit, so it's absolutely worth changing to.\n\n**NOTE:** Some people are saying that washing your clothes on eco mode will use less energy even though the cycle lasts longer. This should be the case when compared with a regular cycle, but compared to the quick wash setting, at least on my machine, it does not. Only way to be sure is to check the manual of the washing machine you own and see how many kW each cycle uses.\n\n**(2) Reduce the temperature you wash your clothes at:** Washing clothes at 30 degrees instead of 40 degrees reduces the energy used per wash. This can help reduce the cost of your energy bills monthly and annually and it's a really simple adjustment to make.\n\n**(3) Fill your Machine:** It's a simple one, but ensuring that your washing machine is full means you'll put on fewer washes which in turn reduces the amount your machine is costing you every month.\n\n&amp;#x200B;\n\n**DRYING:**\n\nMost tumble dryers operate at around 3kW, but some use even more energy than that. This means that they cost around £1-£1.50 per hour to operate. My solution to reducing the cost of these machines....is simply not to use them. Invest in a couple of clothes horses and dry your clothes near a  window. In colder months, a good way to dry your clothes faster indoors is by placing a dehumidifier next to the clothes horse, it works really well. You could easily save £20+ per month by ditching the tumble dryer.\n\n&amp;#x200B;\n\n**(3) COOKING:**\n\nMost household ovens operate at around 2kW, which means they would cost around **68p** per hour to power when running at full tilt (though in reality, they should actually cost a bit less than this, as they don't need to be heated up for the full hour that they're in use). Comparatively, A microwave usually operates at around 1kW, and an air fryer also operates at around 1kW or even a bit less than that, which means they cost around **34p** per hour to run.\n\nFor quick meals, there's an obvious advantage to using a microwave over the oven when possible, but when it comes to cooking things like, chips, meat, vegetables etc, using an air fryer can be a very advantageous alternative. Not only is the kWh half of that of an oven, which means half the energy cost, It also cooks food much faster than an oven, so it is more energy efficient on two fronts.\n\nYou could save £20-£30 per month by investing in an air fryer, which really adds up in the long run.\n\n**Also:** If you are cooking frozen food like pizza, chips etc. in the oven, there really is no need to preheat the oven for 5-10 minutes before throwing them in, It's a waste of energy. Just turn on the oven and put them in straight away, it will save both your energy and your time.\n\n&amp;#x200B;\n\n**(4) BYE BYE TO STANDYBY**\n\nA UKPF user made a [post](https://www.reddit.com/r/UKPersonalFinance/comments/wkxng0/energy_cost_of_devices_on_standby_in_my_home/) about how much electricity devices in his home were using while on standby. It's pretty eye-opening stuff and definitely worth a look.\n\nMy advice in relation to this is to simply try to get into the habit of completely switching off devices in the home when you're not using them. It's quick to do and easily done and could end up saving you quite a bit in the long run.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nAnd that's all that I can think of for now, if you have any other suggestions about how to save on energy in the home, please comment and I'll add it into this post.\n\nCheers",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1915,
    "downs": 0,
    "created_utc": 1678201173.0,
    "media": null,
    "is_video": false,
    "num_comments": 357,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Repost/guide with multiple energy-saving tips in list form.",
    "composite_score": 5.301837018064463
  },
  {
    "score": 1874,
    "title": "UPDATE: High Street Bank pulled 10 year fix mortgage offer ~20 days before new rate takes effect.",
    "selftext": "Good news! My deal got reinstated.\n\nI asked for a copy of every single record on the case. Calls, letters etc. and raised a complaint. I heard back about 3 hours later when they realised they had screwed up.\n\nThe bank had cancelled my deal way back at the start of June, but had neglected to send out a cancellation letter, call me, or inform me in any way that the deal had actually been cancelled.\n\nIn addition, subsequent calls between June and August had seen phone agents from the bank tell me the deal was still live, despite it being cancelled on their system.\n\nThe bank has reinstated the low 10 year fixed rate as they failed to notify me of the cancellation.\n\nHappy ending!",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1874,
    "downs": 0,
    "created_utc": 1692970086.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal mortgage issue narrative; no actionable steps.",
    "composite_score": 4.980021968224285
  },
  {
    "score": 1874,
    "title": "If I lived on a cruise ship for 3 years, working remotely, would I have to pay taxes?",
    "selftext": "Now I know what you're thinking, what a silly question.\n\nHowever, please indulge my silly thought process.\n\nAccording to the below-linked article, a cruise company is charging £25k a year for a 3 year all-inclusive cruise which will take you all over the world.\n\nNow, I currently pay £9,600 a year in rent, spend probably around £1,500 a year on groceries (estimate, eating out) and get taxed/student loan something in the region of £10,000. Then lets say another £1,000 spent on trips abroad. That totals around £22,000.\n\nNow, if I wouldn't get taxed while gallivanting around the world on a ship, is this not almost fiscally a better option than living and working in London?\n\nNow, this is a bit of a tongue-in-cheek question, and quite hypothetical. Of course, there are other things to consider, occasional flights back to the UK from the middle of nowhere, WiFi outages, spending when in port, I'd probably still have to keep paying back my student loans, potential cabin fever after living on a ship for so long. But, financially this seems pretty appealing.\n\n [Midlifers sign up to three-year cruise, complete with offices and mortuary (thetimes.co.uk)](https://www.thetimes.co.uk/article/midlifers-sign-up-to-three-year-cruise-complete-with-offices-and-mortuary-t89dfzc08)",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1874,
    "downs": 0,
    "created_utc": 1679999823.0,
    "media": null,
    "is_video": false,
    "num_comments": 133,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Hypothetical tax question about living on a cruise; seeks discussion rather than steps.",
    "composite_score": 5.071553671246142
  },
  {
    "score": 1765,
    "title": "Shoul I rent for almost half my salary?",
    "selftext": "Hello, I am about to start my new work and would have to relocate. I found an all inclusive studio flat for £850 pcm near my work which I'm thinking of renting. However I only earn about £1800 pcm after tax. My reasoning is that the all inclusive studio will save me money for council tax and bills. Also due to lack of housing near my work and I'd ideally want to live in a walking distance to work as I do not drive. \n\nI do have the option to choose an all inclusive ensuite room for £500 pcm but highly reluctant to share house/kitchen with strangers.\n\nWhat would you do if you were in my shoes? And if I should take the higher end studio for peace of mind.\n\n\nEdit: For more info, the expensive studio near my work would save me about £100 per month on transport, save me travelling time back and forth and give privacy. Overall would be about £200 more expensive than sharing, would it be worth it?\n\nEdit 2: Thank you all for your insight 🙏. Honestly, I needed a nudge to justify my spending to keep the guilt voices down and looks like I'm not alone. I have decided to go for the expensive studio nearby, just hoping I can get it now as its the only one nearby. Wish me luck!\n\nEdit 3: To roughly answer a few questions, my new job is based in Midlands. I am 23 y.o. and likely for a pay increase as its a Graduate role. Extra costs includes £250 pcm for driving lessons for a while. Expensive studio includes bills plus council tax\n\nUpdate: Apparently the studio is already reserved so didn't even get a chance... Now looking around for studios/flats, max £850pcm including bills plus council tax, within 30min walking distance from work. Praying.\n\nThank you for everyone taking their time to comment and give helpful suggestions, I and anyone else in my position really appreciate it. \n\nQuestion: I'm wondering what a one person's monthly bills would be in a one bedroom apartment, my estimate is roughly £200.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1765,
    "downs": 0,
    "created_utc": 1688982842.0,
    "media": null,
    "is_video": false,
    "num_comments": 707,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Personal housing-cost decision question; not a procedural guide.",
    "composite_score": 5.399507328086434
  },
  {
    "score": 1547,
    "title": "It’s taken a while but I’ve finally hit £10k in savings!",
    "selftext": "Afternoon everybody! Just wanted to share something positive as I don’t want to seem like a gloat to all of my friends considering the COL right now. \n\nA few years ago I was £9k in debt, jobless, a gambling addict who ended up with a CIFAS marker for fraud and a CCJ. Something had to change. I had to change.\n\nAfter paying off my debt at the end of 2022 I finally began saving, which was exponentially helped in April 2023 when I got a new job with an industrial services company (I’m a self employed scaffolder). \n\nI’ve just crunched some numbers and between my savings account and my bank I have just over £10k to my name. \n\n£9k is earning 5.2% interest, I’ve got another £1000 to put in and that’ll leave me with £1000 spare in the bank for any short term emergencies plus my budgeted money for my weekly expenditure. \n\nThe plan is to wait until March 2025 when I will max out my LISA for this tax year, then the rest of my savings will go into a Cash ISA and I’ll leave £5k in easy access savings for my emergency fund. \n\nSorry if this comes across as a brag, I’m just excited and I don’t really have anyone to tell other than my mum! Have a great day everyone :) \n\nEdit: just had a look on here after getting back from work and wanted to say thank you all for your comments! To answer a common question: due to my cifas marker not expiring til the end of 2026 I keep my savings in my trading212 account because they pay 5.2% on uninvested cash. \n\n",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1547,
    "downs": 0,
    "created_utc": 1715261132.0,
    "media": null,
    "is_video": false,
    "num_comments": 167,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.7,
    "category_rationale": "Personal savings achievement post; no actionable content.",
    "composite_score": 5.029925597209806
  },
  {
    "score": 1543,
    "title": "Just discovered wife [F61] hasn't paid into a pension scheme in her entire life. What options to I have to protect myself?",
    "selftext": "We both work in the NHS. I've got a solid Defined Benefits pension that will give me a very comfortable retirement.\n\nMy wife, it turns out, has opted out of her NHS pension. During the confrontation about it she seemed completely shocked that I expected her to also pay into her own pension. She seemed intent that she would be using my pension to support us both during retirement.\n\nThere have been discussions about retirement over the years and previously she lied to me that she had been saving for retirement etc. She has less than £5k in her ISA and £3k in other savings accounts. I have a defined benefits pension worth over £30k per annum, plus £470k+ in stocks and shares ISAs etc. We have a house valued at £375k.\n\nI had a quick 30 minute call with a solicitor this morning, but he advised me that even if I divorced her she'd probably end up with 60-70% of my pension, plus majority of the house, and a chunk of my stocks and shares ISA.\n\nI just feel so betrayed and hurt and used right now.\n\nIs there any way I can divorce her and keep my pension for myself? I was the one who worked and saved and earned it. She chose not to.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 1543,
    "downs": 0,
    "created_utc": 1720452296.0,
    "media": null,
    "is_video": false,
    "num_comments": 208,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Divorce/pension-related dilemma; seeking advice rather than a guide.",
    "composite_score": 5.008720439055244
  },
  {
    "score": 1490,
    "title": "36 years old. Used to be homeless. £40k salary. No idea what to do with it?",
    "selftext": "Sorry, not sure if this type of question is allowed or not. \n\nI've lived a fairly bizarre life. I used to be homeless for a long time and got a job in a call centre for 12 hours a day. It led to me getting another job then another and I've just landed on £40k a year. I don't drink or take drugs or have any debts. I basically just look after my 100 year old grandmother. \n\nI have no idea how to invest or how to really even \"manage\" money. I just spend less than I make each month. \n\nWhat advice or tips would you give me?\n\nEdit: Thanks to everyone answering. Genuinely you are telling me very useful things that I simply had no idea about! Truly I'm so grateful. \n\nEdit 2: Wow. I didn't expect to get so many responses. Thanks. To those who PM'd me - I'm  thankful for that too but I have a bit of a rule on here to not get into any 1-2-1 private chats. Nothing personal to anyone messaging, just one of my own rules 🙂",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1490,
    "downs": 0,
    "created_utc": 1711396752.0,
    "media": null,
    "is_video": false,
    "num_comments": 257,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Money-management question from someone with a £40k salary; seeking tips rather than guidance.",
    "composite_score": 5.091787496434609
  },
  {
    "score": 1448,
    "title": "Thanks to UKPersonalFinance, today we're officially debt free.",
    "selftext": "This sub man, I tell you what! 3 short years ago, £19,000 worth of bad debt between myself (35M) and my wife (34F) and two shambolic credits files we faced up to it all. \n\nOne of the first places I had found was this sub, the advice I received through personal posts or from reading replies on other people's post in similar situations has been invaluable.\n\nThe financial responsibility I have learned to have over the past few years is 100% credited to this sub and the people who make it a community.\n\nThe last Direct Debit left the account today and we feel fantastic, relieved it's over, emotional that we've set ourselves back years due to ignoring debt and being stupid with credit but determined to plan for the future. \n\nIt's time to let the clock tick down on the defaults while continuing to build our deposit for a first home. \n\nJust wanted to share our little victory today as it somewhat belongs to the good helpful people in her. If you're reading this and are in a similar position just know there is a way back, just allow time and sacrifice, you don't need to fix it overnight. \n\nThat's all, just thanks UKPF, fucking rock stars of Reddit Subs",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1448,
    "downs": 0,
    "created_utc": 1678367607.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Personal debt payoff victory story with thanks; lacks list, steps, or a clear model.",
    "composite_score": 4.865828011780485
  },
  {
    "score": 1422,
    "title": "Any advice appreciated: Scammed out of £15K. Penniless. Broken.",
    "selftext": "I am so ashamed to be here writing this post, but this morning I was scammed out of £15K, basically every penny me and my partner had in our bank accounts.\n\nTypical open banking scam apparently - I'd never heard of this before.\n\nI had a text message advising me of a suspicious transaction, and asking me to confirm if I had in fact made the transaction. I've had something like this before, and it was legit, so I replied 'N' as per the last time.\n\nA short time later, someone rang claiming to be from my banks Fraud Department. He was extremely well spoken, didn't stutter or give any cause for concern really. As it was, this is what happened last time and all was well and ended well.\n\nHe advised that someone had managed to get my details and was trying to set up gym memberships, car finance etc. He told me that I needed to tap a link they would send, which would allow me to send my money to a holding account, and then I would book an appointment for my local branch to re-set up my account.\n\nWhen I tapped the link, it took me to a website called uome, and it looked very professional, had a button for each bank and that button took me to my own banks website (which I verified looking at the address). I foolishly logged in and sent £5K.\n\nThen he advised me that my other accounts may be compromised and asked me who I banked with, he then put me in touch with that banks 'fraud department' and they said the same, that my accounts had been compromised. They persuaded me to transfer all my money, plus overdrafts into the Lloyds account, and even persuaded me to take a loan (£5K) and send that across too, because in their words, that would stop them taking loans in my name.\n\nI then repeated these transfers, and the total sent was £15k.\n\nAfterwards, I called Lloyds to confirm if they knew about this supposed activity and that's when they hit me with it, I've been scammed.\n\nOnly weeks ago, I've lost a good friend and my father to cancer. I've been a bit depressed unsurprisingly about that, and because of my own health issues, I have been suffering insomnia and last night I barely slept at all so my judgement was clouded, but even so, I'm not 100% convinced I wouldn't have been taken in anyway, as they were so convincing and professional sounding.\n\nI am honestly utterly distraught, and to be honest, I am on the verge of doing myself in. I should know better than this with my background. I have had so much bad luck in the last 12 months but this is catastrophic. I now cannot afford to pay my mortgage, as I've just been paid and all 3 of our accounts are now overdrawn.\n\nI've raised a case with my bank, and informed the other two banks and also the Action Fraud website.\n\nThe bank say they will try and recover the money but it's best endeavours as it's basically gone due to the lack of safeguards and regulations.\n\nI was already a broken man due to recent events and this is threatening to push me over the edge.\n\nAny advice appreciated. But please don't give me any sarcastic or condescending comments about how much of a fool I've been as I can't possibly feel any worse than I do now. I feel like I've ruined my life and all the plans I had for the future, just because I was caught off guard.\n\nUtterly, utterly heartbroken and gutted. I have literally been in tears all day between phone calls. I feel like such a fucking bellend.\n\nThanks in advance.\n\nUpdate 4/4/24: Lloyds have refused to offer a refund. Any advice on next steps appreciated.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 1422,
    "downs": 0,
    "created_utc": 1712164412.0,
    "media": null,
    "is_video": false,
    "num_comments": 669,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Recount of a £15k scam and request for advice; mostly narrative with little actionable content.",
    "composite_score": 5.248742301434698
  },
  {
    "score": 1372,
    "title": "36 soon-to-be reaching 10k as my savings",
    "selftext": "I know 36 may be a lil bit late for this amount in saving but after years of setbacks, bad choices, disappointments, tears etc... I just wanted to \"congratulate\" myself a lil bit concerning the improvement I have made on my finances' management. I earn 20k per year but I have nobody relying on me (therefore it has also helped). I cannot go back in time to change certain things in my life but I can only keep on working hard for the future -at least I will keep on working hard to stay away from debts.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1372,
    "downs": 0,
    "created_utc": 1725947755.0,
    "media": null,
    "is_video": false,
    "num_comments": 176,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal savings milestone update without a clear process or model.",
    "composite_score": 4.981657170417658
  },
  {
    "score": 1363,
    "title": "Any other Millennials look back and reflect on how financially illiterate you or your parents were when you were growing up?",
    "selftext": "When I look back, it blows my mind to think how financially illiterate my parents were and by extension, I was, growing up.\n\nWhenever there was any mention of shares or investing for example, there seemed to be this vague narrative that it was this obscure activity reserved for rich people.\n\nThey weren’t clued up with tax-efficient savings accounts like ISAs, LISAs and SISAs. When it came to pensions or SIPs, they didn’t even know what their money was being invested in, nor did they care to check…they still don’t lol.\n\nBeyond stressing to me the idea that “money doesn’t grown on trees” and that I needed to get a job and move out asap, they were actually quite hands off. Didn’t really like discussing the topic with me.\n\nI guess it’s easier to say all this in retrospect and It also wouldn’t be fair to not acknowledge the fact that financial education is far more accessible now than it ever was back then.\n\n…but damn, I often think, had I been a bit more aware and known the significance of chucking just a little bit of cash into a reliable index fund / ETF each month, (when I was in my early 20s, instead of 30s) I’d be in a far better position.\n\nI mean Christ, we’ve got young Gen-Z teenagers posting about their investment strategies these days and I think, good for them. At their age, I was more concerned about how I was going to save up for an iPod, buy a stack of booze for an upcoming house party or buy a £90 pair of Osiris D3 skate shoes. I practically bathed in consumerism. ",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1363,
    "downs": 0,
    "created_utc": 1757228319.0,
    "media": null,
    "is_video": false,
    "num_comments": 284,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.56,
    "category_rationale": "Reflective post about financial illiteracy with no actionable guidance.",
    "composite_score": 5.067236800324715
  },
  {
    "score": 1364,
    "title": "Today I hit the £3000 savings milestone!",
    "selftext": "Hi all,\n\nI've been a long term lurker of this sub and it's changed my outlook on money. I started 2023 with £6k on credit cards, I'm okay with money but I feel like this sub has drastically changed my mentality.\n\nI finished paying my CC off in Jun and I continue to save on top of achieving the £300 limit into the First Direct 7% saver. Today I hit £3000 between my savings account and ISA as well as having a £0 balance on my credit cards. Nobody tells you how addictive it is to save and hit certain milestones!\n\nI'm nowhere near in as much of a comfortable situation as I would like to be but I'm working towards a house deposit and would like to look to buy in the next 12 to 18 months.\n\nI look forward to meeting more milestones and reducing my further expenditures (my £74 phone contract ends in May 24 and I have £5000 left to pay on my car at 4.9%).\n\nThank you all for being supportive as a community",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1364,
    "downs": 0,
    "created_utc": 1690892789.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.57,
    "category_rationale": "Milestone savings update; motivational but not a how-to or model.",
    "composite_score": 4.834873987451859
  },
  {
    "score": 1304,
    "title": "Bank gave out too much money - advice req.",
    "selftext": "My father went to a local bank in N. Ireland to withdraw £12k as agreed with the bank. He was given the envelopes of what he believed was £12k but it turns out it was £20k.\n\nThe bank rang him hours later and told him that he had to return the money immediately, he explained that he hadn't opened the envelopes yet and that he had crossed into the border to Ireland, he wouldn't be able to count the money until later on. \n\nThe bank then (without telling him) debited his account the £8k balance leaving him approx £4.5k in debt and froze his account. \n\nBear in mind that none of this is his doing - aside from returning the money (which he intends to do) what can he do? ",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1304,
    "downs": 0,
    "created_utc": 1747344750.0,
    "media": null,
    "is_video": false,
    "num_comments": 333,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Request for advice following a bank error; mostly a personal situation, no steps.",
    "composite_score": 5.104983745080082
  },
  {
    "score": 1304,
    "title": "Sold off most of my Pokemon for insane returns, now what?",
    "selftext": "I currently have around £130,000 (in cash paper) after selling off a mass amount of my Pokemon products. \n\nThe problem I now face is, I want to put the cash into a bank to be able to buy a house. \n\nAt the time, selling items here and there for £100-£1000 and alot of buyers regularly hand over cash, never even questioned it. \n\nGot to around £30k in cash and realized how much of an issue this is.  Now I'm 130k deep.\n\nAny advice? Any one done the same? \n\nDo I need an accountant or an advisor? \n\nPlease help. \n\n",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1304,
    "downs": 0,
    "created_utc": 1758571901.0,
    "media": null,
    "is_video": false,
    "num_comments": 536,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.53,
    "category_rationale": "Query about handling large cash proceeds from selling Pokemon; seeking guidance but not procedural.",
    "composite_score": 5.1705976545240775
  },
  {
    "score": 1281,
    "title": "Bank staff visiting house due to accidental overpayment in cash.",
    "selftext": "Slightly odd one, my nephew who has just turned 18 years old made a withdrawal today from a well know building society. The cash was put in an envelope and given to him by the teller and he left. This evening the same teller visited his house (whilst he wasn't in) and stated that he accidentally put an extra £100 in the envelope and has asked for the money back (seems his till was down at closing).This seems very strange to me - I'd be very surprised if this was bank policy but I wanted to see what others thought. My nephew hasn't returned home yet to confirm if there was an additional £100 in the envelope.\n\nUpdates:\nThe man at the door was wearing a Nationwide uniform (assuming it is the teller)\nNephew withdrew £700, was supposedly given £800\nThe man suggested he didn't have my nephews address on file (not sure how that's possible) so he looked his mums address up (also a customer, they live in the same house.\n",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1281,
    "downs": 0,
    "created_utc": 1725471626.0,
    "media": null,
    "is_video": false,
    "num_comments": 409,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Anecdote about accidental overpayment and bank staff visit; asks for others' thoughts but no method.",
    "composite_score": 5.141779953542666
  },
  {
    "score": 1281,
    "title": "Husband hasn't paid the mortgage in 17 months.",
    "selftext": "As the title reads. We have a joint mortgage with aprox 78k left to pay. So not a huge mortgage. I've only just found out about this through our mortgage company Accord mortgages when they phoned to say we were £160 short. I queried this as it was \"paid\". Turns out it hasn't been pain since October 23! Luckily (I say that loosely!) I had overplayed my mortgage in previous years and the average covered it until the £160 of a shortage. I ask every month \"have you paid the mortgage and the council tax\". To get told yes and to stop stressing about bills. I pay EVERYTHING else. Car, utilities, child care, shopping, kids clubs etc etc. \n\nSo my questions are - how was this allowed to go on for so long with no contact from the mortgage company? The only contact I've had from them was a text message asking to contact them last week with no details in it. We're nearing the end of our fixed term so presumed it was that. Then a phone call on Saturday. Nothing else. \n\nI have now taken over the payments again so I know they 100% get paid.  My husband has no answers to where this money has gone that he has clearly frittered away. That's a me problem though. \n\nIs there any way to protect myself in this mortgage? I feel I need to go back to self preservation until we either sort shit out or one of us leaves. \n\nAfter 16 years, not how I thought this would go. We were good. He is my person or so I thought but he lied about it for over a year and then tried to lie some more. We could have lost our house had I not over paid our mortgage each year by the 10% allowed. \n\nEdit: \nHe only pays the mortgage and council tax. I pay everything else which equates to much much more. We have split finances but it works for us. We both work full time. We have 3 children. \nI'm being asked about why I check he has paid his share. He got made redundant Sep 23 but got a new job straight away. The mortgage payment date needed changing to coinside to his new pay day. I physically wasn't allowed to change the date for it coming out of his account due to data protection but I could cancel the DD for him to set it back up. He \"kept forgetting\" and manually paying it. Which was a lie. ",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1281,
    "downs": 0,
    "created_utc": 1741948165.0,
    "media": null,
    "is_video": false,
    "num_comments": 550,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Mortgage non-payment issue with emotional content; seeks protection strategies but no steps.",
    "composite_score": 5.183463824608691
  },
  {
    "score": 1256,
    "title": "Just encountered a very sophisticated bank phishing scam...",
    "selftext": "This one was so good I just have to mention it as a potential warning as I could have very easily fallen for it. As a scam it was really well put together.\n\nJust got off the phone to a polite British male with a soft London accent who wanted to query two outgoing payments that had just been been flagged by the bank. The number incoming number was withheld.  \n\nHe provided \"verification\" by my telling me my email address, card number, my address, bank account type (business), sort and account numbers as evidence before sending me a verification text with a number from HSBCUKPASCD which he wanted me to read back to him so he could stop the payments going out.  \n\nWhen I said I didn't believe him because he had got the recipient of the second payment (said it was Amazon and it Worldremit ltd in the \"confirmation text\") and I was going to ring HSBC to confirm he got very abusive and put the phone down.  \n\nAs far as I could tell he was trying to make a payments to \"Worldremit ltd\" (a money transfer company) totalling about £4k and needed the verification codes to proceed.  He had obviously scraped my details off the web somewhere but needed the HSBCUKPASCD's to proceed.\n\nOn a negative note, I have just tried to phone someone at HSBC to report it and was unable to.\n\nEdit:  My card is now blocked via the app however I can't do anything else until Monday morning because after a couple of hours I found a huge international bank like HSBC can't afford to pay someone to deal with online fraud at the weekends.  I'm currently applying to other banks.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1256,
    "downs": 0,
    "created_utc": 1709390882.0,
    "media": null,
    "is_video": false,
    "num_comments": 217,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Describes a sophisticated bank phishing scam and offers lessons to help others avoid it.",
    "composite_score": 4.99606352448826
  },
  {
    "score": 1239,
    "title": "Going to prison - money questions?",
    "selftext": "I am getting sentenced in a week and am expecting a sentence of about 3 years so will probably do 15-18 months.\n\nI withdrew what I had left in my bank account when my last pay came into my account so I will have some cash to take with me.\n\nI have a loan of £2500 and £2000 on my credit card that I was paying £250 off a month so won't be able to pay either of these as will have no money coming in. Nothing I can do about those.\n\nI have a 2 year contract on a phone that I won't be able to pay either. There are a few other small monthly payments like gym, Netflix but I won't be using them.\n\nWhat will happen with what I owe when I am in prison - will the companies come after me for not paying? ",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 1239,
    "downs": 0,
    "created_utc": 1762098148.0,
    "media": null,
    "is_video": false,
    "num_comments": 305,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Question about debt consequences and enforcement while imprisoned; lacks steps or a model.",
    "composite_score": 5.011282398403025
  },
  {
    "score": 1223,
    "title": "Was overpaid exactly 6 years ago today",
    "selftext": "Six years ago I worked for a pub chain and they overpaid me by a lot - £2,000 overpayment to be precise.\n\nI raised it with the bar manager who was going to look into this but was later sacked. They took forever to replace him and by the time they did I moved into the first steps of my current career.\n\nI never touched a penny of it. Instead, I just moved around fixed term savings accounts and accumulate the interest. \n\nI got an alert to remind me the overpayment happened six years ago today - am I right in thinking the statute of limitations means the money is now mine or is it not as black and white as Google makes it out to be? ",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 1223,
    "downs": 0,
    "created_utc": 1730377250.0,
    "media": null,
    "is_video": false,
    "num_comments": 234,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Explores statute of limitations on an overpayment and discusses ownership/obligation with reasoning.",
    "composite_score": 5.000815348945411
  },
  {
    "score": 1219,
    "title": "We've just exchanged on a house at 31 + 35 and we did it with no parental help! Here's how.",
    "selftext": "My partner and I have been together for 3 years and today we exchanged on our first house! When we met we were both in debt (only small amounts, £500 overdraft for me and around 1.5k on credit card for him), have both taken pay cuts and I've started a v expensive MSc and still, in 3 years we've saved a £30k deposit and paid for a wedding.\n\nHowever, we've had to make sacrifices. Here's how we did it. \n\nHis wage is around £30k, mine is £14k-£19k (I have a zero our contract and sometimes only work 24 hours instead of 36 due to my course, I'm paid minimum wage) \n\n•Our wedding was only £6k and we did have some parents help with about half. We kept it to the registry office and just drinks with dinner by ourselves in the evening.\n\n•We've never been on holiday abroad. We camp or Airbnb and tend to do lots of Groupon hotel weekends rather than whole weeks off. \n\n•We cut each others hair. (Yep, even for our wedding, he cut my hair 😂) I guess I'm lucky that I don't really enjoy having my nails done or hair done so that does help! \n\n•We've always lived with housemates to keep the rent down and our savings high. Which at 31 and 35 is nuts but there's no other way we could have saved in Bristol with rent prices. \n\n•We live in Bristol and have not been able to buy here, we've gone towards Worcester to find something more affordable but also better for us long term (not a city, nicer community for family)\n\n•We meal plan meticulously, try &amp; only eat meat once or twice a week and buy meat from the reduced section to keep in the freezer to make a plan with later. We used to use OLIO a fair bit but it hasn't been so useful recently. We shop in ALDI. We freeze leftovers so we have meals on weeks where we need to do a smaller shop. \n\n•We have a nice coffee machine to have coffees at home rather than out. \n\n•We used the LISA and maxed that out over the 3 years. We were saving during lockdown so it helped. \n\n•We share 1 car (he works from home, again very lucky that it works for us) \n\n•We use Monzo pots to put small amounts aside each month for car payments, holidays, meals out so we do those things when we have the money there rather than the other way around. We know when we're having a tight month we could still treat ourselves if we wanted to rather than using the credit card guiltily. \n\n•We only ever buy things second hand - Vinted for clothes, Facebook marketplace for household items and we tend to sell things when we can too. I don't think we've ever been shopping together in a mall or shopping centre 😂\n\nWriting this out sounds like a slog but it hasn't been! We just track everything we spend. The frequent weekends means it feels like we get lots of holidays, and we eat out regularly, get takeaways regularly, go to the theatre or cinema often. But we have worked hard and I'm very proud of us and I would really like to go to Italy now 😂😂😂\n\nEdit: we bought a house for £195k - deposit was 30k so we could still have some breathing room to live/save/overpay if we want.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 1219,
    "downs": 0,
    "created_utc": 1681803421.0,
    "media": null,
    "is_video": false,
    "num_comments": 642,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.74,
    "category_rationale": "Enumerated actions/strategies used to save for a house deposit; a curated list of items.",
    "composite_score": 5.097965317136859
  },
  {
    "score": 1220,
    "title": "Letter from bank declaring my wife is dead and they are cancelling her cards etc ... but she's alive.",
    "selftext": "As the title says, and not an entry for /nosleep. The letter, dated 8 days ago, is legitimate, ive spoken to them and they have her marked on the system as dead. \nThey're utterly confused as there's a date of death but no proof. The letter also had the full address correct but the wrong postcode completely (100miles away). We have to now go to a branch to prove she's alive. \n\nMy question is, will this date of death be passed on to other banks and will she have issues with her other accounts, mortgage renewal and credit score. They seem unsure and weren't particularly useful on the phone.\n\nEdit: Can confirm that wife is indeed alive. Also, the post code on the letter was wrong so through the power of Internet we have found who we think is the poor soul who actually died, and yes, same name and age as my wife.\n\nEdit 2: this person's husbands name was also the same as mine. Too weird but would appear to be an admin balls up.",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1220,
    "downs": 0,
    "created_utc": 1682683976.0,
    "media": null,
    "is_video": false,
    "num_comments": 215,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asks about potential consequences of an admin error in a death notice; not a how-to.",
    "composite_score": 4.988942539520348
  },
  {
    "score": 1204,
    "title": "AMA: I run Damien Talks Money, one of the largest personal finance YouTube channels in the UK. Ask me anything!",
    "selftext": "\nI [often lurk](https://www.reddit.com/r/UKPersonalFinance/comments/1gloara/comment/m00z9bl/) in this community and I love an AMA so I’m excited to answer your questions today.\n\nA bit about me:\n\nI am the guy behind [Damien Talks Money](https://www.youtube.com/@DamienTalksMoney) which has \\~350,000 subscribers on YouTube, the [Making Money podcast](https://www.youtube.com/@MakingMoneyPodcast) with over 8 million total listens/watches, and the website [Financial Interest](https://financialinterest.com/) which has over 63,000 newsletter subscribers.\n\nI try to create UK-focused content that helps people in a memorable way.\n\nThank you to the mods for letting me do this. [Proof this is me](https://www.youtube.com/post/UgkxsP9rBCvCk2ds1KiMnNwfo3PW7bVzcucm)\n\nAsk me anything about personal finance, investing, YouTube, life, whatever you want! \n\n*Please note I can’t answer anything that could be considered financial advice as I am not an adviser I am just a random guy on the internet.*\n\nI’ll be here all day answering, what would you like to know?\n\nEdit: The AMA is now closed. Thanks everyone for all your questions, I’ll continue replying over the next few days and hopefully get to as many as possible.\n",
    "subreddit": "UKPersonalFinance",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 1204,
    "downs": 0,
    "created_utc": 1761900908.0,
    "media": null,
    "is_video": false,
    "num_comments": 989,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.68,
    "category_rationale": "Announcement/AMA invitation from a financial creator; not a how-to or guide.",
    "composite_score": 5.231304644209662
  }
]