[
  {
    "score": 41,
    "title": "Me + friends made an app that makes you say out loud ‘I want to waste my time’ before opening TikTok - NEED UX designers opinion",
    "selftext": "Hey folks,\n\nMe and a couple of friends (one’s a game designer, I’m a UX/UI designer, and another runs a marketing agency) have been struggling a lot with phone addiction. You know the drill — “just 5 mins” on TikTok and suddenly it’s 1am.\n\nWe couldn’t find an app blocker that actually worked for us, so we built a small one ourselves. The twist: before opening a distracting app, you literally have to say out loud “I want to waste my time” three times. 😅\n\nIt sounds kind of dumb, but that tiny moment of friction really makes you stop and think. Instead of a hard block, it’s more about forcing a bit of reflection.\n\nSince I’m more on the UX side, I’d love feedback from this community:\n\nDo you think adding this kind of friction is a good UX pattern, or is it too gimmicky?\n\nWould you personally find this helpful, or just annoying?\n\nAny other mechanics you’d suggest to balance “blocking” vs “reflection”?\n\nWe’ve put up a simple waitlist page if anyone’s curious to try it out: [https://get-space.app/](https://get-space.app/)",
    "subreddit": "UserExperienceDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1759436481.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/a13fnomobrsf1/DASH_1080.mp4?source=fallback",
        "has_audio": true,
        "height": 1920,
        "width": 1080,
        "scrubber_media_url": "https://v.redd.it/a13fnomobrsf1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/a13fnomobrsf1/DASHPlaylist.mpd?a=1770354026%2CZThiM2Y3NDExM2QyZTAzMGI2ZDFjZmNmZDRkMWM3MGU4YTc3OWZlMjY2NWViYzkwNTI3NjI5MTI2YWM5MDA0Yg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 38,
        "hls_url": "https://v.redd.it/a13fnomobrsf1/HLSPlaylist.m3u8?a=1770354026%2CYWUzMGUxYTIzMzY4NDhlMTM2YTExMTNkM2JiNzgzMjU0ZmY4NTg4NDcxZGM2M2M3MjA5YTU3YjEyMGIwNmUwZA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Centers on a UX concept (friction vs reflection) and offers reasoning about its potential value.",
    "composite_score": 2.9152209665513187
  },
  {
    "score": 27,
    "title": "Performative UX should be gone",
    "selftext": "I watched a couple of UX presentation advice videos on YouTube. The presenters, who all work at big corporations, claimed that they got hired because of their storytelling skills. I patiently watched them, but I don’t know… it was rather disappointing. Despite presenting mediocre solutions, their work felt quite performative and lacking in substance.\n\nOne of the reasons the UX industry has become so dysfunctional might be this kind of performative work culture centered around storytelling. The ideas they showed weren’t particularly compelling or innovative, but yes — they presented them fairly well, with platitudes and polished delivery.\n\nUX should focus more on technical skills rather than soft skills. People often claim that UX is half art and half science, but in reality, it’s entrenched in stakeholder management, getting buy-in, and design advocacy. These dynamics often shift power and decision-making control to businesspeople and engineers, pushing designers into a more peripheral role.\n\nThe UX industry should stop overemphasizing storytelling and stakeholder management. When everyone talks about creativity and problem-solving, shouldn’t we also be finding new opportunities for a better future?",
    "subreddit": "UserExperienceDesign",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1752273236.0,
    "media": null,
    "is_video": false,
    "num_comments": 5,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Offers an analytical critique of performative UX practices and proposes a shift in focus.",
    "composite_score": 2.541233656534041
  },
  {
    "score": 28,
    "title": "In 2021, it took me 10 months to get a new job, here's how I did it.",
    "selftext": " 1. Updated portfolio and resume.\n\n2. Starting applying.\n\n3. Kept failing over and over again.\n\n4. Asked my friends and co-workers for help.\n\n5. I Started recording all my interviews to review them. This helped me in areas I was struggling with. Download OBS studio (it's free!)\n\n6. CBD - Yes. It helped me destress, lower my anxiety and stay calm.\n\n7. I still kept interviewing and didn't give up.\n\n8. Instead of presenting my portfolio from my website I've decided to present my recent work via Adobe XD. This helped the hiring managers to see my design process.\n\n9. Started learning new tools (Figma, Shopify, Webflow, and data tools)\n\n10. GOT IT! :) In July 2021 I went from below $60k sal to $120k.\n\nThat year was one of the hardest years of my life. I wasn't a confident designer and attending interviews was such a weakness for me. During the interviews, I was going against jr designer with a few yrs of exp and there I was with over 10yrs of exp. I felt ashamed and extremely embarrassed. I had sleepless nights - At the same time, I was in a toxic work environment. The best part was during covid everyone had to work from home and I used that to my advantage by interviewing from home.\n\nI know, I know during hard times people will tell you \"there's always light at the end of the tunnel\" but I couldn't believe it nor see it. But, I'm telling you it's true. Like I always say. **Never downgrade.**\n\nAll the best, really hope my personal feedback helps at least one of you during these difficult times of layoffs.",
    "subreddit": "UserExperienceDesign",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1677016196.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.92,
    "category_rationale": "Contains a clear, numbered sequence of actions to land a job, i.e., a how-to playbook.",
    "composite_score": 2.5618830000669655
  },
  {
    "score": 26,
    "title": "I received this beautifully descriptive note on my car",
    "selftext": "After going to a concert in Seattle where parking tends to stress the local neighborhood, I came back to my car to see this under the windshield. I admit, my parking was close.  We checked and the ramp was well open, but I don't claim the author of this note was wrong, I'm not 100% sure of the setback rules. But, I was really struck by the beauty and tone of the note. Three colors and font weights. Very well laid out. The editorial tone was factual and non-judgmental. I appreciate the message, thank you.",
    "subreddit": "UserExperienceDesign",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1749827217.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "A short observational anecdote with appreciation; lacks actionable guidance or argument.",
    "composite_score": 2.4199243915188187
  },
  {
    "score": 26,
    "title": "Spotify rant ",
    "selftext": "I joined Spotify 10 years ago. It introduced me to new and interesting bands, I did a whole presentation on their algorithms and how they introduce new music in between songs you already like, and, at the time, used P2P connections for better downloads in the 3G days.\n\nThey’ve ruined all of that and I’m ready to switch now. \n\nThe new interface is confusing. I’m swiping through pages and pages of artists and playlists, completely lost. They took away the simple one button to add a song to my Liked playlist and made it a multi click task. They brought it back in some views.\n\nThe worst is they took away the main reason I signed up: instead of introducing new songs I might like, they play the same top 20 songs over and over. All the careful thought is gone and for what? Peddling Joe Rogan podcasts that I will never listen to, ever?\n\nEdit: It’s an interesting case where both the UI and the UX are different and distinct, and had different roles. Spotify managed to screw up BOTH.\n\nThe UI is shit, because they added all these new features such as podcasts and audiobooks. It’s confusing to find what I want.\n\nThe UX is shit because I mainly listen to Spotify in the car or through headphones while commuting. I depended on the algorithm to serve up a good experience without having to keep looking at my device. By changing the algorithm, it plays the same songs over and over, so now I HAVE to interact with the interface to change it.\n\nI’m testing Apple Music (I miss the old iTunes) and Google Music now. But none can match Old Spotify.\n\nIs everything in tech trending towards a shittier experience?  #[enshittification](https://en.wikipedia.org/wiki/Enshittification) strikes again.\n\n",
    "subreddit": "UserExperienceDesign",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 26,
    "downs": 0,
    "created_utc": 1723298038.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Emotional vent about Spotify's changes with strong judgments and critique.",
    "composite_score": 2.7209543871828
  },
  {
    "score": 22,
    "title": "Onboarding length should match your app category, not best practices",
    "selftext": "Been analyzing onboarding flows across different app types. Noticed something interesting: apps with 30+ onboarding steps are almost exclusively in health and fitness.\n\nWhy make users answer so many questions before using the app? Because these apps need personalization data to deliver value. A workout app can't recommend exercises without knowing your fitness level. A nutrition app can't suggest meals without dietary preferences.\n\nThe pattern that works: show value proposition first, then collect data. Cal AI does this well- shows what it can do, then asks for information to personalize.\n\nBut established apps like Yazio only shows social proof then skip straight to data collection. They can do this because users already trust and understand the value.\n\nWhile browsing Screensdesign, found that 90% of apps with extensive onboarding are health/fitness related. [Noom](https://screensdesign.com/apps/noom-weight-loss-food-tracker) has over 100 steps. That would kill most apps, but for personalized health recommendations, users tolerate it.\n\nThe lesson is that long onboarding works when users understand that answering questions directly improves their experience. Otherwise, every extra step is just friction. New apps in the same space can't assume that trust yet.\n\nContext determines whether data collection is valuable setup or pointless barrier. Know your category and trust level before deciding onboarding length.",
    "subreddit": "UserExperienceDesign",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 22,
    "downs": 0,
    "created_utc": 1758982661.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.77,
    "category_rationale": "Provides analysis and guidelines on onboarding length and when data collection helps, i.e., explanatory insight.",
    "composite_score": 2.4127578316815743
  }
]