[
  {
    "score": 1054,
    "title": "Finch Care, can you stop using the hiring process to collect free design work and ideas?",
    "selftext": "# For details about my interview experience and community discussions, 👉 [check out this post](https://www.reddit.com/r/UXDesign/comments/1kpmvgj/fake_hiring_idea_mining_my_experience_with_finchs/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) 👈\n\n\n\n🔴 Finch product is about daily journaling and habit tracking. The design challenge? Create a habit tracker app, specifically something creative, not generic. That’s already a RED FLAG, since it directly overlaps with Finch actual product.\n\n🔴 The challenge required high-fidelity designs with full user flow, all within 7 days. That’s way beyond what’s reasonable for a “test”, and candidates aren’t even paid for it. That’s unfair, and honestly, possibly illegal.\n\n🔴 After submitting, there’s a 1-hour deep dive interview just to go over the design challenge. But I was asked a bunch of weird, very specific questions, the kind you’d only ask if you already had a live product for a long time and wanted to optimize it to fit some market changes. Not something you’d ask about a design exercise.\n\n# Here’s some additional context I gathered from the comments on my previous post:\n\n\n\n🔴 Another designer shared: “I was rejected after the onsite where they absolutely mined me for ideas. The CEO stayed on a call with me for like 45 minutes and I thought we were vibing — guess not.”\n\nThey felt the team seems unsure about their next direction. Even though Finch benefited from a wave of early success, it’s now facing the growing pains of shifting market demands.\n\n🔴 An applicant for the Art Director position reached out to me, saying they felt there were too many unreasonable tests and discussions during the interview. Even big-name companies don’t have this many steps. Especially all the deep dives. It really felt like they were fishing for ideas. The entire interview loop was basically a UX interview, just with a few things reworded to sound art-related.\n\nAlso, the HR claimed upfront that the position offers a six-figure salary, which struck them as odd: How could a small company afford that? Coincidentally, when I talked to HR, they also mentioned a salary range that was even higher than what I got at my previous company, Cisco. I thought that was unbelievable too, or maybe it’s just a hook.\n\n🔴 Another designer told me they interviewed last year. After completing the design challenge, they moved on to a 1-hour deep dive, then got rejected. Back then, finch interview process was different: Design Challenge → 1-hour deep dive → Portfolio review (which they never got to because of the rejection).\n\nMy experience was: Portfolio review → Design Challenge → 1-hour deep dive (then rejection). It looks like finch has changed the order. My guess is: if they ask candidates to do a tough design challenge right after talking with HR, most would say no or raise concerns (and many actually did). The conversion rate would be too low. So they moved the portfolio review before the design challenge, creating a false sense of approval to increase the chances that candidates accept the design challenge.\n\n🔴 A Finch user told me that Finch game-like changes to the product once caused huge controversy, but all those discussions were deleted from major social media platforms. Even posts pointing out small bugs got removed. Also, they noticed a lot of weird flows in the product and suspect it might be because Finch referenced or borrowed some free UX work from the hiring process.\n\n🔴 My cousin used to handle TikTok’s overseas ads, and she was really impressed by Finch because Finch spent a ton on marketing there and loved working with influencers for videos. She said Finch must be rolling in cash to support such big expenses.\n\nBut judging by all the weird stuff happening in Finch hiring process, maybe Finch’s finances aren’t as great as they seem, who knows? Still, if Finch do have the money, why not pay the candidates who do their design challenges? Especially since your challenges are so demanding, interviewees have every right to ask for compensation! \n\n🔴 A designer told me they applied to a role at Finch back in Feb 2024, and were surprised it’s still open over a year later. Based on LinkedIn, the latest design hires joined in April, May, and October 2024. So far in 2025, no new design hires. Everyone may interpret this differently, so I’ll leave it at that.  \n  \nand more.\n\nIf you're job hunting and considering applying to Finch, or if you're already in their interview process, I hope this post helps you out.",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1054,
    "downs": 0,
    "created_utc": 1747770352.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional critique of unethical hiring practices and idea mining in interviews.",
    "composite_score": 4.778948802212824
  },
  {
    "score": 1051,
    "title": "Links to Twitter and X.com domains are now banned",
    "selftext": "Thanks to everyone who contributed to the [poll and discussion yesterday about banning links to Twitter](https://www.reddit.com/r/UXDesign/comments/1i7g316/should_we_ban_links_from_the_website_formerly/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button). Based on your feedback I have set up automod to remove links to that site. \n\nBecause automod is a little weird sometimes, please make a report if you see any and we'll troubleshoot.\n\nIf you don't agree with this policy here are the instructions for how to leave the sub:\n\nhttps://support.reddithelp.com/hc/en-us/articles/28621027395220-How-to-join-or-leave-a-community",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 1051,
    "downs": 0,
    "created_utc": 1737660999.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Policy update/announcement about banning links; informational in nature.",
    "composite_score": 4.615105726809664
  },
  {
    "score": 1044,
    "title": "can’t be just me lol",
    "selftext": "Every time when we start a project, I spend hours scrolling through fontshare, google fonts, pangram pangram, bla bla, and somehow end up back on Inter every single time. like its clean, readable, no nonsense. dashboards? inter. apps? inter. portfolio site? inter.\n\nShoutout tho to Plus Jakarta Sans (so good when u want that cool vibe) and some other cool free ones from fontshare too. but idk, inter just feels like the default cheat code for UI. Also accessibility wise, it just works, super legible on all screens.\n\nIs it just me? what’s your go-to font and why is it inter? or are you secretly using comic sans ?",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1044,
    "downs": 0,
    "created_utc": 1757397810.0,
    "media": null,
    "is_video": false,
    "num_comments": 104,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Casual discussion about fonts with a question, no actionable content.",
    "composite_score": 4.772210939982042
  },
  {
    "score": 930,
    "title": "I designed an F1 strategy display in 2001. They're still using it today.",
    "selftext": "Back in 2001, while working as Race Strategy Analyst with McLaren F1, I designed a tool we called McLaren Track Viewer — a circular display showing where all the cars were on track in terms of time gaps, not spatial layout.\n\nNo one asked for it. The engineers were using tables of lap times to 3 decimal places. But I was a psychologist doing mathematical modelling, and I wanted something cognitively ergonomic: a display that supported decision-making and ease of comprehension rather than precision.\n\nSo I prototyped it, people liked it, then refined it to a polish. \n\nIt stuck. I remember the UK TV coverage did a little 3 minute spot about it when it was first noticed in the following year. And to my surprise, watching the Belgian Grand Prix last week, I saw what looks like almost exactly the same design still in use today on Oscar Piastri’s race engineer’s screen — 24 years later!\n\nSame black background, circular format, colour-coded drivers, pit exit projections… It’s all still there, in the same colours too.\n\nIn a comment I'll add a link to my LinkedIn post, which includes more detail and has several interesting comments from others in the F1 industry...  \n",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 930,
    "downs": 0,
    "created_utc": 1754035259.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.88,
    "category_rationale": "Shares design history and rationale about cognitive ergonomics and enduring use.",
    "composite_score": 4.5735876157817374
  },
  {
    "score": 871,
    "title": "10 hard truths about UX",
    "selftext": "Been in UX for ~15 years now. Worked everywhere from startups to global design firms to tech (where I've spent the last 8 years). I see a lot of posts about similar things, and I wanted to share some truths that I've come to know:\n\n1. **There are no silver bullets**. There's no one magic right way to get stakeholders to care about your work—or to get you in the room. There's nothing unique or special that goes into a case study or folio. And there's no simple fix for any design problem. All these things take hard work, grit, patience and humility.\n\n2. **Being nice, easy to work with and reliable is more important than genius**. A kind and competent designer &gt; curmudgeonly genius. This means you should never pick a fight with a senior stakeholder or partner over what you think is right. They won't see it as passion; they'll see it as arrogance. Besides, if your work is brilliant but you're a grump, you probably won't get promoted—but if you deliver on time and are easy to work with (even if the work isn't mind-blowing), you'll rise fast. So—get the work done, and don't try to re-steer the ship.\n\n3. **Being a facilitator is more important than being an ideator**. Being able to bring people into the process, get their ideas, and guide a team to the best solution—whether it's your idea or not—is way more important than anything else. Great directors, managers and design leaders index on this rather than going into closed rooms and figuring it out.\n\n4. **Now may not be the time for your big idea**. We've all been in positions where we've pitched an idea only for someone to shoot it down. I get it, it's frustrating—and it's hard seeing a team move forward with a subpar solution. But be patient. Bide your time. Don't die on a hill trying to make people care in that moment. I guarantee that in 3, 6 or 12 months your idea will be needed—and it'll be ready to go because you'd already formulated it.\n\n5. **We're digital brick layers—not innovators**. A lot of us came into this field because we loved the idea of *making*. But in reality, we're handed a stack of bricks (a design system) and asked to construct something (a product) that's already been planned (by a product manager). Sure, we problem solve along the way, but we're not here to redefine business models. We're here to make the things within the appropriate timeframe.\n\n6. **Relax**. Careers are long, and it's just a job. I know you may think being laid off or getting a bad performance review is the end. But it's not. It never is. Process it, learn from it, and get back to work. It'll be fine.\n\n7. **Be humble and don't overthink**. Sometimes the simplest, most obvious solution is the best one. And sometimes that arrogant PM or executive will have the best answer. A huge difference between junior and senior is recognizing this.\n\n8. **See the forest for the trees**. Sometimes we get irked when we're told we can't build something, but we need to approach these moments with curiosity. Assume the best: *Maybe there's some new plan from the executive team that I don't know about?* And be curious. Get to know stakeholders, understand their goals and aspirations, and learn about the restrictions that frustrate them.\n\n9. **There's no such thing as The Design Process**. Every organization is different. Every product has its own quirks. Every one of us thinks about things differently. Be flexible, curious, and figure out how to work in all sorts of different environments (yes, that means making things without research sometimes!). Sure, there are commonalities, but the skill is in being flexible and figuring things out as you go—especially when the expected process breaks down (which it usually does).\n\n10. **The world sucks**. Design exercises are unethical, but in this market we have no choice but to do them. Layoffs are hard, but most of us will be there at some point. We're under-appreciated, but what's new? Bootcamps are basically con jobs, and even the glitziest folio may not get you an interview.",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 871,
    "downs": 0,
    "created_utc": 1698274470.0,
    "media": null,
    "is_video": false,
    "num_comments": 103,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.94,
    "category_rationale": "Enumerated list presented as 10 hard truths about UX.",
    "composite_score": 4.684033154581957
  },
  {
    "score": 866,
    "title": "Why I'm NOT Leaving UX",
    "selftext": "1.  I get paid which helps me buy food and a place to live plus some extras.\n\n2. Overall it's not a monotonous job and despite some of the challenges, I enjoy it\n\n3. I can do this job in almost any industry and almost anywhere in the US and other countries without issue\n\n4. People find it to be an interesting job in conversations about career paths\n\n4. Sometimes it's really fun\n\n5. I like project-based work, seeing a project end gives me a deep sense of accomplishment\n\n6. Fellow UX Designers in general are a pretty cool crowd and fun to chill with \n\n7. I get to work remotely\n\n8. Most companies that hire UX designers have pretty modern working atmospheres that are very flexible with your schedule.\n\n9. There's always more to learn about the job\n\n10. I get to be in a largely forward-thinking job that so far seems like it will be around for a long time ",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 866,
    "downs": 0,
    "created_utc": 1720716370.0,
    "media": null,
    "is_video": false,
    "num_comments": 111,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.88,
    "category_rationale": "Enumerated list of reasons explaining why the author stays in UX.",
    "composite_score": 4.690128108811301
  },
  {
    "score": 801,
    "title": "Designers who hand off chaos to devs… do you sleep well at night?",
    "selftext": "Not tryna start beef (ok maybe just a lil), but fr, are you designing with devs in mind.... or just vibing and hoping they figure it out?\n\nLike... earlier in my career,  I used to be that person putting 8 different auto-layouts inside each other with max corner radius and gradient shadows, looking like a dribble award-winning crime scene. Then the dev asks “how does this animate?” and I’m like “oh um it just… kinda vibes into place?”\n\nNow I get it, design isnt just about how it looks, its about how the poor soul building it is gonna survive.\n\nDo you actually think of dev handoff while designing? Or do you just design what feels good and pray they don't quit?",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 801,
    "downs": 0,
    "created_utc": 1753251031.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Expressive critique of designers’ handoff to developers and emphasis on accountability.",
    "composite_score": 4.636991965582938
  },
  {
    "score": 754,
    "title": "Finally got a job!",
    "selftext": "After 4 months of looking, 312 applications, 98 rejections, 204 no responses, 10 first-round interviews, 6 second rounds, 3 third rounds, and 1 offer, I finally got a job!\n\nThere’s a lot of doom and gloom on here lately, and I know people are finding it really tough to land something right now. I was one of them until a few days ago. The process is unfair and disheartening, and we’re really at the mercy of companies with their lengthy and often ridiculous hiring practices.\n\nIn my journey to find a job, I feel like I’ve done it all: presentations, whiteboard challenges, design assignments (which come dangerously close to free labor), and panel reviews. It’s a grueling process with very little reward along the way. Every time I thought I was close, I got knocked back, again and again. By the end, even though I gave my all in interviews, I went in expecting not to make it through to the next round.\n\nThis post isn’t a brag that I finally found a job—it's more for those who are close to giving up. It’s still possible. Don’t give up. There’s a job out there for everyone. It just takes thick skin and a lot of rejection, but it can happen.\n\nMy advice? Keep applying, look at remote roles, exaggerate your skills and experience, but don’t lie. Apply to everything (within reason), lower your salary expectations if needed—because something is better than nothing—and you can always move on to something better later.\n\nI hope someone finds this helpful",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 754,
    "downs": 0,
    "created_utc": 1727376097.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Personal success story intertwined with critique of hiring processes and unpaid work.",
    "composite_score": 4.569260497274409
  },
  {
    "score": 712,
    "title": "FAANG is so overrated its a joke. Stop worshipping them.",
    "selftext": "Do you guys actually look at a Gmail or Facebook or Amazon screen online and think “wow that’s good design”? \n\nWhat’s remarkable about these companies are that they are huge corporations with huge user bases and a lot of power. If that impresses you, I get it, but only because of the paycheck you’ll get &amp; it looking good on your resume. \n\nInnovation and corporations that big DO NOT MIX. They are opposites. They are INVESTED in the system they helped to build and actually work against innovation by cannibalizing any competition.\n\nAnd their products do not make the world a better place - they make it worse. Too much power in the hands of too few — too few who also are too full of themselves to innovate.\n\nThey operate like any other big corporation. And have the same job security too (none).\n\nI get recruited by one of them from time to time, but I’m just not interested in working for already established huge products, and especially not THOSE particular products.\n\n",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 712,
    "downs": 0,
    "created_utc": 1728576336.0,
    "media": null,
    "is_video": false,
    "num_comments": 177,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Opinion piece criticizing FAANGs and worship of big corporations.",
    "composite_score": 4.675799531006312
  },
  {
    "score": 701,
    "title": "Why I’m leaving UX design",
    "selftext": "I have 11 years of experience and am currently a senior level ux designer at a FAANG company. I worked at 2 FANNGs most recently, smaller digital agencies, a large marketing/advertising agency and a medium size product company. This is why I am sick of being a UX designer:\n\n1. Constantly getting unsolicited, uninformed design feedback on WIP Figma files from stakeholders and having to explain countless times the design process and the UXR testing we rely on to help guide ux decisions, despite having processes in place for more formal design reviews that will be more informed and productive.\n\nMore generally, the constant feeling that everyone thinks they can do my job better than I can. \n\n2. Leadership offering up weak design solutions on the fly without really thinking about the user goals and journeys. \n\n3. Having to constantly wear multiple hats, fulfilling aspects of roles namely Product Management and Program Management due to the natural overlap with these areas, but no clear demarcation between what I’m responsible for vs them. Role ambiguity to the max. \n\n4. Only about 10-20% of my time is spent actually designing. The rest is presenting decks and mocks for deck updates, facilitating alignment, evangelizing concepts and vision work, negotiating product scope and launch milestones, working on cross team requests, bugs, the list goes on. A lot of the work is tedious and not fulfilling. \n\n5. Design leaders who are so incredibly out of touch and provide useless and counter-productive feedback.\n\n6. Lack of career upward mobility and the pressure to be more “visible” and “above and beyond” with work so that I can build a case for promo and essentially fight for it on my own, while already having roles and responsibilities that take 50-60hrs a week to fulfill. \n\n7. Eng constantly saying design is “blocking” but once they get the approved design specs they take their sweet time and over-scope features saying they take x% more time to build than they actually do. \n\n8. Product managers who don’t know how to lead teams, communicate effectively and have  an ego the size of a bus not to mention massive control issues. Fun example: I had a PM who would use UXR findings as his weapon of choice when it suits HIS agenda, but when UX pushes for something different based on UXR results, he fights back saying it's a lower priority. Honestly he really sucks working with, and is the bane of my UX existence.\n\n\nSo yeah, I’m done lol. Moving on and out of the role and the tech industry. Super done. \n\n\nEdit #1: Thank you all so much for the responses.. seriously.\n\nA lot of you have asked what my next plans are. To be honest, I don’t really have one. I plan to take a career break and try to heal my mental health and reassess from there. I am working through some career assessments to see what else could be a fit for me. Ideally I want to do something that makes a positive impact on the world! Will keep you all updated. \n\n",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 701,
    "downs": 0,
    "created_utc": 1720703224.0,
    "media": null,
    "is_video": false,
    "num_comments": 444,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Long-form vent about UX design career frustrations and decision to leave.",
    "composite_score": 4.8830171176202715
  },
  {
    "score": 701,
    "title": "14 months, 421 applications, 1 offer",
    "selftext": "So, I finally landed a new role after 14 months of research.\n\nI made this chart to visualize what that actually looked like and honestly it blew my mind... Made me both sad for myself but also for the industry. \n\n* 421 applications and many many cover letters. \n* 103 rejections, often a generic email written by AI. \n* 299 companies never came back to me at all.\n\nAnd from that, a handful of interviews, some case studies, design challenges or whiteboard sessions. **One single offer at the end** (could have potentially be a couple more but was happy with the first offer).  \n,  \nSometimes I dropped out because the red flags were very clear (or the “design challenge” was obvious free work). Sometimes I just couldn’t see myself in the culture. But most of the time, I just didn’t hear back...\n\nIf you’ve been job hunting lately, you know how weirdly personal this can feel. You start questioning everything, your portfolio (oh boy I redesigned the sh\\*\\* of my portfolio several times), your skills, your personality, etc.   \nThen you remember this isn’t about you being \"bad\" but how bad and broken the market is right now.\n\nFor context: I’m a lead product designer with 12 years of experience in SaaS and startups. Design strategy, craft, mentoring, design systems, all the good stuff. And it still took me over a year to get a solid “yes.”\n\nSo if you’re in that same spot, burnt out, ghosted, doubting yourself, please remember: it's not just you. The pipeline is rough right now, even for strong designers. The best thing you can do is protect your energy, take breaks, refine your story, and drop out when something feels off.",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 701,
    "downs": 0,
    "created_utc": 1760447673.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.68,
    "category_rationale": "Personal career story with market critique and takeaways; main value from insight that market is rough and advice to protect energy.",
    "composite_score": 4.588837112129805
  },
  {
    "score": 703,
    "title": "Why do people act like UX Design is some type of sacred career?",
    "selftext": "A lot of times I get a holier than thou vibe from this forum. \n\nPeople are acting like ux design is some type of sacred ritual that must be revered. \n\nLike calm down Janice, you change the color of buttons on an e-commerce website that sells made in China E-Waste.\n\nI just get the vibe that some people view themselves as having jobs that are on par with doctors in terms of importance. \n\nI get the feeling that some ux designers make this job 10 times more complicated than it really needs to be.\n\nIdk this is just my shitpost for the day.\n\nWhat are your thoughts? Do people take this career a bit too seriously?",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 703,
    "downs": 0,
    "created_utc": 1742567733.0,
    "media": null,
    "is_video": false,
    "num_comments": 201,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Vent/critique about UX culture with humorous tone; predominantly opinionated rant about sacredness.",
    "composite_score": 4.652748343865424
  },
  {
    "score": 655,
    "title": "Universal cheatsheet how to start in UX/UI",
    "selftext": "Hi Guys! I am a lead UX/UI designer in a well-known agency, just created a cheatsheet for some of our interns and thought maybe someone may benefit from it as well:Three main activities that will help you learn faster in general: theory, tools/practice, taste (references, understanding what is good and what is not)\n\n**Theory**: Read and summarise ( actually write like in school, create mindmaps/essays on the following topics):\n\n1. History of web design/evolution\n2. Visual hierarchy\n3. Typography (graph and web)\n4. Grid (layout) + composition\n5. 8-point/4-point/5-point system.\n6. UX patterns (!): [https://lawsofux.com/](https://lawsofux.com/), [https://www.nngroup.com/articles/ten-usability-heuristics/](https://www.nngroup.com/articles/ten-usability-heuristics/) etc. Super Important to learn patterns, so write/search as much as possible on this one.\n7. Design patterns to understand in general: Dieter Rams, Donald Norman\n8. Mobile/adaptive: difference between IOS and Android, mobile-first\n9. Design library/ui kit/ what it is, why it is required?\n10. Successful handoff to the dev team, UX review.\n11. Branding/brand research: what it is and how it affects web/business/UX\n12. UX research: when it is required, when not - flow personas-CJM-job stories-wireframes-visuals-usability testing, a/b testing (other conversion methods)\n13. JOB STORIES - why it is essential for creating an awesome product.\n14. Different sites and their construction: e-com/B2B product/landing page/social media etc\n15. Why/how UX writing/ text copies/ labels are essential to UX in general?\n16. Difference between patterns Web2 and Web3?\n17. AI, chat GPT, mid-journey, and its impact on UX/UI and vice versa.\n\n*Optional*:\n\n1. Product work, agile framework, and role of the designer in a team\n\n**Tools/practice**:\n\n1. Figma, webflow, Adobe, and 3D tools like Cinema 4D\n2. Do challenges/ each day find little things to do inside of those tools until you feel at home there\n3. Imaginary cases, find an actual problem in the world, and create a job story for it for example: when I am moving countries, I want to make friends locally faster, so I don’t feel alone. Create an interface solution that would solve this problem.\n4. Don’t be afraid to explore.\n5. Wireframes: [https://platforma.ws/figma/](https://platforma.ws/figma/)\n6. Practice for progress, practice to show up, not to succeed. Make it a habit, like a GYM. Show up every day, every two days, in tho months you will see the difference.\n7. Domestika.org has a nice, cheap course can find awesome cases there, but I still use it for myself.\n8. Find a mentor, and review your work.\n\n**Taste (references)**:\n\n1. Similar to practice. Make a habit to review the best work people do online everyday. Show up.\n2. Behance (curated filter), Awwwards, Readymag examples, Nicely Done, Mobbin, godly.website, Arena, Pinterest, Instagram, and Saas landing page examples.\n3. Dribbble - nice to start, but be careful there are a lot of cases, that seems good, but in reality, do not follow UX patterns and cannot withstand even an easy flow.\n4. Another 50 billion awesome websites online that curate cool work.\n\nGood luck!\n\nP.S. The tools mentioned here are just the tools we use on a daily basis and we see demand for them. Obviously, if you are a product designer and you prototype user flows you are unlikely to need 3D skills. If on another hand you are looking to do striking visual concepts and landings, you may find 3D tools very useful (for animation as well). Also remember that modeling is not required it is a separate job, these days you can find 3D models online for any item. What is important is perhaps very easy things like a bottle/bubbles etc and scene lighting! Also, I can speak only for Cinema, perhaps there are easier tools out there. ",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 655,
    "downs": 0,
    "created_utc": 1678296009.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Universal cheatsheet presents multiple topics/tools to learn, a curated list of items to start with.",
    "composite_score": 4.373630177618755
  },
  {
    "score": 650,
    "title": "Just finished reviewing new grad portfolios and have advice",
    "selftext": "I work in big tech and recently finished reviewing portfolios for early career new college grads! I wanted to share some general tips from my experience. Please note that all companies are different and hiring might differ wildly so this is just one person’s advice from one company. \n\n* I passed 60% of portfolios\n* We are required to fill out a rubric that grades a candidate on several criteria. \n* I did not source candidates, only portfolio review. \n\nBig takeaways:\n* I always review the first case study in your portfolio thoroughly. Put the one you want me to review first. \n* One great case study is better than 4 half-complete ones! Only if your first case study does not demonstrate all the competencies I am looking for, then I will continue reviewing the rest of your portfolio’s case studies. That means a really strong first case study is more important than all of them being complete. \n* Demonstrating feedback collection and iteration in your case study are extremely important, and often missing from case studies. It’s rare that your first solution is perfect, and we really do need to see how you incorporate feedback in your process.\n* Basic visual design skills are table stakes. Consistent padding, color contrast, correct semantic color usage, consistent visual treatment of elements, passable copy. Not looking for perfection, but basic visual eye and UX understanding are really hard and time consuming to train for and so your work needs to pass a basic usability bar in today’s market. \n* Our criteria specifically specified very little to no typos. Personally I wouldn’t have docked off points for that, but it was part of our standardized criteria. Please double check your work. \n\nCandidates that got a strong recommendation:\n* Clearly iterated meaningfully from feedback. I can tell it wasn’t artificial iteration or feedback. \n* Identified a believable user problem and solved it. \n* Showed prototyping ability. \n* Demonstrated familiarity with our design stack (eg Figma or FigJam). \n* Shipped work in a multidisciplinary team environment (could be a school club too) but you definitely get bonus points if you show that you can work well with non-designers and incorporate their feedback into your design process. \n* It’s better if your portfolio is clearly curated for product design. It’s harder to give a strong recommendation for a candidate that is trying to do it all: branding, graphic design, packaging design, etc in their portfolio alongside product design case studies is not recommended. \n* Effort. In today’s market, I do reward effort put into portfolios. I will pass “bare bones” if the case studies are solid, but portfolios that have a little flair, attention to detail, or are well designed in themselves shows a level of craft and hard work on top of already solid case studies, that really compels me to give a strong recommendation. It will not turn a fail into a pass, but it will turn a pass into a strong yes. \n\nOther callouts:\n* Prior experience doesn’t matter to me. I failed someone that interned at FAANG and passed someone that didn’t have any internship experience due to the quality of their portfolios. \n* Name of school doesn’t matter to me. Likewise, I passed new grads from more standard schools and failed some Ivy League grads or top tier art schools based on the quality of the portfolios.\n* These candidates tend to be impressive, but I just want to callout that it’s not the end of the world to not have these credentials on your resume. The quality of your work is what really matters. \n* I believe these tips to apply to most big tech companies with new grad programs. However, smaller companies, different industries or startups may look for very different qualities. Something to keep in mind as you are crafting your portfolio. \n\nI can’t share too much details for obvious reasons, but I hope this helps any new grads navigate some of the expectations out of your portfolio. I remember feeling pretty confused and lost as well, I didn’t have any mentorship and these are all things I wish someone told me back then. The market is also extremely tough right now, but getting better. Please be kind and gentle to yourselves esp after the holidays where I’m sure some of you are feeling the pressure from family to start your first big job! You are doing great. \n\nGood luck everyone 🍀❤️",
    "subreddit": "UXDesign",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 650,
    "downs": 0,
    "created_utc": 1735365536.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.72,
    "category_rationale": "Advice for portfolio reviews presented as multiple actionable tips and guidelines.",
    "composite_score": 4.413065990736202
  },
  {
    "score": 604,
    "title": "Got an job after 7 months. Here's what I learned",
    "selftext": "I've applied 326 jobs in the past 12 months, unemployed 7 months: \n\n* Got rejected: 146 times, ghosted: 178 times\n* Screening calls: 26 times\n* Case study presentations: 6 times\n* Take-home + whiteboard tasks: 4 times\n* Get to final round interviews: 3 times\n* Offer: 1\n\nHere's what I learned:\n\n1. **Change your mindset.**\n\n* Inspired by Jia Jiang's TED Talk \"100-Day Rejection Therapy,\" this helped me significantly reduce feeling sad about rejection emails. Rejection is normal. Get used to it, because you'll encounter more in the future. \n* Don't rely on interviewers' positive energy; stay neutral to avoid disappointment.\n* There are many unemployed people, but also many employed people. It's just not your turn YET.\n* When feeling mental breakdown, take 2-3 weeks off from applying and focus on other stuff, eg. go to gym every day.\n* If you are now 30 years old, do you really believe that you will be jobless for the next 20 years? Imposible! So treat this time as a mini-retirement. \n\n**2. Don't stop improving your skillset, opportunities are for those who well prepared.**\n\n* It's a competitive market, however, there's always one winner, why can't be you? HM focuses on:\n   * **Hard skills** that demonstrated through your portfolio, take-home tasks, and whiteboard challenges.\n   * **Soft skills** that shown in your interview responses, storytelling, and overall vibe.\n* Learn from the previous interview mistakes and improve for the next time. You will only get better and better.\n* Instead of ranting online, use the time to get interview insights on YouTube, seek feedback on ADPlist and Reddit.\n\nIf I'm unemployed again, I will use my time wisely by focusing on:\n\n1. CV and Portfolio (your entrance tickets to get the first interview)\n2. Interview Q&amp;As and overall communication skill\n3. Case study presentation (focusing on storytelling)\n\nI will NOT prioritize (I've tried, but it doesn't worked for me):\n\n1. Practicing design tasks and whiteboard challenges: I've gotten rejected in later stages because these tasks vary by company. Each company cares in different area, eg. strategic planning / ideation process / defined metrics etc. Completing tasks to meet everyone's needs in the limited time is impossible. So, I'll focus on applying to companies that don't require these tasks.\n2. Attached tailored cover letters for each job application and LinkedIn inbox hiring managers. It's a waste of time --- most of the job interviews I received I did not include cover letter. I linkedin over 20+ hiring managers, only 2 replied and 1 willing to arrange an interview.\n3. Applying for roles you don't particularly want to do is also a waste of effort and time. Hiring managers can tell you're not interested the role enough. (eg. a product designer applying for UI specific designer or design system designer)\n\nThis is just my own experience, might not applied for everyone's unique situation. \n\nTo those who are struggling to find a job: keep going and improving, you can take a break, but don't give up! Hope this helps.",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 604,
    "downs": 0,
    "created_utc": 1719443537.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Shares lessons learned from job-search experience with guidelines for improvement.",
    "composite_score": 4.475800368148441
  },
  {
    "score": 588,
    "title": "My traumatic experience as a Design Lead at J&amp;J",
    "selftext": "\nI want to share a painful chapter of my career that still affects me deeply. I worked as a Design lead at Johnson &amp; Johnson through a third-party contract. What seemed like a prestigious opportunity quickly turned into a toxic and emotionally draining experience.\n\nThe company was aggressively outsourcing both design and development to offshore teams (mostly in India), with the clear goal of cutting costs. My role was essentially reduced to being a “trainer” for Skill transfer, not in a collaborative sense, but in a way that made it obvious I was helping to replace myself and my colleagues with cheaper labor.\n\nBut the worst part was the deliberate emotional manipulation:\n\t•\tI was insulted, undermined, and disrespected on a daily basis.\n\t•\tEvery time I delivered strong design work, my manager would call a 1:1 — not to recognize the work, but to scold me in an upset, accusatory tone for not “teaching” offshore colleagues well enough.\n\n\t•\tAt some point It became clear they were trying to provoke an emotional reaction — pushing me toward frustration, anger, or burnout, just so they could fire me “with cause” instead of acknowledging their unethical practices.\n\t\n•\tMost of the European and U.S.-based designers were let go. We were treated as temporary obstacles to their cost-cutting roadmap.\n\n\t•\tI was constantly monitored — my emails, chats, and even calls were tracked. I even kept the laptop microphone off, but still felt watched. Casual comments were thrown back at me in twisted ways, weaponized to create more pressure.\n\n\t•\tThe environment was hostile and controlling, and I was left feeling anxious, paranoid, and disposable.\n\nI’m sharing this because I know many people believe that working for a massive, well-known brand is a career milestone. Sometimes it is. But other times, it’s a façade hiding a machine that chews through talent to optimize spreadsheets without any regard for the human cost.\n\nIf you’re going through something similar, you’re not alone. These environments are real, and they are harmful. Don’t let anyone make you believe it’s your fault.",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 588,
    "downs": 0,
    "created_utc": 1754348742.0,
    "media": null,
    "is_video": false,
    "num_comments": 80,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.86,
    "category_rationale": "Personal account of a toxic work environment with emotional impact.",
    "composite_score": 4.466857804226426
  },
  {
    "score": 582,
    "title": "Ya'll need to chill with all this catastrophizing",
    "selftext": "Before we begin, let me mention that I have over 10 years of experience in the UX field. Throughout my career, I have worked in diverse industries including finance, e-commerce, health, and privacy. I have experience working with startups, Fortune 500 companies, and as a freelancer, taking on roles such as a UX jack-of-all-trades, dedicated UI designer, UX architect, and researcher. Currently, I hold the position of head of the UX department at my current company.\n\nThis subreddit has too many posts that promote negativity and self-loathing within our field. I see many people complaining about the difficulty of finding a job, AI going to take my job, I did X and Y things, why am I not hired yet! So, let me share my personal perspective on this wave of pessimism.\n\n**It’s not just UX**\n\nYeah, it’s hard to find a job right now but it's important to remember that this is a widespread issue affecting everyone. The problem is not the UX field, but with the tech industry as a whole, which is experiencing the aftermath of COVID-19 and the consequences of excessive hiring.\n\n**AI is a tool**\n\nIf you feel threatened by the potential of AI taking over your job, it is important to broaden your perspective. AI can learn to create things based on templates and successful past designs, but it will always lack the empathy required to design thoughtful solutions for users. Instead of worrying about AI replacing your job, I suggest considering how you can utilize AI to develop creative and innovative solutions.\n\nAn analogy I like to use is when Excel spreadsheets were introduced; they didn't make accountants obsolete but made their jobs easier. So, how can AI make your job easier?\n\n**Learn to promote yourself**\n\nYeah, there are a lot of people applying for jobs. So how can you make yourself stand out among an ocean of other designers applying for the same job? How can you do more? Leverage external tools to promote yourself. Use LinkedIn, attend meetups, go above and beyond the bare minimum to secure an interview that eventually leads to a job. *Referrals* go much further than an application.\n\n**Have a backup**\n\nUX is a great field, and by no means an easy field to stand out in. UX was not my sole career path when I was searching for work. When I started my journey, I had UX adjacent skills I used to try and land jobs anywhere that would hire me. If I hadn’t landed a job in UX, I might have been a developer or a graphic designer. \n\n**UX is not just being good at Figma**\n\nI hate that I have to say this, but I've seen enough posts on here that I feel I need to stress that UX is not just about how well you can use a single tool. UX is about being a problem solver for a group of people you've never met before and learning how to advocate for them to a business or stakeholder. It's about the psychology of why a user will come to your product, why your product solves their problem, and understanding how a user interacts with a digital or physical product. Anyone can learn to use Figma and design screens based on business criteria. A good UX Designer knows to ask why a certain solution solves a specific problem. A great designer knows how to leverage data to create a meaningful experience. An amazing designer understands that not every solution requires a designed screen, mock, or prototype.\n\n**Graduating or getting certified doesn't guarantee you a job**\n\nThis may seem harsh, but this is meant for the folks who took boot camps or recently graduated college. Just because you have a piece of paper that says you did something well enough doesn't guarantee you a job. Schools, universities, and boot camps are all businesses with the goal of convincing students to make a transaction. Once you graduate, they may be contractually obligated to provide job placement assistance for a period of time. Once that time runs out, that’s it. They are done with you. They don't owe you a job. They have taught you the necessary hard skills to succeed. It's up to you to apply your soft skills to land a job. If you don't know the difference between hard and soft skills, [here's an article that explains it](https://www.indeed.com/career-advice/resumes-cover-letters/hard-skills-vs-soft-skills).\n\n**Stop catastrophizing** \n\nI understand that many people are posting about their struggles here to receive community support. When the posts are about apocalyptic preaching, it doesn't help anyone. It only validates the feelings of dread for others who are experiencing the same, leading them into a spiral of anxiety. This pattern is not limited to newcomers and juniors; even seniors and team leads are expressing their concerns. There are ways to share critical observations without spreading further fear and anxiety. Instead of simply stating how bad everything is, try following your comments and observations by asking for help and offering solutions. We as a community should make an effort to provide guidance and support. \n\n**How to stand out more?**\n\n* Learn a coding language\n* Learn about web accessibility principles\n* Take some writing lessons\n* Write a dope case study blog\n* Post more often on Linkedin\n   * Small wins, new technique you learned, how the UX of a door sucks, etc.\n* And most importantly, keep practicing your design skills!\n\n**TL;DR**\n\nThis old man (*not that old*) wants to see you folks not struggle and be happy. You are not alone in your struggles. There are things you can do to stand out and succeed. Become more active in your local community. Expand your UX searches to outside your town/city/state, maybe even country. Embrace change, don't fear it. If you are not happy in UX, or in the UX job market, then find a job that will make you happy. ",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 582,
    "downs": 0,
    "created_utc": 1698636948.0,
    "media": null,
    "is_video": false,
    "num_comments": 176,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Advocates perspective on industry issues and practical tips, framed as guidance.",
    "composite_score": 4.602155187939918
  },
  {
    "score": 575,
    "title": "You are not your job",
    "selftext": "Hey, it’s really tough out there right now. Lots of us are not working, even staff levels and higher. It’s totally reasonable to be asking if you’re in the right field, the right job, etc. \n\nAnd also, you are not your job. You are a smart, hard-working, awesome, loved individual who happens to work in a high-stress, high-ego, high-turnover industry that pulled random bullshit out of the woodwork every five years or so. \n\nI’m not saying you should stay. That’s for you to decide. \n\nI am saying that you are not amazing because you’re in UX. You’re amazing because you’re you. If you happen to work in UX we—your coworkers and teammates—are the ones who benefit. \n\nIt’s almost Monday. (For some of you it is already Monday.) You’ve got this. ",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 575,
    "downs": 0,
    "created_utc": 1751857524.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Positive, brief encouragement post with little substantive content.",
    "composite_score": 4.2339831107830435
  },
  {
    "score": 537,
    "title": "There is hope: I got a job after 2+ YEARS of unemployed floundering",
    "selftext": "Was laid off from a FAANG company a little over 2 years ago, and - at age 48 - I was struggling and wondering if perhaps \"it had been a good run\". I'm not one of those \"I applied to 15k positions\" people, but I did my fair share of applying, networking for referrals, and even had a few sessions with a career coach. Had one job offer pulled after verbal because they cut hiring, and 2 opportunities at big tech companies where I made it through final rounds only to be rejected. I felt like with my 2 years and counting without work I was growing rapidly more irrelevant by the day (at least on paper). But somehow I got on someone's radar for a job I applied to (and sort of forgot about), had a few interviews where I \"nailed it\", and was offered a Principal Product Designer position with a major retailer focused on top of funnel / discovery. \n\nIn the words of George Costanza - \"I'm back, baby!\"\n\nSo for those of you out there feeling like I was feeling - and I'm sure many of you feel that way with WAY less than 2 years on the bench - hang in there. ",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 537,
    "downs": 0,
    "created_utc": 1730993847.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Narrative of a long unemployment period with tips and encouragement for readers.",
    "composite_score": 4.379738953987817
  },
  {
    "score": 514,
    "title": "I hate design systems and I’m not sorry 🙃",
    "selftext": "Hey UXers. I’m at a startup with 3 other product designers and a very enthusiastic design lead who has decided it’s Time™ to build a design system. From scratch.\n\nCool, right? Wrong. I have been naming things like “Gray-600” and “Button / Small / Ghost / Active” for what feels like 43 years. I dream in nested components now. I whispered “atomic design” in my sleep last month. My ex was worried.\n\nMeanwhile, I used to enjoy designing. Remember fun? Remember vibes? Now I’m trying to define a spacing scale while arguing about whether 4px is too aggressive.\n\nAnyway. Just wanted to vent. If anyone else out there has survived this phase and still has a soul, please send snacks and emotional support.",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 514,
    "downs": 0,
    "created_utc": 1753673070.0,
    "media": null,
    "is_video": false,
    "num_comments": 143,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Vent about the pain of creating design systems and the feeling of slog, expressing frustration.",
    "composite_score": 4.465988475088816
  },
  {
    "score": 512,
    "title": "Got replaced by AI",
    "selftext": "I got laid off alongside my entire team after working at a company for 3 months. Found a job after a week that was paying me the same, so I onboarded as the only designer. It was an early stage startup, so they insisted on using AI tools such as Lovable and v0. I hesitated at first saying that it’s not usually accurate but eventually gave in. After a week of working, they decided that they don’t need me as AI does all the work. I reasoned that Product Design is not all about UI and that they’d still need a comprehensive background in feature building and other User Research work, but they were curt and let go. \n\nI feel extremely frustrated, I’ve been jumping from one opportunity to another and just when I start thinking that everything is going to be fine, it blows up on my face. Does anyone know where I can find jobs that are stable and remote? I feel so lost…",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 512,
    "downs": 0,
    "created_utc": 1745898902.0,
    "media": null,
    "is_video": false,
    "num_comments": 204,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional vent about being replaced by AI and job instability.",
    "composite_score": 4.593494295639694
  },
  {
    "score": 507,
    "title": "I got a job in this market. It is possible! Keep going, stay strong!",
    "selftext": " I'm not trying to boast but just sprinkle in a little positivity in this sub and give a little hope for the people out there looking. Our industry sucks right now and I picked the worst time to look for a job (holiday) but I am proof that it is possible! \n\nI started to look for a job in early december and was religiously applying to jobs on linkedin. I had to have applied to at least 20 jobs a day. \n\nIt turns out the job I got was one of the first jobs I applied to. I went through five rounds of interviews and got an offer letter last friday. The process was absolutely ridiculous and I can't believe the company used that amount of money and resources.  i guess that's standard nowadays. \n\nNot that i'm like a pro at finding a job but If you have any questions ask away.",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 507,
    "downs": 0,
    "created_utc": 1707872666.0,
    "media": null,
    "is_video": false,
    "num_comments": 121,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Positive job-find story with incidental insights about the job market and process.",
    "composite_score": 4.484043627621293
  },
  {
    "score": 499,
    "title": "I got an offer!!!!",
    "selftext": "I and my team were laid off more than a year ago. I still feel it's because of me (me coming out publicly and imposter syndrome as a senior)\n\nA lot of good chances (interviews at really big companies and good opportunities) but I was mentally not doing well and threw away those chances :(\n\nAfter applying about 1500 jobs, 34 interviews, 6 presentations, 27 resume iterations, and 5 portfolio updates (literally created 5 different websites)\n\nI'm too scared to counter the offer, so I just accepted it. \n\nStill feel a little unreal! I hope I do it well!",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 499,
    "downs": 0,
    "created_utc": 1745336019.0,
    "media": null,
    "is_video": false,
    "num_comments": 110,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Personal perseverance story with numbers illustrating a challenging job search.",
    "composite_score": 4.456631493729348
  },
  {
    "score": 499,
    "title": "Finally found a new job, and it is a great position!",
    "selftext": "Hi,\n\nI wanted to share some joy in this group. After almost 1 year of search while employed full time, I finally landed a new UX position: it's one of the places I've dreamed for a long time and I spent all my energies to be there.\n\nI've iterated my CV and my portfolio dozens of times, constantly asking for feedback and looking around for good references. With a bit of luck, I did it! Whoaaaah! 🥳\n\nHere is some data:\n\n[215 Applications, 6 Design challenges \\(take home assignments\\), 3 offers at different times, 1 accepted](https://preview.redd.it/sbyct51fkcvd1.png?width=1600&amp;format=png&amp;auto=webp&amp;s=13b4555ea4320a226ecbe48cd45ce58edbe9d00d)",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 499,
    "downs": 0,
    "created_utc": 1729184302.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.61,
    "category_rationale": "Celebratory success story that implicitly outlines effort and iteration.",
    "composite_score": 4.437083042182266
  },
  {
    "score": 496,
    "title": "I used to shit on the UX of product until I become a designer myself",
    "selftext": "Before I started working in the field, I used to point out every little software’s UX problem and would say thing like “they need better design/designer!”.\n\nThen I became a designer and realize….things are just not always in designer’s control. Product gets pulled in different directions, legacy code problem, not enough budget, feature abandonment after MVP, company doesn’t care to make a great product (they want something good enough and get acquired), no quality data….list goes on.\n\nSo now I have such admiration for any quality products. It takes an entire company for good design to happen .",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 496,
    "downs": 0,
    "created_utc": 1688058693.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Reflection with insight on design collaboration and systemic challenges.",
    "composite_score": 4.435656474614291
  },
  {
    "score": 493,
    "title": "I can’t stand LinkedIn",
    "selftext": "I haaaaaaate LinkedIn! Seriously, every time I open it there’s someone promoting themselves in the most ridiculous ways, such as going to a colleague’s post to comment how they agree with them because they took a course on this or that and blablabla… You can see it’s not genuine engagement.\n\nI barely use social media for a reason, I’m very low-profile. Do you, people, who have more experience in the field and are somewhat more solid in the market, have any tips on how promoting my work without looking desperate? Is having my certifications, experiences and portfolio listed on my profile enough or, at least, is there a better way to engage with recruiters and stand out through my work itself?\n\n",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 493,
    "downs": 0,
    "created_utc": 1738155698.0,
    "media": null,
    "is_video": false,
    "num_comments": 141,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Vent about LinkedIn culture and seeking advice, dominated by frustration.",
    "composite_score": 4.504871121115175
  },
  {
    "score": 489,
    "title": "Take Home Exercise WARNING (UPDATE)",
    "selftext": "Hi all, this is an update to my initial post [here](https://www.reddit.com/r/UXDesign/s/aV32uD1hKZ)\n\nRecap: I interviewed, got a take Home test, did really well, and got an email promising a contract offer the following day. Only for the company to take my work and not give me an offer and then not paying for my time I spent on the test. I took legal action. \n\nThe attorney sent a Cease &amp; Desist to the owner / CEO and the head marketing guy I was doing most of the interviews with last week. \n\nI initially thought I wouldn't hear anything back from the company but then heard from my lawyer that their lawyer wanted to talk to him today (Monday).\n\nTheir lawyer apparently wanted to resolve this quickly and agreed to pay me for my time I spent on the \"test\". \n\nThey agreed to my lawyer and I putting in writing everything we wanted. I asked to get paid, and for them to agree to not use my work in any way shape or form (lots of legal jargon that I won't post here), also requesting that they delete any of the work I did and not keep any copies for any use at all. I am busy ironing out the language with my lawyer right now, I am seeing if I can request they not even use my idea at all. Waiting for feedback from the lawyer. \n\nNot sure if this will achieve anything major in the long run, but I hope we collectively start standing up for ourselves as a community. Too many companies have gotten away with this behavior. We should not be bullied and manipulated into doing free work for companies while they break their promises. \n\nI would do this again but I will never fall for the \"do a design exercise\" bullshit again so I doubt I will go through it again. \n\nI feel a deep satisfaction knowing I fucked with an unethical company and won. I encourage everyone else to do the same. ",
    "subreddit": "UXDesign",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 489,
    "downs": 0,
    "created_utc": 1719858505.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Frustration with unethical take-home exercises and advocacy for change.",
    "composite_score": 4.302334014828908
  },
  {
    "score": 473,
    "title": "Becoming a UX influencer on LinkedIn",
    "selftext": "I want everyone to be a successful LinkedIn shitposter so here's an official list of topics:\n\n- Basic ass fundamental UX concept but make it into a 20 page pdf with graphics\n- AI will replace UX designers and here's why...\n- AI won't replace UX designers and here's why...\n- Some rant about how UX != UI\n- Some rant about how UI is part of UX\n- Your portfolio should show all your research and process\n- Your portfolio shouldn't be detailed because nobody reads it\n- Your portfolio shouldn't show research and details it should only show how you MAXIMIZED SHAREHOLDER VALUE\n- Your portfolio should be simple and standard\n- Your portfolio should be unique and different\n- GUI is dead!\n- GUI is not dead!\n\nDid I miss anything?",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 473,
    "downs": 0,
    "created_utc": 1744975814.0,
    "media": null,
    "is_video": false,
    "num_comments": 87,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Enumerated list of topics for becoming a UX influencer on LinkedIn.",
    "composite_score": 4.375519677749169
  },
  {
    "score": 469,
    "title": "I feel like there's way too much fear-mongering on this sub.",
    "selftext": "I've honestly been thinking of leaving this sub due to all the negativity I constantly see here. Tons and tons of threads talking about the UX industry going dry, people regretting being UXers, and fear of AI taking over... it's way too anxiety-inducing and I don't even feel like it's all true, feels like a lot of people are either being anecdotal or flat-out panicking. \n\n\nI first joined this sub because I thought it would be a great opportunity to network or expand my knowledge. There are good threads here and there, but I get way too anxious reading all of the negativity to think it's worth it, honestly places like Linkedin or Medium have been much more helpful for me to find quality material and a more uplifting community. Anyone else feels the same way?",
    "subreddit": "UXDesign",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 469,
    "downs": 0,
    "created_utc": 1689117505.0,
    "media": null,
    "is_video": false,
    "num_comments": 144,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.62,
    "category_rationale": "Critique of fear-mongering and negativity; seeks validation and calmer perspective.",
    "composite_score": 4.472781859053205
  }
]