[
  {
    "score": 1037,
    "title": "What parts of qual research are most painful/difficult/risky?",
    "selftext": "I’m new to UX research (first job but have a background in consumer survey research) and am getting tossed into interviewing projects without much actual training. I’m trying to figure out the qualitative side. I’ve been reading and watching videos, but I know real projects have roadblocks I can’t yet see coming.\n\nFor those of you with more experience, what parts of qualitative research are your big pain points? The stuff that takes way more time or creates more problems than a newbie might expect? From what I've learned so far I think these might be the biggest issues but maybe I am missing something?\n\n1. Asking open-ended questions but still getting specific/useful answers\n2. Keeping interviews from drifting into off-topic tangents such that the real objectoves are not met\n3. Dealing with “shy” participants\n4. Figuring out how much probing is enough and also not too much\n5. Avoiding bias from how I talk or look on webcam\n6. Finding good sources for participants\n7. Making sure participants reflect real users including diversity (maybe only people who want to complain accept interview invitations?)\n\nAlso I was given budget that I can use for training or to attend a conference but only $500 (not much). Stuff on Udemy looks pretty light, so it's cheap but not sure much value. Thanks for any help. And I can post back my reading list if anyone would find it useful.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1037,
    "downs": 0,
    "created_utc": 1755095488.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.518589151820844
  },
  {
    "score": 535,
    "title": "Has anyone had success in getting AI to conduct a solid quantitative thematic analysis? If so , what is your prompt, how do you use the output, and that AI tool are you using?",
    "selftext": "\nEdit: QUALITATIVE analysis sorry!!!\n\n I just spent a couple of hours trying to get Chat GPT to conduct a thematic analysis of nine, hour-long, generative interviews. I adjusted the prompt many times, and each time I got worse results. The analysis in its current state is so far from even starting to become helpful - the output is complete nonsense.\n\nThe AI tools that are built into the tools we already use (Usertesting, Dovetail, etc. ) are a zero value add - and AI seems so far from even coming halfway to a manual human analysis. Am I missing something? Has anyone else had better luck?\n\nedit: I am a senior UX researcher with 6 years in the industry. The purpose of this effort is to provide a supplementary analysis to an in-depth manual thematic analysis.\n\nPlease share any chat prompts that have worked for you and their context!",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 535,
    "downs": 0,
    "created_utc": 1755637033.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.244785408380563
  },
  {
    "score": 241,
    "title": "What about AI is good for research?",
    "selftext": "Hey everyone!\n\nI just wrapped up putting together [The State of User Research 2025](https://www.userinterviews.com/state-of-user-research-report) at User Interviews—digging through 300+ data points from nearly 500 researchers across the globe.\n\nWhile a lot of metrics held steady year over year (glass half full/half empty, depending on your vibe), the biggest shifts were around AI:\n\n* 80% of researchers now use AI in their workflow — up 24 percentage points from 2024.\n* Sentiment is mixed: 41% feel AI negatively affects research, while 32% see it as a positive development.\n\nWhat surprised me most: nearly a third of researchers see AI as good for the craft. Most of what I hear are fears about AI degrading the discipline, not hopes about it helping us transcend limitations.\n\nI have a hunch about some of the positives since I use AI in my own research work too (I’d technically be a PWDR), but I’d love to hear straight from dedicated UXRs:\n\nWhat about AI do you feel is genuinely good for research? Or, if you’re on the fence, how are you weighing the pros/cons right now?",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 241,
    "downs": 0,
    "created_utc": 1757518527.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.834497248059925
  },
  {
    "score": 241,
    "title": "15 Years in UX Left Me Burnt Out and Regretful. I Wish Someone Had Warned Me",
    "selftext": "I've made a recent career change and wanted to share my viewpoint. I know: everyone has opinions but I genuinely feel like my choice of career has been my biggest life regret and I wish I had known some things going in.\n\nOver the past 15 years, I’ve had to relocate five times just to get raises or move forward. Some of that’s on me — I chose not to move to the coasts a decade ago, so most of the companies I worked for were in consumer or healthcare sectors. I initially blamed myself for my lack of career growth. After experience fast career growth in another field (insights/ marketresearch) I now know it wasn't me: my prior orgs were often top-heavy or underfunded, and there was little room for UX to grow. Raises and promotions were hard to come by.\n\nThat instability took a toll. I've had to choose between sub-2% raises or uprooting my life for a new job. That made it incredibly difficult to build a strong local community, and I’ve experienced real financial setbacks as a result. I knew UX would require me to constantly prove my value — but I didn’t realize how draining and disheartening that would be over time.\n\nMeanwhile, some of my friends who left college early to work in trades now live in more affordable areas. They might earn less on paper, but they own nicer homes (with more equity) and have strong, stable social networks.\n\nSo, yes, go ahead and downvote me if you must — but I’ve recently transitioned into market research, and for the first time in a long while, I feel genuinely optimistic about my future. I wish I had done this from the beginning.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 241,
    "downs": 0,
    "created_utc": 1754243776.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.9584533007808256
  },
  {
    "score": 208,
    "title": "Current job search madness...when will it end.",
    "selftext": "Apologies for the grainy pic 😁 \n\nI've been looking for a new role since Jan, and more thoroughly over the last month or two. \nI've optimised my CV for ATS software, I've created a kick ass portfolio, I've a lot of great (true mixed method) experience for brilliant companies and a decent amount of research in highly technical landscapes...and no dice. \n\nI've started to think about other careers and roles I could do even, but nothing springs to mind (at least things I have solid skills sets in, and/or things that I want to actually do). \n\nI'm considering going freelance (while I know that's also a tough market), I get the sense that budgets for perm hires are being withheld at the moment. There actually aren't a lot of jobs at my (lead) level being put out. \n\nI'm determined though. I know it's hard at the moment, but I'm sure something will give soon. \n\nThere's no real question attached to this thread, and we're probably all quite tired of this chay. But I'm sending out a fist bump to all the others in a similar boat! ✊✊✊",
    "subreddit": "UXResearch",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 208,
    "downs": 0,
    "created_utc": 1749721218.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.021691279607026
  },
  {
    "score": 198,
    "title": "UXR Salaries",
    "selftext": "Hey All, I'm co-founder of Levels.fyi. One of the top 10 requests we've had over the years is adding UXR salaries. Now technically we've always had UX Researcher buried under the Product Designer job family but there had been a lot of feedback around splitting it into its own job family. I'm happy to share that after enough feedback we've made a dedicated job family / page for it here: https://www.levels.fyi/t/ux-researcher?countryId=254&amp;country=254\n\nGiven the audience here, would appreciate any other UX feedback :)\n\nEdit: Now that we have it up properly, the ball is back in your court! Please add your salary and encourage all your slack / WhatsApp / etc groups to add theirs! Link: https://www.levels.fyi/salaries/add",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 198,
    "downs": 0,
    "created_utc": 1732057214.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8058870985848445
  },
  {
    "score": 194,
    "title": "Leaving UXR?",
    "selftext": "I’ve seen a couple other posts about this, but they’re a few years old, so perhaps it’s time to revisit this topic. \n\nI entered the profession / field of UX research about 12 years ago. Back then, it was sold as a rigorous field of study - using sound, tried-and-true research methods to gain deeper insights about users to improve digital product usability and experience. \n\nMy bachelors degree in Psychology with my masters in Human Factors (with an emphasis on human-computer interaction and research) seemed like a perfect fit. In fact, back then one could hardly get a job in UX research without such a background. \n\nA lot has changed in 12 years - most of it not for the better in my opinion. Agile development spread like wildfire without consideration of how to incorporate research into it. A lot of people from various non-traditional backgrounds made their way into UX research roles. \n\nUX research has lost its rigor. I feel like we caved to the pressures of corporations, sacrificing research quality and validity by cutting corners in an effort to appease stakeholders. Things like utilizing sample sizes that are way too small to answer the research questions, or the improper use and interpretation of descriptive statistics (using them in inferential ways). Rushing studies without any peer review or pilot studies to refine study design and ensure confounding variables are controlled for and mitigated. \n\nI have jumped companies, small and large, big players and small, looking for the UX Research team that still practices these best practices and puts guardrails in place to enable quality, valid, effective research. \n\nI get it. We work for companies. Time is always a factor, so we have to make compromises in the name of efficiency. I’m okay with that - to an extent. But I feel, overall, as a whole, our field has allowed too many compromises to the point that we’ve diluted research practice and risk invalid research. \n\nFurther, and I mean no offense by this, we’ve hired people as researchers who don’t know research basics. Every researcher, in my opinion should know things like descriptive vs. inferential statistics, risks to research validity and how to mitigate them, how to determine the appropriate sample size (and not just defaulting to Jakob Nielsen’s “test with 5”), among other topics. I’ve had wonderful colleagues who did not have a solid understanding of such concepts, and I’ve seen their work suffer because of it. \n\nAt this point I’m tired of going against the grain. I think UX research is a slowly sinking ship. So, I’m considering a career move. I’m not sure to what though. I’m curious if anyone else has moved out of UX research to a different profession, and why, and how that’s gone. \n\nRight now my only thought is perhaps trying to move into data science somehow.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 194,
    "downs": 0,
    "created_utc": 1705582422.0,
    "media": null,
    "is_video": false,
    "num_comments": 134,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.060201495610021
  },
  {
    "score": 155,
    "title": "What tools do you use for synthesizing user interviews?",
    "selftext": "Hey all!  I’ve been drowning in notes lately. I just wrapped up 10 user interviews in 2 days this last week for a product feature, and I’m trying to figure out a better workflow for synthesis. Right now I’m manually tagging transcripts in Google Docs and it’s pretty painful? What are some of the tools that you guys use? I've seen some interesting ones like: \n\n* [**Albus Research**](https://www.albusresearch.com/) – This one looks exactly like what I want (based on the video) but seems they have not launched yet? Essentially some sort of automated synthesis / analysis from user interviews with some customizability. \n* [Dovetail](https://dovetail.com/) – This seems like a classic hit among UX researchers but unfortunately my company does not have a subscription, I also don't feel like I need all the bells and whistles that it provides. \n* [HeyMarvin ](https://heymarvin.com/?utm_campaign_id=&amp;utm_term=heymarvin&amp;utm_campaign=Brand+-+HeyMarvin&amp;utm_source=adwords&amp;utm_medium=ppc&amp;hsa_acc=2315755094&amp;hsa_cam=21743369270&amp;hsa_grp=167569958603&amp;hsa_ad=714677879743&amp;hsa_src=g&amp;hsa_tgt=kwd-1930376224318&amp;hsa_kw=heymarvin&amp;hsa_mt=p&amp;hsa_net=adwords&amp;hsa_ver=3&amp;gad_source=1&amp;gad_campaignid=21743369270&amp;gbraid=0AAAAApcRwVozdrhdPGv-kxYRQ9Qv_YZcw&amp;gclid=Cj0KCQjwlYHBBhD9ARIsALRu09ofIYRY4iwzc8ikQpKzKHO1veuYGXJCIkgLgg58UugmpgAP9AneFGYaAtd8EALw_wcB)\\-  Haven't tried this one but looks promising, but seems more aimed at sharing the insights vs. actually synthesizing them?",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.73,
    "subreddit_type": "public",
    "ups": 155,
    "downs": 0,
    "created_utc": 1746993261.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.464203614025571
  },
  {
    "score": 154,
    "title": "Venting After Years of Stakeholder Management in UX Research",
    "selftext": "After years of working in 7 different industries, across big and small teams, and even leading some, I’ve finally cracked the code: everyone else knows how to do my job better than I do.\n\nEvery single time, without fail, you share a discussion guide and boom:\n\nWe should just ask participants what they want to see!” (Because, obviously, participants are the best at designing products for themselves.)\n\n“Why are you being so general? This doesn’t make sense!”\n\nMake sure the product director signs off as a final result!” (Yes, because untrained opinions always elevate research quality.)\n\nAnd let’s not forget their pièce de résistance: rewriting my carefully crafted survey questions. My personal favorite\n\n“Let’s test awareness by asking, ‘Are you aware we have this feature? Yes or no.’”\n\nAh, yes, because nothing screams valid research methodology like a question that creates the awareness it’s supposedly measuring. Genius! Why didn’t I think of that?\n\nBut wait, there’s more! Endless feedback loops, mandatory approvals, and random stakeholder brainstorming sessions that ultimately boil down to: “Can you just do it my way? It feels better.”\n\nAt this point, 80% of my job is managing egos and explaining (for the hundredth time) why leading questions are bad. The actual research? That’s just a side hustle.\n\nHow do you all keep from losing your minds? Or is this just part of the “fun” of being in UX Research?",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 154,
    "downs": 0,
    "created_utc": 1737390117.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.786616786219259
  },
  {
    "score": 154,
    "title": "Why don't we address the role of UX in exacerbating capitalist inequalities and neoliberal fantasies?",
    "selftext": "I believe this is going to cause a huge stir and there are a lot of people that work in spaces that are impactful and enjoy it - I get it. But we rarely talk about how our jobs, within the confines of capitalist modes of production, have been co-opted by companies that exacerbate capitalist inequalities. If our role is to integrate in a company's \"strategy\", with the end goal being to produce more profit, we are playing a role in exploitation under the guise of \"voice of the customer\". We are, in the end, a tool of capitalist production.\n\nMy question is: How does our role exacerbate capitalist inequalities? How can we imagine a role for ourselves that not only challenges the role of capitalist exploitation but produces brand new realities that actually matter to people? If that happens, we can start imagining new realities for ourselves as a profession but also gradually let go of this constant frenzy regarding \"fitting in\", \"impact,\" and \"breaking in\" - both for senior, mid-level and junior folks.\n\nYes, I get it - we are primarily working to pay the bills but I believe we rarely question our role as researchers to challenge the status quo. This is, in part of course, due to the co-optation of Tech companies in the pats 10-15 years. I don't mean to challenge the status quo in terms of making processes more efficient within a company, but in our role of how we interact in an exploitative relationship with users (extracting information), and how we are producing products that do not help in advancing a \"user's\" life but rather exploit them even more. ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 154,
    "downs": 0,
    "created_utc": 1740433133.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8802842538899904
  },
  {
    "score": 151,
    "title": "Dovetail CEO Allegations",
    "selftext": "I recently shared an article about this, and it was removed. It’s frustrating and honestly concerning that a post discussing serious allegations against a tech CEO gets removed, even when the CEO himself has *publicly acknowledged* the situation on LinkedIn.\n\nWe regularly see conversations on this platform about the behavior of public figures — Elon Musk, Sam Altman, Zuck, you name it. Why is it different when it’s a lesser-known startup CEO?\n\nI'm referring to [this AFR article](https://www.afr.com/technology/dovetail-executive-alleges-the-start-up-s-ceo-repeatedly-assaulted-her-20250203-p5l978) and [this Capital Brief piece](https://www.capitalbrief.com/article/dovetail-ceos-linkedin-post-draws-scrutiny-amid-messy-legal-fight-00e42a1b-d2de-4df7-b96d-1132d3cb258a/preview/) about the CEO of Dovetail. The AFR article outlines disturbing allegations of repeated assault made by a former executive. These are public, serious claims. Meanwhile, the CEO has made statements on LinkedIn, so it's not speculation or private gossip.\n\nDiscussing the implications of this kind of news, especially when it involves leadership at companies many in tech admire or use, isn’t harassment or rumor-mongering. It’s a critical analysis, and it’s holding power to account.\n\nThis deserves a serious, respectful conversation. Let’s not shy away from it.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 151,
    "downs": 0,
    "created_utc": 1745354221.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5704532353117324
  },
  {
    "score": 144,
    "title": "Being a UX Researcher gives me a ton of anxiety.  Anyone else?",
    "selftext": "Throwaway account.\n\nI became a UX Researcher at a FAANG company 4 years ago after completing my PhD. It seemed like a dream job that had everything I could want: a job where I could actually use/grow my skills as a researcher, alignment between my product area and the focus of my PhD, relatively stable pay and benefits, broader impact, and so on.\n\nToday it dawned on me that this job is the source of a ton of anxiety for me. I wake up anxious and go to sleep anxious because of my job. Here's the current list of things triggering the anxiety:\n1. Receiving feedback from my manager, who is very heavy-handed in her feedback and has a very particular standard for how things should be done (not a strengths-based manager but one with a long rubric of how she wants things)\n2. Aligning stakeholders. All the time. Mediating disagreement, playing the game of trying to understand all the different things people want, making sure research is interpreted correctly... I feel like this is 70% of my job and it's exhausting. So many meetings, emails, and pings.\n3. Publishing results to stakeholders / broad audiences, because then I need to keep aligning the research with stakeholders.\n4. Artificial corporate urgency -- it often feels like everything needs to be done ASAP, yesterday. I’m tired and overwhelmed with work all the time. \n\nAnd yes predictably I have a diagnosed anxiety disorder, which was much worse during my PhD. In my current state of things, it's manageable and not debilitating, just very unpleasant. \n\nI'm wondering if I am alone in these feelings, or maybe this is all a sign that this job is a poor fit for me. Or maybe it’s a FAANG thing. Has anyone else has felt this way? If so, what have you done to cope? \n\nEdit: wow thank you so much everyone for the empathy and great advice so far. I truly thought I was alone in these feelings and was even being ungrateful — in fact I expected to be downvoted for that reason. All your shared experiences and advice really means a lot to me, thank you ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 144,
    "downs": 0,
    "created_utc": 1731368759.0,
    "media": null,
    "is_video": false,
    "num_comments": 47,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.7294886209227682
  },
  {
    "score": 139,
    "title": "Anyone using R for thematic analysis of interviews?",
    "selftext": "Hi everyone!  \nI’m working with the transcripts of about 20 interviews and I need to conduct a thematic analysis for my research. I usually see tools like NVivo or ATLAS.ti recommended, but I was wondering: Are there any R packages or workflows you would recommend for doing qualitative data analysis (coding, theme identification, reporting)?\n\nI’d love to hear from people who have tried handling qualitative interview data in R, especially if you combined manual thematic coding with more automated text mining approaches. Thanks!",
    "subreddit": "UXResearch",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1756131723.0,
    "media": null,
    "is_video": false,
    "num_comments": 17,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5237642882298914
  },
  {
    "score": 137,
    "title": "Just got laid off",
    "selftext": "I worked at a mid-size company for 4 years on a small team with 3 researchers. I got a surprise meeting on my calendar with the director of the UX team and knew right away. Heard through the grapevine that the whole research team has been let go. \n\nI’ve been wanting something new for a while now and have already been applying for a couple months but I’ve only had 2 interviews. This sucks, the industry sucks, and the state of UX research sucks. \n\n",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 137,
    "downs": 0,
    "created_utc": 1755627109.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6991133141910293
  },
  {
    "score": 131,
    "title": "Where are all the excess UX Researchers going to go?",
    "selftext": "It’s clear to me that there are way too many UX researchers given the number of job openings right now.\n\nSo assuming that thousands of people are not just going to remain unemployed indefinitely, waiting for the next market uptick, where are these highly skilled people going to go?\n\nAdjacent professions like market research, UX design, data science and product management are all oversaturated as well. Because of that, people who have held those titles before will get precedence for any openings in those fields, closing them to UX researchers trying to transition out. \n\nLet alone the difficulties that will be experienced by anyone trying to break into UX research right now, I see that as an incredibly uphill battle. But if you were training to enter the job market for this moment, what do those people do now?",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 131,
    "downs": 0,
    "created_utc": 1707318212.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.8027135742367904
  },
  {
    "score": 131,
    "title": "Calling all Senior UXers to build something meaningful together",
    "selftext": "Unemployed and sick of spending hours a day on LinkedIn?\n\nMany senior designers and researchers are facing uncertainty and unemployment in the current tech landscape. Why not get together to create something meaningful in our free time? \n\nI'm exploring forming a club/community to collectively leverage our UX skills to:\n\n1. Shape Ethical UX for the AI Era – Create guidelines for human-centred, ethical UX in AI-driven tech.\n\n\n2. Advocate for UX at Scale – Influence policy around ethical design, accessibility, privacy, and responsible technology.\n\n\n3. Prototype Sustainable Digital Practices – Innovate sustainable UX methods to reduce digital waste and carbon footprints.\n\n\n4. Explore Speculative UX Futures – Use futures thinking methodologies (e.g., futures wheels, horizon scanning) to proactively shape the UX industry's direction.\n\n\n5. Boost Digital Accessibility and Inclusion – Support NGOs, schools, and startups in building inclusive products.\n\n\n6. Reinvent UX Careers – Identify new roles, pathways, and entrepreneurial opportunities within our changing field.\n\n\n\nWould you be interested in joining such a club?\n\nThese are some rough initial ideas. Additional suggestions or feedback warmly welcomed!\n\n",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 131,
    "downs": 0,
    "created_utc": 1744814883.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.686952847046637
  },
  {
    "score": 120,
    "title": "Anyone else kind of tired ",
    "selftext": "As the title states. Ever since the advent of AI and the decrease in UXR openings, I’ve noticed a trend of more Podcasts, Medium articles and LinkedIn content on the topic of research as a discipline needing to shift to a more business-focused mindset to maximise the impact of User Research. Honestly, I get it, and I kinda like it to be honest. \n\n\nHowever…\n\n\nTime after time, the extra work I take on to quantify the impact of a poorly executed product is rejected or ignored. On many occasions, I’ve taken the initiative to detail and document the potential effects of poor user experiences on business metrics beyond VOC. Feature uptake, CVR, CTR, abandonment rate, time spent on task, hell, even revenue... I present my packs with clear data-led recommendations, supplementing my research with data analytics, customer journey maps, competitor research, experimental data, academic research, behavioural principles…\n\n\nYet the focus remains on top-down strategic initiatives which offer no customer value and questionable business value. Time after time I see products fail, with glaringly obvious and well-documented usability issues or broken CVPs rearing their ugly heads. The feature/product releases. No one uses it. Then it’s on to the next big, shiny feature which promises the world yet delivers nothing. No post-mortems, no retros, no “how can we do better next time?”\n\n\nI truly believe UR has a bright future, but it feels like I’m shouting into the void a lot of the time.",
    "subreddit": "UXResearch",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1722522499.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6593916272041223
  },
  {
    "score": 120,
    "title": "A little advice from the hiring side to academics interviewing for industry UXR roles",
    "selftext": "Recently I was part of an interview panel for a UXR role at a large B2B company. We only interviewed PhD candidates (not sure why). In the spirit of trying to help job seekers, I wanted to share what went well and what didn't. Take this with a grain of salt because our hiring preferences may be different than another company. We only asked STAR questions, no presentations of portfolio projects.\n\n\\- All the candidates knew their methods. There were zero times we questioned the quality of their work or knowledge of how to conduct research. I have a masters and felt like I could learn from the candidates, which was exciting to me. So I encourage you to own your expertise but **keep the method details on the light side** in STAR questions unless you're asked to explain/defend your study design. One effective way of demonstrating expertise without sounding pedantic was when candidates described needing to explain certain things to their stakeholders, like why they could not use an inappropriate method or ask a terrible leading question. \n\n\\- Someone with applied research experience, not just academic experience, will get this job. Having even 1 small example of industry research really set those candidates apart. The entire panel worried academics wouldn't adjust to industry timelines/standards or would sound too-academic for our stakeholders. Those who not only knew how to be flexible but could show they did that with industry examples (even just 1 internship) are at the top of the list. **Learn industry jargon** (stakeholders, cross-functional partners, slide decks, share outs, KPIs, etc) **and norms** (maintaining good stakeholder relationships, writing engaging reports, etc). At a minimum, don't describe a 4 month field study as \"scrappy.\" \n\n\\- Some candidates had academic experience relevant to our business. That stood out and allowed them to demonstrate their subject matter knowledge, not just research methods. For the hiring manager, this probably counted more than research expertise. The opposite was true for me where subject matter knowledge was more of a bonus. But I did not get a vote. For those who don't have a study that's directly relevant, **mention something even tangentially related**, if you can. \n\n\\- I have this problem so I'm speaking to myself as well as others when I say to **practice describing your studies** to someone with no knowledge of the topic. Some candidates either didn't share enough context of the problem or went way too far in depth explaining the technology, what they learned from their lit review, etc when we just needed to understand the gist of the problem. I loved hearing people's interesting or unexpected findings. No one held the lack of outcomes/impact against academics. \n\nThat's all I can think of for the moment. Good luck to everyone job searching. I know it's awful. There are so many excellent researchers and way too few roles. ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1757124413.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.475800368148441
  },
  {
    "score": 120,
    "title": "Unemployed for almost an entire year + losing hope",
    "selftext": "I had to move home with family recently because my job search had been so rough. Today I heard back that my last round with Amazon fell through, and they decided to convert someone internally for the role.\n\nI have great industry experience and an engineering degree - if I had known I’d be struggling this hard when I applied 3x to get into a program with &lt;1% acceptance rate, I would’ve chosen underwater basket weaving instead.\n\nIt seems like jobs are picking up in the new year, but also my previous coworker from Meta told me recently that they have a big round of layoffs coming up. Nowadays I feel like I’m hunting the head hunters.\n\nWhat are your guys’ predictions for the industry? Where do you guys recommend focusing your energy in the job search?",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1737765562.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6491642861572373
  },
  {
    "score": 118,
    "title": "Most of my time is spent convincing someone to let me do my job. Does anyone else feel this way?",
    "selftext": "I’ve been a UXR for 10+ years with progressive advancement. I’ve worked for small and large companies, including FAANG. \n\nBut every single place I go it feels like I’ve got at least one product manager who I’ve gotta convince to let me do research. I can’t get budget to do what I need to do without getting them on board. \n\nI spend more time convincing people that research is better than guessing than I spend actually working on research projects, and I’m going to burn out. \n\nWhat other profession out there spends this much time convincing people to let them do work, besides service providers?? Can you imagine if corporate attorneys had to convince people to let them do their job? They’d all quit! \n\nSo I guess this is a bit of a rant, but I’m curious for anyone who doesn’t feel this way… what’s it like? How’d you get there?  ",
    "subreddit": "UXResearch",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 118,
    "downs": 0,
    "created_utc": 1723847366.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.637171606591481
  },
  {
    "score": 116,
    "title": "Google cloud just laid off all uxrs bellow L6.",
    "selftext": "\nhttps://www.linkedin.com/posts/annawupsu_many-of-quant-uxrs-in-my-team-got-impacted-activity-7378836795133923328-xyqc?utm_source=share&amp;utm_medium=member_ios&amp;rcm=ACoAAFjwSrwBzbf50WJyLTYE6rYjdcX44Pyvmo8\n\nhttps://www.linkedin.com/posts/cnchapman_the-end-of-tech-as-a-big-family-activity-7378652557549899776-tP__?utm_source=share&amp;utm_medium=member_ios&amp;rcm=ACoAAFjwSrwBzbf50WJyLTYE6rYjdcX44Pyvmo8\n\n",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 116,
    "downs": 0,
    "created_utc": 1759273834.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.715110407114789
  },
  {
    "score": 118,
    "title": "How I recently moved into a Head of UX role from UXR and why I think the future of UXR is bright",
    "selftext": "**Context:** I recently (in the last half a year) moved from a UXR role to a Head of UX role. I'm in a small company with only a handful of designers. During a period of transition for the business, when there were inevitable layoffs, I put forward a strong case for why we need UXR, and why it should be at the absolute core of how we think about UX (rather than being designer-led).   \n\n\nI shared the below with the CEO (I have removed/blanked out some of it for confidentiality) and was successful in getting them to buy into my view of things. I'm not saying this would have worked elsewhere; a lot depends on stakeholders, experience with UXR and business needs, but I thought that it might be a useful thing to read if you currently feel a bit negative about the potential future of UXR.   \n\n\nAlso, if you're reading this as a designer with strong research skills - please don't hate me. Know that what I wrote below had to be deliberately bold and confrontational, and very much targeted at the portion of UX folk who do just do design work, and don't have the time/resource/knowledge to do research along with it.   \n\n\nThe piece starts below:  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n\n\n**Why this, Why now**  \n\n\nWe are sitting at the precipice of a technological revolution that will disrupt and fundamentally change our world.\n\nEngineering-driven artificial intelligence will be at the very heart of ###Company###. \n\nFor the possibilities of this breakthrough technology to be realised, we must accompany engineering effort with equivalent effort from a team dedicated to understanding how to achieve mass adoption, engagement and retention from end-users.   \n\n  \n**The State of UX** \n\n2010 through 2020 saw an explosion in the popularity and demand for UX thinking. This was driven by the fact that businesses who were creating new technological paradigms (smartphones, apps, websites) needed to achieve mass-adoption, rather than building products suited to only the tech-savvy.\n\nUX Design (a subset of UX) was the real driving force behind this evolution of the discipline. Businesses already needed designers to create UI, and if those designers adopted a UX philosophy, the business would eventually realise the value of UX as a whole. Businesses who built successful products typically utilised an embedded UX team who ran a process of testing with end users, and iteratively designed based on the insights they gathered. \n\nIn 2024, we will be in a new era for UX. At large, businesses now understand there is a critical need to focus on the end user if they are to build a successful product. While a decade ago a UX Designer could identify and fix broken design patterns and ill-thought out journeys - now, the apps, websites and tools we use have become much more homogenous, with consistent design metaphors and UI approaches now widely adopted. \n\nThis does not dismiss the need for, nor the value of, UX Design - it is just as essential now as ever. But the challenge now lies in how UX holistically approaches innovation and problem solving. Design being the driving force behind UX is no longer working. This is because the questions we need to answer are much bigger than design alone can go after. Design does not have the tools to identify and explain the more fundamental and strategic problems for businesses to address, which has meant that Design can often spend time solutionising for issues which are actually symptomatic of deeper problems, which lay dormant without research to pinpoint them. \n\nFor signs that that this is indeed the case, [see the fall down and struggles of IDEO, the pioneers of ‘Design Thinking’](https://www.fastcompany.com/90976682/design-giant-ideo-cuts-a-third-of-staff-and-closes-offices-as-the-era-of-design-thinking-ends) as well as the major layoffs of Designers by nearly all major tech players in 2023 (Google, Meta, Spotify, to name a few). \n\n**The Future of UX will be Research &amp; Strategy-led**\n\nAs tech enters this bold new period of innovation, we will see UX enter a much needed period of re-calibration. This will see a shift from a majority of UX specialists who are primarily designers, to a much needed upsurge in UX specialists who are primarily researchers and psychologists. \n\nThis will occur as the need for design work stabilises, yet the need for researchers and strategists who can deeply understand the psychology of everyday people, and figure out how this can be leveraged by AI-focused tech companies, takes hold. \n\nIt is worth noting that this type of thing did actually happen (just at a smaller scale) at the outset of the last tech boom - many of the most successful companies of the last decade (Instagram, LinkedIn, Snapchat, etc) [built the foundations of their success on BJ Foggs behavioural principles](https://www.vox.com/2018/8/8/17664580/persuasive-technology-psychology) \\- they deeply understood how to make tech that people feel compelled to use repeatedly (whether they used this knowledge responsibly is another matter). \n\n**Evidence of the need for research-led UX in the AI revolution**  \nIn evidence that the above is correct, and that UX will indeed play an integral part in the success of AI-focused companies - we have already seen multiple thought-leaders in the tech space voice their belief that the future of AI-User interaction cannot be chat alone; and that much thought is required to understand how to reveal the capabilities of AI and to maximise the usefuless of these systems for every-day people, much in the same way as the Graphical User Interface did for computing (see [Benedict Evans](https://www.ben-evans.com/benedictevans/2023/10/5/unbundling-ai), and [Jakob Nielsen](https://www.uxtigers.com/post/ai-articulation-barrier) for examples of these think-pieces). \n\nAdditional evidence comes from the moves that key players in this space have started to make. As an example, Google have publicly put in place a [Head of UX for their Responsible AI initiative](https://medium.com/people-ai-research/meet-ay%C3%A7a-%C3%A7akmakli-googles-new-head-of-responsible-ai-ux-d8f2700df95b). This is because Google has recognised the need for UX-thinking when building new products, especially when initiatives have started with tech first, rather than problem first. It is [predicted by leading experts](https://jakobnielsenphd.substack.com/p/classic-usability-ai) that for AI companies to see long-term success, they need a headcount of at least 10% UX professionals. \n\nFinally, it is worth considering the journey we went on with #####. ###### originally had a team of UX Designers, who worked on clearly defined UI and Design problems. However, it was only when specific UX Research resource was brought in that more fundamental questions were identified, such as who ###### is for, and how we design for their behaviour and expectations. This is a brilliantly pertinent example of how design-led UX typically fails to address or even spot the bigger problems; therefore making any design work constrained to the limited knowledge of the problem space they are solutionising for. \n\n**In Summary** \n\nUX thinking will be critical if we are to successfully bridge the gap between AI capability and user behaviour. While past UX has been design-led, it is crucial that we make our UX team research and strategy-led if we are to effectively identity and target the right opportunities to design solutions for.\n\n&amp;#x200B;",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 118,
    "downs": 0,
    "created_utc": 1710521882.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5406219505524836
  },
  {
    "score": 110,
    "title": "Qualitative interviews &amp; calls - SaaS tools vs AI tools for analysis quality?",
    "selftext": "I'm a product marketer looking to do some in-depth analysis of a large number of sales calls and user interviews (about 400 calls and 50 interviews). I have the transcriptions for everything so not worried about that part.\n\nI know there are a ton of tools out there which are purpose built for this, though based on my limited testing, the analysis I get from tools (like Dovetail) is never as good as when I work directly with top tier models like Gemini 2.5 pro.\n\nI am assuming that SaaS tools do not want to use the most expensive models to save money, but for my purposes I would rather use a latest and more powerful model, even if it costs more.\n\nAny thoughts?  \nAre there any SaaS tool options that let me choose my own model or bring my own API key?",
    "subreddit": "UXResearch",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 110,
    "downs": 0,
    "created_utc": 1759429544.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.476186896795454
  },
  {
    "score": 107,
    "title": "UXR is getting massacred. What does the future of this job even look like?",
    "selftext": "Man, the situation is dire. I’ve recently had the chance to talk with colleagues in other corps who have been going through layoffs - UXR teams are getting gutted to annihilated. What effect does this have on our discipline, as a whole? Where do all these people go? What effects will this have on our “core values” - human-centricity, for starters. I’ve witnessed so many conversations about how we just have to “focus on profits” from now on - and like, ok. But what a spectacular fall from the loftier ideals we held just a few years back.\n\nI am sorry to bring a bit of a bummer perspective. I have personally not been impacted (yet) but I am feeling increasingly anxious about the state of our discipline. With layoffs on one side, and pushes for ever increasing “democratisation” on the other, it really feels like we are looking at a possibly permanent downsizing &amp; re-thinking of the industry. And that sucks.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 107,
    "downs": 0,
    "created_utc": 1683235512.0,
    "media": null,
    "is_video": false,
    "num_comments": 90,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.710444451647497
  },
  {
    "score": 109,
    "title": "Has Qual analysis become too casual?",
    "selftext": "In my experience conducting qualitative research, I’ve noticed a concerning lack of rigor in how qualitative data is often analyzed. For instance, I’ve seen colleagues who simply jot down notes during sessions and rely on them to write reports without any systematic analysis. In some cases, researchers jump straight into drafting reports based solely on their memory of interviews, with little to no documentation or structure to clarify their process. It often feels like a “black box,” with no transparency about how findings were derived.\n\nWhen I started, I used Excel for thematic analysis—transcribing interviews, revisiting recordings, coding data, and creating tags for each topic. These days, I use tools like Dovetail, which simplifies categorization and tagging, and I no longer transcribe manually thanks to automation features. However, I still make a point of re-watching recordings to ensure I fully understand the context. In the past, I also worked with software like ATLAS.ti and NVivo, which were great for maintaining a structured approach to analysis.\n\nWhat worries me now is how often qualitative research is treated as “easy” or less rigorous compared to quantitative methods. Perhaps it’s because tools have simplified the process, or because some researchers skip the foundational steps, but it feels like the depth and transparency of qualitative analysis are often overlooked.\n\nWhat’s your take on this? Do you think this lack of rigor is common, or could it just be my experience? I’d love to hear how others approach qualitative analysis in their work.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 109,
    "downs": 0,
    "created_utc": 1735305846.0,
    "media": null,
    "is_video": false,
    "num_comments": 64,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.652849363479653
  },
  {
    "score": 102,
    "title": "Your manager and team (and culture) make alllll the difference",
    "selftext": "For those of you who feel unappreciated and like you’re screaming into a void, let me share my experience in how different things are as a researcher when you have a team that values your work. \n\nIn a previous role, I had my boss (a VP of product) constantly question my value and skills, despite lots of other feedback from folks that everything I was doing was making huge differences for the company. I had very few resources, so I had to be scrappy, and I was expected to both build research ops AND conduct high volumes of research myself, so I was set up to fail. It really shook my self esteem and confidence, and I began to doubt whether or not I was as good as I thought I was. \n\nIn my most recent role, I have had a researcher for a boss. I have been given resources to get things done AND been given the appropriate time to do them. \n\nI’ve done extraordinarily well, to the point that my boss is considering me to take over their role if they leave. \n\nYes, you can influence.\n\nYes, you can always get better at evangelizing and quantifying the impact of your work.\n\nBut sometimes? It’s not you. Sometimes it’s the org/boss/team.  ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 102,
    "downs": 0,
    "created_utc": 1744740287.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.993897852065003
  },
  {
    "score": 101,
    "title": "5 Months, A Career Pivot, &amp; Finally Landing an Offer—Here’s What Happened",
    "selftext": "Disclaimer: I'm not sure if this is allowed here. If it's not I understand if it gets removed.\n\nI’m sharing my experience in case it helps someone.\n\n————————————-\n\nI was laid off in September—the same month I was relocating to the UK. My employer had promised to adjust my salary after moving, but instead, I got on a call and was told, “This will be your last month.” I had only that paycheck to rely on while figuring out my next steps.\n\nI started applying for jobs in October and for the first two months, I was applying for Product Design roles. I had two interviews—one where I made it past the phone screen but chose not to move forward, and another where I was ghosted despite a great conversation. It didn’t take long to realize that I wasn’t excited about the roles I was applying for.\n\nThen I made a decision that caused my family to raise an eyebrow. Instead of staying in Product Design, where demand was high, I pivoted to Service Design and UX Research—fields with fewer available roles. It was risky, but I wasn’t just looking for money—I wanted job satisfaction and balance.\n\nAt first, I focused on Service Design and got one interview in about two weeks. But I quickly realized that service design openings were even scarcer than I expected. So, I expanded my applications to include UX Research—where I actually had more experience, even though my past job titles didn’t fully reflect it.\n\n####**Some of the lessons learned and applied**:\n\n####**I Stopped Counting Applications &amp; Following Every Piece of Advice**\n\nI must have applied to about a hundred jobs—probably more, but I stopped tracking the numbers because it only made things worse. I also realized I was getting lost in all the advice about tailoring CVs—so I stopped.\n\nI had 7+ years of experience across research, service design, and product design. It didn’t make sense to keep tweaking my CV for every job when the same experience could be framed in a dozen different ways. Instead, I made one strong CV that actually represented me.\n\nI also set up filters to move rejection emails into a folder so I didn’t have to see them. I stopped telling myself “they’re rejecting me,” and instead thought, “they’re rejecting my application.” It helped separate the outcomes /rejections from my self-worth and also made me more open to feedback and iterations.\n\n####**Using AI (But Not in the Way People Warn About)** \nI know there’s a lot of stigma around using AI for job applications and those are valid, but it was a huge part of my process that helped stay detached and efficient. Here’s why.\n\n- I struggle to articulate my achievements concisely, so I used ChatGPT, Claude, and Perplexity to refine my CV and better express my impact.\n\n- It didn’t write my CV for me—I used it to tighten my language and improve clarity.\n\n- I also used AI for cover letters—but again, as a tool, not a replacement for my own voice. I made sure that it did not inflate, make up experiences or try to fill in any gaps on my behalf.\n\n####**January Shifted Everything**\n\nI started applying for UX Research roles in December but knew companies wouldn’t start moving until January. I also revamped my LinkedIn, and a recruiter reached out to me for a contract gig. That opportunity later fell through due to timeline shifts, but it gave me a confidence boost.\n\nBetween January and February, I started seeing real movement:\n\n- Four more interview invitations.\n\n- Two companies moved me to second stage.\n\n- One company actually aligned with what I wanted—and I got an offer.\n\n####What Made This Time Different?\n\nI’ve been through a long job search before. A few years ago, I spent eight months unemployed, anxious every single day. When I finally got a job, I regretted wasting so much of that time in stress.\n\nThis time, I refused to let that happen again. I stopped obsessing over rejections. I applied to jobs in a way that worked for me, not the “perfect strategy.” I detached my self-worth from every outcome.\n\nI know five months isn’t the longest job search ever, but at times, it still felt endless. The biggest thing I learned? There’s no single “right” way to job search—just the one that actually works for you. It took me some iterations to finally settle on these methods.\n\nThat said, I also recognize that I had family and friends supporting me, so I didn’t have to worry about rent or food. That made a huge difference. But even with that safety net, the transition was still difficult—going from a place where I was financially independent to suddenly relying on others was not easy for me. I know that having this support is a privilege, and I want to acknowledge that.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 101,
    "downs": 0,
    "created_utc": 1740249923.0,
    "media": null,
    "is_video": false,
    "num_comments": 22,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.424464089770714
  },
  {
    "score": 95,
    "title": "not sure if this is allowed but I wanted to share my UX research templates I've built",
    "selftext": "Hey all!\n\nI work as a lead UX Researcher and have been building a department for the last 9 months-ish. In doing so I've also built templates to set research projects up quicker. And I've collected those in notion &amp; figma which I wanted to share with you. \n\nhttps://link.medium.com/3lHbQAnOKxb\n\nNot sure if this is allowed but thought it could be useful to other UX researchers. And if it's not allowed feel free to remove my post again! If it is allowed, have fun with the templates and let me know what you think 😁",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1677482986.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.367786230871559
  },
  {
    "score": 91,
    "title": "I should have never quit my job.",
    "selftext": "I left my job at a start-up 3 months ago to focus on breaking into my first UXR role. The startup role was somewhat related to UXR but just barely.\n\nI graduated in the Spring of 2023 with a bachelor’s degree in Industrial Design. During my time at design school, I discovered I had a passion for UXR. I have 10 years of experience working in the medical field and 2 years working for a start-up.\n\nI’ve applied to over 100 jobs and have not received 1 call back for a UXR role.\n\nMy mentor says I have a portfolio that is better than most starting UXRs.\n\nI’ve revised my resume and portfolio multiple times. I network in real life and on LinkedIn.\n\nI can’t tell if I am doing too much or too little. I did not realize that the market was going to be so hard to break into. I’m trying not to give up and lose momentum.\n\nAre there any UXR networking events coming up in Chicago? Can you all let me know how you got your start in UXR?  \n\n\n2/23 Update: I did not think this would get so many eyes. EVERYONE'S feedback has been so valuable I could cry. Your feedback and critiques have made my week and have energized me to work on that resume this weekend. ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 91,
    "downs": 0,
    "created_utc": 1708648827.0,
    "media": null,
    "is_video": false,
    "num_comments": 60,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.561452744850939
  },
  {
    "score": 86,
    "title": "UX research: are we done as a profession??",
    "selftext": "I got DOGE'd from the feds in march. Been looking ever since. There are maybe 2 (sketchy) job posts per week on linked in, indeed etc. I have trouble even filling out my unemployment.\n\nUX designers, which just means \"designers\" is thriving, but no one gives a flying fuck any more about the strategy, research etc. portions of the effort. I think this is a mistake but then I'm not the owner of a product company so what do I know?\n\nThoughts? If there's some secret cache of jobs too please LMK I'm about to lose my house",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 86,
    "downs": 0,
    "created_utc": 1761022420.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.6206548691384026
  },
  {
    "score": 85,
    "title": "Giving up",
    "selftext": "I’m giving up. Been searching for a job for 2 years now. I have 4 years of experience at a FAANG company, a UX Master Certification from Nielsen Norman Group which costed over $20,000 to get, and a bachelors degree in HCI, and I can’t even get interviews. This whole experience has been so demoralizing and stressful I’m ready to pivot into another field that has a real demand and better job security. This is awful and I’m sorry for anyone else going through this. ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 85,
    "downs": 0,
    "created_utc": 1755859482.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4736047081312393
  },
  {
    "score": 86,
    "title": "Vent post: this job market is unbelievably terrible!",
    "selftext": "I know this is old news and there's a post like this every week, I just want to vent to some like-minded folks. \n\nThis job market sucks!! I've had 4 interviews in a year, 2 final round, but no offer. I'm lucky enough to be employed so I've been selective about what jobs I apply to, but still only 4 interviews out of about 70 applications!! And I've ramped up my volume in 2025 and it's been absolute crickets. I would apply to more but there literally aren't more jobs to apply to that match my experience level, location, and salary requirements (nothing crazy just not less than what I make now.)\n\nAnd it seems like with a recession around the corner things are only going to get a lot worse, so there's no hope for relief at all. So demoralizing! ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 86,
    "downs": 0,
    "created_utc": 1744219725.0,
    "media": null,
    "is_video": false,
    "num_comments": 39,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4680492482825995
  },
  {
    "score": 86,
    "title": "Feeling existential as PMs at my org have started using AI to synthesize interviews.",
    "selftext": "The PMs at my org have started using AI to synthesize interviews and are presenting this in team meetings. I am the only UX research on the team, so understand that they see this as a way to increase efficiency. \n\nIn the last month or so, as they have increased the use of AI work I have noticed that the PMs have shifted away from using my scripts and research planning and started to book meetings with internal and external shareholders without me, and then proceed to AI synthesize their finding and create share-outs. \n\nI would love to hear some lived experiences around this topic and how to dealwith this existentialism that I am feeling. How can I continue to add value through the lens of UXR in a growing AI solutions workforce.",
    "subreddit": "UXResearch",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 86,
    "downs": 0,
    "created_utc": 1738183695.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4207182515680965
  },
  {
    "score": 83,
    "title": "Layoff Hopelessness…",
    "selftext": "I just got laid off my UXR role. I didn’t see it coming at all, due to the record profits my company had, and the essential nature of my role in our department. Idk why, but this has just shaken me to my core. I feel hopeless. I am struggling psychologically (despite my privilege in having great mental health support - and I do mean excellent). I’ve lost nearly all motivation, and just see everything as entirely pointless. I don’t even want to apply for jobs despite my half decade of experience because I just assume I won’t get them and I see absolutely no point in months and months of job hunting to find one thing that’s not even going to make me happy and might lay me off again. No job of any kind sounds good to me. Travel doesn’t sound good because I don’t have the funds. I can’t move back with family…Just venting and looking for community, empathy, similarities, hopeful stories etc. ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 83,
    "downs": 0,
    "created_utc": 1740334332.0,
    "media": null,
    "is_video": false,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3824611681413748
  },
  {
    "score": 79,
    "title": "Dark Patterns in Mobile Games",
    "selftext": "Hello! I’m currently exploring user susceptibility to dark patterns in mobile games for my master’s dissertation. Before launching the main study, I’m conducting a user validity phase where I’d love to get feedback on my adapted version of the System Darkness Scale (SDS), originally designed for e-commerce, now expanded for mobile gaming. It’s attached below as an image.\n\nI’d really appreciate it if you could take a look and let me know whether the prompts are clear, unambiguous, and relatable to you as a mobile gamer. Any suggestions or feedback are *highly* appreciated. Brutal honesty is not only welcome, it's encouraged!\n\nFor academic transparency, I should mention that responses in this thread may be used in my dissertation, and you may be quoted by your Reddit username. You can find the user participation sheet [here](https://drive.google.com/file/d/1UodJOweO_liYe4oYOnwwyaFifmj2_hiP/view?usp=drive_link). If you’d like to revoke your participation at any time, please email the address listed in the document.\n\nThanks so much in advance!",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 79,
    "downs": 0,
    "created_utc": 1751842309.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.373829445513071
  },
  {
    "score": 78,
    "title": "Bad experience as a UX Research Contractor",
    "selftext": "I just wanted to share an experience I had . \nI have 8 years of experience as a UX Researcher 5 of them at Google as a Full time employee. I got laid off in 2024 and to pay my bills decided to take up contract gigs as FTE  roles have been hard to land.\nFor that, a few months back I went through two rounds of interviews for a Senior UXR position at $75/hr as a contractor . Both hiring managers were very excited about bringing me on, and an inside source shared that they were hoping I could be converted to full-time.\n\nFrom the start, things were confusing. It wasn’t clear who my actual manager was. The person listed as my manager in the system (who signed off my timesheets) never met me nor responded to my messages. The other hiring manager, who acted like my manager, didn’t have that official role.\n\nThere was no onboarding documentation and no meaningful support provided. I was immediately asked to run an important research study with high impact. Here I also discovered I hadn’t been hired as a Senior UXR as promised, but as a UXR II which they initially claimed was equal to a Sr role at the company. When I raised this, the manager I had access to got defensive, so I let it go.\n\nWhen I asked for approvals (Qualtrics, participant recruitment tools) and templates, I received no support—only lectures about eye-tracking studies I wasn’t equipped to do. When I clarified that I had done what I could and needed a manager’s sign-off in the system to move forward to access tools, she grew frustrated. After approvals finally came through, the system took some time processing it, yet she demanded immediate recruitment and I showed her how our approval was still being processed and I was still blocked. She eventually unblocked me by creating a new project herself that day—but not before calling my agency to complain how incompetent i was and would be terminated by June 11 if I didn’t improve my performance.\nLater she sat in on all my research sessions. Despite the calendar invites explicitly asking observers to mute and keep cameras off, she left her camera on, didn’t mute, and repeatedly spoke over me. At one point, in clear frustration, she cut me off mid-session and directly asked the participant, “What is going through your mind while you are looking at the UI?”—something I deliberately ask after a participant has had a chance to digest and process what they’re seeing. It felt as if she wanted to signal that I wasn’t even capable of asking basic questions.\n\nYet I ran studies, delivered a strong deck with user clips that was well received, and proactively took on more work. June 11 came and went—nothing happened. I thought I had turned things around. When I asked for feedback directly, the manager told me she couldn’t provide feedback directly, only through the agency per policy, so I kept on working.\n\nThen, out of the blue, at 5 PM last evening, my agency called and shared that today was my last day, and my system access would be cut off in 30 minutes. The reason? Supposedly I had asked a “leading question” in a user interview—making me unfit to be a UXR II contractor at $75/hr, despite 8 years of experience.\nNo specifics were shared, no explanation, no 2 weeks notice . \n \nThis wasn’t just insulting. It was dehumanizing.\n\nI took the 30 mins to send a quick email of what had occurred and how I was treated by my disorganized manager, to the team and her skip. \n\nUpdate:\nThank you all for the support and understanding. I agree it’s important to call out that the company was Intuit, which had recently gone through a massive round of performance-based layoffs.\nLike many big companies right now, much of the full-time staff operate under a cloud of fear — trying to run fast, show quick impact, and avoid the next wave of cuts. In the rush, contractors often become the scapegoats: given no credit for good work, included just enough to take the blame when things go wrong.\nAll in all, contract gigs in this environment — with so much fear and instability — are not good for mental health, so make an informed decision if you have to take up one. ",
    "subreddit": "UXResearch",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 78,
    "downs": 0,
    "created_utc": 1750567308.0,
    "media": null,
    "is_video": false,
    "num_comments": 44,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.4742333481781134
  },
  {
    "score": 75,
    "title": "Quick Vent",
    "selftext": "I’m really getting tired of this field. I went to grad school for human factors, worked my ass off and landed a job in big tech after a few years in industry, was impacted by mass tech layoffs last year, and am now wondering wtf is going on with the industry. \n\nThis industry is over saturated with boot campers, pseudo-researchers, and really really shallow UXR leadership. There’s so many people with more seniority than me that couldn’t describe the difference between basic research methodology or interpret a simple t-test result (not meant to be a dig at my qual researchers. Much love to you all). \n\nBut, because very few people have formal acedemic training in this space, poor “researchers” continue to rise to leadership positions. In addition, the whole “democratize UXR” ethos is killing our practice. If you want to know how to conduct experimentally sound research, go get a degree instead of trying to reduce my expertise down to an oversimplified, one-size-fits all approach.\n\nI just don’t get it. UXR is a hodgepodge discipline void of technical skills and I’m really struggling to find reasons to stay the course at this point.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 75,
    "downs": 0,
    "created_utc": 1689807093.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.314053050801919
  },
  {
    "score": 74,
    "title": "Crazy interview experience",
    "selftext": "I went through a crazy interview experience and want to share my thoughts.\n\nI have been working in big tech companies in the SF Bay Area for the past 11 years - 8.5 years at one company as consumer insights research lead and manager and 2.5 years at another as senior UXR. In July, I was approached by a recruiter from another company who wanted to see if I would be interested in a Senior IC role there. At the time, I wasn't ready to make a change due to personal circumstances, so while I met the hiring manager and was going to move into the technical take-home stage, I politely declined and explained why.\n\nAt the end of September, I felt more ready to make a move, so I reached out to the recruiter to see if they were still looking for someone for that position or another position at that company. They referred me to another open role, which looked interesting and up my alley, so I pursued it. I had an interview with the hiring manager, then a technical interview, and then a panel presentation that took a lot of preparation (not a portfolio presentation but an exercise of formulating questions and creating a research proposal), and then a series of half-hour interviews with 6 stakeholders. The whole process took 2 months.\n\nIt took a few days to up to a week in between each stage to learn about the outcome of that stage, but today, just two days after the last interview, I was told by email that they felt other candidates were a better match for the role. I was also told in that email that if I want feedback, I can schedule time on their calendar.\n\nLet me be clear - it is of course totally, totally fine for them to go with someone else. I have been a hiring manager before, so I also understand what it can be like on that side, and I hope they are finding the person that they are looking for. But at the same time, in my opinion, it is not OK to ask someone to go through that rigorous and time-consuming of a process, to then not even take the time to call that person to thank them for the many hours they have spent and the high level of effort they put into preparing for and going through the many stages of the process. Perhaps the thinking is, \"This person will be fine / has a job so won't be too hurt by this / etc.\", but it's not about that. It's about reciprocating and showing basic appreciation for someone who took time and care to do something for you - and it can be as simple as a phone call to say thank you. (I have been rejected before after the final round and received a phone call like that - I hope it's not that uncommon, and it's really not hard to do!)\n\nThe market is insane right now, and people are stressed out on both sides of interviewing/hiring, but please remember that we should still be thoughtful and considerate towards each other. We are in the business of user empathy, let's apply that to how we communicate during the interview process too.\n\n**UPDATE:** Based on the reaction to this post, I feel that many of us have unfortunately had this type of experience. While I may not have specific guidance or job leads to offer, I am happy to listen and vent together, and do what I can to support my fellow UXRs. If you need a buddy for this, DM me!",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1732319782.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.384953061700105
  },
  {
    "score": 73,
    "title": "AIO: Warning about using maze!!!!",
    "selftext": "My org is moving on from maze. The price has gotten simply too high.\n\nWe were told that after our plan ends, all of our research will be inaccessible. \n\nWe have hundreds of usability tests and tens of interview studies. I think we've been using it since at least 2021 across 3-4 designers. It could even be longer than that. \n\nHonestly very scummy. It leaves a nasty taste in my mouth. I don't think I'm overreacting by being pretty PO'd and I think it's important for others to know.\n\nAnd please: Any tips on documenting all of our work?? ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1745512654.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.38238297011462
  },
  {
    "score": 76,
    "title": "Job Offer &amp; Stats",
    "selftext": "I’ve been reading here and on LinkedIn about how rough the job market, especially from UXR has been. This is dated at this point, but I’m hoping to provide at least a little glimmer of hope. \n\nI lost my UXR job back in October 2023. In Feb I received a job offer which I accepted and started in March. I’m including my application stats in case that’s helpful. \n\nAll five final round interviews and all eight hiring manager interviews were at places to which I was referred. \n\nI have 5 years of specific UXR experience, but 20 years of ethnographic research experience. \n\nMy own job search took me twice as long this last round as it had in the past from start to finish. ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 76,
    "downs": 0,
    "created_utc": 1717644019.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.2533675256488963
  },
  {
    "score": 72,
    "title": "Why do all our tools suck: a rant",
    "selftext": "This is a rant not a discussion. Feel free to scream into the ether with me. \n\nI am so fucking tired of these \"research\" platforms with absolute dogshit UI and nonexistent basic functionality, you know, like 'skip logic' or 'tracking participants you've invited to the study.’\n\nEvery business school dipshit who thought they could make a quick buck through \"research democratization\" built these shitty platforms for people whose entire understanding of research is “ask question, get answer!”\n\nThen companies shell out thousands for these tools that make life miserable for researchers who want to have any sort of rigor in their research. These tools weren't built for researchers, because if they were shit like \"skip logic\" would be table stakes. \n\nIt makes me miss Decipher -- how was tech from 10 years ago so much better than the programs we have now? We're definitely entering the dark age of user experience, where functionality doesn't matter --- just sell, sell, sell. ",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 72,
    "downs": 0,
    "created_utc": 1765322712.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.329003707037592
  },
  {
    "score": 71,
    "title": "Rejected after first round interview w/ Meta - Requesting feedback on interview answers",
    "selftext": "Hello r/UXResearch,\n\nOn Monday I had a round 1 interview for a qualitative UXR position w/ Meta. This was a 45 minute video interview, although the host and I stayed on for \\~10 minutes because she and I both had additional questions for each other.\n\nFor the question prompt, I had to choose a favorite non-Meta app. I chose Discord.\n\nThe prompt was roughly the following:\n\n* You have six weeks for the following project. Discord has developed two design concepts that they want to be tested. They are early concepts in a wireframe state. Please state what you would do.\n* Team size is 3 UXRs total, yourself included. I asked this question, it was not provided by default.\n\nI took two minutes to write down my plan, and then explained it:\n\n* Week 0: Project plan + schedule creation and approval,  research method selection, team composition\n* Week 1: Discussion guide creation, recruitment through either in-house recruiter or agency\n* Weeks 2-3: Research sessions + documentation as sessions happen\n* Weeks 4-5: Analysis + synthesis. Begin deliverable creation in week 5\n* Week 6: Finalize deliverables and present to stakeholders\n\nI was then asked my research method:\n\n* Three stage research session: First, discussion with test subject of what their expectations and needs are for whatever need the design concept is attempting to address. Second, user interacts with wireframe and provides feedback. (During the interview, I used the term usability testing, but I went back and corrected myself). Third, discuss their reaction and thoughts about the experience, which serves to identify and unify differences between what users say they do and what they actually do.\n* Each concept would be tested with 8-10 participants, for a total of 16-20 research sessions.\n\nI was then asked my analysis method:\n\n* Thematic grouping and affinity mapping. I would use Miro or an equivalent virtual whiteboard tool.\n* Items being group would include both observational notes and direct participant quotes. Session recordings would be transcribed through a service like Otter and good quotes would also be used.\n* The team and I would prioritize findings based on the main research questions. Key \"nuggets\" of backing findings would be attached to each finding.\n\nI was then asked what deliverables I would create\n\n* In depth research report/white paper. This would be for the research team and any other researchers requiring our work for reference in future projects\n* Slide deck: This is what would be presented to project stakeholders\n* One pager with key findings briefly summarized and links to the deck and white paper. For stakeholders and their managers.\n\nSo, the interviewer seemed to like my answers, and the fact that she asked me to stay on past the 45 minute mark seemed like a good sign. However, this morning I got a rejection notice with the usual \"large amount of candidates, this was a difficult decision, and so on\". I have 8 years of experience, I feel like I was more than qualified for the position.\n\nAny feedback on how I can handle these scenario prompts better?",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 71,
    "downs": 0,
    "created_utc": 1721412076.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.5298631281271184
  },
  {
    "score": 74,
    "title": "Creating a Research Dashboard, anyone have done anything similar?",
    "selftext": "Hi, I'm trying to create a research repository/dashboard to help surface the research work done across different projects and to document the work properly. \n\nI wanted to know if anyone has done anything similar or have thought about how research can be better documented for longevity.\n\nAt the moment I'm explore different views for different roles, a persona and insights library, and also a knowledge graph similar to Obsidian's graph view. \n\nWould love to hear your thoughts.",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 74,
    "downs": 0,
    "created_utc": 1753687969.0,
    "media": {
      "reddit_video": {
        "bitrate_kbps": 5000,
        "fallback_url": "https://v.redd.it/g7hqkx35ikff1/DASH_1080.mp4?source=fallback",
        "has_audio": false,
        "height": 1080,
        "width": 1492,
        "scrubber_media_url": "https://v.redd.it/g7hqkx35ikff1/DASH_96.mp4",
        "dash_url": "https://v.redd.it/g7hqkx35ikff1/DASHPlaylist.mpd?a=1770354022%2CZjhjNWRhMWIyODRmYTUxNDI4NjBmOWM3NzgwYWI3ZDBiMjA1NTM2Y2M1NDk2OWZjNzVjMWFhZmJjYzczY2IxNg%3D%3D&amp;v=1&amp;f=sd",
        "duration": 27,
        "hls_url": "https://v.redd.it/g7hqkx35ikff1/HLSPlaylist.m3u8?a=1770354022%2CNDlmNmEzMWMwOWU1OTRlYmQwYzMwODg0Yzg4MzlmODA4ZjM1ZTc1YzYxMzBiMTJhY2QyMzMzNTk5MGU3NWQ2ZA%3D%3D&amp;v=1&amp;f=sd",
        "is_gif": false,
        "transcoding_status": "completed"
      }
    },
    "is_video": true,
    "num_comments": 26,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.3332431454711937
  },
  {
    "score": 73,
    "title": "Our UX studio is using AI in UX Research. Here's what we're learning…",
    "selftext": "After a year of integrating AI tools into our UX research practice, we've discovered the sweet spot for our  human-AI collaboration process that I wanted to share with the community. We're not really interested in the \"AI will replace designers\" narrative because we're finding AI's role to be more subtle and complementary.\n\nHere are some key insights from our experience:\n\n* AI has been a kind of thought partner rather than a replacement. We use ChatGPT for interview script generation and brainstorming. Why? Mostly because it never gets tired 😆. We try exploring different angles and challenge our existing mental models this way. This is particularly valuable when working solo and needing another perspective.\n* It's particularly valuable in \"human-in-the-loop\" workflows. Using Dovetail for interview analysis, we let AI suggest initial tags and highlights, but the meaningful insights come from our review and interpretation of those suggestions. Sometimes the AI surfaces patterns we missed due to our own biases, leading to richer analysis.\n* FigJam's AI features have transformed our collaboration and workshops with clients. While its automatic categorization isn't perfect, it does help organize research findings and identify themes during client workshops *a lot more quickly*. This creates more space for meaningful discussion rather than getting bogged down in administrative tasks.\n* The risks of over-automation are real though. We've learned to be cautious about chaining multiple AI analysis steps together (like going from ChatGPT to Dovetail to FigJam), as each layer introduces potential bias or lost nuance. Having human expertise to validate and interpret AI suggestions at each stage is crucial.\n* Environmental and ethical considerations matter. The computational cost of these tools is significant, so we try to be intentional about when and how we use them. We're also vigilant about potential biases in AI-generated research questions or analysis.\n\nPerhaps most importantly, we've found that AI tools work best when they complement existing research expertise rather than trying to automate everything. They're fantastic for reducing cognitive load and sparking new perspectives, but the human elements of empathy, judgment, and synthesis remain essential.\n\nWe recently shared a more detailed [workshop](https://www.youtube.com/watch?v=F8prWhynDEo) on YouTube about our experiences with these tools and how we integrate them into our research practice if you're interested in a deeper dive into the specifics.\n\nI'm curious about others' experiences integrating AI into UX research workflows. What tools have you found most/least valuable? How do you balance automation with maintaining research quality? What ethical considerations have you encountered?",
    "subreddit": "UXResearch",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 73,
    "downs": 0,
    "created_utc": 1733504091.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.323465947520769
  }
]