[
  {
    "score": 3042,
    "title": "Sex Workers Already Predicted There's A Recession Coming — Here's How They Know",
    "selftext": "\n\nWhile some people anxiously watch the stock market for signs of a recession, others look for more subtle cues that the economy is in trouble.\n\nOne of them is Catherine De Noire, a manager of a legal brothel, a Ph.D. candidate in organizational psychology and an influencer. When business at her brothel unexpectedly dips, De Noire takes it as a sign that the economy is in trouble.\n\nAlthough De Noire is based in Europe, she believes that economic upheaval in the United States “triggers huge uncertainty” across the pond because of America’s global influence. De Noire first noticed a decline in business right after Donald Trump was elected in November 2024, as Americans and the rest of the world anticipated upheaval.\n\nStrippers in the U.S. are also feeling the pinch. Dancer and influencer Vulgar Vanity said that when she first started dancing in 2022, she could earn six figures just by dancing during a handful of big events in Austin, such as the Formula 1 Grand Prix and South by Southwest music festival. This year is different.\n\n“I didn’t even bother working South by Southwest because the first Friday night I attempted to work, I walked into a completely empty club and didn’t make any money at all,” she said.\n\nVanity also says that many of her regular customers aren’t tipping at all or tipping less than half of what they used to. She is quick to point out that she is just one dancer and “obviously not an economist,” but she notes that other dancers and tipped workers are also hurting. Her theory is that her customers are no longer tipping as generously because of rising costs and economic uncertainty. Vanity is worried that this means we are on the verge of a recession or full-blown depression.\n\nThe theory behind the \"lipstick index\" is that when money is tight, consumers substitute costly purchases with cheap luxuries like lipstick.\n\n\nAre these astute women onto something? Indicators like a decline in business at brothels, lower tips for strippers and other nontraditional measures of economic health “have a measure of validity but may be more coincident indicators than leading ones,” said Marta Norton, a chief investment strategist at Empower. While Norton finds this type of anecdotal evidence interesting, she says she looks at more traditional sources of data, especially corporate earnings and the stock market, to predict if a recession is in our future. \n\nBy those traditional measures, “We may be slowing, but we aren’t facing a looming recession. Yet,” she said. De Noire believes that the tariffs Trump announced on what he called “Liberation Day” will “definitely contribute to a further decline and recession.”\n\nNevertheless, the past has shown that nontraditional measures can tell us a lot about the economy’s health. Here are some of the anecdotal indicators of the economy about whether a recession is likely.\n\nThe Brothel Index\n\nAccording to De Noire, business at her brothel usually picks up in the spring once people give up on their New Year’s resolutions and recover from holiday spending. But this year, business is down. She attributes the “huge dip” in earnings at her brothel to customers feeling insecure about the economy.\n\n“There are significantly fewer clients coming in, and the sex workers are reporting noticeably lower earnings,” she said. Although De Noire emphasizes that the top sex workers at her brothel are still earning more compared to the general population, she said some of the highest earners at her brothel are earning about half of what they did during the same time last year.\n\n“We’re seeing clients come in less often, try to negotiate lower prices or stop visiting altogether. We’re also hearing from our workers that more clients are going for the cheapest possible service,” she said.\n\nAccording to De Noire, this suggests that people are saving money or reallocating their spending toward things they see as more essential, likely because they’re preparing for challenging times ahead.\n\nLegal brothels in the U.S. are seeing a similar trend, according to Andrew Lokenauth, a data analyst and founder of BeFluentInFinance.com. He explains that revenue at legal brothels in Nevada is down roughly 20% since last quarter. “My research shows this correlates strongly with discretionary spending trends,” indicating a recession is likely.\n\nThe Stripper Index\n\nStrippers are often the first ones to notice a downturn in the economy. Dancers are “obviously not a priority or household necessity” and “are the first to feel it because we’re the first ones tossed aside,” Vanity said.\n\n“The ‘stripper index’ is one of those odd but oddly effective indicators” of economic health, said David Kindness, a certified public accountant and finance expert. It tracks how much strippers are earning and how often customers are going to strip clubs, he explained.\n\n“When tips slow down and foot traffic thins out, it often means people are holding onto their extra cash,” Kindness explained. According to Lokenauth, Vanity isn’t the only dancer feeling the squeeze, and that’s not a good sign. “Strip club revenue in Vegas is down about 12%,” which could indicate we are headed for a recession, Lokenauth said.\n\nThe Beer Index\n\nWhat type of beer people drink is a “pretty good indicator” of whether a recession is on the horizon, said Jack Buffington, an assistant professor of supply chain management at the Daniels College of Business at the University of Denver.\n\n“Beer is a discretionary spend and a social spend,” so people cut back on how much they spend on beer when they are worried about the economy, he explained. Since it’s much less expensive to pick up a six-pack than to go out for draft beers, how much money people are spending on draft beer, and pricey craft beers in particular, is a harbinger of a recession.\n\n“Craft beer sales are way down,” potentially indicating a recession is likely, Buffington said.\n\nThe Men’s Underwear Index\n\nIn 2008, former Federal Reserve Chairman Alan Greenspan observed that declining sales of men’s underwear likely meant we were headed for a recession. “There’s a concerning trend. Sales dropped roughly 6% over these past months,” Lokenauth says. “Guys only skip replacing underwear when they’re worried about money,” so we may be in trouble, he says.\n\nThe Lipstick Index\n\nThe “lipstick index” “illustrates a seemingly contradictory consumer pattern during economic recessions,” explains Kevin Shahnazari, a data analyst and co-founder of FinlyWealth.\n\nThe Lipstick Index doesn’t just apply to lipstick. The theory behind the Lipstick Index is that when money is tight, consumers substitute costly purchases with cheap luxuries like lipstick.\n\n“In the 2008 recession, cosmetics sales increased, showing that even in tough times, individuals crave tiny comfort purchases that give psychological boosts without a hefty financial outlay,” Shahnazari explained.\n\nFor example, someone might skip a costly facial but buy a $10 lipstick. Or they might skip an expensive dinner out but still buy a $6 latte or a box of expensive chocolates.\n\nToday, cosmetics sales are strong. “MAC and Sephora sales are up about 15%, not a great sign for the broader economy,” Lokenauth said. Moreover, there “is a quiet trend towards lower-cost, no-frills beauty,” and cosmetic sales in drugstores have risen over the past few months, Shahnazari said. This could be a sign we are headed for a recession.\n\nThe Online Dating Index\n\nHow people date can also indicate whether or not we are headed for a recession. Paid subscriptions for online dating services have fallen, even though the total number of users has risen, Shahnazari said. “Free and lower-tier use of dating apps has risen by about 12%, indicating social and financial stress,” he explained.\n\nAdditionally, increased use of online dating apps can be a sign that people are looking for “cheaper entertainment and companionship instead of expensive nights out,” Lokenauth said. “I’ve tracked this metric for years, and it’s scarily accurate,” he added.\n\nThe Hemline Index\n\nHemlines “rise with optimism, fall with doubt,” Shahnazari said. “Although absurd, this psychological anomaly quantifies consumer confidence and social mood,” he explained. Historically, shorter hemlines meant economic optimism, and longer hemlines signaled economic trouble. For example, the happy-go-lucky flappers in the Roaring Twenties wore short dresses, but hemlines got longer during the Great Depression in the 1930s.\n\nCurrently, the Hemline Index is sending mixed signals because recent designer collections are featuring both long and short hems, Lokenauth said. Thanks to fast fashion, hemlines aren’t as clear an indicator as they once were, he explains. However, given the accuracy of the Hemline Index in the past, he thinks it’s worth keeping an eye on the runways next season.\n\n**The Brunette Index**\n\nIf you notice fewer blond hairdos, it could be a sign a recession is looming. “Stylists are often the first to notice economic shifts, and lately, many have mentioned clients asking for easier and cheaper options,” Kindness said.\n\nClients may shift from high-maintenance hairstyles to lower-maintenance natural looks as a way to save money, Kindness explained. There are signs spending at salons is down. If you see formerly blond “recession brunettes” out and about, it might be a sign a recession is coming, he said.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 3042,
    "downs": 0,
    "created_utc": 1745497698.0,
    "media": null,
    "is_video": false,
    "num_comments": 209,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.364411599725126
  },
  {
    "score": 3008,
    "title": "Remembering the stock market crash of 2022",
    "selftext": "It’s easy to forget how short the market’s memory is. I think this community understands it better than anyone else, but it's still worth re-visiting from time to time.\n\nI still remember the last few months of 2022. The S&amp;P 500 was down nearly 25%, the Nasdaq had crashed over 35%, and inflation was out of control. The Fed was hiking rates aggressively, and it felt like a deep recession was inevitable.\n\nGoldman Sachs or JP Morgan (don't remember which) predicted the S&amp;P 500 would go all the way to 3,000. Michael Burry suggested an even bigger collapse taking S&amp;P500 back to 1800. Most investors were convinced this was just the beginning of more pain. Even then people talked about stagflation and going into the lost decade.\n\nMeta, in particular, was the poster child of despair. Down 75%, from $380 to $88. People genuinely thought it would never recover. The ad market was dying. Reels weren’t making money. Zuckerberg was \"burning billions\" on the metaverse. Investors wanted him to shut it all down.\n\nIt wasn’t just Meta. Amazon reported its first unprofitable year after a long time. Google’s ad revenue shrank. Microsoft’s growth slowed. Tesla was down to $113 at its lowest. Institutions were slashing price targets left and right. Investors were selling at the lows, convinced things would only get worse.\n\nAnd then... the market did what it always does. Slowly, things started improving. Companies adapted. Earnings stabilized. The panic faded. By mid-2023, inflation was cooling. The Fed hinted at pausing rate hikes.\n\nMeta posted a solid earnings report. Then came $40 billion in stock buybacks. The stock doubled. Then doubled again. Amazon recovered. Nvidia went on a historic run. The Nasdaq had its best year in two decades in 2023. By early 2024, Meta, Nvidia, and Microsoft were hitting all-time highs to reach even higher by end of 2024. Two years of record gains.\n\nWhen markets are crashing, it feels like they’ll never go up again. When they’re at all-time highs, it feels like they’ll never go down. Neither is true. So just be calm and hold tight. And if you can, keep buying.\n\n*If you found this interesting, read more such ideas and thesis* [*here*](https://thevalleyinvestor.substack.com/p/remembering-the-stock-market-crash)",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 3008,
    "downs": 0,
    "created_utc": 1741880584.0,
    "media": null,
    "is_video": false,
    "num_comments": 568,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.568478320937617
  },
  {
    "score": 2335,
    "title": "Citadel CEO Ken Griffin says 'it's terrifying to watch' as tariffs open doors to crony capitalism",
    "selftext": "The hedge fund titan warned that tariffs lead to crony capitalism as the government picks winners and losers. Speaking on the sidelines of the Milken Institute’s Global Conference, Ken Griffin told *Politico* the Trump administration’s tariff exemptions signal that the U.S. has “already—regretfully—unleashed an era of crony capitalism.”\n\n“Tariffs open the doors to crony capitalism. The government starts to pick winners and losers,” Griffin said. “I thought that would play out over the course of years. It’s terrifying to watch this play out over the course of weeks.”\n\nHe added that the Trump administration’s granting of tariff exemptions for products and industries signal that it’s “very clear that we have roughly already—regretfully—unleashed an era of crony capitalism.”\n\nThat echoes Dartmouth College economist Douglas Irwin, who has warned that Trump’s so-called reciprocal tariffs in particular “would fill the swamp, not drain it,” as lobbying pressure for exemptions to potentially millions of individual rates would be enormous.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 2335,
    "downs": 0,
    "created_utc": 1746968899.0,
    "media": null,
    "is_video": false,
    "num_comments": 160,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.191885776456286
  },
  {
    "score": 1665,
    "title": "Buffett’s Farm Analogy Is Still the Clearest Way to Think About Valuation",
    "selftext": "Buffett once explained business valuation using something as simple as a farm — and honestly, it cuts through all the noise.\n\nImagine you’re looking at a farm 30 miles out. You figure out how many bushels of corn and soybeans it produces per acre, what fertilizer and labor cost, and what you’re left with .. say, $70 per acre in profit.\n\nThen you ask a simple question:  \n*How much would I pay to earn $70 a year forever?*\n\nIf you want a 7% return, you’d pay $1,000. If the farm is going for $900, it’s a buy. If it’s $1,200, you pass.\n\nThat’s it. No drama, no daily price tracking, no CNBC.\n\nBuffett says investing is just that ,,,,figuring out how much cash a business can produce over time, and what you’re paying for it. That’s intrinsic value.\n\nAnd you don’t need to have an opinion on every stock. Most go into what he calls the “too hard” pile. The goal isn’t to be right about everything  it’s to wait for the few things that are easy to understand and priced right.\n\nYou don’t need to jump seven-foot bars. Just step over the one-foot ones.\n\nThat’s value investing.\n\nIf you want to learn more about this kind of thinking — simple, timeless investing without the noise — I break it down weekly in my newsletter:  [lazybull.beehiiv.com](http://lazybull.beehiiv.com) 🐂",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1665,
    "downs": 0,
    "created_utc": 1746758208.0,
    "media": null,
    "is_video": false,
    "num_comments": 186,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.077595800339018
  },
  {
    "score": 1665,
    "title": "Buffett warned: “If the ratio approaches 200%, you're playing with fire.”=&gt; We are above!",
    "selftext": "Buffett Indicator, (which compares total U.S. market cap to GDP), [is now at 208%](https://alert-invest.com/buffetts-favorite-indicator-hits-208-its-time-to-get-back-to-real-investing/). That’s above dot-com levels. I wasn’t around in 1999. But I’ve read enough to know everyone thought it was different back then too...\n\nNow,  It’s AI. And yes it’s real, it’s big, and it will transform everything.  \nBut here’s what’s bugging me: Which part of the AI hype do you think is most overrated?  \nAnd which sectors are just getting started?\n\nand also curious to hear from people who did live through 1999:  \n\\- What felt the same?  \n\\- What’s different?\n\nI track moves from top value investors with a free email alert (https://alert-invest.com/), and lately I’ve noticed they’re cautious, finding fewer real opportunities in this market.\n\nThanks!",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1665,
    "downs": 0,
    "created_utc": 1752248538.0,
    "media": null,
    "is_video": false,
    "num_comments": 684,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.359520282816981
  },
  {
    "score": 1585,
    "title": "Buffett's alternative to tariffs is seriously brilliant (Import Certificates)",
    "selftext": "I'm honestly not sure how this hasn't been brought up more, but Buffett actually has a beautifully elegant alternative to tariffs that solves for the trade deficit (which is a very real problem, he said in 2006.... \"The U.S. trade deficit is a bigger threat to the domestic economy than either the federal budget deficit or consumer debt and could lead to political turmoil...\")\n\nHere's how Import Certificates work...\n\n* Every time a U.S. company exports goods, it receives \"Import Certificates\" equal to the dollar amount exported.\n* Foreign companies wanting to import into the U.S. must purchase these certificates from U.S. exporters.\n* These certificates trade freely in an open market, benefiting U.S. exporters with an extra revenue stream, and gently nudging up the price of imports.\n\nThe brilliance is that trade automatically balances itself out—exports must match imports. No government bureaucracy, no targeted trade wars, no crony capitalism, and no heavy-handed tariffs.\n\nBuffett was upfront: Import Certificates aren't perfect. Imported goods would become slightly pricier for American consumers, at least initially. But tariffs have that same drawback, with even more negative consequences like trade wars and global instability.\n\nThe clear advantages:\n\n* **Automatic balance:** Exports and imports stay equal, reducing America's dangerous trade deficit.\n* **More competitive exports:** U.S. businesses get a direct benefit, making them stronger in global markets.\n* **Job creation:** Higher exports mean more domestic production and, consequently, more American jobs.\n* **Market-driven:** No new bureaucracy or complex regulation—just supply and demand at work.\n\nI honestly don't know how this isn't being talked about more! Hell, we could rename them Trump Certificates if we need to, but I think this policy needs to get up to policymakers ASAP haha.\n\nEdit: removed ‘no new Bureaucracy’ as an explanation for market driven. It def does increase gov overhead, thanks for pointing that out!\n\nHere's the link to Buffett's original article: [https://www.berkshirehathaway.com/letters/growing.pdf](https://www.berkshirehathaway.com/letters/growing.pdf)\n\nWe also made a full video on this if you want to check it out: [https://www.youtube.com/watch?v=vzntbbbn4p4](https://www.youtube.com/watch?v=vzntbbbn4p4)\n",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 1585,
    "downs": 0,
    "created_utc": 1745005037.0,
    "media": null,
    "is_video": false,
    "num_comments": 424,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.18949764800674
  },
  {
    "score": 1347,
    "title": "I Just Sold All My Google Shares",
    "selftext": "I bought GOOGL (not GOOG) at a 19 trailing P/E during. Now it’s at 32 trailing P/E and I am up 100% with life changing money.\n\nMy job is far from stable, relies significantly on the AI story to continue, and lays-off people for “culture” reasons.\n\nWith this in mind, I sold all of my Google shares at $226 per share to “de-risk” other parts of my life.\n\nI will still continue to look for other opportunities with new income I have.\n\nI get valuation this, growth prospects that, but is selling for increasing financial security the right decision?\n\nOr am i just a 🤡?\n\nEdit: I meant $326 per share.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 1347,
    "downs": 0,
    "created_utc": 1764094919.0,
    "media": null,
    "is_video": false,
    "num_comments": 438,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.148422152320362
  },
  {
    "score": 1180,
    "title": "Did people learn nothing from April",
    "selftext": "If you were fully invested in the S&amp;P 500 over a long period (usually 20–30 years), your returns were great.\n\nBut if you missed just the 10 best single days in that entire period, your return was cut roughly in half.\n\nThis is probably the most commonly cited anecdote as to why you should not time the market. I feel in at least half the investing books I've read, they mention this. I do not know of a single investor who has successfully timed the market consistently over any meaningful time period. Even Michael Burry, who is probably one of the most infamous investors for predicting the 08-09 recession, has wrongly called a market top an absurd number of times in recent years. \n\nBack in April, the market starts to sell off, and inevitably posts start popping up all over the subreddit talking about how they're selling and why they're selling and why this time is different. Of course, it wasn't different, and the market has proceeded to rip 20% since many folks here panic sold. \n\nHere we are, not even a year later in December, and people are asking unironically whether it's a good idea to move to cash or not. What do you think? Do you think that now is the time to finally start trying to time the market? After this age-old wisdom has been proven right, time and again? \n\nI feel like there's so many better ways to navigate an expensive market than by trying to time it. \n\nSuch as buying counter-cyclical companies, or buying companies that are recession-resistant, or buying companies at a larger margin for error. Heck, maybe even give bonds a shot?  But no. People are starting to come to the conclusion again that now is the time to time the market yet again and inevitably make a massive mistake. \n\n\nDO NOT TIME THE MARKET.\n\nEdit: This sub unironically defending timing the market lmao. The reason why this hurts people's feelings is because they sold back in April, and they're still waiting to get back in the market. Instead of taking a lesson, they double down on that timing the market is the correct thing. Whatever.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 1180,
    "downs": 0,
    "created_utc": 1765406961.0,
    "media": null,
    "is_video": false,
    "num_comments": 369,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.031350759647013
  },
  {
    "score": 1084,
    "title": "Energy Stocks Are Still Cheap… and Nobody Seems to Care",
    "selftext": "Everyone is freaking out about how “expensive” the S&amp;P 500 looks. Record highs. AI hype everywhere. Nvidia memes. You know the drill.\n\nBut here’s what most people miss:\n\nThe S&amp;P 500’s big valuation problem is basically seven stocks. Apple, Microsoft, Alphabet, Amazon, Meta, Nvidia and Tesla (the Mag 7) now make up almost a third of the index. They trade around 31x forward earnings. That pumps up the whole index average.\n\nNow take those 7 out of the picture.\n\nThe other 493 companies suddenly look way more normal. Roughly 20x forward earnings. Slightly above history, not “bubble mode.”\n\nAnd here’s the interesting part for anyone hunting for value…\n\nOne sector is actually cheap.  \nLike, legitimately cheap.\n\nEnergy.\n\nOn a forward P/E basis, energy trades around 60% of its 10-year average valuation. Every other sector is above its historical average. Energy is the lone outlier.\n\nSo what gives?\n\nA mix of things:\n\n• Everyone thinks oil is “dead” because renewables are growing  \n• Momentum chasers only want AI names  \n• Energy stocks had a monster 2022, then flatlined while earnings climbed\n\nBut here’s where it gets fun.  \nAI doesn’t run on hopes and dreams.  \nIt runs on electricity.  \nLots of it.\n\nData centers are power hogs. And in the U.S., a big chunk of that power still comes from natural gas. Even with renewables growing, hydrocarbons aren’t disappearing anytime soon. The demand floor is pretty solid.\n\nMeanwhile…\n\n• Cash flows are strong  \n• Shareholder payouts (dividends + buybacks) are high  \n• Balance sheets are cleaner than they’ve been in years  \n• Valuations are stuck in 2015\n\nIn a market where most sectors feel priced for perfection, energy still feels priced for a recession.\n\nNot saying “YOLO into oil and become the next Saudi prince.”  \nJust saying that if you’re a value investor… it’s weird to ignore the only sector still on sale.\n\nCurious what others here are thinking. Is energy a legit value opportunity right now? Or is the market right to sleep on it?\n\nFull article with charts: [https://www.beatingthetide.com/i/180117729/thought-of-the-week-the-s-and-p-isnt-as-expensive-as-you-think-and-one-sector-is-still-cheap](https://www.beatingthetide.com/i/180117729/thought-of-the-week-the-s-and-p-isnt-as-expensive-as-you-think-and-one-sector-is-still-cheap)",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1084,
    "downs": 0,
    "created_utc": 1764605234.0,
    "media": null,
    "is_video": false,
    "num_comments": 376,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.043600413287445
  },
  {
    "score": 1066,
    "title": "Since Trump took office, the stock market is a joke",
    "selftext": "The stock market has never been more ripe for gambling than ever before. One day Trump says that he is going to impose tariffs, his circle of rich friends take leveraged short positions on bitcoin, then profit. Trump says that weightloss drug prices need to go down, and he tanks Novo and Lilly. He goes to have a meeting with Putin and the stocks affected by the war in Ukraine jump up 10%. He cancels wind energy projects and tanks Orsted and other wind energy stocks. The price of gold meanwhile is at all time highs, with the type of price increase you would expect if investors believed we were going to have hyperinflation. Bitcoin and other cryptocurrencies have been propped up by Trump on empty promises to make a cryptocurrency reserve, in turn making meme stocks like microstrategy go up in value. \n\nThe beneficiaries of this shitshow? Trump's friends and your broker, that is making money from all of this trading, while no real value is being created. ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 1066,
    "downs": 0,
    "created_utc": 1760689503.0,
    "media": null,
    "is_video": false,
    "num_comments": 247,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.900390259837578
  },
  {
    "score": 1059,
    "title": "Remember, This Is The Pullback We’ve Been Waiting For",
    "selftext": "If you’re a long-term investor who even casually cares about valuation, this market has been tough to navigate for a while. Pullbacks are always something we say we want, particularly as value investors, but they usually come when things are scary. Financial crisis, global pandemics, policy shocks… the discount never shows up gift-wrapped.\n\nYesterday’s tariff news felt like one of those moments. It’s vague, feels arbitrary, and creates a lot of uncertainty. It feels scary. And yet, that’s exactly the environment where opportunities show up.\n\nI’ll admit it, days like today make me uneasy. But as an investor, I remind myself that underneath the noise, what’s really happening stocks are getting cheaper.\n\nAnd that’s what we’ve been waiting for.\n\nEdit: Thanks for the thoughts. I wrote a post - [Tariffs, Fear, and Opportunity: Perspective For Difficult Times In the Stock Market](https://arbalistmoney.com/tariffs-fear-and-opportunity-perspective-for-difficult-times-in-the-stock-market/) \\- to add some additional context directly addressing the response to this post.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 1059,
    "downs": 0,
    "created_utc": 1743681061.0,
    "media": null,
    "is_video": false,
    "num_comments": 585,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.046754673273816
  },
  {
    "score": 1006,
    "title": "Buffett &amp; Munger’s timeless cheat code: Ignore the circus, buy the cash flow.",
    "selftext": "Just revisited one of those Berkshire Q&amp;As that aged better than most portfolios.\n\nBuffett was asked if he's worried about “NASDAQ stocks trading at 30x revenues instead of 10x earnings.” His answer?\n\n“We don’t care. There’s always a part of the market that’s nuts.”\n\nThey tried shorting hype stocks once when they were younger. Were right. Still lost money.\n\nAlso, they don’t chase international stocks *just* because they’re cheap. But if a $5B+ business outside the U.S. meets their standards? Game on. Geography isn’t the filter — durability is.\n\nMy favorite part though?\n\n“We don’t have to predict the future. We buy businesses where chewing gum is still chewing gum in 20 years.”\n\nNow  I know some folks will ask for tickers. I get it.  \nBut the real flex isn’t copying someone’s stock list , it’s knowing **what return** ***you*** **need** and then working backwards to figure out if the valuation gives it to you.\n\nIf that resonates, you might want to scroll back on my profile where I broke it down using Buffett’s **farm analogy**. (Hint: the price you pay only makes sense when you know what kind of yield you’re happy waking up to every year.)\n\nThis stuff isn’t complicated. But it’s not sexy.  \nThat’s why it works.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 1006,
    "downs": 0,
    "created_utc": 1748178689.0,
    "media": null,
    "is_video": false,
    "num_comments": 156,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.805979296758235
  },
  {
    "score": 951,
    "title": "The fund that saved the world",
    "selftext": "Salute to the mysterious Japanese hedge fund that maxed out 60x leverage on 10-year Treasuries and imploded in glorious fashion last night—accidentally pulling the global economy back from the brink.\n\nYou didn’t mean to be a hero, but you were one anyway.\n\nEDIT -Context: on the night of April 8, 2025, the U.S. Treasury market sold off significant as hedge funds rapidly unwound highly leveraged “basis trades”—a strategy involving arbitrage between cash Treasuries and futures contracts. This mass liquidation led to a sharp selloff in Treasuries which is likely what possibly what pushed the admin to “pivot” on the tariff implementation policy ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 951,
    "downs": 0,
    "created_utc": 1744243241.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.709249986230722
  },
  {
    "score": 883,
    "title": "Never buy a reverse stock split. Always sell.",
    "selftext": "I have been investing for 30 years, for work and for myself. Reverse stock splits are the ONE reliable signal to get the hell out of the position and/or remove the stock from your watchlist and never look at it again. \n\nReverse stock splits are THE kiss of death signal. \n\nIf you stumble upon one years after a reverse stock split, then maybe. If it has survived a few years after a reverse split, there MIGHT be something there but be extremely skeptical.\n\nThat is all. ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 883,
    "downs": 0,
    "created_utc": 1755708222.0,
    "media": null,
    "is_video": false,
    "num_comments": 319,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.9190272541730256
  },
  {
    "score": 880,
    "title": "Finally understood why Buffett is obsessed with insurance companies",
    "selftext": "For the longest time, I dismissed Berkshire's insurance operations as just boring, low-margin businesses that Buffett kept around for diversification. Honestly thought it was his least interesting move. Boy was I wrong.\n\nHad this lightbulb moment reading about their float growth - $39M in 1970 to $169B today. That's not just growth, that's basically getting handed a massive investment fund where your \"lenders\" (policyholders) pay YOU upfront and don't charge interest. Meanwhile, I'm over here scraping together cash to buy individual stocks or considering margin loans that cost me 8%+ annually.\n\nThe more I think about it, the more brilliant it seems. While most of us value investors are sitting on sidelines waiting for crashes with our limited cash, Buffett's got this perpetual money machine funding his patient approach. He literally gets paid to wait for Mr. Market's mood swings.\n\nMakes me wonder if I've been looking at insurance stocks all wrong. I used to avoid them thinking they're too complex and regulatory-heavy, but maybe that's exactly why they can be such great value plays when nobody wants to understand them. UNH has been on my watchlist forever but I keep hesitating because healthcare policy scares me.\n\nAnyone else had similar realizations about sectors you initially dismissed? Sometimes the \"boring\" businesses end up being the most ingenious.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 880,
    "downs": 0,
    "created_utc": 1754517030.0,
    "media": null,
    "is_video": false,
    "num_comments": 159,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.75203589974001
  },
  {
    "score": 828,
    "title": "Michael Burry Has (Apparently) Shut Down Scion Asset Management",
    "selftext": "[https://x.com/michaeljburry/status/1988778952299802818](https://x.com/michaeljburry/status/1988778952299802818)\n\nI can't post images here, but Burry's post indicated that he de-registered Scion w/ the SEC on November 10th.\n\nHe's launching a blog on November 25th.  \n\nSo that was the end of the Scion Fund. I think it had a damn good run. \n\n\n\nThese were Scion's last option trades:\n\nPLTR 01/15/27 P50 \\*50,000 (Average Cost $184 per contract)\n\nNVDA 12/17/27 P110 \\*10,000\n\nHe sold the PLTR puts in October. Probably the NVDA puts as well, per the \"not short\" tweet a few days prior. ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 828,
    "downs": 0,
    "created_utc": 1762999132.0,
    "media": null,
    "is_video": false,
    "num_comments": 222,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8052069620743545
  },
  {
    "score": 820,
    "title": "This is why it's so important to \"wait for the fat pitch\" as Buffett and Munger always used to say",
    "selftext": "Hello,\n\nThis post is inspired by the many posts I've seen over the last 2 years where investors keep arguing that you're better off investing in the S&amp;P500 even at a Shiller PE of 40 because \"time in the market is better than timing the market.\"\n\nThat comment makes sense most of the time except at the extremes. If you had invested in the Nikkei index in 1989 and held tenaciously for 35 years... you'd... have made 0%. Same goes for the S&amp;P500 for various long stretches, sometimes for over a decade like the 1965-1982 period or from 2000-2013.\n\nNow, since some people will say that I'm deliberately cherry picking periods but I wanted to present simple math that will give you a better idea of why Buffett and many other value investors prefer to sit on a cash pile for years and do nothing instead of dollar-cost-averaging like people have been taught to do.\n\n**Scenario A**: You buy the index at a Shiller PE of 40 (which it's currently at). You have 9 years of 10% gains on average and on the 10th it gets cut to a Shiller PE of 15 which is the long-term average. If you invest $100 at the beginning period you end up with $88.42. You were better off just putting that money in the bank.\n\n**Scenario B**: You buy mediocre treasuries yielding 3% and wait for good opportunities. You spend 9 years getting a pathetic 3% return and finally invest in the 10th year. You start with $100 and you end up with $130.47 at the start of year 10 and can invest the money at lower multiples.\n\nDo you see why Buffett is holding cash now ?\n\nIn investing we don't have to swing if the opportunity is not attractive.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 820,
    "downs": 0,
    "created_utc": 1766145364.0,
    "media": null,
    "is_video": false,
    "num_comments": 374,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8838587909833
  },
  {
    "score": 822,
    "title": "The Best Stock Research Tools for 2025",
    "selftext": "**Premium Tools Worth the Investment**\n\n* Tegus ($$$) - Comprehensive database containing expert network calls across industries. Excellent for deep industry research with a user-friendly mobile interface\n* InsiderScore by Verity ($) - Advanced screening platform for tracking executive changes, audit firm switches, stock buybacks, and insider trading patterns. Includes detailed historical data on board members\n* TheTikr (\\~$15/month) - Streamlined platform for analyzing financial statements and earnings call transcripts. Known for its intuitive interface\n* VisualPing (\\~$25/month) - Website monitoring service that alerts you to changes in company websites, executive biographies, or disclosure documents\n* Bedrock AI ($) - Emerging technology that uses machine learning to identify potential red flags in regulatory filings\n\n**Essential Free Research Tools**\n\n* SEC Full-Text Search - Navigate through two decades of SEC filings with advanced search capabilities for terms, individuals, or organizations\n* PCAOB Auditor Search - Research audit firms and individual partners, including their complete audit history and any disciplinary actions\n* OpenCorporates - Comprehensive database for researching private company executives, board composition, and state registrations\n* ROIC AI - Access to three decades of financial statement data with visualization tools\n* SocialBlade - Analytics platform for tracking company and individual social media metrics\n\n**Market Data Resources**\n\n* IBorrowDesk - Real-time tracking of stock borrow rates and short sale availability\n* ShortSqueeze - Comprehensive short interest data and analytics\n* OpenInsider - Real-time and historical insider trading activity tracker\n* Dataroma - Analytics platform showing major hedge fund portfolio holdings\n* Finviz Industry Charts - Sector-based chart generator for identifying potential investment opportunities\n\n**Consumer Research Tools**\n\n* CFPB Complaint Database - Searchable repository of consumer complaints filed with federal regulators\n* Glassdoor - Employee reviews and salary data for company culture analysis\n* Blind - Anonymous professional network focusing on tech industry insights\n* SiteJabber &amp; TrustPilot - Aggregators of consumer reviews for online businesses\n* BBB - Non-profit platform providing business ratings and consumer complaint history\n\n**Healthcare Industry Resources**\n\n* Open Payments Data - Database tracking payments from healthcare companies to medical professionals\n* CMS Drug Spending - Transparency tool for Medicare/Medicaid pharmaceutical expenditures\n\n**Research Enhancement Tools**\n\n* Wayback Machine - Digital archive showing historical versions of company websites\n* Google Trends - Analysis tool for search volume patterns over time\n* ListenNotes - Podcast transcript search engine for industry research\n* Quartr App - Mobile application providing access to earnings call recordings\n* PlotDigitizer - Tool for extracting numerical data from charts and graphs\n\n**Classic Investment Literature**\n\n* Charlie Munger's collected partnership letters\n* Warren Buffett's Berkshire Hathaway shareholder communications\n* Nick Sleep's Nomad Capital investor correspondence\n* François Rochon's Giverny Capital letters\n* Michael Burry's Scion Capital partnership documents\n* Benjamin Graham's partner communications\n* Bob Wilmers' M&amp;T Bank annual letters\n* \"The Makings of a Multibagger\" - Analysis of top-performing stocks\n* \"Confessions of a Capital Junkie\" - Sergio Marchionne's automotive industry analysis\n* \"Financial Fraud Throughout History\" - Jim Chanos' Yale course materials\n\n**Additional Resources**\n\n* ValueInvestorsClub - Community platform for investment thesis sharing\n* r/growth_investing \\- Great subreddit for discussion on growth stocks\n* Zer0es TV - Investment interviews focusing on short-selling perspectives\n* StockPerks - Database of shareholder perks offered by public companies\n* 10x EBITDA - Archive of activist investor presentations\n\nIf you've found other valuable resources for investment research that aren't listed here, please share them in the comments below.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 822,
    "downs": 0,
    "created_utc": 1735147107.0,
    "media": null,
    "is_video": false,
    "num_comments": 67,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.574154291565388
  },
  {
    "score": 805,
    "title": "Understanding Michael Burry's Nvidia short: The real thesis explained",
    "selftext": "This week, Michael Burry revealed something unusual: Nvidia issued a formal memo rebutting his short thesis. When a $4 trillion company takes the rare step of responding directly to a single investor's position, it signals the argument has hit a nerve. Here's what Burry is actually saying, explained through Microsoft's example.\n\n**What Burry is NOT saying**  \nLet’s start by clearing up the biggest misconception. Burry is NOT saying NVDA is cooking its books or committing fraud. So if Burry isn’t targeting Nvidia’s accounting, what’s he actually saying?  \n  \nThe thesis is about Nvidia’s customers: Microsoft, Google, Amazon, and Meta. These “hyperscalers”, i.e., companies that own and operate the world’s largest data centers, are spending hundreds of billions of dollars buying Nvidia’s chips. And Burry argues they’re systematically misstating the economic reality of their GPU purchases.\n\n**The core thesis: Economic vs physical lifespan**  \nHere's the problem: When data centers buy NVDA chips, they depreciate them over 5-6 years. Microsoft extended from 4 to 6 years, and Meta to 5.5 years. But Burry argues that chip technology is advancing so fast that the real economic life of chips is just 2-3 years.\n\nSo what?\n\n**The accounting impact**\n\nLet’s understand the impact by using Microsoft as an example. Microsoft purchased 485k NVDA chips in 2024 and spent roughly $17 billion in GPU purchases in 2024 alone. So what happens if we depreciate them over 6 years instead of 3?  \n  \n\\- $17B in GPUs depreciated over 6 years = $2.8 B/year expense  \n\\- If economic life is really 3 years = $5.7B/year expense  \n  \nThe difference: $2.9B/year in overstated earnings\n\nMicrosoft’s FY2024 net income was $88.1B. A $2.9B overstatement represents 3.3% of reported profits. That might not sound like much, but this is just from one year of GPU purchases. If similar spending occurred in 2022, 2023, and 2025, the cumulative overstatement could be $10–12B annually, or roughly 11–14% of reported earnings.  \n\n\n**What this means for the stock price**\n\nCurrently, Microsoft trades at approximately $492 per share with a P/E ratio of 34 and earnings per share of $14.11. If earnings were adjusted down by 11–14% to reflect realistic GPU depreciation, the adjusted EPS would fall to $12.13-$12.56. Assuming the P/E ratio remains at 34, the stock price would drop to $412–427 ,  a decline of $65–80 per share, or roughly 13–16%. However, if investors also lose confidence in AI infrastructure returns, the P/E multiple could compress further, potentially amplifying losses beyond the accounting adjustment alone.\n\n**The valuation impact**\n\nCurrently, Stockoscope's DCF model values MSFT at $384.93 per share, implying the stock is already 22% overvalued. This calculation assumes capital expenditure of 15.7% of revenue.  \n  \nHowever, if Burry is right and GPUs need to be replaced every three years, the capex will increase to &gt;20% of revenue. This will reduce free cash flow and lower the total enterprise value. We have crunched the numbers, and this higher capex will reduce enterprise value by $547 billion and the per-share intrinsic value by $73.44 in our DCF model.   \n  \nSo, the Burry-adjusted fair value becomes **$311.49 per share**. This represents a 19% reduction from our baseline fair value and suggests Microsoft is overvalued by 37% at the current price of $491.92.\n\nNote: This isn't just an MSFT problem. Amazon, Google, and Meta are all facing the same dynamics. The impact across the hyperscaler industry could be significant. We just focused on Microsoft because it's easier to understand one concrete example than vague industry trends.\n\n**The Nvidia connection: How this destroys demand**\n\nNow we come full circle to why Burry is short Nvidia, not Microsoft. Well, if investors recognize that GPUs will become obsolete in 3 years rather than 6, the financial pressure intensifies. Boards will demand better returns and more disciplined spending. As capital allocation tightens and upgrade cycles extend, demand for Nvidia chips could collapse, potentially destabilizing the entire AI infrastructure market.  \n\nAlso, Microsoft has a diversified business. Even if Azure AI disappoints, it still has Office, Windows, LinkedIn, and gaming. The stock might be overvalued, but the company isn’t going away.\n\nOn the other hand, Nvidia is a pure play on AI infrastructure demand. If hyperscalers slow purchasing even modestly, Nvidia’s revenue collapses. The company is priced for perfection, assuming indefinite exponential growth.\n\nThat’s the trap Burry sees: Nvidia’s revenue depends on customers making economically irrational decisions. Once the music stops, the stock has nowhere to hide.\n\n**The $500 Billion question**\n\nMichael Burry isn’t betting against AI. He’s not claiming Nvidia makes bad products. He’s not even saying Microsoft is a bad company.\n\nHe’s asking a simpler, more fundamental question: *Can Microsoft and its peers sustain billions in capital expenditures indefinitely, when the infrastructure they’re building may need to be replaced every 3 years instead of 6?*\n\nThe market is betting “yes” -  that AI will generate returns justifying this spending.\n\nBurry is betting “no” -  that the accounting assumptions don’t match reality, that CFOs will eventually rein in spending when the math doesn’t work, and that Nvidia’s demand will cliff when that happens.\n\nTime will tell who’s right, but where do you see yourself? Are you leaning towards yes or no?",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 805,
    "downs": 0,
    "created_utc": 1764408477.0,
    "media": null,
    "is_video": false,
    "num_comments": 367,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8717589511418495
  },
  {
    "score": 793,
    "title": "$GOOGL just CRUSHED earnings — so much for “Google Search is dying” 🤡",
    "selftext": "•\tSales: $102.4B vs Est. $100.1B\n\n•\tEPS: $2.87 vs Est. $2.26\n\n•\tGoogle Cloud: $15.2B vs Est. $14.8B\n\nEvery quarter the doomers come out saying:\n\n“AI will kill Google.”\n“No one uses Search anymore.”\n“ChatGPT is the new Google.”\n\nAnd every quarter, GOOGL quietly prints another billion. \n\nThe truth?\nThey’ve got Search dominance, YouTube still printing ad money, and Cloud finally scaling like a real business.\n\nHaters keep screaming “Google’s dead,” but my portfolio says otherwise.\n\nLong live the Advanced Money Generator.\n",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 793,
    "downs": 0,
    "created_utc": 1761769574.0,
    "media": null,
    "is_video": false,
    "num_comments": 197,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.7531530975578615
  },
  {
    "score": 782,
    "title": "That Amazing Company is Finally Cheap, But Now You Don’t Want to Buy It.",
    "selftext": "\n\n “Buy the dip!”  “Be greedy when others are fearful!” Lmao \n\nDid you really think you’d be the one who wasn’t fearful? Especially when all the smart people around you are being fearful?\n\n“Buy great companies at good prices.”  Lmao.  Did you think you’d find a company with perfect fundamentals that just HAPPENED to be priced poorly?  \n\nI think people misunderstand the cliches.  \nIn order to get a good price on something, it REQUIRES either poor macroeconomic circumstances or poor management.  In order to get a GREAT price, it requires both at the same time.\n\nGEICO was arguably Buffet’s best investment from 1965 to 2025.\n\n\nIn 1975-76, when Buffet bought it, it was near bankruptcy, hemorrhaging losses, and trading under $3/share.   From 1976 to 1986, GEICO delivered 50% CAGR.\n\n\nAll investors could see was wreckage. Geico was expanding coverage into risky areas at ridiculously low premiums.  Inflation hit and boom… their claim costs suuurrrrrged.\n\n\nThey took on huge underwriting losses.  Claims ballooned, especially from urban drivers and their young policyholders.\n\nThey were so focused on growth that they forgot about making sure they had adequate reserves.   \n\nThis js why Buffet is absolutely GOATED.  On paper, EVERYTHING about Geico looked horrible.  At least to my accounting eyes.  Hindsight makes some of the turnaround signs seem obvious, but they really weren’t quantifiable via something like a dcf. \n\n\n- claim rates are surging\n- claim costs are surging\n- claim fraud is surging\n- inadequate cash reserves\n- governments block insurance price increases right when Geico wanted to increase premiums\n- too many employees and regional offices.\n- management just accelerated the losses to force revenue growth\n\n- double digit inflation…\n- interest rate hikes to over 13%\n- recession\n- oil crisis\n- stock market crashes 50%\n\n- then all of a sudden this all adds up to a $126million loss and bankruptcy was on the table…\n\n\n…. Enter Warren Buffett. Absolutel animal.  Looks at all this and decides “This is a wonderful company.”\n\nEveryone was fearful for very good reasons.  If Reddit were around back then, every single valueinvestor user would be shit talking Geico.\n\nBuffet just decided, meh… the business model is good, liquidity is high enough to avoid bankruptcy for a few more years, and Geico is a good brand.  What more do you need for a thesis? \n\n\n+20 bagger for Buffet.\n\n\nWhenever you see **truly discounted prices**, the backdrop always looks fucking brutal.\n\n- Earnings are collapsing.\n- Management seems clueless.\n- The economy feels like it’s in freefall.\n- Financial news is a parade of panic.\n\nBlah blah blah. \n\nBut are these not the exact conditions that allow us to buy quality assets at deep discounts?\n\nPrices always reflect a reasonably justified fear.\nGood prices come from bad news. But the bad news doesn’t last forever.\n\n$61 to $2 is what happened to Geico’s stock.  It fell for 4-5 years straight.   \n\n…Imagine negative trends in earnings, debt growth , asset contraction, cash burn, and margin contraction all holding for that long, but you manage to look at it and see it as a winner.\n\nEdit: &gt;20 upvotes somehow… maybe the bottom isn’t in yet lol\n\nEdit#2: I don’t actually care about the indexes.  I am just talking about individual companies. ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 782,
    "downs": 0,
    "created_utc": 1744980763.0,
    "media": null,
    "is_video": false,
    "num_comments": 318,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8131571035865335
  },
  {
    "score": 754,
    "title": "Warren Buffett said if he were to begin with small capital now, he can do 50% return annually.",
    "selftext": "https://youtu.be/v4T1oknATGU?si=MS4IEFprcrxuh5wq\n\nDo you guys think Warren Buffett can really do it?\n50% annual return on small capital?\n\nWarren Buffett said he can get a 50% annual return if he is managing small sum of money, do you think it's possible?\n\nSome people claimed that his method of value investing with huge yearly returns and low risks wouldn't work in today's era because information spreads too fast due to Internet. And some people just claims stocks thats 50% undervalued just don't exist in the current market.\n\nWhat do you guys think? And if it's possible, how are we going to take advantage of it?",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 754,
    "downs": 0,
    "created_utc": 1725943347.0,
    "media": null,
    "is_video": false,
    "num_comments": 260,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.783767205298329
  },
  {
    "score": 741,
    "title": "Trump has caved - do we keep holding?",
    "selftext": "Hi all;\n\nBased on Trump first saying he has no interest in firing Powell and then second saying he'll reduce the China tariffs a lot, clearly the billionaires got to him and told him to stop destroying the economy or else. So...\n\nHow long does it last? Sometimes Trump truly changes course. But often, when forced to take some action, he rebels within a week and is back to his idea of the moment. So will this last?\n\nAnd there's no putting the toothpaste back in the tube. Even if the Trump administration tries to return to the Biden economic plan, we're in a lot worse shape. Other countries won't trust us, they'll make deals with each other first. And the people running things in D.C., even if they try to get back to the Biden economy, can't execute well.\n\nSo, should we continue holding on and ride this out? Or will they keep sending the market down mistake by mistake?",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 741,
    "downs": 0,
    "created_utc": 1745379577.0,
    "media": null,
    "is_video": false,
    "num_comments": 431,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.818145778686483
  },
  {
    "score": 731,
    "title": "This is a clown market",
    "selftext": "Value investing appears dead. We are on the path of hyperinflation and continuous pumping regardless of the future outlook. Castles in the air. There is no rational explanation for the market to show this much optimism, nor is there a likelihood of continued gains unless growth is hyper-accelerated or the dollar inflates. Fraud and short sightedness never work. The stock market has become akin to crypto. \n\nEdit/context: Not an options guy. DCA all the way. Tired of entering at seemingly overvalued entries every week. That is all. I’m not smarter than anyone else on the sub nor am I an investing guru. I accept that I can do no better than the return of VOO. Just throwing out sentiment and hearing what the sub says. Thank you. ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 731,
    "downs": 0,
    "created_utc": 1751250173.0,
    "media": null,
    "is_video": false,
    "num_comments": 566,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.871302610504845
  },
  {
    "score": 716,
    "title": "$GoPro is trading at half of book value",
    "selftext": "If you're looking for an undervalued business that is currently being shorted by greedy money on Wall Street, look no further.\n1. GoPro's entire market cap is $250 Million.  \n2. They have $230 Million in cash on hand. \n3. They did $1 billion in gross rev in 2023 \n4. They showed a loss of $53 Million for the year, but they spent $160 million in R&amp;D. \n5. They show book equity of $500 million on their balance sheet.\n\nThey are working through a transition from being solely a camera company to being a SAAS business. 10% of their revenue last year (or $100 million) was subscription revenue for their cloud services. That's a 20% increase year over year in SAAS revenue, so it's growing rapidly.\n\nThey've lowered prices on their cameras to drive up the number of cameras in hand. They are pushing to deploy more cameras for a larger subscriber base.\nAll that said. They are currently undervalued, and the there are over 6 million shares sold short. Could be a great opportunity.\n\nThere are caught in a macro headwind of people cycling out of tech and growth stocks into the S&amp;P500.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 716,
    "downs": 0,
    "created_utc": 1714524054.0,
    "media": null,
    "is_video": false,
    "num_comments": 241,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.729926838658016
  },
  {
    "score": 709,
    "title": "Investing in $GOOG in April is proof that investing isn't like Olympic Diving",
    "selftext": "Far too often on this sub, and others, I see people touting complex ideas as to why certain companies are \"undervalued\". These usually involve complex supply chains, or regulations, to understand.\n\nThen there are opportunities like Google in April of this year. Cheap for no reason other than people are afraid that a new hype-based, unprofitable tech company with horrible governance would somehow overtake the juggernaut that is Google.\n\nAs an end user of these technologies, I saw straight through it all. Invested accordingly, and am now up 50% on a large base of invested dollars.\n\nSafe to say - wait for the fat easy pitches, and then swing for the fences. You'll do well.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 709,
    "downs": 0,
    "created_utc": 1756491448.0,
    "media": null,
    "is_video": false,
    "num_comments": 235,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.697714350204129
  },
  {
    "score": 654,
    "title": "How is it logical for the S&amp;P 500 to be up 91% in just 5 years?",
    "selftext": "I know it’s impossible to time the market. However, how does it make any sense that the S&amp;P500 is up 91% in just 5 years?\n\nThe index has nearly doubled. But are these companies producing double the product, or double the output within this timeframe? It seems unlikely.\n\nSurely at some point the fundamentals have to mean something. How can it be sustainable for stocks to be valued ever higher without the earnings and dividends to support it? \n\nI’m a very cautious person generally. But I’ve held off from investing, as stock prices seem to be detached from reality and the underlying real value. Have I missed anything? Would love to hear people’s thoughts.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 654,
    "downs": 0,
    "created_utc": 1724934087.0,
    "media": null,
    "is_video": false,
    "num_comments": 532,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.8396049045050695
  },
  {
    "score": 653,
    "title": "Chipotle (CMG) drops 15% because they charge extra for the damn tortilla on the side now.",
    "selftext": "It was a well known hack that you could get the bowl and ask for the free tortilla on the side, and it would come out to a little more food than getting a burrito. Customers on a low budget would feel clever gaming the system, and Chipotle was still making hefty profit on a bowl of rice and beans.\nBut that all changed when greed consumed the leadership at Chipotle, and they started charging extra for the tortilla around 2020. What we are seeing now has been long in the making, and I for one, am happy to see their downfall.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 653,
    "downs": 0,
    "created_utc": 1761842164.0,
    "media": null,
    "is_video": false,
    "num_comments": 181,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.650613442316804
  },
  {
    "score": 652,
    "title": "Is the current recession over?",
    "selftext": "I'm just wondering if the current recession is over. I like to use Reddit to get all my objective information, as this site is not politically biased at all. Despite the strong economic data, low unemployment rates, Reddit determined we were definitely in a recession because someone's dad went out to dinner the other Friday night and the place was empty. When someone's dad goes out to eat and there's no one there, this is definitely a leading indicator of a recession. I am asking because I panicked and sold all my positions, and wet my pants. and I am now mostly in cash, wondering if I should now buy back in. Even though it's very common advice to not time the market, I did it anyway because everyone else on Reddit was doing it, and as I said, Reddit is an objective source of truth. Anyway, your thoughts would be greatly appreciated. Thank you.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 652,
    "downs": 0,
    "created_utc": 1742824730.0,
    "media": null,
    "is_video": false,
    "num_comments": 229,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.58077709928387
  },
  {
    "score": 639,
    "title": "Massive gains like today are only common during massive volatility and general downturn.",
    "selftext": "Spikes like this happen during recessions and depressions. The last time we had gains like this, we were on the way down during the Covid recession. Before that, it was the peak in 2007 with a gain of 10-16% across indices before the Great Recession. \n\nYou did not make a mistake just because your value stocks didn't pop 10% today, and this is most likely not a sign of a new bull market. There's a sea of dead cats out there bouncing right now. ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 639,
    "downs": 0,
    "created_utc": 1744227178.0,
    "media": null,
    "is_video": false,
    "num_comments": 176,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.62766660716479
  },
  {
    "score": 617,
    "title": "The S&amp;P500 is still underwater YTD, adjusted for currency depreciation",
    "selftext": "I am not trying to make any predictions here, but after the \"great crash\" of 2025 a few months ago, many people jumped the gun in saying: \"you see? it's all panic, stocks only go up\". I am heavily invested in Europe since last year and I have been warning that Trump would not be good for the US stock market. People did not believe me back then and do not believe me now. YTD, the S&amp;P500 is up 9.7%. At the same time, the USD vs EUR is down -11%. If we add in inflation, it's even worse.\n\nRight now, this bull market is sustained only by AI hype and not much else, with the mega caps outperforming the rest of the index, while recent job reports now suggest that the economy is going worse, hitting highest youth unemployment since May 2021. Perhaps the stock market will continue to go up, because higher unemployment means lower rates, but it also means inflation will probably be higher. If Trump gets want he wants with rates, turkey-style hyperinflation is not impossible. Given that the US government debt relative to GDP continues to compound, either the dollar goes down in value, or taxes need to go up, at some point. \n\nDamaging diplomatic relationships and putting in question the independence of the FED and meddling with the private sector (I am pointing at Trump saying that Intel's CEO should be fired, his decision to stop near-completed wind turbine projects being built in the US by Danish companies, his relationship with musk, saying he wants to lower the value of the dollar to make exports competitive....) is the worst thing he can do, since US bonds and stocks is one of the biggest exports that the US has. This is justified by the \"US exceptionalism\". But if this exceptionalism is put into question, that will have huge consequences. \n\nRegardless, what the FED does or does not do should not influence us as value investors, but my point remains: US exceptionalism is more than priced in already, and at current multiples, it is justified by AI, recency bias, and a tendency of investors to chase returns. ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 617,
    "downs": 0,
    "created_utc": 1757332840.0,
    "media": null,
    "is_video": false,
    "num_comments": 243,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.629683388258181
  },
  {
    "score": 612,
    "title": "How I made 52% over the last year with stock picks in my Roth",
    "selftext": "My strategy (it's not very deep):\n\n1. I look for well-established stocks that have been suffering lately. Ideally, said stocks should have a solid history of consistent, if choppy, growth on the 5-year chart and maybe further.\n2. I consider whether the stock is truly undervalued. I do some research on the industry, read up on some news about the company. I have two main checks. First, I imagine the likelihood of the company falling apart within a year or a few, absent of something extremely upredictable. If that thought is laughable, I then see if there is substantially negative news with lasting repurcussions to justify a sustained drop. If I see the business sticking around, with no news of the sort I mentioned, I go to the next step.\n3. IMO, technical analysis is a weird self-fulfilling prophecy. Whether or not it makes sense, enough people trade off of it that it can be accurate, particularly with supports and resistances. So, I check if the stock price has consolidated or slightly rebounded from a support. If the stock has already tanked, but hasn't hit the next lowest support, I don't buy. I'll wait until it hits, and see if it stops dropping once it does.\n4. Finally, I will monitor the stock after buying it, with alerts if it drops below the support I initially referenced. I'll sell if the support is broken and watch the stock when it hits the next-lowest one. That's how I dodged the last LULU drop and bought back in at $300. We'll see how that pans out with earnings coming up.\n\nStocks I recently bought: ULTA, SBUX, HSY, SHOP, CVS, NKE, LULU.\n\n*Disclaimer: I've only been investing seriously for near two years, so we'll see if my strategy holds up in the long-run or if it's a load of bullshit. I usually hold my picks until it goes below the support, like I mentioned, or until it has gone up a few dozen percent at the least. I also make the occasional regard play, like a small bet on \\*bank stock that shall not be named\\* recovering after all the bank stuff last year. Spoiler alert, it didn't. My latest regard bet is ASTS at $7, so we'll see if that one pays off.*\n\nEDIT: shorting my comment karma would be a good investment rn",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 612,
    "downs": 0,
    "created_utc": 1717154556.0,
    "media": null,
    "is_video": false,
    "num_comments": 436,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.700201193003626
  },
  {
    "score": 617,
    "title": "Buffett bought Google but still sits on 300 billion in cash",
    "selftext": "Berkshire just disclosed a new position in Alphabet worth around 4 billion dollars in their latest filing. What caught my attention wasn't just the Google buy, but how it fits into the bigger picture. They've been net sellers for twelve straight quarters now and trimmed even more of their Apple stake this quarter. Meanwhile, their cash pile has grown to over 300 billion, more than double what they held at the start of last year. This isn't about Buffett being bearish, it's about him refusing to overpay.\n\nThe Google purchase shows that quality tech companies are firmly on the table for value investors when the price makes sense. But the real lesson is in the restraint. Berkshire keeps selling more than they buy, not because good companies don't exist, but because compelling valuations are rare right now. They're earning solid returns on treasuries while waiting for better opportunities, which is exactly what disciplined capital allocation looks like. It's a reminder that sometimes the hardest part of value investing is doing nothing and watching everyone else chase momentum.\n\nFor those of us without hundreds of billions to deploy, the principle still applies. Keep your standards high, don't let FOMO drive your decisions, and remember that cash isn't just sitting idle when it preserves your ability to act when real value appears. Buffett's willing to miss rallies if it means being ready when prices actually reflect underlying business value.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 617,
    "downs": 0,
    "created_utc": 1763397338.0,
    "media": null,
    "is_video": false,
    "num_comments": 132,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.565414295572358
  },
  {
    "score": 619,
    "title": "Everyone should take note of the sentiment around them at this very moment",
    "selftext": "You are witnessing Peak Greed Peak Euphoria and Peak Grift. It is a good idea to take note of sentiment. In the future you will be able to spot generational tops more easily.\n\nAlways remember though, \"the feeling of disgust you feel, that can last for a long time\" - Charlie Munger\n\nI think it is fair to say now that speculative returns in the stock market have significantly outpaced what returns should have been, leaving a lost decade ahead.\n\nEDIT: I would Like to insert a quote here, because I feel it is quite fitting after reading the comments.\n\n\"A bull market is like sex, it feels best just before it ends\"  - Warren Buffet",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 619,
    "downs": 0,
    "created_utc": 1752866830.0,
    "media": null,
    "is_video": false,
    "num_comments": 447,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.755530696497326
  },
  {
    "score": 606,
    "title": "I tracked the returns of 16 popular Stock YouTubers from 2025.",
    "selftext": "I’ve been a YouTuber for about a year, but I've been in this sub for much longer. \n\nLooking for content ideas, I decided to do a deep dive and track the performance of 16 popular stock YouTubers who made \"Top Stocks for 2025\" videos a year ago. I honestly went into this expecting to expose them for underperforming, but the data proved me wrong**:**\n\n* **15 out of 16** YouTubers (who picked between 5 and 20 stocks) beat the S&amp;P 500 in 2025.\n* **3** of them generated returns of over **+50%.**\n* Only **one** underperformed the index.\n\nThis leaves me with a few questions for the community:\n\n1. Is this pure luck/survivorship bias?\n2. Was the 2025 rally so broad that almost any basket of \"tech/growth\" stocks would have beaten the index?\n3. Do you think they can repeat this in 2026?\n\nI’m not posting this to get views (the video is doing great on its own, and I honestly prefer you just comment here) but if you really want to watch it:  \n[Ranking 16 Stock Influencers by Real Returns – Tier List](https://youtu.be/0rc4HJtIjzc)",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 606,
    "downs": 0,
    "created_utc": 1767562471.0,
    "media": null,
    "is_video": false,
    "num_comments": 173,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.615963315216558
  },
  {
    "score": 610,
    "title": "Seven Lessons I Learned In 30+ Years of Investing",
    "selftext": "I’ll share some of the lessons I’ve learned since buying my first stock in 1995, when I was only 17 years old. I believe the 7 lessons below is why most people fail to win their financial freedom through investing.\n\n1️⃣ Lack of Discipline and Patience  \nMany investors chase quick returns and lack the patience to hold quality investments over time. As the famed investor Jesse Livermore noted over a century ago: \"It never was my thinking that made the big money for me. It always was my sitting. Got that? My sitting tight! It is no trick at all to be right on the market. You always find lots of early bulls in bull markets and early bears in bear markets. I've known many men who were right at exactly the right time, and began buying or selling stocks when prices were at the very level which should show the greatest profit. And their experience invariably matched mine--that is, they made no real money out of it. Men who can both be right and sit tight are uncommon.\"\n\n2️⃣ Emotional Conditioning  \nFear drives people to sell in downturns, while greed leads them to buy at peaks. Investing is a highly counter-intuitive process: the best time to buy is when you're most fearful, and the best time to sell is when you're most excited. \\[This is basically Buffet's classic quote of being fearful when others are greedy, and vice versa\\]. \n\n3️⃣ Investing in Stocks Instead of Companies  \nMost people think of stocks as standalone entities rather than ownership stakes in businesses. Stock price movements mean little without context. Focus on the companies, not their trading proxies.\n\n4️⃣ Investing in Companies Instead of People  \nBuilding on the previous point, companies are ultimately a reflection of the people running them. We don’t invest in logos or buildings, we invest in people. Over the long run, the difference between a good company and a great one is always the people.\n\n5️⃣ Confusing Speculation with Investing  \nMany investors buy stocks without understanding the business, its valuation, or its long-term prospects. If you don’t understand why you own something, you won’t be able to hold it through market cycles. \\[There is nothing wrong with speculation if you are into that, but don't confuse it with investing!\\].\n\n6️⃣ \"This Time Is Different!\"  \nThis phrase echoes through every bubble be tech in the late 1990s, housing in the early 2000s, or AI today. Keep in mind it is NEVER different, when asset prices materially diverge from fundamentals, they end up reverting back to the mean. Investing into a bubble is no different from playing musical chairs with your capital.\n\n7️⃣ Over-Diversifying at the Outset  \nTo build significant wealth, especially early on, a degree of concentration is required. As Buffett famously said: \"Diversification may preserve wealth, but concentration builds wealth.\". If your goal is early retirement, you need to get comfortable making concentrated bets, assuming, that you’ve internalized the previous six lessons.\n\nTo learn the above, I paid in sweat, tears, and many millions I made, lost, and made again. Hopefully, some of the above will shorten your path to financial freedom. And I am happy to learn about your own lessons in the comments section.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 610,
    "downs": 0,
    "created_utc": 1767376792.0,
    "media": null,
    "is_video": false,
    "num_comments": 127,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.5671461950664884
  },
  {
    "score": 565,
    "title": "Google is the Berkshire of Tech",
    "selftext": "I love Google generally. But just some trivia I wanted to share which is always a good reminder for me personally on how they’re always making bets even though in silence/less known. \n\n- Owns 8% or so of SpaceX\n- Own 14% of Anthropic\n- Waymo\n- Acquiring Deepmind in 2015\n- 22% of Gitlab\n\nNot stating all the other obvious companies they own fully. And also the more known investments such as Uber, Stripe, Lyft, Robinhood, Clay, etc etc via CapitalG. \n",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 565,
    "downs": 0,
    "created_utc": 1755746660.0,
    "media": null,
    "is_video": false,
    "num_comments": 156,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.548266257392888
  },
  {
    "score": 547,
    "title": "Warren Buffett's latest Thanksgiving letter to shareholders is out",
    "selftext": "[https://www.berkshirehathaway.com/news/nov1025.pdf](https://www.berkshirehathaway.com/news/nov1025.pdf)\n\nHe's accelerating his donations to the four family foundations and he plans to continue writing a Thanksgiving letter to shareholders next year.\n\nClosing gems:\n\n*\"Remember Alfred Nobel, later of Nobel Prize fame, who – reportedly – read his own obituary that was mistakenly printed when his brother died and a newspaper got mixed up. He was horrified at what he read and realized he should change his behavior.\"*\n\n*\"Greatness does not come about through accumulating great amounts of money, great amounts of publicity or great power in government. When you help someone in any of thousands of ways, you help the world. Kindness is costless but also priceless. Whether you are religious or not, it’s hard to beat The Golden Rule as a guide to behavior.\"*\n\n*\"I wish all who read this a very happy Thanksgiving. Yes, even the jerks; it’s never too late to change.\"*\n\n*\"Choose your heroes very carefully and then emulate them. You will never be perfect, but you can always be better.\"*\n\nWarren Buffett's been one of my heroes for more than 4 decades, now. ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 547,
    "downs": 0,
    "created_utc": 1762800132.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.403829578491497
  },
  {
    "score": 536,
    "title": "I made an app that finds undervalued SP500 stocks, and invested them in a demo account. These are the 2 months returns.",
    "selftext": "I'm more on the momentum/growth and generally the higher beta side of investment. After doing some reading and listening to many Youtube videos about value investing. And especially after knowing the one of the richest men in the planet got so rich by value investing. I decided that I need to test it.\n\nThe first problem is that I have never done it before and I just can't dump cash into a strategy I have never tested. And the second problem was that it's not easy for me to find and read multiple DDs about hundreds of companies in order to find which ones fall into the value investing category.\n\nSo I made a web application that does just that. It goes through the SP500 companies and finds which ones are undervalued, mostly stable and profitable. I want to share with you the stocks that it picked for me. In which I invested in a paper account. And the return on the demo investment since the first of July 2025. (2 Months)\n\n|Ticker|Return (2 Months)|\n|:-|:-|\n|UAL|27.96%|\n|APA|25.86%|\n|DHI|24.29%|\n|BLDR|19.56%|\n|BKR|18.36%|\n|[VAL.US](http://VAL.US)|17.16%|\n|LEN|16.24%|\n|BK|16.14%|\n|CC|11.36%|\n|GM|10.73%|\n|MRK|6.17%|\n|BIIB|5.24%|\n|CINF|2.94%|\n|ADSK|2.01%|\n|F|0.09%|\n|ACGL|0.03%|\n|COR|\\-3.03%|\n|CMCSA|\\-5.16%|\n\nGiven that the portfolio is equal weight, the 2 months performance is **+10.89%**\n\nIf I had done some DD. I would've probably allocated more cash to some of the stocks.\n\nAnd the best thing is that my demo portfolio was mostly on the green most days. Sometimes even on day where both \\^SPX and \\^NDX were in the red.\n\nI'm posting this just to show the value of value investing. \"Boring\" undervalued stocks truly are the way to go.",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 536,
    "downs": 0,
    "created_utc": 1756515417.0,
    "media": null,
    "is_video": false,
    "num_comments": 124,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.453429292203584
  },
  {
    "score": 534,
    "title": "Not as easy as you thought, is it?",
    "selftext": "Everyone always wants to buy the dip…. Until the dip is actually there.\n\nReality is an actual dip, like this one, is scary. The same thing happened during the Covid crash, 2008, etc. It’s not just a dip. People expected many businesses would go under. And many did.\n\nSo the next time you try to be smart in a bull rush taking all about buying the dip - remember it’s not so easy afterall… The dip is usually there for a very good reason. \n\nMy advice? Wait it out a few weeks and look for stocks taking a heft beating that may not be so impacted by tariffs as one could expect.\n\nAnd remember - trump has repealed many tariffs in the past.\n\n",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 534,
    "downs": 0,
    "created_utc": 1743747000.0,
    "media": null,
    "is_video": false,
    "num_comments": 204,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.566730712549106
  },
  {
    "score": 531,
    "title": "Intel drop should be a lesson for a lot of you",
    "selftext": "I've seen a huge amount of posts on this sub for companies like intel, i.e probably value traps \n\nRule 1 is do not buy what you don't fully understand. It's so important I think I need to highlight it better it on the sidebar and resources \n\nIf you do not understand the suppliers, the fabs, the future of chip production such as ML, the software side of it such as CUDA that gives Nvidia it's moat etc etc then you should not be buying companies like intel\n\nYou will end up writing pages of DD and doing fancy DCF valuations and it will be completey wrong because you just don't understand the future of the industry and business well enough\n\nThis is the reason I don't even bother to read the filings of nvda, amd or intel, I would never be able to understand the future for them even though Im far better placed for it than most here as a software engineer using CUDA and ROCM for ML\n\nI also learned this lesson and he hard way previously \n\nThe other biggest example is Alibaba, way too many people buying it who have no idea about china, cloud and e-commerce fully ",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.65,
    "subreddit_type": "public",
    "ups": 531,
    "downs": 0,
    "created_utc": 1722583668.0,
    "media": null,
    "is_video": false,
    "num_comments": 529,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.575549567095442
  },
  {
    "score": 529,
    "title": "Berkshire Hathaway 2024 2nd Quarter Report is out.  Warren Buffett dumped almost half of Apple.  Cash pile hits $277 billion dollars.  Here are some balance sheet comparisons.",
    "selftext": "[https://www.berkshirehathaway.com/qtrly/2ndqtr24.pdf](https://www.berkshirehathaway.com/qtrly/2ndqtr24.pdf) \n\n\n\n|(amounts in millions)|2nd Quarter 2024|vs Last Quarter|YTD|vs Last Year|\n|:-|:-|:-|:-|:-|\n|Insurance and Other:|  |  |  |  |\n|Cash and cash equivalents (1)|36,884|+27.7%|+9.5%|-17.3%|\n|Short-term investments in U.S. Treasury Bills (2)|234,618|+52.9%|+81.0%|+141.1%|\n|Investments in fixed maturity securities|16,802|-2.1%|-29.3%|-24.8%|\n|Investments in equity securities|284,871|-15.2%|-19.5%|-19.4%|\n|Railroad, Utilities and Energy:|  |  |  |  |\n|Cash and cash equivalents (3)|5,440|-18.3%|+25.1%|-0.1%|\n|BRK's Cash Pile:|  |  |  |  |\n| (1) + (2 ) + (3)|276,942|+46.5%|+65.2%|+87.9%|\n\n",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 529,
    "downs": 0,
    "created_utc": 1722688498.0,
    "media": null,
    "is_video": false,
    "num_comments": 269,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.674957751680283
  },
  {
    "score": 524,
    "title": "Top 10 things to do while the market is at all time high.",
    "selftext": "\n1. **Ignore the market.**\n\nValue investors are bottom-up stock pickers. We buy undervalued stocks of companies. Not undervalued markets.\n\n2. **Sharpen the saw** \n\nRead a book, learn about business models, competitive advantage, and how to value a company.\n\nEg. Learn how to DCF. This is a great time to learn how to do excel by creating your very own DCF. Remember, the value of a company is the sum of the future cash flows it produces discounted to the present. \n\n3. **Start an investment diary.**\n\nWrite down what you bought, sold, and also the why, and what will make you sell. \n\n4. **Learn other ways to value a company besides DCF.**\n\nLike Relative Valuation. Like IRR method. Like Dividend Discount Model. \n\n5. **Sign-up with your local library.**\n\n And download the Libby app to read or to stream the digital audio book, Buffett’s Early Investment by Brett Gardner.\n\n6. **Great time to tinker with screeners.**\n\nTry something different this time, screen for quality instead of value. Or screen for value for international stocks.\n\n7. **Watch your favourite Wall Street movies and laugh at the inconsistencies.**\n\nWall Street.    \nQuick Silver.   \nTrading Places.   \nBonfire of the Vanities.  \nThe big short.   \nBarbarians at the Gate     \nWolf of Wall Street.  \n\n8. **Pick up a cheap HP 12c calculator** and learn how to do NPV and do financial maths in reverse polish notion. \n\n9. **Go and investigate why are there at least three versions of EPS** by financial websites and which is the one that you trust. Here are three you check that are almost definitely different: market screener, yahoo finance and Market Watch. \n\n10. **Check the Barron’s or WSJ websites for stocks selling at 52-week lows.**\n\nEg from last Friday’s trading: \n\nMolson Coors,     \nCampbell,     \nKraft Heinz,   \nConagra Brands,   \nare all trading at one year lows.\n\n",
    "subreddit": "ValueInvesting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 524,
    "downs": 0,
    "created_utc": 1751281212.0,
    "media": null,
    "is_video": false,
    "num_comments": 86,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.409918929715266
  }
]