[
  {
    "score": 1976,
    "title": "Forget the future! Let's go back to Web 0.5 :)",
    "selftext": "Still an experiment and work in progress, but we have posts, private notes, profiles, friends, following, pokes, real-time notifications, IRC-style chat rooms, DM's called CyberMail, and several themes, including amber 80s VT320 style, Matrix green hacker style, and blue Commodore 64. Full keyboard nav. What do you think?\n\nSocial media without brainrot, AI, video, suggestions, ads, tracking or crypto. We're almost 3,000 users now :)\n\n[https://cyberspace.online/](https://cyberspace.online/)",
    "subreddit": "web_design",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 1976,
    "downs": 0,
    "created_utc": 1763474133.0,
    "media": null,
    "is_video": false,
    "num_comments": 138,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.1100140694407195
  },
  {
    "score": 1372,
    "title": "im a user, PLEASE STOP MOUSE OVER DROP DOWN MENUs",
    "selftext": "i dont know who to ask or where to go.\n\nplease stop with this shit, i waste 50% of the time using a website just trying to shake off a drop down menu.\n\nthe Reddit username popup window that doesnt go away.\n\nand for extra points, when wherever you click is a link and you loose the page.\n\nSTOP.\n\nEDIT. Thank you for all the consideration, i am usually downvoted to hell.   \nthank you to all the web designers who honestly are looking to make a better experience for people. ",
    "subreddit": "web_design",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 1372,
    "downs": 0,
    "created_utc": 1743107916.0,
    "media": null,
    "is_video": false,
    "num_comments": 120,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.89906322239498
  },
  {
    "score": 1255,
    "title": "Would it be possible for this sub to join the Reddit Blackout?",
    "selftext": "\nHello there. Would it be possible for this sub to join the reddit blackout that is happening on the 12th of June? This issue likely affects a lot of the users of this sub because many use third party reddit apps. This may not seem like this will do much but it will still cause a disruption, this is the aim of the protest.\n\nHere is a link to the information [post](https://www.reddit.com/r/Save3rdPartyApps/comments/13yh0jf/dont_let_reddit_kill_3rd_party_apps).\n\nI completely understand if this post is removed or denied but please at least consider it.\n\ncc: u/hau5keeping",
    "subreddit": "web_design",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 1255,
    "downs": 0,
    "created_utc": 1685999159.0,
    "media": null,
    "is_video": false,
    "num_comments": 83,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.773629282432118
  }
]