[
  {
    "score": 224,
    "title": "After 8 years in webdev, I'm convinced most of our \"problems\" are self-inflicted",
    "selftext": "We spend more time arguing about which framework renders 2ms faster than actually shipping products. We add 47 dependencies to avoid writing 10 lines of vanilla JavaScript. We rebuild our entire stack every 18 months because some VC-funded tool promised \"the future\" and now it's deprecated.\n\nHere's the uncomfortable truth - most projects don't need half the complexity we throw at them. Your blog doesn't need a serverless edge-deployed microservices architecture. Your landing page doesn't need 400kb of React. Your form validation doesn't need a library when the browser already does it.\n\nBut we keep adding layers. More build tools. More abstractions. More \"solutions\" to problems we created by overengineering the last solution. Then we wonder why onboarding takes three days and our CI/CD pipeline needs its own maintenance schedule.\n\nThe web used to be simple. HTML, CSS, JavaScript. It still works. But somewhere along the way, we decided that simple wasn't impressive enough for our resumes, so we made everything complicated and called it \"best practices.\"\n\nAre we building better products, or just building more impressive development environments to feel smart?",
    "subreddit": "Web_Development",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 224,
    "downs": 0,
    "created_utc": 1761564596.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 4.002213149807213
  },
  {
    "score": 57,
    "title": "Why does every solution require me to learn an entire ecosystem first?",
    "selftext": "I've noticed a pattern working on projects this past year - you can't just solve one problem anymore. You need a framework, a build tool, a state manager, a testing library, *and* whatever new abstraction layer someone decided we desperately needed this quarter.\n\nTry to add a simple feature? Cool, that'll be 47 npm packages and three days reading docs that assume you already know the other six tools in the stack. Want to fix a bug? Better hope it's not buried somewhere between your bundler config, your framework's magic, and whatever TypeScript is mad about today.\n\nI'm convinced that half our \"productivity tools\" just create new categories of problems to solve. We've gotten *soooo* good at building tools to manage the complexity created by our other tools.\n\nWhat happened to just... writing code that works? Anyone else feel like they spend more time managing toolchains than actually building features?",
    "subreddit": "Web_Development",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 57,
    "downs": 0,
    "created_utc": 1762991824.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 3.329713081611905
  },
  {
    "score": 45,
    "title": "We're speedrunning ourselves into incompetence with AI tools?",
    "selftext": "Six months of GitHub Copilot and I caught myself staring at a basic async/await bug for 20 minutes. Not because it was complex... because I genuinely forgot how Promises work under the hood. My first instinct was to ask Claude 4 to fix it.\n\nThis is where we are now. AI tools are incredible for productivity - I'm shipping features faster than ever. But there's this creeping feeling that I'm becoming a really efficient button-pusher who's outsourced the actual *thinking* part of development.\n\nThe scary part? Junior devs coming up right now are learning to prompt-engineer before they learn to actually engineer. They can scaffold a Next.js app in 30 seconds but panic when something breaks and the AI can't figure it out. And it *will* break, because generated code is only as good as the context you feed it.\n\nI'm not saying we should reject AI tools - that's idiotic. But we're treating them like a replacement for understanding instead of what they should be: a faster way to implement things we *already* understand.\n\nHow are you balancing this? Are you deliberately writing code without AI assistance sometimes, or am I just being paranoid about skill degradation that isn't actually happening?",
    "subreddit": "Web_Development",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1760301891.0,
    "media": null,
    "is_video": false,
    "num_comments": 8,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.8073790864012365
  },
  {
    "score": 17,
    "title": "Made a thing, feel a bit defeated..",
    "selftext": "I personally think it's pretty cool.. It took a lot of blood sweat and tears and was a passion project. I put it live for my birthday and my only major response has been 'want some help with the html?' Which.. Firstly.. No? But I struggle with feeling an imposter often and that one hurt. Please don't look on phone, it's not done yet, I saved the easy laborious bit til last ik but my focus was the functionality.. I dunno.. thoughts?\n\nwww.idkwhattoplay.com\n\nIt's 4am and that comment really hit me..",
    "subreddit": "Web_Development",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 17,
    "downs": 0,
    "created_utc": 1686625308.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.525818134631147
  },
  {
    "score": 14,
    "title": "How are cookie consent banners even reliable if scripts load before you click accept?",
    "selftext": "The banner pops up after the page loads, you click your preferences, but all the code is already running by that point.\n\nPixels, tags are all firing while you're still reading the consent popup. By the time you click \"reject all,\" haven't they already collected your data? How is this actually protecting privacy if the code executes before you make a choice?\n\nIs there a technical way to actually block scripts from running until after consent?",
    "subreddit": "Web_Development",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1763549479.0,
    "media": null,
    "is_video": false,
    "num_comments": 23,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.571196879911484
  },
  {
    "score": 14,
    "title": "I've curated a list of awesome websites for web developers! check it out!!! 🔥",
    "selftext": "Hey everyone! 👋🏼\n\nI've put together a **collection of useful websites for web developers**, and I'm excited to share it with you all! Whether you're just starting out or you've got years of experience in web development, you'll find something valuable in this repo.\n\n***GitHub Repo***: [awesome-webdev-resources](https://github.com/ItzAshOffcl/awesome-webdev-resources/)\n\nIf you know any great websites that aren't included yet, feel free to contribute! 🚀",
    "subreddit": "Web_Development",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1723809122.0,
    "media": null,
    "is_video": false,
    "num_comments": 7,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.295136252551653
  },
  {
    "score": 13,
    "title": "Free tool to track website changes — anything better than VisualPing or Distill?",
    "selftext": "So I’ve been hunting for a **free tool to monitor specific website changes**, like when a page updates a certain section, not just the whole thing. I’m tracking a couple of supplier sites that tweak prices or stock status quietly, and I don’t want to keep refreshing them manually every day.\n\nTried a few free options like VisualPing and Distill, but either they limit checks to once every few hours or they go crazy with false positives. I’m thinking of trying [Dotcom-Monitor](https://www.dotcom-monitor.com/) next since it looks like it can track changes by specific elements or text, but I’m not sure how good the free tier is.\n\nAnyone here found something reliable (and preferably free) that actually alerts you right when a change happens, but pls without a ton of setup or spammy emails? Would love to hear what’s worked for you all.",
    "subreddit": "Web_Development",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1761240574.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.3907186587020504
  },
  {
    "score": 10,
    "title": "Best 4 Web Development Courses Worth Considering in 2025",
    "selftext": "1. Coursera Web Development Course\nCoursera has a very simple and structured web development course made with top universities. It covers HTML, CSS, JavaScript and responsive pages with small guided projects. Learners can join anytime and finish at their own speed, so it’s nice for students and working people.\n\n3. Intellipaat Web Development Certification Course\nIntellipaat gives a detailed web development program with Microsoft collaboration, live classes and mentor support. It covers frontend and backend tools like HTML, CSS, JavaScript, React and basics of databases. Learners get real projects and placement help, so it becomes very useful for career start which makes it one of the top choices.\n\n3. Great Learning Web Development Program\nGreat Learning offers a clear web development course that mixes theory and practical tasks. Learners get guidance from mentors, small assignments and basic industry exposure. It is a good choice for beginners who want to understand web development step by step without any rush.\n\n4. Udemy Web Development Courses\nUdemy has many short and affordable web development courses focusing on JavaScript, React, and website design. People can pick any topic they want and learn in their comfortable time. It’s perfect for those who want quick skills and practice with real examples.",
    "subreddit": "Web_Development",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 10,
    "downs": 0,
    "created_utc": 1763313739.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 1.9949226808222065
  }
]