[
  {
    "score": 9545,
    "title": "They're destroying the Internet in real time. There won't be many web development jobs left.",
    "selftext": "This isn't about kids, and it isn't about safety.\n\nEvery country seems to be passing the same law, all at once. And with a near 100% majority in their congress. This is clearly coordinated.\n\nThe fines for non-compliance are astronomical, like $20 million dollars, with no exceptions for small websites.\n\nPunishment for non-compliance includes jailing the owners of websites.\n\nThe age verification APIs are not free. It makes running a website significantly more expensive than the cost of a VPS.\n\n\"Social Media\" is defined so broadly that any forum or even a comment section is \"social media\" and requires age verification.\n\n\"Adult Content\" is defined so broadly it includes thoughts and opinions that have nothing to do with sexuality. Talking about world politics is \"adult content\". Talking about economic conditions is \"adult content\".\n\nNo one will be able to operate a website anymore unless they have a legal team, criminal defense indemnity for the owners, AI bots doing overzealous moderation, and millions of dollars for all of the compliance tools they need to run, not to mention the insurance they would need to carry to cover the inevitable data breach when the verification provider leaks everyone's faces and driver's licenses.\n\nThis will end all independent websites and online communities.\n\nThis will end most hosting companies.\n\nOnly fortune 500's will have websites.\n\nThis will reduce web developer jobs to only a few mega corps.\n\n",
    "subreddit": "webdev",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 9545,
    "downs": 0,
    "created_utc": 1754326490.0,
    "media": null,
    "is_video": false,
    "num_comments": 990,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.190358257272862
  },
  {
    "score": 9003,
    "title": "I spent 18 months building a design system that makes UI's feel \"oddly satisfying.\" Now it's open source!",
    "selftext": "Hi, everyone. Shared this yesterday in r/react, so I'm gonna share pretty much the exact same description I used there.   \n  \nI'm a freelancer DBA \"Chainlift\" and there's a small chance some of you saw a YouTube video I made last year called \"[The Secret Science of Perfect Spacing](https://youtu.be/9ElrcTtAxzA?si=_kkrJm9n_uGlILFM).\" It had a brief viral moment in the UI design community. The response to that video inspired me to build out my idea into a full-blown, usable, open-source system. I called it \"LiftKit\" after my business' name, Chainlift.\n\nLiftKit is an open-source design system that makes UI components feel \"oddly-satisfying\" by using a unique, global scaling system based entirely on the golden ratio.\n\nThis is the first \"official\" release and it's available for Next.js and React. It's still in early stages, of course. But I think you'll have fun using it, even if it's still got a long way to go.\n\n**System also provides:**   \n\\- Built-in theme controller GUI with Material 3 dynamic color ([video demo](https://youtu.be/SnOKr5m45bs?si=zNDdqiVXq9Q2Hfka))\n\n**Links:**\n\n\\- [Github](https://github.com/Chainlift/liftkit)\n\n\\- [Landing page with some visual examples](https://www.chainlift.io/liftkit)\n\n\\- [Quickstart and Documentation](https://www.chainlift.io/liftkit/get-started)\n\n\\- [Tutorials](https://www.chainlift.io/liftkit/tutorials)\n\n**Next priorities:**   \n\\- Live playground so you can test examples of apps built with the kit  \n\\- Get feedback from community\n\nThis is just v1.0.0 and it has a long way to go, but I hope you'll enjoy what it can offer so far, and I'm excited to hear what the community thinks.",
    "subreddit": "webdev",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 9003,
    "downs": 0,
    "created_utc": 1752944653.0,
    "media": null,
    "is_video": false,
    "num_comments": 486,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.0331999669358
  },
  {
    "score": 8736,
    "title": "Netlify just sent me a $104K bill for a simple static site",
    "selftext": "So I received an email from Netlify last weekend saying that I have a $104,500.00 bill overdue. At first I thought this is a joke or some scam email but after checking my dashboard it seems like I am truly owing them 104K dollars:\n\n[That's 190TB bandwidth in 4 days](https://preview.redd.it/do33l577a2lc1.png?width=1091&amp;format=png&amp;auto=webp&amp;s=6718c5f3358e3df4c6e502fc7c7a558eec47a2cf)\n\nSo I was like 😅😅😅 and think okay maybe I got ddos attacked. Since Netlify charges 55$/100GB for the exceeding bandwidth, the peak day Feb 16 has 33385/55 \\* 100GB = 60.7TB bandwidth in a day. I mean, it's not impossible but why attack a simple static site like mine? This site has been on Netlify for 4 years and is always okay with the free tier. The monthly bandwidth never exceeded even 10GB, and has only \\~200 daily visitors.\n\nI contacted their billing support and they responded me that they looked into it and the bandwidth came from some user agents, meaning it is a ddos attack. Then they say such cases happen and they usually charge their customer 20% on this. And since my amount is too large, they offer to discount to 5%, which means I still need to pay 5 thousand dollars.\n\nThis feels more like a scam to me. Why do serverless platforms like Netlify and Vercel not have ddos protection, or at least a spend limit? They should have alerted me if the spending skyrocketed. I checked my inbox and spam folder and found nothing. The only email is \"Extra usage package purchased for bandwidth\". It feels like they deliberately not support these features so that they can cash grab in situations like this.\n\nThe ddos attack was focused on a file on my site. Yes it's partly my fault to put a 3.44MB size sound file on my site rather than using a third-party platform like SoundCloud. But still this doesn't invalidate the point of having protection against such attacks, and limit the spending.\n\nI haven't paid that $5k yet and decided to post here to hear what others think first. And yes I have migrated my site to Cloudflare. Learned my lesson and will never use Netlify (or even Vercel) again.\n\n&amp;#x200B;\n\nUPDATE: Thank you all for the suggestions I have posted this on [HackerNews](https://news.ycombinator.com/item?id=39520776).\n\nUPDATE: Here's the email response I got from their billing support:\n\n[I have taken down that .mp3 file but still, it's only 3.44MB size and I don't think it's entirely my fault leaving it there.](https://preview.redd.it/yuf4gzbp63lc1.png?width=1216&amp;format=png&amp;auto=webp&amp;s=155423c4bc69f51925307cc17be40730ecc65d8c)\n\nUPDATE: For those who are curious, that .mp3 file is just an old Cantonese song. I removed that from my site but you can still view it from the GitHub history [https://github.com/CanCLID/jyutping.org/blob/133b7d8b75bb3e454f663e6945694b84c50baa36/static/song/maanboujansanglou.mp3](https://github.com/CanCLID/jyutping.org/blob/133b7d8b75bb3e454f663e6945694b84c50baa36/static/song/maanboujansanglou.mp3)\n\nUPDATE: I saw the CEO's reply on HN and their support also reached out to me to waive the bill. But I am still curious who orchestrated the attack and they said they are still researching the incident.\n\nUPDATE: Their support haven't come back to me with the IP information I asked yet. So I posted on twitter to ask their CEO [https://x.com/laubonghaudoi/status/1762913229569974380](https://x.com/laubonghaudoi/status/1762913229569974380) and [https://answers.netlify.com/t/i-am-the-op-of-that-104k-bill-post-and-i-have-some-follow-up-questions/113472](https://answers.netlify.com/t/i-am-the-op-of-that-104k-bill-post-and-i-have-some-follow-up-questions/113472)",
    "subreddit": "webdev",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 8736,
    "downs": 0,
    "created_utc": 1709012702.0,
    "media": null,
    "is_video": false,
    "num_comments": 1172,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 6.196011341769526
  },
  {
    "score": 5876,
    "title": "I built a VSCode extension to see your code on an infinite canvas.",
    "selftext": "It shows you the connections between files based on imports / exports and you can also see reference connections (definitions, function calls, usage, etc) when you click on a function or variable → like when you ctrl+click on a token in VSCode, but it shows you visually where the references are in the codebase.  \n  \nI created it to make it easier to understand large features that span multiple files.  \n  \nI also added support for local git changes so you can better see the changes made by AI tools when they modify your code in a lot of places at once.  \n  \nAt the moment it supports javascript, typescript and react, but more languages and frameworks will be coming soon.  \n  \nYou can get it on the VSCode marketplace here: [https://marketplace.visualstudio.com/items?itemName=alex-c.code-canvas-app](https://marketplace.visualstudio.com/items?itemName=alex-c.code-canvas-app)  \n  \nHere’s also a 15 min demo of me going through all the features [https://www.youtube.com/watch?v=qRmS\\_IY3GUU](https://www.youtube.com/watch?v=qRmS_IY3GUU)",
    "subreddit": "webdev",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 5876,
    "downs": 0,
    "created_utc": 1762613592.0,
    "media": null,
    "is_video": false,
    "num_comments": 574,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.883989613059215
  },
  {
    "score": 5421,
    "title": "Got fired today because of AI. It's coming, whether AI is slop or not.",
    "selftext": "I worked for a boutique e-commerce platform. CEO just fired webdev team except for the most senior backend engineer. Our team of 5 was laid off because the CEO had discovered just vibe coding and thought she could basically have one engineer take care of everything (???). Good luck with a11y requirements, iterating on customer feedbacks, scaling for traffic, qa'ing responsive designs with just one engineer and an AI. \n\nBut the CEO doesn't know this and thinks AI can replace 5 engineers. As one of ex-colleagues said in a group chat, \"I give her 2 weeks before she's begging us to come back.\" \n\nBut still, the point remains: company leaderships think AI can replace us, because they're far enough from technology where all they see is just the bells and whistles, and don't know what it takes to maintain a platform.",
    "subreddit": "webdev",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 5421,
    "downs": 0,
    "created_utc": 1766971901.0,
    "media": null,
    "is_video": false,
    "num_comments": 827,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.898174681636907
  },
  {
    "score": 4950,
    "title": "What's Timing Attack?",
    "selftext": "This is a timing attack, it actually blew my mind when I first learned about it.\n\nSo here's an example of a vulnerable endpoint (image below), if you haven't heard of this attack try to guess what's wrong here (\"TIMING attack\" might be a hint lol).\n\nSo the problem is that in javascript, === is not designed to perform constant-time operations, meaning that comparing 2 string where the 1st characters don't match will be faster than comparing 2 string where the 10th characters don't match.\"qwerty\" === \"awerty\" is a bit faster than\"qwerty\" === \"qwerta\"\n\nThis means that an attacker can technically brute-force his way into your application, supplying this endpoint with different keys and checking the time it takes for each to complete.\n\nHow to prevent this? Use crypto.timingSafeEqual(req.body.apiKey, SECRET\\_API\\_KEY) which doesn't give away the time it takes to complete the comparison.\n\nNow, in the real world random network delays and rate limiting make this attack basically fucking impossible to pull off, but it's a nice little thing to know i guess 🤷‍♂️",
    "subreddit": "webdev",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 4950,
    "downs": 0,
    "created_utc": 1749285530.0,
    "media": null,
    "is_video": false,
    "num_comments": 306,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.665762114070078
  },
  {
    "score": 4771,
    "title": "App Store web has exposed all its source code",
    "selftext": "The App Store appears to have been rebuilt using Svelte, but they forgot to remove the sourcemap configuration in production, resulting in the complete exposure of the source code.\n\nhttps://apps.apple.com/\n\nI also uploaded a copy to GitHub: \nhttps://github.com/rxliuli/apps.apple.com\n\n---\n\nUpdate: App Store just fixed this issue.\n\n---\n\nUpdate: Repository unavailable due to DMCA takedown.\nhttps://github.com/github/dmca/blob/master/2025/11/2025-11-05-apple.md\n\n---\n\nI will not continue distributing this code, please stop sending me DM or email.",
    "subreddit": "webdev",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 4771,
    "downs": 0,
    "created_utc": 1762203894.0,
    "media": null,
    "is_video": false,
    "num_comments": 712,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.780245199924237
  },
  {
    "score": 4744,
    "title": "We need people fighting for Firefox.",
    "selftext": "Firefox has lost its edge over the decades. Despite providing some pretty innovative features at inception, it is nothing more than a reinterpretation of Chrome standards. But it is the only alternative rendering engine which Google doesn't have its hands in. Opera, Brave, and even Edge run on Chrome's rendering engine.\n\nAs more and more sites block access to Firefox's rendering engine, they create an environment where Google is the only party allowed to create features for an \"open\" \\[HTML5\\] standard. Turning the web (something open to all of us) into a proprietary conglomerate of intellectual property.\n\nFor the web to remain open, we must fight for Firefox to keep a seat at the table. Stop blocking Firefox access, simply because you don't want to test cross-browser compatibility with Chrome.",
    "subreddit": "webdev",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 4744,
    "downs": 0,
    "created_utc": 1683751658.0,
    "media": null,
    "is_video": false,
    "num_comments": 586,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.773055267387118
  },
  {
    "score": 4614,
    "title": "It Finally Happend it. Rejected for Not Using AI First",
    "selftext": "So I just got rejected from a software dev job, and the email was... interesting.\n\nYesterday, I had an interview with CEO of a startup that sounded cool. Their tech stack was mainly Ruby and migrating to Elixir, and I had three interviews: one with HR, another was a CoderByte test, and then a technical discussion with the team. The final round was with the CEO, who asked about my approach to coding and how I incorporate AI into my development process. I said something like, \"You can’t vibe your way to production. LLMs are too verbose, and their code is either insecure or tries to write basic functions from scratch instead of using built-in tools. Even when I used Agentic AI in my small hobby project, it struggled to add a simple feature. I use AI as smarter autocomplete, not a crutch.\"\n\nFast forward five minutes after the interview, and I got an email with this line:\n\n\n\"Thank you for your time. We’ve decided to move forward with someone who prioritizes AI-first workflows to maximize productivity and shape the future of tech.\"\n\n\nHere’s the thing: I respect innovation, I’m not saying LLMs are completely useless. But I’m not gonna let an AI write entire code for a feature for me. They’re great for brainstorming or breaking down tasks, but when you let them dictate the logic, it’s a mess. And yes, their code is often wildly overengineered and insecure.\n\nTo be honest, I’m pissed off. I was laid off a few months ago, and this was the first company to actually respond to my application and I made it all the way to the final round and I was optimistic. I keep reviewing the meeting in my mind, where did I fuck up? did I come up as an Elitist dick but I didn't make fun of vibe coders and I wasn't completely dismissive of LLMs either.\n\nanyway I wanted to vent here.\n\n\n**EDIT: I want to say I apperciate everybody comments here and multiple users have pointed out I was coming out as too negative, I felt that I framed in a way that I use copilot to increase my productivity but not do my job for me without supervision but I guess I failed to convey that, multiple people mentioned using the sandwich method and I would do that in the future.\n\nsome suggested I reach out to the CEO to explain my position clearly but I think I will come out as deseprate and probably rejected anyway.**",
    "subreddit": "webdev",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 4614,
    "downs": 0,
    "created_utc": 1746012385.0,
    "media": null,
    "is_video": false,
    "num_comments": 854,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.842654762726017
  },
  {
    "score": 3994,
    "title": "Why is the web essentially shit now?",
    "selftext": "This is a \"get off my lawn\" post from someone who started working on the web in 95. Am I the only one who thinks that the web has mostly just turned to shit?\n\nIt seems like every time you visit a new web site, you are faced with one of several atrocities:\n\n1. cookie warnings that are coercive rather than welcoming.\n2. sign up for our newsletter! PLEASE!\n3. intrusive geocoding demands\n4. requests to send notifications\n5. videos that pop up\n6. login banners that want to track you by some other ID\n7. carousels that are the modern equivalent of the &lt;marquee&gt; tag\n8. the 29th media request that hit a 404\n9. pages that take 3 seconds to load\n\nThe thing that I keep coming back to is that developers have forgotten that there is a human on the other end of the http connection. As a result, I find very few websites that I want to bookmark or go back to. The web started with egalitarian information-centric motivation, but has devolved into a morass of dark patterns. This is not a healthy trend, and it makes me wonder if there is any hope for the emergence of small sites with an interesting message.\n\nWe now return you to your search for the latest cool javascript framework. Don't abuse your readers in the process.",
    "subreddit": "webdev",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 3994,
    "downs": 0,
    "created_utc": 1756265595.0,
    "media": null,
    "is_video": false,
    "num_comments": 670,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.727378043734506
  },
  {
    "score": 3740,
    "title": "AI Coding Tools Slow Down Developers",
    "selftext": "Anyone who has used tools like Cursor or VS Code with Copilot needs to be honest about how much it really helps.  For me, I stopped using these coding tools because they just aren't very helpful.  I could feel myself getting slower, spending more time troubleshooting, wasting time ignoring unwanted changes or unintended suggestions.  It's way faster just to know what to write. \n\nThat being said, I do use code helpers when I'm stuck on a problem and need some ideas for how to solve it.  It's invaluable when it comes to brainstorming.  I get good ideas very quickly.  Instead of clicking on stack overflow links or going to sketchy websites littered with adds and tracking cookies (or worse), I get good ideas that are very helpful.  I might use a code helper once or twice a week.\n\nVibe coding, context engineering, or the idea that you can engineer a solution without doing any work is nonsense.  At best, you'll be repeating someone else's work.  At worst, you'll go down a rabbit hole of unfixable errors and logical fallacies. ",
    "subreddit": "webdev",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 3740,
    "downs": 0,
    "created_utc": 1752338985.0,
    "media": null,
    "is_video": false,
    "num_comments": 437,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.6137247634502545
  },
  {
    "score": 3619,
    "title": "I fired a great dev and wasted $50,000",
    "selftext": "I almost killed my startup before it even launched.\n\nI started building my tech startup 18 months ago. As a non technical founder, I hired a web dev from Pakistan to help build my idea. He was doing good work but I got impatient and wanted to move faster.\n\nI made a HUGE mistake. I put my reliable developer on pause and hired an agency that promised better results. They seemed professional at first but I soon realized I was just one of many clients. My project wasn't a priority for them.\n\nAfter wasting so much time and money, I went back to my original Pakistani developer. He thankfully accepted the job again and is now doing amazing work, and we're finally close to launching our MVP.\n\nIf you're a non technical founder:\n\n1. Take the time to find a developer you trust and stick with them it's worth it\n2. Don't fall for any promises from these big agencies or get tempted by what they offer\n3. ⁠Learn enough about the tech you're using to understand timelines\n4. ⁠Be patient. It takes time to build\n\nHope someone can learn from my mistakes. It's not worth losing time and money when you've already got a good thing going.",
    "subreddit": "webdev",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 3619,
    "downs": 0,
    "created_utc": 1729460638.0,
    "media": null,
    "is_video": false,
    "num_comments": 584,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 5.587286503574257
  }
]