[
  {
    "score": 1258,
    "title": "25 years in web dev and I’m starting to hate the \"Modern Web.\"",
    "selftext": "I remember when \"Full Stack\" meant HTML, CSS, a bit of PHP, and a SQL database.\n\nNow, to build a simple CRUD app, I need:\n\n-A framework for the frontend.\n\n-A meta-framework for the backend.\n\n-An ORM that abstractly talks to a headless DB.\n\n-An auth provider because I’m told not to roll my own.\n\n-Edge functions for \"performance.\"\n\n-A 2GB node_modules folder.\n\nI spent 4 hours yesterday configuring a build pipeline instead of writing a single feature. When did we decide that \"simple\" wasn't good enough anymore? Is anyone else just building \"boring\" monoliths and actually enjoying their job? \n\nEDIT: I’m blown away by the response—250k views in 48 hours. It’s clear I’ve hit a nerve. After reading through 400+ comments, I’ve realized the core of our collective frustration: We’ve stopped being Engineers and started being highly-paid Librarians.\n\nReal engineering is about understanding the medium—the DOM, the Network, the Browser. But \"Seniority\" in 2026 has been downgraded to just memorizing the quirks of ephemeral libraries. If your expertise depends on a framework that didn't exist 5 years ago and won't matter 5 years from now, you aren't a Senior Engineer; you’re a specialized technician for a proprietary product.\n\nThe real \"Senior\" move isn't mastering the next abstraction—it's having the guts to build on the platform itself. Stop assembling Lego sets and start building software again.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 1258,
    "downs": 0,
    "created_utc": 1767157619.0,
    "media": null,
    "is_video": false,
    "num_comments": 534,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Emotional rant about the modern web and seniority in engineering.",
    "composite_score": 5.199202621118477
  },
  {
    "score": 548,
    "title": "Ai got people a lil too confident",
    "selftext": "Some freelancer I know really thought AI was about to carry his whole career. Bro thought he could just get ChatGPT and Cursor to build websites for him and even get an AI running his python code for autmation and he simply just collects the bag.\n\nA month later bro has 10+ customers waiting for there completed website and the AI's have no idea what's going wrong, and ofc he doesnt know what could be the problem so he's gotta return the money and accept he's lost 1 month of his life.\n\nJust wanna remind y’all AI can be a good tool, even a great one. But you shouldn’t put your whole career on it. Unless your dream job is doing customer support for refunds",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 548,
    "downs": 0,
    "created_utc": 1755516994.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Warning about overreliance on AI and risks to careers; anecdotal.",
    "composite_score": 4.45881381872706
  },
  {
    "score": 453,
    "title": "Everyone says WebSockets are overkill for turn-based games, but switching from REST cut our server costs by 38 %",
    "selftext": "Everybody says “WebSockets are overkill for turn-based games, just hit / move with REST.” I believed that while building a 3-D chess app (Three.js + Node) and quickly paid the price.\n\n\n\nTwo months in, players reported ghost moves showing up out of order. We were polling every two seconds, which worked out to about 25 000 requests an hour with only 200 users.\n\n\n\nAfter switching to WebSockets the numbers told the story:\n\n\n\nAverage requests per match dropped from 1800 to 230\n\n\n\nP95 latency fell from 420 ms to 95 ms\n\n\n\nEC2 bandwidth went from \\\\$84 a month to \\\\$52\n\n\n\n“Out-of-turn” bug reports fell from 37 a week to 3\n\n\n\nYes, the setup was trickier JWT auth plus socket rooms cost us an extra day. Mobile battery drain? We solved it by throttling the ping interval to 25s. The payoff is that the turn indicator now updates instantly, so no more “Is it my move?” Slack pings.\n\n\n\nMy takeaway: if perceived immediacy is part of the fun, WebSockets pay for themselves even in a turn based game.\n\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 453,
    "downs": 0,
    "created_utc": 1751409176.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Presents a data-backed lesson on using WebSockets to reduce costs and improve performance.",
    "composite_score": 4.351594899045141
  },
  {
    "score": 269,
    "title": "Best cheap web hosting services, recommendations?",
    "selftext": "## Where to get the best hosting at affordable prices?\n\nHeyy all, I could use some advice on this. I’ve been using the same web hosting provider for a while now and quite sure I'm paying more than I should be (hosting several websites). I’ve been putting off switching because it felt like too much work, but the recent changes in quality of service and increase in prices has finally pushed me over the edge, so decided to make time for this and move to something better and cheaper. I’ve been looking around and it’s hard to tell which are actually good. So, what are your best cheap web hosting recommendations? Anyone had a decent experience with a reliable and affordable hosting service? Appreciate any suggestions. Thanks in advance.\n\nEdit: spelling and phrasing.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 269,
    "downs": 0,
    "created_utc": 1750154623.0,
    "media": null,
    "is_video": false,
    "num_comments": 269,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Simple question requesting recommendations for cheap hosting.",
    "composite_score": 4.3895456462384805
  },
  {
    "score": 214,
    "title": "I’ve started using AI as a pair programmer, not a code generator, and it’s made a huge difference",
    "selftext": "Over the last few months, I’ve shifted how I use [AI](https://www.blackbox.ai/) in my dev workflow. When I first got into it, I treated it like a vending machine: input problem, output code. Sometimes it worked, sometimes it spit out garbage, and I’d waste more time debugging than if I’d written it myself.\n\nNow I treat it more like a junior dev sitting beside me. I narrate my thought process, ask questions, sketch pseudo-code, and bounce ideas off of it. The shift is subtle but huge.\n\nInstead of asking \"write me a function that does X,\" I now ask:\n\n“Would a generator pattern make sense here?”\n\n“How would you test this if it had a race condition?”\n\n“What edge cases am I missing?”\n\n\nWeirdly, I’ve also started learning faster. Because instead of just copying code, I’m seeing different patterns, getting explanations, and then adapting stuff manually. I don’t rely on it to get me to the finish line, but it’s great at breaking inertia when I’m stuck.\n\nAnyone else evolving how they use AI day to day? I’m curious how this looks for folks in different stacks (I’m mostly working in Python + Rust).\n\n\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 214,
    "downs": 0,
    "created_utc": 1748829177.0,
    "media": null,
    "is_video": false,
    "num_comments": 38,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.82,
    "category_rationale": "Explains a mental model of AI as a collaborative pair programmer with examples.",
    "composite_score": 3.8404707634288546
  },
  {
    "score": 146,
    "title": "We yes, WE are not good web dev's",
    "selftext": "AI is speeding things up. Frameworks are abstracting everything. And beginner/intermediate devs are skipping the hard parts not because they’re lazy, but because the tools make it feel like they don’t need to learn them.\n\nNo real debugging. No understanding of the DOM. Just copy-paste, deploy, and hope the AI was right.\n\nWe’re building sites that look fine but break under pressure. We’re shipping code we don’t fully understand. And we’re getting confident before we’re competent.\n\nDrop your dev wake-up calls, your “I thought I knew what I was doing” moments, or the one thing you wish you’d learned earlier.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 146,
    "downs": 0,
    "created_utc": 1755715452.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Critique of developers relying on AI and losing deep understanding; invites reflection.",
    "composite_score": 3.704998679495298
  },
  {
    "score": 139,
    "title": "Hostinger Review: is it a good hosting service?",
    "selftext": "## Hostinger: hosting review (and let's be honest)\n\nI’ve been looking at Hostinger as a hosting provider and wanted to hear what people think. On paper, it looks like a solid budget-friendly option, but I’ve noticed a few drawbacks that make me hesitant:\n\n* **Limited Phone Support**: From what I can see, support is mainly through live chat and email. There’s no phone option, which can be annoying if you want to talk to someone for urgent issues.\n* **Multi-Year Commitment**: The introductory pricing is pretty reasonable, but the rates jump up quite a lot if you don’t lock into a multi-year plan which I'm hesitant about.\n* **Lack of cPanel**: It seems that they use their own custom control panel (hPanel) which I think can cause some frustrations for me since I've only been using cPanel and used to that.\n\nWhat do you see as the biggest drawbacks with Hostinger?\n\nHow would you compare it to alternatives like Bluehost or SiteGround?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 139,
    "downs": 0,
    "created_utc": 1756639467.0,
    "media": null,
    "is_video": false,
    "num_comments": 157,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Opinionated hosting review with pros/cons and prompts for comparison.",
    "composite_score": 3.9879565791554494
  },
  {
    "score": 133,
    "title": "Best GoDaddy Alternatives? (Competitors and similar sites to GoDaddy for domains, hosting, email), recommendations from reddit?",
    "selftext": "# Best GoDaddy Alternatives?\n\nI’m pretty new to websites and hosting. I’ve been considering going with GoDaddy, mostly because it's so well-known, but after digging into some reviews and reddit threads, I’ve seen a lot of red flags, especially regarding pricing, upsells, and their customer support.\n\nSo now I’m looking for alternatives to godaddy for domain registration, web hosting, and custom email. What I need is reliable and beginner-friendly hosting for my wordpress website (probably shared hosting or something that is affordable). I must admit, reddit advice has saved me from bad decisions before, so please share your advice.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 133,
    "downs": 0,
    "created_utc": 1752496284.0,
    "media": null,
    "is_video": false,
    "num_comments": 131,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Request for GoDaddy alternatives; asks for recommendations.",
    "composite_score": 3.929891763967732
  },
  {
    "score": 127,
    "title": "After years in this field, I'm convinced \"tech debt\" is just a polite way of saying \"we didn't think this through\"",
    "selftext": "Every time someone warns about tech debt, what they're really saying is: we're about to slap something together that'll haunt the next developer. It's not debt - debt implies you planned to pay it back. This is just accumulation.\n\nI've seen codebases where the \"quick fix\" from 2019 is now the critical path nobody dares touch. The reasoning? Always the same: deadlines, client pressure, \"we'll refactor later.\" That later never comes. Instead, you get developers whispering \"I'm afraid to touch that file\" during standup.\n\nThe real kicker is how we've normalized this. Oh, we have technical debt, just like every other shop. Cool story. What we actually have is a mess created by pretending speed and quality are compatible when you're cutting corners.\n\nWhat's your most ridiculous encounter with so-called \"tech debt\" that was really just... bad decisions stacked on bad decisions?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 127,
    "downs": 0,
    "created_utc": 1762991913.0,
    "media": null,
    "is_video": false,
    "num_comments": 147,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Strong stance that tech debt is due to bad decisions, not true debt.",
    "composite_score": 3.837340827345347
  },
  {
    "score": 127,
    "title": "IONOS review, web hosting - is it a good deal?",
    "selftext": "## Please share your IONOS review and hosting experience\n\nThinking about trying out IONOS. I’ve seen some people swear by them, so they've got a loyal following. Anyone tried their hosting services? The most popular types of hosting that people seem to sign up for are:\n\n1. Web Hosting\n2. VPS Hosting\n3. WordPress Hosting\n\nEdit: there are also some negative reviews of IONOS (seems to be the case for all hosting companies). So, I did some more research and reading forum threads to see if I could get some kind of general consensus. I made a pro-con list based on what I could find and the most popular answers were:\n\nPros:\n\n* Value for money: Excellent\n* Tech &amp; Scalability: Great\n* Customer Service: Excellent\n* Only 1 year commitment (while other hosting providers require a 3-4 year commitment)\n\nCons:\n\n* User Interface: not as modern as other hosting providers.\n* Renewal Price: increases after 1st year (although that's the same for all hosting providers)",
    "subreddit": "webdevelopment",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 127,
    "downs": 0,
    "created_utc": 1755118378.0,
    "media": null,
    "is_video": false,
    "num_comments": 122,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Hosting/service review with pros/cons and a request for opinions.",
    "composite_score": 3.9021625253675674
  },
  {
    "score": 113,
    "title": "Eerie lack of news on how company's are actually coding with AI",
    "selftext": "Here's what I know. Google has leading AI models. And they have access to more compute than anyone in history. \n\nThey could release the blueprint for what they're doing and no one would be able to keep up because of the sheer power they have. Same with every FAANG.\n\nThese companies always describe exactly what they're doing to dominate the market. For a very simple reason, it boosts stock price.\n\nSmall developers are also eerily quiet about how they're using these tools. You get very very generic responses from people with no solid understanding of what they're doing, how to audit it, or if it's even working/saving time. \n\nWhat I've seen in person is tons of broken products that aren't quite working, and llms spitting out tons of text with the developer not really being able to explain it properly. \n\nPersonally, it takes me longer to develop with AI because it often can't understand what I'm describing and will take the wrong approach if it does, generating logical paradigms that need to be reworked for extensibility. It takes me longer to undo the bad code it creates than it does to just read the documentation and code it from scratch. I've stopped using it completely because it wastes more time than it saves. The SaaS I'm coding is a bit annoying to set up but once I'm done with it, I'll have reusable parts that will snap together into many more SaaS projects.\n\nIn Empire of AI by Karen Hao, who is an engineer who was in school with many folks in the industry, she says that these companies are more in the business of nation building, and that AI is awesome for very specific tasks such as detecting heartbeats, but its not in the AGI realm and is not good at creating general solutions for general problems,  such as code or writing accurate news. \n\nKnowing many folks in tech, large companies thrive off of a combination of real profits and PR that both affect stock price. The current administration is making it difficult for companies to plan for the next four years. Inflation, unpredictable taxes on foreign goods, changing laws around hiring and many other things are making companies very conservative with money.\n\nThis points to a few things IMO: most companies based in the US will (and already are) struggle to compete with international competitors probably decreasing their stock price as soon as there's enough public opinion on this, companies are not freezing hiring because of AI but instead because of unpredictable financial market conditions which can be solved with stable policy choices, AI is an emperors new clothes situation with giant companies sucking up as many resources as they can before people figure out that there's not a serious application for data center powered llms by which time they will own anything they bought with investment money during that time\n\nThis then points to a few things: \nIt's probably not your \"bad prompting,\" AI is really inconsistent, your just getting lucky/unlucky. Companies may be using the excuse of AI to boost stock price when in fact they're really weak and holding on to cash reserves while the economy crashes. The combined lack of growth of US companies + lack of buying power from the average person due to lack of jobs + investment shift to ai preventing growth of new non AI companies + unstable market conditions will probably devastate the US market to a level that hasn't been seen by anyone living currently, many are pointing to the RMB overtaking the USD as the global currency not even due to this but due to the fact that they've invested in their own economy (ai, green technology, manufacturing, construction, transportation, and more) consistently and this is just the death stroke. \n\nMost investors and folks in tech probably know this. It's usually the public who is last to learn after many players like banks and fortune 500s have hedged their bets on the negative future. They all survived the financial crash. It's likely many large financial interests are just quietly moving their focus from companies and currencies that are weak to ones that are strong.\n\nI'm not really sure what the average person can do about global market conditions, but it seems silly to keep using ai for things it doesn't work for. I for one have stopped telling myself that I'm bad at prompting and am just one good prompt away from a million dollar business, when in fact it's faster for me to hand code the exact same business.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 113,
    "downs": 0,
    "created_utc": 1758733918.0,
    "media": null,
    "is_video": false,
    "num_comments": 93,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Offers a conceptual critique/insight about how big AI players shape PR and practical limitations of AI in coding, not a step-by-step guide.",
    "composite_score": 3.718468778136322
  },
  {
    "score": 114,
    "title": "WordPress is the worst thing to ever happen to the internet",
    "selftext": "I've been trying to build a page using the HTML editor, and it just keeps creating more and more bizarre problems.\n\nIf you add line breaks between nested DOM elements, the page will not render those inner nested DOM elements. That's never happened with regular html, PHP or react apps. \n\nNext, even if you don't add line breaks, WordPress will start adding &lt;p&gt; tags all over your code and break the entire page and prevent it from loading.\n\nFor what? Why can't you just let me build the page man? Why do they even have a HTML editor if they're going to add all this functionality on top of it?\n\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.78,
    "subreddit_type": "public",
    "ups": 114,
    "downs": 0,
    "created_utc": 1752197490.0,
    "media": null,
    "is_video": false,
    "num_comments": 78,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Expresses ongoing frustration with WordPress HTML editor and renders a venting stance rather than a how-to or explanation.",
    "composite_score": 3.5945113859988327
  },
  {
    "score": 95,
    "title": "What’s the most exciting innovation in web development right now?",
    "selftext": "Web development is evolving so fast that it feels like every year there’s a new tool, framework, or concept that changes the way we build websites. From AI-powered coding assistants to new frameworks and performance optimizations, it’s hard to keep up with everything. In your opinion, what’s the most exciting innovation in web development right now, and why do you think it has the potential to shape the future of the field?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 95,
    "downs": 0,
    "created_utc": 1756651243.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Prompts discussion about the most exciting innovation without presenting steps, models, or a resources list.",
    "composite_score": 3.6806571001726907
  },
  {
    "score": 84,
    "title": "I cheated on my usual stack for an internal tool and I kind of liked it",
    "selftext": "Couple of months ago I had one of those lovely tickets:\n\n\"Can you spin up a small internal tool so the support team can edit records without pinging devs every time?\"\n\nIn my head that translates to:  \n\"Please build a whole mini product, maintain it forever and pretend it was a quick task.\"\n\nI did what I always do. Opened a new repo, set up Next, wiring auth, basic layout, forms, tables, the usual boring stuff. Two evenings in I realised I was basically recreating the same internal app I have built five times already. Same CRUD, same filters, same role checks. Just a different logo.\n\nSo I rage quit my own repo and did something I have quietly made fun of before: I opened one of those internal tool builders. Tried Retool again, poked at Appsmith, then ended up playing with UI Bakery on a small test database. I told myself it was \"just to see what it can do\".\n\nLong story short, the thing my brain had scoped as \"ugh, this will eat my week\" turned into \"ok, this is actually usable\" in an afternoon. I still wrote some logic, still had to think about data and permissions, but I did not touch half the boilerplate I usually babysit.\n\nNow I am in this weird spot where for public stuff I still enjoy doing everything by hand, but when someone says \"we just need an internal panel so the team can update X\", a very lazy part of my brain whispers \"or you could let a builder handle 80 percent of it and go back to the interesting problems\".\n\nCurious if anyone else here has crossed that line.  \nHave you let tools like Retool, UI Bakery, Appsmith and friends into your workflow for internal stuff, or are you still writing every admin from scratch and sleeping better at night because of it?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1766538052.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Shares a qualitative insight about when internal tool builders can replace custom coding, offering a takeable idea rather than steps.",
    "composite_score": 3.221478917042255
  },
  {
    "score": 84,
    "title": "What’s one underrated web dev skill that made your life so much easier?",
    "selftext": "I feel like we often discuss the big stuff, frameworks, languages, and tools, but sometimes the smaller, underrated **skills or habits** make the biggest difference in our workflow.\n\nFor me, it was **learning regex properly**. I used to avoid it, but once I got comfortable, debugging and data parsing became **10 times faster**.\n\nCurious.....what’s *your* underrated **web dev skill** that saves you tons of time but doesn’t get talked about enough?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 84,
    "downs": 0,
    "created_utc": 1758189113.0,
    "media": null,
    "is_video": false,
    "num_comments": 154,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for underrated skills, a discussion prompt without explanation or steps.",
    "composite_score": 3.7445847747994385
  },
  {
    "score": 59,
    "title": "Fiverr Stole 110+ Hours of My Work for $0 – Don’t Trust This Platform!",
    "selftext": "Fellow freelancers, I’m beyond furious and need to warn you about Fiverr. I poured 110+ hours into a coding project, only for Fiverr to cancel it all, leaving me with $0 while the client kept my work AND a domain I paid for. Here’s my horror story:\n\nI took a $450 web dev project with two milestones. First milestone (HTML, JavaScript): fully done, approved by the client, 1000s of lines of clean code. Second milestone (styling): 80% done, but technical issues stopped me. I offered to refund the second part and handed over ALL files—code, docs, even a year-long domain I funded.\n\nThe client demanded a full refund, claiming it was “unusable” (despite approving the first milestone!). Fiverr sided with them, cancelling *everything*. I got nothing, and the client kept my work for free. I fought with support for weeks, sending evidence (code, screenshots). Their final excuse? The client “lost trust” and “didn’t want an incomplete project.” They claim the client can’t use my work per their policy, but there’s no enforcement—Fiverr just shrugs while I lose 110 hours and domain costs.\n\nEven after my Trustpilot review, Fiverr doubled down, saying the cancellation is final because I couldn’t finish. They ignored that the first milestone was DONE and APPROVED. I’m done with Fiverr—they don’t care about freelancers. Your approved work can be erased if a client whines, and you’ll get nothing.\n\n**Please share this to warn others!** Has anyone else been screwed by Fiverr? How do you avoid platforms that exploit freelancers? I have proof (screenshots, files) and can share privately. Let’s expose this unfair system!\n\n**TL;DR**: Fiverr cancelled my 110-hour coding project ($450) after the client got my work and domain for free. Support ignored my evidence and protects clients over freelancers. Avoid Fiverr!",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.6,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1744933448.0,
    "media": null,
    "is_video": false,
    "num_comments": 72,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Venting about Fiverr with moral stance and warning others; emotional and grievance-focused.",
    "composite_score": 3.1598126804438715
  },
  {
    "score": 61,
    "title": "How’s everyone actually using AI in their web dev workflow these days?",
    "selftext": "Just wanted to get a feel for how folks are really using AI day to day in web development. \n\nI’ve been in the field a while, and it feels like every year there’s something new to learn especially now with AI tools everywhere.\n\nRecently, I have started relying on AI for things like generating boilerplate code, debugging weird JavaScript errors, and even helping write better CSS. Sometimes it totally nails the solution, and other times it comes up with creative answers that make me laugh 😂.  \n\nCurious are you using AI mostly for speed, learning new frameworks, or just as a coding buddy to bounce ideas off of? But literally ai sometimes sucks in the code instead of giving accurate stuff ai provides shits.\n\nAnd do you ever worry about it keeping up with the constant changes in front-end tech?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 61,
    "downs": 0,
    "created_utc": 1751571412.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks how people use AI in web dev; discussion prompt without a central claim or steps.",
    "composite_score": 3.4505880320773663
  },
  {
    "score": 59,
    "title": "I don't understand why cheap clients have unrealistic expectations.",
    "selftext": "I recently worked with a client who wanted me to built a e-commerce store for his sporting brand. He wanted OTP based auth, automatic invoicing, and all the backend features that usually cost $10k. And guess what was his budget, only $100. I mean, how can someone expect everything in this low price. And on top of that, he was telling me either you it in this scope or leave it, don't lecture me - I was just trying to tell him the reality about this and without understanding that he flipped me off.\n\nSeriously man, who do they think they are this kind of cheap clients?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1767005112.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Expresses frustration about cheap clients and unrealistic expectations; emotional rant.",
    "composite_score": 3.402226875575465
  },
  {
    "score": 55,
    "title": "nordvpn free trial?",
    "selftext": "## How to get NordVPN free trial?\n\nNordVPN seems to be top-rated everywhere I look (and also reasonably priced), so would like to try it out. Does anyone have any experience using it? Also, can't seem to find a clear answer on if they have a free trial or not? The most popular answers are:\n\n* 7 day free trial\n* 30 day free trial\n* 30 day money back guarantee\n* 1 year free trial (through revolut)\n* No free trial (can't find trial page)\n\nAppreciate any insights on any of this.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 55,
    "downs": 0,
    "created_utc": 1752923841.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Simple question about NordVPN free_trials; generic question.",
    "composite_score": 3.327612572374828
  },
  {
    "score": 52,
    "title": "Looking for a lightweight Postman alternative for web development",
    "selftext": "Postman is great, but sometimes it feels heavy and cloud-dependent not always ideal for quick API testing during web development.\n\nI recently came across a Postman alternative called Apidog that works fully offline, supports OpenAPI specs, and lets you import Postman collections if needed.\n\nCurious what others are using any other Postman alternatives that make API testing smoother for frontend or full-stack projects? How do you keep your API workflow fast and reliable?\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 52,
    "downs": 0,
    "created_utc": 1762160801.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for lightweight Postman alternatives; product inquiry; lacks steps.",
    "composite_score": 3.231309891775927
  },
  {
    "score": 53,
    "title": "Should people be allowed to ask for feedback in this subreddit?",
    "selftext": "We do have a rule against promoting your company resp. your own work. But where should we draw the line between this and some beginners posting their portfolios because they really just want some feedback instead of promoting anything? \n\n\nShould we maybe only allow feedback posts on a specific day of the week to decrease posts that look like spam? \n\n\nPlease tell me your thoughts, since I want to make this subreddit a better place with less spam and more quality posts. :) ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 53,
    "downs": 0,
    "created_utc": 1708254252.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Meta discussion about subreddit rules and how to handle feedback posts.",
    "composite_score": 3.2406332183440965
  },
  {
    "score": 49,
    "title": "How do i actually get better on html/ccs and coding?!",
    "selftext": "How do I actually get better at HTML/CSS and coding?\n\nHey folks,\n\nI’ve been learning Html and CSS for a bit now, and I can do some basic stuff, but Im kinda stuck on how to really level up. I understand the basics, but I don’t feel like I’m improving fast enough or learning the core of how coding actually works.\n\nMy gaol is to eventually freelance or even run my own little business someday, but right now I just feel like I’m spinning my wheels. I like to learn this skill, so i can apply for jobs. There so much info out there that it’s hard to know what’s worth focusing on, please help me in right direction 😁\n\nSo Id love to hear from you all, hw did you go from knowing the basics to feeling confident as a developer? Any tips, projects, or learning paths that helped you break through that beginner phase?\n\nAppreciate any advice or direction you can give. I really want to get serious about this and keep improving.\nGreetings from Sweden 🇸🇪",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1759756988.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Requests advice on learning HTML/CSS; not a list, model, or step-by-step.",
    "composite_score": 3.3560090505240554
  },
  {
    "score": 49,
    "title": "AI wrote 41% of code for new websites this year. After resisting for ages, I finally caved and tried GitHub Copilot. I'm conflicted.",
    "selftext": "Hey everyone,\n\nI've always been in the real developers write their own code camp. But with the recent Stack Overflow survey showing AI tools are absolutely exploding , and stats suggesting that AI is involved in the code for a huge percentage of new sites , I felt like I was being left behind. So I gave GitHub Copilot a serious shot on a new project last month. And... it's terrifyingly good.The good stuff is real: It dramatically cut down my time on boilerplate code and unit tests. What used to take an hour now takes minutes . It's like having a senior dev pair-programming with you, suggesting whole functions and catching silly syntax errors before you even run the code. It helped me quickly use a new API I wasn't familiar with by generating the standard fetch and handling code. But here's what keeps me up at night: The \"Black Box\" Problem: Sometimes it suggests a complex function that works, but I have to spend time actually understanding the code it wrote. Am I learning, or just becoming a glorified code reviewer? Skill Atrophy: If I let it handle all the routine stuff, will I forget how to do it myself? Are we creating a generation of developers who can't code from scratch? Dependence: I'm already feeling reliant on it. Starting a new file feels awkward without the tab-complete magic.A part of me feels this is just the next step in evolution, like moving from writing machine code to using high-level languages. Another part feels like I'm cheating.\n\nSo I'm curious what this community thinks:\n\nFor the AI converts: How has it changed your workflow? Are you actually a better developer now?\n\nFor the holdouts: What's your main reason for avoiding it? Is it principle, cost, or something else?\n\nAnd for everyone: Do you think \"AI-assisted developer\" will become a formal job title, or is this just the new normal that everyone will be expected to use?Let's discuss. I'll start by sharing a couple of specific examples in the comments.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1761901539.0,
    "media": null,
    "is_video": false,
    "num_comments": 66,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Explores the implications of AI-assisted coding and personal learning with reasoning.",
    "composite_score": 3.2045074056864324
  },
  {
    "score": 47,
    "title": "Where do I hire a reliable web developer?",
    "selftext": "I'm wondering where do I hire a web developer for a project I've been planning. I need to build a simple yet functional website (not quite an MVP, but close). I have zero programming knowledge but I'm clear on the design and functionality I want. I've even sketched out wireframes and have a decent understanding of the user flow I'm aiming for.\n\nMy budget is pretty tight (thinking under $3k if possible), so I can't afford the big agencies or premium consultants. What's the best way to find a trustworthy web developer? My budget is pretty tight. I'm flexible about working with freelancers, part-time contractors, or any arrangement that makes sense.\n\nAlso wondering about timelines, is it realistic to expect something functional within 4-6 weeks, or am I being too optimistic? Any red flags I should watch out for when hiring a potential web developer? Really don't want to learn this lesson the hard way.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1756556608.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for recommendations on finding a reliable web developer.",
    "composite_score": 3.4518052552147065
  },
  {
    "score": 42,
    "title": "How can I be better developer",
    "selftext": "I'm a college student currently entered my 3rd year and I'm doing dsa and computer fundamentals obviously but along with that i really wantbto improve my web development I know quite a good amount of stuff as of now I'm able to build proper stuff but I need to take help from gpt which I genuinely don't want like if I know that thing and I take help then it's fine but a lot of times i end up asking gpt even when I don't know how to fix that issue which kind of leaves that learning opportunity for me! How can I improve as a web developer would love to get suggestions from you people! I want to do fullstack development but with specific focus on frontend for now! ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1750982117.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Requests tips and strategies to improve as a developer; no clear model or steps.",
    "composite_score": 3.110502477754724
  },
  {
    "score": 42,
    "title": "5 Websites Where Web Developers Can Earn Online",
    "selftext": "\n\t1.\tUpwork – A freelancing platform where you can find projects of all levels.\n\t2.\tFiverr – Create your own gigs and let clients reach out to you.\n\t3.\tToptal – A premium platform for high-paying international clients (entry is competitive).\n\t4.\tFreelancer – A global marketplace with opportunities for beginners and experts.\n\t5.\tRemote OK – Find both remote jobs and freelance gigs from companies worldwide.\n\nPro Tip: Keep your portfolio strong and make sure your LinkedIn profile is well-optimized.\n\nBuilding your career as a web developer is easier when you combine freelancing platforms with remote job opportunities.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1758183389.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.95,
    "category_rationale": "Explicitly enumerates five websites for web developers to earn online.",
    "composite_score": 2.9646797959906896
  },
  {
    "score": 41,
    "title": "Why Most CS Students Stay Jobless After Graduation",
    "selftext": "years of CS degree... still jobless? Here's the harsh truth\n1. No Projects → Only Theory\nEmployers don't care about how many courses you passed. They care if you can build something.\n2. Weak GitHub → No Proof of Skills\nNo recruiter will believe your CV unless you have a portfolio of projects to back it up.\n3. No Networking → No Visibility\nEven skilled students get ignored if recruiters don't know they exist. LinkedIn, GitHub, Discord, and communities matter.\n4. Resume Full of Buzzwords → Not\nResults\n\"Quick learner, team player, passionate\" won't get you hired. Show what you built, solved, or achieved.\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1758296003.0,
    "media": null,
    "is_video": false,
    "num_comments": 35,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Presents a numbered list of common causes for CS students staying jobless.",
    "composite_score": 3.046400540781544
  },
  {
    "score": 37,
    "title": "Can you start a freelancing career with just HTML, CSS, and JavaScript?",
    "selftext": "Hello everyone,\n\nI've been learning web development and feel comfortable with the fundamentals of HTML, CSS, and vanilla JavaScript. I can build responsive, static websites from scratch.\n\nI'm interested in starting to freelance but I'm not sure if my current skillset is sufficient to find work or if i need to learn a backend language (like Node.js/PHP) or a front-end framework (like React) first.\n\n**My main questions are:**\n\n1. **Is it possible?** Can you find legitimate freelance clients with just these core front-end skills?\n2. **What kind of projects?** What specific types of jobs or clients should I be targeting? (e.g small business websites, landing pages, redesigning existing sites).\n3. **Setting Expectations:** What is a realistic price point for projects built with these technologies when you're just starting out?\n4. **Next Steps:** For those who started with this skillset, what was the most valuable thing you learned next to increase your earning potential?\n\nAny advice, personal experiences, or warnings about common pitfalls would be incredibly helpful. Thanks in advance!\n\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1756529940.0,
    "media": null,
    "is_video": false,
    "num_comments": 68,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Asks whether freelancing with core front-end skills is possible and seeks guidance.",
    "composite_score": 3.226708141985438
  },
  {
    "score": 40,
    "title": "I Stopped Chasing “Original” Ideas and Just Started Building What I’d Actually Use",
    "selftext": "I used to get stuck on the idea that whatever I built had to be original. Like, it had to solve some weird edge case or be clever enough that people would instantly see the value.\n\nBut that mindset just led to overthinking and procrastination. I’d write out ideas, sketch out a few components, then drop the whole thing because “this already exists” or “it’s not exciting enough.” Nothing ever shipped.\n\nThat changed once I started actually building the stuff I needed. I stopped worrying if the idea was unique and just asked, would I use this every week? That question unlocked everything.\n\nRight now I’m working on a code snippet vault, just a clean space to save and tag useful code I reuse often. It’s not groundbreaking. But it’s mine. It’s minimal, dark-themed, local-first, and it fits how I work. I reach for it. That’s what matters.\n\nTurns out, building something simple and useful feels way better than obsessing over the perfect idea. You learn faster. You ship more. You care more, because it solves a real thing for you.\n\nSo if you’ve been stuck in the “what should I build” loop, here’s my advice: stop chasing originality. Pick something small. Build the tool you wish existed last week. Make it weird, make it fast, just make it.\n\n\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1748530588.0,
    "media": null,
    "is_video": false,
    "num_comments": 14,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Offers a personal strategy about building useful, small tools rather than chasing originality.",
    "composite_score": 2.913329486247576
  },
  {
    "score": 41,
    "title": "My advice for new developer If you're wondering where to start.",
    "selftext": "I have been a frequent user of this subreddit since 2019, and I must say, I am growing weary of the repetitive posts. The constant questions about where to begin and how to build a portfolio are becoming tiresome. I have been in your shoes, and I know how frustrating it can be. So, I want to share some tips to help put an end to this flood of questions.\n\nHere is my action plan for developers who are new to the industry.\n\n1. Check out the [MDN Getting Started Modules](https://developer.mozilla.org/en-US/docs/Learn_web_development/Getting_started). They're a great resource for beginners looking to learn more about the basics of software development and learning about developer soft-skills. \n2. Spend time slowing down, writing things down and speaking out loud with a notebook. \n   * Take the time to slow down, jot things down, and speak out loud with a notebook. It's important to invest in a good pen and notebook to start writing things down immediately. Research has shown that writing things down can improve your attention span and help you retain information in the long run.\n   * Set aside a specific time block for your studying, coding, job hunting, etc. After you finish studying and wrtiing the content inside the notebook, create a new page in your notebook and write a summary of the topic you just learned. Keep this page focused on the topic you researched, and try to keep it to a maximum of one page. Write the summary in your own words to reinforce your understanding.\n   * Once you complete a topic, write a summary on a new page in your notebook. This will serve as your own personal blog. When you're researching and learning new things, avoid relying on tools like ChatGPT or DeepSeek. It's important to challenge yourself to solve problems on your own.\n   * Only type out your notes after the notebook is completed. This way, you can keep track of everything you've learned over time orgnaize things more effectively. By taking the time to write things down and summarize your findings, you'll improve your learning process.\n3. Setting Up Your GitHub\n   * When it comes to setting up your GitHub profile, there really are no right or wrong ways to do it because everyone is unique. However, there are some tips I have learnt overtime.\n   * First, make sure to have a profile picture of yourself and ask someone to write a brief description about you. This personal touch can make your profile more engaging and inviting to others.\n   * Next, treat your GitHub activity like a job by aiming to make a minimum of 10 commits a day. Consistency is key when it comes to showcasing your skills and dedication.\n   * Remember to take a break on Saturdays and Sundays to go out and enjoy life. Having hobbies outside of the computer can help you stay sane during this crazy time.\n   * When making git commits, be sure to write descriptive messages that are easy for others (and your future self) to understand. Clear communication is essential in the world of coding.\n   * If you're unsure about how to use Git with GitHub, consider following **The Odin Project**.\n4. Establishing Your Professional Presence\n   * To begin, craft your resume and cover letter using Google Docs with r/EngineeringResumes wiki template. Familiarize yourself with the [MDN writing guidelines](https://developer.mozilla.org/en-US/docs/MDN/Writing_guidelines/Writing_style_guide) to enhance your technical writing skills. Next, [set up a good LinkedIn profile](https://www.linkedin.com/help/linkedin/answer/a554351) and create a Github profile for networking and showcasing your work. More information on how to create these profiles can be found below.\n5. Show employers that you are constantly improving yourself.\n   * Remember those topics you summarized in your notebook? Take some time to review them and jot down new ideas in a developer-like manner. These notes can be used for your future blogs.\n   * If you're unsure how to start writing, find a developer whose style you like and use that and STICK WITH IT. Linux open source enthusiasts are a great source of inspiration, but stay true to yourself.\n   * Don't stress about making mistakes - they just show that you're human and still learning. When proofreading your articles, use AI to help with grammar and flow, but make sure to read them out loud to ensure they sound like you and effectively convey what you've learned.\n6. When is the best time to start building your portfolio? \n   * You should aim to have at least 5 to 10 projects under your belt before showcasing your work. \n   * Consider adding articles from your LinkedIn profile to your portfolio to enhance its content. \n   * Using a template can be a great way to start, as creating one from scratch is time-consuming.\n7. Being social and connecting with others is crucial in today's world.\n   * Spending too much time on the computer can actually be detrimental to your personal and professional growth. Trust me, I've been there. Here are some tips I suggest: \n      * Attend networking events to meet new people and expand your circle.\n      * Take the time to understand corporate culture and dress codes, even if you don't necessarily agree with them. It's all part of the game.\n      * Even if you're not a coding expert, attending coding events can help you learn how to collaborate with other developers.\n      * Show up to in-person events on time and dressed appropriately. First impressions are key and can show potential employers that you're a competent and serious individual.\n      * Don't underestimate the power of fashion and good hygiene. Looking put together can make a big difference in how you're perceived.\n      * Remember, being social and engaging with others can open up new opportunities and help you grow both personally and professionally. So, don't be afraid to step out from behind the computer screen and make those real-life connections.\n8. How can I gain experience buidling website:\n   * If you're looking for some cool projects to work on, I recommend checking out The Odin Project.\n   * Start with their Foundations course, stick with it and complete it. \n   * Move on to their Full Stack Ruby Course if you have no expereince with full stack. \n   * If you have expereince with other backend languages I would look into Full Stack JavaScript.\n9. Stick with one thing by dedicating a set amount of hours at a time and move onto the next one after you’ve reached the limit or completed the work. Do not waist time by juggling task switching. Here’s an example. I will spend a total of 24 hours to research MDN getting started modules. My time limit is 4 hours a day 9am- 12pm and 1hr lunch break and apply to jobs the rest of the day. \n\nI want to clarify that I did not use AI to write this post because I was fed up with all the automated content out there. However I did use it to improve the flow. I also want to point out that this field is extremely competitive, with people from all walks of life. Watch TomoFujitaMusic, Pirate Software videos on how to push through as a developer:\n\n- [https://www.youtube.com/shorts/k0m\\_pUKsu84](https://www.youtube.com/shorts/k0m_pUKsu84) .\n- [https://youtube.com/shorts/G7L6mQxlfVU?si=TkC4zh3NMwJoc2Ye](https://youtube.com/shorts/G7L6mQxlfVU?si=TkC4zh3NMwJoc2Ye)\n- [https://youtube.com/shorts/WrYueV4W0F4?si=goOiO731Yps93Bwo](https://youtube.com/shorts/WrYueV4W0F4?si=goOiO731Yps93Bwo)\n- [https://youtube.com/shorts/YRW73ZRd3PU?si=3usjDejyzk2uSgpy](https://youtube.com/shorts/YRW73ZRd3PU?si=3usjDejyzk2uSgpy)\n\nIf you have any suggestions or notice any areas where this article could improve, please reach out. Also do not hesitate to reach out and share your thoughts.\n\n--\n\nEdit #1 - Added some inspirational videos.\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 41,
    "downs": 0,
    "created_utc": 1746682963.0,
    "media": null,
    "is_video": false,
    "num_comments": 3,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.88,
    "category_rationale": "Provides an explicit action plan with numbered steps for beginners.",
    "composite_score": 2.659279286061882
  },
  {
    "score": 35,
    "title": "Is Web Development worth it?",
    "selftext": "Hello, Im just now starting my major in computer science, fresh. I’m doing research on what i want to do within it &amp; I want to be a  web developer, but I’m scared as time go by ai will take over. As i said Im a beginner,so I can literally start with anything, i just don’t want to put my time &amp; energy into web development all for me to graduate &amp; be useless when i can start , grow &amp; focus on something else right now . any suggestions , what cs fields are safe from ai or should I not be worried &amp; go for it :/ ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1738825154.0,
    "media": null,
    "is_video": false,
    "num_comments": 65,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal career-question post requesting suggestions; lacks a structured argument or steps.",
    "composite_score": 3.1410744685382213
  },
  {
    "score": 36,
    "title": "How to learn web development (front-end) as a beginner??",
    "selftext": "I keep getting stuck in tutorial hell and don't know how to actually learn front-end development, can anyone recommend online resources that i can use to go from a beginner to advanced.\n\nIm going to start 11th grade, I want to learn front end development to enhance my problem solving and use it as a stepping stone for further skills in cs (i've heard learning front-end development is great for beginners)",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 36,
    "downs": 0,
    "created_utc": 1751220533.0,
    "media": null,
    "is_video": false,
    "num_comments": 42,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "A request for learning resources; not a list, guide, or rationale.",
    "composite_score": 3.089935951856788
  },
  {
    "score": 36,
    "title": "\"Your rates are too high.\"  How I learned to stop flinching and start leading",
    "selftext": "When I first started freelancing, this phrase would wreck me.  \nI’d panic. Offer discounts. Throw in free work. Or worse, justify every single line of my proposal.\n\nBut over time, I realized something:\n\nThe pros don’t argue. They **lead**.\n\nNow, when a client says “Your rates are too high,” I just respond with:\n\n&gt;\n\nNo arguing. No discounting my value.  \nJust adjusting the **work**, not the **worth**.\n\nThat one shift:\n\n* Shows confidence\n* Saves my energy\n* Filters out bargain hunters\n\nAnd you know what?  \nThe clients who respect this usually come back, refer me to others, or turn into long-term partnerships.\n\nThe rest?  \nThey were never going to respect the work anyway.\n\nHold your ground.  \nLet your clarity sell for you.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.62,
    "subreddit_type": "public",
    "ups": 36,
    "downs": 0,
    "created_utc": 1751196514.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Central claim about how to handle price objections with reasoning and a mental model.",
    "composite_score": 2.8395936524268626
  },
  {
    "score": 35,
    "title": "I made a 100% FREE shots.so alternative (Mockupviews) – browser-based mockup tool",
    "selftext": "Hey,  \nI used to use [shots.so](http://shots.so) to make clean mockups for my apps and designs. It was super useful. But now most of the features are paid. I totally respect the team — they made something great and deserve every cent — but I just don’t like when free tools go paid all of a sudden.\n\nSo I decided to build my own version, it’s called [Mockupviews](https://mockupviews.web.app).  \nIt’s 100% free, runs in the browser, no sign up needed. Just upload your screenshot and choose a mockup frame.\n\nSome of the main features so far:\n\n* Mobile and browser mockup frames (like iPhone, Chrome, etc.)\n* Magic backgrounds (generates cool backgrounds)\n* Custom background color or gradient...\n* High-quality export\n\nIt still has a lot of bugs and missing stuff. I made it mostly for myself at first, but decided to share it in case it helps someone. If you try it and something is broken or weird, let me know — I’ll try to fix it when I can.\n\nNot promoting or anything, just sharing what I built:  \n👉 [https://mockupviews.web.app](https://mockupviews.web.app)\n\nPS: This is my first time porsting in Reddit ever so take it easy on me pls haha...\n\nThanks for reading!",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1747701853.0,
    "media": null,
    "is_video": false,
    "num_comments": 28,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.5,
    "category_rationale": "Announcement with feature bullets; not a clear listicle or actionable guide.",
    "composite_score": 3.0225014997167654
  },
  {
    "score": 37,
    "title": "I'm 15, learning Web Dev, and I built a $0/mo Booking System for a Barber using vanilla HTML/JS and Google Sheets.",
    "selftext": "&gt; Hi everyone!\n&gt; I'm a 15-year-old student from Belgium 🇧🇪. I've been learning web development for a while now.\n\n&gt; Recently, I landed a gig for a local barber who needed a reservation system but refused to pay monthly fees for expensive SaaS platforms (like Planity).\n\n&gt; So I challenged myself to build a custom solution for free:\n\n&gt;  * Frontend: Pure HTML, CSS, and JavaScript. No frameworks (like React/Next.js) yet, I wanted to master the basics first.\n&gt;  * Database: A simple Google Sheet.\n\n&gt;  * How it works: The site sends the booking data to the Sheet via a script, and the barber uses a simple Admin page I made to see the rows and accept/cancel appointments.\n&gt; It handles about 5-10 bookings a day and costs him $0/month in hosting (Vercel + Google Drive).\n\n&gt; My question:\n&gt; Is sticking to Vanilla JS and Google Sheets a sustainable strategy for freelancing with small local businesses? Or should I use my skills in Next JS React and use Supabase ?\n&gt; Thanks for the advice!\n",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.79,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1766397221.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Personal project share with a question; mainly anecdotal and seeking advice.",
    "composite_score": 2.9315405665557543
  },
  {
    "score": 35,
    "title": "AI has killed the job for [sulk]",
    "selftext": "I spent years teaching myself to code, not just a bit of html, javascript and css, I really went down the rabbit hole. Tried and failed for years to land a webdev job, each time I got knocked back if it was because of a technical lack, I went out and learned whatever it is was missing from my c.v built projects and tried again.  \nEventually I gave up and got work on a helpdesk for a small MSP who needed someone who could handle the odd dev job.  \nEventually I moved into a proper development role for an agency, an apprenticeship studying for a degree, but as time has gone on I am coding less and using AI more, it's corporate policy, never mind that half the time cursor goes on an absolute-fucking-rampage through a project's code at the slightest provocation meaning I then have to spend forever going through all of these changes or reject them all and start again. Nevermind that chatgpt makes up methods that don't exist in well known and widely used packages. Nevermind that as time has gone on, tasks that I used to be able to do reflexively, I now struggle to comprehend and have to run to the AI to explain it to me.\n\nI wanted to be a computer programmer (showing my age there with that terminology)\n\nWhat I am is a data-entry clerk pasting ai generated nonsense into an IDE.\n\nIt wouldn't be so bad if it could write code properly but it doesn't, huge labyrinthine files filled with spaghetti just like mama used to make, having to go through it is a nightmare and testing it is all but impossible. But we keep doing it because its quick, quick pacifies the client and gets the money in. But the quality of the work is horrific and it is making me really, really really sad.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.72,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1748460829.0,
    "media": null,
    "is_video": false,
    "num_comments": 94,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Strong emotional grievance about AI taking over coding work.",
    "composite_score": 3.085164303411711
  },
  {
    "score": 35,
    "title": "Feeling lost in tech : should I switch careers because of AI ?",
    "selftext": "I'm 20 years old and currently studying Software Development. Right now, I work side projects as a frontend developer while also learning backend development.  \n\nLately, I’ve been feeling uncertain about my career path because of AI. It’s improving so rapidly that it can now create impressive user interfaces in seconds, which has left me feeling discouraged.  \n\nI have solid frontend skills, yet I still can’t land my first internship. It’s frustrating to see a new internship posting with over 100+ applicants within minutes. The competition is getting tougher, and I’m starting to question whether I should switch careers entirely.  \n\nDoes anyone have advice on what I should learn or do in this situation? I’d really appreciate any guidance.  ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 35,
    "downs": 0,
    "created_utc": 1744273592.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question seeking guidance on whether to switch careers due to AI; lacks actionable steps.",
    "composite_score": 3.157878125959109
  },
  {
    "score": 34,
    "title": "Do you think React will still dominate in 5 years, or will another framework take over?",
    "selftext": "React has been the go-to choice for front-end development for years, powering countless projects and companies. But with new frameworks and tools gaining popularity, some developers wonder if React’s dominance will last. Do you think React will still be the leading framework five years from now, or will something else take its place? I’d love to hear your thoughts on where the front-end ecosystem is headed.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1757403643.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Discussion prompt about future of React; seeks opinions rather than instructions.",
    "composite_score": 3.0846580313422196
  },
  {
    "score": 33,
    "title": "Just got my first job",
    "selftext": "Hey reddit ! \nI just got my first junior full stack position.\nI really don't know what to expect.\nThe first few months should be internship \nThe the company will decide if they want to keep me.\nThe stack used there is\nReact ,vue ,node,php and more ...\nI am really nervous like I don't know what to expect.\nThey gave me a pretty easy assessment at home.\nI did a full deployment of a news website with vue and node and SQL in vercel.\nAny tips ? How was your first junior position?\nWhat was like you first assignment at your job ?\nThanks !",
    "subreddit": "webdevelopment",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 33,
    "downs": 0,
    "created_utc": 1760597252.0,
    "media": null,
    "is_video": false,
    "num_comments": 11,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "First job experiences and asking for tips; not a how-to.",
    "composite_score": 2.8210695400660675
  },
  {
    "score": 34,
    "title": "Need to build a website for a school project",
    "selftext": "I’m in college and part of my entrepreneurship class requires me to build a website for a business idea. It’s supposed to be a “build-your-own” snack box subscription service.\n\nI’ve used Canva and Notion before but never anything web-related.\n\nI’m not trying to make it perfect, just functional like a few pages, maybe a fake checkout flow, and nice visuals.\n\nShould I use something like Wix or try a newer builder?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 34,
    "downs": 0,
    "created_utc": 1761089461.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Question about website builders; not a guide.",
    "composite_score": 3.0436020665254135
  },
  {
    "score": 31,
    "title": "How much would you charge to build this website?",
    "selftext": "This is a tutoring company site. What is a minimum price estimate for building something like this? It has:\n\n- functional cart and mini-ecom system\n- stripe integration and checkout\n- dynamic rendering of topic data\n- modern UI/UX design principles\n- simple animations (statistics, etc)\n- forms that submit and work\n- code, not WordPress/Wix, etc\n- loading/not-found pages\n- responsive design\n\nHave a look and please share any insight! ☺️\nhttps://edascend.com.au\n\nI built this site for a client, the largest tutoring company in Australia and Oceania, and trying to see how much other devs think it's worth.\n\nThanks! ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1764960832.0,
    "media": null,
    "is_video": false,
    "num_comments": 59,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for price estimates for a complex site; not a list, model, or step-by-step guide.",
    "composite_score": 3.0242256035117276
  },
  {
    "score": 32,
    "title": "Website developer contractors failing twice now to create my nonprofit website",
    "selftext": "Desperate for some advice here - I have spent the last two years working intimately with two web developer to build/revamp a website for a nonprofit. The first one I worked with I ended up coaching weekly to prompt progress on it, and eventually parted ways with her because I realized she did not have the capability to complete the website. We found a second company, and this company gave us an 8-week timeline for completion. 9 months later, we still don't even have a testing website available. What is going on? Is there some crazy hard issue making it impossible to update our website? We've lost thousands of dollars to both contractors and I'm at a total loss as to what to do. The current website is still functional but very old and in desperate need of updating. People get new websites ALL the time!! How is this so difficult? The website is complex, and needs a login portion with varying access determined by membership level, a page to store historic pdfs, and page and functionality to register and pay for admission to our events. Is this an impossible request? Is there any company who can actually do something like this?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 32,
    "downs": 0,
    "created_utc": 1744343390.0,
    "media": null,
    "is_video": false,
    "num_comments": 142,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Emotional frustration about unreliable developers and seeking advice.",
    "composite_score": 3.271181958610418
  },
  {
    "score": 31,
    "title": "Free, privacy-first file sharing webapp – no registration, no limits, no tracking (feedback wanted!)",
    "selftext": "Hey everyone!\n\nI’d like to share a project I’ve been working on: [https://notesqr.com](https://notesqr.com)\n\n# What is it?\n\nA free, privacy-focused web app for sharing files directly between users. No registration, no file size limits, no tracking, and no storage on third-party servers. Everything is end-to-end encrypted, and you can share via link or QR code.\n\n# Why did I build it?\n\nI wanted a super simple way to share files with friends, colleagues, or even myself, without worrying about privacy or jumping through hoops with big cloud providers. Most “free” file sharing tools either have limits, require sign-up, or store your files who-knows-where. I wanted something truly frictionless and private.\n\n# How does it work?\n\n* Drag and drop your files\n\n* Get a unique link or QR code\n\n* Share it with anyone\n\n* Files are transferred directly between users (peer-to-peer), not uploaded to a server\n\n* No logs, no cookies, no ads (just a “buy me a coffee” link if you want to support)\n\nTech stack:\n\n* Next.js, WebRTC, end-to-end encryption\n\n* No backend file storage, just a tiny signaling server\n\nWhy am I posting here?\n\n* I’d love feedback on the UX, performance, and security\n\n* Any ideas for features or improvements?\n\n* Curious how you’d use it.\n\n* Not looking to make money – it’s a personal, altruistic project, free for everyone (costs me less than a coffee per month to run)\n\nTry it out: [https://notesqr.com](https://notesqr.com)\n\nThanks for reading! Happy to answer any questions or hear your thoughts.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 31,
    "downs": 0,
    "created_utc": 1752735850.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.7,
    "category_rationale": "Describes a set of product features with a list of how it works.",
    "composite_score": 3.088087406156152
  },
  {
    "score": 30,
    "title": "Choosing My Developer Path: Is My Perception of \"Boring\" Back-End vs. \"Exciting\" Front-End Accurate?",
    "selftext": "I'm heading to college soon and trying to decide on a development specialization. Advice from friends and family has me leaning towards front-end.\n\nMy current impression of back-end development, perhaps unfairly, is that it might be a more isolating and less \"visible\" role. I picture deep dives into code and systems that, while crucial, might not always resonate with a non-technical audience, sometimes I've seen presentations that seem very technical and perhaps lose the crowd. The stereotype I've picked up is of someone working diligently but perhaps without much interaction or public-facing excitement.\n\nOn the other hand, front-end development appears more interactive and perhaps more immediately rewarding visually. The work seems to involve more direct user engagement, and tools like Alpha AI website builders seem to add another layer of dynamic creation. Presentations from front-end folks often seem more engaging to a broader audience.\n\nI recognize the critical importance of back-end software developers, they build the engines that power everything. Yet, it feels like their vital contributions can sometimes be less obvious to those outside of tech.\n\nI'm aware these views might be based on limited information or stereotypes. Could those of you in the field shed some light? Am I off base with these perceptions? What factors should I really be considering when weighing front-end against back-end development, especially given my current impressions?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1748333134.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Career-advising question about front-end vs back-end specialization.",
    "composite_score": 2.9645425407514088
  },
  {
    "score": 29,
    "title": "What API testing tools are you all using these days?",
    "selftext": "I’ve been working more with APIs in my projects and realized that testing/debugging endpoints is a huge part of the workflow. I know Postman is still the “default” choice, but I keep hearing about lighter or offline-friendly alternatives that might be better for different setups.\n\nSome tools I’ve seen mentioned are Bruno, Hoppscotch, Hurl, Yaak, and Apidog each has its own style (CLI vs GUI, browser vs desktop, open-source vs not).\n\nCurious what the webdev community here is actually using in day to day work. Do you stick with Postman, or have you switched to something else?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1757590390.0,
    "media": null,
    "is_video": false,
    "num_comments": 37,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for recommendations on API testing tools.",
    "composite_score": 2.9945130530280677
  },
  {
    "score": 29,
    "title": "How to Optimize Web Application with Cloudflare and Contabo as Backend",
    "selftext": "Hello all,\n\nI'm an enterprise developer, mainly backend, so I can grasp the answers and suggestions from you experts.\n\nTell me what you think - I'd like to create some kind of aggregator with not so many calls to the backend. Mostly users will be browsing data on static pages.\n\nI'd like to use Next.js ISR to generate static pages and host them on Cloudflare CDN or some other recommended service with caching. Then when users invoke some query, it will be sent to a backend server hosted on Contabo (cheap) that will hold a Go server and lightweight SQL server to serve the frontend.\n\nNow for questions:\n\n1. Do I need to create some kind of Node.js router app in Cloudflare that will get requests from the static frontend and route them to the backend? Is there any other method? Any other good Cloudflare service?\n2. Or should I also host the frontend Node.js server on Contabo hosting and have the static pages make requests directly to the Node backend?\n\nOr im thinking this setup wrong ? \n\nThanks ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 29,
    "downs": 0,
    "created_utc": 1755081557.0,
    "media": null,
    "is_video": false,
    "num_comments": 2,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks for architectural suggestions; seeks opinions on setup.",
    "composite_score": 2.3906818820794937
  },
  {
    "score": 30,
    "title": "Web Development with AI?",
    "selftext": "i have started learning HTML, CSS, JavaScript and PHP, now its been around 1 year since i am still learning, i know the basics of JS and PHP like how the loops, functions, DOM and other stuffs work.\n\nrecently i have started using agentic AI development, which is magically fast and productive, i have built websites like in few hours where if i had to do it traditionally it would take weeks and lots of energy and searching and debugging.\n\nwhat do you guys think is it wise to use agentic AI for development, will companies hire a person who is good at using agentic AI? because AI makes you lazy less productive and creative, it is because the code is being run and written by AI and you only have to watch and command it.\n\nthe other downside is that you dont have the full control over your codebase if it is large and complex.\n\nwhat level of agentic AI usage is recommended?\n\neach of these websites took me around few hours to complete using agentic AI.\n\nyour feedback's and comments are welcome.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 30,
    "downs": 0,
    "created_utc": 1752051532.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Discusses using agentic AI for development with pros/cons and seeks feedback.",
    "composite_score": 2.99024060967506
  },
  {
    "score": 28,
    "title": "Serious Question: Are modern Web developers Software Engineers?",
    "selftext": "I’m starting to realize that modern web development often requires full stack skills, and in many ways, it overlaps with traditional software engineering or am I wrong? It seems that Web developers today are expected to know how to build web applications such as write production code, design databases &amp; APIs, and handle system architecture. Like correct me if I’m wrong but aren’t those software engineers tasks? Like are modern web developers just SWE specialized in web development ? ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1766111941.0,
    "media": null,
    "is_video": false,
    "num_comments": 50,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Asks whether modern web developers are software engineers; asks for perspectives.",
    "composite_score": 2.953683085947924
  },
  {
    "score": 28,
    "title": "What did you learn from your first  website development project?",
    "selftext": "I’ll start first！\n\nWhen I first started developing websites, I focused too much on how it looked - the layout, images, colors - but didn’t pay enough attention to how everything worked behind the scenes. Later I realized things like:\n\n* Planning your content structure early makes everything smoother\n* Setting up responsive design from the start saves you tons of time later\n* Optimizing images and scripts really helps with page speed\n\nNow I always remind myself that good design = good experience, not just visuals.\n\nWhat about you guys? What’s one thing you wish you knew earlier when you started developing websites?",
    "subreddit": "webdevelopment",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1761274843.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.65,
    "category_rationale": "Shares several concrete lessons learned from first website project.",
    "composite_score": 2.9964988599324536
  },
  {
    "score": 27,
    "title": "How do i remember all the technologies",
    "selftext": "As a web dev, I'm constantly learning and getting in touch with mordern techs I've learned couple of frameworks,orms, libraries and so on.\n\nbut recently when i try to learn new technology and dive into it and dont use other techs for some time i forgot things and often during code i forgot stuff.and finding things form documentation is not a good experience.since most of the docs are not written well or unstructured and often times project uses some old version of libraries.\n\nand this is definitely impacting my progress.before i knew only handful of techs so it wasn't a problem but now when working on real projects it requires like at least 10 to 15 3rd party libraries to make it work properly.\n\nlike for example::\nIn my work i use anguler,nest js and most projects requires bunch of other techs like nx,zod,docker,jest,github actions,rxjs,prisma,this are like sort of main technology there are also a lot of small packages or some project based libraries.and not to mention not every project uses same core texhnology sometimes i need to use vue,nuxt,fastify,dizzle orm.this is out of control😭. \n\nHow do i remember the technology that i learn .how do you guys remember them any tricks??should i keep note of everything.or create a cheat sheet for every technology??\n\nOr is it that I've hit my limit for techs. ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1755152294.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for memory tricks to remember many technologies.",
    "composite_score": 2.814034831818634
  },
  {
    "score": 28,
    "title": "Are free website builders worth it for small businesses or do they hurt more than they help?",
    "selftext": "I’m trying to keep costs down while growing my small business, so naturally I checked out every free web builder I could find.\n\n  \nSome were okay, but most ended up super restrictive once I tried adding booking, payments, or anything beyond a basic page.\n\nFor anyone who has gone the free website route:\n\n  \nDid it actually help you get online fast, or did you eventually switch to something else?\n\n  \nCurious what pain points you hit and what you wish existed instead.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1765411608.0,
    "media": null,
    "is_video": false,
    "num_comments": 32,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "A discussion/question about experiences with free website builders; no list or steps.",
    "composite_score": 2.9266549678378997
  },
  {
    "score": 27,
    "title": "In need of a code buddy",
    "selftext": "Hello folks, I'm actually new on here and I've been learning to code html css and js for quite sometime now, I know I'm making progress but some days feels really hard to continue especially if I run into bugs, I really do need a person or a couple of persons to learn to build and learn more on frontend web dev at least before trying to move to the backend, I'm a newbie to this, so not looking really for an experienced person, but you're also wlcm to contribute. If interested just please reply to this post 🙏",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 27,
    "downs": 0,
    "created_utc": 1761164685.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Request for a learning buddy/community support; no list or steps.",
    "composite_score": 3.010706960310078
  },
  {
    "score": 28,
    "title": "How do you speed up web development? My progress feels painfully slow.",
    "selftext": "I'm spending 3-4 days building a single page, and dashboards or some animations take even longer.\n\nBackend setup with auth,CRUD and some basic feature takes 4-5 days.\n\nI've tried using component libraries but they're hard to customize and often don't work the way I need. I also tried copy-pasting from CodePen, but now I spend more time searching for components than actually coding.\n\nModifying someone else's code to match my UI takes just as long as building from scratch.\n\nAI tools haven't been much help either since I can't get the output I want. Often it just wastes time.\n\nAnd for backend it takes like way to much time to plan and structure things properly.\nlike how to design a table,or how to structure code base.\n\nI'm using Vue, Nuxt(occasionally), Nest, postgress, and Drizzle,\nand recently started using Linear for task management.\n\nHow do experienced devs finish projects quickly? What am I missing in my workflow?\n\nAlso one thing to mention I don't have much experience. Close to 1 year.\n\nAny tips to speed up my progress??",
    "subreddit": "webdevelopment",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1760816064.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for tips to speed up development but does not provide a concrete process; seeks guidance.",
    "composite_score": 2.8629129957309467
  },
  {
    "score": 25,
    "title": "Am I cooked if I don't use AI ?",
    "selftext": "I started learning code last year and at first chatgpt and copilot helped me out a lot. I've now stopped using any ai, mostly for environmental reasons but also because I've realized how much it was preventing me from learning. \n\nI fully think it's a good choice for now but I've met a lot of senior devs who told me about how they're much more productive with copilot.\n\nRight now I don't see myself ever getting back to using it, I want to stick to my values. Will that make me unhireable? I get that any recruiter would prefer someone who works fast. Apart from those churning out code they don't understand with chatgpt, I know there's a lot of good devs out there using it in an effective way.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.69,
    "subreddit_type": "public",
    "ups": 25,
    "downs": 0,
    "created_utc": 1744914724.0,
    "media": null,
    "is_video": false,
    "num_comments": 82,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.57,
    "category_rationale": "Personal reflection on AI usage and employability; no actionable steps.",
    "composite_score": 2.892012394158855
  },
  {
    "score": 28,
    "title": "I am going to learn full-stack web development in 3 months. (With little to no prior knowledge of web development)",
    "selftext": "I am here to commit in front of this community that \"I am going to learn full-stack web development in 3 months.\" This may trigger someone but try to understand me there is a reason for it,\n\n1.) I am from a lower middle class background in a third world county and don't have the financial power to continue coding forever\n\n2.) I have been a lazy bum for the last 2.5 years and I am about to graduate in 3-4 months (The degree is not related to coding) all I have done is learn html a month ago and stopped practicing again. (Hence the 3 months time)\n\nI don't know whether it is possible or not but I am going to try my best to make it possible.\n\nI will give updates on this sub everyday from today even if I did or did not code. (If it is within the rules of this sub please let me know)\n\nIf I succeed people will take this as an good example and know it is possible\n\nIf I fail people should take this example and learn from it and improve their own journey\n\nThat is all.\n\nEdit: 23-6-2025\n\nWell changed it up I am looking at game development now and learning about it no more web dev for me.",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 28,
    "downs": 0,
    "created_utc": 1733818024.0,
    "media": null,
    "is_video": false,
    "num_comments": 46,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.56,
    "category_rationale": "Public commitment with personal journey; not a list or method.",
    "composite_score": 2.9659469268668146
  },
  {
    "score": 14,
    "title": "I am stuck help me 😭",
    "selftext": "Hello everyone... I am new developer learning and building projects.. because it's fun ... But the project i am working right now is little difficult and i take this project seriously too ... \n\nSo i am making a dating site specially for disable person .. but the problem is i am stuck .. i build basic structure and thing .. but when it comes backend i completly stucked because i learn everything from youtube and chat gpt it's getting hard ... \n\nSo can anyone guide me or help me my project is on github too .. you can see that on my profile or previous posts ...\n\nHelp pls 😭... I really wanna complete this project ",
    "subreddit": "webdevelopment",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1754835650.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Request for help finishing a project; seeking guidance.",
    "composite_score": 2.5952159042546317
  }
]