[
  {
    "score": 269,
    "title": "HostGator Sells Fake “Dedicated Servers” (Actually Just VMs)",
    "selftext": "I purchased HostGator’s Value NVMe 32 “Dedicated Server” plan —\n\n8 CPU cores, 32 GB DDR5 RAM, 1 TB NVMe storage, 3 dedicated IPs —\n\nfor $194.47/month, fully expecting real bare metal hardware.\n\nBut the server turned out to be just a KVM virtual machine running on unifiedlayer / Oracle Cloud infrastructure.\n\nTask Manager even shows “Virtual machine: Yes” — and HostGator support admitted:\n\n**“Our dedicated servers are virtualized guests that are running under a Kernel Virtual Machine… This configuration causes the Task Manager to state that a virtual machine is enabled.”**\n\nThis is false advertising — selling VMs at dedicated prices.\n\nAvoid HostGator if you need real bare metal.\n\n  \n",
    "subreddit": "webhosting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 269,
    "downs": 0,
    "created_utc": 1757643552.0,
    "media": null,
    "is_video": false,
    "num_comments": 98,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.66,
    "category_rationale": "Personal grievance about false advertising and hosting provider misrepresentation.",
    "composite_score": 4.149181361457762
  },
  {
    "score": 175,
    "title": "WARNING TO GODADDY CUSTOMERS: Please read and Share with ANYONE using GoDaddy!",
    "selftext": "WARNING TO GODADDY CUSTOMERS:\n\nOn November 13, 2025, their agent \"Brian\" told me my domain was \"sold to a private buyer\" and offered to negotiate with the buyer for a $99 non-refundable fee.\n\nThe domain was NEVER sold. WHOIS proves it was registered until April 2026. Brian fabricated the entire story.\n\nAfter I refused to buy replacement domains, Brian added over $900 of products to my cart WITHOUT my consent. I have the automated cart email as proof.\n\nI filed a BBB complaint. Their \"Office of the CEO\" just responded with false dates and completely omitted:\n❌ The fake \"sold\" claim\n❌ The $99 broker scam attempt\n❌ The unauthorized cart additions\n\nTheir BBB response is now public record. They are on record lying.\n\nThis happened TWICE - August and November 2025. Last one required ICANN threats to resolve.\n\nI've filed with ICANN and BBB. FTC and SC Attorney General complaints going in today. Media has been contacted.\n\nI have call logs, their cart email, WHOIS records, and chat transcripts documenting everything.\n\nOther customers: CHECK YOUR WHOIS RECORDS. Don't trust what agents tell you about your domain status. Record your calls.\n\nI've transferred to Cloudflare. Never again, GoDaddy.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 175,
    "downs": 0,
    "created_utc": 1764885843.0,
    "media": null,
    "is_video": false,
    "num_comments": 139,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.62,
    "category_rationale": "Emotional warning about scam, venting about GoDaddy.",
    "composite_score": 3.9935766856532693
  },
  {
    "score": 143,
    "title": "My site on AWS/Amazon has been down all morning, this is an absolute nightmare",
    "selftext": "This is absolutely unreal. I've got customers blowing up my phone wondering why their site isn't working on a MONDAY MORNING.  My clients, who are almost all attorneys, are accusing me of running some fly-by-night operation out of my garage and calling me every name in the book.  Meanwhile I'm paying AWS almost a thousand dollars a month because everyone and their mother on reddit told me \"AWS is the gold standard. You HAVE to be on AWS if you're serious.\"\n\nThe AWS outage page is no help either, it's just a bunch of technical mumbojumbo with a big red warning triangle.   Is there somewhere I can get actual answers?  I can't find a way to contact Amazon, and I can't even get to my sites to move them somewhere else.   I feel like I'm drowning here. ",
    "subreddit": "webhosting",
    "upvote_ratio": 0.84,
    "subreddit_type": "public",
    "ups": 143,
    "downs": 0,
    "created_utc": 1760972415.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Frustrated customer with outage, emotional.",
    "composite_score": 3.783975529941497
  },
  {
    "score": 120,
    "title": "I bought more than 10 hosting companies, and here's what I learned:",
    "selftext": "In the last 3 years I (well, my company) bought more than 10 hosting companies, and here's what I learned:\n\n\\- The reason for the sale varies, but it's almost always a business that is no longer growing. Companies should be sold when they are growing, not when they are falling, because when they fall, they are worth less.\n\n\\- Almost no one keeps a P&amp;L or cash flow statement; they build it at the time of sale.\n\n\\- It is normal to lose 10% of customers in the transfer.\n\n\\- It is always better to use your own servers and technology that you feel comfortable with; using the infrastructure that the previous company had almost never works (there is a reason why you are buying and they are selling).\n\n\\- It is essential to sign a document with the terms and conditions of the transaction.\n\n\\- You need help during the customer transfer.\n\n\\- It's better to be transparent with customers and let them know that there will be a change in management. We give them additional free perks as a welcome gift and give them priority support for a while.\n\n\\- You almost always buy for 1X ARR.\n\n\\- Sometimes they want to give you their employees. If you already have your own, it is not necessary to acquire them, and if you do acquire them, it is key that they go through a technical, cultural, and psychological interview process, as with any new job.\n\n\\- Always verify all transactions, payments, and customers to ensure they are real.\n\n\\- Paying 100% in advance almost never works out; it is better to keep a percentage to be paid within 6 or 12 months when you see that everything has gone well.\n\n\\- Force the seller to be responsible for the sale (to avoid scams).\n\nThere is much more, but I'm sure this will be useful for your acquisition strategy.\n\nI wrote about this in my book but I don't want to spam so I will not mention it :)",
    "subreddit": "webhosting",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1757405546.0,
    "media": null,
    "is_video": false,
    "num_comments": 43,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.85,
    "category_rationale": "Enumerated learnings from buying hosting companies.",
    "composite_score": 3.5945117085595437
  },
  {
    "score": 120,
    "title": "WordPress founder calls WPEngine \"a cancer\"",
    "selftext": "Interesting blog post by the WordPress founder regarding WPEngine, where he describes them as \"a cancer to WordPress\"\n\n[https://wordpress.org/news/2024/09/wp-engine/](https://wordpress.org/news/2024/09/wp-engine/)\n\nIt looks like it basically comes down to the fact that WPEngine disable the \"revisions\" feature in their hosted WordPress instances to save on database storage costs.\n\nWPEngine's justification for this is that having revisions enabled can cause the database to grow exponentially and impact performance, and that by contacting support you can enable up to 3 revisions.\n\nIs this an overreaction from the WordPress founder, or is it justified?\n\nKeep in mind that Automaticc/Wordpress.com, the company which Matt is also the CEO of, requires you to [pay $25 before you can install a theme or plugin](https://wordpress.com/pricing/).\n\nHe also [mentioned this at WordCamp](https://www.youtube.com/watch?v=vEcz7DrjYvY&amp;t=26312s) and [encouraged people to migrate away](https://www.youtube.com/watch?v=vEcz7DrjYvY&amp;t=27864s).",
    "subreddit": "webhosting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 120,
    "downs": 0,
    "created_utc": 1727012020.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Discussion about WP Engine vs WordPress founder, evaluating if overreaction justified.",
    "composite_score": 3.7133753573083936
  },
  {
    "score": 111,
    "title": "WP Engine accuses WordPress founder/Automattic of extortion for $10M+",
    "selftext": "Another significant development in the WP Engine/Matt Mullenweg spat.\n\nWP Engine has [shared their side of the story](https://wpengine.com/wp-content/uploads/2024/09/Cease-and-Desist-Letter-to-Automattic-and-Request-to-Preserve-Documents-Sent.pdf) in the form of a cease and desist letter.\n\nIn summary, WP Engine claims Mullenweg and members of the Automattic board sent threatening messages to the WP Engine CEO, threatening to \"go nuclear\" on them if they refused to pay a percentage of revenue to Automattic amounting to tens of millions of dollars. These threats allegedly continued right up to the day before and on the day of Mullenweg's [livestreamed talk at WordCamp](https://www.youtube.com/watch?v=vEcz7DrjYvY&amp;t=26312s).\n\nIf true, this completely changes the tone of the dispute and creates a mafia-like two-tier licensing system, undermining the GPL and the founding principles of [WordPress.org](http://WordPress.org) which alienates many of its contributors and the wider community.\n\nIf this turns out to be true, do you think Mullenweg/Automattic are fit to continue in their current roles?",
    "subreddit": "webhosting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1727138797.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Discussion of extortion dispute between WP Engine and Automattic; asks opinion.",
    "composite_score": 3.6946248188105772
  },
  {
    "score": 111,
    "title": "⚠️WebHostFace.com Scammers Alert⚠️",
    "selftext": "I subscribed to a lifetime plan in 2019 and they kept asking me to shift my plan without offering a refund of what I paid and I refused.\r  \n\r  \nAfter they ran out of plans they shifted my website to the shittest server in the US so it takes a long time for my website to load as I live in the UAE and most of my visitors from the UAE.\r  \n\r  \nI opened a ticket and asked them why my website is in the US and not in Europe as it's slow and if they can shift it back. GUESS what they said ? YES cancel your lifetime plan and switch to the other plan so they can help.\r  \n\r  \nAvoid them at all costs. I am currently moving to another hosting company.\r  \n",
    "subreddit": "webhosting",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 111,
    "downs": 0,
    "created_utc": 1686994906.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Scammers alert and personal complaint about hosting company.",
    "composite_score": 3.3654293630812844
  },
  {
    "score": 98,
    "title": "Google domains closing, selling all assets and domains to Squarespace!",
    "selftext": "Google has killed yet another product. Google domains is now being sold off to Squarespace of all people, and Google is killing their entire domain and small hosting line that went along with it. This doesn't seem to impact Google Cloud, but just goes to show how Google can amass a reported 10 million domains, and drop that product like it wasn't making money. \r  \n\r  \nHow do ya'll feel about that, I know a ton of people jumped on the Google is great bandwagon early on but this hardly lasted two years?\r  \n\r  \nA cute blurb from Squarespace's page about this \"Squarespace will honor all existing Google Domains customers’ renewal prices for their domains for at least 12 months after closing the acquisition\" , I'd get ready for some price increases on those domain registrations.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 98,
    "downs": 0,
    "created_utc": 1686875803.0,
    "media": null,
    "is_video": false,
    "num_comments": 166,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "News update about Google Domains sale; prompts opinions.",
    "composite_score": 3.849493430171341
  },
  {
    "score": 91,
    "title": "Guy I paid to build my website died",
    "selftext": "Hey guys,\n\nI own a restaurant and I paid someone several years ago to build, manage, and host the website. I paid him upfront to build it as well as a small fee every year for the domain, hosting, etc.. We spoke every now and again about small things (updates to the menu etc...) but not much. At the beginning of this year the website stopped working and we started emailing back and forth, one day he stopped replying and after doing a few google searches today I discovered that he passed away. Not sure what to do in terms of getting the domain back.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 91,
    "downs": 0,
    "created_utc": 1718754834.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Personal story about contractor died; seeking guidance.",
    "composite_score": 3.457027285866683
  },
  {
    "score": 77,
    "title": "Someone Bought Domain Name Same Day I filed To Incorporate My LLC",
    "selftext": "Hey guys,\n\nA bit confused about something that happened today...\n\nI paid LegalZoom to incorporate an LLC for me today. I then went to buy the corresponding domain name and saw that someone (who happens to be from a city right by where I live) bought the domain name that directly corresponds to my business name today as well.\n\nWhat could've happened? I'm a bit confused and freaked out at the same time...don't know how they would've known about this when I would assume LegalZoom hasn't filed it yet.\n\nEdit: Apparently the domain was bought by a company called \"Domain by Proxy\"",
    "subreddit": "webhosting",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 77,
    "downs": 0,
    "created_utc": 1706327415.0,
    "media": null,
    "is_video": false,
    "num_comments": 95,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "Domain purchase timing and Domain by Proxy explained or speculated.",
    "composite_score": 3.5507302192102643
  },
  {
    "score": 67,
    "title": "Looking for someone to take over my company",
    "selftext": "Hi all,\n\nI wanted to put this out there to gauge interest.\n\nI run a hosting company that’s been operating for just over 4 years and has grown significantly. However, I’m now feeling burnt out and would like to see the business continue to grow under new leadership.\n\nI’m not looking for a straight sale, but rather a handover / takeover to either:\n\n\t•\tan individual looking to enter (or re-enter) the hosting market, or\n\n\t•\tan existing company looking to expand their footprint.\n\nFor transparency:\n\n\t•\tThe business currently operates at a \\~25% loss, mainly due to underutilised infrastructure\n\n\t•\tThere is significant room for growth thanks to large amounts of unused node capacity\n\n\t•\tLocations currently include: London, Netherlands, California, Utah, Canada, and Poland\n\n\t•\tWe lease our IPs and have hundreds of spare IPv4 addresses available\n\n\t•\tThe company has 1,600+ clients, with 1,006 opted into our marketing list\n\n\t•\tChargeback rates are low (under 1%)\n\nI’m happy to provide up to 3 months of support post-handover to help ensure a smooth transition.\n\nIf this sounds of interest, feel free to reach out privately for further discussion.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1766102348.0,
    "media": null,
    "is_video": false,
    "num_comments": 76,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.62,
    "category_rationale": "Announcement seeking takeover of a hosting business with details; no steps or model.",
    "composite_score": 3.4582542752924774
  },
  {
    "score": 68,
    "title": "What is the best webhosting in 2025?  (Community Guide)",
    "selftext": "There is a tremendous amount of noise amongst reviews and guides when looking for hosting, and it is THE most common question we get here. To cut through the noise, and make things simpler, the r/webhosting mod team **curated** providers we’ve personally used and would confidently use again. This guide covers hosting options that will meet 99% of practical, real-world needs, from small static sites to high-traffic WooCommerce stores. Our picks reflect years of hands-on experience and focus on what actually matters: **performance, helpful support, sane pricing and renewals, reliable backups, platform security, and easy migrations.**\n\n**How we selected providers:**\n\n* **Transparent Pricing:** No hidden fees, clear renewal rates.\n* **Infrastructure:** Modern hardware, sensible replacement cycles, honest resource allocation.\n* **Support Quality:** In-house support, fast average response times, strong technical expertise level, availability of human support.\n* **Platform Openness:** Standard control panels (cPanel, Plesk, etc.), SSH availability, easy in/out migration, no lock-ins\n* **Company Stability:** Long track record in the industry, financial security, proven staying power - we want to recommend hosts that will be around for years to come, not fly-by-night operations\n\n**Real world testing and experience:**\n\nMods have hosted busy sites (typically WordPress) on each of these hosts. We also occasionally secret-shop support with simulated common issues to confirm response times and competence.  These providers also have a representative in the subreddit to help offer guidance when needed.\n\n**Important:** Recommended hosts can help you migrate from a current provider if you're looking for an alternative to your existing host. Most offer free migration services and are excellent alternatives to the high priced and underperforming mega-brands like HostGator, SiteGround, BlueHost, and other brands.\n\n^((As with anything, this list is not set in stone. Companies can be added or removed based on ongoing performance or changes.) [^(Use the message the mods feature if you have suggestions or questions.)](https://www.reddit.com/message/compose?to=r/webhosting))\n\n# RECOMMENDED USA HOSTING COMPANIES:\n\n[**NixiHost**](https://www.nixihost.com/hosting/reddit) \\- Founded by former HostGator staff. 15+ years of independent operations. All-USA based support staff and Texas based servers.  Transparent pricing with cPanel, CloudLinux, LiteSpeed, Imunify360, and JetBackup are included on all plans.\n\n[**KnownHost**](https://www.knownpromo.com/go/reddit) \\- Independently owned since 2006 with true in-house 24/7 support that treats you like a human, not a ticket. Servers are kept low-density with a premium stack standard (LiteSpeed, Redis, Imunify360).\n\n[**Liquid Web**](https://www.liquidweb.com/wordpress-hosting/managed-wordpress/?utm_source=reddit&amp;utm_medium=community) \\- Long-running managed host with a WordPress-first mindset, think hands-on updates, caching, and migrations that don’t nuke your weekend. Native WP plugins like iThemes Security, The Events Calendar, and LearnDash.\n\n# RECOMMENDED UK &amp; EU HOSTING COMPANIES:\n\n[**Zume**](https://zume.net/) \\- All-inclusive pricing with no hikes or surprises, modern hardware with high-frequency CPUs, straightforward on-shore support without AI and chatbots\n\n[**Krystal**](https://krystal.io/partner/reddit-web-hosting) \\- UK’s largest independent host. Real UK-based support and a performance-tuned stack (LiteSpeed + LSCache). 100% renewable-powered; they even plant a tree for every customer.\n\nWith 8+ million visitors annually, r/webhosting is the largest webhosting discussion forum on the internet. Every month, we see numerous success stories from users who found their ideal hosting solution through this guide and subreddit, reinforcing that these aren't just theoretical picks but proven choices backed by real community experiences.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1762565025.0,
    "media": null,
    "is_video": false,
    "num_comments": 52,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.82,
    "category_rationale": "Primarily a curated list of hosting providers with criteria; functions as a listicle.",
    "composite_score": 3.34598702553765
  },
  {
    "score": 67,
    "title": "Majority Share of Namecheap to be sold to CVC Capital.",
    "selftext": "In some news that might ruin some peoples Fridays in the US or your weekend elsewhere the [Wall Street Journal](https://www.wsj.com/business/deals/cvc-strikes-1-5-billion-deal-for-godaddy-rival-namecheap-a38fd014) is reporting that majority steak in Namecheap will be sold two CVC Capital.\n\nThis is the same venture firm that owns Webpros the company that owns cPanel and Plesk.\n\nEdit: [archive.is](http://archive.is), no paywall version of the article is [here](https://archive.is/i9vOk).\n\nEdit 2: I thought this information was a little bit more common knowledge but apparently not so just a heads up Spaceship is owned by Namecheap and was part of the sale too.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1757704221.0,
    "media": null,
    "is_video": false,
    "num_comments": 27,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "News item about Namecheap sale; informational without steps or a model.",
    "composite_score": 3.283587928377346
  },
  {
    "score": 67,
    "title": "PSA: Vultr's new TOS gives them full rights to resell your website/app/database contents/etc",
    "selftext": "When I tried to sign in to my account today, it was demanded that I accept a new agreement.  \n\nUnfortunately, the new agreement is requiring us to fork over rights to our apps/software for anything on the Vultr platform.  That goes way too far.  No other datacenter company requires this. \n\nVultr TOS Excerpt:\n\n&gt; information, text, opinions, messages, comments, audio visual works, motion pictures, photographs, animation, videos, graphics, sounds, music, software, Apps, and any other content or material that You or your end users submit, upload, post, host, store, or otherwise make available (“Make Available”) on or through the **Services** (collectively, “Your Content,” “Content” or “User Content”).\n\n&gt; ...\n\n&gt; You hereby grant to Vultr a non-exclusive, perpetual, irrevocable, royalty-free, fully paid-up, worldwide license (including the right to sublicense through multiple tiers) to use, reproduce, process, adapt, publicly perform, publicly display, modify, prepare derivative works, publish, transmit and distribute each of your User Content, or any portion thereof, in any form, medium or distribution method now known or hereafter existing, known or developed, and otherwise use and **commercialize the User Content in any way that Vultr deems appropriate, without any further consent, notice and/or compensation to you** or to any third parties, for purposes of providing the Services to you.\n\nThis is NOT standard contract language for web services.  For comparison, Digital Ocean specifically limits this clause to uploads on their website (ie, for community articles, forum posts, etc), not for all hosted services (which would include virtual machines, databases, etc).  Additionally, commercialization rights are not granted and it is not perpetual:\n\nDigital Ocean TOS Excerpt:\n\n&gt; We will periodically differentiate between our websites such as digitalocean.com (which we will refer to collectively as the “Websites”) and all of our other services, such as our cloud infrastructure and other paid services (which we will refer to collectively as the “Services”).\n\n&gt; ...\n\n&gt; By providing your User Content to or via the **Websites**, you grant DigitalOcean a worldwide, non-exclusive, royalty-free, fully paid right and license (with the right to sublicense) to host, store, transfer, display, perform, reproduce, modify for the purpose of formatting for display, and distribute your User Content, in whole or in part, in any media formats and through any media channels.\n\nThough requesting limited permissions for the purposes of user uploads on a forum or other community site is fairly standard, it is not reasonable for a service provider partner to require full, irrevocable commercial rights of anything hosted on their services.  That'd let Vultr take and monetize customer databases, apps, software, etc. which almost every business would likely find objectionable.  Vultr needs to restrict their request as is done elsewhere in the industry.\n\nI mailed Vultr about it, but I'm most likely indefinitely locked out of my account until I fork over rights to my business to them.  Not that I think they particularly care to resell my apps/sites/end user data (egad, what are even the end user PII ramifications of that), but it's the principle of the matter.  I've generally otherwise been a happy customer, spending a couple thousand a year with them and recommending them to others -- but I think it's healthy to push back on overly broad contracts and let big companies know when they overstep.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 67,
    "downs": 0,
    "created_utc": 1711166158.0,
    "media": null,
    "is_video": false,
    "num_comments": 20,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Offers analysis of TOS concerns and comparisons, presenting an underlying risk assessment.",
    "composite_score": 3.221118560073196
  },
  {
    "score": 68,
    "title": "Just learned the hard way NOT to use Hostgator",
    "selftext": "Don't use HostGator! They are a terrible company. This weekend our website went down for over 48 hours.\n\nTheir \"24/7 support\" lied and said things like our ticket was \"escalated\" and \"moved to top of the list\" and the issue would \"be resolved by end of day.\" We later found out our ticket wasn't escalated by another representative who gave us the exact date and time of when it was escalated... roughly 36 hours into the ordeal.\n\nIt took us nearly 5 hours to download our website files, but only 20 minutes to upload them at another hosting platform.Hostgator uses cheap support, and no one actually cares if your website goes down. Just needed a place to vent about this.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 68,
    "downs": 0,
    "created_utc": 1682347060.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.84,
    "category_rationale": "Emotional vent about HostGator with clear frustration and judgment.",
    "composite_score": 3.421786518573501
  },
  {
    "score": 65,
    "title": "Please don't host on GoDaddy",
    "selftext": "I often manage DNS for websites via Cloudflare. I ran across a very confusing issue with a website hosted on GoDaddy. So I reached out to support. \n\nI don't know why I bothered. Not once have I messaged support and received any useful help from GoDaddy. Not only are they useless but they offer conflicting information. \n\nIn this case, the support person that I messaged with was extremely confused to find the nameservers pointing to Cloudflare  instead of GoDaddy because, and I quote, \"Your site is hosted on GoDaddy\". We were never able to get past that issue. I gave up.   \n\n\nNext up: The client needed to purchase an SSL certificate. His assistant was told that \"Your website is not hosted on GoDaddy, it's hosted on Cloudflare\".  It's not.   \n\n\nDon't host on GoDaddy. ",
    "subreddit": "webhosting",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 65,
    "downs": 0,
    "created_utc": 1690940031.0,
    "media": null,
    "is_video": false,
    "num_comments": 69,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Frustrated critique of GoDaddy based on poor support and confusing information.",
    "composite_score": 3.432092955548997
  },
  {
    "score": 58,
    "title": "I finally got DDoS'd",
    "selftext": "Well, after over 25 years of operating websites, I finally got DDoS'd.  Not on an employer's site.  On my personal blog that I post to about three times a year.  All of a sudden I went from 100 page views an hour to 20,000+.  It's been going on for weeks and almost all traffic is from China.  The entire blog is 2.1MB and they downloaded it enough times to use 20+GB of bandwidth before I stopped it.\n\nWhatever the bot is uses Chrome as its user-agent, loads my home page, and all included files (javascript, css, etc).  It also tries to load URLs that are invalid, but look like they could be valid based on my naming scheme - as if they were hallucinated by a poorly-coded AI.\n\nEdit: I just realized the weird URLs are because the bot doesn't respect the base href tag. I will remove that and make all the links absolute. \n\nEdit again: Fixing the URL scheme has reduced the number of hits per hour to between 5,000 and 10,000.\n\nThird edit: Using geographic DNS rules has brought the attack traffic down to &lt;500 hits per hour.\n\nThe stuff I post is about as benign as it gets.  No politics, ethics, social issues, or anything even remotely controversial.  The site is entirely static and the server doesn't even have the capability to run scripts.  If I've pissed someone off, I have no clue whom or why.  Any guesses what the angle is?\n\nI use a CDN so the site is still happily running.  ",
    "subreddit": "webhosting",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1764791041.0,
    "media": null,
    "is_video": false,
    "num_comments": 54,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Narrative of a DDoS incident with practical mitigation tips, offering lessons learned.",
    "composite_score": 3.3085333563892663
  },
  {
    "score": 60,
    "title": "Do not use HostKoala. Suspended for leaving a review and then refusing to let me migrate data",
    "selftext": "They suspended my account for leaving a reddit review about some issues I have been having with their hosting lately. Been a customer for 2 years, they suspended my account without warning and are refusing to let me migrate all my domains and data to a new host. 2 Years worth of blog posts / data IS GONE. I beg of you, if you are using HostKoala make sure you backup your data outside of their server. \n\nDO NOT USE HOSTKOALA",
    "subreddit": "webhosting",
    "upvote_ratio": 0.81,
    "subreddit_type": "public",
    "ups": 60,
    "downs": 0,
    "created_utc": 1703985926.0,
    "media": null,
    "is_video": false,
    "num_comments": 75,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Strong customer complaint about HostKoala and data migration denial.",
    "composite_score": 3.3332366311511628
  },
  {
    "score": 59,
    "title": "WTF happened to HostGator?",
    "selftext": "I've been a customer for about 15 years, they suddenly increased the price by 200% without any warning, I got it in writing that they are sorry for not letting me know. I've tried calling them and I keep getting through to India and eventually the guy agreed he cannot help me so I escalated it and then I got this email..\n\n&amp;#x200B;\n\n&gt;From the records, I see that your HostGator account is not activated since it follows a fraud trends. Also, there was no services purchased in that account. So, it is advisable to purchase new HostGator account.\n\n&amp;#x200B;\n\nI don't even know what to say. My account is live with multiple domains and none are \"a fraud trends\". It's fucking lunacy and I can't even get someone to talk to with any authority. I'm currently downloading everything and going to charge back the last three months of double payments. I only noticed because I checked by bank account and saw this crazy $40 payment. Shower of fucking cunts.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1701009362.0,
    "media": null,
    "is_video": false,
    "num_comments": 85,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.74,
    "category_rationale": "Vent about a HostGator price increase with emotional response.",
    "composite_score": 3.4804004760054275
  },
  {
    "score": 59,
    "title": "What is the cost of having someone manage websites and email, and what is that called?",
    "selftext": "I have been managing my own websites for 30 years and I’m comfortable with all the basics required. Started out in HTML coding then moved onto the Dreamweaver system, developing my knowledge is that developed. CSS, PHP etc..\n\nI have about three or four websites related to our businesses, and these are hosted by hostmonster, now blue host. I also have another website which is dormant and I think I set that up on some other hosting platform based out of Eastern Europe to see how that worked, but I haven’t looked at that for a while. Email as manager through C panel for all the domains.\n\nI am dying of terminal cancer, and my wife and older children. Don’t have the ability to learn or take this on, and it would take too much precious time to teach them.\n\nSo I’m looking for an individual service that would manage this stuff. I just don’t know what it’s called or what the cost might be.\n\nAny and all advice appreciated. \n\n",
    "subreddit": "webhosting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 59,
    "downs": 0,
    "created_utc": 1759704213.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Simple question about service name and cost for website/email management.",
    "composite_score": 3.2851852725587816
  },
  {
    "score": 58,
    "title": "FYI: Godaddy took my domain after I had already paid for it",
    "selftext": "We've all heard stories of going on godaddy to search for a domain, and then if you wait to buy it godaddy has already bought it and is now selling it as an expensive premium domain.\n\nA few months ago I found a great domain name, (*countryname*travelblog.com), added it to my cart, paid for it, and received the confirmation email. But it never showed up in my list of domains. Then I got an email with a credit for the amount I paid saying the domain was not available and it is now listed as a premium domain.\n\nI checked with support and they claimed someone else bought it a split second before I did, not godaddy but \"someone\", and of course they could not tell me who it is due to \"privacy\".\n\nI knew this was BS but there was not a thing I could do.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 58,
    "downs": 0,
    "created_utc": 1695046656.0,
    "media": null,
    "is_video": false,
    "num_comments": 51,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Personal emotional grievance about a registrar's service and getting domain stolen.",
    "composite_score": 3.281353683459544
  },
  {
    "score": 54,
    "title": "What's the difference between shared hosting and VPS",
    "selftext": "We've noticed a lot of questions lately about shared hosting versus virtual private server hosting (VPS). Here’s a quick primer to help you figure out which option is right for your website.\n\nBasics of shared hosting\n\n* Your website shares a server with many others\n* Server resources (CPU, RAM, storage) are divided among all hosted sites\n* Cost-effective, but performance can be affected by other sites\n* Limited control over server configuration\n* Managed through control panels like cPanel for basic tasks\n* No root access - can't install custom software or make deep system changes\n\nBasics of VPS\n\n* Virtually partitioned environment on a shared physical server\n* Dedicated resources - your own CPU, RAM, and storage\n* More reliable performance - other sites can't slow you down\n* Root access for installing custom software and configurations\n* Generally faster load times and better uptime\n* More scalable - easily increase resources as your site grows\n\nRemember, a VPS splits your site from others virtually. It doesn’t mean you have a dedicated server. **VPS =/= dedicated server**\n\nWhy does this matter for your site?\n\nLooking at performance, shared hosting slows down during traffic spikes on other sites, while VPS typically offers dedicated resources for consistent performance. VPS usually gives you the control to customize your environment, shared hosting doesn’t. \n\nFrom a security perspective, your site is at greater risk if another site on the shared server is compromised. The VPS *should* provide better isolation to protect you from vulnerabilities on other sites. \n\nUltimately, it comes down to what you want from your site. If you’re just getting started WordPress blog or small business site, shared should be fine. The latter is almost always a better option if you expect a higher volume than that.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 54,
    "downs": 0,
    "created_utc": 1724952740.0,
    "media": null,
    "is_video": false,
    "num_comments": 31,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Educational explanation of hosting types with supporting details.",
    "composite_score": 3.152937678654197
  },
  {
    "score": 51,
    "title": "How long can Nissan (not the car company) hold the .com domain and maintain his website after having passed away?",
    "selftext": "So, it seems that the original domain holder passed away in 2020, and the website is currently a memorial to him. He has been fighting copyright claims and has refused to sell that domain his whole life, and he still holds it beyond the grave. Huge respect for him.\n\nHe must have a really good web host that is honoring his contract. Is it possible for the original domain holder to have bought a 100+ year prepaid web hosting service that can host a static website forever without breaking?\n\nI'm no expert in domains, but it looks like the domain will expire in four years, so what will happen then? Will it auto-renew, or are some family members in charge and able to renew it, or will Nissan, the car company, have the right to bid for the domain? Will GoDaddy somehow acquire the domain before anyone else and engage in a copyright battle with Nissan?\n\nAnyway I'm impressed and respect the guy for trying to immortalize his website.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 51,
    "downs": 0,
    "created_utc": 1747125079.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Explains domain rights and scenarios after death with questions.",
    "composite_score": 3.163037365809937
  },
  {
    "score": 48,
    "title": "Is anyone still offering affordable cPanel hosting these days?",
    "selftext": "Hey everyone,\n\nI’ve noticed that the cost of cPanel hosting has really gone up over the past year. probably due to the license price hikes. I still really like cPanel as a panel. it’s user-friendly and works well for both beginners and clients who don’t want to mess around with configs.\n\nBut most providers I’ve checked recently have either removed cPanel or added extra charges that push even basic plans above budget.\n\nDoes anyone know of hosting providers that still offer cPanel at a reasonable price, either with shared or managed VPS plans? Not necessarily the cheapest, but something that doesn’t break the bank for small projects.\n\nAlso open to hearing if anyone switched to other panels (like DirectAdmin, CyberPanel, etc.) and how that’s been going for you.\n\nThanks in advance!\n",
    "subreddit": "webhosting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1745399377.0,
    "media": null,
    "is_video": false,
    "num_comments": 79,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Asks for affordable cPanel hosting options; lacks a structured list or guide.",
    "composite_score": 3.3467410735244854
  },
  {
    "score": 49,
    "title": "Why I think GoDaddy is the worst domain provider",
    "selftext": "This is a personal review from me after being their customer for 4 years.  \nFirst, who doesn't know this—overly expensive GoDaddy. Anything they sell is expensive (domains, hosting, SSL.).  \nSecondly, today I had trouble with my website and tried to change to nameservers. I have full domain protection on for my domain (which, by the way, cost 11.99$). It has given me very, very limited features, only the basic ones like 2FA before making major changes and protection in the case of the domain renewal failure. But the problem is that when you change nameservers and DNS records, GoDaddy is supposed to send you an OTP for one time, like I made the first change, and I got an OTP (after waiting 6 minutes) on my email address. When I tried to do other changes, I got asked for an OTP and got a new one again on my email (after 5 mins). I lost my traffic due to their slow mailing system; each email took from 5 to 10 minutes! and note that this service cost 11.99$ !!! wtf  \nThirdly, I would say their support system is completely useless, and the site is full of many bugs. For example, recently I had this issue where they notified that an OTP had been sent to my phone number when they had not. Because of this, I was denied access to my account to update my banc cart info prior to my domain renewal. Support and verification of identity took 7 days; if I didn't have the 11.99$ protection service, I would have lost my domain because that's how long they took. Their OTP system on both SMS and email is super slow.  \nThis is my review on Godaddy, and what I would really not recommend to anyone is the Godaddy.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 49,
    "downs": 0,
    "created_utc": 1714252422.0,
    "media": null,
    "is_video": false,
    "num_comments": 34,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Emotional critique of GoDaddy with specific complaints.",
    "composite_score": 3.1760040265111567
  },
  {
    "score": 48,
    "title": "Wix is the worst company I have ever dealt with.",
    "selftext": "I am a small tutor and my customers are in kuwait. I target them with content / ads and the website on wix is my landing page. I visited Kuwait and turns out after months of using wix, it's been blocked by the ministry and all ISPs in Kuwait, when i show them the block page, they show me their list and say OH KUWAIT IS ON THE LIST SO... IT WORKS, YOU ARE A LIAR(They didn't say that but that's what they implied). I asked for at least a month's refund , even though , I have lost probably 1000s of dollars from this. They agreed, I few days later, I try to go through with the refund with another customer service rep, she says, you are not eligible EVEN THO YESTERDAY I CONFIRMED WITH ANOTHER CUSTOMER SERVICE REP THAT I AM ELIGIBLE. Honestly, what a trash company... I switched to Framer.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 48,
    "downs": 0,
    "created_utc": 1744130901.0,
    "media": null,
    "is_video": false,
    "num_comments": 19,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Expresses strong negative view of Wix with personal grievance.",
    "composite_score": 3.0757110778605043
  },
  {
    "score": 47,
    "title": "Can I make a website on Wordpress without having hosting or a domain yet, I will have it in a week just wanted to get a head start and then transfer?",
    "selftext": "I have a friend who is helping me do the technical parts of my website next week, he is providing me with hosting as he runs a business doing that and will help me run through getting a domain. Only problem is it's not for a week and I wanted to know if I would be able to use Wordpress to make my website now and then transfer it over when I get to that. Is this something that I can do or is it not worth the time/impossible. Cheers in advance.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 47,
    "downs": 0,
    "created_utc": 1755781962.0,
    "media": null,
    "is_video": false,
    "num_comments": 29,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Asks a question about using WordPress pre-host/domain; lacks steps.",
    "composite_score": 3.1398018647354187
  },
  {
    "score": 44,
    "title": "Goodbye Liquid Web Support",
    "selftext": "My long-time server provider Liquid Web has rug-pulled their phone support without notice. I wondered why until I bullied my way past sales. Pretty sure the old folks were shit-canned. Guy I talked to was clueless and \"new\" to Liquid Web. He was obviously not a member of the team that I've been talking to and relying on for many years.\n\nIt truly impresses me that someone was able to take some of the best tech support I've known and turn it into some of the worst in about 48 hours.  It doesn't bode well for the future of my favorite server provider.\n\nTo the amazing and fabulous former Dedicated Server Support Team at Liquid Web, I would like to say **Thank You** for your years of fabulous and professional support.  You will be truly missed!  Your talent and dependability were the driver of my loyalty to the Liquid Web brand.  Now that you are gone, there's little reason for me to stay.  I can get hosting with mediocre support anywhere for a lot less than I have been paying Liquid Web.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 44,
    "downs": 0,
    "created_utc": 1744994639.0,
    "media": null,
    "is_video": false,
    "num_comments": 74,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.75,
    "category_rationale": "Vent about Liquid Web support with emotional tone.",
    "composite_score": 3.3107431454711937
  },
  {
    "score": 45,
    "title": "LiquidWeb.  This is our 20th year with them, and now we have to say goodbye",
    "selftext": "2026 will be the **20th year** that my company has had a dedicated server with LW.  20 years.  Up until about 5 or so years ago, the support was incredible.  Right now, I don't even recognize the LW that I used to feel so grateful for being with such an upstanding company.\n\nI remember always feeling so lucky that we were in their care.  Right now, it's about upselling, slower and slower support response, and even some bizarre things I heard on the phone from a support staffer that was obviously working from home.  I won't even get into what I heard on that call.\n\nI still feel sad that we have to leave LW. They used to be so great, and I keep hoping - even years later - that things will reverse course and that incredible company that we decided to trust our dedicated server with back in 2006 will come back to us.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 45,
    "downs": 0,
    "created_utc": 1767188699.0,
    "media": null,
    "is_video": false,
    "num_comments": 40,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Nostalgic lament about vendor; emotional.",
    "composite_score": 3.166649760041442
  },
  {
    "score": 40,
    "title": "Hosting.com ruins another good small local hosting service. Classic!",
    "selftext": "Okay, we've all seen it. Hosting.com is out here buying up hosting companies left, right, and center. Their latest acquistion, a small, well-rated local hosting company in Kenya, called Kenya Web Experts. We adored this company for it's customer service, simple pricing structure, and while very old, a very nice and simple client area.\n\nSo, Hosting.com, World Host Group or whatever, steps in, purchases Kenya Web Experts. First thing they do? They take down the entire KWE client area, and doesn’t even bother migrating the client data properly.\n\nSuddenly,nno one can access and domains or hosting services purchased through KWE. I personally have over 30 domains bought through KWE — and I can’t access a single one. The new Hosting.com portal shows nothing. And the invoices we get via email? Just numbers. No breakdown, no domain names, no explanation of what we're being charged for. All over sudden, thousands of clients are completely in the dark.\n\nAnd when you try to contact Hosting.com support? Oh, they just keep sending the same copy-paste line “We can’t give an ETA at the moment” like it’s a script. Over and over again. No solutions. No updates. No accountability.\n\nMeanwhile, Hosting.com is out here publishing videos of their KWE purchase and preaching about how customer experience is their whole mission. The irony could not be louder. If this is what \"improving service\" looks like, then I'd honestly prefer the old KWE — local, simple, and actually functional.\n\nHonestly, this whole thing feels like a massive slap in the face to long-time KWE customers.\n\n  \nPS: I was also a customer of A2 Hosting… don’t even get me started on what Hosting.com did after acquiring them.\n\n\\*\\* End of Rant \\*\\*",
    "subreddit": "webhosting",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1751334330.0,
    "media": null,
    "is_video": false,
    "num_comments": 49,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.84,
    "category_rationale": "Angry critique of Hosting.com acquisition and customer impact.",
    "composite_score": 3.189768858887745
  },
  {
    "score": 42,
    "title": "F**K Bluehost, so much",
    "selftext": "(Applies to shared + VPS hosting)\n\n1) It's such a scam - they start increasing the prices, there is no way to cancel or manage your subscription unless you contact support\n\n2) It seems to be infecting other sites like hostmonster too which used to be good and are adopting their same template.\n\n3) There are daily auto-backups on that fill up the disk space, and you can't turn them off. So every day my site crashes. All backups are disabled everywhere, but they still happen anyway and there's nothing I can do.\n\n4) When you try to ask support, they don't believe you and then disconnect the chat on you on purpose so they don't have to deal with you anymore.\n\nSo yeah, I'm going to try IWebFusion next, but it's a big pain to transfer everything.\n\n\nBe warned, do not ever use bluehost!!! Even if you \"just have a simple wordpress site\", or for any reason, it's the worst one i've ever had.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 42,
    "downs": 0,
    "created_utc": 1715644063.0,
    "media": null,
    "is_video": false,
    "num_comments": 30,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.92,
    "category_rationale": "Explicit emotional venting about Bluehost with multiple specific grievances.",
    "composite_score": 3.084149302496723
  },
  {
    "score": 40,
    "title": "WARNING about Bluehost / Network Solutions",
    "selftext": "Never use these companies. Today I searched a domain name on who is. The name was available. Tried to buy it through Bluehost. They said it was already owned. Looked again on who is, it shows that Bluehost bought it TODAY. So Bluehost lied that it was unavailable and instead bought it there self. This is highly unethical. Network Solutions, their sister company, did the same with another name, then \"sold\" me the name. then refused to release it and told me I had to place a bid on a name I had already paid them for. Holy crap these companies are disgusting.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1744477083.0,
    "media": null,
    "is_video": false,
    "num_comments": 36,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.86,
    "category_rationale": "Emotional critique of Bluehost and Network Solutions with strong moral judgments.",
    "composite_score": 3.131884718753233
  },
  {
    "score": 40,
    "title": "Bought a website from GoDaddy today, instantly regretted my decision, need a new provider",
    "selftext": "I messed up big time.  I saw a website that belonged to a defunct US airline available for purchase on GoDaddy, and I bought it.  Now I’m regretting my decision, as I don’t have an SSL certificate, and I can’t access my own website from any browser, despite what GoDaddy customer service is saying.\n\nI want to transfer my domain somewhere, but Google says my domain has to be 60 days old.  Namesilo seems decent (and I think they’ll allow me to transfer despite my site being under 60 days), but they don’t have a free SSL.  Let’s Encrypt has a free SSL, as well as Bluehost, but they don’t offer hosting, and I’m unsure if Namesilo would let me use my own SSL certificate.\n\nGoDaddy customer service was excruciating and useless.  I could really use some advice.\n\nThank you in advance!\n\nEdit:  I also paid for the email suite with GoDaddy.  Will that go away if I transfer?  If so, is there any way I can use my own SSL with GoDaddy?  I think that’s the only way I can view my website on any browser.  My website won’t show up on safari, chrome, edge, Firefox, any browser.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 40,
    "downs": 0,
    "created_utc": 1680081284.0,
    "media": null,
    "is_video": false,
    "num_comments": 56,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.65,
    "category_rationale": "Narrative of regret with questions about domain transfer and SSL; lacks actionable steps.",
    "composite_score": 3.1507212845559813
  },
  {
    "score": 37,
    "title": "Hostgator reusing a purchase approval from 2004 to steal money from me",
    "selftext": "I hosted at HostGator duringthe early '00's, and continued with a business account for the email until 2015. In 2006 I converted my HostGator usage from personal to private, creating a new business account using only corporate credit cards. In 2015 that business closed, the bank account closed, and I ended my corporate use of HostGator. I just discovered yesterday that HostGator started that business account back up in 2016, without my knowledge, and used a purchase approval from 2004 as the \"approval\". I have all this information from my bank, and this is not going to end well for HostGator. Lawyering up. Fuck HostGator. Fuck HostGator.",
    "subreddit": "webhosting",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 37,
    "downs": 0,
    "created_utc": 1673365688.0,
    "media": null,
    "is_video": false,
    "num_comments": 18,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.93,
    "category_rationale": "Pure emotional tirade against HostGator with insult-laden language.",
    "composite_score": 2.9166603970932243
  }
]