[
  {
    "score": 18,
    "title": "Bing is seriously underrated when it comes to search traffic",
    "selftext": "We’re all chasing that sweet, sweet search traffic, right? And how couldn’t we.\n\nIt’s probably the most “passive” customer acquisition channel out there. Once you rank, it’s basically just free traffic that’s coming in every day.\n\nRanking for intent-based queries is particularly lucrative (e.g., “best credit card”) since the lead is already warm and in purchasing mood.\n\nHowever, in recent years, partly due to the onslaught of AI-generated (rubbish) content and the subsequent reputational risks for Google, it’s become harder and takes much longer to rank.\n\nI’ve seen the change first hand. When I first started blogging in 2017, it was as easy as “publish great content, interlink properly, and watch traffic trickle in almost instantly.”\n\nIf you’re not investing thousands of dollars into link building, it’ll probably take at least 6 months or longer to get some Google love (sandbox) – granted you do everything right and then some.\n\nThat said, if you as impatient as me, there are still a great way to get search traffic early on, which is Microsoft’s Bing.\n\nHere are the stats from my Google Search Console &amp; Bing Webmaster Tools to illustrate the point (from my newest project called terrific.tools, which I launched 3 weeks ago):\n\n·       Google: 48 clicks, 110 impressions, ranking for 4 queries/keywords\n\n·       Bing: 132 clicks, 6k impressions, already ranking for 205 keywords\n\nSo, almost 3x the traffic despite supposedly being the much smaller search engine.\n\nBing offers a bunch of other benefits as well.\n\nFirst, ChatGPT utilizes the Bing index for its own Search product and the main chat, so if you rank on Bing, you’ll also get traffic from ChatGPT (I got around 13 visitors from ChatGPT in the last 3 weeks!).\n\nSecond, Bing is quite popular in tier 1 countries like the US. So, the traffic you get is likelier to be of higher quality / purchasing power.\n\nThird, Bing offers a bunch of free tools within its webmaster tools, which help you to improve pages from an SEO perspective (which will inevitably also help you with ranking on Google). Also worth it to check out IndexNow, which will speed up indexing across other search engines (except Google).\n\nIt’s super easy to get started with optimizing for Bing. Just set up an account and connect your Google Search Console account.\n\nI expect Bing to continue being a great traffic source. Microsoft’s financial success doesn’t hinge on Bing (unlike Google).\n\nIn fact, because Google is entrenching itself into Microsoft’s money-making categories (the whole Google Office products like Sheets or Google’s Cloud product), I expect Microsoft to continue doubling down on making Bing better for both users and creators alike.\n\nSo, tldr, eff Google, check out Bing.",
    "subreddit": "webmarketing",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 18,
    "downs": 0,
    "created_utc": 1734365786.0,
    "media": null,
    "is_video": false,
    "num_comments": 6,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.3013026209599574
  },
  {
    "score": 19,
    "title": "Here’s What Happened In February 2023 In Marketing &amp; Advertising (It’s changed)",
    "selftext": "#Meta: \n\n* Meta shared 2022 Earning Report &amp; It’s vision for 2023. \n* Meta delays setting team budgets as it plans to cut more employees. \n* Whatsapp working on new feature to transcribe audio messages to text. \n* Meta’s adds more data to “Why Am I seeing this Ad” prompts, to increase Ad Transparency. \n* Meta launched Paid Subscriptions for Facebook &amp; Instagram. \n* Meta Tests Product Promotions in IG group chats. \n* Meta Highlights how they are working on improving Facebook’s penalty system. \n* WhatsApp is also supposedly working on a newsletter feature. \n\n#Instagram: \n\n* Instagram Notes are now available to users in Europe &amp; Japan. \n* Instagram expands Gifts to all creators in United States. \n* Instagram tests “Memory” prompts to increase user engagement. \n* Instagram launched WhatsApp like “Channel Broadcasts” for Creators &amp; Brands, You can join waitlist. \n* Instagram is getting rid of live shopping this month. \n* Meta is launched Paid Subscriptions for Facebook &amp; Instagram. \n* Instagram testing User location listings on reels clips. \n\n#Google:\n\n* Google Updates Search Console Video Editing Report. \n* Google announced it’s new AI Bot “Bard” in Google Paris Event. \n* New Updates to Google’s Gambling &amp; games policy. \n* Google Ads API Version 13.0 Now Available. \n* 3 new Google Analytics Updates: New Datasets, Details insights in 360 properties &amp; more.\n* Google Ads launch new CTV Advertising features. \n* Google announced sixth product reviews update for e-commerce. \n* Google updates guidance on helpful content system and discover traffic. \n* Google Ads Performance Max adds Brand exclusions, Page Feeds, Video Creation &amp; More. \n* Google search console and permissions management updated. \n\n\n#Tiktok: \n\n* Tiktok added updated policies for creators with new account enforcement system. \n* Tiktok is testing Refresh, A new feature to refresh your “For You” page algorithm. \n* Tiktok introduces 4 new ways to quickly promote your content on its platform. \n* Tiktok is launching dedicated feeds for specific topics like Food, Fashion and gaming. \n* Tiktok announced new brand safety and suitability partners. \n* Tiktok expands access to it’s research API for independent researchers. \n* Tiktok launched new type of creator fund “Creativity Program Beta”. \n\n\n\n\n#Twitter: \n\n* Twitter will share Ad revenue with Twitter Blue Creators. \n* Twitter Blue expands to six new countries brings back space curations. \n* Twitter ends Co-Tweets, collaborative feature. \n* Elon wants to charge $1,000 per month to companies to retain blue checkmarks. \n* Twitter tests expanded emoji reaction options in DMs. \n* Twitter will charge developers for API access from now on. \n* Twitter tests new quick boost option for tweets. \n* Twitter Blue introduces 4,000 character tweets, says half tweet ads are coming. \n* Twitter will limit 2FA Feature to Twitter Blue Subscribers only from March 20,2023. \n* Ads for cannabis are now allowed on Twitter. \n* Elon promises more positive changes coming to Twitters Ad Platform. \n* Twitter internally cuts off access to slack for employees and also owes stack money for the service. \n\n#YouTube: \n\n* Youtube launched new Comment Filters to make creators find previous comments easier &amp; one other visualisation update. \n* Youtube will allow advertisers to place ads during videos on specific time stamps. It’s game changing! \n* Youtube CEO Susan Wojcicki Is setting down. \n* Youtube adds Feature to reply to comments with Shorts like Tiktok. \n* Youtube announced new commercial Music licensing resource for creators. \n* Podcasts are coming to Youtube Music. \n* Youtube users can now build custom radio stations. \n* Youtube expanded access to let creators dub videos in multi-languages. \n* Youtube adds more Shorts performance insights, updated chat moderation role. \n\n#Snapchat: \n\n* Snapchat added 12 Million Users in Q4 2022 but failed to meet revenue predictions. \n* Snapchat now has more than 2 million paid subscriptions. \n* Snapchat to Use Ray Tracing to Make AR lenses more realistic. \n* Snapchat rolls out new sounds feature to make content creation easier. \n\n#Pinterest: \n\n* Pinterest Announces new video collaboration with Publisher Condé Nast. \n* Pinterest shares slip on Q4 2022 revenue and weak forecast. \n* Pinterest is testing 5 Minutes length for Idea Pins. \n* Pinterest relaunches Pinterest e-learning Academy. \n* Pinterest partnered with UC Berkeley Center for a research about affects of Pinterest on consumers. \n\n#LinkedIn: \n\n*  LinkedIn Announced new Feed Features, Newsletter Scheduling &amp; One-click subscribe for newsletters. \n* LinkedIn will soon give users ability to choose their content viewing preferences on profiles. \n* LinkedIn added new Features to make newsletters grow faster &amp; easy-to-subscribe. \n\n#Marketing: \n\n* Microsoft discontinues bid modifier for audience ads. \n* Open AI launched Tutorials site + New Subscription plans for ChatGPT. \n* Amazons Ad business grew by 19% last quarter more than Google &amp; Microsoft. \n* Yahoo shutters SSP &amp; narrows focus on Ad buyers. \n* Wendy’s first to test Roku, Doordash deal around shoppable TV Ads. \n* Getty images sues stability AI for copyright infringement. \n* Twitter rival Mastodon shows declined growth despite the regular concerns about twitter. \n* Microsoft’s New Bing is planning on Bringing AI Ads soon. \n* Spotify will launch a Tiktok like feed for it’s users to get more user engagement. \n* Reddit Ads now support five new currencies: AUD, CAD, EUR, GBP, NZD. \n* Discord’s Stage Channel just got a major update. \n* Twitch now lets streamers tag channels in Stream titles. \n* Microsoft Advertising unveils lodging solutions, and adds 11 new Google imports market for Smart Campaigns. \n* Clubhouse launched new feature called “Mutuals” to make networking easy during calls. \n* Twitch launches “experimenting hub” to inform creators what they are working on. \n* Walmart Ad sales hit $2.7B as executives eye greater scale. \n\n\n***Thanks for reading. If you Liked this, Consider subscribing to my weekly newsletter (link in my bio) where I share updates with sources &amp; More Researches launched in marketing.***",
    "subreddit": "webmarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 19,
    "downs": 0,
    "created_utc": 1678117425.0,
    "media": null,
    "is_video": false,
    "num_comments": 4,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.4005149978319906
  },
  {
    "score": 15,
    "title": "How do you promote new brands on Threads that have just entered the market?",
    "selftext": "I’m trying to figure out the best way to grow on Threads organically, because now it feels impossible. Every time I post, the feed is flooded with bloggers from Instagram and TikTok who already brought their huge audiences over. \n\nI’ve been experimenting with timing, but I’m not sure if I should schedule threads ahead of time to stay consistent, or if it’s better to just post in the moment. Also curious if anyone here is using social media collaboration tools with a team for Threads yet, or is it still too early for that kind of setup?\n\nAre there any strategies or formats that actually help smaller accounts stand out against the wave of big names moving in?",
    "subreddit": "webmarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 15,
    "downs": 0,
    "created_utc": 1757597603.0,
    "media": null,
    "is_video": false,
    "num_comments": 12,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.511091658809343
  },
  {
    "score": 14,
    "title": "I built a free tool to access a 165k+ influencer database",
    "selftext": "Managing influencer campaigns was much harder than it should have been. \n\nI spent hours sorting through cold DMs, messy spreadsheets, and various tools instead of putting my plans into action. \n\nThat's why I created GrabHunt, a tool that connects you with over 165,000 influencers on LinkedIn, TikTok, Instagram, and YouTube.\n\n* Filter by platform, niche, follower count, and location.  \n* Track outreach, DMs, briefs, and payments, all in one place. \n\nI’m currently offering free early access to web marketers while I collect feedback.  \n\nIf you work in influencer or creator outreach, this could save you a lot of time.  \n\nComment below if you want the link, and I’ll send it via DM.    \nI’m also happy to hear any feedback. I built it out of personal frustration while running campaigns.",
    "subreddit": "webmarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1754377608.0,
    "media": null,
    "is_video": false,
    "num_comments": 21,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.5973025994667847
  },
  {
    "score": 14,
    "title": "What are some effective strategies for increasing email open rates?",
    "selftext": "Hi everyone,\n\nI’m looking to improve my email marketing efforts and specifically boost open rates. I’ve been experimenting with different tactics, but I’m keen to hear what strategies have worked well for you.\n\nHere are a few areas I’m interested in:\n\n1. Subject Lines: What kinds of subject lines have you found to be most effective?\n2. Personalization: How do you personalize emails to increase open rates?\n3. Timing: What timing strategies have worked best for you?\n4. List Quality: How important is list segmentation and how do you manage it?\n\nHere’s my emailing stack for context:\n\n* **WarpLeads**: Unlimited export leads\n* **Reoon**: Email verifier\n* **Mailforge**: Email infrastructure\n* **Smartlead**: Go-to email sender\n\nLooking forward to your tips and best practices!\n\nThanks!",
    "subreddit": "webmarketing",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 14,
    "downs": 0,
    "created_utc": 1721203644.0,
    "media": null,
    "is_video": false,
    "num_comments": 13,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.4541552768948005
  },
  {
    "score": 13,
    "title": "Help me understand the new AI search features and how to build a strategy now. (And what are the best AI search visibility tools)",
    "selftext": "Hey everyone! I run a small content-based website that’s been doing okay in organic traffic for a few years now, mostly blog content and some affiliate stuff. But lately, I’ve noticed some weird changes in traffic patterns that I can’t really explain.\n\nI keep hearing about “AI Overviews” and “AI Mode” in Google, and honestly… I’m not sure I even understand what that means for my site. Like, does my content still rank the same way? Or is Google now just answering people directly without showing links?\n\nI’m also wondering how do you even check if your site is showing up in these new AI things? Are there any tools for that? Maybe some of the best AI search visibility tools or what... Right now I’m just guessing.\n\nAlso, are people changing how they write content for this? Is the SEO strategy totally different now?\n\nI’ve seen a few posts about best tools for tracking LLM visibility, but not sure what’s actually useful vs hype.\n\nSorry if this sounds dumb - just trying to wrap my head around all this and maybe get pointed in the right direction. Appreciate any help.",
    "subreddit": "webmarketing",
    "upvote_ratio": 1.0,
    "subreddit_type": "public",
    "ups": 13,
    "downs": 0,
    "created_utc": 1753099110.0,
    "media": null,
    "is_video": false,
    "num_comments": 15,
    "num_reports": null,
    "over_18": false,
    "category": "",
    "category_confidence": null,
    "category_rationale": "",
    "composite_score": 2.4981880270062002
  }
]